[{"section_title": "INTRODUCTION", "text": "A recent f(JCUS in nearshore research has been large-scale coastal behavior (LSCB, THOJ{NTON et al., 2000), changes in nearshore hathymetry and beach topography with spatial scales of order kilometers and temporal scales of order years. It is at these scales that decisions are made in coastal zone management and at these scales that improvement to scientific understanding is needed. In order to accurately quantify the variability of large-scale coastal changes and to obtain a clearer understanding of the processes driving these changes, detailed measurement of large-scale morphology over regional scales is required. While change occurs over the entire active profile, the horizontal location and movement of the shoreline are two of the most commonly chosen variables of large-scale beach morphology and serve as direct indicators of erosion and accretion. Topographic maps IUSGS Quadrangles and NOS Topographic Sheets), rectified aerial photographs, and traditional beach profiles have been the most common source for long-term, large-scale measures of shoreline position (DOLAN 1'1 al., 19HO I. These historical shoreline locations are often compared to present shoreline locations to calculate rates of long-term shoreline chang». Because of their long record length, maps O!06! rccciicc! ,() Muv :!OOf: «ccvpt,«! in recision 5 Fcbrua rv :!ltO:!. and aerial photographs are invaluahle Il1 quantifying longterm shoreline change."}, {"section_title": "Traditional Shoreline Proxies", "text": "Quantification of shoreline location, or the interface between the land and the water, usually involves a number of assumptions. Therefore, all estimates will have error associated with both the technique for measuring shoreline position and the assumptions made regarding the definition of the shoreline. Traditional methods using aerial photographs for shoreline measurement often involved non-stereo photography that has no vertical information. In this case, relationships must be assumed between some identifiable, horizontal feature and its assumed vertical elevation. For coastal change applications, the location of the high water line IHWL), defined as the landward extent of the last high tide (ANIlEI{S and BYI{NES, 1991;C!(()WELL ot al., 1991;DOLAN e! al., 19HO;STAFFOIUl, 1971), is commonly used to mark the position of the shoreline. Often the HWL may be difficult to identify or may appear as a gradational zone of change. Here, other physical features, such as the wet/dry line, (C!(()WELL ct al., 19911, vegetation line, drift line, or dune line (Motrro», 19911 are used as a proxy for shoreline location. This leaves the determination of the location of this feature to t.he judgment of the operator IA\"IJI,: ItS and BYI{NES, 19911 and it may often be confused with the latest swash excursion, a debris line, an erosional scarp, or changes in sediment type or color (Cl{O\\VELL et al., 19911. Since the relationship of these proxies and an actual tidal datum 111ay vary depending on wave height, beach slope, storm surge, and sediment size (DOLAN ct til., 1980), errors can be potentially large and cannot be easily quantified."}, {"section_title": "Techniques for Identifying Shorelines", "text": "The earliest historical shorelines are available from maps dating back to the late 1800's (ANI>EHS and BYHNES, 1991). Topographic maps are most useful for cxarniniru; long-term trends in shoreline change since the maps are produced infrequently, limiting the amount of detail that can be obtained about short-term physical processes. Errors in shoreline location derived from maps may be attributed to surveyor error in identifying the shoreline feature, distortion of source maps (folding, tearing, shrinkage), and changes in the reference datum (ANDEHs and BYI{NES. 1991 L Since the 1920's, aerial photographs have been used to document shoreline position and change (ANDEI{S and BYl{NES, 1991 L Aerial photographs are first transformed to map coordinates using ground control points and then a proxy for the shoreline is digitized (CI{OWELL ct al., 1991). Aerial photographs were generally collected more frequently than maps were made and, therefore, may be used to develop a more detailed understanding of short-term shoreline variability. For unrectified aerial photographs, accuracy within or between images is limited by scale differences (caused by aircraft altitude changes), by camera geometry, by ground relief (CRO\\VELL et al.. 1991;DOLAN et ol., 1980;HAPKE and RICH-:YIOND, 2000), and by the precision of the digitizing equipment and of the operator in following the trace of the HWL (ANDERS and BYRNES, 1991l. Since the errors in measuring a shoreline from aerial photographs are not independent, cumulative errors may be large. CHOWELL et al. (1991) estimate the total (operational) combined error for 1:10,000 scale, non-tidal coordinated, aerial photography to be .~7.6 m, not including errors associated with inaccurate interpretation of the location of the HWL. Many of the errors associated with aerial photographs can be eliminated or reduced before features are identified within the image by using recent techniques involving softcopy photogrammetry where digital stereo images are used to georeference the image and remove distortion (HAPKE and RICH-MOND, 2000), Elevation contours are generated on the photograph through the creation of a digital terrain model and shoreline position, or a specified contour, can be measured from the stereo pair (OVEKI' ON and FISIlEI{, 1996). The accuracy of the extracted features depends on the known camera parameters, flight elevation, accuracy of ground control points, and the resolution of the image (HAPKE and RICH-:\\IOND, 2000). While the use of accurate digital images eliminates much of the error associated with aerial photographs, the process of identifying a shoreline and then extracting it from an image is very lahor intensive and makes the analysis of large areas more difficult. Shorelines have also ber-n rneasured from ground-hased surveys of cross-shore profiles of beach elevations. Si nee these surveys are relatively inexpensive to perform, closely spaced profiles can be collected frequently and used for detailed studies of short-term variation in shoreline change over a limited region (MoHToN, 1991 l. Whil« ground-has(•d profiling techniques may yield an accurate muasure of xhorr-line location, the rneasurcments are spatially limited due to the intensive labor requirement of profi] ing. More rccc-ntlv. shoreline position has been measured using vchiclc-mou ntcd, ground-based GPS (global positioning system J surveys. AIlterrain vehicles equipped with C}PS antennae can quickly survey shore-parallel and shore-normal profiles (MO\\{TON ('( al., 1993), a single transect along the length of the beach ( 100 km or more in length) (LIST ct al., in press J, or a complete. detailed mapping of beach topography (4 km or mure in length) (PLANT et al., 1996;Ruc(;IEHO ct al., 1999;Rll(;(;II<:I{() and VOJ(;'!', 2000). Horizontal accuracy of shoreline positions measured using these techniques depends on, among other things, CPS accuracy, proximity of survey lines to the exact location of the shoreline, and beach slope. For example. using the vehicle-based mapping systems, on a beach with a 1:50 slope, the horizontal error in position is approximately 2.5 to 5.0 m (RUGGIERO et al., 1999). While the spatial coverage of the vehicle-based GPS ground surveys can be very extensive, it is still somewhat limited compared to the capabilities of an airborne system. Recent developments in GPS and scanning airborne laser capabilities have made available extensive data sets of fully threedimensional beach topography. These highly accurate and spatially dense surveys allow the possibility of rnaking an objective and detailed determination of regional-scale shoreline position. Using laser data to quantify shoreline position and change over regional scales will contribute to an improved understanding of large-scale coastal behavior on both long-term and short-term (storm) scales. Our objective is to develop a technique for measuring shoreline position from laser altimetry data. First, we describe the details of the lidar system and the lidar shoreline extraction technique. We then discuss the results of the ground truth test in the Outer Banks of North Carolina in September 1997. Additionally, the advantages and limitations of lidar data as a measure of large-scale shoreline position are illustrated through examination of three data sets of shoreline position collected at Assateague Island, Maryland/Virginia. Finally, we examine the statistics and longshore variability of the response of the island to the northeaster storm season of 1997-1998 using lidar-derived shorelines and beach slopes."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Airborne Topographic Mapper", "text": "NASA's Airborne Topographic Mapper (ATM) is a scanning laser altimeter originally developed to study climate change by mapping changes in the thickness of the Green land ice sheet (KI{ABILL et al., 1995). Recently the ATM has b('(ll1 mounted in a Twin Otter aircraft and used for mappinj; coastal change and assessing storm impacts on subaerial be (lcht,s (KI{l\\BILL et al.. 2000: SALLE:\\(~EI{ et 01.. 19991)). Th« A'I'M SUl'-vcys eleva t ion wit h a blu e-gr een la ser reflect ed t owards th e bea ch usin g a rotating m ir ror th a t produces a n ellipt ica l scan pattern. Th e ATM on ly records t he first reflecti on of th e la ser so returns a re a lso obtaine d fro m th e su rfa ce of th e water. C PS det e rmines a ircra ft posi t ion a nd a n in e rti al na vigation syste m IINSI mea sures th e a ircra ft's pitch , roll, a nd Ill'ading li( IL\\I\\lL L ('I al., ImJfiI. Th e pro cess of derivin g ole-\" a t ion mea suremen ts fro m t he ATM sys te m is expla ined in S.\\I.I.I•::\\(:1':1: l'i al. Iin pr ess I. Eleva tion da t a ca n be obta ined a t a r.uc of fiO-70 km!h r t bnscd on a n a irc raft s pee d of IIO-l fiO kn ots and mul ti-pa ss cove rage I. In a five-hour fligh t m ission , tilt' ATM ca n com pletely cover 2fiO -:~fi O km of coa st with four ove rla ppim; pa sses , y ield ing a ty pica l combine d swa t h wid th of ()OO -700 m. Parti all y overl appin g pa sses a rc flown to fully cove r t he region of interest. to e lim ina te g'ap s in t he da ta , a nd t o inc reas e data densi ty. Th e footprint, a nd s ubs eque nt hori zontal resolu t ion , of th e la ser is a pproximate ly one meter in diam et er a nd an ind ividua l la ser s hot is collecte d eve ry 2 m-. Th e ATM beach su rv eys pro vid e a den se da ta se t of s ubaeria l bea ch top ogra phy wit h both large s pa t ia l cove rage a nd high s pa t ia l resolu ti on . Exte nsive t ests of t he vert ica l accu racy of t he ATM in strumon t we re conducted during the Sa ndy Duck Nearshore Procl's ses Exp er ime nt (Sn ndy lIuck ) a t t he U.S. Arm y Corps of Enginee rs Field Research Fa cili ty IF RF ) in Du ck, NC from Septe m ber t o Octo ber HJ97. Seve ra l GPS gro und-ba se d s u rvevs of t he bea ch were com pared to ATM s u rveys ofth e sa me area . Th e root -mean-square t rm s ) ve rt ica l error a t t r ib uted to till' ATM wa s l fi em ISALI.I•:]\\(;I•: I{ ct a!. , in pr ess ). Thi s represe nts a tot al e rro r cs t.ima te th at includes tilt' man y potentia l SO UITes of e rro r a nd bias fin' th e lida r sys te m. Ba sed on thi s elTor es t ima te a nd a typic al bea ch slope 01'0.1, we ca n ex pect to obta in hori zon t a l shore line accuracy of 2: l. fi m, a n order of magn itu de bett er th an typi cal accuracies a ssociated with s horr-lino« from non -stereo ae ria l ph otograph s . Th erefore, th e lidar da t a may om 'r a n n lter nat. ivc to t he t ra dit iona l techniques fin' mea surin g sh ore lines by eas ily providing object ive l'st ima tes th at a n ' s pa tia lly ext ens ive. sy no pt ic, a n d of s u fficiunt accu rac y to reso lve a wide ra nge of bea ch va r ia bility (hor izonta l cha nges in shore line posi ti on :> 2.1 m )."}, {"section_title": "Shoreline Extraction from Udal' Profiles", "text": "TIl(' techn iqu e fill' extracting shore line position , .v.. from ATM data is st ra ightfilrw a rd . For a ny parti cul a r longshore locut ion . .\" ' , a cross-sho re pr ofile is extracted from th e irregularl y s paced fu ll data se t. Dat a from a 2 m wid e band a rou nd t he profile loca ti on (v ' :':: Lm ) a re included in th e in dividua l profil «. TIl(' cross-shore pr ofiles a n ' extracted a t a ny cons ta nt longsh ol\"(' s pa cing . r/y. Ir/y = 20 m a nd 10 m for t h is work I chose-n to resol ve a parti cul ar sca le of longshore vari abili ty. Tllt'se pr ofiles a lso a llow deter min a tion of ot h er import an t beach pa rameters s uch as beach slope a nd t he location a nd e levation of t he berm , du ne ba se, a nd dun e crest. After th e pro files h a ve been created , a ny eleva ti on da tum , z, or e levat ion-ba se d definition of shore line , ca n be extracted . l.ida r data conta mina ted by waves a nd runu p arc first eliminated from eac h profil e by remo vin g all of t he data points t hat lie sea wa rd of th e intersect ion of th e water (ident ified by th e noisy la ser return s, see Figure l a ) a nd bea ch. Along eac h lid ar pr ofile, t he data are limi ted t o a vertical ra nge (ty picnllv :'. O.fim l a round th e s pecifi ed elevation datum (Figu re I a I. Th e ra nge a rou nd th e datum may be site s pecific a nd s hou ld be selecte d t o minimi ze err ors due to laser da t a in th e for esh ore a rea tha t st ill may be some what conta mina te d by return s from wav e runup. A lin ear reg ress ion is t he n fit t h rou gh th es e da ta with bench e leva t ion, Z\". a s th e ind ep en- Th e s lope of t he foreshore region , [3, is a lso di re ctl y mea sured on eac h profile as t he slope of th e regr ession t h roug h t he da ta a rou nd Z \" Thi s pro cedure is repeated in th e longshore fill' eac h profile to create a map of shoreline loca tion . Typi call y , t he re a re a s ma ny a s I fi-20 la ser s hots on a pr ofile with in th e ran ge of t he s hore line datum , res ulting in a statist ica lly robu st regr essi on a nd es t imate of shoreline posit ion . Hori zontal er ror bars, 0\" on .r, (Figu re lb ) repr esent th e Hfi' lr con fidence interval on t he mean va lue based on a St udent's t di stribution of th e er rors with N-2 degr ees offreedom (where N is th e number of points in each regr ession ), Th e er ror bars represen t t he sca tter pr esent in th e data a nd accoun t for th e ra ndom e r ror (noise I of th e sys te m. Th er e may a lso be bi a ses, un accounted fill' in t hese error ba rs . whi ch may in clude, bu t are not limi ted to: bia s in th e ran ge walk correction of th e in strum en t , bia s in th e INS da ta , in strumen t mountin g bia s , or a low-fr equ en cy drif t oft he GPS syst em s t sec below, as well a s SALLI';N( ;EIl et al. (in press) for deta ils )."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Ground Truth Testing", "text": "T he s hore line ext ract ion techniqu e wa s test ed using la ser a lt imetry dat a collect ed on th e Oute r Hanks of Nort h Ca rolin a in September 19H7 as a part of th e Sa ndy Duck ex pe rimen t. Th e data used in t he filliowing exampl e we re collected al on g a fifi km stretc h of coa st bet ween Coro lla an d Ore gon Inl et (Figu re 2, lower len ) on Se ptembe r 2(i. 19~17 . Relatively st ra ight. sa ndy, barri er island beaches cha racterize thi s coast line . Beach s lope s, a s mea sured from lidar data, ranged from O.Ofi t o 0.11, with a mean va lue of O.O H. Th e wav e conditi ons on t hi s day, mea sured by a wav eridor buoy in 18 m of wate r at th e FRF in Duck , NC, were rela ti vely ca lm wit h a deep -water wav e heigh t . II\", of 0.fi7 m a nd a peak wav e peri od of 7.() s . As a part of th e Sa ndy l ruck ex pe r iment. CPS-b a sed grou nd s u rveys were cond ucted, pro vid ing a n opport u nity to groun d t rut h s horelines mea sured usin g lidar data . Using a GPS a nd in clinom et er-equ ipp ed a ll-terra in veh icle (ATV), LI ST et al . (in pr ess ) mea sured t he e leva t ion a nd beach slope a long one longshore t ra nsect from Coro lla to Oregon Inl et. Fr om t hese tw o mea surem ents, th e location of t he NOAA defin ed mean hi gh wa t er (MH W, z; = O.2() m NAVDHH) lin e wa s ext ra polated from t he ATV elevation ba sed on th e mea sured bea ch slope . Error ba rs on hori zontal sh oreline loca t ion a rc deri ved from th e eleva t ion of th e driven t ra ck a nd an estimated va riabili ty of th e mea sured bea ch slope. Det ail s of t h is tech-.lou rn nl of (' oa, tal i{\",,•al'ch . Vol. II>. 1'\\ 0. :1. :wo~ .S 0 1~: The hori zontal positi on of t he lidar (ATM) shoreline, xs~, t Jy), wa s compa red to t he SWAS H shore line , x , _ \" \"\" .,,(y ) to test t he accuracy of t he technique. Th e shoreline position deri ved from lid ar profiles compa res well to the SWASH shoreline with an rms differ enc e, (tix ) ,_ \",., of 2.9 m (Figure 3). Ba sed on th e rectan gul ar coordinate system used, posi ti ve va lues of tix, ind icate t ha t t he Jidar shoreline is genera lly sea wa rd of th e SWASH shore line; t he mean offset , tix\" between the t wo shore lines was 2.12 m. Th e longsh ore distribution of shore line posi ti on differen ces between t he t wo systems, . 1x•. an d thei r combined error bars are shown in Figure 4a . In t he nor th ern pa rt of the st udy region, th e differen ces bet ween th e two techniques a re not sta tistica lly significa nt becau se t he 95% confidence in ter val for the differ enc es lies a round zero. In the sout hern part of th e st udy regio n, where the lida r shore line tends to fa ll se award of th e SWASH shore line, th er e a re more sign ifica nt differ ences bet ween the two sys te ms. Th is may be pa rtiall y du e to lidar data poin t s includ ed in t he polynom ia l fit th at are act ua lly ret ur ns off of wa ve ru nu p rather tha n t he a ctua l bea ch surface. Wh ile most of the returns from the wa ter's surfa ce are remo ved from th e profile pr ior to shore line ext ra ction , a few conta mina te d retu r ns sometimes remain within th e ran ge of Z . , Th is may ser ve to fla tt en out the regr ession an d pull x«,\",,,, (y ' ) sea wa rd. Ano th er reason for t he sea wa rd bias may be d ue to ext ra pola tion er rors wit h in the SWASH da ta ca used by th e la rge distan ce bet ween t he MHW contour a nd t he t rac k dri ven tho ATV on thi s parti cula r day. Estim a ti ng t he loca tion of t ho MHW line by ext ra polating along a stee p slope th at may tcnd to fla tten lower in th e profile will ca use the loca tio n of t he shore line to fall more la nd wa rd t han it t ru ly is. Th e beach slopes used in t he SWASH sys te m for t he extra pola t ions were comp ared to foresh ore slopes measured directly around t he shore line verti cal da tum usi ng the lida r da ta. In loca tions where t he slope used by SWAS H was stee per t ha n t ha t measured a roun d z; by the ATM , t he la rgest discrepa ncies betwee n t he tw o systems occu r with SWASH estima tes falli ng more la nd ward of t he ATM shoreline. Figure 4b sho ws th e longshore st r uct ure of t he indi vidual £.1.'1'01' ba rs for eac h syste m . The mean hori zontal error bar, 1' >\" fill' x,\"\"\", was :.' ..: 1.4 m . These error bars represen t t he random noise of the syste m a nd robust ne ss of t he data used in the regre ssion . For th e lidar-deri ved shorelines, th e la rgest e rror bars occur on pr ofiles where only th ree data points wer e used i n t he regr ession a nd th e R\" va lue of th e regression was low. This occur red in areas of low data den sity where th ere we re a n in suffi cient number of lida r da ta points to clea rly define the for esho re. Th e mean error ba r for X , _\" m , J\" based on assumptions of the typ ica l vari ations in f), was z 1.7 m (L IST et al ., in press ). For the SWASH system, erro r bars a re calcul at ed dir ectly from slope a nd dista nce from th e datum ; henc e, th e er ror bars a re la rger on fla tter beaches and in loca tions whe re th e vehicl e drove far th er away from the datum . Exten si ve com pa r isons of individual, raw ATM an d SWASH data points rev eal a mean vertical differen ce, LlZ h , betw een th e two of 8.7 cm (SALLENGER et al. , in pr ess ). Thi s vertical diffe renc e is t hou ght to be primarily du e to a low  . ."}, {"section_title": ". 'l)", "text": "'. . .  ed by wave runup on the February 9, 1998 profiles, the total water level (the tide level, II, plus the runup due to waves) was calculated for each survey date. The elevation of the total water level represents a maximum, not mean, total water level due to the superposition of wave crests. The 2fJr exceedence values for runup estimates, R:!((, were based on an empirical formulation of HOLMAN (1986), () is the Iribarren nurnber, and L() is the deep-water wavelength. Foreshore beach slope, f), was measured from each lidar profile. Data on wave height and period were obtained from NDBC station 44009 located outside of Delaware Bay. Tide data were obtained from NOAA tide gauge 8570283 located near Ocean City Inlet, Maryland. Wave heights and tide levels during the February 9, 1998 survey (H() = 3.0-2.5 m ) were both greater than that during the other two surveys (H()~0.7 m on September 15, 1997 and H;~LOrn on April 3, 1998). The total water elevation on February 9, 1998 during the lidar flight was 3.04 m, well above the elevation of MHW, 0.31 m NAVD88 (Figure 5b). Since the MHW datum was obscured in the February 9, 1998 data by elevated tide levels and large wave runup, z; extracted for the Assateague data set was 0.81 m (0.5 m above MHW), which still lies on the acti ve foreshore of the beach. Shorelines were calculated from all three data sets along the 60 km stretch of beach at profiles spaced 10 111 in the longshore. (The 10 m spacing was selected for a different application of the data in which smaller scale shoreline features were studied.) Figure 6 illustrates two example profiles from Septernber 1997 and February 1998. The large scatter seaward of x = 550 m is due to the reflection of the laser off of the water's surface. Since data passes are combined, the surface appears more like noise than actual waves. Along this profile, a well-defined berm was completely eroded and the shoreline recessed 32.4 ± 0.8 m. Shoreline change was computed for all 5730 profiles between September 1997 and February 1998 ( Figure 7, black line) to examine the spatial variability of the response of the beach to the extreme storm events on January 28, 1998 and February 5, 1998. Error bars, indicating the 95(lr confidence interval about each estimate of shoreline change, were calculated as the rms of the combined variance of the two individual measures of shoreline position. The mean shoreline change indicates approximately 28.6 ± 0.02 m of erosion: however, there is substantial spatial variability in the data (standard deviation of shoreline change, (f(~x), = 16.2 m l, ranging from nearly no net change to a maximum of~150 m of erosion. The shoreline position calculated from the April 1998 data set shows that the post-storm beach had started to recover to the pre-storm conditions (Figure 7, gray line). The mean shoreline change during this two-month recovery period was approximately 13.5 ± 0.02 m of accretion (f(~x) = 11.0 m ). Both storm and recovery curves of shoreline change show the frequency drift inherent in both the ATM and SWASH GPS systems. This low-frequency drift is specific to GPS systems, in general, and is not particularly well understood or documerited. Based on a mean GPS drift of 8.7 cm and a mean beach slope of 0.08, the site-specific, horizontal error attributable to low frequency drift is on the order of ± 1 m. (This horizontal GPS drift error is separate from the system noise error discussed above.) Since the GPS drift error has been realized just recently, the amount of drift at different sites generally will not be known. Several tests of stationary GPS systems (separate from the lidar GPS equipment) have been performed in different parts of the country and reveal a low frequency vertical drift of 6 to 8 cm over an hour period (SAL-LENCEI{ et al., in press). Based on this estimate, we feel the 1 m horizontal drift error is a conservative estimate and may be smaller in some locations. The total vertical accuracy of the ATM system (15 cm ) is a bulk estimate representing all potential error sources, including this GPS drift (SALLEN-(;EH et al., in press). Details of the comparisons between the raw data points and of the GPS drift can be found in SALLEN- (;EI{ et al. (in press) and KRABILL et al. (in press). The vertical offset between the raw ATM and SWASH data contains a trend that decreases to the north. In the southern region of the study area~ZIJ = 12 em while in the northern region~ZIJ 2 CITI. In order to examine the robustness of the technique and the ideal, expected error in the absence ofGPS low frequency drift, the longshore trend in vertical differences due to the drift was removed from the lidar elevation data. The corrected X,,_aill/yJ was then compared to x\"~\"II({\"I,(Y) which, for our ground truth study, represents the 'real' shoreline position. The corrected lidar-derived shoreline position closely agrees with the SWASH-derived shoreline with an rms differenco, (~x)\"/II'\" of 1.49; however it is still somewhat seaward of'the SWASH shoreline;~x\" = 0.44 m. Reasons for this seaward bias are explained above."}, {"section_title": "Application to Shoreline Change", "text": "The technique for extracting shoreline position from lidar profiles was applied to laser altimetry data collected on Assatcague Island in 1997 and 1998. Assateague Island is an undeveloped stretch of barrier island along the eastern shore of Maryland and Virginia (Figure 2, upper right). The moderately straight coastline is marked by areas of relatively high dunes alternating with low-lying areas that are frequently overwashed during large storm events. Shoreline position was measured over 60 km of coast from three lidar data sets. The first was collected on September 15, 1997 (1600-1900 G-MT) before the start of the winter storm season. The second overflight was on February 9, 1998 (1600-1900 GMT), after the passage of two major northeaster storms where maximum wave heights exceeded 7 m (SALLENCER et al., 1999a). Two months later on April 3,1998 (2200-2300 GMT), a third survey was conducted that documented the initial recovery stage for the island. The tide level and wave conditions during the February 9, 1998 ATM flight were much higher than conditions during the other two surveys ( Figure 5). In order to quantitatively assess whether the MHW contour was seriously contarninat- No, :3, 2002  4 , -----,-----,-------,--,------, ---, ----,----------,, ----,-- , .., I \", :. \" , \" \" ,: \" . , . \" I I ' > I, .\" . , \" ' ) 1\"\" \" , , ' oL. 00 :00 02:24 04:47 07 :12 09 :36 12:00 14:24 16:47 19: 12 21:36 00 :00 hour (GMT) Figu r e 5. Wav e height, t ide level , a nd tota l runup durin g t he t hre e Assa te a gu e !idar fligh ts on (a ) Septembe r 15, 1997 , (b) Feb ru ary 9, 1998 , and (c) April 3, 1998. Tot al runup elevatio n of Fe bru ary 9, 1998 wa s muc h h igh er th a n durin g th e other two flights , ma k in g th e ext ract ion of th e MHW con to u r (z = 0.3 1 m) ver y difficult on thi s day . Th e so!id h ori zon t al ba r in ea eh pa nel in dicate s t h e t ime dur in g wh ich t h e !id ar data were collected . sa me order oflongshore va ria bility a nd th e sa me ge ne ra l pa ttern. Thi s is shown by a negative correla tion betw een th e two shore line cha nge curves with a n R\" va lu e of 0.27, whi ch is significant for th e 95% confide nce interv a l (N = 5 170, R\"S<N = 0.001 ). Thi s spa tial pattern of erosion a nd accretion wa s not docum ented until re cently a long th e Outer Banks, Nor th Ca rolina a nd Ca pe Cod, Massachusetts by LIST a nd FARR1S (1999). Th e a dvent of th e Iidar sys te m mak es it possibl e to reveal t his typ e of beha vior over la rge areas a nd provides a mean s to st udy th e long shore vari ability of coastal change. Another measure of beach morphology th at ca n be easily obtai ne d from th e laser alt ime t ry data is beach s lope, (3 , calcula te d from the reg ression in t he shore line ext raction tec hniqu e. Th e spatia lly den se data a llows us to measu re th e spatial variation of beach slope over la rge a reas . Figure 8 pr esen ts th re e probability den sity fun ctio ns of bea ch slope cal-cula te d along Assatea gu e Isla nd from lidar da ta. Th e pr e-winter bea ch slopes (Fig ure Sa ) a re nor ma lly distribu ted with a mean valu e, 13, of 0.13 (sta nda rd devia tion of (3 , (r((3 ), = 0.034). After th e winter's northeast er storms, th e slopes were redu ced significa ntly, 13 = 0.054 ((T((3) = 0.029 ), as the bea ch resp ond ed to large wave events ( Figure Sb). The April 1998 slope distribution reveals th at th e bea ch is slowly recovering as indi cated by the steepening slopes, 13 = 0.08 ( T((3) = 0.032 ), a nd th e in cre asingly Ga uss ia n dist ributio n ( Figure   Sc), Wh ile these observations are not un expected , the collection of such a n exte ns ive se t of slope and shoreline da ta at such hi gh a ccuracy is unpreced ented . discussed , lid a r s hore li nes ca n be u sed to s tu dy the largesca le impacts of storms on bea ches . Accurate mea sures of la r ge-scal e, st or m-ind uced beach cha nge , with confid en ce intervals, ca n be det ermined using lidar s ur veys collect ed before a nd a fte r stor m eve nts ii.e. Fi gu re 7). Bea ch recovery can a lso be examined u sing lid ar data colle cte d som e pe riod after the pa ssage of the s tor m . Profil es that a re very closely s paced in t he lon gsh ore will ma ke fu ll use of th e den se three-dimensiona l lida r da t a a nd ca n be used to r eso lve smalle r sca le det a ils of beach to pog r a p hy and morphologic cha nge. Multiple lida r s horelin es fro m one location can a lso be used to determ ine t he na tura l va r ia bility of t he sh ore line posi ti on . S t udies of long-term , large-scal e shore li ne ch a nge a re a noth er possib le u se for the Iida r sho re lines. Accurate rates of shor eli ne ch a n ge a re of g rea t in t e rest tod a y to coa s t a l sc ienti st s, e ng inee rs , a n d pla n ners. A se t of profiles extracte d from lidar data collecte d during ca lm wea ther con diti ons ca n be used to quickly a n d accu ra te ly determine th e pr esen t loca tion of the sh oreline. T he s ho re line can be compared t o his torical sh oreline positions as mea s ure d fro m ph otographs or map s to calc u la te ra tes of sh ore line cha nge ."}, {"section_title": "DI SC USSI O N", "text": "Wh en con sid ering the diffe ren t u ses for Iidar-derived s horelines , t he pro per se lect ion of th e vertica l datu m becom es imp or ta nt . On e of th e major a dva nces of t he tech nique discu ssed in thi s pap er is that s ubj ect ivity is rem oved from sh oreli ne determinati on si nce the exa ct location of any vertical da tum for th e sh oreline (MHW, MHHW, eic . ) ca n be easily a n d a ccurately foun d . The s pe cific da tu m selecte d dep end s on t he ultim a t e u se of the lid a r -deri ved s horeli n es. If the lidar s horelines will be com pa red to hi s tor ical sh ore li ne s m easured a s we t/ dry lin es from ae ri a l pho togra phs or map s, th e n a vertica l da tum t h a t ma y serve as a pro xy for t he digi t ized wet/dry li n e shou ld be se lect ed . Howe ve r , s uch a ve rt ica l da-tum is not clea rl y defi ned m a kin g it difficu lt to qua nt ify t he precise ele va t ion of we t/d ry line (see previous discussio n ). If lid ar s hore lines are t o be used in conjuncti on with contou rba sed sh ore lines mea sured from ortho -rect ified ph otogr aphs or ground s u r veys , t hen th e sam e sh ore lin e da tu m shou ld a ls o be u sed to defin e a lid ar s hore line . With thi s tec hniq ue an y relev ant da tum ca n be ex t ra cte d fro m the data a nd used to st u dy coa st a l ch a nge . In order to obta in t he mos t a ccurate es t im a te of th e horizontal loca t ion of the s hore line da tum , it is importa nt t o ha ve den se sa m pling of th e fore sh ore region . The la rgest err or bars on s hore line loca ti on occur alon g profiles with spa rse data du e to poor lidar return s. Th is probl em could be im proved by crea t ing wid er cr oss-sho re profiles u sing a la rger swa t h r egion, perha ps rt 2 m. For thi s tech n ique to produce acc u ra te estim ates, it is esse nt ia l that th e data be collect ed duri ng low ti de and t ime s of low wa ve en ergy . High t ides , la rge wa ves , stor m s urge , a nd r u n-u p m ay obscu re t he location of the ve rtica l da t um , z., pa rt icul arl y if t he datum is very low on th e beach face ii.e. MH W). If z, lies ben eath th e wa te r surface or the effect of wa ves a nd run-u p, it m ay be nec essary t o look a t cha nges occurrin g a t a da t um h ighe r on t he bea ch face. However, if a s pecific s hore line datum, su ch as MHW, is required , it may be possibl e to ex tra pola te to ide ntify t he cro ss-sh or e loca t ion of th e s hore li ne, x., using methods simila r to LIST et al. (in pr ess). F ut ure work includes expa n ding t hi s tech ni que to a llow for ex t r a pola t ion to t he loca ti on of the s hore line da tum . We re cognize t hat reducing t h e lid a r data se t t o pr ofiles to fin d shorelin es is not th e only wa y to ex tr act the s horelin e posit ion from the da ta . Oth e r re sea rch g roups te.g. R EVELL et al., in press) locate t he pos it ion of t he sh ore li ne by ex t ract ing a contou r fr om previou sly gridde d data. While shore line s 9/ 15/97 to 2/9/98 2/9/98 to 4/3/98 accretion 150 1 ----,---------, -----, -----  . Shoreline change for Assat eagu e mea sured from lidar-deri ved shoreli nes . Shore line chan ge betw een Se ptembe r 15, 1997 a nd Feb rua ry 9,1998 (black line) shows mean eros ion of 28 .6 1: 0.02 m with a large am ount of longsh ore va riab ilit y. Sh oreline cha nge mea sured betw een Feb ru a ry 9, 1998 a nd Apri l 3, 1998 shows mean accre tion of 13.5 :!: 0.02 m with simila r longsh ore vari ability. Verti ca l erro r bars indica te th e 957< confidence inter val about ea ch est ima te of shoreline cha nge. from these t ra dit iona l griddi ng tech niqu es a re commonly used an d accepted, they do not readily allow for confidence in ter val s to be place d on th e est imates of position . Thi s will ultima tely limit the applica bili ty of t he shoreline data an d subseque nt measures of shoreline change. Fu ture work will exa mine alternate gr idding tec hniques, such as the qu a dra ti c loess smoot her, whi ch produce er ror su rfaces in a dditio n to th e gridded field (S CHLAX an d CHELTON, 1992). Th e error surface can t hen be used to pla ce confidence intervals on measures of shoreline an d bea ch volume change derived from these grids."}, {"section_title": "CONCLUSION", "text": "An objective technique has been developed for t he ext ractio n of accurate and det ail ed shoreline position from ATM laser da ta . Th e da ta from one ATM fligh t can prov ide es timates of shore line positi on spa ced as closely as se vera l meters in th e longshore a nd over la rge ex panses (h undreds of kilometers) of coas tl ine. While th e extensive record lengt h of historic top ographic ma ps an d aeria l ph otograp hs provide s a rich data se t for mea suring long term shoreline cha nge , the pr ecision a nd accuracy of the lida r shorelines allow for more reliabl e measurement of shore line change over shorter time periods. Lidar shorelines can be also used to es ta blish more accurate shoreline positions for fut ure monitoring of longter m shoreline tren ds. Lida r pr ofiles are extracted from t he full t hree dimensional data set a nd a lin ea r regress ion is fit to t he da ta points wit hin a specified range a bout the vertica l shoreline eleva tion. Th e fu nction is eva luated at t he ver tica l datum to determine th e cross-shore loca ti on of shoreline position. Fore shore beach slope is mea sured dir ectly from the lin ear fit. Error bar s on shoreline posit ion re pr ese nt t he 95% confidence interva l on ea ch estima te ba sed on t he Student's t distribution of t he errors of the regression . The a ccuracy of th e lida r-derived shoreline wa s test ed by comp aring it to a shore line mea sured using gro und -based C PS techniq ues. Th e ground-based SWASH method an d air-based ATM method agr ee closely wit h an r ms difference of 2.9 m (l.49 m excluding a CPS dr ift) . Th e longshore-a ver aged hori zontal er ror ba r for sho relines extracted from Iida r da ta wa s :!:: 1.4 m for th e Outer Banks a nd :!:: 1.1 m for Assatea gue Island. To illu strate th e power of t hi s technique , Iida r-d er ived shoreline s were used to assess large-scale coas ta l cha nge a f- Apri l 3, 1998. Th e norma lly distribu ted pre-win ter beac h slopes (a ) a re shown to significa ntly fla tten out afte r th e winte r storms (b). Th e beach re cover y ca n be see n in th e in crea sin g beac h s tee pness me a su red in April (c) . te r t he winter's northeaster sto rm s alo ng Assateague Isl and. After t he storm s, the mean shore line change a long t he 60 km stretch was -28.6 ::!:: 0.02 m wit h a large degree of a longs hore variabi lity, (r(~x) , = ] 6.2 m . Shor elines mea sured from a surv ey collected after a t wo-mont h recove ry per iod revea l 13.5 ::!:: 0.02 m of accretion « (f(~x) = 11.0 m ), Th e longshore varia bility and dist ribution of bea ch slopes are a lso revealed in th e lida r data. The tech nique showed t hat t he mean bea ch slope decreased from 0.13 to 0.054 over t he study ar ea . Th e beach wa s shown to sta rt recovering from t he winter 's storms as t he distribution of bea ch slope became increasing ly Ga ussian an d t he mean va lu e increased from 0.054 to 0.08 . Using the lid a r-derived shore line s, t he longshore va riability in t he large-scal e response of t he coastli ne to storms can be accurately quantifi ed which may lea d to a mor e comp let e und ersta nding of la rge-sca le coastal processes."}]