[{"section_title": "", "text": "The Baccalaureate and Beyond Longitudinal Study (B&B) tracks the experiences of a cohort of college graduates who received their baccalaureate degrees during the 1992-93 academic year and who were first interviewed as part of the National Postsecondary Student Aid Study. The experiences of this group in the areas of academic enrollment, degree completion, employment, public service, and other adult decisions will be followed for about 12 years. The B&B 1993/97 survey is the second in a series of four planned followup interviews of students from this cohort. Data were collected from 11,192 individuals in 1997 through telephone and field interviews. This report describes the study methodology. The first chapter provides an overview of the B&B study. Chapter 2 describes the B&B sample design for the initial, first followup, and second followup studies. Chapter 3 describes the preparation for the data collection process, and chapter 4 details the data collection process. Response rates are discussed in chapter 5, and chapter 6 evaluates the interview instrument. Chapter 7 considers study weights and design effects development. As the B&B study unfolds, it will provide information on: (1) educational attainment and outcome; (2) access to graduate and professional schools; (3) rate of return on educational investment; and (4) patterns of preparation for, and engagement in, teaching. Appendixes comprising almost 90% of the document include a list of technical review panel members, list of variables, survey instruments, and other support material.    Tables and Figures   Table 2.1.--Transcript and CATI eligibility of those retained for follow-up after B&B:93194 6      Table 6.2.--Reliability of interviewer coding using on-line coding programs Table 6.3.--Item nonresponse for items with over ten percent nonresponse Table 7.1.--Final weight distributions Table 7.2.--Weighted (by B&B:93/97 weight Bo) B&B:93/97 response rates by strata Table 7.3.--Weighted (by B&B panel weight Bo) PANEL response rates by strata Table 7.4.--Design effects for all respondents -B&B:93/97 Table 7.5.--Design effects for female respondents -B&B:93/97 Table 7.6.--Design effects for male respondents -B&B:93/97 Table 7.7.--Design effects for black respondents -B&B:93/97 Table 7.8.--Design effects for Asian respondents -B&B:93/97 Table 7.9.--Design effects for Hispanic respondents -B&B:93/97 Table 7.10.--Design effects for white respondents -B&B:93/97 Table 7.11.--Design effects for respondents from 4-year public institutions -B&B:93/97 Table 7.12.--Design effects for respondents from 4-year private institutions-B&B:93/97      Table 7.20.--Design effects for panel respondents from 4-year public institutions -NPSAS:93, B&B:93/94, and B&B:93/97 Table 7.21.--Design effects for respondents from 4-year private institutions NPSAS:93, B&B:93/94, and B&B:93/97 Table 7.22.--Comparison of summary statistics of B&B design effects Table 7.23.--Respondents with \"valid\" or \"missing\" responses, by gender Baccalaureate and Beyond Longitudinal Study 93/97 Second Follow-up Methodology Report Tables and Figures (cont'd)   Table 7.24.--Respondents with \"valid\" or \"missing\" responses, by interview date 69 Table 7.25.--Percent of respondents with \"valid\" or \"missing\" responses, by race/ethnicity 74 "}, {"section_title": "Purpose of the Study", "text": "The Baccalaureate and Beyond Longitudinal Study (B&B:93) tracks the experiences of a cohort of college graduates who received their baccalaureate degree during the 1992-93 academic year and were first interviewed as part of the National Postsecondary Student Aid Study. This group's experiences in the areas of academic enrollments, degree completions, employment, public service, and other adult decisions will be followed for about twelve years. Ultimately, B&B will provide data to assess the outcomes of postsecondary education, graduate and professional program access, and rates of return on investment in education. The National Center for Education Statistics (NCES) of the Office of Educational Research and Improvement (OERI), U.S. Department of Education, is conducting B&B to comply, in part, with its mandate in Section 404(a) of the National Education Statistics Act of 1994, Title IV of the Improving America's Schools Act of 1994, P.L. 103-382, which states: The duties of the Center are to collect, analyze, and disseminate statistics and other information related to education in the United States and in other nations, including 1collecting, acquiring, compiling ..., and disseminating full and complete statistics on the condition and progress of education at the pre-school, elementary, secondary, and postsecondary levels in the United States, including data on ... o student achievement at all levels of education; ... o educational access to and opportunity for postsecondary education, including data on financial aid to postsecondary students; o teaching, including data on course-taking, instruction, the conditions of the education workplace, and the supply of and demand for, teachers, which may include data on the proportions of women and men, cross-tabulated by race or ethnicity, teaching in subjects in which such individuals have been historically underrepresented; o the learning and teaching environment;... conducting longitudinal studies as well as regular and special surveys and data collections, necessary to report on the condition and progress of education; . . ."}, {"section_title": "Analytic Objectives", "text": "As the 1992-93 cohort of college and university graduates advances through adulthood, the effects of undergraduate education will become increasingly important. These include the effects of attending different types of colleges and universities (comprising different undergraduate programs, curricula and levels of academic achievement) on outcomes such as access to jobs, enrollment in graduate and professional programs, and the rates of return for the individual and society from investments in postsecondary education. The B&B study provides data to address issues in four major areas of educational policy: educational attainment and outcome; access to graduate and professional schools; rate of return on educational investment; and patterns of preparation for, and engagement in, teaching. 1 0 1 Baccalaureate and Beyond Longitudinal Study 93/97 Second Follow-up Methodology Report 1) Educational attainment and outcome. Continuing education, further degree completion, and entry into the work force are central to attainment and outcome assessment. Questions in this area include: After completing a degree, how long does it take to enter the work force or the next level of postsecondary study? How many degree recipients fmd work immediately that requires that level of education? How long does it typically take to obtain a position related to the major field of study? Does the required time differ by degree attained? Does it differ by field? How often and for how long are people who completed a baccalaureate degree unemployed? Is unemployment related to field of study? How does the level of educational debt incurred for the completion of undergraduate work affect decisions concerning graduate school, employment, and family formation? 2) Graduate and professional program access. When graduates decide to enter into graduate or professional school after completing the bachelor's degree, they encounter many of the same access and choice questions they faced when they initially entered into postsecondary education. In many areas, people must complete the graduate program to fully participate in the field. In other areas, graduate education enhances the ability to advance in the area, but is not required. The concern, of course, is that those who wish to continue their education beyond the baccalaureate level have the opportunity to do so. Questions to be addressed in this area include: What are the rates of graduate school application, retention and completion? Are people who want to enter graduate school immediately after completing the bachelor's degree able to do so? Why do some graduates delay entry into graduate or professional study? Do these persons persist in seeking to enter and do they succeed in entering later? Are those who want to enter graduate school after gaining some work experience able to do so when they planned, or are they further delayed? Do they carry out their original plan or later decide against graduate school? How long do they delay entry? What proportion of students who have no plans for graduate school at the time they complete the bachelor's degree later change their minds and attempt to enter graduate school? Do these persons have the access they would have had if they had attempted to enter graduate school immediately after completing the bachelor's degree? How long does it take to complete a graduate degree program? What is the level and amount of graduate debt incurred and how does this differ by type and level of degree obtained? 2 11  3) Rate of return. Rate of return refers to the financial payoff or other value of the bachelor's degree relative to the expense in time and money of obtaining the degree. B&B examines the rates of return from postsecondary education from the perspectives of both the individual and society. From the perspective of the individual, the rate of return can be measured in terms of monetary reward and personal satisfaction. From the perspective of society, rate of return can be measured in terms of the contribution a student makes to the nation's productivity as well as through community involvement and public service. From the perspective of both the individual and society, rate of return can be gauged by the adequacy of the individual's preparation for entry into work and community service and by the individual's acquired ability to gain from and contribute to that experience. Specific questions include: How does employment status and salary differ over time by major field of study and level of degree obtained? How many enter the work force full time in the area for which they are qualified? How long do they remain in that profession? Does this vary by level of degree? Do those who enter public service positions advance in their jobs at the same rate as those in other areas? Does this vary by level of degree? How frequently do degree completers change jobs or careers? Does this vary by level of degree? Does this vary by time since degree completion? Does the degree to which people volunteer vary by degree completed? Does it vary by length of time since degree completion? What proportion of bachelor's degree recipients are able to work effectively and advance in their work without additional schooling? What obstacles are encountered that can only be overcome by additional education? 4) Patterns of teaching. Another important feature of the B&B project is that the sample has been designed to facilitate the study of elementary and secondary school teaching careers. Data will be used to monitor the supply and demand characteristics of the labor market, and career patterns, of teachers, including movements into and away from this profession over time. Many of the same issues discussed earlier, concerning initial aspirations and expectations versus ultimate decisions, will be examined. Additional considerations include measuring quality, noting comparative values, and measuring monetary returns to teaching. Specific questions include: What proportion of college graduates will become teachers, continue to teach, stay in an education-related field, or pursue other careers? What distinguishes college graduates who enter the teaching profession as their first career from those who are attracted to it later in life? What is the rate at which teachers change careers, and how does it compare to careerchanging patterns of other professionals? How satisfied are teachers in their careers versus those who are employed in other occupations? What are the potential sources for new teachers, that is, where do those who enter teaching come from (and, of those who left it, where do they go)? 1; 12 How do teachers compare with non-teachers along the lines of gender, race-ethnicity, and socioeconomic backgrounds? In summary, B&B will contribute to a comprehensive statistical investigation of educational policy issues and help to fulfill NCES's mission, to report on the condition and progress of American education in all its aspects. In recognition of its broad mandate, NCES has expanded its data collection program to investigate educational experiences beyond the traditional span of postsecondary education. Baccalaureate and Beyond, with its wealth of data on the consequences of postsecondary education, will contribute to the study of education as a lifelong process."}, {"section_title": "Study Design", "text": "The B&B:93197 survey is the second in a series of four planned follow-up interviews of persons who received a bachelor's degree in the 1992-1993 academic year. Baseline data for the B&B cohort were collected as part of the National Postsecondary Student Aid Study (NPSAS:93). The first follow-up interview (B&B:93/94) collected information from respondents one year after they received their bachelor's degree; the second follow-up (B&B:93/97) collected data four years after bachelor's degree receipt. The next interview is planned for nine years after graduation. By the time of the fmal interview, most students who attend graduate or professional schools should have completed, or nearly completed, their education and be established in their careers. Data collection for the second follow-up of Baccalaureate and Beyond took place from April through December of 1997. The B&B cohort was comprised of 11,192 individuals who were determined eligible for follow-up in 1997. Respondents were interviewed using one of two computer-assisted-interviewing (CAI) systems. The majority of interviews were conducted by telephone interviewers located at a central facility using a computer-assisted telephone interviewing (CATI) system. These interviews were completed between April and July of 1997. The remaining cases were completed by field interviewers using a computer-assisted personal interviewing (CAPI) and case management system (CMS) that was loaded into their individual laptop computers. Most of these interviews were also conducted by telephone but some were administered in person. These cases were completed between July and December of 1997. "}, {"section_title": "B&B Sample Design", "text": "The B&B sample design represents all postsecondary students in the United States who completed a bachelor's degree in the academic year 1992-93 (AY 93). The B&B:93/94 sample was a subsample of the students selected for the 1993 National Postsecondary Student Aid Study sample, a nationally representative sample of all postsecondary students. The B&B:93/94 sample of baccalaureate degree graduates includes those students in the NPSAS:93 sample who were identified by the institution or during the student interview as having completed a bachelor's degree in the 1992-93 academic year (July 1, 1992through June 30, 1993. All NPSAS:93 sample persons who satisfied the subsample requirements were included in the B&B:93/94 sample irrespective of whether these persons were respondents or nonrespondents in NPSAS:93."}, {"section_title": "2.1", "text": "Original NPSAS:93 Sample Design The NPSAS:93 survey employed a stratified two-stage sample design with postsecondary institutions as the first-stage unit and students within schools as the second stage. To be eligible for inclusion in the sample, an institution was required to satisfy all of the following conditions: offer an educational program designed for persons who have completed secondary education; offer an academic, occupational, or vocational program of study; offer access to persons other than those employed by the institution; offer more than just correspondence courses; offer at least one program requiring at least three months or 300 clock hours of instruction; and be located in the 50 states, the District of Columbia, or Puerto Rico. A total of 1,386 postsecondary institutions were sampled for NPSAS:93; 143 were deemed ineligible based on the criteria outlined above. Of the 1,243 eligible institutions, 88 percent participated by submitting lists of students for selection into the NPSAS:93 sample. Within participating institutions, students eligible for selection into NPSAS:93 were those who were attending the sampled institution and were enrolled either in courses for credit toward a degree or formal award, or in a degree, occupational, or vocation program of at least three months' duration. A total of 82,016 students were selected for the NPSAS:93 sample, with a fmal eligible sample size of 79,269. In addition, NPSAS:93 included students in each institution who received a baccalaureate degree between July 1, 1992 and June 30, 1993. (Students who had completed degree requirements prior to July 1, 1992 but had not attended classes after that date were also eligible.) For more details on the original NPSAS:93 sample design, please see the Methodology Report for the National Postsecondary Student Aid Study, 1992-93 (Loft, et al., 1995 From the NPSAS:93 sample design, 16,316 baccalaureate degree recipients were identified. These students were identified using institutionally provided lists of students who filed for graduation or who indicated having graduated in the 1992-93 academic year during the CATI interview. All 11,810 of the identified students who completed the NPSAS interview were retained for B&B. Student nonrespondents for which NPSAS parent data were available were also retained (372 cases). A ten percent subsample of the remaining eligible cases with at least some data (either data from the institution or partial CATI data) were also retained, for a total of 12,731 eligible cases. During the data collection period, it became clear that many of the NPSAS nonrespondents retained for B&B were ineligible for the study. Due to the costs involved in contacting ineligible respondents, it was decided to select only a subsample of the NPSAS nonrespondents as potential members of the final B&B sample. All finalized cases and those with pending interviews were excluded from subsampling. Of the remaining 453 cases, a random selection of 200 cases were kept. This sub-sampling process decreased the B&B sample size to 12,478. After data collection for the first follow-up was complete for both the interview and transcript components, additional cases in the initial sample were found to be ineligible for B&B. More details on how transcript and CATI eligibility were determined can be found in chapter 6 of the Baccalaureate andBeyond Longitudinal Study: 1993/94 First Follow-up Methodology Report (Green et al., 1996). People were retained for follow-up in later rounds if they were found to be eligible in either the CATI or the transcript component. Therefore, 10,080 CATI-eligible cases were retained for follow-up plus an additional 1,094 transcript-eligible cases. In addition, 18 cases for which eligibility was unknown for both components were retained. Below, table 2.1 shows the eligibility status for each person according to the transcript and B&B:93/94 CATI components (separately). All together, 11,192 cases were retained for future rounds, including the second follow-up. For the second follow-up, the number of interviews completed was 10,093--more than were completed in the first follow-up, despite the fact that 23 of the first follow-up respondents had since died. Table 2.2 below shows the full response patterns for all 11,192 B&B sample members. This table describes each type of response combination to the three rounds of the survey (starting with NPSAS:93) and provides frequencies for each description. As shown, a full 83 percent of the sample responded to all three rounds; these 9,274 respondents are classified as the B&B panel. (The description of the weighting procedures for the panel weight is included in chapter 7.)  response rates by institution type. However, this table has two differences. First, due to the very small number of private, for-profit school students, these students are not shown separately from the private, nonprofit school students. Second, the private schools with first-professional students are separated from those private schools with only doctoral students and below. Panel members focused on considerably shortening and revising the instrument based upon the results of the B&B:93/97 Field Test. Items were dropped mainly for lack of reliability or usefulness. Topics for descriptive reports were identified and then used as a guide to determine which questionnaire items could be dropped and which should be retained, revised or clarified. Most of the items excluded from the second follow-up main study instrument were from the demographic section. These included questions about high school grades, income of other household members, other sources of household income, respondent's access to computers and their driver's license number. A few items were also eliminated from other sections, such as questions about tuition and fees for schools attended after baccalaureate degree receipt from the sample school. The most extensively revised portion of the instrument was the teaching section. A new definition of what constitutes the 'teacher pipeline' was used to redesign the initial filter questions for this section. Additionally, the teaching section was moved to precede the employment section so that data about teaching jobs were collected before data about other (non-teaching) jobs. The intended effect was to reduce respondent burden from the earlier round, when data were first collected about all jobs, and then again about teaching jobs. Other revisions to this section included focusing on the most recent spring term (as opposed to academic year) in which the respondent taught, and adding specific items about itinerant and \"support\" teaching positions.' Some items in other sections were also targeted for revision or clarification. Instead of asking for the respondent's first and second choice graduate schools, the second follow-up instrument gathered more general data about graduate applications and types of programs to which the respondent applied. Based on the assumption that a larger proportion of sample members would be attending post-baccalaureate school, items were added to gather data on the respondent's status in graduate or professional programs. Suggestions arising from the TRP meeting were utilized in making revisions to the instrument. .1 summarizes the flow of cases through the major activities--interviewing, locating, refusal conversion--in the B&B:93/97 survey. As shown, case records for the sample were loaded into the CATI telephone number management system (TNMS) and delivered to interviewers. Cases were delivered initially during peak contacting periods which included Monday through Thursday evenings, Saturday mornings, and late afternoon and evening hours on Sunday. A total of 7,139 cases (64 percent of the 11,162 eligible cases) were completed in the telephone center. An analysis of the case delivery management is presented in section 4.1; CATI production is described in section 4.2. Locating problems were associated with a majority of the cases. Prior to being loaded into the TNMS, all cases had been sent to a credit bureau database service to obtain updated phone and address information about each sample member. Cases for whom no number was available, either through this process or from an earlier interview, and cases whose updated phone number was subsequently identified as being incorrect, were sent to locating specialists. As Figure 4.1 indicates, 5,881 cases, (53 percent of the initial sample) required this intensive locating while in NORC's centralized telephone facility. About half of these cases were eventually completed in the telephone center; the other half were sent to the field, where 429 additional locating problem cases were identified. Only 2.7 percent of these cases (1.5% of all cases) remained unlocatable; interviews were eventually completed with 86 percent of these sample members. The locating process and results are discussed in more detail in section 4.3.  Calling algorithms. The calling times and case routing schedule set up for the B&B:93/97 sample was based on our field test experiences which suggested that the best times to reach sample members would be Sunday through Thursday evenings and Saturday mornings. Initial calls were not scheduled for Fridays, late Saturday afternoons and evenings, or early during the day on Sundays. However, interviewers worked these hours to service any appointments set up by respondents during these times. The telephone center was in operation from 8:00 a.m. -11:00 p.m. on Monday through Thursday, 8:00 a.m. -9:00 p.m. on Friday, 8:00 a.m. -7:00 p.m. on Saturday and 11:00 a.m. -11:00 p.m. on Sunday. Cases were delivered to interviewers by the TNMS initially up to 13 times before being filed to Location 4, max calls, which indicates difficult-to-reach respondents whose phone numbers have been called several times with no contact made. The weekly calling algorithm reflected the above preference for Monday through Thursday evenings, Saturday mornings, and Sunday evenings. Cases were delivered twice during each evening Monday through Thursday (8), once on a weekday morning (1), once on a weekday afternoon (1), once on Saturday morning (1), and once on Sunday evening (1). If no contact had been made with the respondent after the twelfth call had been made (indicating that the entire algorithm cycle had been covered), the case was reviewed by a supervisor. The supervisor would decide either to send the case back to the floor to be called during an off-cycle period, or to send the case to a locating specialist. The calling delivery cycle was stopped as soon as an appointment was set to call the respondent. From that point forward, appointments determined when the respondent was called."}, {"section_title": "CATI Production", "text": "Data collection began on April 8, 1997. Week-by-week production and cumulative completes are diagramed in figure 4.2. Week two was not only the first full week of production but also the highest week of production, with almost 1,000 interviews completed during that week. While production remained high through week five, averaging more than 700 completed cases per week, by week six the rapidly increasing number of cases requiring the attention of locating specialists was adversely affecting the rate of interviewing production (down to 418). This was due to the need to shift telephone center resources from interviewing to locating activities, and also reflected the additional calls necessary to complete a case since a greater percentage of the remaining numbers were discovered to be either incorrect numbers, refusals, or very busy sample members who were rarely home. By week seven, however, the release of newly located sample members increased production; which remained fairly steady, averaging 525 completed cases per week for the next three weeks, decreasing to an average of 329 completed cases for weeks ten through fourteen before dropping considerably the last two weeks, during which time cases were being transferred to the field (primarily hard refusal cases and locating problem cases which required locally-based or in-person locating efforts or conversion activities)."}, {"section_title": "26", "text": "Baccalaureate and Beyond Longitudinal Study 93/97 Second Follow-up Methodology Report The number of calls per completed case is the best indicator of the level of effort required in the interviewing task. The TNMS tracks every call; writing to a log file the outcome of the call and the date and time of the attempt. The data in the log file can then be used to calculate the level of effort (number of calls) necessary to complete a telephone interview. The average number of calls made in the TNMS to complete a case averaged 18.5 for the B&B:93/97 sample compared to an average of 13.4 calls for the cases completed in the telephone center for the B&B:93/94 sample. These data indicate that a much higher level of effort was required to complete cases in 1997. This was largely due to the much higher number of locating problems encountered (interviewers were much less likely to locate sample members at their preloaded phone numbers or still residing with their parents as had been the case in 1994) and also reflects the busier lifestyles of the majority of sample members who may have more career and family responsibilities than they had three years ago.   0 0.50 0.00 I numbers and addresses; respondent social security and driver's license numbers; undergraduate school (and graduate school, if applicable) attended by the sample member. The system also contained all locatorentered records that indicated which resources had already been used and the results of that usage, including any updated phone and address information obtained for respondents or their parents or contacts. Locating specialists were instructed to use the following resources in the order they appear since the order correlated to their past proven utility in locating field test sample members: 1) all respondent-generated information (E-mails, address corrections from the U.S. post office, any previously-acquired respondent phone numbers); 2) last known telephone number of the parent(s); 2) last known telephone number of other contacts; 3) graduate schools (if applicable); 4) undergraduate institutions/alumna associations; 5) the other two credit bureau updating services; 6) military locating service if applicable; and 6) the Department of Motor Vehicles in the state which issued the respondent's last known driver's license. Some cases remained unlocatable at the close of telephone operations. A record of all locating activities engaged in by the telephone center locating specialists as well as any updated address information acquired for each of their assigned cases was accessible to the field interviewers through the CMS loaded into their computers. Upon review of the CMS call records for their cases, field interviewers could use the resources listed above that had not yet been accessed or could use additional resources because of their regional knowledge not available to the telephone center locators (such as voter registration offices, utility companies, tax assessors offices, churches). Final completion status by locating problem status. Following the protocols discussed above, CATI interviewers were able to find and complete interviews with about half (2,885) of the 5,881 cases identified as locating problems in the telephone center. Ten cases were identified as deceased, fifteen fmalized as hostile refusals, and the remainder (2,971) were sent to the field. An additional 429 cases were subsequently identified with locating problems by field staff. Field interviewers eventually located 95 percent of these sample members (3,232 of the 3,400 field locating problem cases) and completed interviews with 75 percent (2,531) of them. Table 4.1 compares the fmal completion status of cases ever identified as a locating problem versus those for whom locating was unnecessary. Of the 6,300 cases ever identified with locating problems, 86 percent (5,416) were successfully traced and interviewed compared to a 96 percent response rate for those sample members never identified as locating problems. Thus, while locating cases were more difficult to complete than those which did not require this extensive effort, NORC was quite successful in locating and completing interviews with these respondents. The refusal rate for locating problem cases was twice as high as it was for cases never identified as a locating problem suggesting that some locating problems were actually hidden refusals."}, {"section_title": "19", "text": "JLL 2 9 Baccalaureate and Beyond Longitudinal Study 93/97 Second Follow-up Methodology Report "}, {"section_title": "Refusal Conversion", "text": "A total of 1,679 respondents (15 percent of the total eligible sample) refused to complete the interview at some point in the interviewing process. The majority of these cases (1,415 or 84 percent of all refusal cases) were first identified as such in the telephone center. Sample members who initially refused were given a two week 'cooling off' period. These cases were then made available to one of several B&B:93/97 trained interviewers who were experienced at refusal conversion. Each of them had also attended a briefing that included a review of project-specific types of refusals and a round robin practice of exercises in gaining their cooperation. The CATI refusal converters were able to convert and complete 335 of the refusal cases (24 percent of the cases identified as refusals in the telephone center). Thirty cases were finalized as hostile refusals and the remainder (1,050) sent to the field. An additional 264 cases were subsequently identified as refusals by field staff. Field interviewers were eventually able to complete interviews with 60 percent of these sample members (782 of the 1,314 refusal cases sent to, or identified in, the field), obtaining an overall response rate of 67 percent for all cases who had ever refused. Appendix D contains a 20 L 30 Baccalaureate and Beyond Longitudinal Study 93/97 Second Follow-up Methodology Report sample of the conversion letters and data usage document that were used by NORC staff to persuade reluctant sample member to participate in B&B:93/97. Table 4.2 compares the final completion status of those cases who had never refused to those who had initially refused. It is evident that converting those who refused was a difficult task. While NORC interviewers obtained a response rate of 95 percent among those who never refused, they were able to complete interviews with only 67 percent of those who had refused at some point in the production period. While an initial refusal rate of 15 percent for the second follow-up compares favorably to the 20 percent initial refusal rate experienced in B&B: 93/94, the response rate for refusal cases was lower in 1997 than it was for the first-follow-up (67 percent versus 74 percent). This might seem to suggest that the hard-topersuade are becoming more intransigent; however, only 39 B&B:93/97 sample members have been nonrespondents to all three waves of data collection (NPSAS, B&B:93/94, B&B:93/97). In fact, NORC successfully interviewed 501 cases that had been nonrespondents in the first follow-up, and 351 sample members who had been nonrespondents for NPSAS. (See section 2.3 for a detailed discussion about, and table displaying, the combined response rates to the three waves of B&B data collection). "}, {"section_title": "Field Operations", "text": "In mid-July, the telephone center ceased work on B&B:93197 and all pending cases were transferred to NORC's field staff. All were cases the telephone center had been unable to complete because the respondent refused, was evasive, or had not yet been located. (Field staff actually began working a small number of cases in June, as the telephone center began filtering hard refusal and locating problem cases to the field). Field staff received and worked their cases using a laptop computer on which the CAI (computerassisted interviewing) instrument had been loaded as well as the electronic case management system (CMS). The CMS contained all the locating information and call records associated with each case that a field interviewer was assigned as well as information about the current status of each case. Field managers were able to access and review all of the cases assigned to all of the interviewers they were supervising. Field staff. A field project manager, assisted by a district field manager, provided overall task management for this component. Twelve field managers (FM5) were hired to initially supervise fifty-eight telephone field interviewers. Each manager was responsible for a specific geographic region of the United States. In-person field interviewers were later recruited and hired as needed contingent upon the location of cases, and need for locally-based locating work or in-person contact. A total of 112 in-person field interviewers were hired on this as-needed basis for B&B:93/97."}, {"section_title": "Training.", "text": "In mid-June the twelve field managers attended a four-day training and then began working hard refusal and locating problem cases in preparation for their involvement in the training and management of the field interviewers. In mid-July, the central office and field management staff conducted a four-day training for the fifty-eight initial field interviewers. These four-day training sessions consisted of relevant modules from the CATI and locator trainings, with additional emphasis on case analysis, fieldspecific locating resources and procedures, refusal conversion, CMS usage, and field-specific administrative procedures. The field managers then conducted a final mock interview and telephone review with each of the field interviewers assigned to them to ascertain their readiness to begin working their cases. Field production. A total of 4,000 cases (36 percent of the total sample) were sent to the field. The cases were grouped by most-current respondent zip code and then distributed to the geographicallyappropriate field manager. Materials made available for each case included a face sheet with respondent demographic and most-recent locating information, a call history report with notes made by telephone center interviewers and locators describing each contact made with the respondent or locating resource, and a listing of all of the locating resources used and/or available for the case. The cases were then reviewed by the FMs before being assigned to a field interviewer. The cases sent to the field were the most difficult: approximately one-third were refusals, and two-thirds were respondents who were difficult to locate or evasive (cases where the respondent was never available or where gatekeepers kept the telephone interviewer from reaching the respondent). Figure 4.4 shows the weekly and cumulative production rates for the field data collection. The initial completed cases identified for the first week of field production are actually an accumulation of cases completed by the field managers in the month preceding the field interviewer training in Mid-July. The second week is really the first full week of field production. The graph indicates that production rates increased steadily during the first four weeks of full field production as interviewers familiarized themselves with their cases and became increasingly successful at locating, or converting, these problem 22 32 Baccalaureate and Beyond Longitudinal Study 93/97 Second Follow-up Methodology Report cases. Production reached a high of 225 completes per week for week five. The completion rate decreased in the following weeks, averaging 159 interviews per week for weeks six through ten, then decreasing to a low of 73 completed cases for week twelve (early October). Locating problems were the most significant deterrent to field production. Therefore, in early October, project management decided to reconfigure the field structure into task-specific groups to more efficiently handle the problems encountered. Three groups were formed, each headed by a separate Field Project Manager (FPM) who was responsible for staffing, training, and supervising that particular group: 1) a locating group, comprised of field managers and interviewers specializing in locating procedures; 2) an in-person field interviewer group for those geographically-scattered cases that required on-site visits; and 3) a reduced telephone field interviewer group, each receiving a larger case workload to increase efficiency. The FPM for this latter group was also responsible for overall production monitoring and interfacing with the other two groups. The remaining weeks of production (thirteen through twenty-three) reflect the success of this restructuring with an average of about 100 interviews per week thereafter. The field staff were able to complete 2,954 (74 percent) of their total case workload, bringing the final B&B:93197 response rate to 90 percent. Consistent with the daily production reports generated for system monitoring, statistics were reported daily for interviewers' sessions. Daily statistics are presented in table 4.3. Control charts were utilized to track the average number of errors associated with each minute of observed interviewing. Error rates for project staff stayed within the predetermined limits set for the phone center. In _addition, Pareto analysis was utilized to identify the most frequently observed errors encountered in a monitoring session. Taken together, these quality control measures ensured the integrity of the data gathered during data  Response Rates Table 5.1 presents information on the final disposition by mode of interview for all cases that were initially included in the sample. Of the 11,192 cases identified as eligible B&B sample members (through either the interviewing or transcript component of B&B:93/94), 30 were subsequently found to be out of scope or ineligible. The 29 out-of-scope cases were sample members who have died since 1993; one case was identified as ineligible when it was determined that the respondent had never received a baccalaureate degree. Interviews were completed with 10,093 of the 11,162 eligible B&B:93/97 cases, for a final unweighted response rate of 90.4 percent. The majority of interviews, 63.9 percent, were conducted by telephone interviewers located at a central facility using a computer-assisted telephone interviewing system. Less than one percent of cases were finalized in the phone center as non-respondents; these cases were hostile refusals, primarily classified as such due to their threats of taking legal action should they be contacted again. The remaining 4,000 cases (35.8 percent) were then sent to field interviewers who were geographically dispersed across the country. The vast majority of these fielded cases were sample members whom the telephone center was either unable to locate or unable to convert their initial refusals to participate. Field interviewers also used a computer-assisted interviewing system. The system and their assigned cases were loaded into their individual laptop computers; interviews were primarily conducted by telephone but some were completed in-person. Field interviewers completed an additional 2,954 cases, 73.8 percent of all fielded cases, contributing 26.5 percent to the final response rate of 90.4 percent. An examination of the final non-respondents indicates the success of NORC staff's locating and refusal conversion efforts. Just 1.5 percent of the sample--2.7 percent of the locating problem cases--were finalized as unlocatable while only 2.6 percent of the sample were finalized as refusals, compared to 5.8 percent in B&B:93/94. Much of the remaining 5.5 percent non-response is attributable to sample members who were either out of the country or not available at any time during the time frame of the survey. Table 5.2 presents more detailed information on respondents and non-respondents by age (calculated as of 7/1/97), gender, and race. While response rates are similar across many of these demographic subgroups, some distinctive differences exist. Response rates decrease slightly with age (93.1 percent of those under 26 compared to 90.4 percent of those over 30 participated) but participation among males and females is approximately equal. Response rates are also similar among whites, blacks, and American Indians (ranging from 89.5 percent to 91.6 percent) but are substantially lower for Asians/Pacific Islanders (only 82.2 percent) and those identifying themselves as \"other\" (73.8 percent)."}, {"section_title": "27", "text": "Baccalaureate and Beyond Longitudinal Study 93/97 Second Follow-up Methodology Report Final refusal (percent) "}, {"section_title": "Evaluation of Instrument", "text": "One can look at several factors in assessing the efficacy of the survey instrument. Three which will be discussed here are the interview length, the accuracy of interviewer coding when using on-line coding utilities, and the level of individual item nonresponse. Readers may refer to appendix H for a copy of the computer-assisted interview instrument. Appendix E lists all of the items (variables) collected in the B&B:93/97 study, as well as computed variables derived from these data."}, {"section_title": "6.1", "text": ""}, {"section_title": "Length of Interview", "text": "The computer-assisted interview instrument used in this study included several \"time stamps\" which provide data on the average amount of time taken by the respondent to complete each section. Table 6.1 shows the average length of a completed interview for B&B:93/97 at almost 33 minutes (only one minute longer than the average administration time in the first follow-up). When looking at administration time by section, clearly the longest section was that which collected data about employment since the last interview date, with an average time of 11.5 minutes. The next highest administration time (7.5 minutes) was for the fmal section, but this is partially due to the fact that this fmal section was the longest in terms of number of questions. A little over six minutes were spent collecting information about post-baccalaureate education and internships, and an average of about two minutes were spent gathering data on respondents' teaching experiences. Not counting the locating section, which gathered address and telephone numbers for the respondent, parents, and other contacts, the average interviewing time was almost 28 minutes. "}, {"section_title": "Evaluation of On-line Coding Accuracy", "text": "The B&B:93/97 computer-assisted interview instrument made use of five coding programs developed by NCES. These programs were used to code postsecondary institutions (IPEDS), elementary and secondary schools (ELSEC), major field of study, industry, and occupation. The coding programs for industry, occupation, and major required interviewers to enter the brief \"verbatim\" text supplied by the 30 4 0 Baccalaureate and Beyond Longitudinal Study 93/97 Second Follow-up Methodology Report respondent. The coding program then suggested several possible codes and the interviewer was to select the most appropriate code. Using the IPEDS and ELSEC coding programs to code postsecondary institutions and elementary/secondary schools involved searching through a multi-level database of states, cities within states, and finally, schools within the selected city. To judge the quality of the coding being done by the interviewers, NORC performed an export of ten percent of each week's completed cases. The original input and coding results for these cases were loaded into a computer-assisted instrument which was used by specially trained coders. For these programs, the coders were asked to use the verbatim text entered by the interviewer and select an appropriate code. If the code selected disagreed from that originally chosen by the interviewer, the coder was shown the interviewer-selected code and was asked to judge if that code was reasonable or not. The results of this verification process are displayed in table 6.2. Interviewers did a fairly good job in using the coding programs and the differences in coding accuracy between the programs is relatively small. In assessing the major coding, the reasons for the relatively large percentage of \"reasonable but different\" codes, and the smaller percentage of these cases where sufficient text was entered to allow verification, are probably the same. In conducting the survey, interviewers were more cognizant of reducing respondent burden rather than fully documenting a verbatim string. Interviewers had the luxury of being able to verify with the respondent if a question arose about the correct major category, while coders only had the verbatim string from which to work. Additionally, while the industry and occupation coding programs had been greatly enhanced (with more examples for the user, more concise categories, and a more extensive look-up dictionary), the major coding program was still relatively complex. For example, interviewers (and coders) had a choice of 18 different majors grouped under the broad category of \"Health.\" So a broad entry of \"medicine\" or \"nursing\" could bring up as host of possible categories, which the interviewer could select by talking with the respondent. To examine the accuracy of school coding, coders were given the text entered by interviewers when the school named by the respondent could not be found in the coding program. In these cases, coders were asked to judge the completeness of the information entered by the interviewer: was the name, city and state information sufficiently complete so that it can be coded later? Interviewers performed differently depending on whether they used the IPEDS or ELSEC programs. About 94 percent provided sufficient information to allow a later determination of the correct IPEDS code for postsecondary institutions, while only 76 percent provided that level of information in the ELSEC program. Upon further examination of the verbatim text from the ELSEC program, it was discovered that 18 percent of the inadequately documented cases were actually cases in which the respondent either refused to provide, or did not remember, the name of the school. Furthermore, a significant portion of the remaining uncodable cases were due to the fact that the program inserted the text \"*UNKNOWN\" if the interviewer was unable to select the city."}, {"section_title": ", 4 1", "text": "Baccalaureate and Beyond Longitudinal Study 93/97 Second Follow-up Methodology Report "}, {"section_title": "Nonresponse by Item", "text": "One of the goals of B&B:93/97 was to reduce the item non-response, which results from respondents declining to answer the question, or responding that they could not give an accurate answer. NORC accomplished this goal by using a variety of innovative techniques to build respondent rapport, including the use of conversational interviewing. Nevertheless, there were still some items, particularly those requiring the collection of specific numeric figures (e.g., test scores and dates; income figures), that were answered by less than 90 percent of respondents who were asked. These items are displayed in table 6.3.3 Of the approximately 1,800 variables included in the final data set, there were almost 50 items with nonresponse rates over ten percent. Almost half of these items, however, are accounted for by the fact that only five or fewer respondents were asked the question; many of these are the third or fourth iterations of a looped question. Items involving knowledge of specific dates, such as those for emigration, employment, and school attendance were found to have substantial rates of nonresponse; the largest type of nonresponse for these items are the \"don't know\" responses. In most instances, \"don't know\" signifies that the respondent Baccalaureate and Beyond Longitudinal Study 93/97 Second Follow-up Methodology Report had difficulty recalling the information requested and could not provide a number. High levels of \"don't know\" responses are also evident in the items regarding the respondent's education loans and loans of the respondent's spouse. Refusal to answer income and salary questions continued, as in the first follow-up (and in other similar surveys), to be among a significant proportion of the nonresponse items. More specifically, these items included questions concerning academic year base salary of teaching jobs, as well as income from jobs and other sources. These items had a high percentage of refusal responses. Items involving spouse's income, in addition to high refusal responses, had a moderate percentage of \"don't know\" responses. \"Don't know\" responses also accounted for the majority of the nonresponse in items concerning spousal education debt, reflecting what seems to be an overall lack of respondent knowledge of spouse or partner income and debt. In comparison to the findings of nonresponse in the first follow-up, there has been a reduction in the number of items with significant nonresponse. Although still high, the refusal rate of income and salary items has decreased from the first follow-up. This could be explained by the fact that NORC has established enough of a rapport with respondents (the majority of whom have participated in the first round of the survey) to be able to elicit their confidence in answering these types of questions.   Weights and Design Effects Development B&B:93197 final weights were calculated by making a nonresponse adjustment to the baseline B&B weight calculated for B&B:93/94. This baseline B&B weight is an adjustment of the baseline National Postsecondary Student Aid Survey (NPSAS:93) weight. NPSAS:93 sample development and weights  The design effect is defined as the ratio of the variance, corrected for the sampling design, to the variance based on a simple random sample. Most complex multi-stage sampling designs result in a design effect greater than one, that is, the variance of an estimate is actually larger than the variance would be had the data been based on a simple random sample (SRS). To estimate the variance using information about the sample design, it is necessary to use statistical procedures such as Taylor Series approximations, Balanced Repeated Replication, or Jackknife Repeated Replication. For B&B:93/97, NORC used the Taylor Series procedure to calculate the standard errors. The impact of departures from simple random sampling on the precision of sample estimates is often measured by the design effect (designated as DEFF), the ratio of the design-corrected variance to the variance based on SRS assumptions. The square root of the design effect (also called the root design effect, and designated as DEFT) is also useful. The following formulas defmed the design effects and root design effects for this section: DEFF = (DESIGN-SE)2 (SRS-SE)2 DEFT = (DESIGN-SE) (SRS-SE) where DESIGN-SE designates the standard error of an estimate calculated by taking into account the complex nature of the survey design, and SRS-SE designates the standard error of the same estimate calculated as if the survey design was a simple random sample. Standard errors for thirty proportions based on B&B:93/97 data were calculated, both for B&B:93/97 respondents, and for B&B panel respondents (respondents to all three B&B surveys: NPSAS:93, B&B:93/94, and B&B:93/97). Tables 7.4 through 7.12 present estimates of the design effects for these variables for various subgroups of the B&B:93/97 population. The design effects presented in table 7.4 are based on the entire population; later tables present estimates for subgroups by sex, race, and type of school attended. Tables 7.13 through 7.21 present a similar set of tables of design effect estimates for these same 30 variables for various subgroups of the B&B panel respondents. For each variable and group, the table contains the percent estimate, the design-corrected standard error, the standard error for the same percent estimate based on SRS assumptions, the unweighted n, the root design effect, and the design effect. Researchers who use the Data Analysis System prepared for use with B&B:93/97 will find that the program automatically produces design-corrected standard errors. Researchers using the restricted use files are cautioned to use a package (such as SUDAAN or OSIRIS) which can produce the designcorrected standard errors, or to adjust the standard errors computed under simple random sample assumptions, as produced by typical packages such as SPSS or SAS, by multiplying them by the mean root design effect for that subgroup.            Disabilities interfere with work 2.08 0.21 0.20 5,240 1.06"}, {"section_title": "1.13", "text": "Any months with more than 1 job 57.02 0.92 0.70 5,002 1.32"}, {"section_title": "1.73", "text": "Any unemployment since graduation 39.39 0.86 0.67 5,254      Any months with more than 1 job 56.90 0.72 0.57 7,433 1.26"}, {"section_title": "1.59", "text": "Any unemployment since graduation 39.23 0.74 0.55 7,751 1.34 1.79 Applied to grad school since last interview 15.97 0.52 0.42 7,749 1.25"}, {"section_title": "1.57", "text": "Is single, never married 40.91 0.99 0.56 7,727 1.77 3.12 Taken the GRE 6.06 0.33 0.27 7,731 1.23"}, {"section_title": "1.51", "text": "Very satisfied with job's promotion opportunity 38.07 0.74 0.57 7,360    "}, {"section_title": "Nonresponse Bias Analysis", "text": "To assess whether there are differences between groups in the frequency of refusing to answer particular questions, a subset of variables used in the examination of design effects was used in a nonresponse bias analysis. The selected variables are typical of the items found in the data file and are characterized by an overall low rate of nonresponse since this was a computer-assisted interview. Only variables that correspond to direct questions asked of respondents are analyzed here; variables that are constructed or derived are excluded from this analysis. A case is classified as \"valid\" if the respondent provided an answer; a case is classified as \"missing\" if the respondent refused or said he or she didn't know. Percentages are based on the total number of cases to which the question applied. Three sets of comparisons are presented, analyzing nonresponse based on gender, date of interview, and race/ethnicity. The results are shown in tables 7.23 through 7.25 below. The tables present the distribution of valid responses among subgroups, the distribution of missing responses among subgroups, and the standard errors of the proportions are shown in parentheses. T-tests between the percent valid and the percent missing for each subgroup were conducted and significant differences are denoted in bold italics. No significant differences based on gender are evident. Males and females have approximately equal levels of missing data on the items included in this analysis. Significant differences based on date of interview are present for 21 of the 25 variables examined. Cases that were completed during the first three months of data collection have a higher proportion of valid than missing responses to twenty-one items. Differences between the percent valid and missing are also present for cases completed between July and September (significant differences are present for 12 of 25 variables), and those complete from October through December (significant differences are present 14 of 25 variables). Note that the April-June period coincides with the CATI data collection period. Cases that were completed during the July-December CAPI field period had higher levels of missing data than those completed during the telephone interviewing period. While it is possible that this represents a mode effect, it seems likely that it is the result of the fact that difficult cases were completed during the CAPI field period, including respondents who had refused to complete an interview over the phone. The analysis based on race and ethnicity also shows some small level of nonresponse bias. In conducting t-tests between the percent valid and percent missing among white respondents, 13 of the 25 comparisons are significant. For all of these items, whites had high levels of valid data in comparison to missing data. Missing responses seem to be distributed more heavily among non-white than white cases. Again, it should be repeated that the overall level of nonresponse is very low in this data file. The use of CATI and CAPI technology eliminates the respondent error due to incorrect branching that is often found in self-administered questionnaires, and also provides the opportunity for prompting respondents who are initially reluctant to answer a question. The response bias noted here is not sufficiently grave to have a major impact on most analysis. However, it is important to note so that improvements might be made for the next round of data collection.                In a few days, an interviewer from the National Opinion Research Center (NORC) at the University of Chicago will contact you by telephone to interview you. We would like to talk to you as part of the Baccalaureate and Beyond Study (B&B), sponsored by the U.S. Department of Education. As you may recall, you were interviewed for this study three years ago, as part of a sample of recent college gaduates. The Department of Education is continuing this study in an effort to learn more about the choices college graduates make concerning work and the pursuit of further study. During the interview, we will ask you about some of the jobs you have held since your last interview, and any educational programs you have enrolled in since that time. The data we collect about your experiences in these areas are extremely valuable and influence the formation of education policy in the United States. Researchers, authorized by the National Center for Education Statistics (NCES), will combine your data with that of all others interviewed in this study to produce statistical reports for Congress and others. No data that can be used to identify individuals is reported. Please see the back of this letter for information about our uncompromising pledge of confidentiality protection. Federal laws provide stiff fmes and prison sentences for the disclosure of your identity or the misuse of information you provide. Our records indicate that your telephone number is [PHONE NUMBER]. To update this information, or if you would like to arrange an interview at a time of your convenience, please call NORC toll-free (800/241-7357) or send E-mail (B&B2@norcmail.uchicago.edu). You may also contact the NORC Project Director, Dr. Patricia  with specific questions you have about the study or your interview. The enclosed leaflet contains more general information about the B&B study. Anyone wanting more information about NCES and the range of studies it conducts can access the NCES homepage on the Internet (http://www.ed.goviNCES). We thank you for your continuing participation and look forward to talking with you. Sincerely, Paula R. Knepper, Ph.D."}, {"section_title": "Project Officer Postsecondary Longitudinal Studies", "text": "Encl. [MUD]"}, {"section_title": "CONFIDENTIALITY PLEDGE", "text": "As a matter of policy, the National Opinion Research Center (NORC) and the National Center for Education Statistics (NCES), of the U.S. Department of Education, are concerned with protecting the privacy of individuals who participate in voluntary surveys. We want to let you know that: 1. The collection of information in this survey is authorized by Public Law 100-297 and continued under the auspices of Section 404(a) of the National Education Statistics Act of 1994, Title IV of the Improving America's Schools Act of 1994, Public Law 103-382."}, {"section_title": "2.", "text": "We are asking these questions in order to gather information about the experiences of college graduates after they leave college and move on to graduate or professional education, work, or other activities."}, {"section_title": "3.", "text": "Participation is voluntary. You may skip questions you do not wish to answer; however, we hope that you will answer as many questions as you can."}, {"section_title": "4.", "text": "No information collected under this authority may be used for any purpose other than the purpose for which it was supplied. Information will be protected from disclosure by federal statute (42 US Code 242m, section 308d). NCES may authorize only a limited number of researchers to have access to information which may identify individuals. They may use the data only for statistical purposes and are subject to fines and imprisonment for misuse. Data will be combined to produce statistical reports for Congress and others. No individual data that links your name, address, telephone number, or student identification number with your responses will be reported."}, {"section_title": "5.", "text": "All identifying information will be electronically separated from the survey data. Security provisions have been made for the storage of this information. Locator information will be supplied to NCES at completion of the survey for use in future follow-ups. According to the Paperwork lkeduction Act of 1995, no persons are required to respond to a collection of information unless it displays a valid OMB control number. The valid OMB control number for this information collection is 1850.0729. The time required to complete this mfonnation collection is estimated to average 40 minutes per response, including the time to review instructions, search existing data resources, gather the data need4 and complete and review the information collected. Tf you have any comments concerning the accuracy of the time estimate or suggestions for improving the survey instrument, please write to: U.S. Department of Education, Washington, 1) C. 20202.4651. if you have comments or concerns regar<bng the status of your mdividual response to this survey, write directly to, National Center for Education Statistics, 555 New Jersey Avenue, Washington, 1) C. 2020g. BEST COPY AVAILABLE"}, {"section_title": "93", "text": "The second follow up interview, B&B:93/97, will collect information from participants approximately four years after receipt of their bachelor's degree."}, {"section_title": "Interviewers from the National Opinion Research", "text": "Center will start calling B&B sample members this spring. Participants will be asked to provide information about their educational and employment experiences since their last interview. Analyses and reports from B&B:93197 will be available to researchers in 1998. During its fifty-six year history, NORC has preserved the confidentiality of survey respondents. Extraordinary procedures have been implemented in B&B to ensure the confidentiality and privacy of survey respondents. Specifically: All staff with access to study data have taken an oath of nondisclosure which subjects them to possible fines and imprisonment for any disclosure of individual responses."}, {"section_title": "Protecting Privacy", "text": "All electronic data are maintained in secure and protected data files; all personally identifying data is maintained in files separate from files containing descriptive information. Any data released to the general public will be tailored so that it is not possible to identify specific individuals or institutions. Out of labor force (64.3% enrolled in school)"}, {"section_title": "For Further Information", "text": "Nearly three-quarters of graduates were employed full-time one year after graduation. Approximately four percent were unemployed."}, {"section_title": "Salary", "text": "Average salaries for recent graduates varied by major, from $19,000 to over $30,000. "}, {"section_title": "Educational Debt", "text": "About one-half (49 percent) of 1992-93 college graduates had borrowed for their undergraduate education, and among those who did, the average total amount borrowed was about $10,000. One year after graduation, the average amount they still owed on the debt was about $9,000."}, {"section_title": "Teaching", "text": "Twenty-six percent of 1992-93 graduates had either considered teaching, prepared to teach or had taught since graduation. Eight percent (one third of the 26 percent) were teachers in 1994. What do we hope to learn? Future rounds of data collection will help answer more questions on these topics. For example: How does the level of undergraduate education debt affect decisions concerning graduate school, employment, and family formation? How many who enter graduate school persist to completion? How long does it take to complete a graduate degree program? How do salaries differ over time between those who enter the work force directly after receiving their bachelor's degree and those who complete graduate school? How many will become teachers, continue to teach, stay in an education-related field, or pursue other careers? More information is available in two reports from the National Center for Education Studies, U.S."}, {"section_title": "Department of Education:", "text": "A We know that you are busy but we are asking for a minimal amount of time, 20-40 minutes on average, to do an interview by phone. We are merely updating some of the information that you provided when you were last interviewed. Because B&B is a longitudinal study, it is particularly important that you continue your participation. The result of this study will help to provide Congress and the educators who recommend government policy with the information they need to decide on improvements in the quality of education in America. By providing information on your experiences and plans, both in the work force and/or in continuing education, you will have a direct impact on how federal programs might better be targeted to improve access and reduce burden to both the undergraduate and graduate students. Without speaking to you directly, we are unable to ascertain if we are calling the right number, or if you have concerns about participating in the study, and what those concerns might be. Our interviewer is well equipped to answer any questions you might have. We would appreciate a few minutes of your time to explain the study and to arrange for an interview at your convenience. I sincerely hope that we have stressed the importance of your contribution to this study. Please call the B&B Project if you have any questions or if you can give us a time that would be best to call. Please leave your name and your current phone number or a number where we can reach you. The number is 800/241-7357 or send an E-mail to B&B2®norcmail.uchicago.edu. We thank you for your continuing participation and look forward to hearing from you soon. The enclosure contains more information about the B&B study. o How does the level of educational debt incurred for the completion of undergraduate work affect decisions concerning graduate school, employment, and family formation? o Graduates from which areas of study are in most demand in the labor market? o Is there a long-term difference in starting salary between those who complete graduate school and those who enter directly into the work force after receiving their bachelor 's degree? o Do people who entered graduate school immediately after they completed a baccalaureate degree continue to progress and complete advanced degrees as originally expected? Do students who had no plans for graduate school when they completed the bachelor's degree later change their minds and attempt to enter? o How many enter the work force full time in the field for which they are qualified? How long do they remain in that profession? o Do those who enter public service positions, such as teaching, advance in their jobs at the same rate as those in other areas? Does this vary by time since degree completion?  Hours of community service in last 2 yrs Important-becoming authority in field Important-influencing political structur Important-being well-off financially Important-owning own business Important-being successful in work Important-able to find steady work Important-being a leader in community Important-living close to parents Important-get away from area grew up in Important-having leisure time Important-having children Important-give childm better opportuns.   1Grad schl 1 degree prog-assoc. Grad schl 1 degree prog-bachelors Grad schl 1 degree prog-other cert IPEDS ID for grad schl 1 City of 1st choice appl grad schl Grad schl 1 degree prog-doctoral Aid offered by grad schl (1) Highest degree applied in grad schl 1 In-state tuition for grad schl (1) Grad schl 1 degree prog-masters Name of 1st choice appl grad schl Grad schl 1 degree prog-non degree Out-of-state tuition for grad schl (1) Grad schl 1 degree prog-post bacc Grad schl 1 degree prog-professional State of 1st choice appl grad schl Accepted by graduate schl (2) Grad schl 2 degree prog-assoc. Grad schl 2 degree prog-bachelors Grad schl 2 degree prog-other cert IPEDS ID for grad schl 2 City of 2nd choice appl grad schl Grad schl 2 degree prog-doctoral Aid offered by grad schl (2) Highest degree applied in grad schl 2 In-state tuition for grad schl (2) Grad schl 2 degree prog-masters Name of 2nd choice appl grad schl Grad schl 2 degree prog-non degree Out-of-state tuition for grad schl (2) Grad schl 2 degree prog-post bacc Grad schl 2 degree prog- (P) help job search-got recommend letter (P) help job search-money for support (P) help job search-paid for printing (P) help job search-bought (S) clothes (P) help job search-help pay for travel (P) help job search-looked at job boards (P) help job search-cont. employ agency (P) help job search-campus placement (P) help job search-attend recruit fairs (P) help job search-placed want ads (P) help job search-look trade journals (P) help job search-did nothing (P) ( 9) teaching job? Job (10) teaching job? Full or part-time at job 1 Full or part-time at job 2 Full or part-time at job 3 Full or part-time at job 4 Full or part-time at job 5 Full or part-time at job 6 Full or part-time at job 7 Full or part-time at job 8 Full or part-time at job 9 Full or part-time at job 10 Date ended teaching job   schl 2-program short schl 2-got financial aid schl 2-tuition less schl 2-living costs less schl 2-recommended schl 2-can work schl 2-can live at home schl 2-loc. where want to live schl 2-close to home schl 2-liked community schl 2-good reputation schl 2-desired courses schl 2-was accepted schl 2-attended as undergrad schl 2-other Free/reduced tuition at schl 3 Grants/fellowship/stipend at schl 3 Teaching assistantship at schl 3 Research assistantship at schl 3 Loans at schl 3 Employee educ benefits at schl 3 Work study while at schl 3 Amount of aid received from grad schl(3) Selected schl 3-program short Selected schl 3-got financial aid Selected schl 3-tuition less Selected schl 3-living costs less Selected schl 3-recommended Selected schl 3-can work Selected schl 3-can live at home Selected schl 3-loc. where want to live Selected schl 3-close to home   Marital status at time of B&B interview Marital status as of NPSAS int. Row identifier Race Gender Schl 1 degree program-assoc. Schl 1 degree program-bachelors Date began attending oth schl (1) Schl 1 degree program-other cert City of oth undergrad schl (1) Schl 1 degree program-doctoral Date stopped attending oth schl (1) Highest degree enrolled in other schl 1 IPEDS code for oth undergrad schl 1In-state tuition for oth schl (1) Schl 1 degree program-masters Name of oth undergrad schl (1) Schl 1 degree program-non degree Out-of-state tuition for oth schl (1) Schl 1 degree program-post bacc Schl 1 degree program-professional State of oth undergrad schl (1) Type of oth schl (1) Schl 2 degree program-assoc. Schl 2 degree program-bachelors Date began attending oth schl (2) Schl 2 degree program-other cert City of oth undergrad schl (2) Schl 2 degree program-doctoral Date stopped attending oth schl (2) Highest degree enrolled in other schl 2 IPEDS code for oth undergrad schl (2) In-state tuition for oth schl (2) Schl 2 degree program-masters Name of oth undergrad schl (2) Schl 2 degree program-non degree Out-of-state tuition for oth schl (2) Schl 2 degree program-post bacc Schl 2 degree program-professional State of oth undergrad schl (2) Type of oth schl (2) Schl 3 degree program-assoc. Schl 3 degree program-bachelors Date began attending oth schl (3) Schl 3 degree program-other cert City of oth undergrad schl (3) Schl 3 degree program-doctoral Date stopped attending oth schl (3) Highest degree enrolled in other schl 3 IPEDS code for oth undergrad schl 3In-state tuition for oth schl (3) Schl 3 degree program-masters Name of oth undergrad schl (3) Schl 3 degree program-non degree Out-of-state tuition for oth schl (3)  5Type of oth schl (5) Schl 6 degree program-assoc. Schl 6 degree program-bachelors Date began attending oth schl (6) Schl 6 degree program-other cert City of oth undergrad schl (6) Schl 6 degree program-doctoral Date stopped attending oth schl (6) Highest degree enrolled in other schl 6 IPEDS code for oth undergrad schl (6) In-state tuition for oth schl (6) Schl 6 degree program-masters Name of oth undergrad schl (6) Schl 6 degree program-non degree Out-of-state tuition for oth schl (6) Schl 6 degree program-post bacc  7Schl 7 degree program-other cert City of oth undergrad schl 7Schl 7 degree program-doctoral Date stopped attending oth schl 7Highest degree enrolled in other schl 7 IPEDS code for oth undergrad schl 7In-state tuition for oth schl 7Schl 7 degree program-masters Name of oth undergrad schl 7Schl 7 degree program-non degree Out-of-state tuition for oth schl 7Schl 7 degree program-post bacc Schl 7 degree program-professional State of oth undergrad schl 7Type of oth schl 7 STTLON04  STTLON05  STTLON06  STTLON07  STUDMULT  STUDTYPE  SUCCESS  SURROUND  SURVPELL  SURVSTAF  TAYREPBB  TAYSTRBB  TCH2YRS  TCHCRT01  TCHCRT02  TCHCRT03  TCHCRT04  TCHCRT05  TCHENTRY  TCHLNGTM  TCHSCHL  TCHTRAIN  TCHTRN1  TCHTRN2  TCRED01  TCRED01Z  TCRED02  TCRED02Z  TCRED03  TCRED03Z  TCRED04  TCRED04Z  TCRED05  TCRED05Z  TCRED06  TCRED06Z  TCRED07  TCRED07Z  TCRED08  TCRED08Z  TCRED09  TCRED09Z  TCRED10  TCRED1OZ  TCRED11  TCRED11Z  TCRED12  TCRED12Z  TCRED13  TCRED13Z  TCRED14  TCRED14Z  TCRED15 TCRED16  TCRED16Z  TEAASST  TEACH  TEACHTRN  TEACHUNV   TGPA01  TGPA02  TGPA03  TGPA04  TGPA05  TGPA06  TGPA07  TGPA08  TGPA09  TGPA10  TGPA11  TGPA12  TGPA13  TGPA14  TGPA15  TGPA16  TJOB  TOOKACT  TOOKSAT  TOTAID  TOTALBAL  TOTALGRE  TOTCRED  TOTDEBT  TOTEMPTN  TOTINCM  TOTINCOM  TOTINCS  TOTINCSP  TOTLOANS  TOTMONPY  TOTNUMDP  TOTOTHRC  TOTOTHTR  TOTTUITN  TRANDISP  TRANSFER  TRMDATE  TRMNAME  TRMTYPE  TRNBEGDT  TRNCON01  TRNCONO2  TRNCONO3  TRNCON04  TRNCON05  TRNCON06  TRNCON07  Credits accepted from 6th transfer schl Credits accepted from 7th transfer schl Credits accepted from 8th transfer schl Credits accepted from 9th transfer schl ID of the 10th schl with transfer creds ID of the 1st schl with transfer creds ID of the 2nd schl with transfer creds ID of the 3rd schl with transfer creds ID of the 4th schl with transfer creds ID of the 5th schl with transfer creds ID of the 6th schl with transfer creds ID of the 7th schl with transfer creds ID of the 8th schl with transfer creds ID of the 9th schl with transfer creds Year in college, 4th and 5th yr separate Imputed college yr, 4th/5th yr separate Undergraduate class level Year earned other degree (1) Year earned other degree 2Year earned other degree 3Year earned other degree 4Year earned other degree 5 Unadjusted total cost minus total aid Attendance adj student budget minus aid Adjusted budget minus total aid-comp NP Adjusted budget minus grants-comp NP:96 Student budget (FT/FY) minus total aid Student budget FTFY minus total aid Attendance adj total cost minus grants Attndnce adj tot cost minus grants Unadj total cost minus grants (MISSING) Unadjusted total cost minus grants Tuition and fees minus grants Tuition and fees minus grants-comp NP:96 Tuition and fees minus federal grants Adjusted total cost minus federal grants No money available for aid DidnAt apply for aid (P)-family/student DidnAt apply for aid (P)-not want debt DidnAt apply aid (P)-income too high Not apply aid (P)-grades/scores too low Not apply aid (P)-too difficult to apply Not apply aid (P)-not disclose finances Not apply aid (P)-student part-time Not apply for aid (P)-no money available Not apply aid (P)-missed deadline Not apply aid (P)-didnAt know about aid DidnAt apply for aid ( SYRS95  SYRSGR89  SYRSGR92  SYRSGR95  SYRSUG89  SYRSUG92  SYRSUG95  T4AMT1  T4AMT2  T4TCUM89  T4TCUM92  T4TCUM95  T4TOT82  T4TOT83  T4TOT84  T4TOT85  T4TOT86  T4TOT87  T4TOT88  T4TOT89  T4TOT90  T4TOT91  T4TOT92  T4TOT93  T4TOT94  T4TOT95  T4UNS82  T4UNS83  T4UNS84  T4UNS85  T4UNS86  T4UNS87  T4UNS88  T4UNS89  T4UNS90  T4UNS91  T4UNS92  T4UNS93  T4UNS94  T4UNS95  T4UNSCUM  T4XCUM92  TAYREPGF  TAYREPU  TAYSTRGF  TAYSTRU  TEACHAMT  TFEDAID  TFEDAID2  TFEDGRT  TFEDLN  TFEDLN2 TFEDWRK  TITIVAMT  TNFEDAID  TNFEDGRT  TNFEDLN  TNFEDOTH  TOTAID3  TOTAIDR  TOTBOROW  TOTCOSTA  TOTCOSTU  TOTGRT  TOTGRTR  TOTLOAN  TOTLOAN2  TOTOTHR  TOTWKST  TUITBGFT  TUITION  TUITION2  TYPAGE  TYPAGE2  UNKNAST  UNSAFE  UNTAXINC  VADODAMT  VETERAN  VISUAL  WAIVAMT  WHRSBORR  WKINC  WKINC2  WORKPCT  YEAR_R2  YEAR_R5  YRRECAID  B1STATE  B29394DT  B29397DT  B2ACCEPT  B2ACNTDT  B2ACNTST  B2ADGRED  B2AGATBA  B2AGECOL  B2AIDAPP  B2AIDGR  B2AIDPAY  B2AIDTCH  B2AIDYRS  B2AINCSP  B2AINDVR  B2AINRSP  Prefer full-time at job 1 Prefer full-time at job 2 Prefer full-time at job 3 Prefer full-time at job 4 Prefer full-time at job 5 Prefer full-time at job 6 Prefer full-time at job 7 Prefer full-time at job 8 Prefer full-time at job 9 Prefer full-time at job 10 Prefer full-time at job 11 Teaching full or part-time at job 1 Teaching full or part-time at job 2 Teaching full or part-time at job 3 Teaching full or part-time at job 4 Teaching full or part-time at job 5 Code-long term occupation Text-long term occupation (I) 01=Less than 1.00 02=At least 1.00 but less than 2.00 03=At least 2.00 but less than 3.00 04=At least 3.00 but less than 4.00 05=0r between 4.00 and 5.00? ------------------ ------------- father is referent parent and the series HZZB through H14A asked once with \"father/male guardian\" being text filled. ...and D013=3,4,D,R and D015=2... mother is referent parent and the series HZZB through HIV asked once with \"mother/female guardian\" being text filled. ...and D013=3,4,D,R and D015=3... father is referent parent and the series HZZB through HI4A is asked once with \"father/male guardian\" being text filled. ...and 0013=2... the series HZZB through H I 4A is asked once with \"father/male s guardian\" being text filled and the series HZZC through Hl4B is asked once with \"mother/female guardian\" being text filled. ...and D013=3,4,D,R and DOI 5=D... the series HZZB through H14A is asked once with \"parents' being text filled. ...and D013=3,4,D,R and D015=4,R and 0016=1... father is referent parent and the series FIZZB through H14A asked once with \"father/male guardian\" being text filled. ...and D013=3,4,D,R and D015=4,R and 0016=2... mother is referent parent and the series HZZB through HIV asked once with \"mother/female guardian\" being text filled. ...and D013=3,4,D,R and 0015=4,R and D0I6=3... mother is referent parent and the series HZZB through H14A asked once with \"mother/female guardian\" being text filled, the series HZZB through HI4A is asked once with \"father/male guardian\" being text filled and the series HZZC through Hl4B is asked once with \"mother/female guardian\" being text filled. ..And130l3=3,4,0,R and DOl5=4,R and D016=4... ---------------- (grid control variable) income tax exemption in (1990/1991/1992 income, of $4,000 or more in (1985/1986/1987/1988/1989/1990/1991 Would you estimate your (and your spouse's) curret cash, savins, and checking accounts to be worth... t 1=less than $500 2=at least $500 but less than $1000 3=at least $1,000 but less than $2,500 4=at least $2,500 but less than $5,000 5=at least $5,000 but less than $10,000 6=at least $10,000 but less than $25,000 7=or, $25,000 or more? D, R Would you estimate your (and your spouse's) curret retirement and/or pension accounts to be worth... t 1=less than $500 2=at least $500 but less than $1000 3=at least $1,000 but less than $2,500 4=at least $2,500 but less than $5,000 5=at least $5,000 but less than $10,000 6=at least $10,000 but less than $25,000 7=or, $25,000 or more? D 1=less than $25,000 2=at least $25,000 but less than $50,000 3=at least $50,000 but less than $100,000 4=at least $100,000 but less than $250,000 5=at least $250,000 but less than $500,000 6or, $500,000 or more Would you estimate the amount currently owed to b ;..I=less than $25,000 2=at least $25,000 but less than $50,000 3=at least $50,000 but less than $100,000 4=at least $100,000 but less than $250,000 5=at least $250,000 but less than $500,000 6or, $500,000 or more ;..1=less than $5,000 2=at least $5,000 but less than $10,000 3=at least $10,000 but less than $15,000 4=at least $15,000 but less than $25,000 5=at least $25,000 but less than $50,000 6=or, $50,000 or more D, R ..less than $1,000 2 = ...at least 1,000 but less than $5,000 3 = ...at least $5,000 but less than $10,000 4 = ...at least $10,000 but less than $20,000 5 = ...or, $20;000 or more D,R ..less than $1,000 2 = ..2t least 1,000 but less than $5,000 3 = ...at least $5,000 but less than $10,000 4 = ...at least $10,000 but less than $20,000 5 = ...or, $20,000 or more ..less than $500 2 = ...at least $500 but less than $1,000 3 = ...at least $1,000 but less than $2,000 4 = ...at least $2,000 but less than $3,000 5 = ...at least $3,000 but less than $4,000 6 = ...or, $4,000 or more? D,R ..at least $5,000 but less than $10,000 4 = ..2t least $10,000 but less than $15,000 5 = ...at least $15,000 but less than $20,000 6 = ..2t least $20,000 but less than $50,000 7 = ...or, $50,000 or more D,R  Would you say... ..at least $30,000 but less than $50,000 2 = ...at least $50,000 but less than $75,000 3 = ...at least $75,000 but less than $100,000 4 = ...at least $100,000 but less than $150,000 5 = ...or, $150,000 or more? D (1992) 4 = ...at least $3,000 but less than $4,000 5 = ...at least $4,000 but less than $5,000 6 = ...or, $5,000 or more? D,R ..less than $500 2 = ...at least $500 but less than $1,000 P 3 = ...at least $1,000 but less than $2,500 4 = ...at least $2,500 but less than $5,000 5 = ...at least $5,000 but less than $7,500 6 = ...at least $7,500 but less than $10,000 7 = ...or, $10,000 or more? D,R (as of May, 1992) NYI 1 :522/ 53 : 1 (current) (1) As of Mav, 1992 , would you estimate your 1 = ...less than $10,000 2 = ...at least $10,000 but less than $20,000 3 = ...at least $20,000 but less than $30,000 4 = ...at least $30,000 but less than $40,000 5 = ...at least $40,000 but less than $50,000 6 =...or, $50,000 or more? D,R r P (and your spouse's) cash, savings, and checking accounts were worth... (2) Would you estimate the current value of your (and your spouse's) cash, savings, and checking accounts to be worth..."}, {"section_title": "N012-92", "text": "NEI2-Cur. N012 :521/ 71 : 6 (as of May, 1992) NE12 :522/ 54 : 6 (current) NXI3-92 NY13-Cur NX13 :521/ 77 : 1 (as of May, 1992) NY13 :522/ 60 : 1 (current) (1) As of May, 1992 would you estimate your 1 = ...less than $50,000 2 = ...at least $50,000 but less than $100,000 3 = ...at least $100,000 but less than $250,000 4 = ...at least $250,000 but less than $500,000 5 = ...at least $500,000 but less than $1,000,000 6 = ...or, $1,000,000 or more? D,R P (and your spouse's) retirement and/or pension accounts were worth... (2) Would you estimate the current value of your (and your spouse's) retirement and/or pension accounts to be worth... NYI4 :522/ 68 : 1 (current) (1) As of May. 1992, would you estimate your 1 = ...less than $25,000 2 = ...at least $25,000 but less than $50,000 3 = ...at least $50,000 but less than $100,000 4 = ...at least $100,000 but less than $250,000 5 = ...or $250,000 or more? D,R P (and your spouse's) home was worth... NYI5 :522/ 77 : 1 (current) (1) Would you estimate the amount owed as of Mav. 1992 was... 1 = ...less than $25,000 2 = ...at least $25,000 but less than $50,000 3 = ...at least $50,000 but less than $100,000 4 = ...at least $100,000 but less than $250,000 5 = ...or, $250,000 or more? D,R P"}, {"section_title": "NB13-", "text": "(2) Would you estimate the amount currently owed to be... NY16 :523/ 5 : 1 (current) (1) As of May. 1992 would you estimate your 1 = ...less than $25,000 2 = ...at least $25,000 but less than $50,000 3 = ...at least $50,000 but less than $100,000 4 = ...at least $100,000 but less than $250,000 5 = ...or, $250,000 or more D,R p (and your spouse's) business and/or farm was worth..."}, {"section_title": "554", "text": "(2) Would you estimate the current value of your (and your spouse's) business/farm to be worth... ..less than $25,000 2 = ...at least $25,000 but less than $50,000 3 = ...at least $50,000 but less than $100,000 4 = ...at least $100,000 but less than $250,000 5 = ...or, $250,000 or more? P ."}, {"section_title": "N016-", "text": "(2) Would you estimate the amount currently owed to be... (as of May, 1992) NY20 :523/ 20 : 1 (current) (1) As of Mav. 1992, would you estimate your 1 = ...less than $25,000 2 = ...at least $25,000 but less than $50,000 3 = ...at least $50,000 but less than $100,000 4 = ...at least $100,000 but less than $250,000 5 = ...or, $250,000 or more? D,R P (and your spouse's) other real estate and investments were worth..."}, {"section_title": "556", "text": "(2) Would you estimate the current value of your (and your spouse's) other real estate and investments to be worth... N020-92 NE20-Cur. N020 :522/ 39 : 7 (as of May, 1992) NE20 :523/ 21 : 6 (current) (I) How much was still owed as of Mav. 1992 (2) Would you estimate the amount currently 1 = ...less than $25,000 2 = ...at least $25,000 but less than $50,000 3 = ...at least $50,000 but less than $100,000 4 = ...at least $100,000 but less than $250,000 5 = ...or, $250,000 or more? D ..less then $5,000 2 = ...at least $5,000 but less than $10,000 3 = ...at least $10,000 but less than $20,000 4 = ...at least $20,000 but less than $30,000 5 = ...at least $30,000 but less than $40,000 6 = ...at least $40,000 but less than $50,000 7 = ...or, $50,000 or more? D Thinking about all of the graduate or professional schools to which you applied. if pbaschool_dates(n)=9696 then \"insert\"=\"is\": else \"insert\"=\"was\" if pbaschool_dates(n)=9696 then \"insert\"=\"do\": else \"insert\"=\"did\" AQ number: 304 ITERS: 3 Now I'd like you to think about the period from July 1. 1993 through June 30. 1994 During that period, how much were your total tuition and fees prior INSTRUCTIONS: if pbaschool_dates(n)=9696 then \"insert\"=\"is\": else \"insert\"=\"was\" QXQ: Employed means holding a job and working for pay."}, {"section_title": "INSTRUCTIONS:", "text": "If R has more than one April job, probe for full time employer. If more than one full time job. pick the job with most hours worked in April. During the time you worked for \"PJOBEMPLOYER\" were you also enrolled in school?   877 RANGE: 1/31. 40/94 QXQ: If R has more than 10 children, pick up the birthdates for the 10 youngest children."}, {"section_title": "SAMPLE: SKIP:", "text": "INSTRUCTIONS: LET \"INSERT\" 7 \"your child\" IF \"NUMBCHIL\" = 1. LET \"INSERT\" = \"the oldest of these children\" IF and capital gains.) Would you estimate your 1993 personal income from all jobs was 1 less than $5.000 2 at least $5.000 but less than $10,000 3 at least $10.000 but less than $20.000 4 at least $20.000 but less than $30.000 5 at least $30.000 but less than $50.000 6 at least $50.000 but less than $75.000 7 at least $75.000 but less than $100.000 8 or $100.000 or more 2 at least $5.000 but less than $10,000 3 at least $10.000 but less than $20.000 4 at least $20.000 but less than $30.000 5 at least $30.000 but less than $50,000 6 at least $50.000 but less than $75.000 7 at least $75.000 but less than $100,000 8 or $100.000 or more friend or relative other than your parents if possible. who lives at an address different from yours, and who will always know where to get in touch with you. IF STEXAMFL = 2.MISS AND ((NTEYY < HSYEAR.ANaNTEYY->:0) ORNTEYY = HSYEAR AND (NTEN1M < HSMONTH AND NTEMM > 0), po BACK7CINTEMM \"DATE SHOULD BE AFTER HIGH SCHOOL GRADUATION)\" IF STEXAMFL = 1 AND ((NTEYY <.OLDINVYY ANCY,NTEYY.> 0) OR NTEYY = OLDINWY AND (NTEMM < OLDINVMM AND NTEMM > 4.G0 BACK TO NTEMM ::',DATESHOULD:BE AFTER LAST INTERVIEW DATE)\"         F PBDEGRYY > YYINV OR:PBDEGRYY :=-..YYINV AND PBDEGRMM > MMINV, GO BACK TO FBDEGRMM : \"DATESHOULD.:BE BEFORE.CURRENT DATE\" F (PBDEGRYY <YBARECVDAND PBDEGRYY > 9) OR PBDEGRYY = YBARECVD AND (PBDEGRMM < MBARECVD AND pBDEGRMM.:> 0, GO BACK.TO PBDEGRMM : \"DATE SHOULD BE AFTER DATE RECEIVED BA)\" IF. DEGRCVD = 1::AND (PI3PROG.7.2/8.AND PBPROG > FDEGRCV. THEN SET FDEGRCV TO APBPROG\") IF DEGRCVD = 1 AND ppRGo::#: 2/8 AND PPRGO2 = 2/8 AND (PPRGO1 >=:PPRGO2 AND PPRGO1 > FDEGRCV, THEN:SET:FDEGRCV.TO ^ppRGOi F: DGFZCVD = 1 AND.:PPRGOI*2/8 AND:PPRGO2 = 2/8 AND (PPRGO2 > PPRGO1 AND PPRGO2 > FDEGRCV, THEN SET:FDEGRCV TO.APPRG02)!') IFDEGRCVD = 1 AND (PPRG01:'*'2/8 AND PPRGO1 > FDEGRCV. THEN SET FDEGRCV TO       Elementary or secondary school teacher 2 Substitute teacher 3 Teacher's aide 4 Itinerant teacher (assignment requires you teach at more than one school) 5 \"Support\" teacher (one who works with other teachers to develop curricula or teaching materials but doesn't necessarily teach students) Less than 1 year 2 1 year 3 2 years 4 3 years 5 4 years 6 5 years 7 More than 5 years F TEACHING = 5, GO TO TOTSCH, ELSE GO TO REGJOB 3.28 TOTSCH MULTIPLE Support teacher activities I have a few questions about your \"support\" teacher jobs. Which of the following activities were part of your position as a \"support\" teacher? (READ EACH AND CODE ALL THAT APPLY) 1 developing or running a teacher professional development program 2 developing curricular activities or materials 3.29 SUPTYP FIXED Place support teacher worked Where did you work most of the time you held a support teacher position? (READ EACH AND CODE ONLY ONE) 1 in one school 2 in more than one school 3 not in a:school, for example, in a district office 4 or somewhere else? 3.30 SUPPYRS FIXED How long support teacher How many years were you employed as a support teacher? 1 Less than 1 year 2 1 year 3 2 years 4 3 years 5 4 years 6 5 years 7 More than 5 years IF TEACHING = 2,3 AND (TEACHING <> 1 AND TEACHING <> 4 AND TEACHING <> 5), GO TO TIMEST46 IF TEACHING = 5 AND (TEACHING <> 1 AND TEACHING <> 4), GO TO TIMEST46 What is the name of that school and where is it located? ELSE ATEACHINGA(1)+AREGJOBA(G1) What is the name of the ATJBLOOPBA school and where is it located? END IF ATEACHING1(4)+ATEACHING^(1)+ATJBLOOPBA(1) For itinerant teaching assignments, give me the name of the school where you taught the largest number of students. ELSE ATEACHING^(4)+ATEACHING^(1)+ATJBLOOPBA(G1) (For itinerant assignments, give me the name of the school where you taught the largest number of students.) END IF ATEACHINGA(4)+ATEACHINGA(N1)+AREGJOBA(1) What is the name of the school in your itinerant teaching assignment where you taught the largest number of students? ELSE ATEACHINGA(4)+ATEACHINGA(N1)+AREGJOBA G1What is the name of the school in your ATJBLOOPBA itinerant assignment where you taught the largest number of students?   In ATJ2LOOPBA, was your primary teaching job at: (READ THE LIST OF JOBS AND ASK RESPONDENT TO PICK THE PRIMARY ONE. PRIMARY=MOST NUMBER OF HOURS) 1 AELNAMEAMATJBLOOPBA(1)= 2 AELNAME1MATJBLOOPBA(2)= 3 AELNAMEAMATJBLOOPBA(3)= 4 AELNAMEAMATJBLOOPBA(4)= 5 AELNAMEAMATJBLOOPBA(5)= "}, {"section_title": "RCHEY D >BS", "text": ",e> 97, 446 BACK TO JBSRCHEM \"END DATE MUST BE 97/97 R BEFORE CURRENT DATE' F JBBRCHEY > YYINV OR JBSRCHEY YYINVAND (JBSRCHEM > MMINV AND JBSRCHEM <> 97, , 0 BACK TO JBSRCHEM \"END DATE SHOULD SE BEFORE CURRENT DATE)\" F (JBSRCHEY < JBSRCHSY AND JBSRCHEY > 0) OR JBSRCHEYZJBSRCHSY AND (JBSRCHEM BSRCHSM AND JBBRCHEM > 0, GO BAOK TO JBSRCHEM 'END DATE SHOULD BE AFTER TART DATE)\" Have you worked at any other jobs for pay since AOLDDATEA? IF ATEACHING^ 5Include the support teacher assignment you told me about earlier."}, {"section_title": "END ELSE", "text": "Have you worked at any jobs for pay since AOLDDATEA? IF ATEACHING^ 5Include the support teacher assignment you told me about earlier. IF AREGJOBA(GO) AJOBLOOPSAM390(GEQ389)=\" \"^E391\"NAME ELSE AJOBLOOPSAM390(NO)=\" \"^E391\"NAME END BESTCOPYAVAILABLE   IF CHNOOM > Y`liNV OR CHNOOIYY = YYINV AND CHNGOIMM > MMINV, GO BACK TO CHNG01MM \"DATE SHOULD BE BEFORE CURRENT DATE\" IF CCHNG01YY < OLDINVYY AND CHNGOM > ti) OR CHNGOIYY = OLDINVYY AND (CHNGOIMM < OLDINVMM AND CHNGOIMM > 0, GO BACK TO CHNGOIMM \"DATE SHOULD BE AFTER LAST INTERVIEW DATE)\"  = 214, GO BACK TO MARICH03 \"YOU CANT BE DIVORCED, SEFARATED:ORWIDQWED IF YOU HAD NEVER BEEN MARRIED\" F MARICH02:=4..ANDMARICHD3 = 2,3,6, GO BACK TO MARICH03 : \"YOU CAN'T BE SEPARATED, DIVORCED OR:.NEVER.BEEN MARRIED IF YOU WERE WIDOWED\" 1F:MARICH02.= 3.ANDMARICH03 = 2,4,6, GO BACK TO MARICH03 : \"YOU CAN'T BE SEPARATED, : WIDOWEDOR.NEVER.BEEN MARRIED IF YOU WERE DIVORCED\" F,MARICH02:'=:2.-AND.MARICH03 = 6, GO BACK TO MARICH03 \"YOU CAN'T BE NEVER MARRIED IF YOU WERE SEPARATEEr \"IF MARICH02:=4:AND.MARICH03 = 6, GO BACK TO MARICH03 \"YOU CAN'T BE NEVER MARRIED IFYOU.WERE MARRIED\" "}, {"section_title": "NBM", "text": "Fourth marital change status F (MARICH04 = MARICH03 AND MARICH04 > 0, 00 BACK TO MARICH04 \"YOU CAN'T HAVE THE AME STATUS AS BEFORE)\" F MARICH03 = 8 AND MARICH04 = 2#4, GO BACK TO MARICH04 \"YOU CAN'T BE DIVORCED, EPARATED OR WIDOWED IF YOU HAD NEVER BEEN MARRIED\" F MARICH03 = 4 AND MARICH04 = 2,3,6, GO BACK TO MARICH04 \"YOU CAN'T BE SEPARATED, IVORCED OR NEVER BEEN MARRIED IF YOU WERE WIDOWED\" F MARICH03 = 3 AND MARICH04 = 2,4,6, GO BACK TO MARICH04 \"YOU CAN'T BE SEPARATED, DOWED OR NEVER BEEN MARRIED IF YOU WERE DIVORCED\" F MARICH03 = 2 AND MARICH04 = 6, GO BACK TO MARICHO4 : \"YOU CANI BE NEVER MARRIED F YOU WERE SEPARATED\" F MARICH03 = 1 AND MARICH04 = 6, GO BACK TO MARICHO4 \"YOU CANI BE NEVER MARRIED F YOU WERE MARRIED\" 6.38  What is your estimate of your personal income from all jobs_ in 1996? LExclude_ untaxed income or income from other sources such as interest, dividends, and capital gains.)"}, {"section_title": "CHNGO4MM NUMBER", "text": "Would you estimate your 1996 personal income from all jobs was .. 1 less than $5,000 2 at least $5,000 but less than $10,000 3 at least $10,000 but less than $20,000 4 at least $20,000 but less than $30,000 5 at least $30,000 but less than $50,000 6 at least $50,000 but less than $75,000 7 at least $75,000 but less than $100,000 8 or $100,000 or more less than $5,000 2 at least $5,000 but less than $10,000 3 at least $10,000 but less than $20,000 4 at least $20,000 but less than $30,000 5 at least $30,000 but less than $50,000 6 at least $50,000 but less than $75,000 7 at least $75,000 but less than $100,000 8 or $100,000 or more What is your estimate of your ADUMSPOUSA(7/8) personal income from all _jobs_ in 1996? (_Exclude_ untaxed income or income from other sources such as interest, dividends, and capital gains.) Would you estimate your ADUMSPOUSA(7/8) 1996 total income from all jobs was ... 1 less than $5,000 2 at least $5,000 but less than $10,000 3 at least $10,000 but less than $20,000 4 at least $20,000 but less than $30,000 5 at least $30,000 but less than $50,000 6 at least $50,000 but less than $75,000 7 at least $75,000 but less than $100,000 8 or $100,000 or more "}, {"section_title": "UNDDEBTN UNCODED", "text": "Total amount borrowed for ugrad ed What was the total amount of money you borrowed for your undergraduate education up through AD(ML,7)19AYBARECVDA? Please include the amounts in federal, state, or institutional loans you received from all sources. Also include loans from family, friends, relatives, banks, savings and loans, and credit unions, and loans that have been repaid. Up through AD(ML,7)19AYBARECVDA, how much money did you borrow for undergraduate education? E40 IF GRAENR ()AND GRDPRGFL Z GO TO OWENFAM Of the total amount you borrowed from_non-family_sources for your graduate or professional education, how much money do you still owe? ELSE AGRSCHDBA(G0)+ATOTUDEBTA(G0) Of the total amount you borrowed from_non-family_sources for both BEST COPY AVAILABLE "}]