[{"section_title": "Abstract", "text": ". Androgen receptor CAG repeat polymorphism is associated with fat-free mass in men. J Appl Physiol 98: [132][133][134][135][136][137] 2005. First published September 17, 2004; doi:10.1152/japplphysiol. 00537.2004.-The human androgen receptor (AR) gene contains a CAG (glutamine) repeat polymorphism in exon 1 that is inversely associated with transcriptional activity of the AR. We studied the association of AR CAG repeat length, fat-free mass (FFM), and testosterone in two independent cohorts: 294 Caucasian men, aged 55-93 yr, from the Study of Osteoporotic Risk in Men (STORM), and 202 Caucasian volunteers (112 men and 90 women), aged 19 -90 yr, from the Baltimore Longitudinal Study of Aging (BLSA). Subjects were genotyped to determine the number of AR CAG repeats and grouped as carrying either Ͻ22 or Ն22 repeats. Whole body soft tissue composition was measured by dual-energy X-ray absorptiometry. Men with greater CAG repeat number exhibited significantly greater total FFM than those with fewer CAG repeats in both cohorts (STORM: 59.2 Ϯ 0.3 vs. 58.0 Ϯ 0.4 kg, P ϭ 0.02; BLSA: 57.2 Ϯ 1.1 vs. 53.8 Ϯ 1.1 kg, P ϭ 0.04). Similar results were observed for total FFM normalized to height. No differences were seen in women in the BLSA cohort. In the BLSA cohort, serum testosterone levels were higher in subjects with greater repeat number (P ϭ 0.003). This same pattern approached significance in the STORM cohort (P ϭ 0.07). In conclusion, the androgen receptor CAG repeat polymorphism is associated with FFM in men in two independent cohorts. Additional studies are needed to confirm this observation and to clarify the mechanisms involved. body composition; genetics; muscle mass; muscle strength; testosterone MUSCLE MASS AND STRENGTH ARE highly heritable phenotypes, and genetic factors contribute significantly to the variation in lean body mass and muscle strength (1, 5, 42) . To date, information identifying genes and their allelic variants that contribute to muscle-related phenotypes is limited to the vitamin D receptor (12, 36, 44, 45) , ciliary neurotrophic factor and its receptor (33, 34), myostatin (8, 18, 37), insulin-like growth factor I (40), type I collagen (46), and interleukin-6 (35).\nAndrogen receptors (AR) are highly expressed in skeletal muscle (4, 38), with expression being upregulated in response to muscle overload (2). Animal and clinical studies have indicated that the androgen-AR signaling pathway is required for both skeletal muscle development and increases in muscle mass, strength, and muscle protein synthesis in response to androgens (24). The AR is a member of the nuclear receptor family of ligand-activated transcription factors and is divided into three functional domains (27): the NH 2 -terminal domain is important for transcriptional activation of androgen-responsive genes (19), the central region encodes a DNA-binding domain, and the COOH-terminal portion contains the ligand-binding domain (14) .\nThe AR gene contains a polymorphic CAG microsatellite repeat sequence, which normally ranges from 8 to 31 repeats and averages ϳ20 repeats in length (11). The CAG repeat is present in exon 1 and encodes for a polyglutamine chain in the NH 2 -terminal transcriptional activation domain of the AR gene. Several reports indicate that longer CAG repeat length in the human AR results in a linear decrease of transactivation function (6, 7, 20, 43) .\nPrevious studies have shown associations of the AR CAG repeat polymorphism with androgen-related conditions, such as benign prostatic hypertrophy, prostate cancer, and male infertility (13, 23, 30) . Given the importance of androgens to the development and maintenance of muscle mass, the importance of the CAG repeat polymorphism to AR function, and the known heritability of muscle mass, we hypothesized that individuals with a greater number of AR gene CAG repeats would exhibit lower levels of total fat-free mass (FFM) compared with individuals with fewer CAG repeats. We tested our hypothesis in two independent cohorts derived from the Study of Osteoporotic Risk in Men (STORM) and the Baltimore Longitudinal Study of Aging (BLSA).\nMETHODS\nThe STORM cohort consisted of a sample of 294 Caucasian men, aged 55-93 yr, recruited primarily from population-based listings (15). Men who were unable to walk without the assistance of another person or had undergone a bilateral hip replacement were ineligible to participate in STORM.\nThe BLSA cohort consisted of 202 Caucasian volunteers (112 men and 90 women), aged 19 -90 yr, recruited primarily from populationbased listings. Details of the BLSA recruitment methodology are outlined elsewhere (39). Additional BLSA men without body composition data were included in the analysis of testosterone levels (total n ϭ 163). All BLSA subjects received a complete medical history and physical examination, and subjects with clinical cardiovascular or musculoskeletal disorders that could be adversely affected by exercise testing were excluded."}, {"section_title": "", "text": "MUSCLE MASS AND STRENGTH ARE highly heritable phenotypes, and genetic factors contribute significantly to the variation in lean body mass and muscle strength (1, 5, 42) . To date, information identifying genes and their allelic variants that contribute to muscle-related phenotypes is limited to the vitamin D receptor (12, 36, 44, 45) , ciliary neurotrophic factor and its receptor (33, 34) , myostatin (8, 18, 37) , insulin-like growth factor I (40), type I collagen (46) , and interleukin-6 (35) .\nAndrogen receptors (AR) are highly expressed in skeletal muscle (4, 38) , with expression being upregulated in response to muscle overload (2) . Animal and clinical studies have indicated that the androgen-AR signaling pathway is required for both skeletal muscle development and increases in muscle mass, strength, and muscle protein synthesis in response to androgens (24) . The AR is a member of the nuclear receptor family of ligand-activated transcription factors and is divided into three functional domains (27) : the NH 2 -terminal domain is important for transcriptional activation of androgen-responsive genes (19) , the central region encodes a DNA-binding domain, and the COOH-terminal portion contains the ligand-binding domain (14) .\nThe AR gene contains a polymorphic CAG microsatellite repeat sequence, which normally ranges from 8 to 31 repeats and averages ϳ20 repeats in length (11) . The CAG repeat is present in exon 1 and encodes for a polyglutamine chain in the NH 2 -terminal transcriptional activation domain of the AR gene. Several reports indicate that longer CAG repeat length in the human AR results in a linear decrease of transactivation function (6, 7, 20, 43) .\nPrevious studies have shown associations of the AR CAG repeat polymorphism with androgen-related conditions, such as benign prostatic hypertrophy, prostate cancer, and male infertility (13, 23, 30) . Given the importance of androgens to the development and maintenance of muscle mass, the importance of the CAG repeat polymorphism to AR function, and the known heritability of muscle mass, we hypothesized that individuals with a greater number of AR gene CAG repeats would exhibit lower levels of total fat-free mass (FFM) compared with individuals with fewer CAG repeats. We tested our hypothesis in two independent cohorts derived from the Study of Osteoporotic Risk in Men (STORM) and the Baltimore Longitudinal Study of Aging (BLSA)."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Subjects.", "text": "The STORM cohort consisted of a sample of 294 Caucasian men, aged 55-93 yr, recruited primarily from population-based listings (15) . Men who were unable to walk without the assistance of another person or had undergone a bilateral hip replacement were ineligible to participate in STORM.\nThe BLSA cohort consisted of 202 Caucasian volunteers (112 men and 90 women), aged 19 -90 yr, recruited primarily from populationbased listings. Details of the BLSA recruitment methodology are outlined elsewhere (39) . Additional BLSA men without body composition data were included in the analysis of testosterone levels (total n ϭ 163). All BLSA subjects received a complete medical history and physical examination, and subjects with clinical cardiovascular or musculoskeletal disorders that could be adversely affected by exercise testing were excluded.\nAll subjects gave their written, informed consent before participation and received a complete medical history and physical examination. The experimental protocols were approved by the Institutional Review Boards for Human Subjects at Johns Hopkins Bayview Medical Center (Baltimore, MD) and at the University of Pittsburgh (PA). The protocols related to the analysis of genetic data were approved by Institutional Review Boards at the University of Maryland (College Park, MD) and the University of Pittsburgh.\nAR CAG repeat polymorphism. DNA was isolated from EDTA anticoagulated whole blood by using standard methods. PCR amplification of the AR CAG repeat was performed by using forward primer ARA-F 5Ј-ACCGAGGAGCTTTCCAGAAT, fluorescently labeled with HEX or FAM and one of the following reverse primers: ARA-R1, 5Ј-AGAACCATCCTCACCCTGCT; ARA-R2, 5Ј-CTGT-GAAGGTTGCTGTTCCTC; and ARA-R3, 5Ј-CAGCTGAGTCATC-CTCGTCCG. The use of three reverse primers allowed for three samples to be assayed simultaneously yet unambiguously, thus improving efficiency. For example, three samples each with 21 CAG repeats would yield fragment sizes of 230, 296, and 420 bp, respectively. PCR products for each of the amplicon sizes and dye colors (6 total fragments) were combined per lane. PAGE analysis was then performed by using an ABI 377 automated sequencer. An internal control of known repeat number was included with each amplification. Raw fragment size was determined by comparison of fragments to the GeneScan500 ROX Size Standard, and an overall correction was made to the internal control by using the GeneScan 3.1.2 and Genotyper 2.0 software packages. Five samples from each amplicon size were randomly selected for verification by direct sequencing of the repeat region by using an ABI 3700 automated fluorescent sequencer. Once allele length was determined; it was converted to CAG repeat number via the following formula: (allele size Ϫ 221)/3. The median allele length of 287 is equal to 22 CAG repeats.\nBody composition. Volunteers from the STORM cohort had their body weight measured to the nearest 0.1 kg on a calibrated balance beam scale. Height was measured to the nearest 0.1 cm after removal of shoes, at the peak of inhalation, using a wall-mounted Harpenden stadiometer (Holtain, Dyved, UK). The average of two height measurements was used, and body mass index was calculated (kg/m 2 ). Whole body soft tissue composition was measured by dual-energy X-ray absorptiometry with the array mode, as previously described (36) . Appendicular muscle mass was considered equivalent to the sum of FFM in both the right and left arms and legs. As previously described by Baumgartner et al. (3) , both appendicular and total FFM values were made relative to body height squared (kg/m 2 ) to account for the strong correlation among these variables with body size.\nFor volunteers from the BLSA cohort, body weight and height were measured for each subject to the nearest 0.1 kg and 0.5 cm, respectively, using a medical beam scale, and body mass index was calculated (kg/m 2 ). Assessment for total body fat and FFM was also assessed by dual-energy X-ray absorptiometry, using previously described methods (26) , and relative FFM (kg/m 2 ) was calculated. Muscle strength testing. For the STORM cohort, grip and knee extensor strength were measured by using the Bodymaster Isometric Dynamometer (Dublin, CA) and Jackson Evaluation System (Lafayette Instrument), as previously described (36) . Participants had one practice trial and two trials on each leg. Each trial consisted of 4 s of contraction, with force measurements recorded during the last 3 s.\nFor the BLSA cohort, peak torque (strength) was measured by using the Kinetic Communicator isokinetic dynamometer (Kin-Com model 125E, Chattanooga Group, Chattanooga, TN). Concentric and eccentric peak torque were measured at angular velocities of 0.52 rad/s (30°/s) and 3.14 rad/s (180°/s) for the dominant knee extensors. For each test, subjects performed three maximal efforts, separated by 30-s rest intervals, from which the highest value of the three trials was accepted as the peak torque. Detailed procedures regarding subject positioning and stabilization, warm-up, testing order, gravity correction, and Kin-Com calibration are described elsewhere (26, 28) .\nTestosterone. For the STORM cohort, blood samples were obtained in the morning between 0700 and 1000, after an overnight fast. Samples were stored at Ϫ70°C. Total testosterone was measured by RIA after extraction and purification by LH-20 column chromatography. Bioavailable testosterone was determined by ammonium sulfate precipitation process that separates the sex hormone-binding globulin (SHBG)-bound steroid and free steroid. Serum samples were incubated in [ 3 H]testosterone. SHBG was precipitated by the addition of ammonium sulfate at a concentration of 50% saturated. The samples were centrifuged, and aliquots of the supernatant containing the \"non-SHBG-bound\" steroid were used for scintillation counting. The bioavailable testosterone concentration was then derived from the product of the total serum testosterone and the percent non-SHBGbound steroid determined from the separation procedure.\nFor the BLSA cohort, blood samples were obtained in the morning between 0700 and 0930, after an overnight fast. Before 1992, samples were stored at Ϫ20°C. Samples collected after 1992 were kept at Ϫ80°C. Total testosterone levels were determined, in duplicate, by using 125 I doubled-antibody RIA kits obtained from Diagnostic Systems Laboratories (Webster, TX). Complete details are described elsewhere (17) .\nPhysical activity. STORM participants completed a self-administered questionnaire, which was reviewed with each participant in the clinic by a trained interviewer. Physical activity was measured by using a modified Paffenbarger scale (31) in which subjects reported the frequency and duration of their participation per week during the past year in 33 different physical activities. The activities were assigned energy expenditures, according to previously reported methods (32), and total physical activity, expressed in kilocalories expended per day, was calculated by summing the kilocalories expended in the 33 recreational activities.\nPhysical activity was estimated for each of the BLSA participants using self-reported time spent in 97 activities, as has been previously reported (41, 48) . Physical activity was quantified into metabolic equivalent-minutes based on the metabolic equivalent of each particular activity and the time spent in that activity, normalized to 24 h.\nStatistics. Subjects were grouped according to the number of AR CAG repeats, based on the median value in both cohorts, which resulted in the most balanced grouping. Thus individuals were grouped as harboring repeat lengths of Ͻ22 (i.e., short allele) or Ն22 CAG repeats (i.e., long allele). Only females homozygous for a short allele or homozygous for a long allele at the X chromosome locus were included in the analysis; females carrying both a short allele and a long allele were excluded. Subject characteristics were analyzed by using t-tests between the two repeat-length groups. Dependent variables (FFM and testosterone variables) were analyzed by using analysis of covariance for both cohorts. For the STORM cohort, age, body fat mass, height, and physical activity were significant covariates for the analysis of FFM variables, with appendicular FFM used as an additional covariate for the analysis of muscle strength. Multivariate regression models were also performed in the STORM cohort to test for the association of AR CAG repeat number as a continuous variable. In addition, analyses were performed by using approximate tertiles of repeat number for the analysis of testosterone data in the STORM cohort. For the BLSA cohort, AR repeat length and sex were used as independent variables, with age, height, and physical activity included as significant covariates for all analyses, with FFM used as an additional covariate for the analysis of strength variables. Analyses were also performed by using repeat number as a continuous variable in multivariate regression models, and age ϫ genotype interaction was tested in these models. Data are reported as least squares means Ϯ SE, with statistical significance accepted at P Յ 0.05. Analyses were performed by using SPSS 11.0 analysis software. Table 1 . Repeat number was used to group subjects as carriers of short alleles or long alleles based on the median of the distributed repeat number, which was 22 repeats for the present study. Repeat number was used to group subjects as carriers of short alleles or long alleles based on the median of the bimodally distributed repeat number (22) . Of the 294 total subjects in the STORM cohort, 120 were grouped with the short alleles (Ͻ22; 40.8%) and 174 with the long alleles (Ն22; 59.2%). No significant differences existed by AR CAG repeat number for any physical characteristic. No significant differences were observed in appendicular muscle mass or relative appendicular muscle mass (kg/m 2 ) by AR repeat number. Contrary to our hypothesis, however, men with Ն22 repeats exhibited significantly greater total FFM (59.2 Ϯ 0.3 vs. 58.0 Ϯ 0.4 kg; P Ͻ 0.027) and greater relative total FFM (19.8 Ϯ 0.1 vs. 19.4 Ϯ 0.1 kg/m 2 ; P Ͻ 0.019) than men with Ͻ22 repeats. Similar results were observed in regression models with AR repeat number modeled as a continuous variable (data not shown; P ϭ 0.029 -0.050), with r 2 values for repeat length of 0.8% for both total FFM and relative total FFM. No significant differences were observed for muscle strength values between AR repeat groups ( Table 2) ."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "STORM cohort. Subject characteristics and soft tissue FFM variables grouped by AR CAG repeat number are shown in", "text": "BLSA cohort. Subject characteristics and soft tissue FFM variables for the BLSA cohort are shown in Table 3 , grouped by median AR repeat length, which was 22 repeats for both men and women. Of the 202 total subjects in the study, 103 exhibited Ͻ22 CAG repeats (51 men and 52 women; 50.9%) and 99 exhibited Ն22 repeats (61 men and 38 women; 49.1%). Women heterozygous for one short and one long allele were not included in the analysis. No significant differences existed between the two repeat groups for any physical characteristic. Similar to the STORM cohort and contrary to our hypothesis, men with Ն22 repeats exhibited significantly greater FFM (57.2 Ϯ 1.1 vs. 53.8 Ϯ 1.1 kg; P ϭ 0.047) and relative FFM (18.7 Ϯ 0.3 vs. 17.8 Ϯ 0.3 kg; P ϭ 0.050) than men with fewer repeats. There were no significant differences observed for women. No significant differences were observed in muscle strength between AR repeat groups for either men or women (Table 4) .\nTestosterone. No significant differences were observed for either total or bioavailable testosterone in the STORM cohort when AR CAG repeat length was analyzed by the median value of 22. However, when repeat length was analyzed as tertiles (short alleles, Ͻ21 repeats, n ϭ 71; medium alleles, 21-23 repeats, n ϭ 113; long alleles, Ͼ23 repeats, n ϭ 110), the relationship between testosterone and CAG repeat number approached statistical significance, with the greatest repeat tertile (Ͼ23) demonstrating the highest total testosterone (Ͻ21: 422. 4 Values are least squares means Ϯ SE in kg. *All analyses were corrected for age, height, fat mass, and physical activity. †In addition to the other covariates, the model was adjusted for appendicular FFM. There were no significant differences between repeat groups. 126.8 Ϯ 3.8, 135.2 Ϯ 3.9 ng/dl, respectively; P ϭ 0.076) values among the tertile groups.\nIn the BLSA cohort, testosterone data were available for 163 male subjects. Ninety-one men grouped in the Ն22 repeat group exhibited significantly higher levels of total testosterone than the Ͻ22 repeat group when adjusted for age (17.32 Ϯ 3.57 vs. 15.64 Ϯ 4.26 nmol/l; P ϭ 0.003). Moreover, a significant age-by-genotype interaction (P ϭ 0.023; Fig. 1 ) was observed, such that the Ն22 repeat group demonstrated higher testosterone levels than the Ͻ22 repeat group in older men but not younger men.\nThe inclusion of bioavailable testosterone as a covariate in the analysis of muscle mass phenotypes in the STORM cohort did not change the results described above. For both total FFM and relative total FFM, the short allele group continued to demonstrate significantly lower FFM values than the long allele group (P ϭ 0.051 and 0.037, respectively). These analyses were not performed in the BLSA cohort due to inadequate statistical power."}, {"section_title": "DISCUSSION", "text": "To our knowledge, the present study is the first to demonstrate an association between the CAG repeat polymorphism in exon 1 of the AR gene and FFM in men. Men grouped for the presence of greater CAG repeat number (Ն22), in both of two independent cohorts, exhibited significantly greater total FFM and relative total FFM than men with fewer CAG repeats (Ͻ22). A similar association was not observed in women.\nAlthough the mechanism underlying the observed association requires further study, we observed higher testosterone levels in men with longer alleles, consistent with our findings of greater FFM among individuals with longer alleles. These findings, if verified, may have important implications for the prevention of sarcopenia and frailty in aging adults.\nThe association between AR CAG repeat number and FFM was in the opposite direction of our a priori hypothesis. Numerous reports have shown that a greater number of CAG repeats in the human AR gene causes a linear decrease in receptor transactivation function (6, 7, 20, 43) . Thus we hypothesized that more CAG repeats would result in reduced activity of the androgen-AR pathway, with negative consequences for muscle mass. One possible explanation for our results is that a reduction in AR activity in the long allele length group modulates the level of negative feedback on the hypothalamic-pituitary-testicular axis, thus resulting in higher serum androgen levels. Higher testosterone levels have been associated with higher AR CAG repeat number in some, but not all, studies (22, 29, 47) . For example, Krithivas et al. (22) reported in a longitudinal study of aging in older men that testosterone levels, while similar at baseline regardless of CAG repeat number, were significantly higher at follow up in men with higher CAG repeat number compared with men with fewer CAG repeats. These results are consistent with our cross-sectional results in the BLSA cohort, where a significant gene-by-age interaction was observed, such that older but not younger men in the Ն22 CAG repeat group exhibited higher testosterone levels compared with the men with Ͻ22 repeats. Krithivas et al. suggest that greater AR CAG repeat number decreases AR activity in the hypothalamus, resulting in decreased negative feedback, thereby increasing serum androgen levels. This effect on testosterone, albeit modest, would be genetically mediated and thus could have an impact on muscle over the lifespan. This suggestion is consistent with the findings of the present study, in which we observed higher levels of total testosterone as well as significantly greater total FFM and relative total FFM in men with greater repeat number compared with those with fewer repeats. Whether higher testosterone levels have a direct or indirect effect on muscle is uncertain and cannot be determined from the present study. The influence of testosterone on muscle mass may be indirect and mediated via an antiglucocorticoid effect (9, 10, 21) , helping to diminish glucocorticoid-induced atrophy. For example, Danhaive and Rousseau (10) showed in rats that testosterone antagonizes the catabolic activity of endogenous glucocorticoids.\nWhile we observed consistent associations between AR CAG repeat number and FFM in men from two independent Values are means Ϯ SE in N⅐m. Data are corrected for age, height, and physical activity. There were no statistically significant differences between repeat groups for both men and women. Fig. 1 . Total testosterone values for 163 Baltimore Longitudinal Study of Aging men grouped by androgen receptor CAG repeat number. A significant interaction (P Ͻ 0.05) was observed, such that older but not younger men in the Ն22 CAG repeat group exhibited higher testosterone values compared with the Ͻ22 CAG repeat group. cohorts, we did not observe a similar association in women from the BLSA cohort. Our study was underpowered to specifically address sex differences in the association between the CAG repeat polymorphism and FFM, so this observation will require verification. Moreover, the study of the AR gene in women is complicated by the presence of two copies of the AR gene (i.e., two X chromosomes), one of which is randomly inactivated in each cell during development (25) . Recent research has shown that both premenopausal and postmenopausal women with relatively few CAG repeats in the AR gene displayed higher levels of serum androgens than women with a greater number of CAG repeats (16, 49) , findings opposite of what we observed in men in the present study. Whether the CAG repeat polymorphism has different actions and consequences in men compared with women is unclear, and additional work in this area is warranted.\nThe present results add the AR gene to a small but growing list of genes that have been tentatively identified as contributing to interindividual variation in skeletal muscle phenotypes, with anticipated future clinical significance for a variety of muscle-wasting conditions, especially sarcopenia. Not only will the importance of all of these genes need to be confirmed, but the interactions among them will also need to be examined. Moreover, for genes with a verified influence on muscle, potential interactions with therapeutic strategies (e.g., strength training or hormonal therapy) will need to be explored, as the ultimate goal of this research is to allow for optimization of individual prescriptions for maintaining muscle function throughout the age span.\nIn summary, we present data showing a significant association between AR CAG repeat number and FFM in men with corresponding differences in testosterone levels. Confirmation of the observed associations between AR CAG repeat number, testosterone levels, and FFM, as well as additional exploration of the mechanisms underlying these findings, is warranted."}, {"section_title": "GRANTS", "text": "The BLSA research was conducted as a component of the Intramural Research Program of the National Institute on Aging. This work was further sponsored by National Institutes of Health Grants AR-35582, P60-AR44811, AG-21500, AG-22791, and DK-46204."}]