[{"section_title": "Abstract", "text": "Researchers and decision makers are currently faced with a reduced supply of agricultural marketing information at both federal and state levels. Although a number of on-line computer informational sources are available to help fill this gap, the data are relatively expensive and often not available in the form or detail needed at the farm level. This paper examines expected future sources of agricultural information in the public, private and semi-public/private sectors. A working model of a semi-public/ private informational system is presented. The proposed selfhelp grower informational model system can be tailored to provide farm level data needed at a reasonable cost. This paper is based on two premises. First, good business management decisions depend on current, accurate information and second, the time framework needed to make farm marketing-management decisions has grown shorter and shorter.\nIn terms of the need for fast, current and accurate information for farming decisions, there is both good news and bad news. The bad news is that there has been a substantial reduction in readily available information with the current trend indicating a reduction in both federal and state funds for information and data on the agricultural economy. For example, Edwin Meese 3rd. reported in January 1984 that 1800 government publications will be eliminated (Philadelphia Inquirer), and the Statistical Reporting Service has eliminated 26 of its roughly 300 reports and eliminated or reduced the frequency of data series and reduced coverage in other reports (U.S. Department of Agriculture). Budget cuts have also eliminated the area sample from the 1982 census of Agriculture and it further appears that these reductions are only the first phase of a series of budget cuts from the agricultural information and data gathering functions that will most probably decrease even more over the next five years (Bonnen, Daniel, Gardner, Just).\nAssociate Professor and Professor, respectively, Department of Agricultural Economics and Marketing. Cook College, New Jersey Agricultural Experiment Station, Rutgers, the State University, New Brunswick, N.J. 08903.\nOn the other hand there is at least some good news in terms of availability of agricultural information. A large number of computerized data sources have become available online from both public and private sources. The bottom line is, however, this information is not a free good and it would appear much of the information would have to be customized or supplemented to be of value in decision making at the farm level.\nThis paper addresses the central question of-who will provide the market information for on-farm decisions for the 1980s and beyond? The authors feel that the required informational data base of necessity will continue to come from a combination of both public and private sources and it will be more costly, but potentially more useful to the individual than in the past.\nWith rapidly falling computer hardware prices and increasing availability of faster and better software application programs the results seem predictable. With equipment cost becoming less significant and with increased labor costs, the capital to labor cost trade-off is rapidly moving towards computer automation of information. This same scenario of capital/labor trade-off with computers seems reminiscent of a number of other innovations that have occurred in agriculture. Why should the computer tool be any different from earlier innovations? The key appears to be the versatile nature of the computer as compared with past tools. If the computer had only a"}, {"section_title": "", "text": "Researchers and decision makers are currently faced with a reduced supply of agricultural marketing information at both federal and state levels. Although a number of on-line computer informational sources are available to help fill this gap, the data are relatively expensive and often not available in the form or detail needed at the farm level. This paper examines expected future sources of agricultural information in the public, private and semi-public/private sectors. A working model of a semi-public/ private informational system is presented. The proposed selfhelp grower informational model system can be tailored to provide farm level data needed at a reasonable cost. This paper is based on two premises. First, good business management decisions depend on current, accurate information and second, the time framework needed to make farm marketing-management decisions has grown shorter and shorter.\nIn terms of the need for fast, current and accurate information for farming decisions, there is both good news and bad news. The bad news is that there has been a substantial reduction in readily available information with the current trend indicating a reduction in both federal and state funds for information and data on the agricultural economy. For example, Edwin Meese 3rd. reported in January 1984 that 1800 government publications will be eliminated (Philadelphia Inquirer), and the Statistical Reporting Service has eliminated 26 of its roughly 300 reports and eliminated or reduced the frequency of data series and reduced coverage in other reports (U.S. Department of Agriculture). Budget cuts have also eliminated the area sample from the 1982 census of Agriculture and it further appears that these reductions are only the first phase of a series of budget cuts from the agricultural information and data gathering functions that will most probably decrease even more over the next five years (Bonnen, Daniel, Gardner, Just) .\nAssociate Professor and Professor, respectively, Department of Agricultural Economics and Marketing. Cook College, New Jersey Agricultural Experiment Station, Rutgers, the State University, New Brunswick, N.J. 08903.\nOn the other hand there is at least some good news in terms of availability of agricultural information. A large number of computerized data sources have become available online from both public and private sources. The bottom line is, however, this information is not a free good and it would appear much of the information would have to be customized or supplemented to be of value in decision making at the farm level.\nThis paper addresses the central question of-who will provide the market information for on-farm decisions for the 1980s and beyond? The authors feel that the required informational data base of necessity will continue to come from a combination of both public and private sources and it will be more costly, but potentially more useful to the individual than in the past.\nWith rapidly falling computer hardware prices and increasing availability of faster and better software application programs the results seem predictable. With equipment cost becoming less significant and with increased labor costs, the capital to labor cost trade-off is rapidly moving towards computer automation of information. This same scenario of capital/labor trade-off with computers seems reminiscent of a number of other innovations that have occurred in agriculture. Why should the computer tool be any different from earlier innovations? The key appears to be the versatile nature of the computer as compared with past tools. If the computer had only a single application it would appear in most cases that its cost could not be justified. This is not the case, however, as it is being applied to automating office functions such as Accounting, Budgeting, Data Base Management, Word Processing and Communications and with other efforts making considerable strides in monitoring on-farm environmental conditions. In agriculture, adaptation does not seem to be a problem of lack of technology or even cost, but rather availability of usable data bases for farm and agribusiness uses."}, {"section_title": "Several Possible Solutions", "text": "It appears there will continue to be three major sources of available market information in the foreseeable future-public, private and combination semi-public/private. Furthermore, it appears that the emphasis of the past and present in terms of availability of these sources will change with greater use made of private and semi-public/private information."}, {"section_title": "Public Information", "text": "Public sources of information in agriculture have been and continue to be an important source of input to farms and agricultural firms (Daniel, Gardner) . Although the actual dollar value of the information is difficult to determine because the benefits are not directly quantifiable, there seems to be little disagreement that from a research and decision making perspective that the value of public information input is considerable.\nA second point is that although budget cuts and inflation have and probably will continue to reduce the available agricultural information and increase their distribution costs, the information from Federal, State and other agencies will continue to be an important source of information."}, {"section_title": "Private Information", "text": "The private sector has been a valuable provider of information in agriculture and its role is destined to expand. The role of consultants or firms, whether for specific problem areas or in terms of newsletters and or reports, appears to provide a needed service and will continue to be important. The large increase in disseminating information in recent years, how-NJARE ever, is in the on-line network in agriculture, many of which provide data customed for individual needs. With continued increases in technology, an expanding consumer base, and increased competition it would appear that the costs of these services to individual subscribers should decline."}, {"section_title": "Semi-Public/Private Information", "text": "The semi-public/private information providers do not fall neatly into either the strict public and private categories. Often these sources have been initiated or developed by using public monies and then continually operated at cost or on a partially subsidized cost basis. In this category, for example, are state, regional, and national computer systems many of which today have moved towards a regional or national network, for example: Agnet, Agtext, Answer, CMN, Comnet, Extend, Facts, Green Thumb, Wisplan and Telplan.\nA second area receiving recent attention has been the study and development of Electronic Marketing. Its operation implies remote access by the users to a centralized system of price discovery for actual buying and selling of the commodity.\nA third area of expansion is the formation of regional computer institutes such as the North Central and the Northeastern Computer Institutes . Although the institutions plan to remain independent of any provider of products or services, and not to sell or promote any individual institution's information systems, by supporting the Land Grant System concepts, they will indirectly support and provide information to a broad group of agricultural constituents."}, {"section_title": "The New Jersey Peach Market Case Study", "text": "One practical example of the semi-public/ private delivery system to provide information is a project conducted in 1983 with New Jersey peach growers. For years, Garden State producers and dealers have sold peaches without adequate and timely price and movement information. Marketing information available in the past has been limited. When published, it was of more historical value than serving immediate needs. The Rutgers 1 program was developed using new low cost computer technology to give New Jersey peach growers the best possible information on available price and volume of sale by peach size, variety, and location of sale on a daily basis for improving marketing, managerial and decision-making capabilities."}, {"section_title": "How Did the New Jersey Peach Pricing program Begin?", "text": "Considerable exploratory efforts were conducted by the New Jersey Peach Promotional Council and its grower members in evaluating various electronic marketing programs and the application and suitability of computer equipment and other resources that might be utilized to implement a price reporting information system. Most of the programs reviewed were either too expensive and/or overly complicated which did not appear to meet specific needs of the peach industry. Early exploratory investigation clearly indicated a potential existed but that further indepth study was required. A committee consisting of six peach growers from the New Jersey Peach Promotional Council and two county agents from South Jersey were appointed and assigned the task of establishing objectives and determining resources necessary to develop a program. This computer committee requested help from Extension Marketing specialists and researchers from the Department of Agricultural Economics and Marketing at Rutgers, Cook College, to explore the situation and assist in the development of a plan of action that could be implemented for the 1983 marketing season."}, {"section_title": "What is the New Jersey Peach Pricing Program?", "text": "The pilot computerized program was designed as in industry self-help venture open to all commercial peach growers and other marketeers who desired to participate. A membership fee for the first year at $250 was established to provide operational funds. The initial goal of reporting detailed, daily price was accomplished with 20 subscribers inputting and receiving information. This group collectively handled about 650,000 boxes or some 24,500,000 pounds of fruit, which represented nearly one-third the total volume of peaches sold wholesale from New Jersey in 1983.\nThe initial peach pricing system developed utilized a telephone input-output tape recorder for communications exchange and a microNew Jersey Peach Market 37 computer for analytical purposes. Subscriber members used a toll free number to provide daily input information for creating a data bank for analytical purposes. The six input factors included: date, grower identification code number, peach sales by major varieties, point of sale, total number of boxes and prices for each size category sold. The market input data received were first recorded on tape and then entered into the computer for analysis. Later in the day, growers called to receive a summary of the day's price and volume averages. Prior to the computerized price reporting system, information on daily prices and quantities, highs and lows, and weighted averages for various locations by varieties and size categories was nonexistent. The only formal data available was that reported by the New Jersey Crop Reporting Service which essentially gives selected spot and price reports. Since the reported data were general and sketchy they were not very useful for making specific market decisions. Tables 1 to 4 show the types of seasonal averages that were provided to subscribers in aggregate and on an individual basis. Data were provided both by number of sales reported in each size category and by total volume of boxes sold. Sales were further subdivided by location of sale and size categories as well as actual varieties sold (see Tables 1  and 2 -varieties not illustrated).\nPrices were averaged and reported by size categories for all peaches sold and for individual locations. High and low values were also reported for all size categories and locations (see Tables 3 and 4 ). The key factor in all the exhibits is that this information is available daily for making farm decisions in terms of selling or buying. It is not the purpose of this report to dwell on the interpretation or meaning of the data but rather to detail the types of data available from the project that were not available prior to the development of the pricing system and to indicate some of the possible ways the data might be used. A secondary purpose was to suggest an industry-university approach to developing information programs to meet user data requirements when needed data sources are lacking or not available, especially for serving future needs."}, {"section_title": "Data Uses", "text": "It would appear that at least three broad marketing and management uses could be made of the daily peach data collected. First, it has immediate applications to subscribers in terms of both selling or buying peaches. Price averages, ranges and actual volume sold in different areas by specific sizes and varieties should be very useful in selling and perhaps in determining where to market. Volumes and prices also give an indication of trends in future peach movements. Over a longer period of time available price data on a detailed basis should help quantify and indicate alternative production practices and other managerial changes that should be considered. For example, a shift to varieties that consistently provide returns above the average, or changes in cultural and thinning practices to grow a more highly preferred size. Trends should also indicate price variations in early or late varieties and indicate whether earlier or later marketing of specific varieties and sizes or storage practices returns the greater profit.\nA third value of detailed market information over time would be the movement towards a more competitive market structure for peaches and the development of increased efficiency in handling methods, reduced spoilage loss and expansion of new and more profitable market outlets. An understanding of the norms developed in these areas should lead to a more efficient market structure with healthy firms and the potential for reduced consumer prices. "}, {"section_title": "Five Lessons Learned or Relearned", "text": "1. Computer systems must be designed for people! In computer language it must be \"user friendly.\" Users must not only find the system easy to use but must understand overall what it is designed to do and why they are so impor tant in making a pricing system work. Individ uals don't need to completely understand the every sub-part of a given program, but they do need an overall general knowledge of how the working parts fit together.\n2. Standard computer programs and data bases do not usually fit the need. For most farm level grower problems, the computer programs and the database developed must be tailored for individual needs. A number of broad based data program systems may be acceptable for general informational sources, but much of the data and analysis required for local and personalized decisions need to be closely tailored.\n3. The key of broad base support for a sys tem is a simple understanding of what it can help do and how it works in the most basic possible form. In terms of Thomas J. Peters and Robert H. Waterman, Jr. in In Search of Excellence, we want an operation that is \"elegantly simple.\" 4. Work progresses more favorably when individual users are involved. People also seem to relate best to other people having similar interests, and to those people they trust and admire. Nothing sells an idea faster than the people in a business or industry who believe in it. In short, convince the leaders, innovators, and those most admired in an in dustry and they will quickly sell ideas to oth ers.\n5. A practical type of program with some user support, financial or otherwise, seems to work best. People seem more enthusiastic and supportive of a system in which they have a commitment and develop a personal stake in seeing it succeed. This, and the idea that suc cess breeds further success, seems to be very powerful incentives for using this type of self-help, participative organizational struc ture. By getting actual users involved, with help from research and extension workers, they know it is their system and that they are making a significant contribution to the suc cess of the program."}, {"section_title": "New Jersey Peach Market 39", "text": ""}, {"section_title": "Concluding Notes", "text": "There seems to be little doubt that less and less free government data will be available to make future farm decisions. Furthermore, because of rapidly expanding computer technology and more favorable capital/labor ratios, more sources of data will be readily available on-line for farmers to access using home computers or terminals. Currently some of the decrease of public information has been filled by private sources and a combination of semi-public/private sources. These latter sources seem destined to play a larger and larger role in the 80's and beyond. There are, currently, a number of both of these sources available and they are widely distributed throughout the country.\nOne of the problems with most of these sources, however, is that they are fairly general data bases that often need to be supplemented for micro area farm decisions. Although it is true that this micro level data can be provided by a number of private firms, the limited number of farms needing a specific type of information, usually makes the information prohibitively expensive.\nAn example of a source of semi-public/ private information system is the New Jersey self-help peach program. This program was aided with development and organizational expertise being provided to assist the agricultural community by the New Jersey Agricultural Experiment Station and Cooperative Extension Service Land Grant System at Rutgers. The peach information system developed appeared to fill the local data gap at a reasonable cost by utilizing the subscriber members as the data collection agents and computer technology to summarize and analyze the data and provide useful output. The current system is viewed as a hybrid one that will evolve into an on-line interactive system to be used as a marketing and management tool. This change will take place as subscribers develop increased sophistication, identify additional needs, obtain more data and develop the ability and means to interact with the system. It would appear from this project that Researchers and Extension workers in the Land Grant system could provide essential assistance to Farm Commodity Groups to aid them in the development of self-help informational systems for data analysis. Not only would these systems provide useful and detailed management information, but they would also fill the gap to meet the increasing unavailability of information formally obtained from government and other public sources.\nIt is essential, however, that in developing informational programs, growers through their organizations be involved in program planning and development, both in ideas and finances and then be prepared to take over the activities once developed. Although some University input may be needed or even desirable, it should not be viewed as an end in itself. In fact, by building and having access to a data base of information, University researchers would be provided a beneficial source of new, timely and more accurate information for analytical purposes. In short, workers in Land Grant Universities, jointly with farm groups, can assist in developing industry informational programs via computers to help fill the shrinking availability and higher cost of obtaining market information."}]