[{"section_title": "INTRODUCTION", "text": "Loss of habitat due to anthropogenic activities is the single biggest threat to the survival of many species and to global biodiversity, in general (Groombridge 1992 Forman et al. (1976) considered the minimum habitat amount to be the minimum size habitat patch in which a particular species was found, whereas Hinsley et al. (1995) considered it to be the minimum patch size in which a species breeds. However it has been recognized that one simple occurrence or breeding event in a patch does not indicate that the patch contains sufficient habitat for long-term population persistence. Calculations of minimum area requirements must be based on the amount of habitat necessary for population persistence (Hayden et al. 1985 , Wenny et al. 1993 ). Diamond (1975 Diamond ( , 1978 recognized this when he developed incidence functions in which the proportion of occurrence of a species is plotted against area, for a range of patch sizes, in order to obtain a measure of a species' minimum area requirements. Diamond (1978) considered the patch size for which a species has a 50% incidence to be a good measurement of the amount of habitat required for population viability. Hayden et al. (1985) , on the other hand, estimated the habitat area requirement for population persistence to be the patch size for which a species has an occurrence rate of 100%. The problem with using an occurrence rate of 100% is that it has been shown theoretically (Skellam 1951 , Bevers and Flather 1999) and empirically (Robbins et al. 1989a ) that many species never reach this maximum occurrence, even in very large patches. Robbins et al. (1989a) thought that a conservative estimate of the minimum area required by a species to ensure population viability was the patch size at which the species was present at 50% of its maximum occurrence rate."}, {"section_title": "Landscape scale", "text": "Recently it has become recognized that species respond not only to within-patch characteristics, but also to habitat at a landscape scale ( "}, {"section_title": "Purpose", "text": "The objective of this study was to test the prediction that organisms with higher reproductive rates require less habitat for population persistence than do those with lower reproductive rates. We used 41 species of forest-breeding birds to test for a relationship between the annual reproductive output of the bird species and the amount of forest in the landscape at which the species have a 50% probability of presence over a 10-year window."}, {"section_title": "METHODS", "text": "We used data from the North American Breeding Bird Survey, BBS (USGS Patuxent Wildlife Research Center 2001), to estimate the \"proportion presence\" of each of 41 forest bird species over a 10-year window, commencing with the year of the aerial photo for each landscape, in circular landscapes that surround each BBS route. Proportion presence was calculated as the number of years a species was present, divided by the number of years the route was run over a 10-yr window. To calculate the percent forest cover (coniferous, deciduous, and mixed forest) of the 779 landscapes located in the central and eastern USA (Fig. 1) km (area -1200 km2), which is equal to half the length of a BBS route. Each landscape was centered on the midpoint of a BBS route to ensure that the landscapes contained the entire route.\nWe selected the landscapes that were within each species' geographical range using digital range maps (WILDSPACE 2001), and conducted the analysis on this subset. For each species, we plotted the proportion presence against the percent forest cover, and used nonparametric regression curves to smooth the data. These smoothed curves were then used to estimate the minimum habitat amount at which the species has a 50% probability of presence in the landscapes.\nTo estimate the annual reproductive output for each species, we multiplied the average clutch size by the number of broods produced per reproductive season, using values obtained from the literature. Finally, we used regression analysis to test for the predicted negative relationship between the minimum habitat required for a 50% probability of presence and annual reproductive output."}, {"section_title": "Bird presence", "text": "The North American Breeding Bird Survey is a large-scale annual survey of >4000 roadside routes that are randomly distributed within a one-degree block of latitude and longitude, throughout the United States and southern Canada. Initiated in 1966, the BBS is used to monitor the distribution and status of North American breeding birds. Each route is 39.4 km long, with a total of 50 3-min point counts conducted at 0.8-km intervals. At each stop, the observer records all birds heard at any distance, and seen within a 0.4 km radius.\nTaking the species presence over a 10-yr period was a compromise between allowing enough time for a species to respond to the landscape structure and minimizing the amount of landscape change over that time period. We considered a species to be present during a year if it was recorded on at least one of the 50 stops that year, and we excluded routes from the analysis if they were not surveyed at least eight times in the 10-year window.\nThe BBS has strict guidelines for the conditions under which the routes are run. In most areas, the routes are surveyed in early-to-mid June under good weather conditions (high visibility with little or no rain and wind), and commence 30 min before sunrise. We excluded from the analysis those routes that did not meet these BBS guidelines.\nThis study focused on birds that require forest for breeding. We selected both interior and interior/edge forest species, as classified by Freemark and Collins (1992) , and used the Birds of North America series (Poole and Gill 1992-ongoing) to select additional species not classified by Freemark and Collins (1992) . Villard (1998) pointed out the lack of evidence for classifying species as either interior or interior/edge, but because we combined these two categories, this was not a problem.\nAn additional criterion that we used to select species for analysis was a positive response of proportional occurrence to increasing forest amount. A positive Pearson product-moment correlation (P < 0.05) between forest amount and proportional occurrence, estimated over the set of landscapes that fell within the species' range, was used to identify the set of birds qualifying for analysis. This effectively excluded any species that may have been classified incorrectly by Freemark and Collins (1992) Clutch size can vary both geographically and between individuals. Because we were interested in interspecific comparisons of habitat occupancy patterns, we used the most common clutch size reported in the literature as representative of that species across its geographic range (or a good portion of its range). When the most common clutch size was given as a range in the number of eggs produced, we chose the midpoint of that range. This occasionally resulted in non-integer clutch size estimates (e.g., 3.5 eggs).\nThe number of broods produced in a season is not as well known as the clutch size, because it requires researchers to follow individual birds throughout the reproductive season. Within the geographical range of a species, there can also be considerable variation in the number of broods produced, because the reproductive season is longer in the southern portion of a species' range than it is in the north. For this reason, it may be common for a species to be double-brooded in the southern part of its range and single-brooded in the north. Because we wanted to obtain a value that encompassed the entire range of a species, we averaged the number of broods produced to obtain a reasonable value for each species over its entire geographical range. If a species is single-brooded in the north and double-brooded in the south, we took the number of broods produced per season to be 1.5. "}, {"section_title": "Data analysis", "text": "We used digital range maps to subset the BBS routes to be used in the analysis for each bird species. This was done by overlaying the species' range map (WILD-SPACE 2001) on the center location of the BBS routes using ArcView 3.2 and selecting the routes that fell within a species' geographical range. If the range of a species extended over the entire study area, all 779 landscapes were used in the analysis.\nAfter selecting the routes within a species' geographical range, we plotted the proportion of years that the species was present in the 10-year window against the amount of forest in the landscape surrounding each route. We repeated this for each of the 41 forest bird species.\nBecause BBS data are very noisy, we used a nonlinear nonparametric regression to smooth the data. Nonlinear regression was used instead of linear regression because with nonlinear methods it is not necessary to choose a model a priori, and this allows the data themselves to estimate the best regression surface (Cleveland 1979, Cleveland and Devlin 1988). We used a locally weighted regression, or LOESS, to smooth the dependent variable in a moving window fashion by fitting a local regression that was weighted by the distance of the data points within a specified neighborhood from a point x on the independent axis. Points close to x are given a large weight and points farther from x are given a smaller weight (Cleveland 1979, Cleveland and Devlin 1988) . To fit the LOESS curves, we used the default parameters in SAS, which fits a local linear regression, uses a normal weight function, and selects the window width that minimizes the generalized crossvalidation mean squared error (SAS Institute 1990). This method was chosen because it offers a good compromise between goodness of fit to the data and the smoothness of the LOESS curve.\nWe used the smoothed regression curves to estimate the minimum habitat required for each species to have a 50% probability of presence in the landscape. We chose 50% presence because this was considered a tendency toward occupancy. Fig. 2 demonstrates how the minimum habitat requirements were estimated from the LOESS-smoothed data for the four types of curves we encountered. A \"normal\" LOESS curve is represented by Fig. 2a , where the minimum habitat amount at which there was a 50% probability of presence in the landscape could be estimated directly from the graph. Fig.  2b represents a species that always had. a presence >50%, regardless of the amount of habitat in the landscape. In this situation, the minimum habitat amount at which there is a 50% probability of presence was taken to be 1%. Fig. 2c represents the opposite situation, in which the species never reaches a 50% presence. In this case, the minimum habitat amount was taken to be 99%. Fig. 2d represents the situation in which there is more than one habitat amount where the species has a 50% presence. In this situation, the minimum habitat amount was taken to be the lowest amount of habitat in which the species has a 50% probability of presence in the landscape.\nFinally, we used linear regression analysis in SAS (SAS Institute 1990) to test for an interspecies relationship between the minimum habitat required for a 50% probability of presence in the landscape and annual reproductive output.\nThe number of landscapes used in the analysis for each species ranged between 143 and 779, depending on the geographic range of the species (see Appendix).\nThe relationship between the proportion presence over the 10-yr window and the percent forest cover in the landscape is shown in Fig. 2 for four of the 41 forest bird species. The LOESS-smoothed curves are shown superimposed on the original scatterplot, and the vertical line shows the minimum habitat amount at which there is a 50% probability of presence in the landscape. The estimated minimum habitat amount required for a 50% probability of presence in the landscape is shown in the Appendix for each of the 41 species. See Vance (2002) for the remaining scatterplots and LOESS curves for the species not shown.\nA simple linear regression indicated that there was a significant negative (interspecies) relationship between the estimated minimum habitat amount at which there was a 50% probability of presence in the landscape and annual reproductive output (F,,39 = 7.71, P = 0.008, r2 = 0.16; Fig. 4) . This relationship was not driven by extreme data points or by the designation of 1% minimum habitat requirements for those species that are always present in 50% of the years, regardless of the amount of habitat in the landscape, and the designation of 99% minimum habitat requirements for those species that are never present in 50% of the years. In fact, the relationship was stronger when we removed these species from the analysis (F, 26 = 8.79, P = 0.006, r2 = 0.25)."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Annual reproductive output", "text": "The clutch size and number of broods produced per year, as well as the estimated annual reproductive output for the 41 forest bird species, are shown in the Appendix. The average clutch size ranged between 2.5 and 7 eggs (4.30 + 0.14 eggs/clutch; all values are expressed as mean ? 1 SE), whereas the average number of broods produced per year ranged from 1 to 2.5 (1.34 ? 0.06 broods/yr). When these above two values were multiplied, the result was an average annual reproductive output that ranged between 2.5 and 9 eggs (5.71 + 0.28 eggs/yr). The Black-billed Cuckoo produces the fewest eggs, with an annual average of 2.5 eggs, whereas the Eastern Phoebe, Tufted Titmouse, and Yellow-rumped Warbler produce the most eggs, averaging nine per year."}, {"section_title": "Landscape data", "text": "There was considerable variation in the amount of forest among the 779 landscapes, with forest cover ranging between 0.00% and 96.88% (see Fig. 3 )."}, {"section_title": "DISCUSSION", "text": "This is the first empirical study that directly shows an interspecies relationship between minimum habitat requirements and annual reproductive output. The result is in agreement with predictions from the modeling studies of Fahrig (2001) and With and King (1999): species that have a lower reproductive output require more habitat for population persistence than those species that have a higher reproductive output.\nWithin the fields of ecology and conservation biology it is has long been assumed that species with low reproductive rates require more habitat, and thus are more prone to extinction, than species with high reproductive rates. However "}, {"section_title": ". Examples of each of the four types of LOESS curves observed with the 41 forest birds used in the analysis.", "text": "Minimum habitat (forest) requirements at which there was a 50% probability of presence of the bird species in the landscape over a 10-yr window were estimated from these LOESS curves. The locations of the minimum habitat requirements along the axis of habitat amount (forest cover) are shown by the vertical bars. (a) The \"normal\" LOESS curve for which the minimum habitat requirement for a 50% probability of presence in the landscape could be estimated directly from the graph (22 species, with Veery as an example). (b) S~pecies for which the probability of presence over the I10-yr window was always higher than 50% on the LOESS curve, as typified by Eastern Wood-Pewee. The minimum habitat amount for these species was detcrmiincd to bc 1% (5 species). (c) Species for which the probability of presence never reached 50% on the LOESS curve (e.g., Louisiana Waterthrush). The minimum habitat requirement for these species was estimated at 99% (8 species). (d) Species for which the 50% probability of presence in the landscape occurred at more than one habitat amount. We took the minimum habitat requirement to be the lowest amount of habitat at which the species was present in 50% of the years (6 species). 1996) found that geographical range reductions of conilurine rodent species, which are undergoing high rates of extinction and decline in Australia, were less severe for those species that have higher annual reproductive rates. Diamond (1975) found that those species capable of surviving on smaller and'more remote islands had longer breeding seasons and were capable of raising more broods per year than those species not found on these islands. In addition to these two studies, several anecdotal comparisons have been made between species with vast differences in reproductive abilities, such as comparing habitat requirements for large and small mammals (Peters 1983 , Calder 1984 ). This study is unique because the cross-species comparison was limited to forest birds with comparatively similar body sizes (Dunning 1993 ) and the variation in annual reproductive rate was relatively small. Sutherland et al. (2000) found that body size scales with natal and breeding dispersal distance, such that dispersal distance increases with increasing body size. Because the birds in this study have fairly similar body sizes, they should be scaling to the landscape in a similar way. We investigated the possibility that potential confounding covariates may have produced a spurious relationship between minimum habitat requirements and annual reproductive rates. These ancillary analyses suggest that this was not the case. There was no significant relationship between body size and annual reproductive rate (F,,39 = 0.30, P = 0.59, r2 = 0.008), or between body size and the minimum habitat required for a 50% probability of presence in the landscape (Fl 39 = 0.06, P = 0.81, r2 = 0.001). Similarly, there was no significant difference in annual reproductive output between species restricted to forests (16 species) and species that are more generalist in their habitat use (25 species; t = 1.12, df = 39, P = 0.27). Therefore, although the amount of habitat required for a 50% probability of presence in the landscape may have been underestimated for generalist species, this could not have produced the observed relationship between annual reproductive output and minimum habitat requirements (although it probably added noise to the relationship). The observed relationship also is not due to an underlying latitudinal trend in habitat amount. There was no significant relationship between percent forest cover and latitude (F, 777 = 0.26, P = 0.61, r2 = 0.0003). Although we did observe a small positive relationship between altitude and forest cover, this did not produce a spurious relationship between reproductive output and minimum habitat requirements. This would occur if high-elevation study species had lower reproductive output than low-elevation species. In fact, the seven study species that prefer higher elevations (Black- Finally, differences in species' detectability could potentially introduce bias into the results if species with low reproductive rates also had lower detection rates relative to species with high reproductive rates. We minimized this potential problem at the onset of this study by excluding species that are known to be sampled poorly by the BBS (e.g., nocturnal species, raptors). Furthermore, four of our study species were determined to have lower detection rates due to their secretive nature, quiet song, or less persistent singing (Brown Creeper, Black-billed Cuckoo, White-breasted Nuthatch, and Blue-gray Gnatcatcher; Poole and Gill 1992-ongoing). Those species had a mean annual reproductive rate of 5.31 + 0.98 eggs/yr, which is not significantly lower than the mean annual reproductive rate of the remaining 37 study species (5.76 ? 0.29 eggs/yr)(see Appendix). Although this provides evidence, from a small subset of species, that behaviors leading to low detectability did not confound our inference, more subtle differences in detectability among Intuitively, it has long been understood that smaller populations have a higher risk of extinction due to demographic stochasticity (Goodman 1987 , Pimm et al. 1988 , Raup 1991 , Boyce 1992 . It is also intuitive that landscapes with less habitat support smaller populations than landscapes with more habitat. Species with a higher reproductive potential are better able to survive in landscapes with less habitat because they can recover more quickly from low population numbers caused by environmental disturbance, disease, or predation. Species with a lower reproductive potential remain at low population levels longer, thus increasing their risk of extinction (Pimm et al. 1988 ). An additional advantage for species with a higher reproductive output is that they produce more dispersers that are then able to colonize other areas in the landscape.\nModeling studies predict the existence of speciesspecific habitat extinction thresholds for population persistence, whereby a small reduction of habitat at the threshold results in a sharp drop in the probability of persistence (Lande 1987 . In this study, we were unable to consistently locate the extinction thresholds for our species. Thus, to avoid the subjectivity of locating these thresholds, we calculated the amount of habitat required for a 50% probability of presence in the landscape. We stress that the minimum habitat requirements measured in this study are not absolute minimum habitat requirements, but rather relative requirements that allowed a crossspecies comparison.\nThe relationship between minimum habitat requirements and annual reproductive output found here (Fig.  4) is particularly significant because the estimates of habitat and reproductive output contained many sources of error. First, the estimated annual reproductive rate was averaged to encompass a species' entire range, yet for some species there is considerable geographic variation within the study area in the number of eggs produced per year (Ricklefs 1973 1992-ongoing) . Differences in species detectability may also have been a source of extraneous variation in this study (Boulinier et al. 1998 ). We minimized this potential problem by excluding species that are poorly sampled by the BBS. One way to lessen the detectability issue would be to repeat the analysis at the species level by looking at geographic variation in annual reproductive rates and minimum habitat requirements, and testing to see if the negative relationship still holds.\nThe methodology of the Breeding Bird Survey itself is another potential source of unexplained variation. Because the BBS is a roadside survey, there is a potential for bias in the types of habitats found next to roads (Bart et al. 1995, Keller and Scallan 1999). In their study in Maryland and Ohio, Keller and Scallan (1999) found that forest was underrepresented in the habitat along roads. This may have resulted in an underestimation of the true proportion presence in the landscape over the 10-yr window. However, as all the species in this study are forest birds, this bias should have been consistent across species. Another criticism with the reliability of BBS data is the difference in observer quality (Sauer et al. 1994 , Kendall et al. 1996 . BBS observers differ in their ability to count birds, and thus there may be differences between observers in the estimation of species abundance (Sauer et al. 1994 , Kendall et al. 1996 ). These differences in observer quality should be minimized in this study because we used presence/absence data, not abundance, for each route. Despite the inherent biases with data, the BBS remains a very valuable source of information for the status of North American birds at a continental scale.\nA major challenge facing conservation biologists and wildlife managers is to predict how fauna will respond to habitat loss. Different species require different amounts of habitat for population persistence, and it is imperative that we identify the factors that affect these habitat requirements. This study shows a clear negative relationship between a forest bird species' reproductive rate and the amount of habitat required for a certain probability of presence in the landscape. This result brings empirical evidence to the long-held belief that species with low reproductive potential are more prone to extinction due to habitat loss than species with high reproductive potential. Until landscape-scale minimum habitat requirements needed to maintain viable populations can be measured empirically, it will be necessary to maintain large tracts of forest throughout the breeding range to ensure population survival of all species."}, {"section_title": "ACKNOWLEDGMENTS", "text": "We are grateful to all members of the Landscape Ecology Laboratory at Carleton University for their input at various stages of this project. We thank E. F Connor and an anonymous reviewer for constructive comments on the initial manuscript. We would also like to thank the Canadian Wildlife Service (CWS), Ontario region, for the digital species' range maps, and the U. "}]