[{"section_title": "", "text": "The project described in this report was designed to render an in-depth analysis of what has happened to doctorate completion times since 1967, to provide a time-series data base for the period 1967-1986, and to develop a model that explains some of the factcrs that have caused an elongation to occur. Chapter 1 begins with an examination of how and when time to the doctorate (TTD) has been lengthening, illustrated by the rise in mean total TTD from 1967 to 1986 in each of the 11 fields studied. Chapter 2 reviews five avenues of inquiry in the literature as they relate to TTD and models of student decisionmaking. Chapter 3 introduces a causal model of the determinants of TTD based on an opportunity-cost framework of student decisionmaking. Chapter 4 presents selected data on the zero-order correlations between the independent variables in the model and TTD (and its components). Chapter 5 introduces a statistical model and presents a summary of which regression coefficients are significant (and of their signs) for alternative specification of the model. Chapter 6 presents the regression coefficients for the basic model and several variants using registered time to the doctorate (RTD) as the dependent variable. Finally, chapter 7 discusses the findings in this study, their implications, and research questions that warrant further study. Contains an appendix and selected bibliography. "}, {"section_title": "00", "text": ". time that students take to complete the doctorate. Although time to the doctorate has been studied by Abedi and Benkin (1987), Berelson (1960), Prior (1962), and Wilson (1965), none of these studies are based on a causal model of student decisionmaking, and none consider the role of market forces in student decisions. The data presented in Chapter 1 suggest that time to the doctorate in science and engineering fields has been lengthening since 1967in some fields, by as much as two years. Furthermore, it is anticipated \"at the lengthening trend will persist, at least into the near future, and have unfo. .ate consequences because of the decline in the college-age population and the dramatic increase expected in the number of job openings in the academic sector in the 1990s. In response, public policy makers are likely to become increasingly concerned with identifying and understanding ways to augment the supply of new doctorates. While shortages of this type are not expected for a few years, it is useful now to determine whether policies can be adopted that can limit or reverse the trend toward longer completion times in the science and engineenng fields. Existing studies do not provide the information nezded by policy makers to determine whether public policy could, or should, alter completion times sufficiently to slow or reverse the trends discussed in Chapter 1, or whether any policies can have a major impact on supply in the impacted fields. The purposes of the present study are to render an in-depth analysis of what has happened tc completion times since 1967, to provide a time-series data base for the period 1967-1986, and to develop a model that explains some of the factors that have caused an elongation to occur. This study looks at the effects of changes in five types of variables: family background characteristics, student attributes, financial aid, institutional environment, ar 3 market forces. Using data from the Doctorate Records File and the Survey of Doctorate Recipients maintained by the Office at' Scientific and Engineering Personnel (OSEP) of the National Research Council and from other data sources,* the study develops a model to explain changes in both total time to the doctorate (TTD) and in the 4: A more detailed description of the data from these sources is available on request from the National Research Council, Office of Scientific and Engineering Personnel. iii -5 -----=.-several components of time to the doctorate. The model is then applied to 11 scientific and engineering fields: chemistry; physics and astronomy; earth, atmospheric, and marine sciences; mathematical sciences (including computer and information sciences); engineering; agricultural sciences; biological sciences; health sciences; psychology; economics; and all other social sciences. This report is organized as follows. Chapter 1 begins with an examination of how and when time to the doctorate has been lengthening, illustrated by the nse in mean TM from 1967 to 1986 in each of the 11 fields. Three components of TM are introduced, and the mean values for each are presented and discussed. In addition, time coefficients allow one to contrast the way in which time to the doctorate has changed during the period, and two patterns of change are identified. Finally, quantitative estimates areprovided of the person-year losses that society has incurred from the lengthening of completion time during this period. Chapter 2 reviews five avenues of inquiry in the literature as they relate to time to the doctorate and models of student decisionmaking. Chapter 3 introduces a causal model of the determinants of TTD based on an opportunity-cost framework of student decisionmaking. The role of financial aid and of market forces is explored in this context. Chapter 4 presents selected data on the zero-orLer correlations between the independent variables in the model and TTD (and its components). The correlations among the salary variables and unemployment/employment plans variables are discussed, and the contribution of each major vector (e.g., family background and student attributes) is examined. Chapter 5 introduces the statistical model and presents a summary of which regression coefficients are significant (and of their signs) for alternative specifications of the model. Several variants of the model are introduced to explore the effects of alTrnative measures of the key variables. Chapter 6 presents the regression coefficients for the basic model rnd several variants using registered time to the doctorate (RTD) as the dependent variable. Finally, Chapter 7 discusses the findings in this study, their implications, and research questions that warrant further study. In addition, an extensive bibliography of readings on the determinants of student decisionmaking is provided (pp. 107-111). Appendix A (pp. 113-173) provides additional tables about (1) the components of TTD, (2) the person-year losses resulting from a lengthening of TTD, (3) variables in the model, (4) zeroorder correlations among the independent variables, (5) several equations for estimating TTD, and (6) median total time to doctorate for the population as a whole and for selected demographic groups. Finally, acronyms used throughout this report are listed in Appendix B (pp. 175-177). suggests that student completion times are becoming mo7e concentrated around the mean. The rise in TTD is occurring at a nonlinear rather than a linear rate. In chemistry, physics and astronomy, and engineering, TTD has been rising at a decreasing ratc. However, in the eight other fields examined, TTD has been rising at an increasing rate and is thus cause for greater concern. Trends in Components of TTD TTD can increase because students spend more time registered as students or because interruptions on the path from a bachelor's to a doctorate cause them not to be enrolled in school. Analysis of components of TTD Indicates that most of the increase is attributable to the increase in registered time to degree (RTD)that is, TTD less the time prior to graduate school entry (TPGE) and time not enrolled in graduate school (TNEU). In all of the 11 fields examined, RTD has increased substantially since 1967, accounting for most of the change in TTD in every case. Where RTD did not account for the total increase in TTD, interruptions in studies were the most frequent cause for lengthening of TTD. Delays in starting graduate school were an important additional explanation in only one field, health sciences."}, {"section_title": "Modeling TTD", "text": "Careful review of the relevant literature reveals five distinct but ielatcd lines of Inquiry that bear on the development of a model of the causes of the rise in TTD. These lines of inquiry include the determinants of persistence and attrition, students' educational aspirations, the factors affecting enrollment in college, the role of expected returns and their effect on the decision to enter graduate school, and the literature on TTD. Several variables are consistently Identified as affecting student choice: financial aid, whether the student is selfsupporting, immediate background characteristics (rather than past background), quality of the undergraduate and graduate college, and differences in expected earnings and changes in market conditions. The model used in the present study consists of five vectors of variables: family background characteristics, student attributes, tuition and financial aid, institutional environment and policies, and market forces. The model is estimated in both linear and nonlinear form and with two variants. Variant 1, the \"common variables\" model, includes the same variables for each field and is designed to determine whether a consistent set of variables is important in each field. Variant 2, the \"unique variables\" model, allows the number of variables in the explanatory equation to vary so that only those that are statistically significant are included in each final regression equation. For each field, regression equations are estimated using the 1967-1986 years as the units of analysis. Separate analyses made for the TTD and RTD variables produce the following results: 2 13' Results For TTD: Student characteristics and market forces are the key variables that affect TTD. However, the explanatory variables differ by field and by equation specification. The variable that most consistently explains rises in ITD is age at time of entry to graduate school. This is statistically significant in 9 of the 11 fields studied. Unfortunately, the model does not enable one to determine whether this variable relates to physical or intellectual effects of age (e.g., it takes older persons longer to learn) or whether its effects on TTD operate primarily because students who start later have a longer TPGE. Among the market force variables, the salary ratio of doctorates 10 years after the doctorate to the salary of recent doctorates is significant in chemistry and EAM (using the common variables linear model) and in agricultural sciences and psychology (using the unique variables model). The salary level of doctorates 10 years after the degree is statistically significant in economics and social sciences. Among the family background variables, femab gender is statistically significant in EAM and marine sciences. Type of institution attended affects TrD in some fields and quality of undergraduate institution (but not quality of graduate institution) is usually statistically significant. In psychology, a 1 percent increase in the percentage of a doctoral cohort with a bachelor's degree from a top 70 institution is associated with a 0.1 year decrease in TTD. Results for RID: No one variable is consistently large enough or consistently statistically significant enough across fields to explain the observed increase in RTD in all fields. Instead, different combinations of variables explain the rise in RTD in each of the 11 fields. In those equations where age is statistimly significant, it tends to have a large impact on RTD. In the common variables log model, for example, the coefficients of the models range from 0.9 years (health sciences) to 6.4 years (social sciences). Since RTD is purged of TPGE, age does not act as a measure of late arrival at graduate school and, hence, its meaning is somewhat clearer in these regressions. Perhaps in part as a consequence, the age variable is not statistically significant in as many fields in the RTD equations (4) as it is in the TTD equations (9). Financial aid that reduces student reliance on outside employment can make a difference in terms of RTD, and the type of aid is important in determining RTD as to which type of aid is most likely to reduce RTD, the models do not permit a single statement that applies to all fields. Instead, the effects of financial aid are highly field-specific. For example, a 1 percentage point change in federal support reduces RTD by 0.06 percent in EAM, 0.11 year in biological sciences, 0.23 in health sciences, and 0.09 in economics. Teaching assistantship (TA) support reduces RTD in EAM but increases it in biological sciences; and research assistantship (RA) support reduces RID in math but raises it in biological sciences. The effects of particular forms of aid warrant further exploration. In the fields of chem* ry, mathematics, and economics, increases in the percentage of students with baccalaureates increase RTD in the common 3 1 4 variables log model. Changes in market variables, particularly in the unemployment rate and the salary ratio, also affect RTD. Specifically, in the common variables log model, increases in the unemployment rate of 4-year college graduates tend to reduce RTD. A 1 percentage point change in the variable causes a 0.07 decline in TTD in EAM and a 0.02 decline in biological sciences. In the unique variables model, an increase in the percentage of new graduates seeking (but not yet finding) a position prior to graduation raises RTD in the biological sciences. Finally, increases in salaries for those who already hold doctorates, relative to increases in the salaries of new doctorates, have the effect of reducing RTD. This phenomenon is found primarily in the unique variables model and primarily in chemistry, nnthematics, biological sciences, health sciences, psychology, and economics (Note: Several ratios are constructed with different years in the denominator, and which ratio is statistically significant is field specific). Additional research on the sources of the rise in TTD is warranted. The process of acquiring a doctorate is a complex one that involves a variety of decisionmakers. No one set of unique factors adequately explains the rise in TTD and RTD. Moreover, our findings lack robustness with respect to the determinants of 1TD and RTD. This may, in part, be attributable to lack of sufficient indep.:ndent variation in the doctoral cohort's average annual timeseries data for the period 1967-1986. For example, although time-series analysis did not indicate large and uniformly statistically significant effects for the student aid variables, simple cross-tabulations for 1986 and 1987 show that students reporting primary support from \"own\" earnings take, on average, over five more years to complete the doctorate than those with external financial aid. While this difference may be attributable to differences in the abilities and knowledge of recipients and non-recipients, we cannot rule out the possibility that a study of individuals would produce a stronger role for the financial variables. It may well be that altemative units of analysis will produce different and/or more consistent results than those presented here."}, {"section_title": "Conclusions", "text": "The data in this report indicate that students in general now take longer to complete their doctorates than at any previous time in this century. This exploratory analysis of the factors underlying these trends revealed a complex process that is affected by a variety of factors including availability of student support, labor-market conditions, sociodemographic characteristics of the degree recipients, and characteristics of both undergraduate and graduate degree-granting institutions. As noted earlier, no one of these factors consistently explained the pervasive upward trend that was found. Thus, more effort will be required to enhance understanding of this process. Moreover, the authors did not explore the consequences of these trends, although the rising trend in TTD found in this study might lead to unacmp.14 4 1 5 high levels in some fields. First, increases in TTD lengthen the amount of time required for the supply to respond to any shifts in market demand. Such lags in supply responsiveness are costly to society. Second, increases in TM may raise the costs and lower the returns to investment in doctoral training with possible consequences for career choice decisions of potential doctoral Jtudents. Other things equal, higher costs and lower returns can discourage students from pursuing training at the doctoral level. In addition, given the decision to pursue such training, increasing TTD may encourage some students to drop out before completing their degrees. Finally, lengthening TTD may, other things equal, reduce productivity by reducing the number of years spent by cohorts of newly produced degree-holders working as doctorates. Little is currently known about these possible consequences, but they are potentially serious enough to merit furthe: attention. While factors leading to attainment of the doctoral degree have attracted research attention over the last 30 years, only recently has interest focused on the length of time it takes to earn the degree. Surprisingly, most current studies seem to overlook the phenomenon of increasing time to the doctorate occurring over the last two decades. Aggregate data on doctoral degrees show that while median time to the doctorate decreased in the 1960s, the decline was followed by a rather swift and steep increase through the 1970s and 1980s (Figure 1). Although lengthening degree time might simply reflect a distributional shift from doctorates in fields in which time to the doctorate is short (such as physical sciences and engineering) to those in which it is longer (such as humanities and education), other studies have found the increase is occurring in all fields (Coyle, 1987).  1962 1966 1970 1974 1978 1982 1986 Year Figure 1 Median years to the doctorate, all fields combined including humanities and education fields, 1958-196. 7 1 7"}, {"section_title": "-", "text": "--a Components of Time to the Doctorate and How They Have Changed Through Time The Several Kinds of Time Thc time required to complete thc doctoratc can be measured in a number of ways, and thc type of measurement used affects the degree of observed change as well as conclusions about which factors led to that change. Thc most comprehensive measurc of time is total time to the doctorate (HD), dcfined as the timc from reccipt of an undergraduate degree to completion of the doctorate. TTD is particularly useful for \"pipeline\" studies that examine the availability of new doctorates to cntcr the labor force. Similarly, 1TD is useful for determining how quickly thc supply of doctorate-level personnel will rcspond to changcs in the demand for people with doctorates. Other things being equal, for example, a 10-year TTD would mean a delayed response of ncw doctorates to an increase in demand and a long wait for employers wanting to hire them. Time to the doctorate also can be measured by the length of time that a studcnt is actually rcgistcred in graduate school. Registered time to doctorate (RTD) is defined as TTD less the length of time prior to graduate entrance (TPGE) and any other time not enrolled in the university (TNEU)that is, RTD = TTD -(TPGE + TNEU). TPGE may consist of service in the armed forces, time spent in travel, leisure or home-related activity, and/or postbaccalaureatc work experience. Therc arc two additional elements of RTD for which wc have no measure: time spent in actual study/work toward the degree and time spent at the university in othcr pursuits. RTD is not a measure of the minimum time needed to complete thc doctorate, since time spcnt in nondoctorate-related activity is also included. RTD, like TTD, is a mcasurc of how quickly supply can rcspond to demand. In addition, it can be used as an indicator of the need for faculty and other resources in a graduate program. Thc relationship among these four time measures is summarized in Table 1.1. Mean TTD for each of 11 science and engineering fieldschemistry; physics and astronomy (\"P&A\"); earth, atmosphcric, and marine scicnccs (\"EAM\"); mathematical scienccs, including computer and information sciences (\"math\"); engineering; agricultural scicnccs; biological sciences (\"biosciences\"); health sciences; psychology; cconomics; and all othcr social scicnces (\"social sciences\")is taken from thc Doctoratc Records File (DRF), thc data base of the Survey of Earned Doctoratcs conductcd annually by the National Acadcmy of Sciences' Office of Scientific and Engineering Personnel (scc, for example, Coyle, 1987: Table 2). Mcan TTD, rather than mcdian TTD, is used '' -cause it is more sensitive to small yearly changes in the data and easier tt  among fields.1 Although mean values can sometimes be distorted by the existence of a few outliers in the data, we did not encounter evidence of this problem (see Appendix Tables 2.1-2.5). The time required to complete the doctorate has been increasing in the sciences and engineering primarily because students are spending more time in graduate school (i.e., RTD is rising). Mean Total Time to the Doctorate Mean TID increased in each of the 11 fields from a low of about four months in economics to a high of nearly three years in the health sciences (see Appendix Table 2.1). All but biosciences and agricultural sciences experienced double-digit percentage increases in TID, The greatest increase, 30 percent, was in math, and 1TD lengthened significantly even in fields in which it already was quite long. For each field, the within, year variation in1TD decreased from 1967 to 1986, suggesting student completion times more concentrated around the mean. 1 Means are also used to provide the estimates of person-year losses shown on pp. 22 of this chapter. Although our analysis is confined to a discussion of mean times, median times have also been increasing (see Appendix Table 1). 2 Appendix Tables 2.1-2.5 display the mean TTDs, TPGEs, RTDs, and TNEUs and their respective standard deviations, for each of the 11 fields at two points in time: 1967 and 1986. :. Although fairly large TPGE increases occurred in three fieldsrnath, psychology, and health sciencesTPGE was a small portion of TTD in most fields. Two fieldsEAM and agricultural sciencesexperienced a decrease in TPGE. Analysis of the coefficients of variation for each year again revealed that within-year variance went down between 1967 and 1986, suggesting greater concentration of TPGE times around the mean. Mean Registered Time to the Doctorate Ideally, registered time to the doctorate should be broken down into time spent working toward the doctorate and time spent at the university in teaching or other activities unrelated to the doctorate (Berelson, 1960). Unfortunately, the DRF does not separately identify these two components. In all of the fields in the study, RTD increased at double-digit rates (see Appendix Table 2.3). Measured in botb percentage and absolute terms, the largest increases occurred in the social sciences (where RTD rose from 5.9 to 8.8 years, or almost 50 percent) and economics (where RTD jumped from 5.1 to 7.0 years, or 37 percent). The smallest increases in RTD were in chemistry, P&A, and engineering. Overall, increases in RTD accounted for at least half of the increase in TTD and, in some fields, it aecounted fo: over 100 percent of the increase.3 Mean Time Spent Away from the University Students have many reasons for leaving the university prior to completing the doctorate. They may have financial difficulties, may be discouraged and/or frustrated with academe, or may need to seek additional data to finish the doctoral thesis (Dolph, 1983;Spady, 1970). Time not enrolled in the university increases TTD and, hence, is a variable worthy of separate consideration. In most fields, TNEU decreased by at least half a year between 1967 and 1986. However, there was wide variability among the fields. For example, the decline was 1.5 years in economics, almost a year in health sciences, half a year in the biosciences, two-and-a-half months in math, and less than a month in psychology. Within-field variation for TNEU decreased in six fields and increased in five (sec Appendix Table 2.4)."}, {"section_title": "mm a ry", "text": "The major factor responsible for the change in TTD between 1967 and 1986 was the growth in RTD. in a majority of fields, a decline took place in TPGE and in TNEU (see Appendix Table 2.5)."}, {"section_title": "The Nature and Significance of the Time Trend", "text": "The literature suggests it is now taking longer to complete a doctorate than at any other time. The upward slope of TTD follows a rather extended period of stability in time to the doctorate. In the near future, it will take even longer for doctoral candidates to complete their degrees."}, {"section_title": "The Two Models", "text": "The authors used statistical modeling to look at changes in TTD and other variables during each of the years between 1967 and 1986. For each field of study, regresrion equations were estimated using TTD or one of its three components as the dependent variable and time as the independent variable. Two different models, one which assumes that time has a linear effect [TTD = f(T)] and another which assumes a non-linear effect over time [TTD = f(T,T2)], were used. Using the linear model, for example, for chemistry students resulted in the conclusion that TTD increased by an average of 0.03 years per annum (or roughly 1 1/2 weeks per year) during the 1967-1986 time period (Table 1.2): a chemistry Ph.D. in 1967 took one-and-a-half weeks longer to complete the degree than in 1966 and nearly 30 weeks longer in 1985. Using the non-linear model, the increase in TTD for a chemistry doctoral candidate was about three weeks in 1966 and about 62 weeks in 1985.4 4 These figures were determined as follows: the increase from 1966 to 1967 = 0.0632 years = (0.065 x 1) -(.0018 x 5) and from 1966 to 1985 = 1.20 years = (0.065 x 19) -(.0018 ), 19)."}, {"section_title": "23", "text": "The non-linear model produces a larger annual increase in TTD over time than the linear model for most fields and, with the exception of agricultural sciences, values derived from both the linear and non-linear models are statistically significant. In general, the non-linear model explained more of the variance than the linear model and, in most fields, provided a better fit of the data, hence a more accurate estimate of the effects of time on TTD."}, {"section_title": "Patterns of Change", "text": "In all 11 fields, there is a distinct and statistically significant upward trend in both TTD and RTD (Tables 1.2 and 1.3), although the trend is more pronounced for RTD than for TTD. For TTD, a non-linear time trend exists in most fields, suggesting that both the increase in time to the doctorate and the rate of change have differed across fields. Completion times accelerated in seven fields (EAM, agricultural sciences, biosciences, _health sciences, psychology, economics, and social sciences) and accelerated and then decelerated in four (chemistry, P&A, math, and engineering). For RTD, distinct patterns also emerge for each field, with some showing acceleration and others showing deceleration. A comparison of RTD and TTD suggests that in most fields the coefficients are quite close. This is not the case for the other components of time to the doctorate, however, suggesting that RTD is the factor most responsible for lengthening TTD. An examination of time trend coefficients for the set of regressions using TPGE as the dependent variable shows that, in all fields, the amou.t of variation explained by time is less for TPGE than for RTD, in some cases half as much (Table 1.4). The non-linear model is preferable to the linear one in most fields, although in some fields its use has little impact on R2. Using the non-linear model dramatically improves fit in the biosciences, economics, and social sciences; and it shows small gains in R2 in math, engineering, health sciences, and psychology. The results again suggest that the time trend differs among fields. The final set of regressions uses TNEU as the dependent variable (Table  1.5). In the linear model, mean time not enrolled in the university falls in seven fields (chemistry, P&A, EAM, agricultural sciences, biosciences, economics, and social sciences); rises in math, health sciences, and psychology; and remains stable in engineering. The results again suggest that the non-linear model provides better predictions of the time component in most of the fields.    The analysis shows time to the doctorate lengthened in all fields, and the time trend was non-linear for each of the three time components that make up TTD. Regression analysis revealed two distinct patterns in TTD (Tables 1.2 and  1.3). Data in eight fields was U-shaped, with a negative (or positive) T and a positive T2 term, leading to an initial rise it-TTD or a decline followed by an accehation in TTD. This pattern existed in EAM, math, agricultural sciences, biosciences, health sciences, psychclogy, economics, and the social sciences. That TTD in these fields may continue to lengthen at an increasing rate over time is a source of potential concern. Data for three fields showed an inverted U shape, with a positive T and an negative T2 term. For chemistry, P&A, and engineering, this pattern led to an eventual decline in the ra:e of increase in TTD over time. Figure 3 shows the actual data for each of the 11 scientific and engineering fields. Since the non-linear time-trend model explained more of the variation in ITD than the linear model, it was used to forecast TTD for 1987. The results were then compared with the actual TTD values for 1987 (Table 1.6). The nonlinear model closely projected TID in 8 of 11 fields (within 0.01-0.34 year) but underestimated by close to half a year TTD in math/computer sciences, EAM, and agricultural sciences. The model produced a slight overestimate in TTD in the health and social sciences. For engineering, the projected and actual values were virtually the same."}, {"section_title": "Manpower Loss from Lengthening", "text": "Total Time to the Doctorate One important implication o'.. the lengthening of ITD is that a given doctorate yields fewer potential person-years of labor force effort to society. The potential manpower loss calculated from increasing TTD does not equate to the total social implications of this trend. For example, no allowances are made for changes in the quality of new doctorates, market salaries, unemployment rates, on-the-job training times, or losses of Ph.D. positions at institutions that use predoctorates for research, teaching, or other work activities. Similarly, graduate students who might have been discouraged from obtaining a doctorate because of the time required to earn the degree are left out of the calculation. In addition, the baseline year used for the calculation is 1967. No presumptions are made as to whether the TTD in 1967 was better or worse than that which prevailed in some other year, since the goal is not to define the optimum year on which to  196719671967Year Economics Other Social Sci. 1967. 1967Year 1967 Figure 3 Mean total time to the doctoratt% by field, 1967-1986. 30 .,......4 rhl  , 1968-1986 Field of Doctorate *Determined by dividing \"estimated number of lost person-years\" by the total number of new doctorates provided during this period."}, {"section_title": "22", "text": "calculate TID but, rather, to provide a quantitative estimate of how much highlevel manpower has been lost over time. To figure manpower loss, mean TM calculated for each field and each year is subtracted from the 1967 mean TTD. The result is multiplied by the ntznber of new doctorates in the given year to determine the manpower lost. The total loss for each field is calculated by summing the loss in each year beginning in 1968 and ending in 1986. A percentage loss is calculated by dividing the total person-years lost in all fields by the total number of new noctorates produced during this period. The calculation assumes all new doctorates are employed. Table 1.7 and Appendix Table 3 provide crude estimates of the potential gain in Ph.D. supply if TID was reduced to the 1967 levcl. It should be noted, however, that these may be upper-limit estimates of the loss because many individuals pursuing the doctorate over an extended time simultaneously performed other work whose value to society cannot be determined. These figures do not take into account the effects of increases in TTD in discouraging career choice. Table 1.7 suggests that a small but meaningful increase in supplygreatest in psychologycould be achieved if the trend toward a longer ITD could be reversed .   23   3 3   2   MODELS OF THE FACTORS  THAT AFFECT STUDENT CHOICE AND TIME  TO THE DOCTORATE: A LITERATURE SURVEY Over the past 30 years, an extensive literature has developed addressing TTD and the factors affecting student decisions to pursue postgraduate education. The literature has focused on five lines of inquiry: (1) persistence and attrition, or factors that cause students eithcr to complete their education or to terminate it before a degree is received; (2) educational aspirations, or students' plans for pursuing additional education and training; (3) enrollment in college, which is similar in focus to the literature on aspirations but often uses differen, assumptions and statistical approaches to study the problem of student choice; (4) expected or perceived value of investing in education; and (5) TTD. This review is selective in nature, focusing mainly on findings that aid in an understanding of student choice."}, {"section_title": "Literature on Persistence and Attrition", "text": "The focus of much of the early research on attrition identified factors that caused students to quit school at the undergraduate and graduate levels (Berelson, 1960;Summerskill, 1962), not the processes that caused individuals to drop out or the quantitadve impact of the factors involved. Descriptive approaches of this type can still be found in the current literature (e.g., Teague-Rice, 1981;Dolph, 1983), but more recent studies, beginning with the work of Spady (1970) and the model proposed by Tinto (1975), focus on causality. The model by Vincent Tinto (1975) is important because it explains how the interaction of many factors affects decisions to remain in school or to drop out. Longiuidinal and theoretical in nature, the model assumes individuals enter institutions with specific attributes, background characteristics, prior experiences, and commitments that are integrated into their academic and-social lives. The institution itself may have important effects on grade performance, intellectual development, peer group interaction, and faculty interaction with students."}, {"section_title": "34", "text": "In Tinto's model, grade performance and intellectual development contribute to academic integration and thus to goal commitment, and peer-group and faculty-student interactions contribute to social integration and to the student's commitment to the institution. And the interplay between the individuars commitment to completing college and his/her commitment to the institution affects the decision whether to drop out and for how long. Other researchers have used the Tinto model as a basis for regression and path analys,..:s, and their findings tend to support Tinto's theory. For example, Pascarella and Terenzini (1983) found that social and academic integration have about equal effects on persistence and that students who are betta integrated into an institution are more likely to complete the undergraduate degree than those who are not. Several other causal models are discussed in Bean (1980). For the most part, the factors identified by Tinto as having an impact on students are the same across studies, although some researchers differ as to which factors have direct and which have indirect effects. For example, Smart and I ascarella (1986) argue that schooling plays a direct role in determining social mobility. Differential levels of educafonal attainment yield different levels of achievement among persons with equivalent social backgrounds. Education also indirectly affects social mobility by serving as a \"mediator\" through which individual resources such as ability and background are converted into earnings and occupational status. Two aspects of the Tinto model warrant further comment. First, the role assigned to quality of college is ambiguous in the theory. Some researchers have found that better colleges produce a \"higher yield\" of graduates from the entering class (Knapp and Goodrich, 1952;Knapp and Greenbaum, 1953) while others have suggested the opposite (Davis, 1966).5 Many studies have looked at the role of college characteristics and college environment in affecting persistence and educational aspirations (see, br instance, Pascarella, Terenzini, and Hibel, 1978). Recent research shows that student interaction with faculty has a very small, albeit positive, effect on academic performance. In the Tinto model, faculty-student interaction affects persistence directly through its effect on social interaction and indirectly through its effect on grades. These two, in turn, affect academic integration and the decision to drop out (see Pascarella and Terenzini, 1979). Second, the Tinto model relegates changes in economic factors, such as unemployment and expected future earnings, to a category called \"external impacts upon dropout.\" Changes in these variables are assumed to affect persistence indirectly by operating on student commitmern to finish school and to the educational institution itself but do not directly enter the modes as observables. Interestingly, Tinto assumes that an individual goes through a benefitcost calculation to determine if it is worthwhile to stay in college, but he ignores the role that opportunity-cost considerations might play. Some who have relied on the Tinto model have considered economic factors as of secondary importance, although most studies assign a role to financial aid (c.g., Ethington and Smart, 1986). The relegation of economic factors to a secondary role makes it difficult to study the impact of economic factors other than availability of funds on the decision to drop out and also precludes researchers from using the Tinto model to explore the effects of market forces on student choice. Both descriptive and causal studies point to parents' education, student gradepoint average (GPA), race, and educational characteristics as affecting student persistence at the undergraduate level. These studies also tend to validate the importance of the interaction between students and faculty in keeping students in school. Other student variables associated with high attrition rates are upbringing in a rural area, father with less than a high school education, religion, and separation from ones spouse. Attrition at the doctoral level has been less carefully studied, is less well understood, and is most often expressed in descriptive rather than model form. For example, Tucker, Gottlieb, and Pease (1964) present data based primarily on student responses to questionnaires, indicating that the largest single reason for dropouts is student finances. Students without money to meet expenses or not having a teaching assistantship, research assistamship, or other financial aid were more likely to drop out than those with adequate financial support. Teague-Rice's (1981) study of female doctorates at Auburn from September 1971 to 1977 and Dolph's (1983) study of Georgia State students from 1970 to 1980 confirm the importance of scholarship, assistantship, or fellowship support. Students who are full-time, have a positive relationship with their dissertation chairperson, and score high on comprehensive exams also tended to remain on the doctoral track, according to these studies. A recent causal analysis by Girves and Wemmerus (1988) used the Tinto model to explore \"degree progress\" at the graduate level. For doctoral-level students, academic involvement appeared to have a direct impact on degree progress, while for master's-level students, such involvement appeared not to be important. Moreover, social integration did not seem to plan an important role in students' persistenct:, suggesting Tinto's conceptualization may not be entircly 27 valid at the graduate level. Grades were important determinants of persistence for master's-level students, while the effect of grades on degree progress disappeared at the doctoral leve1.6 Girves and Wemmerus argue that involvement in the academic program, the role of the advisor, the number of faculty members a student gets to know, the faculty/student relationship, and the type of financial support are all important in affecting degree progress, but the effect of some of these variables is indirect. Differences among fields, identified by Big lan (1973), also are important in influencing a student's decision to complete a doctoral program, Girves and Wemmerus say."}, {"section_title": "Literature on Educational Aspirations", "text": "There is a substantial body of research that attempts to identify the reasons students decide to attend graduate school (e.g., Baird, 1976;Gropper and Fitzpatrick, 1959). More recent studies are less interested in \"why\" than in the process by which key variables interact to shape student educational aspirations. One major line of inquiry looks at how the structural and environmental characteristics of colleges influence students to seek graduate training [see, for example, Astin and Panos (1968)]. Pascarella's 1984 study, which used a causal model of educational aspirations based on Tinto's dropout model, finds that the direct effects of any single aspect of the college environment are \"quite modest\" and the best predictor of educational avirations at the end of the second year of college is the level of educational aspirations at entrance to college. The only other factors directly affecting the decision to continue to a higher level of training are a student's cumulative GPA and a cumulative measure of college environment, according to Pascarell a. Other studies use somewhat different causal models and include different variables but, nonetheless, reach similar conclusions. Alwin (1974), for example, found that a small amount of the variation in student aspirations can be attributed to differences in the college environment after student inputs are controlled, and Heyns (1974) found that verbal achievement and curriculum placement affect the relationship between student inputs and student aspirations. More recently, Ethington and Smart (1986) modified the Tinto model to test how the decision to enter graduate school is made. The model 'Issumes the decision is the culmination of a series of choices made as students progress through the educational system, and it differs fru.n those used in earlier studies by giving less influence to certain variables (for example, factors that affect decisions early in the choice pmcess exert subsequent influences only indirectly). The Ethington and Smart model assumes that decisions regarding graduate education are based on \"blocks\" of independent variables that interact with each other. Student background characteristics and high school experiences comprise one block, which affects the choice of undergraduate institution. A second block measures student social and academic integration within the undergraduate institution, which in turn is influenced by the background \"block\" of variables. At a certain point, the effects of background characteristics wane as undergraduate experiences, financial aid, and receipt of the undergraduate degree replace them in importance. Enrollment in graduate school is dependent on all the measured variables, but results of the study indicate degree completion and receipt of financial aid have, by far, the greatest impact on graduate school enrollment. Student background characteristics have, at best, a marginal impact on the decision; the only student background variable showing a direct effect is the educational level of the student's family. For men, selectivity of the undergraduate institution has a strong positive effect on graduate school attendance whi,e, for women, size of the undergraduate institution is important. Ethington and Smart found students with greater social and academic involvement in their undergraduate institutions are more likely to go to graduate school than those less involved. Spaeth's (1968) study of factors that \"allocate\" college graduates to graduate and professional school, more empirical than theoretical, assumed that parental socioeconomic status (SES), students intellectual ability, undergraduate academic performance, and the quality of the college from which they graduated influenced choice of graduate school. The Spaeth study looked at the career plans of 1961 college graduates, using a path-analytic model to relate quality of graduate school attended to student input and family background characteristics. Student undergraduate grades and the \"intellectual caliber\" of the undergraduate college attended were found to be major determinants of the quality of graduate school attended."}, {"section_title": "Literature on Enrollments", "text": "Some studies have equated enrollments with demand (Heath and Tuckman, 1986), although the former variable includes elements of supply while the latter does not. For example, Campbell and Siegal (1967) looked at demand for higher education using time-series data tu estimate thc ratio of undergraduate degree enrollments to the number of thosc eligible to enter undergraduate 29 institutions. Likewise, Carroll et at. (1977) analyzed the effects of Basic Educational Opportunity Grants on enrollment decisions, and Alexander and Frey (1984) attempted to identify the determinants of enrollment in MBA programs. Most studies of these types focused on the direct effects of a set of independent variables and used regression analysis to identify what factors determine enrollment. But such studies largely ignore the interactive relationships captured by a path analysis, and many relegate sociological and psychological variables to a secondary role, although controlling for student characteristics such as race, age, and ability. Researchers usually place great importance on the role of tuition, family income, and financial aid in determining enrollment. Some also assume that external economic variables, such as unemployment, affect enrollments. A number of literature reviews have explored factors that determine demand for higher education (Becker, 1986;Jackson and Weathersby, 1975;Leslie and Brinkman, 1986). Heath and Tuckman's (1989) review found that carly studies that relied on a net tuition variable (gross tuition less financial aid) were flawed because net tuition fails to recognize that changes in tuition and financial aid have different effects on student demand. It also found that type of financial aid was important, with the evidence suggesting fellowships have a larger effect on demand than teaching assistantships. The review also revealed that the price elasticity of demand is lower at high-quality undergraduate institutions than at other 4-year schools and is less for graduate education than for undergraduate education. Finally, the review showed that decreases in financial aid at the graduate and professional levels reduce matriculation, increase the dropout rate, and lengthen time to the doctorate. Heath and Tuckman developed a mode of the determinants of the demand for higher education that breaks the group of potential graduate students into five subpopulations: recent college graduates; persons in the work force; homeworkers who might return to graduate school: those discharged from the armed fortes interested in higher education; and ron-residents of the United States who attend U.S. institutions of higher education. Demand for graduate training in any given field is based on family characteristics, individual abilities and interests, tuition and financial aid variables, the characteristics of the educational organizations, and economic and social s \"ables. The model can be used to explain the demand for both graduate and undergraduate training and, by introducing time notation, can also bz used to explain persistence."}, {"section_title": "30", "text": ""}, {"section_title": "Literature ou Expected Returns", "text": "Since the early 1960s, resezz.Lors have recognized and written about the economic returns from investment in schooling. Implicit is the assumption that fide with higher returns attract more students than fields with less lucrative returns. Some studies have shown that when salaries rise in a field (e.g., business), more students major in it (Berryman, 1982), while others have actualV formulated tests designed to show a specific causal relation. For example, Koch (1972)  1976 and confirmed that future earnings are an important consideration in selecting a major. But changes in earnings differentials were more important than the absolute value of the earnings differential, and neither the outlook for a given field nor Graduate Records Examination (GRE) scores were statistically significant predictors of field choice. Freiden and Staaf (1973) introduced an opportunity-cost approach to the student-choice literatzit, albeit indirectly, arguing that students switch curriculum groups as :ley progress through college and acquire information about alternative educational opportunities. According to this approach, students prefer \"bundles\" of courses that fulfill specific degree requirements and tend to pursue curriculum groups in which they have a comparative advantage, as defined by their verbal and quantitative Scholastic Aptitude Test (SKr) scores. More rigorous modeling of the relationship betwr en enrollments and earnings potential in an academic field can be found in the work of Freeman (1971), who argued that differences in relative earnings signal potential students to enter fields experiencing shortages. He formulated a set of equations based on interactions between changes in starting salaries, government research and development expenditures, and student enrollments. Freeman showed markets adjust to changes in demand gradually and the nature of this time lag varies among fields. In somc fields, a cycle of periodic shortages and excesses develops, emulating the cobweb pattern found in agricultut 1 employment. Freeman's model has been tested and modified in the last decade, and while the cobweb pattern is in dispute, most reseamh supports the conclusion that expected earnings affect student decisions (e.g., Hansen et al.,1980). Trusheim and Crouse (1981)  Berger used alternative earnings measures to see if students were more likely to choose a field of study based on its potential future earnings than on its starting salary. After controlling for background characterisfics, he found the probability of choosing one field over another increases as the present value of its predicted earnings stream increases relative to that in other fields. Researchers agree that relative income is important, but they disagree about how it should be measured. Should starting salaries, mid-career salaries, or future earnings profiles be used as a proxy for expected future eq ings? Should salaries be measured relative to a numeraire field (e.g., a common base) or in absolute terms? Should the salary average be for a field or an occupation? These and related questions are addressed in future chapters."}, {"section_title": "Literature 411 TTD", "text": "Literature on the factors determining TID is limited. Interest in 17D emerged in the early 1960s, when demand for graduate education led to a temporary shortage of Ph.D.s. Early studies by Berelson (1960) and Carmichael (1961) used survey analysis and data provided by the National Research Council to explore what was happening to TTD over time. Among Berelson's findings were that TTD can be shortened if full-time support is provided to a large number of doctoral students. Shortening TTD will allow more students to be educated, Berelson found, but it would do more to increase the quality of training than to increase the number of available places. He also found that the main cause of the rise in TID was time spent in nondoctorate-related pursuits, such as work as a teaching assistant or research assistant, or time spent in work-related pursuits Berelson's work contains little information on the background charactenstics of students and how they have changed through time. Although it does not address the interactions between students and their environment in model form, it does suggest specific institutional policies that might shorten TM. Early on, researchers realized that \"the Ph.D. is au open-end degree (that] cannot be circumscribed by an exact preordained time limit\" (Prior, 1962 A study by Wilson (1965), based on a questionnaire sent to graduates, graduate deans, and departmental representatives in a representative group of fields at 23 doctoral institutions, is more useful, since it identifies the factors that affect TTD. Graduate deans, graduate faculty, and doctorate recipients all felt discontinuity of attendance, work as a teaching assistant, and writing the dissertation off-campus contributed to increased TTD. Similarly, financial problems, inadequate preparation in a foreign language, lack of coordination between beginning and advanced stages of graduate work, family obligations, inadequate undergraduate preparation in the major, and transfers among graduate institutions were named by all three groups as factors leading to lengthened TTD, the study found. Continuity of study and adequate time to devote to study were seen as key to rapid completion of the doctorate. Clarity of institutional and deparuncntal expectations regerding doctoral requirements were cited by deans as critical. Respondents to the Wilson questionnaire made two recommendations of special note: (1) students need to ).:e insured adequate amounts and appropriate forms of financial support so they minimize their reliance on nondoctoraterelated employment and (2) expectations of the skills and competencies that doctoral candidates have ..hould be better articulated. While the Wilson study is thorough and thought-provoking, it does not provide insight into the role of student input variables in TTD, nor does it provide a quantitative estimate of institutional impacts. Abedi end Benkin (1987) attempted to fill this gap by studying over 4,000 students who received doctoral degrees from UCLA between 1976 and 1985. The Abedi-Benkin study postulated two regression equations with mean TTD as one dependent variable and mean RTD as the other. Three key sets of independent variables demographic, financial, and academicwere included in ?lie analysis. Using s...-pwise regression to find the statisticahy significant variables, the authors found that source of support was the most important predictor of TTD (using the F-ratio as the criterion for importance), while \"postdoctoral plans\" was the second most important. Average TTD was lower for those in the postdoctoral study/trainee category than for those who planned to enter the labor force after receiving their degree, suggesting many who plan to enter the labor force post-degree are already employed, perhaps slowing their progress toward the doctorate. Other significant variables were the number of dependents, sex, and field of study."}, {"section_title": "Summary", "text": "A great deal of research has been conducted on what determines student decisions regarding higher education. There is more literature assessing decisionmaking at the utiergraduate rather than the graduate level. Similarly, 33 42 more studies have assessed decisionmaking in the fields of education and sociology than in economics. Studies have moved in the direction of causal modeling and away from pure empirical analysis. The literature review suggests that many recent studies performed by non-economists have relegated economic factors to a secondary role and the significance of market forces in student decisionmaking has been neglected. There is a dearth of studies about time to the doctoratepartly because researchers seem to have lost interest in the question when the shortages of the early 1960s turned to surpluses in the 1970s, and partly because researchers seem unaware of the trend toward increasing 1TD. Most studies of aspirations, dropouts, enrollments, and expected returns were noncausal and largely descriptive in the early 1960s, giving way in the 1970s to more formal modeling (path analyses or deterministic demand models). The Tinto model provided the basis for much subsequent educational and sociological research, but it failed to integrate the economic variables considered important in studics of enrollment and expected returns. And most studies in these latter two areas have tended to ignore demographic and sociological variables, while others have not paid adequate attention to institutional environment. Overall, findings from several avenues of inquiry have not been integrated into comprehensive theory of what determines time to the doctorate and, as a result, studies of TID have been largely noncausal and empirical. Despite this, several variables appear to affect student choice consistently: Financial aid (this raises the question of whether the variable is also important in determining TTD); Main source of support (the literature provides little insight into the quantitative importance of this variable in determining ITD); Immediate, rather than past, background characteristics (for example, current grades are more likely than past ones to affect current decisions. Many socioeconomic factors that affect the decision to enter college for example, parent's education and incomeare unlikely to have a major effect on TTD at the doctoral level. Work is needed on personal factors that have an immediate effect on TTD); Quality of the undergraduate and graduate college (at present, little is known on the quantitative effects of organizational environment on TID); and Differences in expected earnings and changes in market conditions (to date, such variables have not been added into models of ITD). These insights are the basis of the theory and model discussed in the following A MODEL OF THE DETERMINANTS OF TTD The theory developed in this chapter is based largely on an opportunitycost explanation of student choice and is concerned primarily with direct, rather than indirect, effects. The chapter begins with a discussion of five vectors that belong in a model of student choice and then explores the opportunity-cost arguments underlying the choice of variables. The ways in which financial aid affects time to completion and the role of market forces (relative salaries and employment opportunities) also are examined. A discussion of the variables used in the model is included."}, {"section_title": "The Model", "text": "TTD is directly affected by five vectors of variables similar to those shown to influence demand for graduate school and persistenct to the degree: family background characteristics (F), individual abilities and interests (I), tuition and financial aid (TLFA), environment and policies of institutional organizations (0), and economic and social forces (E).7 The relation is: (1) Trpdt = fd(Fd(t-n),10-0, TLFAd(t_n), Od -n, , ) Ed(t-n)) In the formula, \"dt\" denotes the field (d) and the year (t) in which a given cohort of doctorates received Ph.D.s. Since the model is used to explain changes in TTD in 11 fields and many of its vadables affect TTD several years before a cohort receives the doctorate, a cohort that received its doctorate in year \"t\" is assumed to have been affected by the variables in the five vectors \"n\" years prior to the time that the degree was completed (although not acknowledged in Equation 1, the \"n\" may be different for each variable and also for each field). 7 The model can be formulated in path-analytic terms by having F affect 0, I, and E and by considering the indirect effects of E on 0, TLFA, and F. "}, {"section_title": ".1", "text": "The doctorate cohort (i.e., those receiving their Ph.D.s in a given ycar) is used as the unit of analysis, although the model is equally applicable using an individual as the unit of analysis. Variables in the \"F\" vector include the percentage of the cohort that is married and average number of dependents. The \"I\" vector includes student attributes such as average age and grade-point average. \"TLFA\" is comprised of variables such as the cohort's average tuition and the percentage of the cohort receiving financial aid. The \"0\" vector contains information on the undergraduate and graduate schoolstheir average quality, government spending on R&D, and the percentage of foreign baccaiaureates enrolledattended by persons in the cohort. \"E\" vector variables relate to the average starting salaries of new doctorates, the relation of doctorate to nondoctorate salaries, and the relation of salaries of new doctorates to those already in the field. Variables that capture the employment and unemployment experience of new and recent doctorates also are included. Since the cohort is the unit of analysis, variables on faculty-student interaction and social and academic integration are not included in the time-series version of this model.8"}, {"section_title": "The Critical Role of Opportunity Costs", "text": "The model assumes opportunity costs affect student decisions that impact on TTD, but it does not explicitly allow for institutLmal decisions. From an economic perspective, a student's decision to undertake and complete a doctoral program involves a set of near-term costs in the form of opportunities foregone while the student pursues the doctorate. Current costs are borne in anticipation of future benefits, and both the costs and the future returns from the doctorate include monetary and nonmonetary elements. There are at least three cost elements for graduate students, but they do Not all affect TI'D in the same way. As foregone earnings increase, TI'D should ctecrease as pressure on students to enter the job market and earn an income rises. As foregone activ;tka (e.g., work activities such as employment as a teaching assistant) increase, smdy time should decrease, with TI'D increasing as a result. As finnacial_malays (primarily tuition) increase, incentives are created to finish 8 Changes in programmatic requirements can elongate TTD: increasing the number of courses required for completion, requiring students to acquire additional competencies, lengthening time spent on doctorate-related research, and/or increasing the work experience that students must have to be eligible for the degree. Careful examf ation of these requirements would involve a separate study."}, {"section_title": "d 5", "text": "school as quickly as possible, and ITD.decreases. Thus, student aid is expected to have both positive and negative effects on TTD, and those effects tend to be Ifsetting. As a result, the nature of the net effect (i.e., positive or negative) cannot be stated a priori. Each vector in the model can be examined within the opportunity-cost framework. Other things equal, there will be a positive relationship between these costs and TTD. For example, it can be argued that married students have fewer costs associated with study time than single students. Since the opportunity costs of study time are often greater for single than married students, other things being equal, single students will spend less time on study and will have a high TM. An opportunity-cost argument can also be made for the effects of family size. Other things remaining equal, as the number of dependents increases, the amount of time the student spends with the family also increases, causing TTD to rise. To the extent that women tue primary responsibility for child rearing, married women with children will have a higher TTD than will married men with children. Students who are better prepared to deal with the subject matter of their dissertation may find it less costly (in terms of time and effort required) to work on the doctorate. And it follows that students with an undergraduate degree in the same field as their doctoral study will, on average, have lower costs than those with a degree in a different field. Likewise, for those who enter graduate school with a high GRE score in the doctoral field, less time, and therefore less expense, probably will be needed to acquire the degree. The effect of the quality of undergraduate education on TIT) is not easy to assess. Study at a high-quality undergraduate institution may increase a student's preparation for graduate school, reducing the cost of pursuing the doctorate and resulting in faster progress to the degree. But attending a highcalibre institution can also lead to Davis (1966) \"frog pond\" effect in which student expectations and grades drop, which in turn may increase TID. The graduates of frog ponds may sake their reduced expectations to graduate school, causing them to take longer to complete the doctorate. Also not obvious is how quality of institution at the graduate level affects TM. On the one hand, higher-quality institutions may provide their students with greater academic, social, and intellectual integration than lowerquality institutions and may be more efficient educators. Both phenomena reduce the costs of pursuing the doctorate, lower the costs of study time, and lower TM. On the other hand, high-quality graduate schools may also impose more rigorous academic requirements on their doctoral candidates, requiring more research and study, with the ultimate effect of increasing TID. Market forces operate within the opportunity-cost context by determin ng what purchases the student foregoes while studying for a degree and 37   4 8what he or she can hope to receive in the future. The relationship between market forces and completion times is discussed later in this chapter."}, {"section_title": "Financial Aid and Its Impact on Completion Times", "text": "The Impact of Type of Aid Because it offsets some of the income lost by being in school, financial aid in the form of fellowships, grants, ar.d/or stipends reduces the opportunity costs of pursuing the doctorate. The pressure on students with aid to find outside employment is lessened, and they are freed to work on degree-related activities. Aid that replaces a large amount of foregone income creates an incentive for some students to substitute leisure activities rather than study time for nondegree related work. Other students ilay increase TTD by enlarging the scope of their dissertation or taking an extra course or two. Although for many students financial aid is likely to increase their full-time work toward the doctorate, the net effect of fellowship aid on time to completion depends on whether students are more likely to partake in leisure or study activities when an award is made.9 Student behavior may also be affected if fellowship aid is contingent on a showing of successful progress toward the degree. The more stringent the criteria for demonstrating progress, the less likely students are to substitute leisure activities for study. However, it may be difficult to define \"successful progress,\" since such criteria are fairly subjective (Prior, 1962). Those with fellowships take less time to complete the degree than do recipients of teaching assistantships or those without aid, perhaps in part because they are more intellectually able. Students with teaching assistantships as their primary source of support have a lower opportunity cost for study than those who must support themselves through graduate school. Teaching assistants (TAs), because their aid package is dependent on the performance of services that take time away from doctorate-related activities, do not have as much time available for study as fellows or research assistants (RAs), suggesting TTD for the average TA will be longer than for the average fellow. The situation with research assistantships is less clear. The wide range of duties assigned to RAs makes it difficult to generalize about the effects of such awards upon TTD. Those engaged in research related to their doctorate do not really give up &tidy time when they spend job time in a way that facilitates 9 For that matter, it also depends on whether the faculty who supervise dissertations have a preconceived idea of how long a dissertation should take, on university policies, and on curriculum matters. 38 completion of the doctorate. In contrast, those engaged in work unrelated to the doctorate may find that their job slows their pmgress toward the degree. The opportunity-cost approach explains why students using their own earnings as the primary source of support are likely to take longer to complete the degree. A student employed full-time in a nondoctorate-related job must decide how to allocate non-work hours among leisure, study, family-related, and ocher activities. On average, the theory suggests, the time a working person devotes to doctoral study will be less than the time spent by those with teaching or research assistantships or fellowships. A 1987 study by Abedi and Benkin found that mean Tito and mean RTD are over two years longer for students using their own earnings as a primary income source than for those whose moncy comes from other sources. But this same study found TM was lower for students with \"on-campus\" earnings (including TAs and RAs) than for those with fellowships and grants. This finding is not consistent with the theory that TTD decreases as study costs decrease. To explore this discrepancy further, a separate mean TTD was computed for students reporting different primary sources of support (Table 3.1). In 4 of the 11 fields in 1986, and in 9 fields in 1987, fellowship recipients took less time to complete the degree than P As. Likewise, in seven fields in both 1986 and 1987, fellows took less time to complete the doctorate than TAs. In nine fields in 1986 and 1987, students with research assistantships as their major source of support took less time to complete their doctorate than those with teaching assistantships. In all fields, students who used their own earnings as their primary source of income had substantially longer TTDs. For the 11 fields combined, fellows took less time to complete the doctorate than did TAs and those who used their own earnings to pay for school. While the type of primary support mechanism does appear to affect TI'D, this variable is not available for the 1967-1986 period and cannot be tested by modeling. However, models developed in Chapters 5 and 6 that assess the impact of any support from a given source reveal that financial aid has no consistent effect on TTD."}, {"section_title": "Effects on the Components of TTD", "text": "As noted earlier, the three components of TTD are time spent prior to raduate entrance (TPGE), registered time to the doctorate (RTD), and time not enrolled in the university (TNEU). In general, financial aid will reduce both TPGE and TNEU, but the effect of an increase in financial aid on RTD cannot be predicted with assurance, since it depends on the amount of foregone income replaced, the conditions under which aid is granted, and the form of aid received. Still, the expectation is that fellowships and dissertation-related research assistantships are more likely to In ,er RTD than nondoctorate-related research degree.10 Fellowships, which offer income without reqt:Iring a work commitment, are more likely to reduce TPGE than other forms of aid, particularly teaching assistantships and nondegree-relawd research assistantships. A hether one form of aid than another is more likely to affect TNEU will depend on its desirability relative to outside employment. For example, some students may prefer outside employment to teaching undergraduates."}, {"section_title": "Market Forces and Completion Times", "text": "The rmancial and other returns that students expect from completing a doctoral program can affect both their willingness to stay in school and TTD. The monetary incentive for earning a doctorate depends both on the absolute amount of the earnings expected and on the probability of employment. The returns from a given earnings stream and set of unemployment rates may be valued differently by students, depending on the importance they place on immediate versus future income and on their attitudes toward risk. Berger (1988) suggests that a single present-value measure can be used to incorporate expected returns into a model of student choice, but the analysis below assumes students consider expected earnings and the probability of unemployment separately."}, {"section_title": "Effects of Changes in Relative Salaries", "text": "Viewed from an opportunity-cost perspective, when starting salaries of new doctorates rise, income foregone by students while in graduate school incrcases. Increasing salaries increase the incentive for students to devote more time to compleung doctorate and dissertation-related work, thus shortening TrD. The effect of salary on TTD may be partly offset, however, for Ph.D. candidates who get jobs before they finish their dissertation and are therefore likely to take longer to finish the doctorate. An increase in the salary ratio of already employed doctorates to new or recent doctorates can mean different things. If postdoctoral experience is rewarded 10 The effect is two-fold. The student foregoes less income to attend graduate school and also has immediate access to a source of financial support. The latter is important for those who do not wish to borrow to finance their education and to those with a strong preference for current income."}, {"section_title": "5,)", "text": "such that salaries of experienced engineers are rising more rapidly than those of new entrants, for example, students have an incentive to complete their studies quickly. But if the increased salary ratio is the result of a poor market for new graduates, the signal is negative. Changes in relative salaries also affect the three components of TID: RTD.: When salaries for new doctorates rise, graduate students will generally find it worthwhile to shorten RTD by spending more time in study and dissertation-related activities. However, departmentally defined constraints may limit the amount by which students can reduce RTD. TPGE: When the doctorate salary increases, TPGE is expected to shorten because the opportunity cost to the student of waiting to obtain the doctorate diminishes. TNEU: l'NEU is likely to fall when the starting salary of new doctorates rises relative to that of nondoctorates and when the salary of a doctorate with work experience rises relative to that of a new doctorate. A real rise in the starting salaries of doctorates will cause a decline in TNEU if the salary of a nondoctorate remains unchanged."}, {"section_title": "Effects of Employment Opportunities", "text": "Employment opportunities for new and recent doctorates are sometimes more visible and have greater impact on students than do relative salaries. Moreover, university placement offices are more likely to track the percentage of a graduating class with jobs than to compute the mean salaries of doctorates entering particular fields. The unemployment rate of new doctorates is an indicator of labor-market conditions and can be used in calculating future retum for completing a datoral program. When employment opportunities increase for new and recent Ph.D.s, thc opportunity costs increase to those remaining in graduate school. This creates an incentive for those working toward the doctorate to substitute degreerelated work for leisure activity or outside employment, resulting in lower TID. Conversely, when the opportunity cost of remaining in school falls, TID for some students rises. The unemployment rates for new doctorates and for those without doctorates affect TM in opposite directions. A rising unemployment rate for nondoctorates relative to the rate for doctorates increases the cost of remaining in graduate school, at if;aSt for those who either hold ot plan to hold a non-university job, and will rn :Nate students to finish the doctorate more rapidly. The percentage of students seeking employment or postdoctoral study will be used in lieu of unavailable unemployment data for new doctorates."}, {"section_title": "51", "text": "Effects on the Components of TTD "}, {"section_title": "The Variables Used To Develop the Model", "text": "The primary source of the variables used in this study was the Doctorate Records File (DRF) maintained by the Office of Scientific and Engineering Personnel (OSEP) of the National Research Council. The DRF is a data base of doctorate recipients from U.S. universities spanning the period 1920 to the present. DRF data on TTD, RTD, TPGE, and TNEU for recent cohorts have been collected through the Survey of Earned Doctorates since 1958, although data on some of the variables became available more recently. OSEP also conducts the Survey of Doctorate Recipients (SOR), which provides biehnial infn-mation on the employment status of scientific, engineering, and ::umanities doctorate holders.11 Information in the SDR data base is used to construct market-force variables. Except where otherwise noted, the variables are for U.S. citizens and permanent residents. Altogether, 41 separate variables, falling into the 5 vectors of the studyfamily background, student attributes, tuition and financial aid, institutional environment, and market forcesare used. 11 A more complete description of this data base may be found in In addition to data from the DRF and SDR, information on federal funding of students and universities, student scores, earnings in alternative employment, and unemployment were obtained from a variety of sources, This chapter examines the zeroorder correlations between a number of the independent variables used in the model and TTD and its component parts. The analysis discusses why the data are broken down by field and describes zeroorder correlations between select variables in the five vectors in the model family background, student attributes, tuition and financial aid, institutional environment, and market (economic and social) forcesand TTD and its components. It also provides correlations among the several salary and employment variables themselves and analyzes the amount or variation in TTD explained by each vector."}, {"section_title": "The Importance of Disaggregation by Field", "text": "Existing studies eitner addressed issues related to TTD aggregated over all fields (Wilson, 1965) or controlled for field differences using a set of dummy variables (Abedi and Benkin, 1987). The former approach ignores the possibility that a given independent variable (e.g.. whedier the student has an undergraduate degree in the same field) may have a different effect in some fields than in others, while the latter makes the rather stringent assumption that a one-unit change in an independent variable has the same effect on TTD for a student in chemistry, for example, as it does for a student in the biosciences. A number of studies of student aspirations and persistence suggest both assumptions are wrong (Big lan, 1973; Girves and Wemmerus, 1988;Thistlethwake, 1962). And economic research suggests market conditions differ among scientific and engineering fields (Berger, 1988;Freeman, 1971). Failure to recognize that differences among field exist can give rise to models that give inaccurate explanations of why TTD changes. The following sections provide field-specific data on the variables that the opportunity-cost analysis and the literature suggest have an effect on TTD. The zero-order correlations are suggestive, since the actual relationship between an independent variable and the dependent variable is captured by a model that 45 5 4 tests their effect, holding all other things equal. These correlations highlight the differences among fields and help to explicate the interrelationship of the variables in each vector with TID and its components. They also make it possible to examine the relationship between TI'D and variables for which data are not available for sufficiently long periods of time. Unless otherwise noted, all data are for the 1967-1986 period. All correlations are between the selected variable and -ITD and its components. A single asterisk (*) denotes the correlation is significant at 1-percent level or greater. A double asterisk (**) denotes a significance level of 5 percent."}, {"section_title": "Changes in Family Background Characteristics", "text": "Of particular interest are the percentage of graduates in each doctorate cohort who are married (Table 4.1), the average number of dependents of doctorates in each cohort (Table 4.2), the percentage who are black (Table 4.3), the percentage who are Hispanic (Table 4.4), and the percentage who are women (Table 4.5)."}, {"section_title": "Changes in Student Attributes", "text": "The variables of interest are average age of the cohort at the start of the doctoral program (Table 4.6), percentage in the cohort who attended a highly selective undergraduate school (Table 4.7), and percentage of the cohort with an undergraduate degree in the same field as their doctorate (Table 4.8). For the reasons discussed in Chapter 3, a thorough analysis of TM should employ a measure either of student ability, such as undergraduate or graduate cumulative grade-point average,12 or of achievement level, using scores from the SAT, ACT, or GRE. Unfortunately, the DRF does not contain data either on student grades or on predoctorate test scores. To develop a \"proxy\" measure of the skills that a given cohort possesses, we used a variable equal to the percentage of new doctorates in each cohort who attended a selective undergraduate institution, where the average incoming 1973-74 freshmen earned a combined SAT verbal and math score of 1,300 or higher. The assumption is that the larger the percentage of stude 's from institutions of this type, the larger the overall ability level of the students in a given cohort. 12 Student grades pose a technical problem when they are aggregated at the cohort level because the ordinal scales used to grade audents at different institutions are not additive."}, {"section_title": "46", "text": "5 5        "}, {"section_title": "59", "text": "Changes in Tuition and Financial Aid The variables of interest here are average tuition and fees paid in a given year (Table 4.9); percentage of students with federal support (Table 4.10), private foundation support (Table 4.11), research assistantships (Table 4.12), or teaching assistantships (Table 4.13); and percentage of students who relied on their own earnings as their primary means of support (Table 4.14)."}, {"section_title": "Changes in Institutional Environment", "text": "This subsection examines the relationship between a select number of aggregate measures of institutional environment and TTD. These are the percentage of students with a baccalaureate from a foreign institution (Table  4.15, p. 54), the ratio of full-time equivalent faculty to doctorate recipients (Table 4.16, p. 55), the ratio of the dollar value of government R&D         expenditures RI, doctorate recipients (Table 4.17), the percentage of doctorate recipients who received an undergraduate degree from a Research I school as identified by the Carnegie Classification (Table 4.18), the percentage of students who received an undergraduate degree from a \"top 40\" school as identified by the NRC's Assessment of Research-Doctorate Programs in the United States (Table  4.19), the percentage ot students who received a graduate degree from a Carnegieclassified Research I or Research II school (Table 4.20), and the percentage of students who received a graduate degree from a \"top 40\" school (Table 4.21)."}, {"section_title": "Changes in Market Forces Salary Variables", "text": "An exhaustive review of salary data revealed differences in the quantity and quality of various sources (Tables 4.22-4.25). Only seven data files were used; otheis were excluded either because their academic field classifications were incompatible with those in this study or because the time spans of data collection were inadequate.13 13 The sources for data on salary were the following: the American Institute of Physics, baccalaureate salary data beginning in 1965 for physics and astronomy [three missing years of data (1964, 1966, and 1967) were generated using an instrumental variable based on the Endicott Report data for physics]; Battelle Columbus Laboratories data series that begins in 1968 for baccalaureate and doctorate salaries in engineering, chemistry, and physics (BCL's data series for life sciences was considered too aggregated for use in the model, 'Sut the data are shown in the correlation table with SDR salary for biological scientists); College Placement Council data on salary offers to baccalaureates, starting in 1964 for chemistry and math (excluding computer sciences); Endicott Report data on baccalaureate salary starting in 1964 for chemistry, math, engineering, and the combined field of economics and finance; the Survey of Doctorate Recipients, the only source of doctorate salary data for all 11 fields (such data have been collected on a biennial basis since 1973; however, an instrumental variable was created based on Bureau of Labor Statistics' Weekly Earnings data to provide even-year data and to project salaries back to 1964); and baccalaureate salary data from the National Survey of Hospital and Medical School Salaries starting in 1964 for staff nurses, used as a proxy for health sciences.        2A comparison is made to the bacalaureate rather than the master's salary because of the larger number of observations in the former category; SALRATIO is lagged three years. *Denotes correlaSon is-statistically significant at 1%-level or greater. **Denotes correlation is significant at 5% level or greater."}, {"section_title": "56", "text": ""}, {"section_title": "Employment Indicator Variables", "text": "The percentage of doctorate recipients seeking ponraduate employment is a reliable indicator of job market opportunity. Job oppollunities, in turn, are likely to affect TTD. Data on job-seeking behavior are easy to obtain and rci&bonably reliable (Tables 4.26-4.30). However, because such data are collected at the time the doctoral candidate is completing the degree, they may understate employment prospects, because finding a job after graduation takes time. Data on job-seeking activity have been used in studies by Freeman (1971)."}, {"section_title": "The Stock Variable", "text": "The zero-order correlations between 1TD and its components and the number of doctorates in the United States divided by the U.S. population are shown in Table 4.31.    The Zero-Order Correlation of the Vectors The correlations between TID and all of the variables in each vector for which data are available for 1967-1986 are in Table 4.32. Regression analysis was used to derive an adjusted R2 for each vector on the assumption that this is the only vector that affPcts TTD (no one model consistently has the highest R2). The F vector (family background characteristics) explains mosi of the adjusted variation in TTD in math, health sciences, and social sciences. The I vector Remarkably, the E vector (economic variables) was not able to predict a larger amount of the variation than other vectors in any fields. Tuition and Financial Aid  Table 4.33 shows the number of fields with which each of the independent variables had a statistically significant correlation (p = .05) to time to the doctorate. The table is limited to zero-order correlations with TIT) and its component RTD, since other components did not appear to increase TID. The greatest correlation to TTD was for variables indicating marital status, dependents, gender, and federal financial support. These correlations were apparent in 10 fields for TTD and in all 11 fields for RTD. As predicted by the opportunity-cost analysis, married members of the cohort and cohort members with dependents had a negative correlation to TID. Those with federal support also showed a negative correlation to TTD, which was not predicted. Female gender was positively correlated to TID. Other variables that were strongly and positively correlated with RTD in all fields were research assistantships, number of full-time faculty, level of federal R&D support, the overall unemployment rate, and the unemployment rate for college graduates. The signs were not always as predicted; for example, the relation between the unemployment variables and RTD was expected ,o be negative but turned out positive. Zero-order correlations must be approached with some caution. While they are useful for demonstrating an association between TTD and/or its component parts and the variables posited by the literature and by opportunitycost hypotheses, the nature of the relationship is speculative. In addition, some of the independent variables are time-dependent and may move up or down together over long periods. ..."}, {"section_title": "67", "text": "7 G"}, {"section_title": "CHANGES IN TTD", "text": "How i7ell does the time-series model discussed in Chapter 3 explain changes in TTD during the 1967-1986 pericd? To answer this question, two models are used, one based on a set of variables ommila to the 11 fields and a second based on a larger set of unique variables statistically significant at .05 confidence level. Although not exhaustive, the models nonetheless provide insights into what determines change in TID. The goal of this inquiry is to answer two questions: (1) Is a unique variable or set of variables responsible for increases in TTD in the 11 fields? and (2) Is there one model that explains the change in TTD in all fields, or are the determinants of TID specific to each fic i? Two different estimation models are employed to answer these questions."}, {"section_title": "Common Variables Model", "text": "Estimates derived from the common variables model are achieved in both linear and log linear form using ordinary least-squares regression. Regression results are presented in Appendix Tables 5 and 5A. A summary of the findings appears in Table 5.1. An F test indicates that all of the estimating equations are statistically significant except for agricultural sciences.\" Differences do exist in the amount of variation in TTD explained by the equations, the standard error of the estimates, and the number of statistically significant independent variables. In six fields (chemistry, math, engineering, biosciences, psychology, and social sciences), the model explained 90 percent or more of the variation in 1TD. The lowest standard errors of the estimate were found in chemistry and psychology. Log Linear Equations A summary of the results from the log linear equations appears in Table   5.2. In the log linear equations, the adjusted R2s are above 90 percent in six fields, and the transformed standard errors are lower in every field than in the linear model. Further comparison of the linear and log linear estimates suggests the statistical significance of certain variables is sensitive to the model used. The log linear model does not appear to give the best estimates. Most important, a common set of variables is no/ responsible for changes in TTD in the 11 fields."}, {"section_title": "Weaknesses of the Common Variables Model", "text": "The common variables model has at least two important weaknesses. First, it constrains the variable set to be identical across fields even when some variables are not statistically significant. Second, many variables are included in the model, and the effects of some of the variables may be obscured by their correlation with others."}, {"section_title": "Unique Variables Model", "text": "In this model, the number of variables is varied, and additional (but not exhaustive) variables beyond those used in the common variables model are introduced. Regression analysis is used to determine which variables in each field make a statistically significant contribution to TID. Table 5.3 (pp. 74-75) summarizes the fuldings obtained using this approach by field."}, {"section_title": "Summary of Findings", "text": "A summary of the regression analyses is ,:ontained in Table 5.4 (p. 76). The variable indicating female gender is significaut and positive in one field in each of the three models. With the exception of age, no other variable is statistically significant in a majority of fields, although a majority of the variables are stadstka!ly significant in a limited number of fields. Many of the variables are not robust with respect to changes in the specification of the model. For example, the sign of the regression coefficient changed for the financial aid variables as the model specification changed. Finally, the analyses indicate individual field analysis is likely to be more productive than the simple dummy-variable approach employed by Abedi and  Benkin (1987). Each field has a set of unique variables that help explain much of the change in TTD."}, {"section_title": "Limitations of the Analysis", "text": "Because time-series analysis was used, a number of variables were highly collinear. But time and resource constraints did not permit an approach designed to isolate the unique effects of the variables. In addition, aggregation of the data to the cohort level may have obscured some of the variation within the cohortsthat is, variables affecting student decisions at the individual level may not show up as important at the cohort level. Finally, there is a problem with interpreting the age variable. While age appears to be significant in a majority of fields, the analysis does not distinguish between physiological effects and cohort effects. The possibility cannot be ruled out that age is important because it serves as a proxy for other changes experienced by the cohort. Also, older people automati:ally have higher TPGE. Caution also must be taken when drawing conclusions from an analysis that relies solely on TM. 11D is a complex quantity, the sum of many separate decisions made at different points in time. Each decision point is of interest, and there is no guarantee that the same variables impact on decisionmaking at each po,nt. This raises the possibility that a given variable may rffect decisionmaking at more than one point in a student's career. Existing literature does not provide adequate understanding of this process, and studies of the type describel in Chapter 2 do not provide the insights necessary to identify the time at which Individual variables impact on TTD. Additional work is needed on the lag structure implied by the model in Chapter 3 if a full understanding of the role of the independent variables is to be achieved. Despite these drawbacks, there is a need to model TTD if only because policymakers want to understand the supply of science and engineering personnel for the labor market. A better view of the impact of the independent variables likely will be obtained using the RTD model, since the decision points at which institutional and financial variables impact are easier to pinpoint. Finally, it should be noted that as an endpoint, TTD may be less useful in answering some questions than RTD. If the goal is to determine whether financial aid causes students to remain in graduate school longer, RTD may provide a more accurate picture of student responsiveness. Likewise, if the goal is to examine the impact of institutional environment, RTD is the better variable. However, if the goal is to understand the role of market forces, TTD may be the better choice.   "}, {"section_title": "841", "text": "In short, whether TID or RTD is the \"better\" dependent variable depends on which questions the researcher wishes to answer. Those studies that employ both TTD and RTD without distinguishing between the two may be ignoring the important differences between the two variables. What Can Be Learned from the Findings? Despite the potential problems discussed above, this time-series analysis of TTD is encouraging in several respects. It suggests that 1. Total time to the doctorate can be modeled and such models explain much of the variation in the data in a time-series context."}, {"section_title": "2.", "text": "Age is the most contistent statistically significant variable, has a large impact on TID, and explains the largest amount of variation in the data."}, {"section_title": "3.", "text": "Variables from each of the five vectors act to determine 'MD. Moreover, the number of variables found to be statistically significant in this study is substantially greater than that found by Abedi and  "}, {"section_title": "4.", "text": "Financial aid has an impact on TID, but not always in the intended direction. This interesting and provocative finding clearly warrants additional study in a cross-section or pooled time-series cross-section analysis.15 5. At !east some market variables affect TM. Since prior studies have not established this link, it opens a new avenue of inquiry for researchers interested in the determinants of time to the doctorate. It also supports the argument that market-place changes involving highlevel personnel will occur as students adjust to market conditions. However, this analysis does not suggest that sufficiently large changes in TID can be achieved by changing financial aid policies or the institutional factors students are exposed to. It also provides little evidence that an infusion of additional resources would offset the increase in TID. 15 Aggregations of the type used here run the risk that some of the individual variation will be averaged out. Cross-section studies are almost certain to show a stronger relationship between federal support and TID because the most promising sti.dents are the ones most likely to receive federal support and thz. most likely to complete degree requirements quickly."}, {"section_title": "CHANGES IN REGISTERED TIME TO THE DOCTORATE, TIME PRIOR TO GRADUATE ENTRANCE, AND TIME NOT ENROLLED IN THE UNIVERSITY", "text": "This chapter uses the common and unique variables models defined in Chapter to expkiin changes in registered time to degree (RTD) and the common variables model to explain changes in time prior to graduate entrance (TPGE) and time not enrolled at the university (TNEU). As discussed in Chapter 1, TTD and RTD have a similar time trend, and increases in RTD are largely responsible for increases in Tm. Registered Time to the Doctorate"}, {"section_title": "RTD in the Common Variables Model Using Linear and Log Linear Equations", "text": "Regression coefficients for each held, using both linear and log linear estimating equations, appear in Appendix Tables 6 and 6A. A summary of the findings for each variable in each maiel is given in Table:. 6.1 and 6.2. As was true for TTD, a comparison of the results for the linear and log estimates susgests that the results are different depending on the model used. While the importance of certain variables such as teaching assistantships, foreign baccalaureate, and salary does eot change across specifications, the role of others such as age, federal support, and unemployment are affected. In most cases, the signs of the statistically significant variables do not change, and the log linear model explains the variation in the data no better than the linear model does.   "}, {"section_title": "RTD in the Unique Variables Model", "text": ""}, {"section_title": "Evaluation of the Results", "text": "A number of observations can be made about Table 6.4 (p. 84), which shows the number of fields in which a particular independent va: iable was statistically significant. For example, no one variable explains the widely observed increases in RTD across fields. Instead, the combinations of variables 81 RS   with statistically significant effects on RTD vary by field. In both the linear common variables model an , the unique variables model, female gender was significant and positive in just une field. In the log-linear model, gender was not significant in any field. In those equations where age is statistically significant, it tends to have a large impact on RTD, suggesting that as more older students enroll in doctoral programs, RTD will increase. However, as noted earlier, age may act as a proxy for cohort differences rather than for physiological or other effects of aging. This possibility deserves more study before conclusive statements can be made. The role of financial support in affecting RTD is mixed. In a numN of fields, fmancial variables did not enter the equation at all and, in a few, they had a positive partial correlation, contrary to intuitive expectations. This finding suggests that the effects of financial aid are fieldspecific and the type of aid provided influences whether students complete the doctorate more or less rapidly. The data do not allow firm conclusions about the effects of increasing fmancial aid as the primary source of support. The analysis suggests that in some fields increases in the number of foreign students or in the percentage of students with foreign baccalaureates have led to increased RTD. Finally, analysis supports the belief that changes in market variables unemployment rate, salaries, and salary ratiosaffect RTD. The results of this inquiry are best viewed as suggestive rather than conclusive. P;oblems of multicollinearity, aggregation, and limited data suggest the need for study of these issues in a cross-section and/or pooled time-series cross-section framework. Further research is needed to affirm the role Qf age, to elaborate on the role of fmancial aid, and to provide greater insight into the role of student ability (see Chapter 7)."}, {"section_title": "Time Spent Prior to Graduate School Entrance (TPGE)", "text": "The results summarized in Table 6.5 were obtained using the linear common variables model to explain changes in TPGE (see Appendix Table 7). The implicit assumption in the use of these variables is that students have prior knowledge of how their cohort is likely to fare in terms of receiving financial aid and entering the labor market. The R2 for the individual field equations are lower for TPGE than for TID or RTD and, for three fields, the equations themselves are not statistically significant. In part, this results because decisions made at the time of undergraduate graduation are more likely to be based on family background and undergraduate performance factors not contained in the model (see Chapter 2). It may also be that new variables are needed to adequately capture conditions at the 85  time the decision to enter graduate school was made. For example, the relevant financial variable may be the percentage of the prior year's entering class with financial aid and the relevant market variable may be the percentage of doctorates who found jobs in the year in which the person decided to enter graduate school. Analysis of these issues may explain why fewer variables are statistically significant in the TPGE equations than in the RTD equations. It's interesting to note that in math, biosciences, psychology, and social sciences, the equations explained better than 90 percent of the variation in the data. As was true for the linear analysis, in the log-linear analysis (Table  6.6), the equations for earth, atmospheric, and marine sc;ences; agricultural sciences; and economics were not statistically significant ...so, the R2s were generally lower on these equations than for TIM and RTD. Several points can be made about the determinants of TFGE based on the findings in this section. First, in most of the fields, the variables that explained most of the change in TPGE were demographic and economic in nature. With rare exceptions, institutional factors did not affect the TPGE. However, in the log equations the unemployment rate and salary variables were statistically significant determinants of TPGE. Second, the financial aid variables did affect TPGE in some fields, although not always in the expected direction. TPGE in chemistry and physics and astronomy was consistently affected by financial air,. Finally, in most fields neither the percentage of women nor the percentage of students with foreign baccaiaureates had a statistically significant effect on TPGE. Time Not Enrolled in the University (TNEU) TNEU, time the student spends away from his or her studies after registering for graduate school, is affected by such factors as illness or financial exigency, frustration with the doctoral program, and the need to take a break from dissertation work (see Appendix Table 8). Since the variables in the. common variables model do not specifically address these concerns, this model is not expected to explain as much of the variation in TNEU as it did for other dependent variables. Tables 6.7 and 6.8 summarize the results from the linear and non-linear regression equations. The analysis shows no one variable consistently explained changes in TNEU in all fields. Compared to TPGE, unemployment and salary variables do not appear to have a strong effect on TNEU. This is surprising. One would expect student decisions to leave graduate school to be more affected by market conditions. And, as with TPGE, factors such as gender and percent with foreign baccalaureates do not appear to exert a strong influence on TNEU. 87 9 =-   The linear modei suggests that age has the largest impact on RTD; the percentage of students with foreign baccalaureat,s and who are female also consistently increases RTD. These results are field-specific and are not generalizable to all 11 fields, however. The role of financial aid is ambiguous, and different types of aid affect RTD differently. The models explain less of the variance in TPGE and TNEU than in TM and RTD. In some fields, the models do not produce statistically significant results. While generalizing across fields is difficult, the equations for TPGE and TNEU have fewer statistically significant variables than those for RTD and TTD. Interestingly, market variables explain time spent prior to entering graduate school while, for the most part, they are not statistically significant in the TNEU equations. Additional work is needed to understand the factors that cause changes in TPGE and TNEU.16 It is likely that institutional and psychological factors beyond those captured in this common variables model affect Lie decision to postpone entry to graduate school and/or to delay completion of the doctorate. 16 Knowledge of the determinants of TPGE would be useful, since it tells us how long students take to move from undergraduate to graduate school. TNEU is important because substantial differences exist across fields and we have little understanding of the underlying reasons: it may be that market opportunities for ABDs are substantially different among fields or that some field work is useful before obtaining the doctorate."}, {"section_title": "r 7 PAST AS PROLOGUE", "text": "If the preparation of college teachers and the national distribution of graduate study are the two major issues in graduate education today, then the duration of doctoral study is probably the third. The critics who fear that the system is going to turn out too few doctorates in the years ahead, those who believe that the whole emphasis on research is wrong, those who think that the degree has fallen off from traditioalf standards, even those who want things addedall of them are concerned about the lengthy period of doctoral study. There is hardly a recent discussion of graduate education in which this note is not played loud and strong. (Berelson, 1960:156) What Has Happened to Time to the Doctorate? Total Time to the Doctorate Despite ample evidence that TTD has been increasing for years, public attention to the question of how long it should take to complete the doctorate has diminished. The extent of the change in TTD between 1960 and the present is highlighted by a comparison of Berelson's data with data from this study (Table 7.1). If current trends persist, it will take even longer for doctorates to complete their degrres in the future. This is an important conclusion because it suggests that the question of whether doctoral preparation could, or should, be expedited may again become a matter of great interest. Unfortunately, Berelson lacked the data to study long-term changes in RTD. His study used data from only one year and focused on the difference between these two variables and TTD. It found that RTD was lower than TTD in 93 90 each of eight fields under study.17 Of particular note, according to Berelson, was the fact that the time differences among fields were small when actual time to the doctorate was considered.18 He concluded that \"(t)he problem is not how much time a student should spend in working on his degree, but rather over how long a period of time he should do it\" (Berelson, 1960:162). Registered Time to the Doctorate Because RTD data are available for both 1967 and 1986, it is possible to look at RTD over time.. In all 11 fields, it increased, sometimes by a large amount. In seven fields, RTD increased more than TTD between 1967 and 1986. For example, RTD rose by 49 percent in the social sciences, compared to a 22-percent increase in 7TD; in economics, the comparable figures were 37 percent and 4 percent; in earth, atmospheric, and marine sciences, 28 percent and 14 percent; and in agricultural sciences, 22 percent and 8 percent. In three fields, RTD and TTD increased by a similar percentage: about 28 percent in psychology; 13 percent in physics; and 29 percent in math and computer sciences. Only in the health sciences did the change in TTD (27 percent) greatly exceed the change in RTD (14 percent) between 1967 and 1986. These findings suggest that, with the exception of one field, the major source of increasing TTD was a \"stretching-out\" of the time spent registered in graduate school. 17 These fields are physical sciences, biosciences, social sciences, humanitizs, engineering, education, arts and sciences, and professional fields. 18 The lowest median actual time was in education (2.8 years) and the highest was in social sciences (3.7 jears)."}, {"section_title": "IC 0", "text": "The differences among fields in RTD described by Berelson can be examined for more recent years using data from the DRF. For both 1967 and 1986, the difference in median RTD5 across fields is less than the difference in median TIDs, affirming Berelson's fmdings. The range in TTD between the high and low fields increased 1.9 years from 1967 to 1986. The lowest mean TTD in 1967 was 6.4 years (for chemistry) and the highest was 10.6 years (for the social sciences). The range between the low and high fields, therefore, was 4.2 years. In 1986 the field with the lowest mean (7.2 years) was again chemistry, but the field with the highest mean was health sciences (13.3 years). In this case the difference between the two fields was 6.1 years. The range in RID also grew between 1967 and 1986, but that growth was less than that experienced by TTD. In 1967, chemistry had the low mean RTD (5.0 years) and health sciences had the high mean (6.5 years). The range between the two is 1.5 years. In 1986, the low field was still chemistry with a mean RTD of 5.8 years; the high field was psychology, with a mean of 7.5 years. The difference between the two fields is 1.7 years, compared to 6.1 years using the TTD measure, and the range between hif md low fields for RTD grew by 0.2 years from 1967 to 1986, far less than the 1.9 year growth observed using TTD. Thus, although Berelson found that the RTD measure produced a smaller difference across fields, he failed to see that the range was increasing over time, suggesting the doctorate is growing relatively more costly in certain fields in terms of lost income while in graduate school."}, {"section_title": "Variation Around the Mean", "text": "To determine whether within-field differences in the time students took to earn the doctorate narrowed or giew larger between 1967 and 1986, coefficients of variation (\"Vs)19 were computed for each field. The results show that the within-field variation in both RTD and TTD was at least as large as betweenfield variations in some fields, raising the question of whether the type of field comparisons offered by Berelson are useful. In all 11 fields, the CVs for TTD decreased from 1967 to 1986. However, the CVs for mean RTD increased in four fields, remained the same in two, and fell in fiN e. This indicates a larger proportion of doctorate recipients 19 The coefficient variation is the standard deviation divided by the mean. It is used to express variation in the data relative to the mean and facilitates comparison of variation across fields. had TTDs closer to mean TTD in 1986that is, mean TTD was representative of a larger percentage of the cohortthan was the case in 1967 and a larger proportion of the 1986 than 1967 doctorate cohort took longer time to complete the doctorate (this was also true for the five fields in which the CVs for RTD fe1120 ). Tne lengthening of time to the doctorate is affecting a larger percentage of doctorate recipients than was true in the past."}, {"section_title": "Could Changes in TPGE and TNEU Have Been Large Enough To Explain the Change in TTD?", "text": "The data suggest that time prior to entry to graduate school (TPGE) rose in all fields except EAM and agricultural sciences. The size of the increase depended on the field studied, with three fields showing an increase of less than 10 percent, in three a jump of 11-50 percent, and in three a rise of 60-105 percent. The largest increase: in TPGE were in math and computer scienc (105 percent) and the health sciences (100 percent), while the smallest were in economics (5 percent) and the social sciences (8 percent). Measured in absolute terms, the increases in TPGE were fairly small. In six of the nine fields in which TPGE grew, the increase amounted to less than three months. Three other insights emerge from a study of TPGE. First, the low TPGEs -for most fields in 1986 suggest that most doctorate recipients entered graduate school soon after completing the baccalaureate. And, while TPGE rose in a majority of fields, the increase was not great enough to e: plain more than a small fraction of the increase in TI'D between 1967 and 1986.21 Three of the four fields with large increases in TTD also had large increases in TPGE: health sciences, math, and psychology. However, even in these fields, the rise in TPGF. was not large enough to be the prime source of the increase in TI'D. Third, the data also suggest that changes in TNEU were not responsible for the growth in TTD in most fields. TNEU decreased in eight fields, and in five of these the decrease wss greater than three months. TNEU rose by two-and-a-half months in 20 The coefficient of variation dropped by 10 percent in health sciences, by 6 percxn in social sciences, by 4 peicent in psychology, by 5 percent in the biosciences, and by 1 percent in chemistry. 21 For example, the rise in TPGE represented 19 percent of the growth in chemistry, 22 percent in math, 25 percent in psychology, and 37 percent in health sciences."}, {"section_title": "96", "text": "i 0 2 math and by nearly a year in health sciences; however, only in the latter was the combined effect of changes in TPGE and TNEU large enough to have a large impact on TID. In fact, the decline in TNEU in many fields helped to offset the relatively small rises in TPGE, causing RTD to become the major source of change in TTD. These findings suggest that the concern expressed in the 1960s over the amount of time students spend \"outside the system\" is not valid at present (Wilson, 1965)."}, {"section_title": "Possible Explanations", "text": "Six broadly based theories may explain the growth in TID. These categories of explanation correspond to, but encompass more than, the vectors used in the model introduced in Chapter 3. The thtoriesEpistemic, Institutional, Student Preference-Based, Financial Need-Based, Demographic and Ability-Based, and Market-Basedare not mutually exclusive but provide a useful way of classifying the arguments made in earlier studies to justify increases in TID."}, {"section_title": "Epistemit Explanations", "text": "The underlying premise of these explanations is that an expanding knowledge base requires that students take more time to learn, absorb, and retain what is needed to earn the doctorate. A corollary is that more (and perhaps higher quality) work is expected of the doctoral student now than in the pas:. But measurement of an epistemic trend requires an objective measure or the expansion of knowledge in each field. While indirect indices of this expansion (such ^ counts of pages, books, journals, courses, and citations) are available, there is no consensus on how to define the body of thought a doctoral student must master. Similarly, it is difficult to agree on the length of time a student should be given to master the body of knowledge required for a doctorate, since students progress at different rates. To Limit the time needed to earn the doctorate is to run the risk of excluding potentially productive scholars. More research is needed to pinpoint changes in the prerequisites for entry to the graduate program, in course load, and in the standards used to judge a dissertation within each field."}, {"section_title": "Institutional Explanations", "text": "Factors in the university and/or departmental environmentsuch as goals and commitment, the interaction between faculty and students, and changes in student attitudes toward themselves and their peerscan also affect TID. This study indirectly measures changes in the institutional environment over 97 -time by looking at the quality of the doctoral department, the type of undergraduate and graduate institution attended, and the effects of changes in selected resources. These aggregate measures are not substitutes for the more specific sociological and institutional variables described by Wilson (1965). The analysis indicates that changes in the percentage of a cohort at a top-ranked graduate department do not affect 6ther TI'D or RTD. Interestingly, however, increases in the percentage of a cohort whose baccalaureate was earned at a first-tier doctorate-granting university do reduce TM and RTD, albeit in a limited number of fields; but there is no evidence that a graduate department's high quality ating is associated with a low mean TID. The analysis also fails to establish a link between aggregate resource intensity, such as the aggregate number of faculty and R&D spending, and TI'D. We cannot rule out the possibility that such evidence would have been found if the data series for these variables had been field-specific. Given the gross measures used and the limited number of observations available, our findings for :hese variables should be viewed as suggestive rather than conclusive. Clearly, additional work is neeied to flesh out the impact on RTD of the institutional environment. At present, it is not clear whether RTD is increasing because students are taking mote courses, because they spend more time working while registered at the university, because more prerequisite courses are required, or because it simply takes longer to complete the dissertation. Additional work also is needed to develop causal models of institutional factors. Such studies might merge institutional and departmental data with data on average student performance and progress within the department over several years."}, {"section_title": "Student Preference-Based Explanations", "text": "This explanation assumes students prefer to stretch out their graduate training because they like being \"perennial students,\" graduate school offers a desirable environment, students prefer to allocate time in graduate school to nondoctorate-relatdd activities, and/or they fear they won't be able to find a job after graduation. These preferences am not easily capturcd in a time-series model because no consensus exists on which student attitudes should be measured and on how to measure them and, at present, the Survey of Earned Dc:.toratss, the only yearly study of doctoral students, does not collect iniormation on graduate student preferences over time. Many factors can cause students to change their reasons for attending or for leaving graduate school. Decisions by university administrators may make the graduate school environment less comfortable or may place limits on financial aid. And societal mores may put pressure on those who remain outside the labor force too long. In addition, students also may change their perceptions 98 nz of the beneiits of a college education. Clearly, these factors can alter both RTD and TfD. This study introduces student choice into a time-series model by looking at behavior at the margin. Of primary concern is whether changes in the marketplace cause students to alter their choices regarding graduate school."}, {"section_title": "Financial Need-Based Explanations", "text": "The financial prasufes on students may increase as a result of ianess or injury, tuition increases, marriage, family obligations, reduced loan or financial aid packages, and/or increases in the cost of living. Because of these factors, students may find it necessary to spend more time working and less time studying, thereby increasing TID through effects on TPGE, RTD, and TNEU. Marital status and increases in family size raise TID in a few fields but do not provide a general explanation of why lTD has increased in all 11 fields in this study. Changes in students domestic situations contribute to the rise in TID but are not tha primary cause. An argument can also be made that 'ITD and RTD may have risen because fewer students are receiving federal financial aid. Wilson's study found that the percentage of those with financial aid was greatet among those students who finished the doctorate quickly than among those who took more time to finish. It also reportbd that about one-third of the students who delayed entry to graduate school did so for financial reasons. This, among other things, led Wilson to recommerd increases in fmancial aid as a way to hasten TID. While Wilson's evidence is suggestive, ft poses a problem of causality. Did students who are recipients of financial aid finish faster because they had such aid or because such aid was given to the most able? This question remains to be answered. Moreover, Wilson's study ignored the question of whether the form of financial aid made a difference for TTD and made no attempt to quantify the effects of financial aid on the several times to the doctorate. A comparison of the mean TTD5 of those receiving federal fellowships, TM, RAs, and private foundation support to the mean TIDs of those whose primary source of support was their own earnings (Table 3.1, p. 40) revealed that those who provided their own financial support took substantially longer to complete the doctorate than those with other types of support. Interestingly, mean TTD either fell or stayed constant between 1986 and 1987 for TA holders in seven fields and for federal fellowship holders in eight fields; it rose in seven fields for RA holders and for those who provided their own support. The effect ot financial aid on TID is not as apparent in the causal models presented in Chapters 5 and 6. This is, in part, because the variables used in the model do not focus on the primary source of support. Moreover, the role of the financial aid variables may be obscured by their correlation with other independent variables in the mode!. The findings suggest that when it is a significam factor, it has a limited effect on TTD (relative to the total time required to complete the doctorate) and RTD. For example, using the linear common variables model, a 10-percent increase in the number of psychology students with TM results in a decline of just four months in TID. In fact, none of the financial aid variables had a consistent effect on TTD and, in some fields, they did not change TTD at all. In the TPGE equations, federal support was not statistically significant in any field; TA support had a negative effect in one field; and RA support had a positive effect in one field. In the TNEU equations, federal support had a positive effect in one field; TA support was not statistically significant; and RA support was positive in one field. Recent DRF surveys have collected new data on prime source of financial aid. These data could be used to analyze more thoroughly the effect of financial aid on the four dependent variables."}, {"section_title": "Demographic and Ability-Based Explanations", "text": "In recent years, doctoral students are more likely to be older, female, foreign, and minority, all factors that can increase TTD and RTD. Recent interest in certain demographic factors probably is a response to trends in the DRF data. For example, in 1976 women constituted just 22 percent of the 18,583 science and engineering doctorate recipients. By 1985, women represented 27 percent of the 19,164 science and engineering doctorate recipients (Coyle, 1986). Likewise, the share of non-U.S. citizens with permanent or temporary visas who received science and engineering doctorates grew from 21 percent in 1976 to 27 percent in 1985. Given the changing composition of the doctorate-recipient group, a natural question arises as to whether these changes were responsible for the increase in TID. Gender, residency status, and race do not consistently affect the measures of time to the doctorate in the 11 fields studied. In fact, the only demographic variable that has a large enough effect across fields to affect TTD is age at entry to graduate school. Age is important in the TTD, RTD, and TPGE equations but does not have a statistically significant effect in most fields in the TNEU equations. Unfortunately, the analysis does not distinguish whether age is a proxy measure or truly reflects the effects of aging on learning.22 22 We cannot dismiss the possibility that changes in student abilities were a major factor. The lack of studcnt skills data, such as GRE scores, did not allow study of this possibility, however. 100 1 r G Market-Based Explanations Employment opportunities, the absolute salaries of doctorate holders, relative salaries, and the rate of return to alternazive careers all affect time to the doctorate. Their impact is felt both by those in graduate school and by those considering alternative fields of graduate study. The assumption is that when the economic return for graduating with a da.norate falls relative to the return to nondoctorates, TTD will rise. Econcmic return diminishes in a given field if the unemployment rate of new doctorates rises relative to those without a Ph.D., if the relative salary of nondoctorates rises relative to that of new doctorates, and if die earnings of Ph.D.s fail to progress as rapidly over time as the earnings of those without doctorates. The longer a student remains in graduate school, the less economic return is expected. The results of this study suggest that changes in the marketplace were !Jot large enough or pervasive enough to provide the primary explanation for the observed increases in TTD. Increases in the unemployment rate for those with tour or more years of college education reduced RTD in four fields in one model while increased unemployment affected TTD in only one field. Changes in the perceitage of students seeking employment and of those with definite postgraduate plans affected TID and RTD, but only in a few fields. TTD fell in some fields as salaries for experienced doctorates rose, and it increased when there was a decline in the salary of new doctorates relative to salaries of doctorates 10 years postgraduation. Additional modeling is needed to confirm these findings and to identify the appmpriate lags between market changes and changes in TTD."}, {"section_title": "Is There A Single Explanation for Increase in TTD?", "text": "A series of factors, rather than one explanation, appears to be responsible for the trend of increasing TTD across fields. Part of the increase in TTD probably was due to epistemic factors, but this theory does not explain why there was three times the growth in TTD in the social sciences compared to chemistry (nine months versus 2.4 years). It seems unlikely that growth in the knowledge base alone could explain such a large increase in TTD in.one field and a relatively small increase in another. Institutional factors also came into play. Likewise, declining enmllments in some institutions may have created an incentive for them to keep students longer. Although the institutional environment may not have been stable during the period of study, it is not clear that these factors explain the inter-field changes described. Among demographic variables, age is important because older students wait longer to enter graduate school and also spend more time registered in graduate school than younger students. The finding that older students take longer to complete the doctorate warrants further study. In some fields, variables such as residency and gender also affected TTD, as did financial need. This study also suggests that market forces, particularly increases in the unemployment rate and in the salaries of doctorates and nondoctorates, affect TI'D. The finding that no one class of exrlanations is responsible for the rise in TTD is consistent with the initial correlations in Chapter 4 and with the set of regressions presented in Chapters 5 and 6. It alsc confirms Wilson's 1965 findings of the multi-factorial aspect of any steps taken to reduce TTD: In essence, the amount of time involved in doctoral prcparadon can be reduced, our respondents indicate, only through concerted effort on a variety of fronts. Solutions predicate/I on a monistic conception of the problem will not prove to be satisfactory and no approach to \"time reduction\" stressing only one iine of attack, e.g., increased financial support, . . . will be sufficient, however necessary it may be to an overall solution. As has been shown, TI'D is affected by a number of variables. But aggregate models alone cannot identify steps to reduce TTD. What is needed is a more disaggregated study of what is happening at the deparunent level. And additional modeling should be done using the student as the unit of analysis to sort out the roles of ability level, past preparation, and . financial aid in elongating TTD. Existing studies do not provide sufficient guidance for policymakers to reduce TID."}, {"section_title": "Implications of a Continuing Rise in TTD", "text": "A More Resource-Intensive Doctoral Program Changes in TI'D that result from an increase in time spent in graduate school will raise the cost (excluding opportunity costs) of obtaining a doctoral degree. The annual cost, on average, to educate a graduatt: student ranges between S21,855 and S29,235. The mid-range estimate is $25,545 per year.23 23 The U.S. Department of Education, National Center for Education Statistics (NCES), Digest of Education Statistics 1988, indicates that educational and general expenditures per FTE university student were $13,179 in 1985-86 (Table   243). We have assigned weights to account for the higher cost of graduate 102 1 r The fields with the smallest rise in RTD between 1967 and1986 (0.8 years) were engineering, chemistry, and physics and asconomy; the field with the largest increase (2.9 years) was the social sciences. Using 1967 as the base year, the percentage increase in RTD was 14 percent in engineering and 49 percent in the social sciences. Assuming the cost of programs does not vary across fields, the cost of a doctorate rose by $20,436 (S25,545 x 0.8) in engineering and by $74,081 ($25,545 x 2.9) in the social sciences between 1967 and 1986. Taking all graduates into account, the increase in RTD caused an additional $35,190,792 ($20,436 x 1,722) to be spent educating engineering domorate recipients and an additional $106,602,550 (S74,081 x 1,439) in outlays to educate social science doctorate recipients. Graduate students themselves pay only a small fraction of the $25,545 average yearly cost of graduate training, with the rest coming from other sources."}, {"section_title": "A Longer Gestation Period", "text": "Increases in TID force employers to wait longer to hire rew doctorates, potentially causing a shortage of trained workers in affected fields and driving up the salaries of those who already hold doctorates. Lengthening TID can also contribute to a public perception of shortage and thereby increase pressures for public subsidies in fields in which trained doctwates appear to be in short supply. Increases in TTD may also cause increased demand for foreign-trainee doctorates."}, {"section_title": "1", "text": "Lengthening TID also means the productive output of doctorates will 1 I fall. For example, suppose the average age of graduate students in the social sciences at time of entry to graduate school was 27 years in 1967. If RTD in 1 1967 was 6 years, the average doctorate holder would graduate at age 33. If that person had no periods of unemployment and utilized his or her doctorate knowledge until retirement at age 65, a total of 32 person-years of work would have been produced. But if, in 1986, the average RTD rose to 9 years, the new doctorates entry into the labor force would be delayed until age 36, reducing the average number of productive person-years to 29, a decline of 9.4 percent. If education: weight 1 for part-timers and weight 2 or 3 for full-timers. NCES estimates that 56 percent of doctoral students were full-timers in 1986-87. Thus, the range of expenditures is $20,559 to $27,939, with a midpoint of $24,249. To these institutional costs are added the student? costs of doctoral education, estimated at $2,874, derived from NCES National Postsecondary Student Aid Study, which found a cost of $3,126 for full-timers and S21554 for part-timers. 103 1no TPGE also increased daring theperiod, the number of productive person-years of effort would decline even more. Clearly, increases in RTD and TPGE may reduce the productive worklife of a new doctorate and reduce the overall number of high-level personnel available to employers. More doctorates would have had to be produced in 1986 than in 1967 to obtain the same number of person-years of work as in 1967. In fact, however, there was no increase in the number of new doctorates; DRF data indicate the number of new doctorate recipients has remained relatively cons!ant since 1970 (Coyle, 1986). Although work yield of a given cohort of new doctorates is afrected by a variety of factors, including mobility patterns, obsolescence, and economic conditions, this simple example illustrates that changes in TID can affect labor supply. Longer TIDs also slow job market response to increases in demand. There is normally a lag when engineering and scientific labor markets adjust to changes in demand (Tuckman, 1988). As the length of time required to produce a doctorate increases, so too does the length of time needed for supply to respond to increases in demand. And sudden increases in demand were more likely in 1986 than in 1967 to cause a longer period of market disequilibrium. The longterm effect of an increase in TID is to reduce the responsiveness of high-level labor markets."}, {"section_title": "Increased Attrition", "text": "To the extent that increases in RTD are due to factors beyond student controlsuch as increased financial pressures, frustration created by the length of time required to complete the doctorate, of \"better\" opportunitiessome students may choose to abandon their graduate studies altogether. The literature review uncovered no studies that looked at how changes in RTD and TID affected student attrition, but k seems likely that, at the margin, some students consider cost when deciding to forego an additional year of graduate school. To the extent that this pl:enomenon occurs, increases in -ITD will reduce the number of people who complete the doctorate. Such attrition will also increase the costs to society of poducing a li-ained doctorate. 24 This analysis assumes no change in retirement behavior. The effect of lengthening TTD or productivity will not be as dramatic if retirement age is rising."}, {"section_title": "fl u Lower Returns for Graduate Study", "text": "Longer TTD increases the costs of doctoral education. Even students with fellowships incur an opportunity cost because this type of support is less than the earnings that they would have received in a full-time job. Also, as noted, increases in RTD reduce the number of productive years during which a student can realize a return on his or her investment. To the extent that students view graduate study as a potential investment, reductions in return from doctoral education are also likely to affect the decision whether to obtain a degree all. Son; students may find changes in TTD have made alternatives to a doctoral degree more attractive. Foy example, in many graduate schools, the Master's of Business Administration degree takes only two years to complete; thus, if the TID required to obtain a doctorate in the sciences increases, some students will opt instead to obtain an MBA. A sirr.ilar phenomenon may occur as students consider an advanced degree in medicine, iaw, or other professional fields. To the extent= rises less slowly in these fields, the relative return for obtaining a degree in them increases. Over time, more students may be drawn away from fields with high TIDs and into fields with shorter TIDs, leading to a possible shortage of trained scientists and engineers in certain high-17D fields."}, {"section_title": "Changes in the Attractiveness of Alternative Doctorate Careers", "text": "Students choose a major based on expected returis (Chapter 2)that is, the earnings they can expect to receive after earning the degree. Diffemnces exist in the rate at which TTD and RTD are growing among fields. Thus, a person with an undergraduate degree and an interest in one fieldphysics, for example may nonetheless choose advanced study in another fieldperhaps mathematics because the expected returns to a doctorate in the latter fiek1 are higher. To the extent that this occurs, a shortage may eventually develop in those fields with relatively larger TTDs."}, {"section_title": "TTD as a Policy Instrument", "text": "This study was motivated by interest in manipulating TTD to meet possible difficulties in producing a future supply of doctorates that will be adequate to meet anticipated needs. It is easy to argue that the increase in TTD can be reversed by increasing the number of federal fellowships or by granting sore teaching and research assistantships, but the findings of this 7::pz:t suggcst we need to !earn more about the effects of the various types of financial aid before assessment.s of the desirability of such a solution can be made. Data are simply not available to permit policymakers to choose the best way to affect rip or to assess the consequences of the various alternative solutions proposed by other studies.     "}, {"section_title": "2", "text": "Note: The sum of the changes in these fields may not equal the change in total time to the doctorate because of rounding errors and missing data in some fields.   "}, {"section_title": "47.8", "text": "Total Time to the Doctorate 10.9 0.9 9.9 12.9 Registered Time to the Doctorate           "}]