[{"section_title": "", "text": "This is a PDF file of an article that has undergone enhancements after acceptance, such as the addition of a cover page and metadata, and formatting for readability, but it is not yet the definitive version of record. This version will undergo additional copyediting, typesetting and review before it is published in its final form, but we are providing this version to give early visibility of the article. Please note that, during the production process, errors may be discovered which could affect the content, and all legal disclaimers that apply to the journal pertain. rate of COVID-19 but not the case fatality rate in the Peruvian setting. We support this hypothesis, however there could be an important number of under registered deaths on account of a low rate of diagnostic tests performed per inhabitant and mostly in symptomatic patients (Pasquariello and Stranges 2020) . It has been estimated that in Peru, 4 tests are performed per 1,000 inhabitants; a fairly low figure compared to other countries in the region such as Chile and the United States, who perform 30 and 51 tests per 1,000 inhabitants, respectively (Our World in Data 2020). Furthermore, in Peru, only patients that tested positive for SARS-CoV-2 are labeled as COVID-19 deaths. Following this consideration, we would like to add the importance to evaluate the excess mortality (EM). In Peru, EM registered between March to May was 13,000 more deaths than expected for that period, of which, only 3,000 were positive for SARS-CoV-2. This represents an EM of 54%, which was the highest reported compared to 20 countries (Mundo 2020). We would like to highlight the relation between EM rate and altitude per district in Peru during COVID-19 pandemic.\nWe conducted an ecological study in order to assess the relation between EM rate and altitude In our statistical analysis, firstly we tested normality assumption through Shapiro Wilk test, and we obtained an abnormal distribution. Then, we performed a Spearman's correlation between EM rate and altitude. We used RStudio version 3.5.2. (RStudio Team (2020) . RStudio:\nIntegrated Development for R. RStudio, PBC, Boston, MA URL http://www.rstudio.com/) Nationwide, we found an EM of 36,322 (139.8%) and an EM rate of 1.1 death per 1,000 inhabitants. Meanwhile, there were only 9,860 officially COVID-19 deaths (Stand June 30, 2020) . This EM could be explained by two plausible reasons: a high rate of officially and nonofficially reported COVID-19 deaths; and an increase in non-COVID-19 related deaths as a result of non-seeking medical attention, lockdown-related deaths and hospitals´ collapse (Vandoros 2020; Watkins and Wulaninshih 2020). We found that as altitude increases, the EM rate decreases (R = -0.2, p<0.001) (Figure 1 ). SARS-CoV-2's virulence seems to decrease at high altitude as mentioned by Arias-Reyes C, et al. Furthermore, it has been suggested that Peruvian districts located at high altitude may behave this way due to smaller populations and a lower population density (Huamaní et al. 2020 ). Therefore, our analysis included districts' population to reduce this bias. Moreover, we used district altitudes in our analysis because Peruvian geography is greatly variable, and within a single province there may be a great difference between the altitude of different cities and towns. Hence, we believe a district altitude-based approach reduces the bias that may arise by altitude variability, which characterizes the province altitude-based approach used by Segovia-Juarez J, et al.\nIn conclusion, we support Segovia-Juarez J, et al. findings which are consistent with ours.\nHowever, we believe that the assessment of EM during a pandemic is a more trustworthy way to assess the COVID-19 public health impact. Our results may explain a decrease in COVID-19 deaths as altitude increases as well as a lower impact of COVID-19 among other deaths at higher altitudes."}, {"section_title": "Conflicts of interest:", "text": "The authors declare that they have no conflict of interest."}, {"section_title": "Funding sources:", "text": "The authors received no financial support for the research, authorship, and/or publication of this article.\nJ o u r n a l P r e -p r o o f"}]