[{"section_title": "Abstract", "text": "In this investigation the level of learner metacognition as well as the level of mathematics achievement during problem-solving in a mathematics classroom was investigated. Learner metacognition plays a pivotal role during the problem-solving process and when the problem-solving is successful it can be viewed as evidence of high achievement in mathematics. Data were collected from one intact Grade 11 class of 25 girls. A word problem was given to the learners to solve individually. The learners recorded their thoughts relating to the problem as well as the calculations that corresponded to their thoughts. The level of achievement of the learners were analysed by noting calculation and conceptual errors in the solving of the problem. The learners' level of metacognition was determined by analysing the written account of their thoughts and comparing it to the items on an adapted Metacognitive Awareness Inventory (MAI). Strong evidence was obtained from the recorded thoughts of learners that their metacognitive behaviours corresponded to the first three phases of Polya's problem-solving model, but there was no evidence of metacognitive behaviours that corresponded with Polya's fourth phase (Looking back) of problem-solving. It was further determined that the learners' metacognitive awareness during the problem-solving session did not relate to the subscale Evaluation of the MAI. It was thus evident that the learners were not reflecting on the validity and correctness of their own solution. In this study a qualitative onephase approach was used to examine the process of intervention, as well as a two-phase approach on the qualitative data which was also embedded in the quantitative methodology prior to and after the intervention phase (two-phase approach)."}, {"section_title": "Introduction", "text": "Governments of most countries regard quality education as a top priority (Barber & Mourshed, 2007: 3) . In South Africa, the importance of education is acknowledged, as the largest share of the national budget (21%) was allocated to education in 2011 (Gordhan, 2011) . The value of quality education is evident from a speech by South Africa's Minister of Basic Education and Training, Angie Motshekga, in which she states that education plays a fundamental role in human development, poverty eradication, economic growth and social transformation (Motshekga, 2011) . Despite the funding allocated to education and the 1 Stephan du Toit (PhD) is lecturer of Mathematics Education ain the Faculty of Education at the University of the Free State. His research interests lie in investigating metacognitive approaches to the teaching and learning of Mathematics. E-Mail: dutoitds@ufs.ac.za; dutoitgf@ufs.ac.za 2 Gawie du Toit (PhD) is Professor of Education in the Faculty of Education at the University of the Free State. His research is on investigating issues of Mathematical Modelling. E-Mail: dutoitgf@ufs.ac.za government's acknowledgement of the importance of education, there are national and international concerns about the quality of the South African education system as 60% to 80% of schools are considered to be dysfunctional (Bloch, 2009: 17) .\nIn an effort to improve the quality of education, the Department of Basic Education (DBE) introduced a draft education sector plan in 2010, entitled \"Action Plan to 2014: Towards the Realisation of Schooling 2025\" (DBE, 2010a) . This Action Plan sets out 27 goals to address deficiencies in the following areas: teachers; learner resources; whole school improvement; school funding; school infrastructure, and support services.\nIt is evident that improving mathematics achievement is regarded as a major concern, as five of the first nine of the goals deal with learners' competencies and performance in mathematics at various levels. The objectives of Goal 5, for example, are to raise the number of learners who pass mathematics from 14.29% to 20% of the total number of candidates who obtain the National Senior Certificate (NSC) in 2014, and then to 33.3% in 2025 (DBE, 2010a: 17) . The small number of learners who obtain good results in Grade 12 mathematics and physical science is a cause for serious concern, as this leads to a shortage of professionals in the fields of medicine and financial management for example (DBE, 2010a: 17) . In 2010, only 30.9% of the 263 034 mathematics candidates obtained 40% and above for mathematics (DBE, 2011: 55-56 ).\nHowever, this concern stems not only from assessment results in the South African context, but also from results obtained from an international study on the Trends in International Mathematics and Science Study (TIMSS) and other international reports.\nThe TIMSS compares mathematics and science achievement between different countries. In 2003, the international average score for Grade 8 learners on the mathematics scale was 466. Singapore scored the highest, with a score of 605, and South Africa's Grade 8 learners scored the lowest of 46 countries, with a score of 264 (TIMSS, 2003: 5, 7) . A further indication of the poor performance of South Africa's learners is evident from the fact that South Africa was placed third from last out of 134 countries with respect to the quality of mathematics and science education in 2009 (Dutta & Mia, 2009: 326) and 138 th out of 142 countries in 2011 in the Global Competitiveness Report (GCR) (GCR, 2012: 343) .\nConcerns about mathematics achievement cannot be viewed from a mathematical point of view only, since many indirect factors emanating from the broader educational and community context of South Africa -for example, socio-economic and political factorscould influence mathematics achievement. However, it is important to identify potential factors that play a more direct role in mathematics achievement.\nDe Corte (1996: 34-36) states that studies in cognitive science have led to a broad agreement that expert performance in a given domain necessitates the integrated acquisition of four categories of aptitude, namely a structured, accessible domain-specific knowledge basis; heuristic methods; affective components, and metacognition.\nThese four categories of aptitude provide a more focused perspective on factors that influence achievement, in general, and mathematics achievement, in particular. The role played by learner metacognition and mathematics achievement in a problem solving context is of particular interest in this investigation."}, {"section_title": "Learner metacognition and problem-solving in mathematics", "text": "Metacognition was first used as a term in the 1970s, and sporadic references were made to metacognition in the literature of the early 1980s. Although metacognition was not well understood, it became a frequently used term in the latter part of the 1980s and a foremost topic in the field of cognitive developmental research (Schoenfeld, 1992: 9; PapaleontiouLouca, 2003: 9) . Various definitions of metacognition have in common the subcomponents, knowledge of cognition and regulation of cognition (Schoenfeld (1992: 2, 38-39; De Corte, 1996: 35-36; Papaleontiou-Louca, 2003: 12; Larkin, 2010: 3) .\nWhen solving problems, learners perform better when they become aware of their own thinking (Paris & Winograd, 1990: 15) . Butler and Winne (1995: 245) affirm that learner awareness of thinking processes enhances effective learning and improves learner achievement. Shraw (1998: 114) supports this claim, stating that learner performance is enhanced by metacognitive regulation, because learners utilise resources and existing strategies more effectively. A study conducted by Camahalan (2006: 194) also affirms that students' academic achievement is more likely to improve when they are given the opportunity to monitor and regulate their learning strategies. Larkin (2010: 16) agrees that the enhancement of metacognition improves academic attainment and states that it also leads to the holistic development of learners. Further studies on learner metacognition and achievement in mathematics have also established a correlation between learner metacognition and mathematics achievement ( Van der Walt, Maree & Ellis, 2008: 221; Mevarech & Amrany, 2008: 152; Özsoy & Ataman, 2009: 73) . Schoenfeld (2007: 60) states that views on effective learning environments in mathematics progressively developed in the 20 th century. Initially, learners were required to have a good understanding of mathematics concepts, skills and procedures. In the 21 st century, views on effective learning environments that enhance mathematics achievement also require of learners to have good problem-solving skills (Schoenfeld, 2007: 60) . This progression in viewpoints on mathematics achievement is evident in an earlier work of Schoenfeld (1992: 334-335) where he refers to the general agreement among mathematics educators that the most important objective of mathematics instruction should be to enhance learner problemsolving skills. In South Africa, the value of problem-solving in enhancing learner understanding and creative thinking skills is affirmed in The Curriculum and Assessment Policy Statement (CAPS) (DBE, 2010b: 6) :\nMathematical problem solving enables us to understand the world (physical, social and economical) around us, and, most of all, to teach us to think creatively.\nIn problem-solving, previously acquired knowledge and experience are applied to an unfamiliar situation that contains major obstacles in order to find a solution to the problem (Killen, 2010: 246; DuBois, Clinton, Trowell & Fincher, 2011: 369) . Problem-solving skills involve cognitive aspects such as flexibility, imaginativeness, thinking in different ways about a problem, using alternative strategies if difficulties are encountered, extending a solution to a broader or new context, and finding new solutions (Schoenfeld, 2007: 60) .\nProblem-solving activities present ideal opportunities for the enhancement of learner metacognition, since learners who are good at problem-solving are usually also self-aware thinkers. These learners demonstrate their advanced metacognitive skills by their ability to analyse their problem-solving strategies and reflect on their thinking processes (Blakey & Spence, 1990: 2; Panaoura, Philippou & Christou, 2001: 3) .\nThe mathematician George Polya is best known for his conceptualisation of problem-solving in mathematics (Schoenfeld, 1992: 339) . Polya distinguishes between four phases of the problem-solving process: understanding the problem; devising a plan; carrying out the plan, and looking back (Polya, 1945: 6-19) ."}, {"section_title": "Understanding the problem", "text": "Learners must understand the verbal statement of the problem to such a degree that they can easily repeat the problem statement. The main feature of the problem should be identified and that aspect, for which a solution must be obtained, the unknown, should be clearly pointed out. All given information, or data, and any conditions must also be indicated. This process of understanding the problem should be repeated, and learners should attempt to understand the problem from different perspectives (Polya, 1945: 6-7) . During this process of understanding the problem, the teacher should ask questions such as, among others, \"Are you all convinced that you understand the problem?\" (Schoenfeld, 1987: 202) ."}, {"section_title": "Devising a plan", "text": "A plan consists of an outline of the calculations and constructions that will lead to the solution and is regarded as the core aspect of finding the solution. Polya (1945: 8, 12 ) views the making of a plan as difficult, because it requires the learners' concentration, good luck and tenacity. Learners could receive unobtrusive help in this phase.\nThe importance of factual mathematical knowledge, prior knowledge and past experience are prerequisites for devising a plan. Consequently, learners should attempt to think of a related problem with a similar unknown that has been solved previously. If no link with a related problem can be established, the problem should be modified, that is, restated differently. Learners could first try to solve a related problem, but they risk losing sight of the original problem, if attention is only focused on the modified problem. As a result, learners should always bear in mind that they should use all given information and that their plan involves all given conditions (Polya, 1945: 8-10 ). Polya (1945: 12) regards this phase as easier than devising a plan, because learners only need to exercise patience in order to successfully carry out the plan. During this phase, each element of the plan needs to be scrutinised. Each step should be checked and, if possible, proved correct. In this regard, Costa (1984: 61) notes that teachers, instead of merely correcting the learners, should encourage them to clarify their course of action. Polya (1945: 13) perceives a potential danger in this instance, namely that learners would not be able to clarify their course of action if they had forgotten their original plan. For that reason, it is imperative that learners carry out their own instead of their teacher's plans. Schoenfeld (1987: 202) suggests that these plans could be changed. He states that, after the learners have worked on the problem for approximately five minutes, the teacher could ask them whether the process is going well, and if not, to reassess their strategies. If the learners decide to reject their strategies, the teacher could ask whether anything helpful could be recovered from their efforts. In contrast to Polya's statement that learners only need to exercise patience in order to successfully carry out the plan, Schoenfeld anticipates the possibility that learners would have to change their problem-solving strategies. Polya (1945: 14) regards this phase as very instructive, because learners' knowledge is consolidated and their problem-solving skills are enhanced if they re-examine the problemsolving process. When a solution is re-examined by checking the argument and the result, three important aspects of the problem-solving process emerge."}, {"section_title": "Carrying out the plan", "text": ""}, {"section_title": "Looking back", "text": "First, no problem is ever fully explored; further involvement will yield alternative and often better solutions. The initial understanding of the problem can also be enhanced (Polya, 1945: 15) . These alternative solutions serve to more strongly convince learners of the correctness of the answer, just as verification by sight and touch is stronger evidence than verification by sight or touch only (Polya, 1945: 15) .\nSecondly, as learners try to find alternative solutions to a problem, they recognise the connections between different mathematical problems and topics and between mathematics and other topics. Polya (1945: 15) stresses the duty of a teacher to help learners discover these connections. The process of looking back can also stimulate learners' levels of interest if they are encouraged to find alternative solutions.\nThirdly, common aspects of seemingly unrelated problems should be recognised and, therefore, learners should ask themselves how the problem-solving strategy or result could be useful in solving other problems (Polya, 1945: 15-16 ). Schoenfeld (1987: 202) also recommends that a teacher should review the problem-solving process with the learners and guide them in finding alternative solutions to the problem. This verification of the effectiveness of problem-solving strategies and the comparing of different solutions are also viewed as important elements of the reflective thinking process (Muijs & Reynolds, 2005: 64) ."}, {"section_title": "Problem statement and aim of the investigation", "text": "From the deliberations above the notion that students' mathematics achievement is equated to their performance in test scores in TIMMS and other test can be challenged. It rather became clear from these deliberations that successful problem-solving may be viewed as evidence of high achievement in mathematics. Furthermore, it is evident that learner metacognition plays a pivotal role during the problem-solving process. Against the background of the poor FET mathematics results, it is important to investigate what the level of learner metacognition and achievement in a problem-solving context is.\nThe aim of this investigation is twofold. First, it entails an exploration of what the level of learner metacognition in a problem-solving context is. Second, it investigates the level of mathematics achievement in a problem-solving context."}, {"section_title": "Methodology", "text": "The following word problem was given to the learners which they had to solve individually. The learners had to record, first, their thoughts relating to the problem and, secondly, the calculations that corresponded to their thoughts. This word problem relates to the area and perimeter/circumference of two-dimensional shapes. These topics were addressed in the years prior to Grade 11. The problem is phrased such that as few direct instructions as possible are given so that no direct route to the answer can be identified. The first clue of what the problem is about is the fact that the farmer is not certain as to which shape to use for the enclosure. The learners are explicitly asked to advise the farmer as to which shape to use on condition that the advice is based on calculations. The mathematical concepts hidden in the problem statement involve the enclosure and the sheep contained within the enclosure. Learners should realise that the enclosure relates to the perimeter of the shape and that the sheep contained within it relate to the area of the shape.\nLearners are expected to identify the core of this problem, namely that farming is a business that aims to maximise its profits. Therefore, if different shapes have different areas when the perimeter stays constant, the shape with the largest area would be most cost-effective. No direct references are made to maximum area or optimum use of the shape in terms of its area. The length of the fence is given as 100m, which is an arbitrary number that somewhat simplifies the calculations for the dimensions of squares and rectangles. It is, however, not an easy number to work with when calculating the diameter of the circle. The number of sheep (650) One would expect the learners to consider the following shapes: square, rectangle, triangle, and circle. The learners have dealt with the area and perimeter formulas for these shapescircumference formula in the circle's case -since Grade 8. Therefore, the learners were expected to easily cope with these formulas. As there are various rectangles with integral side lengths and a perimeter of 100m, only one rectangle's area -with dimensions that closely resemble a square -is calculated. The areas of these shapes are, in increasing order, 481.13m 2 (triangle); 624m 2 (rectangle); 625m 2 (square), and 795.77m 2 (circle). Therefore, the circle is the most optimum shape in respect of area, as there is a pronounced difference of 27.33% between the area of the circle and the area of the square.\nIn the analysis of the learners' level of achievement, the class teacher and the researcher independently analysed their level of performance by noting calculation and conceptual errors in calculating the areas of different shapes. The learners' level of metacognition was determined by analysing the written account of their thoughts and comparing it to the items on an adapted Metacognitive Awareness Inventory (MAI). The original MAI was developed by Schraw and Dennison (Schraw & Dennison, 1994) to determine the level of metacognition of adolescents and adults because other measures such as on-line experimental testing were very time-consuming (Schraw & Dennison, 1994: 461) .\nThe MAI assesses the two main factors of metacognition, namely knowledge of cognition (KC) and regulation of cognition (RC) . KC comprises learners' awareness of their strengths and weaknesses; knowledge about strategies, and knowledge about the use of strategies. The three subscales of KC are Declarative knowledge, Procedural knowledge, and Conditional knowledge. Declarative knowledge is knowledge about self and strategies; Procedural knowledge refers to knowledge about the use of strategies, and Conditional knowledge refers to knowledge about when and why to use strategies (Schraw & Dennison, 1994: 460) .\nRC refers to the control that learners exercise over their learning processes. It has five subscales that facilitate the regulation aspect of learning. According to Schraw and Dennison (1994: 460) , these aspects are: Planning (\"planning, goal setting, and allocating resources prior to learning\"); Information management (\"skills and strategy sequences used during learning to process information more efficiently, for example organising, elaborating, summarising, selective focusing\"); Monitoring (\"assessment of one's learning or strategy use\"); Debugging (\"strategies used to correct comprehension and performance errors\"), and Evaluation (\"analysis of performance and strategy effectiveness after a learning experience\")."}, {"section_title": "Validity and reliability", "text": "The validity of the MAI in assessing the learner metacognition according to the two factors KC and RC was established by Schraw and Dennison (1994: 470-471) . The original MAI questionnaire by Schraw and Dennison was adapted by changing some words to more familiar words in the South African education context. In addition, as the original MAI measures general learner metacognitive awareness, it was adapted to reflect a mathematical context. In the pilot study it was found that the adapted MAI had a high degree of internal consistency (reliability) as a Cronbach's alpha value of 0.91 was obtained for the MAI total score. Regulation of cognition (0.89) and Knowledge of cognition (0.81) also had high Cronbach alpha values."}, {"section_title": "Sample", "text": "A non-probability sampling strategy was employed in this study (Cohen, Manion & Morrison, 2007: 113) . Data were collected from one intact Grade 11 class of 25 girls. This school, in the Motheo district of the Free State, is a Quintile 5 school that offers excellent opportunities in respect of academic aspects, as well as cultural and sport activities. English is the medium of instruction and there is a vibrant interaction of girls from different home languages, cultures and races.\nThe mean age of learners was 16.40 when they took part in the problem-solving session. Fifteen (60%) of the 25 learners were aged 16, and 10 learners (40%) were aged 17 when data were collected.\nThe highest percentage (32%) of learners had Sesotho as a home language. A significant percentage of the learners had English (20%) and Tswana (20%) as a home language. Xhosa (16%), Zulu (8%), and Afrikaans (4%) were the home languages of the lowest percentage of learners."}, {"section_title": "Analysis of results", "text": ""}, {"section_title": "The level of learner metacognition", "text": "The majority of the learners expressed their thoughts freely in written form. Learner 10, for example, reminded herself about an important piece of information in the problemstatement:\nNeed to use most of the fence to fit all his sheep. Remember that he only has 100m. The learners' metacognitive awareness primarily related to the following subscales of the MAI: Declarative knowledge, Planning, Information management, and Monitoring. The other four subscales featured to a lesser degree. All eight subscales featured as follows (see Table 2 ). Declarative knowledge refers to knowledge about one's skills, intellectual resources, and abilities as a learner. Item 17 (\"I am good at remembering mathematics facts and principles\") was very prominent as it relates to knowledge of the correct formulas for the areas of the different shapes. Generally, the formulas for the perimeter/circumference and area of the Secondly, Planning entails the following aspects: planning, goal-setting, and the allocation of resources prior to a learning activity. Two items were applied frequently, namely, Item 22 (\"I ask myself questions about the problem before I begin to solve a mathematics problem\") and Item 23 (\"When I start to solve a mathematics problem, I think of several ways to solve the problem and choose the best one\"). An example of an application of Item 22 is evident from the next question by Learner 26:\nWhat is the formula for the area of a square?\nLearner 22 applied Item 23 as follows:"}, {"section_title": "I first thought of the word shape and decided to write down all my formulas of shapes and by maybe substituting the information given in my formulae.", "text": "As Item 23 is very similar to Item 2 (\"I first consider different ways of solving the problem before I start solving a problem in mathematics\") of the subscale Monitoring, I coded the majority of learner references to different shapes as falling under Items 22 and 2.\nThirdly, Information management entails skills and strategy sequences during learning in order to process information more efficiently. Two items featured very prominently during the problem-solving session, namely Item 13 (\"I consciously focus my attention on important information in a mathematics question\") and Item 30 (\"When I receive new information about a familiar topic or a new topic in mathematics, I focus on the meaning and significance of the new information\"). As these two items are very similar, I also coded learner references to the important information in the problem statement as belonging to Items 13 and 30. Learner 16, for example, realised that the core of the problem was about the concept 'maximum area', as she stated the following:\nA circular kraal would be the best option because there should be more space.\nFourthly, Monitoring comprises assessment of one's learning or of one's use of strategy. Item 2 was applied frequently in the problem-solving session. As stated earlier in this section, I grouped Item 2 with Item 22, as both items refer to the consideration of different problemsolving methods at the start of a problem-solving session. In the context of the problemsolving session, different problem-solving methods refer to the area calculations of different shapes.\nTherefore, the learners' metacognitive awareness during the problem-solving session related mainly to the metacognitive behaviours described in the following six items of the MAI: Item 17 (Declarative knowledge); Items 22 and 23 (Planning); Items 13 and 30 (Information management), and Item 2 (Monitoring)."}, {"section_title": "The level of mathematics achievement", "text": "Only one learner was successful in solving the problem. An analysis of learner errors in the problem-solving session provides some insight into some reasons for their poor performance.\nConceptual errors were very common, in particular those relating to the length of the diameter and the radius. A diameter of 50m was used in a number of calculations, probably because those learners were of the opinion that the diameter equals half the circumference, since the diameter splits the circle into two 'halves'.\nA substantial number of conceptual errors related to the length of the radius. The radii lengths varied between 25m and 100m. Arguably, the most difficult calculation in this problem was to determine the radius' length. Yet, these mistakes point to a lack of understanding as to how the radius and diameter relate to the circumference.\nAs expected, another conceptual error concerned the confusion between the area and circumference formulas for a circle. In addition, some learners equated the circumference length or the 650 sheep to the area of the enclosure. Some learners put the 650 sheep equal to 100m. These errors indicate serious learner misunderstanding of the concepts 'area' and 'circumference'. The only conceptual errors that did not involve the circle were noticed in the answers of a few learners who used a square or a rectangle with perimeters that did not equal 100m.\nIn contrast to these various conceptual errors, there were very few calculation errors. These errors were in respect of the wrong calculations of the quotient of 100 and 4, the product of 100 and 100, and the height of a triangle.\nAnother aspect that should be considered in the analysis of this problem relates to the practicality of the shapes. Would it, for example, be easier to construct a square enclosure than to construct a circular enclosure? What limitations would a triangular enclosure impose on the movement of the sheep? Learner 2, for example, stated that:\nThe triangle has sharp corners ∴ it wouldn't be an ideal shape to use ∴ we can work out the area for the other three shapes.\nThese practical aspects, however, should not distract from the core of the problem, namely that it would be most cost-effective to construct a circular enclosure, as it yields the largest area for the given perimeter.\nI think that most mathematics teachers would have expected -as I did -that, say, at least 10 of the learners would show that the circle has the biggest area. However, only one learner calculated that the circle would be the best option after comparing the areas of a rectangle, a square, and a circle with one another. One should consider a few factors in order to understand why all learners, except one, failed to solve the problem.\nTime constraints could have played a role. The learners were given 20 minutes to solve the problem and an analysis of the learners' answers indicates that the majority of them made a substantial number of calculations. Yet, one must take into account that the format of the problem-solving session was novel in respect of at least one, and probably two aspects. First, the learners have never given a written account of their thoughts during a problem-solving session. Secondly, the problem statements of previous problem-solving sessions, in which the learners took part during normal school periods, were probably not stated in such vague terms in respect of what they were expected to do. Normally, textbook problems follow after certain topics have been addressed. This implies that learners generally have a good idea of where to start, as opposed to this problem where the mathematical topics are concealed to a considerable degree.\nIn the teacher's analysis of the learner responses in the problem-solving session, he referred to common mistakes; for example, not calculating the length of the radius and using an arbitrary rectangle in their calculations. His statement that \"…learners seem uncomfortable with converting between a word problem and algebra\" is indicative of the complexity of translating everyday language into the language of mathematics; in fact, he stated that this difficulty \"…is a common theme in many classrooms as far as I can tell\"."}, {"section_title": "Discussion of the results", "text": "The level of learner metacognition I compared the learners' level of metacognition to the four steps of Polya's problem-solving model as this model provides the background to metacognitive behaviour in a problemsolving context. To me, the secret to unlocking this problem lies in identifying the hidden mathematical concepts. In writing down their thoughts, I would have expected the learners to use phrases that relate to the relationship between the area and perimeter of different shapes. In addition, I expected them to think of basic shapes such as the triangle, rectangle, square, and circle (Understanding the problem). Furthermore, I expected them to state that they were going to compare the areas of these different shapes (Devising a plan) . Moreover, I anticipated that they would identify the correct formulas for the area and perimeter of these shapes and apply these formulas correctly (Carrying out the plan). Finally, I did not expect that many of the learners would evaluate their answers and reflect on the practicality of their solution (Looking back).\nOf the six items that featured strongly in the problem-solving session, Item 22 (\"I ask myself questions about the problem before I begin to solve a mathematics problem\"), Item 13 (\"I consciously focus my attention on important information in a mathematics question\"), and Item 30 (\"When I receive new information about a familiar topic or a new topic in mathematics, I focus on the meaning and significance of the new information\") relate to Polya's first phase, namely Understanding the problem.\nItem 23 (\"When I start to solve a mathematics problem, I think of several ways to solve the problem and choose the best one\") and Item 2 (\"I first consider different ways of solving the problem before I start solving a problem in mathematics\") point to metacognitive behaviours when Devising a plan, Polya's second phase.\nThe last of these six items is Item 17 (\"I am good at remembering mathematics facts and principles\"). This item was very prominent, as it relates to the application of the correct formulas for the areas of the different shapes. Therefore, this item links with Polya's third phase, Carrying out the plan.\nThus, there is strong evidence that the learners' metacognitive behaviours corresponded to the first three phases of Polya's problem-solving model. The question arises: Did Polya's fourth phase feature in the problem-solving session? Items that relate to Polya's fourth phase are Item 19 (\"After I have solved a mathematics problem, I ask myself if there was an easier way to solve the problem\") and Item 38 (\"After I have solved a mathematics problem, I ask myself whether I have considered different ways to solve the problem\"). These two items are part of the subscale Evaluation. They were not applied once during the problem-solving session. Time constraints could have prevented the learners from reflecting on the problemsolving process and, in particular, from finding alternative solutions for the problem.\nApart from Evaluation, it is worth considering which other subscales of the MAI did not feature prominently during the problem-solving session. These were Procedural knowledge (knowledge about how to implement problem-solving strategies); Conditional knowledge (knowledge about when and why to use learning procedures), and Debugging (strategies used to correct comprehension and performance errors). In all fairness, it must be stated that most of the items of these four subscales relate to the broader mathematical learning process and are not applicable to a problem-solving situation. Conditional knowledge, for example, relates more to learners' study habits than to their problem-solving behaviours. However, I would have expected the two items of Debugging to feature to a greater extent. These were Item 40 (\"I change my problem-solving method when I fail to make progress when I try to solve a mathematics problem\") and Item 43 (\"If I do not make progress when I solve a mathematics problem, I ask myself whether my first understanding of the problem was correct\")."}, {"section_title": "Conclusion and recommendations", "text": "The aim of this investigation was, first, to determine the level of learner metacognition in a problem-solving context. Although the learners recorded their thoughts freely, the fact that there were no metacognitive behaviours that corresponded with Polya's fourth phase (Looking back) and the subscale Evaluation indicate that the learners were not aware of the importance of a crucial aspect of problem-solving, namely reflecting on the validity and correctness of one's solution.\nA second aim was to determine the level of mathematics achievement in a problem-solving context. The fact that only one learner solved the problem successfully, combined with the evidence of numerous conceptual errors in respect of mathematical content dealt with in previous years, point to poor achievement in a problem-solving context. However, the novel aspect of solving open-ended word problems could have had a negative impact on learner achievement.\nEffective, sustainable learning environments in mathematics should promote the development of learner problem-solving skills because it indicates true achievement in mathematics where a high level of learner metacognition is demonstrated. Hence it is recommended that education stakeholders should earnestly address the issue of enhancing learner metacognition and learner problem-solving skills. "}, {"section_title": "List of references", "text": ""}]