[{"section_title": "Abstract", "text": "Alzheimer is a neurodegenerative disease that usually affects the elderly. It compromises a patient's memory, his/her cognition, and perception of the environment. Alzheimer's Disease detection in its initial stage, known as Mild Cognitive Impairment, attracts special efforts from experts due to the possibility of using drugs to delay the progression of the disease. This paper aims to provide a method for the detection of this impairment condition via the classification of brain images using Transfer Learning -Deep Features and Support Vector Machine. The small number of images used in this work justifies the application of Transfer Learning, which employs weights from VGG19 initial layers used for ImageNet classification as deep features extractor, and then applies Support Vector Machines. Majority Voting, False-Positive Priori, and Super Learner were applied to combine previous classifiers predictions. The final step was a detection to assign a label to the previous voting outcomes, determining the presence or absence of an Alzheimers pre-condition. The OASIS-1 database was used with a total of 196 images (axial, coronal, and sagittal). Our method showed a promising performance in terms of accuracy, recall and specificity."}, {"section_title": "INTRODUCTION", "text": "The Alzheimer's Disease (AD) is a neurodegenerative dementia that affects the human abilities related to memory, language, perception of the environment and cognitive skills (Ferreira and Busatto, 2011) . Mild Cognitive Impairment (MCI) is known as a prodromal stage of AD and corresponds to the range between a normal aging and dementia. MCI is gaining attention because by predicting the disease in this stage, patients are able to find out ways to slow down the disease. Besides, this stage is relevant due to its strong relationship with the AD progression. As a matter of fact, 10-12% of the MCI cases convert to AD each year (Petersen et al., 1999) .\nThe most popular term used to classify specific stages in the MCI is the Clinical Dementia Rating (CDR), defined by the following levels: CDR-0 represents Normal Control (NC) or non-dementia people; CDR-0.5 corresponds to a very mild dementia; CDR-1 represents a mild impairment dementia; CDR-2 is a moderate dementia, whereas CDR-3 indicates severe dementia. These levels allow the medical team to identify a better prognostic for the AD patient. They also facilitate the process of classifying images. Different analysis are currently used to diagnose or predict AD, such as: (1) Family History; (2) Imaging; (3) Cognitive Tests (Mini-Mental State Examination); and (4) Neurological Exams.\nThis work uses imaging to support the prediction of the Alzheimers disease through the detection of MCI, which is one indicator of early signs of AD. It is very difficult to predict AD using only one projection of the brain (e.g. sagittal). Thus, the combination of the different planes of the brain, also known as multiprojection, is used and has reached higher accuracy than single-projection frameworks (Aderghal et al., 2017) (Zhou et al., 2017) . The results in the literature achieve higher accuracy also when comparing some stages of the disease, for instance, when comparing CDR-0 and CDR-3 patients (Khedher et al., 2015) (Suk and Shen, 2016) . However, our work focus on the two initial stages (i.e. CDR-0.5 and CDR-1) due to our emphasis on predicting the AD dementia as soon as possible. An example of brain atrophy is shown in Figure 1 .\nIn this work, we aim at classifying MCI images using visual information and a small number of samples. Image data was analyzed using Transfer Learning with Convolutional Neural Networks (CNN) and "}, {"section_title": "Support Vector Machine (SVM).", "text": "The main features and contributions of this work are: (1) The combination of Transfer Learning, SVM, and Voting for small datasets; (2) The Grouping of MCI classes to improve the number of images per class (i.e. thus facilitating the identification of patterns); (3) Application of our approach to the first stages of MCI, which turns the discrimination of AD a more challenging task; (4) The availability of the code and the implementation used to generate this paper.\nThe remainder of this paper is organized as follows: In Section 2 we address related work. The proposed method, the fundamentals and details of each step in the method are addressed in Section 3. The experiments and the evaluation of the method are shown in Section 4. Finally, in Section 5 we present our conclusions."}, {"section_title": "RELATED WORK", "text": "Different computational methods using textual data or visual information have been applied in the medical field. For example, Lebedev (Lebedev et al., 2014) address the problem of diagnosing AD using Random Forest (RF) classifiers and different measures obtained from clinical Magnetic Resonance Imaging (MRI) data. The best performance was achieved with RF and it reached an accuracy over 90% by comparing AD with NC images.\nThe use of a CNN is presented by Wang (Wang et al., 2017) to automatically recognize MCI in MRI. The authors addressed the problem of limited training data using data augmentation and transfer learning to pre-train the proposed CNN model. Three different datasets were used for the training and classification stages: OASIS, LIDC, and ADNI, The authors reported an accuracy of 90,6% and a F-score of 89,4%.\nThere is a body of work that combines information from different modalities or projections. When dealing with the prediction of the AD (Normal, MCI and AD levels), Fiot (Fiot et al., 2012) employs the use of Laplacian EigenMaps in order to reduce the data dimensionality and the K-Nearest Neighbor (KNN) classifier. They used the MRI, one protein, and six genotype data from the ADNI dataset and reached accuracies from 62% up to 83% when comparing Normal and MCI classes.\nKhedher (Khedher et al., 2015) used the data provided by ADNI dataset to compose a multivariate method with Partial Least Squares, Principal Component Analysis and SVM. Aderghal (Aderghal et al., 2017) proposed a multi-projection fusion of Axial, Coronal and Sagittal CNNs using Regions of Interest. The accuracy reached was 85,94% when comparing AD and NC. In Suk and Shen (Suk and Shen, 2016) , the authors proposed a framework based on sparse regression as learner representation. Thus, they built a CNN for clinical decisions. An accuracy of 90,28% was reached by their method. Using Positron Emission Tomography (PET) images instead of MRI scans, Gray (Gray et al., 2011) proposed a region-based analysis of AD patients, using segmentation of 83 anatomical regions obtained by MRI. The authors used SVM to classify samples and reached an accuracy of 82% when comparing AD and NC. Cheng and Liu (Cheng and Liu, 2017) proposed a method based on 2D-CNN to learn features from 3D PET images, and they achieved an accuracy of 91,40 % .\nSome of the literature reviewed in this section reached a relative high accuracy since they compare NC and AD images. Clearly, AD images possess more discriminative features of the disease than MCI images. For example, in Khedher (Khedher et al., 2015) , the results obtained by the comparison of NC and MCI reached an accuracy of 80,27%. On the other hand, when comparing only the NC and AD classes, the accuracy was increased to 88,49%. Our work defines a scenario with a focus on MCI, which represents the initial levels of disease.\nIn essence, our work differs from previous works by the following features: (1) the use of Transfer Learning (TL) instead of fully-CNNs. The TL-CNNs have not been previously applied within the same context of this work; (2) the use of the first two classes of MCI (i.e. CDR-0.5 and CDR-1). The most challenging prediction of the early stages of the Alzheimer disease via classification lies within the first classes because these images are quite similar to those from healthy individuals; (3) the proposed method reached satisfactory results even when using a small set of images."}, {"section_title": "PROPOSED METHOD", "text": "We arranged the method in six major steps ( Figure  2 ): (1) Input data: including acquisition and categorization; (2) Preprocessing: it involves skull stripping, image enhancement, and data normalization;\n(3) Classification: it combines Transfer Learning and SVM. Super Learner was also applied to the SVM outputs; (4) Voting: the method applied Majority Voting and False-Positive Priori to the outputs of SVM; (5) Detection: it also applies Majority Voting to the inputs and it labels the samples combining the previous procedures; (6) Output: generate a label defining either the presence or the absence of MCI.\nOur method (Figure 2 (a)) starts out by extracting each slice of a 3D-brain projection. The MCI classes are grouped using Spectral Clustering (Figure 2(b) ). Thus, the skull is removed and the intensity adjusted. For the sake of classification, Transfer Learning is applied in each representation to generate deep features, which are further used in SVMs to classify images. Methods such as Majority Voting, FP Priori, and Super Learner are used to combine the results of the projections. Finally, Majority Voting is carried out to group the results of each method. The final response is the detection whether a subject has MCI or not.\nIn Figure 2 (a), each crossed blue line with identifier three (3) informs the number of projections in the flow. Also, in each blue circle, the upper part means an example of response for each projection (i.e. axial, coronal, and sagittal), whereas the lower part shows the result after voting or classification. We now discuss each step of the method in more detail."}, {"section_title": "Input Data", "text": "In this work, the Open Access Series of Imaging Studies (OASIS)-1: Cross-sectional MRI Data in Young, Middle Aged, Nondemented and Demented Older Adults was used. The CSV file dataset is formed by 436 subjects data (135 NC, 70 CDR-0.5, 28 CDR-1, 2 CDR-2, and 201 unlabeled) with age between 18 and 96 years. For each patient, the following information is given: (1) Each subject is associated with a 208x176x176 pixel image. Three slices from different views of the brain were extracted: (1) The Axial MRI, which is composed of 208 x 176 pixels (slice #90); (2) Coronal MRI, consisting of 176x176 pixels (slice #110), and (3) Sagittal MRI with 208x176 pixels (slice #95). The extraction of each brain projection is showed in the Figure 3."}, {"section_title": "Preprocessing", "text": "Preprocessing plays a key role in every classifier's performance. In this work, the same preprocessing flow was applied to each individual brain projection, which were programmatically extracted from the original 3D brain representation."}, {"section_title": "Grouping of the MCI Classes", "text": "This step employed information provided by the OA-SIS dataset, which consists of clinical, demographic, and functional information of subjects. The algorithm used for grouping the MCI-classes (in step 5) was Spectral clustering. It required four preparation steps, i.e. steps 1-4 for data cleaning and transformation: 1. Removal by age: Guerreiro (Guerreiro and Bras, 2015) indicated that the brain has a normal atrophy due to aging. Thus, a healthy 96 year-old brain shows discriminative values in relation to an 18-year-old brain. The authors also point out that AD commonly occurs at age 65 or older. In order to avoid misclassification, 238 subjects under age 60 were removed from the original dataset with 436, thus remaining 198 subjects. 2. Removal by classes: Two subjects classified as CDR-2 were also removed, thus remaining 196 subjects. The goal was to avoid mislabeling due to the small number of samples; 3. Data filling: 19 subjects had no SES information. Instead of removing these data, this condition was mitigated by adding values using Progressive Sampling and Linear Regression; 4. Data transformation: The goal is to fit the data for the Spectral Clustering inputs using the following steps: (a) Scale adjustment: The eTIV and nWBV attributes were originally specified in different scales. Thus, if the data were below a certain threshold (10 in our case), they were multiplied by 10 3 ; (b) Attribute binarization: The Gender attribute originally had (M/F) categorical values. They were binarized by setting one (1) for M and zero (0) for F; (c) Normalization: In order to assign the same weight to each type of attribute, the data were normalized using the Standard Score (z-score) (Equation (1) \nwhere x represents the data points,x is the mean value of an attribute, and σ is the standard deviation. 5. Spectral Clustering: The two initial CDR-classes with dementia (i.e. CDR-0.5 and CDR-1) were grouped using spectral clustering to create the group of non-healthy subjects. This technique is based on a similarity matrix and eigenvalues and the goal is to perform a reduction in the dimensionality of the data. The outcome is the assignment of the CDR-0 class to one group and both the CDR-0.5 and CDR-1 classes to another."}, {"section_title": "Skull Stripping", "text": "Also known as Brain Extraction, this step deals with the removal of non-cerebral tissue from an MRI scan. The OASIS-1 dataset provides brain images that are already extracted. However, brain extraction may be independently accomplished my means of the Brain Extraction Tool (Jenkinson et al., 2005) ."}, {"section_title": "Intensity Enhancement", "text": "The pixels in magnetic-resonance images have distinct intensities, which requires that the contrast must be adjusted so that they all fall within the same interval. Thus, the pixels were normalized using a 256-bin MinMax through Equation (2):\nwhere I IE is the enhanced image, I represents the original image, high represents the highest-intensity pixel value, low is the lowest-intensity pixel value, i and o are reference indexes to input and output data respectively."}, {"section_title": "Classification", "text": "Classification is the problem of identifying to which of a set of categories (sub-populations) a new observation (data) belongs. It adds a label to a data sample, thus assigning it to a specific set. In this work, the labels are binary as they specify either the presence or the absence of MCI (i.e. CDR-0.5 and CDR-1). The two types of classifiers used were Transfer Learning and SVM. SVM's are used to divide a dataset with binary classes in a hyperplane representation. In this work, we set the SVM using the following attributes: C=1.0, kernel = radial basis function. Since SVM's are quite well documented in the literature (Hearst et al., 1998) (Cristianini and Shawe-Taylor, 2000) , in this section we focus on Transfer Learning.\nCNN is a specific type of neural network that uses grid-topologies as input data, such as images. Unlike Artificial Neural Networks, CNNs have Convo-lutional Layers for the processing of linear functions and Pooling Layers for the non-linear ones. However, CNNs have some restrictions: (1) They can only be performed with a large number of images (i.e. thousands). Depending on the model, the number of weights can reach millions for each convolutional layer and their processing demands a relatively high computational effort; (2) In the medical field there are few domains that have large (i.e. enough) amount of available data.\nTL-CNN is a methodology that transfers pretrained network information to another network, whether it belongs to the same domain or not. It is an alternative to the application of CNNs when the datasets are relatively small.\nIn this work, we used TL-CNN as follows: (1) A VGG19 pre-trained network using the ImageNet dataset was loaded; (2) As the images inside ImageNet have no relation to our images, only the six first layers were maintained (the first layers only extract generic features); (3) All the layers from the seventh up to the last one were excluded; (4) Once the images are input to the neural network, the outputs of the sixth layer are L matrices with M × N dimension, where L represents the number of kernels and M × N represents the image size; (5) Finally, we reshaped the output to one row per image (also known as deep features)."}, {"section_title": "Voting", "text": "Each method is pooled before a final classification decision is carried out. In this work, two voting approaches were used: (1) FP Priori: The decision of the ensemble is TRUE if at least one of the classifiers results in a false-positive (FP). (2) Majority Voting: Individual classifiers are combined by taking a simple majority vote of their decisions. For any given instance, the class chosen by most number of classifiers is the ensemble decision."}, {"section_title": "Detection and Output", "text": "The procedure for detection is quite simple: the output of the Majority Voting, the Super Learner and the FP Priory are submitted to another Majority Voting to generate the final label. The final output is a boolean flag (or label) indicating whether a subject has MCI (labeled as 1) or not (labeled as 0)."}, {"section_title": "Software Implementation", "text": "The following tools were used for the implementation of the method: (1) In the Input step, the 208x176x176-pixel images were sliced using the MATLAB's r2015b Image Processing toolbox; (2) The grouping of MCI classes was implemented early in the preprocessing step using Python 3.4 Jupyter Notebook, with the Scikit-learn package. Some steps were manually coded (e.g. Progressive Sampling). The image enhancement and skull stripping were generated using MATLAB; (3) The Classification step was all implemented using Python 3.4 Jupyter Notebook. The extraction of deep features were obtained using the Keras toolbox (with TensorFlow backend). Once the CNN features were extracted, the SVM was applied using the Scikit-learn package. The Super Learner was manually implemented; (4) In the Voting step, both the techniques (FP Priori and Majority Voting) were manually implemented using Python 3.4 Jupyter Notebook. (5) Detection was implemented using Python 3.4 Jupyter Notebook; (6) Finally, the metrics were generated using Python 3.4 Jupyter Notebook with Scikit-learn package.\nAll images and codes implemented in this work are available in the GitHub platform (Duarte and Paiva, 2018) ."}, {"section_title": "EXPERIMENTS AND RESULTS", "text": "Five metrics were adopted in this work: (1) Precision -P; (2) Recall -R; (3) F-score -F; (4) Accuracy -A; (5) Specificity -S. They are obtained by combining the true-positive (TP), true-negative (TN), falsepositive (FP), and false-negative (FN) values. These evaluation metrics are obtained as follows:\nThe data were first divided into a training and test set by applying a 10-fold cross-validation. After the results have been obtained, it is performed the average between metrics using all folds. Thus, reducing the significance of random factors. Regarding the TL-CNN methodology, the training set was also divided in 10% for validation and 90% remaining kept training set.\nTo obtain a reasonable accuracy in the voting step, it is significant to ensure that there is a small correlation among the classifier outputs. The correlation matrix for these outputs is illustrated in Table 1 . The analysis using the Pearson Correlation coefficient shows that the only correlations that are \"moderate\" are the Axial and the Coronal (0.72). The correlation between the other attributes is considered \"weak\". Even though the correlation between Axial and Coronal is moderate, we opted to keep the three projections since it is not possible carry out any decision with only two projections, i.e. a third projection is always needed for tie-breaking. Table 2 presents the results of our method and the literature (NC vs MCI) regarding the five metrics. When comparing with classifiers from literature, the best ensemble evaluated regarding the specificity value was FP Priori (0.754).\nThe dataset was reduced to prevent any bias in the classification step. For example, the subjects under 60 years were all removed due to their high discriminative patterns in regard to subjects above 60 years. The CDR-2 samples were also removed due to their insufficient number (i.e. two), which would cause a mislabeling at the time the CNN was trained. In the end, 53% of the samples were removed.\nThe results are shown in Figure 4 . Our method ranked 5th (FP Priori) for Recall; 4th (Arbitrary) for Accuracy, and 3rd (FP Priori) for Specificity. Nevertheless, our best result was achieved with the Arbitrary voting (precision = 0.72, F-Score = 0.716, and accuracy = 0.726). It is important to notice that the number of samples in our case was lower than the others in the literature (196 x 287 Kheder) . Unlike Khedher who used ADNI, we used the OASIS dataset. We have also not extended the data. Among the work reviewed in this section, the only that employed multimodality was Khedher (Khedher et al., 2015) , which from the literature was the best work evaluated. However, the authors do not specify the CDR classes that were considered. (Khedher et al., 2015) -0,735 -0,803 0,827 287 Gray (Gray et al., 2011) -0,738 -0,702 0,623 609 Suk and Shen (Suk and Shen, 2016) -0,789 -0,742 0,663 805 Aderghal (Aderghal et al., 2017) -0,650 -0,656 0,663 1020 "}, {"section_title": "SUMMARY AND CONCLUSION", "text": "Alzheimer's disease is currently ranked as the sixth leading cause of death in the United States. However, recent estimates point out that the disorder may be the third cause of death for older people, just behind heart disease and cancer. Thus, computational tools, methods, initiatives and efforts that support the combat of Alzheimer or MCI are welcome.\nIn this work, we have presented a multi-projection method based on a combined TL-CNN and SVM application using Axial, Coronal, and Sagittal planes, focused on to classify the first classes of the Alzheimer's Disease. Our process was defined by six major steps: (1) input data, which is consisted of visual data (MRI scans); (2) preprocessing, which is composed of class grouping, skull stripping, and intensity enhancement; (3) classification, using Transfer Learning and Support Vector Machine to find AD-classes. The final steps were to aggregate the voting (4) and classifier methods to obtain the detection (5) and output label (6) for a subject.\nThe focus of this work was on predicting the Alzheimer's disease by detecting the MCI classes of AD using Transfer Learning and SVM combined from different brain projections. The method was applied to a small dataset covering the prodromal stages of the disease, where it is more challenging to find differences between patterns on the first MCI classes. We argue that this may be regarded as the worst-case input scenario for the proposed method. For future work, we suggest data augmentation as a preprocessing step in order to improve accuracy, due to its capability of generating different and additional patterns from input data."}]