[{"section_title": "Abstract", "text": "Abstract In the US, the prevalence of three-generation households, where a grandparent, parent and child coreside, has increased in the last decade. Three-generation coresidence during infancy is particularly common and as many as 15 % of infants live in a three-generation household shortly after birth. Although prior research has linked family structure with breastfeeding behavior, no research has studied whether breastfeeding behavior varies by grandparent coresidence. This study is the first to investigate the association between three-generation coresidence and breastfeeding behaviors. This paper uses two data sets, the Early Childhood Longitudinal StudyBirth Cohort (n * 8,250), a nationally representative study of US children, and the Fragile Families and Child Wellbeing Study (n = 4,053), an urban sample of mostly low-income unmarried US mothers, to study the association between three-generation coresidence and breastfeeding initiation and duration using multivariate logistic regressions with extensive socio-demographic controls. Three-generation coresidence was associated with lower odds of breastfeeding initiation among the less advantaged mothers but not in the nationally representative sample of mothers. In comparison, three-generation coresidence was associated with lower odds of breastfeeding for 6 months or greater in both study samples. Threegeneration coresidence may serve as a marker for differences in the likelihood of breastfeeding that can help inform public health strategies aimed at increasing breastfeeding rates. Research studying interventions with grandparents and the effects on breastfeeding behaviors may be a useful next step in public health promotion of breastfeeding."}, {"section_title": "Introduction", "text": "Demographic trends away from marriage, toward increased nonmarital childbearing, and an aging population, have led to changes in household structure over the last 40 years [1] . Today more than 40 % of children are born to unwed parents [2] . Increasingly, children spend time in a household with a parent and a grandparent-a three-generation family household [3] . In early childhood three-generation households are particularly common [4] , and in the last 10 years the share of US children living in three-generation households has risen from 6 % in 2001, to 8 % in 2011 [5] . In addition, research has found that about 18 % of infants in large cities live in a three-generation family household at birth [6] .\nDespite the prevalence of three-generation family households at the birth of a child, no research has studied the association between three-generation coresidence and breastfeeding behaviors. Breastfeeding is associated with numerous benefits for both the breastfeeding mother and infant, such as: fewer infections and developmental delays for the child [7] [8] [9] [10] [11] [12] , lower rates of child obesity [13] , and lower rates of breast and ovarian cancer for the mother [14] . Given the increasing share of children who live in three-generation family households during infancy, and the potential benefits of breastfeeding, understanding whether three-generation coresidence is associated with breastfeeding behaviors is important.\nThere are a number of reasons why coresidence with a grandparent might influence breastfeeding behaviors among new mothers. Prior research has demonstrated differences in the likelihood of initiating and maintaining breastfeeding by family structure [15] [16] [17] . This research has found that married mothers breastfeed at higher rates than cohabiting or single mothers [15] . Studies also find that cohabiting mothers breastfeed more than single mothers [16, 18] . Differences in financial resources and supportiveness of the coresident father partially explain these differences.\nSimilarly, if a coresident grandparent provides additional support after the birth of a child, their presence in the household may also encourage breastfeeding. Research has found that economic wellbeing is generally higher for children in single mother three-generation households, as compared with single parent households [19, 20] . If a grandparent provides additional economic resources to the household, mothers may be able to purchase services, such as lactation consultants or breast pumps, which promote breastfeeding. Studies have documented that coresidence is linked with more financial, practical and emotional assistance [21] . If grandparents help take care of the infant, other children, or household tasks, the mother may have more time and energy to breastfeed. Research from other areas of health (unintentional injuries and nutrition) have linked grandparent care with improved outcomes [22, 23] suggesting that grandparents provide additional resources that promote child wellbeing.\nSimilar to a mother's partner, grandparents may also provide social or emotional support [21, 24] that could similarly increase breastfeeding. An extensive body of literature has studied the role of social support in breastfeeding initiation and duration and found that mother's partners, friends and parents play an important role in encouraging breastfeeding [25] [26] [27] [28] [29] . Both emotional and concrete support from social networks have been linked to breastfeeding [30] and coresident grandparents may be particularly well positioned to provide this support [26, 31, 32] . If grandmothers themselves breastfed, they may also provide emotional support that increases breastfeeding [31, 33] . Although a number of studies note the importance of grandparents as a source of informational, instrumental and emotional support [31, 34] , and other studies have investigated how grandparents may be utilized to promote breastfeeding [33, 35] , no research has studied whether mothers who coreside with a grandparent breastfeed more or less than mothers who do not live with a grandparent. The current study addresses this gap in the literature.\nCoresidence with a grandparent could, however, also be associated with lower rates of breastfeeding. Grandparents could be an economic or emotional drain to mothers. If a grandparent is in poor health the mother may need to divert resources away from care for the infant toward the grandparent [36] , possibly resulting in less breastfeeding. Even among healthy grandparents, coresidence may introduce strain or tension into the household [37, 38] , which could affect a mother's mental and physical wellbeing, influencing her ability to breastfeed [39] . In addition, if a coresident grandmother did not breastfeed herself, she might undermine a mother's intentions by giving advice against breastfeeding. As breastfeeding was far less common in the US during the 1960s and 1970s, coresident grandmothers may not have breastfed themselves [40] . Qualitative research has documented how mothers whose own mothers did not breastfeed, found it challenging to maintain breastfeeding [41, 42] . This research found that the grandmothers sometimes felt that formula was a better option, made mothers feel uncomfortable about breastfeeding around them, or even intervened with formula when a baby was fussy. If coresident grandmothers provide frequent care for the infant, grandmothers (and the mothers) may prefer the convenience of formula, thus decreasing the likelihood that mothers breastfeed. Another study noted that grandparents reported feeling excluded as a result of breastfeeding [27] , which could lead grandparents to counsel against breastfeeding. A study in Brazil found that mothers were more likely to abandon breastfeeding if the child's grandmother suggested other types of nourishment. This study also found that that less frequent contact with a grandmother was protective of breastfeeding duration [43] . Together, these studies suggest that coresident grandparents could be detrimental to mother's breastfeeding behaviors.\nLastly, mothers who live with their own parents or inlaws may be selectively different from mothers who do not coreside. Research has found that mothers who coreside are generally more economically disadvantaged, younger, and less educated [6] , and these factors are associated with lower levels of breastfeeding [29] . As such, socioeconomic and demographic characteristics may mediate the relationship between grandparent coresidence and breastfeeding behaviors.\nThis study contributes to the literature on breastfeeding by investigating whether living in a three-generation family household at the birth of a child is associated with the likelihood of breastfeeding initiation and duration. To study this question two data sets are used-the Early Childhood Longitudinal Study (ECLS-B) and the Fragile Families and Child Wellbeing Study (FFCWB). The ECLS-B provides the opportunity to investigate whether three-generation coresidence is associated with breastfeeding initiation and duration in a nationally representative birth cohort sample. In comparison, the FFCWB study is an urban birth cohort study that is racially diverse and relatively economically disadvantaged. The FFCWB sample is of particular interest to public health policy makers as breastfeeding rates are generally lower, and because three-generation coresidence is particularly high in this population. By using these two data sets, the associations between three-generation coresidence and breastfeeding behaviors across two populations can be compared, resulting in a more comprehensive picture of the association between coresidence with a grandparent and breastfeeding behaviors."}, {"section_title": "Methods", "text": ""}, {"section_title": "Data", "text": "Data come from the ECLS-B and the FFCWB studies. The ECLS-B is a nationally representative longitudinal study of over 10,000 children who were born in the US in 2001. Children were sampled from birth certificates using data from the National Center for Health Statistics [44] . Mothers who were 15 or older, and who had not given their child up for adoption, were interviewed when their infant was approximately 9 months old. In accordance with National Center for Education Statistics (NCES) reporting rules, all sample sizes reported in this paper are rounded to the nearest 50. Mothers were excluded from the analytic sample if they gave birth to multiple children (n * 1,750). The final analytic sample was approximately 8,250 cases where no information on household structure, breastfeeding or the covariates was missing.\nThe FFCWB study is a longitudinal birth cohort study of 4,898 children who were sampled between 1998 and 2000 in 75 randomly selected hospitals in 20 large US cities (with populations greater than 200,000). Nonmarital births were oversampled about 3 to 1 resulting in a relatively economically disadvantaged sample. Mothers were interviewed in the hospital shortly after the birth of their child and again when the child was approximately age one with a response rate of 90 %. Mothers were excluded from the sample if they did not participate in the 1-year follow-up interview (n = 534) or if they gave birth to multiple children (n = 98). The final sample consisted of 4,053 cases where information on breastfeeding, three-generation coresidence and the covariates was not missing. The analyses conducted in this study used de-identified secondary data and were approved by Columbia University's Institutional Review Board."}, {"section_title": "Measures", "text": "Although the timing of the surveys varied slightly between the two data sets, this paper aims to compare the association between three-generation coresidence and breastfeeding behaviors across the two study populations. Thus, the same measures of breastfeeding, coresidence, and covariates were included in both analyses and where possible, were coded identically.\nTwo measures of breastfeeding behavior were assessed-a bivariate indicator of whether the mother ever breastfed, and if she did breastfeed, whether she breastfed for 6 months or more (the minimum age recommended by the American Academy of Pediatrics for exclusive breastfeeding) [17, 45] . In the ECLS-B, breastfeeding questions were assessed in the 9-month survey. In the FFCWB, breastfeeding questions were ascertained in the 1-year follow-up survey and asked about breastfeeding since birth. Three-generation household status was coded as one if a grandparent (a grandfather, a grandmother, or both) was living in the same household as the mother and infant. In the ECLS-B, three-generation status was ascertained at the 9 months interview, whereas in the FFCWB, three-generation coresidence was evaluated at the birth of the child.\nThe models for both data sets included a number of control variables that are associated with breastfeeding and three-generation coresidence. These variables include: mother's race/ethnicity (non-Hispanic black, non-Hispanic white, Hispanic, other race/ethnicity and in the ECLS-B Asian and Native American), education (less than high school, high school, some college, college or more), relationship status (married, cohabiting, single), age at the birth, and whether the mother was foreign born (is an immigrant). A number of maternal health indicators were included to indicate whether the mother was in poor or fair health (from a five point Likert overall health rating scale), received prenatal care during the first trimester, or smoked during pregnancy. Economic covariates assessed whether the mother was employed in the year prior to the birth, a poverty indictor (1 = household income was below the Federal poverty threshold adjusted for household size), an indicator of having received assistance from Women, Infants and Children (WIC), and a measure of large household size (1 = 5 or more members). Several child characteristics were also included: whether the child was the mother's first birth, the child's age (in months) at the interview as the timing of the interviews varied slightly, and whether the baby was low birth weight (\\2,500 g). In addition, the FFCWB study included controls for 20 cities of residence (results not shown) as the likelihood of breastfeeding and living in a three-generation household may vary by city. In the ECLS-B, city was not available but analyses included a control for urban residence and region of the country (Northwest, South, West, Northeast).\nIn analyses (not shown), additional variables that might be endogenous (influenced by coresidence and breastfeeding), had large amounts of missing data, or were not available in both data sets, were added to the regression models as sensitivity analyses. These variables included measures of grandmother's education (less than high school, high school, some college, college or more), grandparent's depression (an indicator of whether the grandmother or grandfather had a depressive episode when the mother was growing up), a measure of maternal employment after the birth, and a measure of premature birth (born prior to 37 weeks gestation). Analyses that compared the number and gender of grandparents in the household were also run (just a grandmother, just a grandfather, or both a grandmother and grandfather)."}, {"section_title": "Statistical Analysis", "text": "All analyses were conducted in the statistical package Stata 12.0 SE (StataCorp LP, College Station, TX, USA). The NCES recommends all analyses with the ECLS-B be weighted to adjust for the complex survey design that included a multi-stage clustered sampling with differential sampling rates. Analyses using the ECLS-B utilized the SVY command to produce robust standard errors (using Taylor Series linearization methods) and so that the estimates would be nationally representative. Following standard practices with the FFCWB study, and to retain the oversample of nonmarital births, the analyses were not weighted. Statistically significant differences between households that were three-generation and those that were not were calculated using Chi square tests. Multivariate logistic regression analyses with extensive socio-demographic controls were run to assess the association between coresidence and breastfeeding behaviors and odds ratios are reported. Odds ratios indicate whether three-generation coresidence was associated with a greater or lesser likelihood of breastfeeding as compared to not living in a threegeneration household. Sensitivity analyses were also conducted testing the inclusion of additional covariates. Another sensitivity test studied differences in the association by the gender and number of coresident grandparents and Wald tests were run to test for significant differences between the coefficients."}, {"section_title": "Results", "text": "Sample descriptions for both data sets are presented in Table 1 . In the ECLS-B, nearly 70 % of mothers breastfed their child and about 45 % were still breastfeeding at 6 months. These rates are very similar to national breastfeeding estimates for 2001 when the study was conducted [46] . In comparison, in the FFCWB study where mothers were more economically disadvantaged, 57 % of the sample ever breastfed, and among those mothers who initiated breastfeeding, only 36 % were still breastfeeding at 6 months. Although three-generation coresidence was more common in the economically disadvantaged sample (27 % of the FFCWB sample was coresident at the birth), a relatively large share of infants lived in a three-generation family household at 9 months in the ECLS-B (15 %). In terms of other characteristics, in the ECLS-B, 58 % of mothers were white, 14 % black, and 23 % Hispanic. In comparison, only 22 % of the FFCWB sample was white, 47 % were black, and 27 % Hispanic. Differences between the two samples in terms of education were large. ECLS-B mothers were more educated, about 1/4 had a college degree and about 20 % had less than a high school degree, whereas among FFCWB mothers only 11 % had a college degree or more and 34 % had less than a high school degree. Rates of marriage were much higher in the ECLS-B (67 %), than in the FFCWB (25 %), and cohabitation was more common among FFCWB mothers (36 vs. 15 % in the ECLS-B). Mothers in both samples were in relatively good health, and the majority sought prenatal care during the first trimester of pregnancy (84 and 81 % in the ECLS-B and FFCWB studies respectively). In the ECLS-B, 24 % of mothers reported household incomes below the poverty line and 52 % received WIC. In comparison, the FFCWB sample was more economically disadvantaged -33 % of mothers had a household income at or below the poverty line and 73 % received WIC. Table 2 presents descriptive differences in breastfeeding initiation and breastfeeding duration of at least 6 months by three-generation household status. In both the ECLS-B and the FFCWB studies, breastfeeding initiation rates were a statistically significant 10-12 % points lower among mothers in three-generation households than those mothers who did not live in a three-generation household. In the ECLS-B, 59 % of mothers in a three-generation household initiated breastfeeding compared to 72 % of mothers who did not live in a three-generation household (p \\ 0.000; v 2 : 79.2). In the FFCWB study, 50 % of coresident mothers breastfed, whereas 60 % of mothers who did not live in a three-generation family household initiated breastfeeding (p \\ 0.000; v 2 : 37.6). Similarly, differences in the percent of mothers who breastfed for 6 months or more were large. Among mothers in three-generation family households, 28 % in the ECLS-B and 24 % in the FFCWB study breastfed for 6 months or greater. In comparison, mothers who did not coreside with a grandparent were significantly more likely to breastfeed 6 months or longer, 47 % in the ECLS-B (p \\ 0.000; v 2 : 85.4) and 40 % in the FFCWB (p \\ 0.000; v 2 : 44.6). To assess whether the bivariate differences remained in the multivariate context, Table 3 presents the odds ratios (OR) and 95 % confidence intervals (CIs) from logistic regressions for both outcomes in the two samples. In the nationally representative sample (ECLS-B), the association between threegeneration coresidence and the odds of having ever breastfed (OR 0.94, CI 0.75-1.16) was not significant. In comparison, among the more economically disadvantaged sample (FFCWB), coresidence with a grandparent was associated with 19 % lower odds of breastfeeding (OR 0.81, CI 0.68-0.98, p \\ 0.05). In terms of the duration of breastfeeding, the analyses show that in both the ECLS-B and the FFCWB study, three-generation coresidence was associated with significantly lower odds of breastfeeding for 6 months or longer. In the ECLS-B, three-generation coresidence was associated with 38 % lower odds of breastfeeding for at least 6 months (OR 0.62, CI 0.46-0.84, p \\ 0.01), and in the FFCWB study coresidence was associated with 34 % lower odds (OR 0.66, CI 0.51-0.86, p \\ 0.01).\nA series of sensitivity analyses (results not shown) were run controlling for employment after the birth, grandmother's education, grandparent's depression, and a measure of premature birth for the ECLS-B, and none of the findings were altered. An additional analysis was conducted investigating differences in the associations by whether mothers lived with a grandmother, a grandfather or both-as the number and gender of the grandparent might influence outcomes differently. The association for grandfathers only was weaker than that of both grandparents or just the grandmother, but post hoc Wald tests found that the coefficients were not statistically different from each other. This suggests that neither the gender of the grandparent, nor the number of coresident grandparents, influenced the findings."}, {"section_title": "Discussion", "text": "Although prior research has noted differences in breastfeeding behaviors by relationship status and has emphasized the importance of social support [15, 18, 29, 47] , this study was the first to investigate whether three-generation coresidence was associated with breastfeeding behavior. Three-generation coresidence has been increasing in ECLS-B statistics are weighted and N's are unweighted and rounded to the nearest 50 as per NCES requirements. Chi square test was used to assess the proportional differences. Sample restricted to singleton births a Sample restricted to mothers who breastfed: n = 5,500 in the ELCS-B and n = 2,295 in FFCWB prevalence and is particularly common after the birth of a child [48, 49] . Understanding whether breastfeeding behaviors differ by three-generation coresidence status is important as public health policy makers consider ways to encourage breastfeeding. Using two different data sets, one nationally representative, and one of an economically disadvantaged, racially diverse population, this study investigated the association between three-generation coresidence and breastfeeding initiation and duration of at least 6 months. The findings from this study suggest that three-generation coresidence is associated with lower odds of breastfeeding (in particular among lower-income households) and lower odds of breastfeeding until the child is 6 months old. Although the association between coresidence and breastfeeding was not significant in the nationally representative sample, the direction of the coefficient suggested a similar pattern, that coresidence with a grandparent is associated with fewer breastfeeding behaviors. The association between coresidence and breastfeeding was stronger in the urban, low-income sample than in the nationally representative sample, but the rate of three-generation coresidence was also far greater in that sample. Placing these findings in context is challenging, as no research has studied the association between grandparent coresidence and breastfeeding behaviors. Relative to other well-known modifiable predictors of breastfeeding-such as smoking or WIC participation (both of which are associated with lower odds of breastfeeding)-grandparent coresidence was comparable in magnitude in these data. For example, the association between smoking and breastfeeding initiation was stronger than three-generation coresidence, but the associations were comparable for breastfeeding 6 months or more. Smoking was associated with 48 % (p \\ 0.01; CI 0.55-0.90) and 38 % (p \\ 0.001; CI 0.56-0.81) lower odds of breastfeeding for 6 months or more in the ECLS-B and FFCWB studies respectively, whereas coresidence was associated with 36 and 34 % lower odds. Although the association with coresidence was slightly smaller than that of smoking, rates of coresidence are higher than rates of smoking in both samples.\nGrandparents may discourage breastfeeding for a number of reasons. If they themselves did not breastfeed, if they see their daughter (or grandchild) having difficulties, or if they feel breastfeeding is not important, they may not be supportive of breastfeeding [31] . Public opinions and health practices around breastfeeding have changed a great deal in the last 40 years and grandparents may be less familiar with breastfeeding benefits than other members of the mother's social networks such as peers or partners. Although nonresident grandparents may also influence breastfeeding behaviors, grandparents' influence may be particularly salient for mothers who are living in the same household as a grandparent. Future research that investigates the mechanisms through which three-generation coresidence may be influencing breastfeeding behaviors would be a useful next step. The findings here are suggestive of an association between coresidence and breastfeeding but research on the types of public health strategies that might target new mothers and grandmothers, and on the effectiveness of those approaches, is an important area for future research."}, {"section_title": "Limitations", "text": "This study has some limitations. First, although this study finds suggestive evidence of an association between threegeneration coresidence and breastfeeding behaviors, as is the case with any study using observational data, unaccounted factors (in particular socioeconomic characteristics) that are associated with both three-generation coresidence and breastfeeding may bias the associations documented here. Although the findings were robust to the inclusion of many control variables and a number of additional extensions, important omitted variables (such as wealth) that could not be included in the models may affect the results. Second, although the ECLS-B provides nationally representative data on breastfeeding, the timing of the first data collection (at 9 months) means identifying mother's three-generation status at the birth of the child is not possible. In comparison, the FFCWB study allows for an investigation of coresidence at the time of the birth and breastfeeding behaviors measured at age 1, but only among urban mothers. Nonetheless, the similarity of the findings across studies strengthens the documented results.\nThird, both studies contain very little information on the grandparents. Although sensitivity analyses found that the findings were robust to the inclusion of education and depression measures of the grandparents, other important characteristics may have been omitted, such as health or economic wellbeing of the grandparents, which influence both the likelihood of coresidence and of breastfeeding. Research on infant mortality has also found differences in the association by whether involvement is from the maternal or paternal grandparent [50] . These data cannot distinguish maternal from paternal grandparents, but the associations could vary by paternal/maternal grandparents. Future research that collects more information about grandparents, such as whether grandmothers breastfed themselves, data on grandparent's health, and paternal/ maternal distinctions, would be very useful. Lastly, the data do not allow for a distinction between grandparents who live in the mother's home (the sandwich generation) and those grandparents who host their own children in their home, which may influence breastfeeding behaviors. Investigating whether the association is different for mothers who host grandparents versus those mothers who move in with grandparents is an area for future research."}, {"section_title": "Conclusion", "text": "The findings suggest that living in a three-generation family household is generally associated with both lower odds of breastfeeding and with lower odds of breastfeeding 6 months or more. If three-generation coresidence at the birth of a child is a marker of potential differences in breastfeeding behaviors, public health officials and policy makers may want to consider education efforts targeted at these households as a means of encouraging breastfeeding.\nEvidence from support group interventions for mothers and fathers suggest that education and support can increase breastfeeding rates [51] and one study found that providing leaflets to extended family members on the benefits of breastfeeding increased breastfeeding behaviors [52] . More research is needed to test the effectiveness of interventions with grandparents and breastfeeding outcomes, but public health efforts that target not only the mother and her partner, but also grandparents, might be a way to increase breastfeeding rates."}]