[{"section_title": "Abstract", "text": "To determine if APOE e4 influences the association between white matter hyperintensities (WMH) and cognitive impairment in Alzheimer disease (AD) and dementia with Lewy bodies (DLB).\nA total of 289 patients (AD = 239; DLB = 50) underwent volumetric MRI, neuropsychological testing, and APOE e4 genotyping. Total WMH volumes were quantified. Neuropsychological test scores were included in a confirmatory factor analysis to identify cognitive domains encompassing attention/executive functions, learning/memory, and language, and factor scores for each domain were calculated per participant. After testing interactions between WMH and APOE e4 in the full sample, we tested associations of WMH with factor scores using linear regression models in APOE e4 carriers (n = 167) and noncarriers (n = 122). We hypothesized that greater WMH volume would relate to worse cognition more strongly in APOE e4 carriers. Findings were replicated in 198 patients with AD from the Alzheimer's Disease Neuroimaging Initiative (ADNI-I), and estimates from both samples were metaanalyzed.\nWhite matter hyperintensities (WMH) observed on structural MRI indicate cerebral small vessel disease (SVD) in most cases, 1 are risk factors for cognitive impairment and Alzheimer disease (AD), 2,3 and are prevalent in dementia with Lewy bodies (DLB). 4,5 However, observed cognitive performance clinically does not always reflect the severity of the WMH burden. 6, 7 There are several reasons for the complex association between WMH and cognition: the etiology of WMH is heterogeneous, including vascular compromise and ischemia, venous collagenosis, leading to vasogenic edema, 8,9 cerebral amyloid angiopathy (CAA), or a combination of these, 10 and genetic vulnerability to neurodegeneration.\nThe APOE e4 allele is the strongest known genetic risk factor for sporadic AD, and is a risk factor for DLB, 11,12 CAA, 13 and SVD. 14 Despite these associations, it remains unknown if APOE e4 modulates the relationship between WMH and cognition across the dementias, i.e., if APOE e4 is an effect modifier in this association. Therefore, we examined the role of APOE e4 on the association between WMH and cognitive domains in patients with AD and patients with DLB with varying degrees of SVD. We tested associations with domain-specific cognitive impairment instead of global cognition because at different disease stages, impairment might be more apparent in certain domains and not others. We hypothesized that (1) higher WMH burden would be more strongly associated with worse cognition in APOE e4 carriers than noncarriers and the association would be APOE e4 allele dosage dependent, (2) this association would be irrespective of the clinical diagnosis, and (3) if Glossary Aβ = β-amyloid; AD = Alzheimer disease; ADNI-I = Alzheimer's Disease Neuroimaging Initiative Phase I; ANOVA = analysis of variance; BDS = backward digit span; BNT = Boston Naming Test; CAA = cerebral amyloid angiopathy; CFA = Confirmatory Factor Analysis; CFI = comparative fit index; CI = confidence interval; CVLT = California Verbal Learning Test; DLB = dementia with Lewy bodies; DSST = Digit Symbol Substitution Task; FDS = forward digit span; MMSE = Mini-Mental State Examination; PD = proton density; PF-FAS = Controlled Oral Word Association task-Phonemic Fluency; RAVLT = Rey Auditory Verbal Learning Test; RMSEA = root mean square error of approximation; SDS = Sunnybrook Dementia Study; SF = Semantic Fluency; SRMR = standardized root mean square; SVD = small vessel disease; TIV = total intracranial volume; WCST = Wisconsin Card Sorting Test; WMH = white matter hyperintensities; WMS = Wechsler Memory Scale."}, {"section_title": "Results", "text": "A significant interaction was observed between WMH and APOE e4 for language, but not for memory or executive functions. Separate analyses in APOE e4 carriers and noncarriers showed that greater WMH volume was associated with worse attention/executive functions, learning/ memory, and language in APOE e4 carriers only. In ADNI-I, greater WMH burden was associated with worse attention/executive functions and language in APOE e4 carriers only. No significant associations were observed in noncarriers. Meta-analyses showed that greater WMH volume was associated with worse performance on all cognitive domains in APOE e4 carriers only.\nConclusion APOE e4 may influence the association between WMH and cognitive performance in AD and DLB.\nindeed WMH burden is associated with worse cognition in APOE e4 carriers, WMH in carriers might be a result of a more toxic vascular pathology, i.e., CAA.\n"}, {"section_title": "Methods", "text": "This is a cross-sectional study examining the effect of APOE e4 on the association of WMH volume and cognitive functions in patients with AD and patients with DLB."}, {"section_title": "Setting", "text": "This work was embedded within the Sunnybrook Dementia Study (SDS), a prospective observational study of patients with dementia. 15 The majority of participants in the SDS are Caucasian of European descent.\nFor replication of study findings, data from the Alzheimer's Disease Neuroimaging Initiative Phase I (ADNI-I) (2004) were utilized. 16 ADNI was launched in 2003 as a publicprivate partnership. For the most up to date information, see adni-info.org.\nADNI-I is characterized by a low WMH burden (<10 cm 3 ) at recruitment and cognitive impairment is largely attributed to AD pathology with minimal confounding comorbid SVD. The SDS represents a heterogeneous real-world clinical case series followed longitudinally, and reflects a similar vascular risk factor and SVD burden profile to community and population-based studies. 17 Standard protocol approvals, registrations, and patient consents SDS (ClinicalTrials.gov: NCT01800214) is approved by the local Research Ethics Board at Sunnybrook Health Sciences Centre and written informed consent was obtained from participants or their surrogate caregivers according to the Declaration of Helsinki."}, {"section_title": "Study samples SDS sample", "text": "Data from 289 MRI-confirmed stroke-free patients with dementia, including APOE e4 genotype, MRI volumetrics, and neuropsychological battery, were available. This included 239 patients with AD and 50 patients with DLB with varying degrees of SVD. Of the 289 patients included, 36 had autopsy data available."}, {"section_title": "ADNI-I (replication sample)", "text": "A total of 198 patients with AD with APOE e4 genotype, MRI volumetric, and neuropsychological data available were included. We used data from the 24 month follow-up visit instead of baseline for better comparability to the SDS sample given the mild initial nature of participants included in ADNI, i.e., progression of the AD stage and that of WMH burden, and ensuring a sufficient number of participants to obtain valid estimates.\nMethods for MRI data acquisition, processing, and WMH quantification are described in detail elsewhere. 23 Neuropsychological test battery\nThe cognitive test battery in ADNI-1 included (1) MMSE;\n(2) Rey Auditory Verbal Learning Test (RAVLT), total acquisition score through 5 trials and delayed recall; (3) logical memory immediate and delayed recall; (4) FDS; (5) BDS; (6) BNT; (7) category fluency (animals and vegetables); (8) Trail-Making Test A; and (9) DSST. Details are described elsewhere. 25 For all test scores, higher scores correspond to better cognition, except for WCST (number of nonperseverative errors; SDS only), and Trail-Making Test A (time taken to complete the task in seconds), for which a higher score corresponds to worse performance.\nAvailable covariates in ADNI-I included age, sex, education, and systolic and diastolic blood pressure.\nFor consistency across both study samples, we included systolic and diastolic blood pressure as covariates and not hypertension.\nRelationships between the following cognitive factors and observed test scores were hypothesized and tested: (1) attention/ executive (FDS, BDS, Trail-Making Test A [inverse-coded], DSST), (2) learning/memory (RAVLT trials 1-5 [immediate recall], RAVLT delayed recall, logical memory immediate and delayed recall), and (3) language (BNT, category fluencyanimals, category fluency-vegetables).\nAs in the SDS, a full model with an interaction term (WMH × APOE e4) was tested (full ADNI-1 sample; n = 198), and then analyses were repeated in APOE e4 carriers and noncarriers separately. For regression, model I was adjusted for age and sex only; II was additionally adjusted for education and systolic and diastolic blood pressure. Analyses were also repeated in APOE e4 heterozygotes (n = 91) and homozygotes (n = 40).\nSince power was limited in both our study samples, we metaanalyzed the β-coefficients from SDS and ADNI-I for all 3 cognitive scores to obtain more robust estimates. 30 This was done using the metan command in Stata, 31 which uses inverse variance weighting method.\nLevel of significance was set at 0.05 (two-sided) for all statistical tests, and all analyses were performed using Stata Software Version 14.1 (StataCorp, College Station, TX).\nCharacteristics of the study sample are summarized in table 5. We did not find any differences in characteristics and WMH volumes between APOE e4 carriers and noncarriers except that carriers were significantly younger than noncarriers (p value 0.02).\nComparison of study characteristics by allele dosage showed that APOE e4 homozygotes were younger than heterozygotes and noncarriers (ANOVA p value ≤ 0.001; table 5). WMH volumes did not differ by allele dosage. Table 6 summarizes the neuropsychological test scores by APOE e4 carrier status for ADNI-I.\nIn the CFA, single confirmatory factor models for all 3 cognitive factors tested showed an excellent fit to the data: attention/executive (CFI 0.999, RMSEA ≤0.0001, SRMR 0.004), learning/memory (CFI 0.996, RMSEA 0.06, SRMR 0.019), and language (CFI 1.00, RMSEA ≤0.0001, SRMR <0.0001). In the full model (n = 198), WMH volume was associated with attention/executive functions (p value <0.001), but not with memory or language. No interaction was observed between WMH and APOE e4 for executive functions (p value 0.069), memory (0.97), or language (0.34).\nIn APOE e4 carriers only, greater WMH volume was associated with worse performance on the attention/executive functions and language, but not with memory ( "}, {"section_title": "Diagnosis of dementia", "text": "For both study samples, AD was diagnosed on recruitment, using the Neurologic and Communicative Disorders and Stroke and Alzheimer's Disease and Related Disorders Association criteria, 18 while DLB (SDS only) was diagnosed using the Third Report of DLB Consortium criteria. 19 Diagnoses were confirmed on clinical follow-up.\nDiagnostic consensus in the SDS was achieved through review by at least 2 physicians (M.M. and S.E.B.) with expertise in dementia diagnosis.\nAPOE «4 genotyping APOE genotyping was performed using DNA extracted from leukocytes in both SDS 20 and ADNI. 21 Genotype frequencies in both samples did not deviate from that predicted by Hardy-Weinberg equilibrium."}, {"section_title": "MRI (WMH volume)", "text": "SDS sample MRI scans were acquired on a 1.5T Signa system (GE Healthcare, Milwaukee, WI). Three sets of structural MRI sequences were used: T1-weighted, T2-weighted, and proton density-weighted (PD). Details of MRI acquisition are provided elsewhere. 15 MRIs were processed using the Semi-Automated Brain Region Extraction and Lesion Explorer processing pipeline. 22 WMHs were identified as lesions that appear as punctate or diffuse regions of hyperintense signal on T2/PD MRI. These images were used to quantify global, deep, and periventricular WMH volumes (cm 3 ). For analyses, total WMH volumes adjusted for total intracranial volume (TIV) were used: TIV adjusted WMH volumes = (raw WMH volume/TIV) × 10 3 ."}, {"section_title": "SDS sample", "text": "The neuropsychological battery was performed within 90 days of MRI acquisition. Trained psychometrists blinded to neuroimaging, dementia diagnosis, and genotype information administered all tests. 24 The following tests for global cognition and domain-specific functioning were administered: (1) Mini-Mental State Examination (MMSE); (2) Dementia Rating Scale; (3) California Verbal Learning Test (CVLT), total acquisition score through 5 trials, CVLT long delay-free recall, and CVLT long delay-cued recall; (4) Wechsler Memory Scale (WMS) visual recognition immediate and delayed recall; (5) forward digit span (FDS); (6) backward digit span (BDS); (7) Boston Naming Test (BNT); (8) Semantic Fluency (SF); (9) Wisconsin Card Sorting Test (WCST); (10) Controlled Oral Word Association task-Phonemic Fluency (PF-FAS); (11) Trail-Making Test A; and (12) Digit Symbol Substitution Task (DSST). The number of patients who completed each test differed; this variability was dependent on dementia severity. Ninety percent of patients had completed at least 8 neuropsychological tests.\nAge, sex, years of education, diabetes mellitus type 2 (present vs absent), systolic and diastolic blood pressure (mm Hg), hypertension (present vs absent), smoking status (never, past, or current smoking), and dementia diagnosis (AD or DLB) were considered potential confounders.\nRelationships between the following cognitive factors and observed test scores were hypothesized and tested using CFA: (1) attention/executive functions (FDS, BDS, Trails A, WCST-perseverative errors, PF-FAS, DSST), (2) learning/ memory (CVLT-total acquisition score, trials 1-5, CVLTlong delay free and cued recall, WMS-immediate recall, delayed recall), and (3) language (BNT, SF, PF-FAS). Scores for WCST and Trails A were inverse-coded for consistency with other test scores.\nWe used the following multiple linear regression model in the SDS sample (n = 289) to test associations of WMH with executive functions, memory, and language, and an interaction between WMH and APOE e4 carrier status:\nCognitive factor score = β0 + β1 * WMH volume + β2 * APOE e4 carrier status + β3 * (WMH volume × APOE e4 carrier status) + β4 * age + β 5 * sex + β6 * education + β7 * diabetes mellitus + β8 * systolic blood pressure + β9 * diastolic blood pressure + β10 * smoking + β11 * clinical dementia diagnosis.\nFurther, we tested associations of WMH with the cognitive domains in APOE e4 carriers and noncarriers separately using a similar model, but without APOE e4 and its interaction term.\nFor each regression, 2 models were fitted. Model I was adjusted for age and sex; II was additionally adjusted for years of education, diabetes mellitus type 2, systolic and diastolic blood pressure, smoking status, and dementia diagnosis. We also repeated model II by replacing systolic and diastolic blood pressure by hypertension.\nThe following variables had missing values and were dealt with by multiple imputation using chained equations in Stata: systolic and diastolic blood pressure and smoking (2.8%, n = 8), diabetes (3.1%, n = 9), and years of education (0.3%, n = 1). All available covariates were used as predictors for imputation.\nSince studies suggest that WMH are not associated with cognition in DLB, but in AD only, 4, 5 we repeated the analyses in APOE ɛ4 carriers and noncarriers excluding DLB cases.\nIn a post hoc analysis, we tested if associations between WMH and cognitive domains in APOE ɛ4 carriers were dependent on APOE e4 allele dosage. After comparing study characteristics and WMH volumes by APOE ɛ4 allele dosage (0, 1, or 2 alleles) using analysis of variance (ANOVA) (Tukey post hoc) and χ 2 tests for continuous and categorical variables, respectively, we repeated our analyses in APOE ɛ4 heterozygotes (n = 130) and APOE ɛ4 homozygotes (n = 37).\nWe explored the prevalence of CAA by APOE ɛ4 carrier status in our autopsy subsample (n = 34). This analysis was conditional on our primary results, i.e., to be performed if indeed WMH were associated with worse cognition more strongly in APOE «4 carriers than noncarriers. In this case, we hypothesized that since APOE e4 is a risk factor for CAA, the likely etiology of WMH in carriers is CAA, which might be more toxic than WMH caused by vascular compromise or ischemia due to cardiovascular risk factors alone. We compared the numbers of patients with CAA by APOE e4 carrier status and by allele dosage using the Fisher exact test. Since studies suggest that CAA is more prevalent in APOE e2 carriers, 29 we also examined the number of persons with CAA across genotypes: e2-e3 (n = 2), e3-e3 (n = 12), e3-e4 (n = 13), and e4-e4 (n = 7); however, statistical comparisons could not be made due to small numbers within some cells.\nCharacteristics of the study sample are presented in table 1. Participant characteristics or WMH volumes did not differ between APOE e4 carriers and noncarriers. Table 2 summarizes the neuropsychological test scores by APOE e4 carrier status.\nIn the CFA, single confirmatory factor models for all 3 cognitive factors tested showed excellent fit to the data: attention/executive (CFI 0.98, RMSEA 0.04, SRMR 0.03), learning/memory (CFI 0.99, RMSEA 0.04, SRMR 0.009), and language (CFI 1.00, RMSEA <0.0001, SRMR <0.0001).\nIn the full model (n = 289), WMH volume was not associated with attention/executive functions, learning/memory, or language. An interaction between WMH and APOE e4 (p value 0.02) was observed for language, but not for executive functions (p value 0.26) or memory (p value 0.11). With our a priori hypothesis that WMH relate to cognition differently in carriers and noncarriers, and a significant interaction observed between WMH and APOE e4 for language, we performed analyses separately in APOE e4 carriers and noncarriers for all cognitive domains.\nIn these analyses, greater WMH volumes were associated with worse attention/executive functions, learning/memory, and language in only APOE e4 carriers; no associations were observed in noncarriers (table 3) . Replacing blood pressure with hypertension did not change results.\nAfter excluding patients with DLB (n = 50), a similar pattern of results was obtained (table 4) .\nHomozygous APOE e4 carriers were younger than noncarriers and heterozygous carriers (ANOVA p value < 0.001). Homozygous APOE e4 carriers also had lower WMH volume than noncarriers and heterozygous carriers (ANOVA p value = 0.002). Heterozygous carriers had a greater burden of cardiovascular risk factors ( "}, {"section_title": "Covariates", "text": ""}, {"section_title": "Neuropathology methods in SDS (exploratory sample)", "text": "Thirty-six of the SDS cases had a postmortem neuropathologic examination to diagnose and stage neurodegenerative disease phenomena. 15 This workup included a screen for CAA using immunohistochemistry for β-amyloid (Aβ) (Dako, Glostrup, Denmark; Mach 4 detection system) in at least 2 brain sections (cerebellum and frontal cortex). For 34 of these 36 cases, the original autopsy reports were reviewed by a neuropathologist (J.K.) to determine the presence or absence of CAA. For 2 of the 36 cases, the reports were not available. For 3 of the 34 cases with available reports, the presence or absence of amyloid angiopathy was not stated in the autopsy report; the slides from the original autopsy were retrieved, reviewed by J.K., and the presence or absence of CAA was determined. Given that only 2 anatomical areas of the brain had been screened for CAA, applying a formal CAA grading scheme was not feasible. Using these data (n = 34), we aimed to explore if there was a higher prevalence of CAA in APOE e4 carriers.\nStatistical analyses TIV-adjusted WMH volumes were log-transformed to achieve a normal distribution and standardized by calculating z scores.\nWe compared participant characteristics between APOE e4 carriers and noncarriers using t tests for continuous and χ 2 tests for categorical variables."}, {"section_title": "Confirmatory factor analysis and regression", "text": "In both samples, we aimed to reduce the number of tests by making comprehensive factor scores (latent constructs) for each cognitive domain, based on the specific tests and the domain that they are known to assess. Therefore, we conducted a Confirmatory Factor Analysis (CFA) 26 and calculated scores for each cognitive factor, i.e., attention/executive functions, learning/memory, and language for each participant. These cognitive factor scores were then used as outcomes in our analyses instead of individual test scores. CFA uses all available information for any model specified instead of a complete case analysis, and obtained factors are allowed to correlate. We present standardized measures in this article to facilitate interpretation. Adequacy of model fit to the data was assessed by comparative fit index (CFI) (range 0-1; recommended ≥0.95), root mean square error of approximation (RMSEA) (range 0-1; recommended ≤0.06), and the standardized root mean square residual (SRMR) (range 0-1; recommended ≤0.08). 27 Subsequently, in both study samples, we first tested associations between WMH volume and each of the 3 cognitive factor scores with all covariates including APOE e4 carrier status as a predictor, and also tested the interaction between WMH and APOE e4 carrier status.\nSecond, we investigated the associations between WMH volume and each cognitive factor score in APOE e4 carriers and noncarriers separately, based on our a priori hypothesis, i.e., higher WMH burden would be more strongly associated with worse cognition in APOE e4 carriers than noncarriers, because of the known strong biological effects of the APOE e4 allele. 28 "}, {"section_title": "Data availability", "text": "The authors have carefully documented all data, methods, and materials used to conduct the research in this article and agree to share anonymized data by request from any qualified investigator."}, {"section_title": "Exploratory neuropathology sample: SDS", "text": "In the autopsy subsample, 21 patients were neuropathologically diagnosed with AD and 15 with DLB. All AD cases were pathologically confirmed to have AD, including one case with coexisting Lewy bodies. All DLB cases were confirmed to have DLB, with varying degrees of neurofibrillary tangle pathology. 15 A total of 66.6% (n = 8/12) of the APOE e4 noncarriers had CAA compared to 76% (n = 16/21) of APOE e4 carriers. Sixty-four percent (n = 9/14) of heterozygous APOE e4 carriers had CAA, whereas 100% (n = 7/7) of the homozygous APOE e4 carriers had CAA. However, differences across these groups were not significant (Fisher exact test p value = 0.123). Fifty percent (n = 6/12) of patients with e3-e3 genotype had CAA, 50% (n = 1/2) of the e3-e2 patients, 39% (n = 8/13) of e3-e4 patients, and 100% (n = 7/7) of the e4-e4 patients had CAA. There were no patients with e2-e2 genotype."}, {"section_title": "Discussion", "text": "Our findings imply that in carriers of the APOE e4 allele, WMH burden, a marker of cerebral SVD, is inversely associated with cognitive performance, whereas no such effect was seen in noncarriers. Moreover, this was consistent across the AD/DLB spectrum, in contrast to previous studies. 4, 5 After excluding patients with DLB from the SDS sample, the associations of WMH volume with executive functions, memory, and language remained significant. Cerebral SVD can be considered a relevant copathology across the AD/DLB spectrum. Because of the high frequency of coexisting neurodegenerative pathologies, 32, 33 shared risk factors and pathologies cannot be disentangled if samples are segregated on clinical diagnoses alone. 15 Although a unified model with an interaction term is the optimum method to test effect modification, an important limitation is that more statistical power is required than for association testing, and thus false-negative results may be seen in smaller samples. The documented strong biological effects of APOE e4 28 formed the basis of our a priori hypothesis; that is, greater WMH burden relates more strongly with worse cognition in APOE e4 carriers, which is why we also tested associations separately in carriers and noncarriers irrespective of the interaction results. Given the strong biological rationale, limited sample size, and a significant interaction observed for the language domain, this was a valid approach, which has also been used by other groups. 34, 35 However, studies in larger sample sizes are warranted.\nThe replication of worse executive functions and language in relation to higher WMH in ADNI-I APOE e4 carriers is remarkable, and also validates our findings. Notably, ADNI-I comprises cases with relatively lower WMH burden compared to SDS, 17 and this finding indicates that APOE e4 may contribute to worse cognitive performance in those with even lower burden of cerebral SVD. Effect estimates for memory did not reach significance in the ADNI-I sample, which might be explained by lack of power. However, the significant association of greater WMH volume with cognitive impairment across all 3 domains observed in the meta-analysis supports our primary findings.\nWhile our data supported our hypothesis, it failed to show an allele dosage effect. This could be a result of the small size of the homozygous group; however, the similar pattern of results in both SDS and ADNI-I suggests that this is not just a power issue. There are several possible considerations. The first consideration is age and cardiovascular risk factor distribution. Although in both study samples, age did not differ between APOE e4 carriers and noncarriers, among carriers, homozygotes were younger. In the SDS sample, the homozygous group was not only younger, but it also had less WMH and cardiovascular risk factor burden, which might explain our findings. Second, since we adjusted for these pertinent confounders, a complex interaction may exist among APOE e4, vascular risk factors, WMH, and cognition. 36, 37 Specifically, a higher vascular risk factor burden combined with APOE e4 genotype results in reduced white matter integrity and predicts faster cognitive decline. 37 Third, the observed association might also be dependent on the disease stage in addition to age, such that the association of WMH and cognition becomes more apparent with advancing age and dementia progression. 38 Increasing age becomes an important determinant of cognitive decline when effects of APOE e4 and its interactions with other risk factors are at play. 39, 40 The mechanisms underlying this association may be Aβ-dependent, Aβ-independent, or both. In addition to causing accelerated cerebral amyloid deposition and impaired clearance of Aβ, APOE e4 can cause detrimental effects on brain through vascular pathways. APOE e4 is associated with neurovascular dysfunction, has a synergistic effect with atherosclerosis by disrupting cholesterol homeostasis, and also affects vessels via CAA. These synergistic effects can drastically compound the damaging effects of WMH in APOE e4 carriers. 41 Faster WMH progression rates were noted in APOE e4-positive patients with AD and healthy adults, supporting our interaction hypothesis. 38, 42 APOE e4 carriers might also have more covert white matter damage that is not detected by routine imaging, 43 but is reflected as worse cognitive outcomes. Future large prospective studies are needed.\nWMH burden reflects a worse cerebrovascular status, potentially increasing vulnerability to neurodegeneration. Higher WMH volume has been associated with reduced cerebral perfusion both in hyperintense areas and normalappearing white matter. 44 Normal-appearing white matter surrounding WMH already exhibits subtle damage, 43 and will likely develop into areas of T2 MRI-detectable WMH. Also, neuroinflammation is a key feature in AD, 45 and APOE e4 carriers have increased levels of plasma inflammatory markers compared to noncarriers, and may also have a differential regulation of neuroinflammatory responses compared to other APOE isoforms. 46, 47 WMH might be a consequence of neuroinflammation. 48 Our neuropathology data showed high agreement between our clinical diagnosis and the definitive pathologic diagnosis. Although our data showed that 100% of homozygous APOE e4 carriers had CAA compared to 64% of heterozygotes, it did not show that WMH burden was associated with worse cognition in people with 2 alleles, and should be interpreted with caution due to the small sample size. While we cannot deduce that worse cognitive outcomes in APOE e4 carriers with WMH are due to CAA, we can speculate that CAA is the more likely etiology for WMH in APOE e4 carriers than in noncarriers, or the likelihood of CAA increases with each added APOE e4 allele. The accelerated amyloid deposition in APOE e4 carriers together with CAA may have a multiplicative detrimental effect on cognition. Findings from a recent population-based study concur with our data showing accelerated WMH-related decline in MMSE score in APOE e4 carriers only. However, this study employed a microvascular lesion load summary score, which ranked an individual from 0 to 3 based on the absence or presence of WMH volume, lacunes, and perivascular spaces beyond a predefined cutoff. In addition, this study did not examine the effects of APOE e4 allele dosage on the associations of microvascular lesion load and MMSE. Therefore, comparisons to our results in this regard could not be made. 49 In contrast, we used quantitative WMH volume as a continuous predictor and 3 cognitive domains as outcomes rather than global cognitive score in our study.\nWe examine the effect of APOE e4 on the association between WMH and cognition in the 2 most common neurodegenerative dementia diagnoses-AD and DLB-which is uncommon as most studies focus on AD. Strengths of our study include a well-characterized study sample of patients with dementia, rigorous image processing methods validated for older adults and mixed dementias, comprehensive neuropsychological testing, adjusting for confounders, use of an autopsy-confirmed subset of data, and replication of findings in an independent dataset. However, there are limitations. This was a crosssectional study and therefore causal inferences could not be deduced. The statistical tests in some subanalyses, such as those in homozygous APOE e4 carriers and the autopsy subsample, had limited power to detect associations, and the null association in the noncarriers of APOE e4 might be a result of the limited sample size (power) as well. Therefore, studies with larger sample sizes are required. However, in an attempt to obtain more robust estimates, we conducted meta-analyses of estimates from SDS and ADNI, which resulted in stronger results. The SDS and ADNI-I used a different neuropsychological battery; however, there were similar tests available in both cohorts tapping into the major cognitive domains. This would not have affected our results as replication is more robust if performed using a different methodology to test the same research question. The number of patients who completed each cognitive test differed, which was related to dementia severity. Missing data from more severe cases might have resulted in an underestimation of the associations.\nSmoking and diabetes were not documented for most ADNI-I participants, hence were not included as covariates; these were not significant confounders in the SDS sample, so models in the 2 samples are fairly comparable. The numbers in the autopsy-based dataset were not sufficient to draw definitive conclusions; however, they provided important insights and can possibly direct future research.\nAPOE e4 may influence the association of WMH with executive functions and language across the spectrum of AD and DLB. Our meta-analysis results showed significant associations of greater WMH volume with cognitive impairment across all 3 cognitive domains tested. Information about the APOE e4 status of patients may be useful to understand the relative contributions of different pathologies to an individual's unique dementia syndrome, and to guide therapy as well. Future studies should aim to extend these findings to other dementia diagnoses and larger datasets. These findings emphasize the importance of WMH (as a marker of SVD) across the AD/ DLB spectrum, and open avenues for further research to understand shared etiologies and risk factors across the dementias.\nAuthor contributions Saira Saeed Mirza: drafting/revising the manuscript, study concept or design, analysis or interpretation of data, accepts responsibility for conduct of research and final approval, acquisition of data, statistical analysis, study supervision. Usman Saeed: drafting/revising the manuscript, analysis or interpretation of data, accepts responsibility for conduct of research and final approval. Jo Knight: drafting/revising the manuscript, analysis or interpretation of data, accepts responsibility for conduct of research and final approval, statistical analysis, study supervision. Joel Ramirez: drafting/ revising the manuscript, data acquisition, analysis or interpretation of data, accepts responsibility for conduct of "}]