[{"section_title": "", "text": "\"The Condition of Education\" summarizes important developments and trends in education using the latest data available. The 2002 edition included a special analysis that describes nontraditional undergraduates in terms of their demographic characteristics, enrollment patterns, ways of combining school and work, participation in distance education, and persistence patterns. The special analysis is reprinted in this document as a separate volume. In today's higher education context, the \"traditional\" undergraduate has become the exception rather than the rule. In the 1999-2000 academic year, just 27% of all undergraduates met the criteria of enrolling immediately after high school, depending on parents for financial support, and working only part-time or not at all. The first part of this discussion uses National Postsecondary Student Aid Study information to describe nontraditional students. The second part examines the relationship between nontraditional status and persistence using the Beginning Postsecondary Students Longitudinal Studies, which followed cohorts of students enrolling in postsecondary education for the first time in the school years 1989-1990 and 1995-1996. Findings show that the most highly nontraditional students (those with four or more nontraditional characteristics) were concentrated in public two-year institutions, with twothirds enrolled in this kind of institution. Two-thirds of nontraditional students perceived their primary role to be that of an employee, and among those who considered themselves primarily students, many found that work limited their class and scheduling options. Nontraditional students were more likely to leave without a degree than traditional students, and were most at risk of dropping out during the first year. (SLD) Reproductions supplied by EDRS are the best that can be made from the original document. "}, {"section_title": "Preface", "text": "The Condition of Education summarizes important developments and trends in education using the latest available data. The report, which is required by law, is an indicator report intended for a general audience of readers who are interested in education. The indicators represent a consensus of professional judgment on the most significant national measures of the condition and progress of education for which accurate data are available. The 2002 print edition includes 44 indicators in six main areas: (1) enrollment trends and student characteristics at all levels of the education system from early childhood education to graduate and first-professional programs; (2) student achievement and the longer-term, enduring effects of education; (3) student effort and rates of progress through the educational system among different population groups; (4) the contexts of elementary and secondary education in terms of courses taken, teacher characteristics, and other factors; (5) the contexts of postsecondary education; and (6) societal support for learning, parental and community support for learning, and public and private financial support of education at all levels. The 2002 edition also includes a special analysis that describes nontraditional undergraduates in terms of their demographic characteristics, enrollment patterns, ways of combining school and work, participation in distance education, and persistence patterns. To make the special analysis available to audiences interested in the enrollment of nontraditional students in postsecondary education, the special analysis is reprinted here as a separate volume."}, {"section_title": "5", "text": "Nontraditional Undergraduates I Page iii"}, {"section_title": "Nontraditional Undergraduates", "text": "Today's undergraduate population is different than it was a generation ago. In addition to being 72 percent larger in 1999 than in 1970 (with fall enrollment growing from 7.4 to 12.7 million), proportionately more students are enrolled part time (39 versus 28 percent) and at 2-year colleges (44 versus 31 percent), and women have replaced men as the majority (representing 56 percent of the total instead of 42 percent) (indicator S, U.S. Department of Education 2002a). There are proportionately more older students on campus as well: 39 percent of all postsecondary students were 25 years or older in 1999, compared with 28 percent in 1970 (U.S. Department of Education 20026). The \"traditional\" undergraduatecharacterized here as one who earns a high school diploma, enrolls full time immediately after finishing high school, depends on parents for financial support, and either does not work during the school year or works part timeis the exception rather than the rule. In 1999-2000, just 27 percent of undergraduates met all of these criteria.' Thus, 73 percent of all undergraduates were in some way \"nontraditional.\"2 Comparable data for a generation ago are not available, but the fact that much of the change in demographic characteristics and enrollment patterns described above occurred in the 1970s (U.S. Department of Education 2002b) suggests that this is not a recent phenomenon. While traditional undergraduates are generally able to direct most of their energy toward their studies, older students, parents (especially single parents), and students who work full time have family and work responsibilities competing with school for their time, energy, and financial resources. Diffi-culties in obtaining child care and class schedules that do not mesh with work schedules are just two of the barriers that nontraditional students may encounter. In addition, some of the older students who did not pursue a postsecondary education when they were younger may have made this decision because they were not prepared academically. Consequently, they may struggle when they enroll later. Nontraditional students who enter postsecondary education seeking a degree are, in fact, less likely than traditional students to attain a degree or remain enrolled after 5 years (Horn 1996). To design effective programs and services to help nontraditional students reach their degree goals, policymakers and postsecondary administrators need information on how many students are affected, the details of their enrollment patterns, and the nature of their persistence problems. The first part of this discussion of nontraditional students uses the National Postsecondary Student Aid Study (NPSAS:2000) to describe their demographic characteristics, enrollment patterns, how they combine school and work, and their participation in distance education. The second part examines the relationship between nontraditional status and persistence using the Beginning Postsecondary Students Longitudinal Studies (BPS), which followed cohorts of students enrolling in postsecondary education for the first time in 1989-90 and in 1995-96. Unless a specific type of institution is specified, the data refer to students at all types of postsecondary institutions (less-than -2year, 2-year, and 4-year)."}, {"section_title": "Definition of Nontraditional Status", "text": "The term \"nontraditional student\" is not a precise one, although age and part-time status (which often go together) are common defining characteristics (Bean and Metzner 1985). An NCES study examining the relationship between nontraditional status and persistence in postsecondary education identified nontraditional students using information on their enrollment patterns, financial dependency status, family situation, and high school graduation status (Horn 1996). Specifically, in this study, a nontraditional student is one who has any of the following characteristics: Delays enrollment (does not enter postsecondary education in the same calendar year that he or she finished high school); Page 2 I Nontraditional Undergraduates Attends part time for at least part of the academic year; Works full time (35 hours or more per week) while enrolled; Is considered financially independent for purposes of determining eligibility for financial aid;3 Has dependents other than a spouse (usually children, but sometimes others); Is a single parent (either not married or married but separated and has dependents); or Does not have a high school diploma (completed high school with a GED or other high school completion certificate or did not finish high school). Horn (1996) defined \"nontraditional\" on a continuum based on the number of these characteristics present. Students are considered to be \"minimally nontraditional\" if they have only one nontraditional characteristic, \"moderately nontraditional\" if they have two or three, and \"highly nontraditional\" if they have four or more. Almost three-quarters of undergraduates are in some way \"nontraditional.\" As indicated earlier, 73 percent of all undergraduates in 1999-2000 had one or more of these characteristics. Figure 1 shows the percentage of undergraduates with each nontraditional characteristic. In 1999-2000, financial independence was the most common nontraditional characteristic (51 percent), followed by part-time attendance (48 percent), and then delayed enrollment (46 percent). In the undergraduate population, there are about as many highly nontraditional students as there are traditional students. In 1999-2000, 27 percent of all undergraduates were traditional, and 28 percent were highly nontraditional (table 1). Another 28 percent were moderately nontraditional and 17 percent were minimally nontraditional. The Nontraditional Undergraduates I Page 3  character of the undergraduate population varied markedly by type of institution. Public 2-year and private for-profit institutions have much larger proportions of moderately and highly nontraditional students than 4-year institutions, and much smaller proportions of traditional students. At both public 2-year and private for-profit institutions, 89 percent of the students were at least minimally nontraditional, compared with 58 percent at public 4-year institutions and 50 percent at private not-for-profit 4-year institutions. BEST COPY AVAILABLE"}, {"section_title": "9", "text": "The percentages of students with some nontraditional characteristics have changed in recent years. Between 1992-93 and 1999-2000, the percentages of students who delayed enrollment, worked full time, had dependents, and were single parents all increased (figure 1). The percentage of undergraduates attending part time decreased, a trend that is projected to continue.4 There were no measurable changes between the 2 years in the percentages who were financially independent or did not have a high school diploma. Interrelationships Among Nontraditional Characteristics Table 2 shows the percentages of all undergraduates with each nontraditional characteristic by type of institution and how the characteristics identified as nontraditional are interrelated. Some of the characteristics occur together by definition; for example, a single parent always has dependents and, at least for purposes of assessing eligibility for financial aid, is always considered to be financially independent. Therefore, a single parent will always have at least three nontraditional characteristics. Other nontraditional characteristics, such as full-time employment and part-time enrollment, occur together frequently, but not always: among students who worked full time, 73 percent attended part time. Among students who were minimally nontraditional (had only one nontraditional characteristic), part-time attendance was the most common reason for being in this category (36 percent). Delayed enrollment (23 percent) and working full time (23 percent) were next. Most of the minimally nontraditional students were 24 years or younger (otherwise they would be financially independent, a characteristic of only 15 percent of minimally nontraditional students). Among moderately nontraditional students (two or three nontraditional characteristics), 68 percent were financially independent, 64 percent attended part time, 52 percent worked full time, and 42 percent delayed enrollment. Relatively fewer had dependents (19 percent). A large majority of highly nontraditional students (80 percent) had dependents. In addition, three-quarters or more were financially independent (as they would be automatically if they had dependents), attended part time, worked full time, and had delayed enrollment in postsecondary education. "}, {"section_title": "Enrollment Patterns", "text": "Nontraditional students are particularly likely to choose 2-year institutions. Among traditional students, 52 percent enrolled in a public 4-year institution, and another 27 percent enrolled in a private not-for-profit 4-year institution (table 3). Relatively few (17 percent) chose a public 2-year institution. The enrollment pattern of nontraditional students is different. Students who were even minimally nontraditional were much more likely than traditional ii. EST COPY AVAILA students to attend a 2-year institution (39 percent), and the more nontraditional they were, the more likely they were to do so. Among highly nontraditional students, 64 percent attended a public 2-year institution."}, {"section_title": "Combining School and Work", "text": "Two-thirds of highly nontraditional students consider themselves primarily employees. Among traditional students, 30 percent did not work while enrolled, and another 67 percent worked but still considered themselves to be primarily students (figure 2). The remaining 3 percent considered themselves primarily employees who enrolled in school. In sharp contrast, 67 percent of highly nontraditional students and 37 percent of moderately nontraditional students considered themselves primarily employees. Even minimally nontraditional students were more likely than traditional students to consider themselves primarily employees (10 versus 3 percent). Working while enrolled has both benefits and limitations. Working while enrolled can have benefits. Among employed undergraduates who considered themselves primarily students, 26 percent thought that working helped them with their coursework, and 55 percent thought it helped prepare them for a career (table 4). There were generally no measurable differences  between traditional and nontraditional students, with the exception that highly nontraditional students were slightly more likely than traditional or minimally nontraditional students to find that working helped them with their coursework."}, {"section_title": "13", "text": "Page 8 I Nontraditional Undergraduates EST COPY AVMLA Working can interfere with school as well as provide benefits. Undergraduates who worked but considered themselves primarily students sometimes found that working limited their class schedule (46 percent), the number of classes they could take (39 percent), their choice of classes (33 percent), or their access to the library (30 percent). Nontraditional students who worked were more likely than their traditional counterparts to report each of these limitations, and in each case, the more nontraditional they were, the more likely they were to report these problems. Among highly nontraditional students, the proportions reporting these limitations ranged from about onehalf to almost three-quarters. Students sometimes report that working has a negative effect on their grades. Highly and moderately nontraditional students (47 and 43 percent, respectively) were more likely than minimally nontraditional students (35 percent) to report this effect, and traditional students (25 percent) were the least likely to do so. For most nontraditional students, gaining skills, earning a degree, and personal enrichment are important considerations in their decision to enroll. Students who considered themselves primarily employees were asked if certain factors were important considerations in their decision to enroll in postsecondary education while working. Regardless of how nontraditional they were, 73 percent or more reported that personal enrichment or interest in the subject, gaining skills to advance in their job or for a new career, and completing a degree or certificate program were important considerations (figure 3). Far fewer (30 to 37 percent) indicated that obtaining additional education required for their job was an important consideration. Too few traditional students considered themselves primarily employees (3 percent) to make comparisons (figure 2). "}, {"section_title": "Distance Education", "text": "Participating in distance education may allow nontraditional students to overcome some of the difficulties they encounter in coordinating their work and school schedules or in obtaining the classes they want. Moderately and highly nontraditional students are more likely than other students to participate in distance education. In 1999-2000, 8 percent of all undergraduates participated in distance education at the institution in which they were enrolled or at both the institution at which they were enrolled and somewhere else (table 5 and indicator 38, U.S."}, {"section_title": "Department of Education 2002a", "text": "). Among those who participated, 29 percent were enrolled in programs available entirely through distance education. Moderately or highly nontraditional students were more likely than either traditional students or minimally nontraditional students both to participate in distance education and to be in programs available entirely through distance education. Page 10 I Nontraditional Undergraduates 15 BEST COPY AVAILABLE Among all students who participated in distance education, 60 percent participated via the Internet, 39 percent through prerecorded television or audio, and 37 percent through live television or audio. There were no statistically significant differences between traditional and nontraditional students in the mode they used to participate."}, {"section_title": "Persistence After 3 Years", "text": "The seven characteristics associated with nontraditional statusfinancial independence, part-time attendance, delayed enrollment, full-time work, dependents, single parenthood, and lack of a high school diplomahave sometimes been called \"risk factors\" because they are related negatively to persistence (staying in school or earning a degree) (Horn 1996;Horn and Premo 1995). This section uses longitudinal data to examine the relationship between nontraditional characteristics and persistence and attainment after 3 years for students who enrolled in postsecondary education for the first time in 1995-96.5 Persistence is best studied in relation to students' goals. Some students enroll for a limited number of courses without intending to earn a degree or certificate. Without knowing the students' specific goals, it is impossible to know whether they were achieved. Therefore, only students with a degree or transfer goal are included in this discussion of persistence. However, 88 percent of the 1995-96 beginning postsecondary students were in this category 16 Nontraditional Undergraduates I Page 11 (BPS:1996(BPS: /1998). Students' nontraditional status here refers to their status when they first enrolled and does not take into account any subsequent changes such as having children or shifting enrollment or employment status. One would expect nontraditional students to take longer than traditional students to complete their programs because enrolling part time is one of the most common nontraditional characteristics (table 2). Consequently, comparing their degree attainment rates after only 3 years is not particularly useful. In contrast, comparing the percentages of traditional and nontraditional degree seekers who left postsecondary education without a degree and had not returned (at least within 3 years) is both appropriate and useful. Nontraditional students are much more likely than traditional students to leave postsecondary education without a degree. Among students seeking a bachelor's degree, 50 percent of highly nontraditional students were no longer enrolled (for any degree) 3 years late; compared with 12 percent of traditional students (figure 4). Similarly, among those seeking an associate's degree, 62 percent of highly nontraditional students left without any degree, compared with 19 percent of traditional students. Even minimally nontraditional students seeking a bachelor's or associate's degree were more likely than their traditional counterparts to leave. Apparent differences at the certificate level were not statistically significant. In addition to being more likely than traditional students to leave postsecondary education without any degree, nontraditional students who had initially planned to earn a bachelor's degree (including those who started at a less-than-4-year institution) were less likely than their traditional counterparts to be still enrolled at a 4-year institution 3 years later (table 6). While 76 percent of traditional students were still enrolled in 4-year institutions, the percentage dropped to 51 percent for minimally nontraditional students and even lower percentages for moderately and highly nontraditional students (28 and 26 percent, respectively).  \"First Follow-up\" (BPS:1996/1998)."}, {"section_title": "Persistence and Attainment After 5 Years", "text": "While a 3-year follow-up is useful for examining persistence, a longer interval is needed to assess attainment. For this purpose, 1989-90 beginning postsecondary students were studied using the 1994 follow-up, which occurred approximately 5 years after they had first enrolled. Students who began their postsecondary education in 1989-90 indicated their degree objectives when they first enrolled. Table 7 shows how many had achieved that objective by 1994 and for those who did not, whether they were still working on that degree, had changed their degree objective, or had left without earning the degree. Those who had changed their degree objective may or may not have been enrolled in 1994.  \"Second Follow-up\" (BPS:1990/1994)."}, {"section_title": "Page 14 I Nontraditional Undergraduates", "text": "BEST COPY AVAIIILA Compared with their traditional counterparts, nontraditional students seeking bachelor's and associate's degrees are less likely to attain their degree goal within 5 years and more likely to leave postsecondary education. Among nontraditional students whose goal was to obtain a bachelor's degree at any time, 31 percent had earned one by 1994, compared with 54 percent of traditional students. The attainment rate for highly nontraditional students was 11 percent. Because many nontraditional students enroll part time, one would expect them to take longer than traditional students to complete a bachelor's degree. If time-to-degree were the only issue, one would expect to find more nontraditional than traditional students still enrolled, but there was no statistically significant difference in the percentages still enrolled after 5 years (23 and 20 percent, respectively). Compared with traditional students, nontraditional students were more likely to change their degree objective (13 versus 7 percent) or leave without a degree (33 versus 19 percent). Similarly, nontraditional students seeking an associate's degree were less likely than their traditional peers to earn the degree (27 versus 53 percent) and more likely to leave without the degree (47 versus 22 percent). Among nontraditional students, those seeking an associate's degree were more likely than those seeking a bachelor's degree to leave without a degree (47 versus 33 percent). The same was not true for traditional students, who left at approximately the same rate regardless of their degree objective. (The difference between 19 and 22 percent was not statistically significant.) For certificate seekers, differences in persistence and attainment rates were not statistically significant except for those of highly nontraditional students. These students were more likely to leave without a certificate (43 percent) than were other nontraditional students (27 to 29 percent) or traditional students (23 percent)."}, {"section_title": "Timing and type of departure", "text": "For postsecondary administrators designing programs to help keep nontraditional students in school, it is important to understand when students most frequently leave postsecondary education. Figure 5 shows the annual attrition rates of students who began their postsecondary education in 1989- -Nontraditional -Traditional NOTE: Represents the percentage of students who interrupted their enrollment each year based on the number still enrolled at the beginning of that year. An \"interruption\" means leaving without returning, transferring downward, or stopping out for more than 4 months and then returning to the same or higher level of institution. SOURCE: Horn (1996) \"Second Follow-up\" (BPS:1990/1994)."}, {"section_title": "Page 16 I Nontraditional Undergraduates 21", "text": "Nontraditional students are most at risk for leaving during their first year, regardless of their degree objective. Among nontraditional students seeking bachelor's degrees, 27 percent interrupted their enrollment in their first year, compared with 14 percent of traditional students (figure 5). The annual attrition rate was lower in subsequent years but remained higher than the rate for traditional students until the fourth year. Among those seeking an associate's degree, 46 percent of nontraditional students left in their first year, compared with 23 percent of traditional students. The gap closed somewhat in the second year, but not after that. Among certificate seekers, nontraditional students were more likely than traditional students to leave in their first year (43 versus 23 percent). There was no difference thereafter, but many certificate programs do not require more than a year to complete. Nontraditional students who leave are as likely as their traditional peers to take a break in their enrollment. Although one might expect students with family and work responsibilities to be more likely than their traditional peers to take breaks in their enrollment, that was not the case. Among nontraditional and traditional students who left their first institution, the percentages who left but returned later were similar (26 and 28 percent, respectively) (figure 6). The rest of the leavers were different, however. Traditional students who left their first institution were more likely than their nontraditional peers (40 versus 27 percent) to transfer downward (in part because more started at 4-year institutions). In contrast, nontraditional leavers were more likely than traditional ones to leave without returning (47 versus 32 percent)."}, {"section_title": "Influence of individual nontraditional characteristics on persistence and attainment", "text": "With the exception of single parenthood, each of the nontraditional characteristics has a direct or indirect association with persistence and attainment. Horn (1996) investigated the relationships between the various nontraditional characteristics and persistence and attainment, taking into account Nontraditional Undergraduates I Page 17 "}, {"section_title": "Stopout2", "text": "Left without return 'From a 4-year to 2-year institution, for example (with or without taking time off). 'Left school for a period of 4 or more months and then returned to the same level of institution. SOURCE: Horn (1996) \"Second Follow-up° (BPS:1990/1994. the effect of other variables also likely to affect persistence, including sex, race/ethnicity, socioeconomic status, and the control and level of institution. This analysis showed that, controlling for the covariation of these other factors, the following nontraditional characteristics remained negatively associated with persistence: delaying enrollment, enrolling part time, being financially independent, and having a GED or other certificate of completion. The remaining three nontraditional characteristicsworking full time in the first year of enrollment, having dependents, and being a single parentdid not have an independent association with persistence. Further analysis demonstrated, however, that working full time and having dependents predicted part-time and delayed enrollment and therefore indirectly affected persistence. Only single parenthood did not have a measurable independent direct or indirect effect."}, {"section_title": "BEST COPY AVAILABLIE", "text": "Page 18 I Nontraditional Undergraduates"}]