[{"section_title": "Abstract", "text": "Objective: To report experimental impacts of a universal, integrated school-based intervention in socialemotional learning and literacy development on change over 1 school year in 3rd-grade children's socialemotional, behavioral, and academic outcomes. Method: This study employed a school-randomized, experimental design and included 942 3rd-grade children (49% boys; 45.6% Hispanic/Latino, 41.1% Black/African American, 4.7% non-Hispanic White, and 8.6% other racial/ethnic groups, including Asian, Pacific Islander, Native American) in 18 New York City public elementary schools. Data on children's social-cognitive processes (e.g., hostile attribution biases), behavioral symptomatology (e.g., conduct problems), and literacy skills and academic achievement (e.g., reading achievement) were collected in the fall and spring of 1 school year. Results: There were main effects of the 4Rs Program after 1 year on only 2 of the 13 outcomes examined. These include children's self-reports of hostile attributional biases (Cohen's d ϭ 0.20) and depression (d ϭ 0.24). As expected based on program and developmental theory, there were impacts of the intervention for those children identified by teachers at baseline with the highest levels of aggression (d ϭ 0.32-0.59) on 4 other outcomes: children's self-reports of aggressive fantasies, teacher reports of academic skills, reading achievement scaled scores, and children's attendance. Conclusions: This report of effects of the 4Rs intervention on individual children across domains of functioning after 1 school year represents an important first step in establishing a better understanding of what is achievable by a schoolwide intervention such as the 4Rs in its earliest stages of unfolding. The first-year impacts, combined with our knowledge of sustained and expanded effects after a second year, provide evidence that this intervention may be initiating positive developmental cascades both in the general population of students and among those at highest behavioral risk."}, {"section_title": "", "text": "Over the last decade, children's developmental pathways toward or away from social-emotional, mental health, and academic problems have become increasingly well understood (e.g., Tolan & Gorman-Smith, 2002) . Fortunately, this period has also witnessed significant advances in prevention science, resulting in more conceptually grounded and empirically validated preventive interventions to reduce mental health and problem behaviors in elementary school (e.g., Hoagwood et al., 2007) . In particular, knowledge has grown about the effectiveness of school-based intervention strategies to reduce children's risk for future aggressive and violent behavior (e.g., Aber, Brown, & Jones, 2003; Conduct Problems Prevention Research Group [CPPRG], 1999 .\nAlthough the literature on school-based preventive interventions is rich with studies of interventions targeted at subgroups of high-risk children, it has only recently expanded to studies of whole-school interventions implemented with general populations of students (e.g., Hahn et al., 2007) . But even among the best studies of such universal school-based interventions, various methodological challenges have limited the quality and generalizability of the knowledge base (Hundert et al., 1999) . For example, with the exception of several to date (e.g., CPPRG, 1999 CPPRG, , 2004 CPPRG, , 2007 Ialongo, Poduska, Werthamer, & Kellam, 2001; Kellam, Ling, Merisca, Brown, & Ialongo, 1998) , few studies have employed school-randomized designs that support definitive causal statements about the impact of the intervention on outcomes. There are also broader challenges facing this field. For example, there remains an unresolved tension in the movement to reform education between standards-based accountability, with its focus on academic achievement, on one hand and social and emotional development, with its focus on social-emotional competence, behavior, and mental health, on the other. The present study has been designed to contribute to ongoing scholarship in the school-based prevention of social-emotional, behavioral, and academic problems by reporting experimental impacts of a universal, integrated school-based intervention in social-emotional learning and literacy development (the 4Rs Program: Reading, Writing, Respect, and Resolution) on change in third-grade children's socialemotional, behavioral, and academic functioning after 1 school year of intervention."}, {"section_title": "A Theory of Change for the 4Rs Program", "text": "Recent evidence suggests the value of effectively integrating academic and social-emotional intervention efforts and of examining the direct effects of such integrated interventions on both domains of development (e.g., Durlak, Weissberg, Dymnicki, Taylor, Schellinger, in press ). The value of such integration is supported by a mounting body of research linking successful school adjustment and performance with the development of socialemotional competence (Miles & Stipek, 2006; Rogoff, 1990; Wentzel & Asher, 1995) . To date, there has been greater emphasis on developing and testing integrated approaches to building social-emotional and literacy skills in the preschool period (e.g., Bierman et al., 2008; Raver et al., 2009 ), but integrated approaches in the elementary school years are needed as well (e.g., Domitrovich et al., 2010) .\nThe 4Rs Program is a universal, school-based intervention for Grades K-5 focused on social-emotional learning and literacy development. Pedagogically, 4Rs links the teaching of socialemotional competencies and the teaching of fundamental academic skills, thereby capitalizing on their mutual influence on successful development (Hinshaw, 1992) . (See Method section for a full program description.) Building off its programmatic predecessor, the Resolving Conflict Creatively Program (RCCP; Aber et al., 2003) , the 4Rs Program can be characterized as a \"developmental intervention\" (National Research Council, 1993) , because it focuses on changing underlying mental and interpersonal processes that lead to aggression and violence when they are still in the formative stage. The theoretical model underlying the socialemotional learning core of the 4Rs Program emphasizes socialcognitive and interpersonal processes that link individual, family, and community risk factors to the development of aggressive behavior and that place children at higher risk for a broader set of mental, emotional, and behavioral problems (e.g., Coie & Dodge, 1998; O'Connell, Boat, & Warner, 2009 ).\nThe key mental and interpersonal social-cognitive processes directly targeted by 4Rs include hostile attributional bias, namely, the tendency to attribute hostile intent to an ambiguous or prosocial cue (e.g., Dodge, Bates, & Pettit, 1990) ; normative beliefs about aggression, or the perceived acceptability of aggressive responses under varying conditions of provocation; aggressive and prosocial fantasies, a form of cognitive script rehearsal about aggressive/antisocial and prosocial interactions and events (Huesmann, Guerra, Miller, & Zelli, 1992) ; and aggressive interpersonal negotiation strategies, or children's propensity to select aggressive over prosocial responses in hypothetical problem-solving situations (Leadbeater, Hellner, Allen, & Aber, 1989) . Theory and both basic and applied research converge to suggest that these socialcognitive processes (a) are affected by certain types of experiences (e.g., a history of harsh, punitive, or abusive parenting or exposure to community violence; Coie & Dodge, 1998) or a peer environment in which violence is normative (Tremblay, Masse, Vitaro, & Dobkin, 1995) . In turn, these social-cognitive processes (b) increase the probability of aggression and violence by children and youths (e.g., Dodge, Laird, Lochman, & Zelli, 2002) and are linked to a broader set of mental, emotional, and behavioral problems (e.g., Domitrovich et al., 2010) ."}, {"section_title": "Theory Guiding the Evaluation of the 4Rs Program", "text": "Our approach to the evaluation of the 4Rs Program is guided both by a multilevel program theory (Jones, Brown, & Aber, 2008) and by developmental cascades theory (Masten & Cicchetti, 2010; Masten, Long, Kuo, McCormick, & Desjardins, 2009) . With regard to multilevel program theory, three major sets of premises guided the design of 4Rs and have direct implications for the design and conduct of its evaluation. First, 4Rs promotes change processes at multiple levels (e.g., individuals, their interactions, and proximal settings including their classroom and school environments; Tseng & Seidman, 2007) . Second, 4Rs was designed based on the idea that improving functioning in one domain (e.g., interpersonal interactions) influences functioning in other domains (e.g., academic engagement and attention; Domitrovich et al., 2010; Guerra & Bradshaw, 2008) . Finally, 4Rs is designed to promote change at multiple levels in multiple domains over time as dynamic systems (e.g., Cox, Mills-Koonce, Propper, & Gariepy, 2010; Jones et al., 2008) .\nOther whole-school reform strategies in social-emotional learning appear to be founded on these (and other) premises. Targets of the intervention are processes at multiple levels (individual, relational, peer networks, classrooms, whole schools; e.g., Seattle Social Development Project, Fast Track) and in multiple domains (social-cognitive processes, social relational processes, peer and classroom functioning, whole-school climate; e.g., the Good Behavior Game, the Multisite Violence Prevention Project). Further, it is believed that changing nested systems (i.e., children in classrooms, classrooms in schools) requires extended periods of time (Farrell & Vulin-Reynolds, 2007; Hawkins, Guo, Hill, BattinPearson, & Abbott, 2001) . Some small or modest changes may appear in some domains of functioning at some levels early on in the intervention, but it is likely that larger and more significant changes will occur in more domains and across more levels later on. In multiyear whole-school interventions, this unfolding of intervention effects across domains of functioning and levels of the system is influenced both by the intensity and quality of intervention implementation and by the rhythm of summer breaks and yearly re-sorting of teachers and children.\nAlthough these premises are shared by many social-emotional learning and whole-school intervention strategies, they are not typically reflected in the design and conduct of their evaluations. Furthermore, until very recently, program thinking about the unfolding of intervention effects across domains and levels and over time was rather nonspecific (e.g., Aber et al., 2003; Aber, Jones, Brown, Chaudry, & Samples, 1998) . It is impossible to confidently interpret modest early impacts as promising or discouraging without employing developmental and other theoretical perspectives to guide evaluation design for multidomain, multilevel, dynamic systems intervention (Hawkins et al., 2001) . Fortunately, this gap in using theory to guide the analysis and interpretation of unfolding intervention effects has begun to be addressed by a number of scholars and researchers. In this project, we drew heavily and explicitly on developmental cascades theory and research. According to Masten and Cicchetti (2010) , \"Developmental cascades' refer to the cumulative consequences for development of the many interactions and transactions occurring in developing systems that result in spreading effects across levels, among domains at the same level, and across different systems or generations\" (p. 491). As Masten and Cicchetti noted, developmental cascades are referred to in other literatures as chain reaction, snowball, amplification, spillover, or progressive effects.\nOn the basis of extant theory and empirical research, we hypothesized both short-and longer term effects of 4Rs on children's outcomes. Our expectations for short-term effects after 1 school year were in the social-cognitive domain, particularly in those areas in which we saw change in our evaluation of the RCCP Program after 1 school year (Aber et al., 1998 ): children's hostile attributional biases, aggressive fantasies, and aggressive interpersonal negotiation strategies. The 4Rs programmatic approach of embedding lessons in social-emotional learning in a balanced literacy delivery strategy supports our expectation for short-term effects on children's basic literacy skills. In addition, we expected longer term effects on children's aggressive and socially competent behavior and academic achievement that might require more than 1 year of intervention to emerge. We also hypothesized that while there might be evidence of small or modest spillover effects early in the intervention (e.g., impacts on other mental health outcomes such as depression or attention problems), if 4Rs is implemented with fidelity over several years, more evidence of spillover would become evident in later years. Finally, given prior results from our evaluation of the RCCP in which intervention effects were robust across key demographic subgroups including gender, race/ethnicity, and socioeconomic status (Aber et al., 2003) , we did not expect variation in intervention effects for these subgroups. However, variation in intervention effects by levels of aggression at baseline was expected consistent with growing evidence of stronger intervention effects of school-based socialemotional learning programs for children rated as high on preintervention measures of aggression (e.g., CPPRG, 2007; Farrell, Meyer, Sullivan, & Kung, 2003) .\nOn the basis of these expectations and in order to effectively assess the theory of developmental cascades underlying the 4Rs Program and its evaluation design, we planned to report the results of the 4Rs study in a staged manner over time (Masten & Cicchetti, 2010) . Accordingly, we plan to report (a) effects separately by years of intervention (Years 1, 2, and 3), (b) effects separately by level (child, classroom, school) , and (c) effects simultaneously across domains (social-emotional and academic learning). Our first set of reports focuses on findings after 1 year of intervention at the individual child level (this report) and the classroom level (Brown, Jones, LaRusso, & Aber, 2010) . Our next report focuses on impacts after 2 years of intervention at the child level (Jones et al., in press ), and we are planning reports at the teacher and classroom levels after 2 years. Additional reports will follow this strategy through the full 3 years of the intervention."}, {"section_title": "Method", "text": "This study was conducted in one of seven sites that participated in the Social and Character Development (SACD) Research Program funded by the U.S. Department of Education's Institute of Education Sciences, in collaboration with the National Center for Injury Prevention and Control at the Centers for Disease Control (CDC). The Institute of Education Sciences and CDC selected seven grantees to implement and evaluate school-based SACD interventions using a random-assignment, 3-year longitudinal design. Data included as part of the larger SACD research program is presented in the not yet released National Evaluation Report (SACD Research Consortium, 2008) ."}, {"section_title": "Procedures", "text": "School recruitment and randomization. Building on the long-standing relationships in the school community developed by the 4Rs Program practitioners at the Morningside Center for Teaching Social Responsibility (MCTSR), we originally identified 41 schools as potential participants in the 4Rs evaluation (see Figure 1) . After a recruitment visit and detailed explanation of the intervention and study design, 24 of these 41 agreed to the process of matching and randomization. Prior to randomization, a pairwise matching procedure was used to ensure demographic similarity of intervention and control groups. An algorithm developed by Mathematica Policy Research (SACD Research Consortium, 2008) was employed and enabled us to select the most closely matched pairs of schools by minimizing the multivariate distance between school pairs based on 20 measurable demographic and school characteristics. These variables were drawn from the 2001-2002 administrative databases kept by New York City's Department of Education and were selected to represent a number of dimensions related to the outcomes. They include such variables as the number of students, percentage of students receiving a free lunch, racial/ ethnic composition, student achievement, average spending per student, and teacher experience.\nThe nine best matched pairs of schools were initially selected for inclusion in the study with the three remaining pairs reserved as backups. The first backup pair was eliminated from consideration by a local instructional superintendent. Two of our initially selected best matching pairs were dropped (in one case the principal was previously trained in the RCCP-an original exclusion criterion-and in the other, the principal was unwilling to proceed with the study if assigned to the control group) and were replaced with our second and third backup pairs.\nTo conduct random assignment, we employed a random numbers generator to generate, in sequence, nine random numbers ranging from 0 to 1 that were assigned to the first school in each of the nine pairs. Based on the randomly generated number, the first school in each pair was assigned to the intervention or the control group and the second school in the pair was assigned to the other group. After random assignment, the two groups were compared across the 20 demographic characteristics employed in the matching procedure. As expected, the two groups did not differ significantly on any of these characteristics and eta squared values were minimal. The final set of schools was racially and ethnically diverse, composed primarily of students who received a free school lunch, and characterized by attendance rates over 89% and 1-year stability rates that ranged from 86% to 95%. The demographic characteristics of the schools are similar to the demographic characteristics of public elementary schools in New York City at this time.\nConsent and participants. Consent packages (in English and Spanish) were sent home to all parents of third-grade children in the 18 schools informing them of the study and seeking consent for their child to participate. Consent rates were calculated at the end of Year 1 and included the children consented by the spring of third grade (n ϭ 883) divided by the total eligible population at spring of third grade (n ϭ 1,420; see Figure 1 ), resulting in a rate of 62.18%. These rates did not differ between intervention schools (63.59%) and control schools (60.57%). Nonparticipants included children whose parents did not speak English or Spanish well enough to consent to participate and children with special needs who could not be interviewed on an individual basis. Comparisons of demographic and achievement characteristics between consented and nonconsented children were conducted with school records data. Although significant differences were found for gender (fewer male participants, Cohen's d ϭ 0.15) and school absences (higher absences for nonparticipants, Cohen's d ϭ 0.21), they were of small size, and no differences were found for children's race/ethnic status, receipt of free lunch, number of suspensions, and reading and math test scale scores. On the basis of these results, we are confident that we obtained a representative sample of children from the 18 schools.\nParents who granted consent completed a demographic questionnaire at home, rated their children's social competence and externalizing problems, and returned the questionnaires in sealed envelopes to the school, where they were collected by our research team. Parents who consented to participate but did not return a questionnaire were contacted via telephone to complete the survey. Parents were paid $15 for completion of the surveys at each assessment. Teachers completed questionnaires rating the language and literacy skills, social competence, and externalizing problems of each child in their class with consent. Teachers were paid at the union wage of $36.50 per hour for their time. Children completed questionnaires rating their social cognitions and internalizing symptoms. Data were collected from the children in small class groups (n ϭ 5 to 20). All questions were read out loud by a research assistant while a second research assistant circulated to monitor children's responses and answer questions. Children who did not have consent or who did not assent worked on an alternative activity. The total sample includes 942 third-grade children (49% boys; average age ϭ 8.07 years, SD ϭ 0.7), 799 parents (85% mothers; average age ϭ 35.5 years), and 85 teachers (94% female; average age ϭ 36.1 years). Children and teachers were nested in nine intervention schools (n ϭ 515; 54.7%) and nine control schools (n ϭ 427; 45.3%). Data for this report come from Year 1 of the 3-year evaluation. Baseline data were gathered in the fall of third grade (2004, Wave 1), and follow-up data were collected in the spring of third grade (2005, Wave 2). Because randomization occurred at the school level, children who moved out of a participating school were not followed (n ϭ 59), and consent was requested for children who either moved into a participating school or decided to join the study in the spring of third grade (n ϭ 124) (Vuchinich et al., 2010) . Attrition from fall to spring was minimal (7.2%) and primarily due to student mobility out of the participating schools. Refusals from parents to continue participation were rare (n ϭ 1; 0.1%). As shown in Figure 1 , children who were present in both waves of the study (n ϭ 759) and children who were present in either wave but not both (n ϭ 59 fall only, n ϭ 124 spring only) were included in the analyses presented below (N ϭ 942). There is no evidence that children with complete data on the outcomes of focus in this paper (i.e., at both Waves 1 and 2) differed significantly from those with data only at Wave 1 or only at Wave 2 (SACD Research Consortium, 2008) .\nAccording to parent reports at baseline, 53.4% (n ϭ 503) of children lived in a single-parent household, 15.1% (n ϭ 142) of parents were unemployed, 31% (n ϭ 292) of parents had less than a high school diploma or GED, and 61.8% (n ϭ 582) of households were at or below 100% of the federal poverty level. Children represented diverse racial/ethnic groups; 45.6% (n ϭ 430) were Hispanic/Latino, 41.1% (n ϭ 387) were Black/African American, 4.7% (n ϭ 44) were non-Hispanic White, and 8.6% (n ϭ 81) were other racial/ethnic groups (e.g., Asian, Pacific Islander, Native American). Table 1 presents baseline demographic characteristics.\nIntervention. The 4Rs Program is a universal, school-based intervention in social-emotional learning and literacy development that integrates a focus on broad social and emotional development into the language arts curriculum for children in Grades K-5. Developed and run by a community-based nonprofit organi- zation (MCTSR; www.morningsidecenter.org), the 4Rs Program uses high-quality children's literature as a springboard for helping students gain skills and understanding in the areas of handling anger, listening, assertiveness, cooperation, negotiation, mediation, building community, celebrating differences, and countering bias. Broadly speaking, the social-emotional learning core of 4Rs is designed to change how children think, feel, and behave in situations of potential interpersonal conflict (see examples below). Our evaluation's emphasis on the set of social-cognitive mental processes that underlie aggressive and other problem behaviors is consistent with this program theory. The program has two primary components: (a) a comprehensive 7-unit, 21-35 lesson, literacy-based curriculum in socialemotional learning and (b) 25 hrs of training followed by ongoing coaching of teachers to support them in teaching the 4Rs curriculum (with a minimum of 12 coaching contacts per year). Each curriculum unit focuses on a specific grade-appropriate children's book and begins with a book reading and discussion, ensuring that students understand the primary themes of the story. This is followed by three to five social-emotional learning skill lessons in which children practice specific skills in the context of a discussion of the book. For example, the lessons for the third-grade unit \"Understanding and Dealing with Feelings\" focus first on identifying feeling words from the story, then on practicing \"reading\" feelings other students act out, and finally on identifying and practicing strategies for \"cooling down\" through role play. Consistent with this unit's emphasis on the social-cognitive processes of detecting situational and emotional cues, the \"Listening\" unit emphasizes basic skills of effective listening including making direct eye contact, paraphrasing, and acknowledging comprehension.\nIntensive professional development for teachers consists of a 25-hr introductory training course and ongoing classroom coaching by a 4Rs staff developer from MCTSR. Teachers are provided with learning kits with a full set of materials needed to implement the program. The introductory training is designed to (a) introduce the teachers to the curriculum, (b) give them an opportunity to practice social-emotional skills at the adult level through role playing and experiential learning, and (c) inspire them to employ the ideas and skills embodied in the curriculum in their own lives both professionally and personally. Ongoing classroom coaching encompasses class lesson modeling, workshops, and group meetings led by the staff developer, co-planning and teaching of lessons by the teacher and staff developer, and lesson observations and feedback. A full cost study for this evaluation is under way but not complete; however, MCTSR reports the cost of the 4Rs Program to be approximately $90 per child per year (this amount excludes all costs associated with the evaluation).\n4Rs implementation. Schoolwide implementation of the two primary components of the 4Rs Program was systematically tracked and monitored. During the first year of implementation, teachers on average delivered three quarters of a lesson in the 4Rs curriculum per week (SD ϭ 0.70), with the majority closer to the benchmark of one lesson per week. Further, the majority of teachers appear to have spent on average between 20 and 25 total hours (ϳ 40 min per week) implementing the 4Rs curriculum throughout the year (SD ϭ ϳ 32 min per week). Teachers in the nine intervention schools received on average 2.4 (SD ϭ 0.33) days of training in the delivery of the 4Rs curriculum, and schools received an average of 38 (SD ϭ 9.6) days per school of coaching by 4Rs staff developers. There is more variability in 4Rs implementation between teachers than between schools. There were no significant differences in average levels of implementation (lessons delivered per week, time spent per week, and the amount of training and coaching received) between teachers in different grades.\nInformation on the implementation of various social and character development activities was also gathered from all third-, fourth-, and fifth-grade teachers in both intervention and control schools with a measure developed for the broader SACD research program. The percentage of control teachers reporting using any SACD activities in their classroom ranged from 75.6% to 85.6% over the 3 years of the study. A greater percentage of intervention than control teachers reported using any SACD activity in Year 1 (Cohen' "}, {"section_title": "Measures", "text": "Scale scores, computed as the mean across the items for each construct, were employed in the analyses presented below. Basic psychometrics, including alpha coefficients for each construct in the fall and spring of third grade, are presented in Table 2 .\nSocial-cognitive processes. Hostile attribution biases were measured with child self-reports on an adaptation of the Home Interview Questionnaire (Dalhberg, Toal, & Behrens, 1998) . Six vignettes that depict ambiguous but provocative social scenarios are read aloud while pictorial representations of the scenarios are presented (e.g., a student's milk carton is spilled on another child's back). Following presentation of each vignette, children are asked to select one of four possible causal attributions regarding the intent of the provocateur. Two attributions refer to the provocateur's intent as benign or accidental (rated 0; e.g., the milk was spilled accidentally) and two refer to it as hostile or purposeful (rated 1; e.g., the student was being mean).\nNormative beliefs about aggression were measured with the Normative Beliefs About Aggression scale (Huesmann & Guerra, 1997) , a measure designed to assess children's beliefs about the acceptability of the use of aggression in certain situations. The total normative beliefs scale ranges from 1 (low normative beliefs; the use of aggression is \"perfectly OK\") to 4 (high normative beliefs; the use of aggression is \"really wrong\") and includes 12 items.\nAggressive and prosocial fantasies were measured with selfreports on the What I Think instrument (Rosenfeld, Huesmann, Eron, & Torney-Purta, 1982) . The Aggressive Fantasies subscale contains six items that ask children about aggressive thoughts that just \"pop into your head\" or \"daydreams\" (e.g., about hitting or hurting someone; pretending to fight with someone). The Prosocial subscale contains six items that ask children about prosocial thoughts (e.g., about helping other kids, about doing nice things for other kids). Items are rated on a 3-point scale (0 ϭ no, 1 ϭ a little, 2 ϭ a lot).\nAggressive interpersonal negotiation strategies were also selfreported with an adaptation of the Home Interview Questionnaire (Dalhberg et al., 1998) . Following the presentation of each vignette and causal attributions, children are asked what they would do next in the scenario and are asked to select one of four response strategies. Three response strategies are nonaggressive or benign (rated 0; e.g., act like nothing happened), and one strategy is aggressive or hostile (rated 1; e.g., spill paint on the child).\nBehavioral symptomatology.\nChild aggression was measured with teacher reports of aggression on the Behavioral Assessment System for Children (Reynolds & Kamphaus, 1998) . Teachers report on 13 aggressive behavior items (e.g., physically aggressive, argumentative, threatening, or critical of others) observed within the past 30 days, and items are rated on a 4-point scale (1 ϭ never, 2 ϭ sometimes, 3 ϭ often, 4 ϭ almost always).\nChild social competence was measured with teacher reports on the 18-item Social Competence Scale (CPPRG, 1999) . The measure includes two subscales: Prosocial Behaviors (e.g., is good at understanding other people's feelings) and Emotion Regulation (e.g., can calm down when excited or all wound up).\nDepressive symptoms were assessed via self-reports of depressive symptoms on the Diagnostic Interview Schedule for Children Predictive Scales (Lucas et al., 2001 ). This questionnaire contains six items that ask children about whether they have experienced particular depressive symptoms (e.g., lethargy, anhedonia, suicidal thoughts) in the past year (for Wave 1) or since the new year (for Wave 2). Items are rated on a 2-point scale (0 ϭ no, 1 ϭ yes).\nAttention/hyperactivity symptoms were measured from teacher reports on nine items from the ADHD Symptomatology Scale (Milch, Loney, & Landau, 1982) . Teachers report on children's hyperactivity (e.g., is excitable or impulsive) and inattentiveness (e.g., has difficulty organizing tasks or activities) within the past 30 days, with items rated on a 4-point scale (1 ϭ never to 4 ϭ almost always).\nLiteracy skills and academic achievement. Academic skills were measured from teacher reports on items adapted from the Early Childhood Longitudinal Study, Kindergarten Cohort of 1998 -1999, third-grade assessment (National Center for Education Statistics, 2002). Nine items tap the degree to which a child has acquired and demonstrates the targeted language and literacy skills, knowledge, and behaviors appropriate for third graders (e.g., reads fluently, conveys ideas clearly, composes multiparagraph stories). Items are rated on a 5-point scale (1 ϭ not yet to 5 ϭ proficient). Attendance rate was calculated as the proportion of full days present in school during the year prior to the study (2003) (2004) ) and children's third-grade school year (2004 -2005) .\nBaseline covariates. Household socioeconomic (SES) risk index was calculated as the sum of four parent-reported, dichotomous demographic characteristics at baseline: single-parent household, less than high school education, poverty at or below 100% of the federal poverty level, and unemployment. For children with missing parent-reported risk indicators, these values were imputed based on child school, gender, and race/ethnicity. Among the parents who consented to participate at each assessment point (85.7%, 80.96% of the total child sample at Waves 1 and 2, respectively), 13.4% (n ϭ 94) and 20.3% (n ϭ 152) of parentreport data were missing at Waves 1 and 2.\nCommunity risk was measured from parent reports on the Community Risks and Resources Questionnaire (Forehand et al., 2000) . Parents are asked to rate how well seven statements describe their neighborhood (e.g., drugs are sold or used, houses/apartments are in poor condition). Items are rated on a 4-point scale (1 ϭ not at all to 4 ϭ lot), and a high score indicates greater risk. As with household SES risk, for children with missing parent-reported community risk indicators these values were imputed based on child school, gender, and race/ethnicity.\nChild aggression index was measured from teacher reports of aggression and conduct problems on the Behavioral Assessment System for Children (Reynolds & Kamphaus, 1998) . Teachers report on 13 aggressive behaviors (e.g., physically aggressive, argumentative) and 11 conduct-disordered behaviors (e.g., steals, truancy) observed within the past 30 days, with items rated on a 4-point scale (1 ϭ never to 4 ϭ almost always). The index was calculated based on a nationally normed t score (t ϭ 63.5 and 62.9 for aggressive behavior and conduct disorder, respectively). Children were grouped based on whether they were below the t-score cutoff on both scales (rated 0), at or above the cutoff on one scale (rated 1), or above the cutoff on both scales (rated 2)."}, {"section_title": "Results", "text": "Means and standard deviations for the 13 focal child outcomes at Waves 1 and 2 are presented for the sample overall and by intervention group (see Table 2 ). There were no differences in mean levels of the outcomes at baseline (Wave 1) by intervention group. Intercorrelations among the dependent variables at baseline as well stability in the dependent variables from Wave 1 (baseline) to Wave 2 are available from the first author upon request.\nMain analytic strategy. Because schools were matched into pairs prior to randomization, the data presented here are nested: Children are nested in schools, and schools are nested in their matched pairs. To accommodate these design features, we calculated estimates of intervention impact on change in the primary child outcomes from preintervention baseline (fall 2004, Wave 1) to the first follow-up (spring 2005, Wave 2) using a series of two-level hierarchical linear models with random effects in HLM 6.02. In these models, Level 1 (child) included the preintervention baseline of the dependent variable (with the exception of math and reading achievement, for which no prior year score was available), and the child-level baseline covariates (child gender, race/ethnic background, family SES risk, community risk, and child aggression index), and Level 2 (school) included a dummy variable indicating intervention condition as well as eight dummy variables representing the school pair matches. In addition, interactions between intervention status and the baseline child aggression index were examined in a second set of models. In interpreting the results we consider an alpha level of p Ͻ .05 as significant but note as trends effects up to the .10 level in the case of interactions (McClelland & Judd, 1993) . In addition, for main effects and any significant interactions, we report effect sizes (e.g., McCartney & Rosenthal, 2000) . Effect sizes were calculated by dividing the estimate of the intervention effect by the raw standard deviation of the dependent variable at Wave 2 for the control group (a variant of Cohen's d, attributed as Glass's ⌬, designated in the results as ES; Cohen, 1992) .\nMain effects of intervention. As shown in Tables 3 and 4 , there were significant main effects of the 4Rs intervention for two of the nine child outcomes in the social-cognitive processes and behavioral symptomatology domains. We found intervention effects for children's self-reports of hostile attributional bias (ES ϭ .20) , such that children in the intervention group reported significantly lower levels of hostile attributional bias in spring 2005 (Wave 2) than did those in the control group after we accounted for their baseline scores in fall 2004. In addition, we found intervention effects for children's self-reports of depressive symptoms (ES ϭ .24), such that children in the intervention group reported significantly lower levels of depressive symptoms in spring 2005 (Wave 2) than did those in the control group after we accounted for their baseline scores in fall 2004. There were no main effects for the remaining outcomes in these domains after the first year of exposure to the 4Rs intervention. In addition, there were no main effects for the four outcomes in the literacy skills and academic achievement domain after the first year of exposure to the 4Rs intervention (see Table 4 ).\nInteraction of intervention status with baseline child aggression. As indicated above, cross-level interactions of intervention status by the baseline child aggression index were included in a second set of models to address our second question about the degree to which the effects of the 4Rs intervention were moderated by baseline levels of child aggression (Rothwell, 2005) . As shown in Tables 3 and 4 , there were statistically significant interactions for two of the 13 outcomes examined (teacher report of academic skills and attendance), and there were two additional interactions with p values less than .10 (aggressive fantasies and reading achievement). To interpret the statistically significant interactions, we generated plots of the adjusted means for the relevant outcomes for each level of the baseline child aggression index by intervention group. We also calculated effect sizes for the mean differences between the intervention and control groups at each level of the baseline child aggression index. As shown in Figure 2 , children with the highest level of baseline behavioral risk (based on teacher reports) showed the greatest positive difference in teacher report of academic skills between the intervention and control schools, with effect sizes of .40 for a score of 2 on the baseline child aggression index, .17 for a score of 1, and Ϫ.05 for a score of 0. As shown in Figure 3 , children's attendance rate followed a similar pattern, with children in the highest risk group showing the largest positive impact of the intervention (ES ϭ .32 for a score of 2 on behavioral risk, .14 for a score of 1, and Ϫ.10 for a score of 0)."}, {"section_title": "Discussion", "text": "This paper presents experimental impacts after 1 school year of a universal, integrated intervention in ethnically diverse, urban elementary schools that embeds instruction in social-emotional learning into a balanced literacy curriculum. It is unique in that it provides an experimental test of the short-term causal impact of a universal integrated intervention on key mental processes as well as behavioral and academic outcomes. As described in the introduction, building on program and developmental cascades theories and on our prior work, we posited both short-term and longer term effects of the 4Rs: (a) short-term effects on children's socialcognitive processes and literacy skills, (b) potential early cascading or spillover effects on depression and attention, (c) variation in the strength of effects by children's baseline levels of aggression, and (d) longer term effects on aggression, social competence, and achievement.\nWith regard to the results after 1 school year, we did not see strong evidence of short-term change in children's socialemotional, behavioral, and academic functioning. We found (a) a single statistically significant main effect on children's hostile attributional biases out of five social-cognitive processes examined and no main effect for children's literacy skills; (b) a statistically significant main effect on children's self reports of depression but not on attention problems; (c) statistically significant cross-level interaction effects by baseline child aggression for two outcomes (academic skills and attendance) and trend-level effects for two others (standardized tests of reading and aggressive fantasies); and (d) no main effects for aggression, social competence, and the measures of academic achievement. Thus, we found statistically significant main effects for only two outcomes out of the 13 examined, a rate better than chance but only slightly. The same rate holds for the interaction effects.\nOf the statistically significant main effects that were identified, hostile attributional bias is a core social-cognitive process considered central to the 4Rs Program theory and an outcome for which we expected to see short-term change. Children's self-reports of depressive symptoms is an outcome for which we expect longer term spillover effects, perhaps after more years of exposure to the program. The size of the effects on these two outcomes (ES ϭ .20 and .24, respectively) is generally consistent with findings after the first year of our evaluation of the RCCP (as noted above, the RCCP lessons represent the majority of the social-emotional learning core of the 4Rs Program). Despite their absolute size, these findings were equivalent to offsetting approximately one year of decline in the socialcognitive and social-emotional processes tied to later behavioral outcomes (Aber et al., 1998) .\nWe expect, consistent with the theory underlying the 4Rs Program, the design of the evaluation, and our previous work and the work of others (e.g., Aber et al., 1998 Aber et al., , 2003 Lansford et al., 2006) , that exposure to the 4Rs Program will first influence the most proximal targets (social-cognitive processes), and these in turn will influence the developmental course of a broader set of mental, emotional, behavioral, and academic outcomes. In particular, we expect that the early changes we see for 4Rs children in hostile attributional biases will translate into changes in aggressive and delinquent behavior in later elementary school, when these more serious behaviors begin to increase (e.g., Smolkowski et al., 2005) . In addition, consistent with developmental cascades theory (Masten & Cicchetti, 2010) , some of the unanticipated early effects we are observing in depressive symptoms might be expected to translate into universal benefits in other, related developmental domains later in elementary school (reduced academic disengagement/failure and delayed onset of substance use; e.g., Eddy, Reid, Stoolmiller, & Fetrow, 2003; Lochman & Wells, 2004) . With regard to the interaction effects, the effect sizes for the subgroup of children with the highest scores on baseline aggression range from .59 for aggressive fantasies to .32 for attendance. These findings are consistent with other experimental evaluations of school-based interventions that target primarily children's externalizing behavior problems. For example, the most recent report of results from the evaluation of Fast Track showed significant effects for diagnoses and behavior in the externalizing domain for children after Grades 3, 6, and 9 but only for children identified at kindergarten at highest behavioral risk (using parent and teacher reports; CPPRG, 2007) . In addition, Van Lier, Muthen, van der Sar, and Crijnen (2004) reported positive impacts of the Good Behavior Game on trajectories of conduct problems from Grades 1 to 3 for children with the highest levels of disruptive behavior at baseline (Fall, first grade), with only somewhat larger effects than those reported here (ES ϭ .55).\nEach of these studies reported the impact of interventions that target one domain of functioning (i.e., externalizing behavior problems) on outcomes in the same domain for children at highest risk at baseline. The present study, in contrast, reports significant experimental impacts of a universal, integrated, school-based social-emotional learning and literacy intervention for a subgroup of children identified based on functioning in one developmental domain on outcomes in another developmental domain. In other words, here we report effects of this integrated intervention on children identified at baseline as having serious behavioral difficulties on outcomes in the academic domain. The effects of 4Rs for children with the highest scores on the baseline aggression index on outcomes in the academic domain ranged in size from .31 (reading achievement) to .40 for teacher reports of academic skills, which represents approximately one third of a year of regular gain in reading for children of similar age (Hill, Bloom, Black, & Lipsey, 2008) .\nWe are still several years away from being able to report on the full developmental cascade effects of the 4Rs intervention, but this report of effects on individual children across domains of functioning after 1 year represents an important, and we believe valuable, first step in establishing a better understanding of what is achievable by a schoolwide intervention, such as the 4Rs, in its earliest stages of unfolding. This is especially true in light of the relation of these results after 1 year to the results after 2 years of intervention. We now know that, after 2 years of 4Rs implementation, the positive main effects reported here regarding children's hostile attributional bias and depressive symptoms are not only maintained but have expanded to three additional outcomes for which we expect longer term or cascading effects: teacher reports of children's aggressive and socially competent behavior and children's attention problems. These results provide initial support for the developmental cascades concept. In addition, interaction effects by baseline child aggression persist for standardized reading and are extended to math scores (Jones et al., in press) .\nAlthough the present study has several strengths, our conclusions are tempered by several limitations. First, our ability to draw definitive conclusions from this set of findings is limited, given that we examined 13 outcomes and found main effects on only two outcomes and interaction effects on four other outcomes. Furthermore, there was only one significant effect in the social-cognitive processes domain identified as highly proximal to the intervention's program theory. Together with our 2-year results (Jones et al., in press), these findings suggest that aspects of children's social-cognitive processes and mental health outcomes may themselves operate in a cascading manner requiring longer term, sustained intervention.\nA second factor to consider is program implementation. As described in the Method section, there was variability in implementation of the 4Rs Program and the quantity of program implementation was below benchmarks, with teachers on average implementing 4Rs lessons for 40 min (rather than 60 min) per week and completing on average three quarters of a lesson (instead of one). In addition, substantial program-like activity in the broad domain of social and character development was reported in control schools. This is not surprising, given the dramatic growth in interest in social-emotional learning in the last decade (Payton et al., 2008) . Based on these data, intervention schools still reported implementing significantly more social and character activities, particularly and not surprisingly activities focused on violence prevention and social and emotional development (we assume with better training and more ongoing support). These implementation data underscore the need to examine intervention effects in a manner that accounts both for dosage and for implementation of similar forms of intervention activities in control schools using sophisticated methodological tools (e.g., propensity scores; Lochman, Boxmeyer, Powell, Roth, & Windle, 2006) .\nThere are a number of additional limitations to this study, including the relatively low consent rate (ϳ62%) and the rate of attrition between baseline and follow-up (7.2%). It is important to note, however, that these rates did not differ significantly by intervention group and that other sites participating in the Social and Character Development Research Network reported similar experiences. Finally, some of our measures had relatively low reliability (e.g., aggressive fantasies and depressive symptoms), and this potentially undermines precision in our intervention estimates due to measurement error.\nDespite these limitations, this report of first-year impacts of an integrated, social-emotional and literacy intervention, combined with our knowledge of sustained effects on hostile attributional bias and depression as well as expanded effects after a second year on aggression, social competence, and attention problems (Jones et al., in press ), provides evidence that this intervention may be initiating a positive developmental cascade both in the general population of students and among those at highest behavioral risk. After 1 school year, 4Rs had positive effects for our population of children on two outcomes and subgroup effects in the academic domain for children identified as aggressive at the outset of the study. In addition, these effects appear to expand to other outcomes after 2 years. Together, the findings underscore the potential clinical significance of the 4Rs Program in two important ways. First, clinical treatments for mental health problems are typically costly and can be prohibitively so for low-income and underserved populations. The body of findings emerging from our research suggests the 4Rs Program may prove to be a low-cost preventive intervention strategy that could reduce known social-cognitive, socialemotional, and behavioral risks for long-term mental health outcomes among the general population of students. Relative to other school-based social-emotional learning programs, the 4Rs carries a comparable or lower price per student (Foster, Jones, & Conduct Problems Prevention Research Group, 2006 ). An important cautionary note, however, is that despite its relatively low price, the 4Rs Program does require a commitment and investment of time and resources that could limit its generalizability and replicability outside an evaluation study such as this.\nSecond, given the mounting evidence linking improved academic performance with social competencies, attentional capacities, and lower externalizing behavior, our findings suggest that integrating social-emotional learning with literacy has the potential to address academic and mental health constraints on learning as well as the broader adaptation of children at greatest risk based on early behavior problems. In sum, whole-school integrated social-emotional learning and literacy interventions can be an effective way for schools to address the social-emotional wellbeing of all students and, by improving academic functioning, reduce the likelihood of future mental health and academic problems."}]