[{"section_title": "Abstract", "text": "Role of the Funder/Sponsor: The funding organizations had no role in the design and conduct of the study; collection, management, analysis, and interpretation of the data; preparation, review, or approval of the manuscript; and decision to submit the manuscript for publication Additional Contributions: We would like to thank NEALS and the neurologists who responded to the survey."}, {"section_title": "", "text": "1. Ayton S, Faux NG, Bush AI; Alzheimer's Disease Neuroimaging Initiative. Ferritin levels in the cerebrospinal fluid predict Alzheimer's disease outcomes and are regulated by APOE. Nat Commun. 2015;6:6760."}, {"section_title": "2.", "text": "Alzheimer Disease Neuroimaging Initiative (ADNI) database http://adni.loni.usc .edu. Accessed July 15, 2014."}, {"section_title": "3.", "text": "Weiner MW, Veitch DP, Aisen PS, et al; Alzheimer's Disease Neuroimaging Initiative. The Alzheimer's Disease Neuroimaging Initiative: a review of papers published since its inception. Alzheimers Dement. 2012;8(1)(suppl):S1-S68. "}, {"section_title": "Estévez-González", "text": ""}, {"section_title": "Use of Genetic Testing in Amyotrophic Lateral Sclerosis by Neurologists", "text": "There have been a number of publications describing the important role of genetic counseling in amyotrophic lateral sclerosis (ALS). 1, 2 While such attempts at guiding who should undergo genetic testing are welcome, they are put forth in a vacuum because there are no data on where ALS neurologists stand in terms of genetic testing and counseling for the disease, and in terms of what is considered to be familial and sporadic ALS. 3 We attempted to fill this gap by surveying members of the Northeast Amyotrophic Lateral Sclerosis Consortium (NEALS, http://www.alsconsortium.org), one of the largest clinical research organizations for ALS. We sought to understand in which situations genetic testing is used, which genes are tested for, and the attitudes of respondents toward genetic testing and counseling.\nMethods | The survey was sent via email on June 20, 2016, to 134 principal investigators who are members of NEALS. The deadline for survey completion was July 29, 2016. Data were collated and analyzed using Microsoft Excel (Table) . The NIH Office of Human Subjects Research Protection has determined that this type of research falls under exemption for institutional review board approval. One respondent did not perform genetic testing for clinical trials or everyday clinical practice, and 1 respondent did not specify which genes the site tested for. Of the 41 respondents who specified which genes were tested for, 100% screened for C9ORF72 (Figure) . The next most common gene screened for was SOD1, with 31 respondents (75.6%). Other genes reported are shown, by prevalence in testing, in the Figure. Of note, 2 respondents reported testing for Ataxin 2 in addition to other genes.\nJust fewer than half of respondents (n = 21; 48.8%) reported using next-generation sequencing techniques at their sites. More than half of respondents (n = 24; 55.8%) reported using panel testing. Only 14 of the 24 respondents (58.3%) who reported using Sanger sequencing-based panel testing believed it to be cost-effective. Most respondents (n = 42; 97.7%) provide genetic counseling to ALS patients, with only 1 respondent denying the use of genetic counseling. Finally, the overwhelming majority of respondents (n = 39; 90.7%) would change their attitude toward genetic testing if an effective therapy for ALS became available.\nDiscussion | The importance of genetic testing in ALS is shown by the response to the question on whether future gene therapy trials will influence the practice of genetic testing. Almost uniformly the answer was yes. Our data show that although current efforts at genetic counseling guidelines for ALS patients are important, the pace of discovery in the genetic field means that these guidelines have a relatively short shelf life. Guideline documents need to operate in a dynamic manner with yearly updates, rather than being viewed as dogma. Percentage of respondents who reported testing for each gene specified in the survey. The total number of respondents who reported testing for specific ALS genes was 41 (of 43 who responded to the survey).\nLetters"}]