[{"section_title": "Abstract", "text": "Abstract Late-onset Alzheimer's disease (LOAD) is known to have a complex, oligogenic etiology, with considerable genetic heterogeneity. We investigated the influence of genetic interactions between genes in the Alzheimer's disease (AD) pathway on amyloid-beta (Ab) deposition as measured by PiB or AV-45 ligand positron emission tomography (PET) to aid in understanding LOAD's genetic etiology. Subsets of the Alzheimer's Disease Neuroimaging Initiative (ADNI) cohorts were used for discovery and for two independent validation analyses.\nA significant interaction between RYR3 and CACNA1C was confirmed in all three of the independent ADNI datasets. Both genes encode calcium channels expressed in the brain. The results shown here support previous animal studies implicating interactions between these calcium channels in amyloidogenesis and suggest that the pathological cascade of this disease may be modified by interactions in the amyloid-calcium axis. Future work focusing on the mechanisms of such relationships may inform targets for clinical intervention."}, {"section_title": "", "text": "A significant interaction between RYR3 and CACNA1C was confirmed in all three of the independent ADNI datasets. Both genes encode calcium channels expressed in the brain. The results shown here support previous animal studies implicating interactions between these calcium channels in amyloidogenesis and suggest that the pathological cascade of this disease may be modified by interactions in the amyloid-calcium axis. Future work focusing on the mechanisms of such relationships may inform targets for clinical intervention."}, {"section_title": "Background", "text": "The complex genetic etiology of late-onset Alzheimer's disease (LOAD) has proven difficult to unravel, with the top ten genes associated with LOAD explaining only 35 % of the variability in disease risk (Naj et al. 2011) . For complex diseases like LOAD, it is imperative that we look beyond single marker analyses to explore biologically plausible interactions and that we address the considerable heterogeneity present in disease status information by using meaningful intermediate phenotypes. In this study, we investigate the influence of interactions between genes previously associated with Alzheimer's disease (AD) on amyloid-beta (Ab) load in an effort to better understand the genetic etiology of Ab deposition and, by extension, risk for LOAD.\nPrevious gene-gene interaction studies in LOAD have implicated interactions between CR1 and APOE using quantified Ab positron emission tomography (PET) as the outcome variable (Thambisetty et al. 2012) , and between cholesterol trafficking genes (Rodríguez-Rodríguez et al. 2009 , 2010 and tau phosphorylation genes ) in case-control analyses. These studies indicate the important information that can be garnered from For the Alzheimer's Disease Neuroimaging Initiative. Data used in preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.ucla.edu). As such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data, but did not participate in analysis or writing of this report. A complete listing of ADNI investigators can be found at: http://adni.loni.ucla.edu/wp-content/uploads/how_to_apply/ADNI_ Acknowledgement_List.pdf Electronic supplementary material The online version of this article (doi:10.1007/s00439-013-1354-8) contains supplementary material, which is available to authorized users. investigating higher-order genetic relationships in complex diseases like LOAD. The current study aims to conduct a more comprehensive analysis of gene-gene interactions between variants associated with AD risk, while leveraging quantitative measurements of AD-associated neuropathology, which can increase statistical power (Potkin et al. 2009 ). For brain-based diseases, quantitative data can be derived from neuroimaging, such as PET. PET imaging can be used to quantify levels of amyloid in the brain by utilizing a radiotracer such as florbetapir ( 18 F-AV-45 or AV-45) or and Pittsburgh Compound-B (PiB, N-methyl-[\n11 C]2-(4 0 -methylaminophenyl)-6-hydroxybenzothiazole). These tracers have been shown to selectively bind Ab in living patients, have been correlated with disease onset and progression, have been validated in postmortem samples, and more recently were included as biomarkers for classifying patients with AD in research studies (Ikonomovic et al. 2008; Clark et al. 2011; Albert et al. 2011; Sperling et al. 2011) .\nGenetic interaction studies are prone to the problem of overfitting, which can result in spurious associations that are not replicated in independent datasets. This problem is exaggerated when large-scale (e.g., genome-wide) explorations are conducted, since the number of false-positive findings is greatly increased. However, by focusing on interactions between genes known to be involved in disease-related biological processes, one can maximize a priori biological plausibility and post hoc interpretability while reducing the multiple testing correction threshold and computational burden (Pattin and Moore 2008) . In this study, we investigated genes from the AD pathway of the Kyoto Encyclopedia of Genes and Genomes (KEGG) database, which is a collection of manually curated pathways based on published literature for metabolism, genetic and environmental information processing, and human diseases, including AD (Kanehisa and Goto 2000; Kanehisa et al. 2012) . The AD KEGG pathway (hsa05010) includes genes related to amyloid and tau processing, apoptosis, mitochondrial dysfunction, free radical production, and calcium homeostasis (http://www.genome.jp/ kegg/pathway/hsa/hsa05010.html).\nAnother challenge for genetic interaction analysis concerns the biological ''unit'' or level at which one tries to replicate or validate findings. Attempts to replicate at the SNP level are rife with problems unrelated to verification of a true biological effect (Neale and Sham 2004) . SNPlevel replication is problematic largely due to the fact that most genotyped SNPs are not functional and merely tag a putative functional element. Differences in linkage disequilibrium patterns across samples from a single population can result in variable efficiency of tag SNPs and even reverse directionality of effects, wherein a tag SNP is linked to the risk allele in one sample but the reference or protective allele in another sample (Neale and Sham 2004) .\nLikewise, allelic heterogeneity, in which multiple SNPs in a gene have a similar effect, can result in reduced statistical power and a failure to confirm an association with any particular SNP, even when all are associated with the disease of interest (Neale and Sham 2004) . Indeed, since SNPs generally exert their effects either by altering the structure of a protein, the probability of transcription, or the efficiency of translation, their biological relevance is properly interpreted at the gene level (i.e., whether a protein is functional, whether it is present in deficient or excessive levels, etc.). Thus, in this study, we use a genebased approach to validate significant interactions from the discovery set in two additional independent datasets. A similar replication approach was previously successful in validating a novel gene-gene interaction underlying highdensity lipoprotein cholesterol (Ma et al. 2012 (Ma et al. , 2013 ."}, {"section_title": "Methods", "text": "Data used in the preparation of this article were obtained from the ADNI database (adni.loni.ucla.edu). The ADNI was launched in 2003 by the National Institute on Aging (NIA), the National Institute of Biomedical Imaging and Bioengineering (NIBIB), the Food and Drug Administration (FDA), private pharmaceutical companies, and nonprofit organizations, as a $60 million, 5-year public-private partnership. The primary goal of ADNI has been to test whether serial magnetic resonance imaging (MRI), PET, other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of MCI and early AD. Determination of sensitive and specific markers of very early AD progression is intended to aid researchers and clinicians to develop new treatments and monitor their effectiveness, as well as lessen the time and cost of clinical trials.\nThe Principal Investigator of this initiative is Michael W. Weiner, MD, VA Medical Center and University of California-San Francisco. ADNI is the result of efforts of many co-investigators from a broad range of academic institutions and private corporations, and subjects have been recruited from over 50 sites across the USA and Canada. The initial goal of ADNI was to recruit 800 adults, ages 55-90 years, to participate in the research, approximately 200 cognitively normal older individuals to be followed for 3 years, 400 people with MCI to be followed for 3 years, and 200 people with early stage LOAD to be followed for 2 years. For up-to-date information, see ww.adni-info.org."}, {"section_title": "Subjects", "text": "Participants were enrolled based on the criteria outlined in the ADNI protocols (http://www.adni-info.org/Scientists/ AboutADNI.aspx; http://adni.loni.ucla.edu/wp-content/ uploads/2008/07/ADNI2_Protocol_FINAL_20100917.pdf; http://adni.loni.ucla.edu/wp-content/uploads/2008/07/ADNI_ Go_Protocol.pdf). Only subjects in the ADNI cohorts who had both genotype data and either PiB or AV-45 PET scans and were Caucasian (to minimize population stratification) were included in analyses. Subjects from ADNI-1 with AV-45 PET imaging data were included in the discovery data set. The Stage 1 validation dataset included subjects from ADNI-GO and ADNI-2 with AV-45 PET imaging data, excluding all participants who were also present in the discovery dataset. The Stage 2 validation dataset included subjects from ADNI-1 with PiB PET imaging data, while excluding subjects from either of the previous two datasets. Demographic data are presented in Table 1 ."}, {"section_title": "Genotyping", "text": "Genotyping in the ADNI-1 discovery dataset was performed using the Illumina Infinium Human-610-Quad BeadChip. Quality control (QC) was performed using PLINK software [version 1.07; (Purcell et al. 2007) ], excluding SNPs with a genotyping efficiency \\95 %, out of Hardy-Weinberg equilibrium (p \\ 1 9 10 -6 ), or with a minor allele frequency (MAF) of \\5 %. Subjects were excluded if they had a genotyping call rate \\95 %, if there was a reported-versus-genetic sex inconsistency, or if relatedness with another subject was established (PI_HAT [ 0.5). After QC, 515,839 SNPs and 163 subjects remained available for discovery analyses. For the Stage 1 validation dataset, DNA samples from ADNI-GO and ADNI-2 were genotyped on the Illumina HumanOmni1-Quadv1 array. QC was performed in PLINK with the same criteria as the discovery data set, resulting in 605,317 SNPs and 373 subjects available for validation analyses. The same QC measures were applied to the Stage 2 validation dataset (leaving 95 subjects and 515,839 SNPs)."}, {"section_title": "Effects of interactions on amyloid deposition", "text": ""}, {"section_title": "Quantification of amyloid deposition", "text": "Amyloid deposition was quantified using the AV-45 or PiB tracers. Methods relating to PiB data acquisition and calculation have been extensively described (Jagust et al. 2009 (Jagust et al. , 2010 , as have methods relating to AV-45 data acquisition (Landau and Jagust 2012) . In summary, for both datasets, standardized uptake value ratio (SUVR) images were normalized to the cerebellum (PiB) or cerebellar gray matter (AV-45) and co-registered to the subjectspecific T1-weighted structural MRI images. A composite score was calculated as the mean normalized SUVR across the anterior cingulate, frontal, lateral temporal, middle temporal, parietal, precuneus, and occipital cortices (PiB) and the cingulate (anterior and posterior), frontal, lateral temporal, middle temporal, and lateral parietal (including the precuneus and supramarginal gyrus) cortices (AV-45). These regions were parcellated using FreeSurfer image analysis suite (Fischl 2012) . The composite score for each subject was used as the outcome measure of amyloid deposition in all three analyses."}, {"section_title": "SNP-SNP interaction analysis: discovery", "text": "Genotype data that passed QC were analyzed in an interaction analysis using the publicly available InterSNP program (Herold et al. 2009 ). We tested the hypothesis that gene-gene interactions explain variance in amyloid pathology beyond variance related to age, sex, education, disease status, and APOE genotype. Only SNPs that were in a gene in the AD KEGG pathway were analyzed, and only interactions between (not within) genes were tested. To maximize post hoc biological interpretability, only SNPs that were in a 5 0 untranslated region (UTR), 3 0 UTR, intron, or exon of a gene (annotated using the product support files available for download at Illumina.com) were included. 1196 SNPs that mapped to 43 genes were available in the discovery dataset (Online resource 1). Across all possible gene-gene pairs from the AD KEGG pathway, 634,864 SNP-SNP interactions were tested. All SNPs were modeled as binary variables (minor allele absent or present) to attenuate the problem of data sparsity commonly confronted in interaction analyses. The outcome measure was the composite mean normalized SUVR (as described above). The covariates included were: baseline age in years, last diagnosis recorded as of the January 2013 data release (1 = Normal, 2 = MCI, 3 = AD), education in years, sex, and APOE status (number of e4 risk alleles). SNP-SNP interaction effects were explored using a genotypic model and a linear regression framework for quantitative traits (Herold et al. 2009 ). Interactions were considered significant if their p value exceeded a moderate threshold of a \\ 5 9 10 -6 . A t test statistic and R 2 effect size for each significant SNP-SNP interaction were calculated in SPSS (http://www-01.ibm.com/software/analytics/spss/) using the same covariate, phenotype, and genotype files as used in InterSNP. Significant effects were plotted in SPSS as well."}, {"section_title": "SNP-SNP interaction analysis: Stage 1 validation", "text": "We used gene-based replication strategy in our subsequent validation analyses (Neale and Sham 2004) , such that only gene-gene pairs represented in significant interactions from discovery analyses were tested in the first validation set. To further reduce multiple testing, within each gene, we selected only independent SNPs using LD pruning implemented in PLINK with an r 2 threshold of 0.6\nðplink --indep-pairwise 50 5 0:6Þ, resulting in 31,068 total SNP-SNP tests. Pairwise LD was calculated with SNAP (SNP Annotation and Proxy Search, available at http://www. broadinstitute.org/mpg/snap/) using data from the European (CEU) population in 1000 Genomes Pilot 1. We used a conservative Bonferroni correction for gene-level multiple comparisons based on the number of SNP-SNP interactions tested within each gene-gene pair. SPSS was used to calculate the t test statistic and R 2 effect size and to plot the effects."}, {"section_title": "SNP-SNP interaction analysis: Stage 2 validation", "text": "Further validation of the gene-gene interaction was conducted in a post hoc analysis. We tested the SNPs that passed correction in the discovery and Stage 1 validation datasets that corresponded to the gene-gene interaction validated in Stage 1. Interactions between the SNPs were tested in SPSS using the identical model with the same covariates as in the previous analyses with PiB SUVR measure as the outcome variable. A conservative Bonferroni correction for the four SNP-SNP interactions tested was employed (p \\ 0.0125). SPSS was used to calculate the t test statistic and R 2 effect size and to plot the effects of these interactions as well."}, {"section_title": "Results", "text": ""}, {"section_title": "Discovery dataset", "text": "The model we tested included the major AD risk factors of age, sex, education, diagnosis, and APOE status, such that all significant interaction terms explained additional variance beyond these strong risk factors. Six SNP-SNP pairs that mapped to four gene-gene interactions reached significance at a \\ 5 9 10 -6 : CACNA1C-ATF6 (2 SNP-SNP interactions), NOS1-GNAQ (1 SNP-SNP interaction), PLCB1-CACNA1C (2 SNP-SNP interactions), and RYR3-CACNA1C (1 SNP-SNP interaction).\nStage 1 validation dataset SNP-SNP pairs that mapped to the four gene-gene interactions found in discovery were tested in the Stage 1 validation data set [31,068 total independent tests: CACNA1C-ATF6 (1,010 tests), NOS1-GNAQ (364 tests), PLCB1-CACNA1C (12,019 tests), and RYR3-CACNA1C (17,675 tests)]. One SNP-SNP interaction mapping to RYR3-CACNA1C was significant after Bonferroni correction ( Table 2 ). The effect of this interaction was in the same direction for both discovery and Stage 1 validation (Table 2, b discovery = 0.42679 and b validation = 0.24924), and as seen in Fig. 1 . In both the discovery and Stage 1 validation interaction models, a minor allele in both genes corresponded to higher amyloid load ( Fig. 1) versus a minor allele in only one or none of the genes. This interaction explained 9 and 4 % of the variance in amyloid load in the discovery and Stage 1 validation datasets, respectively."}, {"section_title": "Stage 2 validation dataset", "text": "The four SNPs from the previously validated gene-gene pair (RYR3-CACNA1C) were tested for interactions in the Stage 2 validation dataset (four total independent tests). None of these SNPs were in LD with each other (using a threshold of r 2 [ 0.6). One SNP-SNP interaction (rs16972835-rs7132154) was significant after Bonferroni correction (p = 0.0077, Table 2 , Online resource 2). The effect of this interaction was in the same direction as the interactions found in the discovery and Stage 1 validation (Table 2 , b discovery = 0.43, b Stage1-validation = 0.25, b Stage2-validation = 0.45), and as seen in Fig. 1 , in all three datasets, a minor allele in both genes corresponded to higher amyloid load (Fig. 1) versus a minor allele in only one or none of the genes. This interaction explained 6 % of the variance in amyloid load in the Stage 2 validation dataset (Table 2) ."}, {"section_title": "Discussion", "text": ""}, {"section_title": "Calcium homeostasis and its relationship to amyloidogenesis", "text": "In the present work, a genetic interaction between the RYR3 and CACNA1C genes explained variance in amyloid deposition above and beyond other major known risk factors for LOAD. Such an interaction is biologically feasible given that the proteins encoded by CACNA1C and RYR3 interact to maintain calcium homeostasis necessary for normal brain function (Ouardouz et al. 2003; Kim et al. 2007) and that many studies outlined below have shown a relationship between calcium homeostasis and amyloidogenesis, whereby increased intracellular calcium levels lead to increased Ab deposition. An increase in Ab is considered a key event in AD etiology (e.g., Jack et al. 2013) , and calcium dysregulation is thought to assist in amyloid formation and deposition and has been hypothesized to be very important in the etiology of AD (Berridge 2010) . Increases in intracellular calcium have been shown to increase Ab production in human cell lines (Querfurth and Selkoe 1994) . High levels of intracellular calcium also have been shown to induce transient phosphorylation of amyloid precursor protein in neurons, leading to increased production of Ab (Pierrot et al. 2006) . Lastly, calcium ions themselves have been shown to promote the formation of neurotoxic Ab oligomers in vitro (Itkin et al. 2011) . Our findings are further strengthened by accumulating evidence that RYR3 modulates Ab plaque deposition (Kelliher et al. 1999; Supnet et al. 2006; Oulès et al. 2012) and that CACNA1C increases intracellular calcium levels in the presence of Ab (Mattson et al. 1992; Ueda et al. 1997; Scragg et al. 2005) .\nThis interaction could have an important clinical application, since both proteins encoded by these two genes are calcium channels that have FDA-approved channel blocking drugs and blocking either channel has been proposed as a therapy for AD pathology (Fruen et al. 1997; Anekonda et al. 2011) . A combination of these therapies could be investigated as an enhanced approach to AD treatment."}, {"section_title": "RYR3 and CACNA1C", "text": "RYR3 encodes ryanodine receptor (RyR)-3, which is a receptor expressed in the brain (Giannini 1995 ) located on the endoplasmic reticulum (ER) that regulates intracellular calcium homeostasis (Berridge 2010) . CACNA1C encodes the pore-forming alpha 1C subunit of voltage-dependent L-type calcium channels (LTCCs) which are also expressed in the brain (Perez-Reyes et al. 1990 ). The major characteristics of this channel, including voltage sensitivity, ion selectivity, and pharmacological responsivity to calcium channel blockers, are encoded by CACNA1C (Bhat et al. 2012) . This subunit forms a pore in the cell membrane through which calcium ions flow into the cell (Bhat et al. 2012 )."}, {"section_title": "RYR3 in AD pathogenesis", "text": "In animal models of AD, the relationship between RyR and Ab has been extensively explored. Transgenic mice which overexpress the precursor of Ab (APP, encoding amyloid precursor protein (APP)) have increased RyR expression in their neuroblastoma cell lines (Oulès et al. 2012) . Specifically, extracellular amyloid has been shown to selectively increase RyR-3 (but not RyR-1 or -2) isoform expression in cortical neurons of both wild type and AD-model mice (Supnet et al. 2006) . Transgenic mice which harbor human APP mutations have increased RyR expression in isolated cortical neurons, and this overexpression of RyR disrupts calcium homeostasis by increasing ER calcium release (Oulès et al. 2012) . Furthermore, this relationship between RyR and Ab has been shown to be bi-directional, such that RyRs can also affect Ab levels. Dantrolene is a pharmacological agent that blocks calcium release from RyR-1 and RyR-3 and has been used in cell and animal models to diminish cell death resulting from neuronal injury (Fruen Fig. 1 The effect of genetic interactions between RYR3 and CAC-NA1C on amyloid deposition. In all three datasets, a minor allele in both genes corresponded to higher amyloid load versus a minor allele in only one or none of the genes. Bars represent one standard error. a Effect of RYR3 (rs16972835) and CACNA1C (rs2302729) on amyloid deposition (measured by AV-45 ligand) in discovery dataset. . 1997) . Interestingly, when it was used to block RyR and decrease calcium release in mouse models which either overexpressed APP or had an APP mutation, this decrease in calcium level was shown to reduce levels of intracellular and extracellular Ab, as well as the number of Ab plaques (Oulès et al. 2012 ). Thus, RyR-induced calcium levels seem to influence Ab levels. This has also been shown in human cell lines: in human neuroglioma and embryonic cell lines transfected with APP, Ab production increased as levels of intracellular calcium increased and RyR-mediated calcium release increased (Querfurth and Selkoe 1994; Buxbaum et al. 1994) . In summary, the existing literature indicates that there is a bi-directional relationship between RyR and Ab, such that increased Ab has been associated with increased RyR expression, and RyR-driven calcium release has been associated with increased Ab levels."}, {"section_title": "CACNA1C in AD pathogenesis", "text": "CACNA1C encodes the pore-forming subunit of voltagedependent LTCCs. Its role in AD etiology can be better understood through its relationship with Ab and its effects on calcium dysregulation. In rat cortical cell lines, the presence of Ab increased calcium uptake by LTCCs by almost twofold (Ueda et al. 1997) . In human cerebral cortical cell lines, Ab destabilized neuronal calcium regulation and rendered neurons more vulnerable to environmental stimuli that elevate intracellular calcium levels (Mattson et al. 1992) . Up-regulation of the expression of CACNA1C was observed in human neuroblastoma cell lines after treatment with Ab (Anekonda et al. 2011) , and Ab promotes the insertion of the subunit encoded by CACNA1C into the plasma membrane (Scragg et al. 2005) . In summary, Ab modulates LTCC function to increase intracellular calcium and as described above in ''Calcium homeostasis and its relationship to amyloidogenesis'', this increase in intracellular calcium can further increase Ab production and deposition."}, {"section_title": "RYR3-CACNA1C interaction and amyloid load", "text": "Both of the products of RYR3 and CACNA1C have been shown to have a relationship with cellular Ab. These products have also been shown to physically interact with each other: in a study of cerebellar granule cells, RyRs and LTCCs have been shown to be functionally coupled, with RyRs controlling the activity of LTCCs (Chavis et al. 1996) . In a separate study in in vitro rat neuronal cell lines, immunoprecipitation revealed an association between LTCCs and RyRs, and immunohistochemistry confirmed the co-localization of LTCC and RyR clusters on axons (Ouardouz et al. 2003) . In that same study, depolarization sensed by LTCCs activated RyRs, which caused the release of toxic levels of calcium (Ouardouz et al. 2003) . This interaction was also demonstrated in a study of rat hippocampal tissue, where a physical interaction between the N-terminus of the LTCC and the N-terminus of a RyR was observed (Kim et al. 2007 ). Finally, an interaction between RyRs and LTCCs has been observed in cardiac and skeletal muscle, where these proteins are also expressed (Cannell and Soeller 1997; Squecco et al. 2004) .\nWith the evidence of physical interaction between the RyR and LTCC proteins and the evidence outlined above relating RyR, LTCC, calcium release, and Ab to each other, the statistical genetic interaction we report herein might be reflective of causal variants in RYR3 and CAC-NA1C interacting to cause disruption of calcium homeostasis and to increase intracellular calcium levels leading to increased Ab production and deposition as detected by PET."}, {"section_title": "Caveats", "text": "Fine-mapping and functional analysis of the SNPs identified could help clarify the implications of these statistical genetic interactions and provide greater specificity when attempting to leverage these results to identify targets for clinical intervention. Because we validated our results at the gene-gene level and not the SNP-SNP level, further delving into the function of each of these SNPs or the causal variant these SNPs are tagging would be necessary to understand whether the discovery and validation models represent the same effect. For example, if each SNP increases the expression of its respective gene, we could conclude that the effect was truly replicated and that increased expression of both genes is associated with increased amyloid load (regardless of which SNP caused the overexpression). In summary, the effect that each SNP has on expression level or function would have to be explored to determine true replication of the effect.\nThe exact SNP-SNP interactions do not replicate across the samples, but we would argue (as others have) this lack of replication does not necessarily indicate a false positive result and may instead be due to one or several biological reasons (Neale and Sham 2004) , including allelic heterogeneity (wherein different alleles at the same locus are each responsible for increased disease risk in different subjects), differences in minor allele frequency, or differences in LD structure across samples. The power to replicate at the SNP level drops dramatically with a change in allele frequency between datasets (Greene et al. 2009 ). Differences in LD structure across the two samples between each tag SNP and the causal variant could cause the same high-risk allele to have different patterns of association with the marker alleles (Neale and Sham 2004) .\nThe gene-based replication approach we employed here attenuates these issues and has been proposed as the ''gold standard'' for replication and the ''natural end point for association analysis'' (Neale and Sham 2004) . This is perhaps especially important in gene-gene interaction studies where these issues are amplified.\nThe present results must be interpreted within the framework of our statistical models. In all cases, we included covariates related to disease status and progression, including age, education, diagnosis, sex, and APOE status. Thus, all significant interactions explained variance beyond known predictors of risk, and while the contributions of these interactions appear to be meaningful, the implications should not be extended without considering the variance accounted for by the other factors in our model. The interactions in this study represent dominant effects (carriers versus non-carriers), and the results have been interpreted accordingly. We did not test mitochondrial genes in this study. This could be explored in a further analysis."}, {"section_title": "Conclusion", "text": "In this study, we have explored the relationship between genes within the AD pathway and their relationships to Ab plaque levels in humans. We found evidence for a statistical association between calcium dysregulation and Ab deposition as detected by PET amyloid imaging. In light of prior studies associating the products of RYR3 and CAC-NA1C with each other and with AD pathology, this result is certainly biologically plausible. This interaction is of particular clinical significance because pharmacological manipulation of the two channels involved is feasible for future AD treatment. Combined therapy, using LTCC and RyR blockers, could first be tested in cell lines and animal models to determine its effect on Ab plaque load and neuronal cell death."}]