[{"section_title": "Introduction", "text": "Environmental regulation of manure application poses a particular challenge to regulators. Nutrients contained in manure, particularly nitrogen and phosphorus, can degrade water quality if they are overapplied to farmland and enter water resources through runoff or leaching. Because most livestock are not forced to internalize the social costs of their pollution, and because manure transportation is costly, they may have an incentive to over-apply nutrients. The goal of regulation is therefore to prevent run-off by limiting nutrient application to agronomic rates. The regulatory challenge arises because even if limits are placed on nutrient application rates, in most situations regulators are unlikely to be able to monitor compliance with prescribed application rates through direct observation or testing. Perhaps recognizing the costliness and general infeasibility of such an approach, state and federal policies instead encourage or require livestock operations to submit \"nutrient management plans\" (NMPs) stating how much manure and fertilizer they will apply to each acre of land. Regulators can observe these plans, limiting their oversight costs if the plans are followed. However, the plans are not proof of behavior. If regulatory authorities only require these plans as proof of regulatory compliance and do not engage in further oversight, there is little incentive for livestock operators to change their nutrient application behaviors. The question is whether NMPs are useful predictors of nutrient management activities. If they are not useful predictors by themselves, are there contexts in which they are? In this article we use information on both nutrient plans and nutrient management practices in order to ascertain whether there is a difference between planned activities and implemented activities in the livestock sector. We use data from the 2009 ARMS Cost of Production Survey for Hogs on practices which are signals of regulatory compliance (filing a nutrient management plan and soil testing) as well as actions showing compliance (behaviors indicating following the plan like agronomic nutrient application rates). We first evaluate whether farms with NMPs are more likely to exhibit nutrient management behaviors than those without plans, controlling for pertinent potential confounders. Next, we estimate the amounts of nutrients applied on farm in the form of manure or commercial fertilizer as well as the absorptive capacity of the crops and land on the farm. In this way we can examine whether farms are over-applying nutrients, and whether farms with NMPS are less likely to do so. Understanding nutrient management behavior of farms with CNMPs allows us to gain insight on the effectiveness of current regulation, and whether there is a need to upgrade existing regulation or enforcement. The rest of this paper is as follows. Further background information is provided in Section 2, Sections 3 and 4 discusses the empirical strategy and data used in the analysis, Section 5 provides a discussion of the results, and Section 6 concludes."}, {"section_title": "Background", "text": "Nutrients are necessary for crop growth and are a natural by-product of livestock production. In a traditional farm setting that incorporates crop and livestock production, nutrients are removed from the soil by plants, which are fed to livestock. The livestock then replenish the soil nutrients with manure. However, this nutrient balance may break down at the farm or region level. Farms increasingly specialize in either crop or livestock production, hence farm-level nutrient production may not match farm-level nutrient needs (Kellogg, Lander, Moffitt, and Gollehon, 2000). Certain types of livestock agriculture have also become more geographically concentrated, occasionally in regions distant from the locus of crop production. Simultaneously, there has been a continuing growth in size of livestock operations; these larger operations place greater emphasis on intensive production methods that result in increased concentrations of nutrients (Johnson et al. 1999). If the balance of nutrients becomes lopsided in terms of the crop uptake capacity or the amount produced by livestock, this can lead to pollution problems. To avoid over-application, livestock facility operators with less land than needed may ship manure to other locations, or adopt a number of other practices. However, transporting manure off-farm is expensive and crop farmers' willingness to pay for or even accept manure for free is often very low. Hence, manure has little value in many regions, creating an incentive for some livestock producers to treat it as a waste and apply it above agronomically-appropriate rates. Even in the absence of manure production, research suggests that farmers apply more fertilizer than needed to ensure their optimum yield (Beegle et al. 2000, Lawley et al. 2009. Application of excess nutrients that cannot be assimilated into the soil can contribute to nutrient run-off. This occurs when land-applied nutrients are carried to nearby water bodies via precipitation, resulting in the impairment of water quality and ecosystem resources. In an effort to control nutrient discharge from farming operations, state and federal authorities have encouraged or required NMPs. NMPS have different requirements in different jurisdictions, but generally require that the amount of nutrients applied as manure and/or commercial fertilizer not exceed the amount of nutrients that can be agronomically utilized by crop and pasture land. In order to assess what these amounts are, NMPs often require nutrient testing. To implement the NMP, farms with excess manure nutrients may need to ship manure off-farm or reduce the amount of commercial fertilizer they apply. NMPs may also require specific methods of manure application, such as injection rather than spraying. CNMPs manage non-point source pollution by requiring CAFOs to minimize nutrient run off, test the nutrient content in the soil, periodically inspect land application equipment, and set-back distances. Some of the practices to minimize nutrient run off include proper storage, application, transfer, and treatment of manure. If effectively enforced, routine nutrient testing in soil would restrict farmers from over applying nutrients. Proper storage of manure would prevent run-off from spills. Other practices include land management to prevent soil erosion and install buffers (NRCS 2005). NMPs can be either voluntary or required. Certain livestock operations are required to adopt NMPs as a condition of receiving a permit to operate. Which livestock farms are required to adopt NMPs depends on a number of factors. Beginning with the adoption of the Clean Water Act (CWA) in the 1970s, the Environmental Protection (EPA) began regulating Concentrated Animal Feeding Operations (CAFOs). These early regulations focused on manure storage at CAFOs and not the application of manure to land. The EPA devolved regulatory authority to states after review of individual states' implementation plans. In 2003 the EPA amended the CAFO rules to provide some oversight of manure application; certain CAFOs may not adopt NMPs, and others that do not obtain permits can avoid certain fines if they have a NMP. To distinguish which farms are CAFOs first requires characterizing whether they are Animal Feeding Operations (AFOs) or not. AFOs are livestock operations that confine animals for more than 45 days per year. AFOs are next characterized as small, medium, or large according to the number of animals present (EPA 2003, p. J-9). Large AFOs are automatically CAFOs; small and medium AFOs may be deemed CAFOs according to the regulatory authority. Only CAFOs with a documented discharge are required to obtain permits. These operations can have discharges under certain conditions if they are following the permit requirements. Operations without permits but with NMPs can also discharge under certain conditions without fear of fines. The Federal CAFO rules only govern a certain percentage of livestock operations. To cover more operations, some states have adopted more stringent regulations requiring more farms to adopt NMPs. For example, Maryland, Delaware, and Virginia have adopted mandatory nutrient management plans for all AFOs (Perez, 2011). "}, {"section_title": "Efficacy of NMPs in Reducing Nutrient Pollution", "text": "While the NMPs have been touted as one of the only methods of reducing nutrient run-off from livestock operations, they suffer, at least on the theoretical level, from problems of monitoring and enforcement. Innes points out that attributing nutrient pollution to individual livestock facilities is impossible without \"a massive army of manure police patrolling a livestock producer's surrounding crop fields to watch and limit the operator's every manure application\" (p. 14, 1999). Noting that such a policy is too costly to be justified, he goes on to propose alternative methods of nutrient pollution reduction (1999 and 2000). Despite these obvious problems with NMPs, there has been little policy focus on alternative methods of nutrient reduction from livestock facilities. Other research supports the suggestion that NMPs are difficult to monitor or enforce. Anecdotal evidence of law evasion suggests some farmers may actively evade state laws. For example, some farmers keep \"double books\", an NMP book to show inspectors and another for themselves (Perez, 2011). Other studies have found that farmers may get a NMP but may not implement their plan on their entire operation if at all (Shepard 2005, Genskow 2012. This in combination with the negligence and lack of enforcement from regulatory authorities has brought into question the ability of regulations to reduce discharges (Sneeringer 2015, Centner 2008. A further question arises as to the consistency of the information in NMPs. Inconsistencies in nutrient management are introduced when NMPs are planned by entities with different agendas. Studies have found differences in NMPs planned by public versus private sector planners where private sectors tend to set higher thresholds for the amount of nutrients that can be applied to the land (Lawley et al. 2009, Perez 2011). Little research has been conducted to determine whether the adoption of NMPs improves environmental outcomes. At best, the EPA conducted an ex ante study before the 2003 CAFO rules to predict improvements in environmental quality from the law. The EPA estimated a 22 percent reduction in nutrient loadings from large and medium CAFOs from the updated law (68 FR 7176-7274). If no ex post research shows that NMPs impact the end goal of environmental quality, we might look instead for research on whether NMPs alter nutrient management behaviors. However, no research that we have found examines whether the adoption of NMPs is accompanied by other nutrient management behaviors."}, {"section_title": "Data", "text": "We use farm-level data from the 2009 Agricultural Resource Management Survey Phase III collected from hog operations in the U.S. to obtain farm level data on farm characteristics and nutrient management practices. The survey consists of 1,208 farms representing 24,350 farms or 90 percent of the hog and pig inventory in the country (Key et al. 2011). In the data, only farms with at least 25 hogs are included in the survey as anything less is considered as raised for private consumption. The survey consists of data from 19 states. Most pertinently, the ARMS includes information on whether or not farms have a NMP. To examine whether other nutrient management practices are correlated with having an NMP, we examine variables for nitrogen and phosphorus testing, whether any manure was applied, the amount of acreage to which manure is applied (if any was applied), and whether nutrients applied via commercial fertilizers were adjusted according to the amount of manure production. These serve as one set of dependent variables. We also analyze whether the NMP is correlated with a reduced probability that a farm overapplies nutrients. However, the specific ARMS in question does not collect information on nutrient application and uptake. Therefore, we estimate these variables. We first estimate the amount of manure nutrients generated on-farm and available for later application using NRCS methods that account for size of animal, manure produced per animal pound, nutrients per unit of manure, nutrient loss through management or evaporation, and manure storage. We next estimate how much of these nutrients were applied on-farm by utilizing an ARMS question on how much manure was shipped off-farm or stored. We use total fertilizer expenditures along with data on crops planted and per unit fertilizer costs to estimate how much commercial fertilizer is applied. The manure and fertilizer application provide us with an estimate of total nutrient applications. Finally, we use data on crop yields in 21 different commodities and 2 pasture categories to estimate the nutrient uptake capacity of the land on the farm. To proxy for enforcement we supplement the ARMS data with information from a variety of sources. First, we examine which states have requirements for more stringent NMPs. In 2009, all states had some requirements for CAFOs to obtain NMPs. However, four states required their permitted CAFOs to obtain Comprehensive Nutrient Management Plans (CNMPs) to NRCS standards. These CNMPs are more detailed and somewhat more involved than standard NMPs. Arkansas, Kentucky, North Carolina, and Wisconsin had these requirements in 2009. This information was obtained by reading state regulations. As a second indicator of enforcement, we include an indicator for whether a farm is in a county with an active \"Total Maximum Daily Load\" (TMDL) program for nutrients. A TMDL is often thought of as a \"pollution diet\" and is implemented when traditional methods of pollution control fail to yield water quality goals. Implementation generally means greater oversight of practices in a watershed. We obtain information of active TMDLs from the EPA's 303d water quality reports. As a final indicator of enforcement, we also include population land density at the county level. Prior research has used population density to account for demands for environmental quality and restrictions in land application of manure due to odor complaints (Lyford andHicks 2001, Ribaudo &Johansson 2007). We obtain population density from the 2007 Census of Population. Other variables may influence whether a farm adopts nutrient management practices. We utilize ARMS variables on size of farm (in terms of animals, sales, and amount of cropland operated); whether or not the farm is a contract producer; whether or not the farm has manure storage; the age, experience, and education of the farm operator; and the state in which the farm operates. Table 1 shows the summary statistics for the sample and examines the comparability of farms with NMPs to those without. In the weighted sample, 55 percent of operations had NMPs. The statistics reflecting the distributions of the two groups suggest differences in size of operation and cropland. Farms with NMPs on average have more animal units 1 (815 compared to 260), and were more likely to have more than 1,000 animal units (a rough approximation of whether the operation would be considered a \"large CAFO\") (24 versus 5 percent). Operations with NMPs also have more cropland (590 versus 397 acres)."}, {"section_title": "Summary Statistics", "text": "Operators with NMPs are on average slightly younger (52 versus 53), with slightly less experience (27 versus 29 years), and more likely to have a college degree (24 versus 17 percent). The summary statistics also suggest that operations with NMPs are older, on average. Operations with NMPs are more likely to have any manure storage (93 versus 54 percent), are less likely to be the traditional farrow-to-finish style (13 versus 37 percent), and are more likely to be contract operations (66 versus 27 percent). Few operations report having an EQIP contract (overall, 4 percent), with 7 percent of NMP operations having an EQIP contract and only 1 percent of non-NMP operations having one. With respect to our indicators for degree of regulatory oversight, operations with NMPs are somewhat less likely to be in counties with TMDLs (49 versus 57 percent) and are slightly more likely to be in states with CNMP requirements (15 versus 10 percent). There is no statistical difference in the county-level population densities of operations with and without NMPs. Farms with NMPs are more likely to engage in nutrient management practices (Table 2). Farms with NMPs are much more likely to test manure for nutrient content and to adjust fertilizer applications for nutrient levels. Farms with NMPs are also more likely to apply manure, which may be an indicator of nutrient management. When we turn to what measures we can get of actual nutrient applications, we see a somewhat conflicting story, compared to what we expect from the practice outcomes. Farms with NMPs are more likely to have excess nitrogen applications (19 versus 11 percent). The comparison of applications versus uptake also suggests no difference between the two types of farms."}, {"section_title": "Empirical Strategy", "text": "We estimate the impact of NMPs on the following farm management practices using logistic regression: Nutrient testing for Nitrogen and Phosphorus in the soil -Nutrient testing is a dummy that is 1 if farm engages in nutrient testing and 0 if otherwise. Testing for nutrients in the soil prevents farms from exceeding the recommended nutrient requirements for the crops grown. Adjusting nitrogen and phosphorus in commercial fertilizer-Adjusting nutrient concentration in commercial fertilizer according to crop requirements reduces excess nutrient run-off. Probability of excess nutrient application: Farms following their NMPs should not have excess nutrient applications. The basic regression takes the form: In the equation, indexes operation while indexes state. is a vector of independent variables, include size, operator characteristics, farm characteristics, and proxies for enforcement. is a vector of dummies variables (with coefficients) for state. These fixed effects by state control for factors that affect all farms within the state that are correlated with both NMP adoption and the outcome variable. Table 3 reports logistic estimation results of the correlation between having an NMP and certain nutrient management practices, controlling for potential confounders. For each outcome, two models are"}, {"section_title": "Results", "text": "shown. The first model does not control for the interaction terms between the enforcement proxies and NMP, while the second model does. All models include fixed effects for state, and standard errors are clustered by state in all results. The odds ratios are shown for the logistic regressions. The variable NMP is significant at the 1 percent level in predicting whether an operator tests manure for nutrient content. Farms with NMPs are between 3.9 and 7.1 times more likely to test manure for nutrient content. Other statistically significant predictors of testing include having more than 1,000 hog animal units, having any manure storage, and having an EQIP contract. Other factors are statistically significant but do not have a large impact. By themselves, NMPs are not a strong predictor of adjusting commercial fertilizer for nutrient content. In states with CNMP requirements for certain farms, the NMP does have some predictive power to adjust fertilizer for nitrogen (but not phosphorus) content. Contract operations are predicted to be less likely to adjust fertilizer applications for nutrient content. These results suggest that at least by some indicators, farms with NMPs are more likely to practice other nutrient management behaviors. However, when we turn to whether farms apply excess nutrients, we see that NMPs are not a statistically significant predictor by themselves. Interestingly, being a contract operation is the strongest predictor of applying excess nutrients."}, {"section_title": "Conclusions", "text": "Our results partially support the hypothesis that hog operations in the US are implementing some manure management practices to reduce run-off into nearby waterways. We are able to show that the NMPs are a significant predictor of nutrient testing, and that this effect does not disappear when controlling for farm characteristics and other environmental regulations. However, we do not find statistical evidence of adjustments in commercial fertilizer nutrients. We also find no evidence that NMPs reduce the likelihood of overapplying nutrients. NMPs in states with CNMP regulations are predictive of reduced likelihood of excess nitrogen application, suggesting that NMPs may only be effective in areas with more oversight. The limitations in our data suggests that further research can be augmented to incorporate analysis of 1998 and 2004 ARMS Hog survey data. This would allow us to study the before and after effects of the amended Clean Water Act in 2003 on nutrient management practices.  "}]