[{"section_title": "", "text": ". Geography of the Missouri River Basin. The mathematical form of the SPARROW models is that of a nonlinear regression model in which nutrient loads are related to nutrient-source data weighted by estimates of loss due to land-surface and instream processes (Smith et al., 1997) . As described in Alexander et al. (2008) and detailed in Schwarz et al. (2006) , the mean annual load in leaving reach i is given by \nThe first summation term in the above equation (S1) represents the total load delivered to reach i from upstream reaches, where F j ' is the measured load if the upstream reach is monitored or the model-estimated load if it is not. The A( . ) term represents any stream delivery factors that cause load to be lost as it travels along the reach. Within this term, the Z S and Z R vectors (with corresponding coefficient vectors θ S and θ R ) represent losses in measured stream and reservoirs, respectively. If reach i is a stream, then only the Z S and θ S terms determine the value of A( . );"}, {"section_title": "conversely, if reach i is a reservoir then Z R and θ R determine A( . ). The second summation term", "text": "represents the amount of the within-reach load introduced to stream reach i. This term is composed of load originating in individual modeled sources, each source being indexed by n=1,…N S . Each source has a source variable, S n , and a source coefficient, α n , that measures the intensity of source contribution. The function D n ( . ) represents land-to-water delivery factors, and, coupled with the coefficient, represents the rate at which the source variable is converted to nutrient mass delivered to streams. The land-to-water delivery factor is a source-specific function of a vector of delivery variables, represented by Z i D in the equation (S1), and an associated vector of coefficients θ D . The last term in the equation, the function A' ( . ) , represents the fraction of the load originating in and delivered to reach i that is transported to the reach's downstream node. If reach i is a stream reach (as opposed to a reservoir reach), the nitrogen load or phosphorus load introduced to reach i from the incremental drainage for reach i is attenuated to receive the square root of the reach's full instream delivery. For reservoir reaches, the assumption is made that the nutrient mass receives the full attenuation, which is tabulated as a reach attribute. The multiplicative error term in equation (S1), ε i , is applicable in cases where reach i is a monitored reach; the error is assumed to be independent and identically distributed across independent catchments in the intervening drainage between stream monitoring sites.\nThe measured load in monitored reaches for the 2002 base year are estimated by detrending the data at each site. According to Schwarz et al. (2006, p. 20) , the detrended time series of load at a site can be interpreted as the series that would have been observed if the dynamic factors causing trend over time, whatever they might be, were held constant throughout the entire period of record, equal to the values they had in 2002 (the base date). All other dynamic factors determining the short-term variations in the series are left unchanged. Therefore, for example, peak-flow events affecting the original series would remain in the detrended series; however, gradual improvements in water quality resulting from the implementation of management practices over time would be substituted with management practices that were in place in 2002. The mean of the detrended series was used to represent the load that would have occurred during 2002 under long-term mean hydrologic conditions. In mathematical terms, the detrending process can be described as follows. Let h(t) be the function of time used to describe trend through the original series X(t). The detrended series X*(t) is given by\nIn equation (S2), the term h(t) -h(T o ) is the adjustment function and the constant h(T o ) is the constant that causes the adjustment to equal zero for the base date, T o .\nTwo notable specifications affecting model calibration and prediction were applied to the Missouri River Basin SPARROW model. To preserve the overall mass balance of the model, predicted loads were not conditioned on measured load at monitored reaches (if_adjust = no); therefore, the predictions are based only on the estimated SPARROW model. To aid in interpretation of the model output by providing standardized delivery and source coefficients, the land-to-water delivery variables were expressed as differences from their mean value over all reaches (if_mean_adjust_delivery_vars = yes) (Schwarz et al., 2006) .\nThe mean discharge and travel time attributes in the reach network used for the Missouri River Basin SPARROW model (MRB_E2RF1) were refined using an alternative measure of mean discharge that was based on an interpolation of USGS streamgage estimates from 1975 to 2007, with extrapolation of discharge upstream from gages based on runoff estimated at downstream or neighboring stations and apportioned to the land surface according to the MRB_E2RF1 catchments (Brakebill et al., this issue.) . The existing reservoir coverage in the MRB_E2RF1 reach network was modified to include nine additional reservoirs with maximum capacity greater than 61,674,093 m 3 (50,000 acre feet) or normal capacity greater than 12,334,819 m 3 (10,000 acre-feet) using the National Inventory of Dams (U.S. Army Corps of Engineers, 2005), a USGS major dams of the United States map layer (http://www.nationalatlas.gov/mld/dams00x.html, March 2006 release, accessed June 2011), waterbodies from the National Hydrography Dataset (http://nhd.usgs.gov/, accessed June 2011), and digital topographic maps (http://resources.esri.com/arcgisdesktop/layers, accessed June 2011), for a total of 183 reservoirs and lakes in the Missouri River Basin (two reservoirs in the U.S. part of the Oldman River drainage were included in the model, but excluded from the Missouri River Basin reservoir summary).\nThe spatial data on nutrient inputs and landscape characteristics were limited to the basin area in the United States; the basin area in Canada initially was undefined. Nutrient inputs and landscape characteristics for 93 reaches with catchments in Canada were estimated as the mean value of all reaches in the United States in the same 8-digit hydrologic unit code. Because of the irregular location of point sources throughout the hydrologic unit, the mean was not used to estimate contributions of nutrients from point sources in the Canadian reaches; instead, the pointsource contributions were treated as missing. The values estimated for reaches in Canada were used in calibration and prediction to maintain water flow paths and mass balance throughout the Missouri River Basin reach network. But because the uncertainty in these values is expected to be greater than the uncertainty in values for reaches in the United States, predictions for reaches in Canada are not reported here.\nAs stated in the main article, plots of the observed loads versus predicted loads and observed yields versus predicted yields from the Missouri River Basin TN and TP SPARROW models suggest reasonably unbiased models, though values are more variable for sites with small loads and generally coverage is sparse for sites with very small and very large loads (Figures S3 and S4 [a and b] ). Slightly larger variation is evident for total phosphorus as compared with total nitrogen, which is consistent with the higher RMSE of the TP model. Plots of the prediction loads and yields versus residuals indicate that the residuals were approximately homoscedastic (Figures S3 and S4 [c and d] ). "}, {"section_title": "Calculation of reservoir and lake attenuation values", "text": "Estimates of attenuation in individual reservoirs and lakes were computed by dividing the total load attenuated in each waterbody by the total load entering that waterbody. Because the total load entering each waterbody was not available directly from the SPARROW model output, it was calculated as the sum of the total load attenuated in the waterbody and the total load leaving the reach. Overall, this calculation is given by:\nwhere RESERVOIR ATTENUATION = attenuation in the individual reservoir or lake, in percent of the total load entering the waterbody; RES_DECAY = the load attenuated in the individual reservoir or lake, in kg/yr; and PLOAD_TOTAL = the total load leaving the reach (i.e., the reach entering the reservoir), in kg/yr.\nThe RES_DECAY and PLOAD_TOTAL variables, provided as part of the SPARROW model output, are further explained in Schwarz et al. (2006) . Individual error on these attenuation estimates was not computed.\nEstimates of attenuation in the reservoirs and lakes within each major subbasin were computed by dividing the total load attenuated in all reservoirs and lakes in each subbasin by the total load that would have left that subbasin had there been no loss in any of the reservoirs and lakes. This calculation is given by: RES_DECAY r = the load attenuated in reservoir or lake r in subbasin s, in kg/yr; and PLOAD_ND_TOTAL s = the total load leaving the outlet reach of subbasin s, excluding instream and reservoir attenuation, in kg/yr. This approach assumed that no additional instream loss would have occurred in the absence of nutrient attenuation in reservoirs and lakes (G.E. Schwarz, U.S. Geological Survey, oral commun., 2009) . Individual error on these attenuation estimates was not computed."}, {"section_title": "Calibration data", "text": "The spatial distribution of the TN and TP loads used in model calibration are shown in Figure S5 . Information on sources of water-quality data and discharge measurements used to estimate mean annual nutrient load are presented in Table S1 . The highest TN loads (greater than 10,000,000 kg/yr) are concentrated in the southeast part of the basin ( Figure S5a ). Although the highest TP loads (greater than 1,000,000 kg/yr) are similarly concentrated in the southeast, additional higher TP load sites were identified in the central and north-central part of the study area ( Figure S5b ). More information on the preprocessing of the calibration data is provided in the Methods section of the report and in Saad et al. (this issue) .\nBoxplots of basin characteristics used in the TN and TP SPARROW models for the calibration reaches and all the reaches in the Missouri River Basin ( Figure S6 [a and b]) indicate that source and transport attributes of the calibration sites generally corresponded well to the attributes of the Missouri River Basin reaches used during model prediction. The calibration sites generally did not capture the extremes of these basin characteristics. However, the calibration sites on average had somewhat higher developed land area, mean temperature, mean precipitation, irrigated area, and area in loess surficial geology than those throughout the Missouri River Basin Maupin and Ivahnenko, this issue) . Load, kilograms per year < 100,000 100,000 to 1,000,000 > 1,000,000 to 10,000,000 > 10,000,000 < 10,000 10,000 to 100,000 > 100,000 to 1,000,000 > 1,000,000\nBase from U.S. Geological Survey digital data.\nBase from U.S. Geological Survey digital data. Figure S5 . Mean annual load estimated from stream water-quality monitoring data and discharge measurements for (a) total nitrogen and (b) total phosphorus, in kilograms per year, in the Missouri River Basin, normalized to 2002."}, {"section_title": "Load, kilograms per year", "text": "Information on load estimats in Saad et al., this issue.\nInformation on load estimats in Saad et al., this issue. "}, {"section_title": "Point sources", "text": "Estimates of point-source contributions were derived using data from the U.S. Environmental Protection Agency (USEPA) Permit Compliance System (PCS) database (Maupin and Ivahnenko, this issue) ( Figure S7 ). For the Missouri River Basin SPARROW models, only Standard Industrial Classifications (SIC) determined to discharge nitrogen or phosphorus to streams were used (Table S2 ). The estimates of point-source contributions used in model calibration were based on a mean of 1992, 1997, and 2002 data, as some inconsistencies in reporting between years were identified. For example, there were consistently fewer facilities reported for most SICs in the Missouri River Basin states in 1992 than in 1997 and 2002, and Missouri did not report any nutrient discharges in 1992. Minnesota had only one facility reported in 2002 while 12 and 14 facilities were reported as discharging nitrogen in 1992 and 1997, respectively. Variations on the 3-year mean (e.g., just 2002 data) were evaluated during model specification; however, the 3-year mean ultimately provided the best model fit. Typically, larger point sources for nitrogen ( Figure S7a ) coincide with the larger point sources for phosphorus ( Figure S7b) , with the largest point sources located in the urban areas of Denver, Colorado, and Lincoln, Nebraska. The PCS database included a greater density of point sources for some states (e.g., Colorado, Nebraska, and Iowa) than others (e.g., Missouri and Kansas). It is possible that these differences are due to differences in State reporting practices."}, {"section_title": "(a) Total nitrogen", "text": "Nitrogen from point sources, in kilograms < 100,000 100,000 to 1,000,000 > 1,000,000\nBase from U.S. Environmental Protection Agency digital data http://www.epa.gov/enviro/html/pcs/pcs_query_java.html Base from U.S. Environmental Protection Agency digital data http://www.epa.gov/enviro/html/pcs/pcs_query_java.html "}, {"section_title": "Nutrients from developed land area", "text": "Data on non-agricultural developed land area used in the models were derived from the 30-m grid of National Land Cover Database 2001 for the conterminous United States (LaMotte, 2008a,b,c,d ) and allocated to MRB_E2RF1 catchments by Wieczorek and LaMotte (2010c) . Developed land area in the Missouri River Basin includes four classes: developed open space, and low, medium, and high intensity developed land (Table S3) . Developed land area in the Missouri River Basin generally increases following a west-northwest to east-southeast gradient, with less than 1% developed land area in many incremental catchments and as much as 100% developed land area in a few catchments ( Figure S8) . Notably, open-space developed land comprises as much as 100% of the total developed land area in many of the incremental catchments ( Figure S9a) , and it covers as much as 40% of the total catchment area in some incremental catchments ( Figure S9b ) making it a relevant component of nutrients being contributed from developed land area in the Missouri River Basin. The nutrient sources from developed land area may serve as a surrogate measure of various diffuse urban sources in the model, including subsurface inputs from individual or group septic systems as well as surface and subsurface runoff from fertilized land (e.g., golf courses, lawns, parks), runoff from impervious areas (e.g., rooftops, streets), nitrogen deposition associated with vehicle emissions of nitrous oxides, and inputs from domestic pets or wildlife. "}, {"section_title": "Developed Land Class Definition", "text": "Open space\nIncludes areas with a mixture of some constructed materials, but mostly vegetation in the form of lawn grasses. Impervious surfaces account for less than 20 percent of total cover. These areas most commonly include large-lot single-family housing units, parks, golf courses, and vegetation planted in developed settings for recreation, erosion control, or aesthetic purposes"}, {"section_title": "Low intensity", "text": "Includes areas with a mixture of constructed materials and vegetation. Impervious surfaces account for 20-49 percent of total cover. These areas most commonly include single-family housing units."}, {"section_title": "Medium intensity", "text": "Includes areas with a mixture of constructed materials and vegetation. Impervious surfaces account for 50-79 percent of the total cover. These areas most commonly include singlefamily housing units."}, {"section_title": "High intensity", "text": "Includes highly developed areas where people reside or work in high numbers. Examples include apartment complexes, row houses and commercial/industrial. Impervious surfaces account for 80 to100 percent of the total cover.\nhttp://www.mrlc.gov/nlcd.php. Land cover allocation to catchments from Wieczorek and LaMotte (2010c) . Metadata on-line at http://water.usgs.gov/GIS/metadata/usgswrd/XML/mrb_e2rf1_nlcd01.xml.\nLand cover allocation to catchments from Wieczorek and LaMotte (2010c) . Metadata on-line at http://water.usgs.gov/GIS/metadata/usgswrd/XML/mrb_e2rf1_nlcd01.xml.\nBase from U.S. Geological Survey National Land Cover Database digital data, Base from U.S. Geological Survey National Land Cover Database digital data,"}, {"section_title": "Nutrients from farm fertilizer", "text": "Data on nitrogen and phosphorus inputs from farm fertilizer were derived from 2002 sales and expenditures data from the Association of American Plant Food Control Officials and the U.S. Census of Agriculture (Ruddy et al., 2006) and allocated MRB_E2RF1 catchments by Wieczorek and LaMotte (2010e) . Farm fertilizer sales serve as a measure of the location and intensity of farming activities; in addition to providing a direct measure of commercial fertilizer use, the fertilizer source in SPARROW serves as a surrogate for other nutrient inputs to farms and the net effects of farm practices on nutrient runoff to the extent that they are spatially correlated with fertilizer sales. As a result, the model estimates of fertilizer contributions to streams may potentially reflect additional nutrient inputs to croplands from manure fertilizers and nitrogen fixation by legumes (e.g., soybeans, alfalfa) and the effects of some farmmanagement practices (e.g., rotations, harvesting, conservation tillage). Nutrient mineralization and immobilization rates in cultivated soils are assumed to be approximately in equilibrium (R.B. Alexander, U.S. Geological Survey, written commun., 2010). Farm fertilizer inputs showed a largely northwest to southeast increasing gradient ( Figure S10 ). Fertilizer inputs were highest in the area directly west of Omaha and Lincoln, Nebraska, and northeast of Sioux City, Iowa (see Figure S1 for city locations). Spatial patterns of nitrogen ( Figure S10a ) and phosphorus ( Figure S10b ) fertilizer inputs were largely similar, though the magnitudes were substantially different. Generally, nitrogen inputs were at least an order of magnitude greater than phosphorus inputs."}, {"section_title": "23", "text": "(a) Total nitrogen < 100 100 to 300 > 300 to 1,000 > 1,000\nNitrogen input, in kilograms per square kilometer by county < 1,000 1,000 to 3,000 > 3,000 to 6,000 > 6,000\nBase from U. Fertilizer allocation to catchments from Wieczorek and LaMotte (2010e) . Metadata on-line at http://water.usgs.gov/GIS/metadata/usgswrd/XML/mrb_e2rf1_nutrients.xml."}, {"section_title": "Phosphorus input, in kilograms per square kilometer by county", "text": "Fertilizer allocation to catchments from Wieczorek and LaMotte (2010e) . Metadata on-line at http://water.usgs.gov/GIS/metadata/usgswrd/XML/mrb_e2rf1_nutrients.xml."}, {"section_title": "Nutrients from confined and unconfined manure", "text": "Data on nitrogen and phosphorus inputs from confined (predominantly from concentrated animal feeding operations for cattle, poultry, and dairy operations) and unconfined (farm-, pasture-and range-based livestock operations) manure were derived from 2002 livestock population data from the U.S. Census of Agriculture (Ruddy et al., 2006) and allocated to MRB_E2RF1 catchments by Wieczorek and LaMotte (2010e) . Confined animal wastes include recoverable manure that may be applied to nearby farmlands as well as unrecoverable manure that is lost during the collection, storage, and treatment of the waste. Manure inputs showed a northwest to southeast increasing gradient similar to that for fertilizer inputs ( Figure S11 ). Manure inputs were greatest in the areas directly west of Omaha and Lincoln, Nebraska; northeast of Sioux City, Iowa; near Greeley, Colorado; and throughout much of the southern Lower Missouri River subbasin (see Figure S1 for city locations). Nitrogen inputs from manure ( Figure S11a) were typically 2 to 4 times greater than phosphorus inputs from manure ( Figure S11b ) throughout the basin. "}, {"section_title": "Nitrogen from atmospheric deposition", "text": "Nitrogen inputs from atmospheric deposition were estimated from measurements of wet deposition of total inorganic nitrogen obtained from the National Atmospheric Deposition Program (NADP; http://nadp.sws.uiuc.edu/, accessed June 2011). These data were derived from long-term mean annual measurements (1990 to 2005) at 186 stations in the United States and serve as a surrogate for total (wet plus dry) inorganic nitrogen deposition. Estimates were detrended to the base year 2002 and allocated to MRB_E2RF1 catchments by Wieczorek and LaMotte (2010d) . SPARROW estimates of the quantities of nitrogen deposition delivered to streams are expected to account for additional contributions from dry nitrogen deposition forms because the regional patterns of wet and dry deposition are generally correlated over large areas of the U.S. (Holland et al., 2005; Baumgardner et al., 2002) . The SPARROW estimates of atmospheric nitrogen contributions to streams would also be expected to primarily reflect regional atmospheric nitrogen sources, given that NADP wet-deposition estimates generally reflect regional nitrous oxide (NOx) emissions from stationary sources (Elliott et al., 2007) . Local atmospheric nitrogen sources, such as those associated with vehicle emissions, are likely to be included in the SPARROW estimates of the nitrogen contributions from other modeled sources, especially developed land area.\nInputs from atmospheric deposition of nitrogen followed a largely west to east increasing gradient in the basin ( Figure S12 ). The largest inputs occurred principally in the southeast part of the Missouri River Basin, particularly in the Grand River, Big Sioux, James River and lower Kansas River subbasins. These elevated inputs were likely the result of agricultural and urban influences concentrated in these areas. Additionally, nitrogen deposition appears to be elevated in the upper South Platte River subbasin. Evaluation of nitrogen emissions in the western United States suggest increasing nitrate deposition in the Rocky Mountains (Nilles and Conley, 2001; Fenn et al., 2003; Campbell, 2003) , and recent research suggests a correlation between elevated regional anthropogenic emissions of nitrogen compounds and increasing nitrate concentrations in some high-elevation lakes in the Rocky Mountains (Nanus et al., 2008) . "}, {"section_title": "Stream channels as source of phosphorus", "text": "Stream channel length estimates, used as a surrogate for stream channel sources of phosphorus, were derived from reach lengths in the modeled MRB_E2RF1 stream network (Nolan et al., 2002; Wieczorek and LaMotte, 2010b) for streams with discharge greater than 1.13 m 3 /s (40 ft 3 /s) (those found to be a significant source of phosphorus in the TP model). Shorter channel lengths (< 20 km) meeting the model discharge criterion were largely concentrated along the western boundary of the basin, while medium and longer-length channels meeting the discharge criterion were concentrated in the southeast part of the basin ( Figure S13 ). Reach length, kilometers Figure S13 . Stream channel length as a source of phosphorus (for streams where discharge is greater than 1.13 cubic meters per second), in kilometers, in the Missouri River Basin.\nBase from U.S. Geological Survey Enhanced River Reach File 2.0 (ERF1_2) digital data (Nolan et al., 2002) . Reach characteristics from Wieczorek and LaMotte (2010b) . Metadata on-line at http://water.usgs.gov/GIS/metadata/usgswrd/XML/mrb_e2rf1_bchar.xml."}, {"section_title": "Mean annual precipitation", "text": "Precipitation data averaged from annual precipitation depth values over 30 years (1971 to 2002) were obtained from the Parameter-elevation Regressions on Independent Slopes Model (PRISM) digital data network (http://www.prism.oregonstate.edu/, accessed July 23, 2009) and allocated to MRB_E2RF1 catchments by Wieczorek and LaMotte (2010j) . These data show a strong west to east gradient of increasing mean precipitation in the Missouri River Basin ( Figure  S14 ). The exception to this gradient is a relatively narrow band of higher precipitation that follows the western boundary of the basin in the Rocky Mountains. Mean annual precipitation values for 2002 were also evaluated in the models; however, the 30-year long-term mean provided a better fit in both the TN and TP SPARROW models. Figure S14 . Mean annual precipitation, in millimeters, in the Missouri River Basin, 1971 -2000 Allocation of precipitation to catchments from Wieczorek and LaMotte (2010j) . Metadata on-line at http://water.usgs.gov/GIS/metadata/usgswrd/XML/mrb_e2rf1_ppt30yr.xml."}, {"section_title": "Mean air temperature", "text": "Air temperature data averaged from minimum and maximum daily temperature values over 30 years (1971 to 2000) were obtained from the Parameter-elevation Regressions on Independent Slopes Model (PRISM) digital data network (http://www.prism.oregonstate.edu/, accessed July 23, 2009) and allocated to MRB_E2RF1 catchments by Wieczorek and LaMotte (2010h,i) . These data generally show a northwest to southeast gradient of increasing mean air temperature in the Missouri River Basin ( Figure S15 ). The exceptions to this spatial pattern are the lower temperatures along the western boundary of the basin in the Rocky Mountains and the northern boundary of the basin. Minimum and maximum daily air temperature values for 2002 were also evaluated in the models; however, the 30-year long-term mean provided a better fit in both the TN and TP SPARROW models. "}, {"section_title": "Estimated irrigated agricultural land", "text": "Combined estimates of the agricultural area in gravity, pressure, and gravity and pressure irrigation (categories not distinguished in the model dataset) were derived from the 1997 National Resources Inventory (NRI) dataset created by the National Resource Conservation Service (http://www.nrcs.usda.gov/technical/NRI/, accessed April 26, 2011) and allocated to MRB_E2RF1 catchments by Wieczorek and LaMotte (2010a) . Regional or national-scale irrigation datasets with more refined detail on irrigation type and geographic extent are not currently available. These NRI estimates performed similarly in the TN model as alternative mean irrigation estimates computed for the Missouri River Basin catchments from the 2002 National Agricultural Statistics Service dataset (http://www.agcensus.usda.gov/Publications/2002/index.asp, accessed April 26, 2011). The NRI data indicate that most of the irrigated agricultural is concentrated in areas north of and surrounding Lake Sharpe, Lake Francis Case, and Lewis and Clark Lake, and the eastern Platte River and northwestern Kansas River subbasins. Large areas of Federal land and other areas with minimal irrigation characterize a large part of the northern and western part of the study area ( Figure S16 ). "}, {"section_title": "Loess-dominated geologic units", "text": "Loess-dominated geologic units were derived from surficial geology data digitally generated from the USGS National Atlas map series (Hunt, 1979) for the USGS National WaterQuality Assessment Program (Clawges and Price, 1999) and allocated to MRB_E2RF1 catchments by Wieczorek and LaMotte (2010g) . The loess-dominated units identified in the Missouri River Basin are a combination of three surficial geologic units, including Wisconsinan loess (wl), deeply-weathered loess (es), and sandy or silty residuum, probably including loess (rsi). An alternative loess-based variable that excluded the rsi unit was tested in the preliminary model regressions, but it was not found to be as accurate of a predictor of nitrogen transport in the model. The distribution of loess-dominated surficial geology by major subbasin varies from 0 to 54% of the total drainage area in a subbasin (Table S4 ). The Lower Middle Missouri and the Lower Missouri River subbasins have the highest percentage of loess-dominated surficial geology (46 to 54%). These loess-dominated areas only occur in the southeastern part of the basin ( Figure S17 ). \n180,294\n100 13 1 Surficial geology data allocated to catchments from Wieczorek and LaMotte (2010g) .\n3 Excludes Oldman River drainage area.\n[km 2 , square kilometers; %, percent] deeply-weathered loess (es), and sandy or silty residuum, probably including loess (rsi). Allocation of surficial geology to catchments from Wieczorek and LaMotte (2010g) . Metadata on-line at http://water.usgs.gov/GIS/metadata/usgswrd/XML/mrb_e2rf1_sgeol.xml. Figure S17 . Loess-dominated surficial geology in the Missouri River Basin.\nUnderlain by loess-dominated geologic units Total nitrogen load calibration site Loess variable used in the total nitrogen Missouri River Basin model is a combination of mapped surifical geologic units, including Wisconsinan loess (wl),"}, {"section_title": "Mean soil permeability", "text": "Mean soil permeability was derived from the 1994 State Soil Geographic (STATSGO) Data Base digital data (Wolock, 1997) and allocated to MRB_E2RF1 catchments by Wieczorek and LaMotte (2010f) . Soil permeability shows a largely variable pattern throughout the Missouri River Basin ( Figure S18 ). The area of highest permeability is in the Sand Hills region of central Nebraska, which forms the headwaters of the Dismal River and surrounding tributaries to the Platte River (see Figure 1 in paper for stream locations) . Permeability is also higher along the western boundary of the basin, except in northwestern Montana. Areas of low permeability include northern Montana, central and eastern South Dakota, eastern Kansas, and northwestern Missouri.\nBase from 1994 State Soil Geographic (STATSGO) Data Base digital data http://water.usgs.gov/GIS/metadata/usgswrd/XML/muid.xml. Allocation of soil permeability to catchments from Wieczorek and LaMotte (2010f) . Metadata on-line at http://water.usgs.gov/GIS/metadata/usgswrd/XML/mrb_e2rf1_statsgo.xml. Figure S18 . Mean soil permeability, in centimeters per hour, in the Missouri River Basin."}, {"section_title": "Mean basin slope", "text": "Mean basin slope ( Figure S19 ) in the Missouri River Basin was derived from basin characteristics compiled by Wieczorek and LaMotte (2010a) for the MRB_E2RF1 stream reach network that was modified from the U.S. Environmental Protection Agency's Enhanced River Reach File 2.0 (ERF1_2) (Nolan et al., 2002; Brakebill and Terziotti, 2011; Brakebill et al., this issue) . Generally slope is highest in the headwater regions in the Northern and Southern Rocky Mountains and lowest in the northeast part of the Middle Missouri River subbasin and in the western and north-central parts of the Kansas River subbasin. Figure S19 . Mean basin slope, in percent, in the Missouri River Basin."}]