[{"section_title": "Abstract", "text": "One contribution of 16 to a theme issue 'Adult sex ratios and reproductive strategies: a critical re-examination of sex differences in human and animal societies'. Adult sex ratio (ASR, the proportion of males in the adult population) is a central concept in population and evolutionary biology, and is also emerging as a major factor influencing mate choice, pair bonding and parental cooperation in both human and non-human societies. However, estimating ASR is fraught with difficulties stemming from the effects of spatial and temporal variation in the numbers of males and females, and detection/capture probabilities that differ between the sexes. Here, we critically evaluate methods for estimating ASR in wild animal populations, reviewing how recent statistical advances can be applied to handle some of these challenges. We review methods that directly account for detection differences between the sexes using counts of unmarked individuals (observed, trapped or killed) and counts of marked individuals using mark -recapture models. We review a third class of methods that do not directly sample the number of males and females, but instead estimate the sex ratio indirectly using relationships that emerge from demographic measures, such as survival, age structure, reproduction and assumed dynamics. We recommend that detection-based methods be used for estimating ASR in most situations, and point out that studies are needed that compare different ASR estimation methods and control for sex differences in dispersal.\nThis article is part of the themed issue 'Adult sex ratios and reproductive decisions: a critical re-examination of sex differences in human and animal societies'."}, {"section_title": "Introduction", "text": "The adult sex ratio (ASR) is a demographic property of a population that emerges from differences in sex ratio at birth, sex differences in juvenile or adult mortality, or sex differences in maturation times and dispersal patterns [1, 2] . Variation in ASR profoundly influences many aspects of behaviour, including mate acquisition, sex roles and parental care, because the rarer sex in the adult population has more potential partners to mate with than the supernumerary sex [3] [4] [5] . Unbalanced ASRs may also affect lifetime reproductive success or survival probabilities [6] [7] [8] [9] [10] by increasing investment in mate competition, sexual harassment or parental care [9] [10] [11] .\nThe ASR also plays a crucial role in population dynamics [9, [12] [13] [14] and biodiversity conservation [15] [16] [17] . For example, strongly biased ASRs influence the risk of extinction or population collapse [9, [18] [19] [20] [21] and affect fishery quotas, bag limits and harvestable populations in game animals [22, 23] . Finally, recent studies of humans show that the ASR may also influence partner choice, demography and economic decisions [24, 25] , which could have important socioeconomic and biological consequences in human populations [26] . Thus, obtaining accurate ASR estimates is essential for studies in evolutionary and behavioural biology, population ecology, biodiversity conservation, resource management and the social sciences.\n& 2017 The Author(s) Published by the Royal Society. All rights reserved.\nLike numerous other demographic and population parameters measured in the field, obtaining accurate ASR estimates can be challenging. In human populations, the ASR (often referred to as the population sex ratio) is generally estimated from census data [27] , and although these data are often of good quality, they are not free of errors [28] . Censuses may miss or double-count one sex more frequently than the other (e.g. if migration rates, privacy concerns or misreporting of age differ between men and women) and these miscounts are expected to lead to distortions in (age-specific) sex ratio estimates [29] .\nIn wild animal populations, the ASR is estimated through encounters with live or dead individuals, either by counting or capturing them, and obtaining accurate ASR estimates may be particularly challenging. First, in sexually monomorphic species where genitalia are not visible (e.g. birds and some anuran species), recognizing males and females may require the application of DNA-based sexing with tissue samples obtained [17, 30] . Second, males and females often have different behaviour, which may result in sex differences in detectability [31] [32] [33] . Males from sexually dimorphic animals are often visually more ornamented or vocally more active (e.g. orang-utans, howler monkeys, songbirds, lizards and butterflies) and therefore, easier to detect than females, so the number of males relative to females could be overestimated [34, 35] . Third, biases in the estimation of the ASR may result from failure to detect non-breeding adults (i.e. floaters), which often remain unnoticed because they have less conspicuous lifestyles, are more mobile or live at the margins of a population [2, 36, 37] . For example, in highly polygynous species such as northern elephant seals (Mirounga angustirostris), females congregate on breeding beaches, whereas only a few males-the beach masters-mix with them, although many mature males patrol around the breeding colony but they rarely come on land [38] . ASR estimation can be further complicated if males and females segregate into different habitats or use different microhabitats at certain times of the year, which occurs in many terrestrial, volant and aquatic species [39] [40] [41] . Finally, spatial distributions and aggregations often vary between the breeding and non-breeding seasons, and thus, different methodologies may be required to estimate male versus female numbers during different seasons [4, 42, 43] .\nHere, we review and evaluate measures and methods of estimating the ASR in wild animal populations. We have four main objectives. First, we present an overview of the different measures used to estimate the ASR in wild populations and evaluate their relative merits and limitations. Second, we investigate how differences between the sexes in detectability or catchability may introduce bias in ASR estimates. Third, we discuss recent statistical advances that can be applied to account for the factors affecting ASR estimates and how they vary in space and time. Finally, we recommend topics for future research. We focus on dioecious animals, although we recognize that male and female functions show fascinating variation in hermaphrodites [44] , and that ASR estimation is also important for ecological and evolutionary inferences in plants [45] [46] [47] ."}, {"section_title": "Measures of the adult sex ratio", "text": "The ASR is one of the six types of sex ratios (figure 1) that traditionally have been used to describe a population [48] and that vary according to the age profile of the population : primary sex ratio (i.e. sex ratio at fertilization), secondary sex ratio (i.e. sex ratio at birth or hatching), tertiary sex ratio (i.e. sex ratio of sexually mature individuals), operational sex ratio (OSR), quaternary sex ratio (i.e. sex ratio of post-reproductive organisms) and ASR, which is the sex ratio of all individuals beyond the age of maturation. The OSR refers to the subset of adults that are sexually active and is usually expressed as the ratio of sexually active males to females [49] . OSR has often been confused with ASR, although they are conceptually different: ASR refers to all individuals that have reached the age of sexual maturation whether sexually active or not [2, 50] , whereas OSR is determined by the number of males and females that are available and actively seeking mates (which excludes sexually inactive and parenting adults [4] ) and reflects the availability of partners (i.e. mating opportunity [51] ).\nThis typology for characterizing sex ratios was adequate for decades, but it has limitations. First, two important life-history stages have been left out: sex ratio of young at independence and sex ratio at maturation (MSR), which influence the transition rate of individuals into the adult or operational classes. The ecological and demographic processes operating during these stages may differ profoundly from the ones affecting pre-birth and post-birth, and therefore, there is a need to recognize the importance of these key life-history stages (figure 1). However, these data can be extremely hard to collect and this may be the reason why these two stages have been overlooked. Second, sex ratios at fertilization, birth, independence and maturation can be considered snapshots of a given age cohort, whereas the ASR and the post-breeding sex ratio are calculated over multiple cohorts consisting of the relevant age classes. Analogous to the ASR and the quaternary sex ratio, we propose that juvenile sex ratio should refer to the sex ratios at post-birth and pre-independence of the offspring ( figure 1) .\nOperationally, the ASR should include all adult males and females that have reached reproductive age. Most ASR estimates from wild animal populations do not usually distinguish between reproductive and post-reproductive adults because this is often difficult to do. Differences in reproductive lifespan between males and females in humans [52] and in many cetacean and insect populations [53] would be reflected in estimates of tertiary sex ratio.\nSex ratios (including the ASR) have been expressed in numerous ways. The first is as a proper ratio of males to females (e.g. 2 M : 1 F and 1 M : 2 F), which can be readily converted to a real number (e.g. 2.0 or 0.5, respectively). The ratio-based expression of ASR, however, is problematic because it is bounded by zero on one end, but is not bounded at the other end (i.e. positive infinity). As a consequence, the ratio is asymmetric around 1.0, and the same extent of maleversus female-bias leads to a very different scaling towards zero or towards positive infinity.\nSecond, social scientists and game biologists often express the ASR as the number of males relative to 100 females (e.g. [22, 27] ). So a male-biased ASR (i.e. more than 100 males relative to 100 females) refers to a 'high' sex ratio, whereas female-biased ASR refers to a 'low' sex ratio. Expressing the ASR in this way has the same problems as the proper ratio discussed above: asymmetry and different lower and upper boundaries.\nIn dioecious populations, the ASR has two natural limits: all males or all females. Therefore, expressing the ASR as the proportion of one sex (conventionally, the male) in the total Figure 1 . Proposed terminology for sex ratios. Modified from [4] . Note that 'mature' means reaching the minimum age of first breeding, and the category of 'post-breeding' adults includes those males and females who survive beyond reproductive cessation. SR, sex ratio.\nrstb.royalsocietypublishing.org Phil. Trans. R. Soc. B 372: 20160313 adult population (males plus females) has the ability to capture the full range of biological variation and, moreover, it produces a metric that is symmetrical around 0.5 (half males and half females). Although it would be tempting to devalue extreme ASRs in either direction and express the ASR as the log of the number of males divided by the number of females, which is analogous to the way that sexual size dimorphism is often expressed [54] (but see [55] ), this approach would result in an asymmetric measure that is not easily interpretable on one end and infinite on the other end. We therefore strongly recommend using the proportion of males in the adult population as a general measure of the ASR (i.e. ASR ¼ N males /(N males þ N females )), because it is bounded between 0 (only females in the population) and 1 (only males in the population). This measure of the ASR is easy to interpret for two reasons. First, it does not invoke individuals of one sex as fractions of individuals of the other sex, so it is more in accordance with the nature of individuals as discrete units. Second, it results in values between 0 and 1 that reflect the relative abundances of males and females in the adult population.\nIn summary, we suggest that the proportion of males in the adult population is the preferred estimator of the ASR. Expressing the ASR as a ratio in the strict sense (e.g. males to females, or females to males) or as the total number of males per 100 females is problematic because these measures are unbound on the upper end and tend to be asymmetric. Using the proportion of males in the population of interest (figure 1) as a standard expression of the sex ratio can be a way to further integrate sex ratio research across different disciplines."}, {"section_title": "Factors differentially affecting the detection and capture of males and females", "text": "The basic unit of measurement for the ASR is a count of live or dead individuals that are either observed or captured. If there are differences in the behaviour and conspicuousness of males and females, this could affect the observation or capture process and can bias any estimate of sex ratio. Here, we discuss these possible differences and their effects on sex ratio estimation. Males and females often differ in morphology (e.g. size and colour) and behaviour (e.g. vocalization frequency or intensity, cautiousness, foraging habits, home range size or sociality) that can make one sex more likely to be detected or captured [33, 56, 57] . ASR estimates that disregard potential differences in detectability or catchability between males and females are likely to be biased towards the more conspicuous or catchable sex [17, 33, 34] . For example, in several ungulate populations, males are more difficult to spot and therefore to count because they are solitary or occur in smaller groups, tend to forage in areas with taller and thicker vegetation, or are more wary of the presence of human observers than females [31, 58, 59 ]. These differences in behaviour can bias sex ratio estimates of ungulate populations towards females [58, 60] . Similar bias may also occur in other species where females are more trappable than males due to sex differences in activity patterns (e.g. in the Central American spiny rat Proechimys semispinosus [61] ).\nConversely, bias in ASR estimates towards males may exist in many animal populations where males are easier to detect or catch than females [33] . In most songbird populations, for example, males may be more easily detected (and counted) than females due to their brighter plumage colours and their noticeable visual and vocal displays associated with territorial defence [62, 63] . Male songbirds can also be surveyed or caught more frequently because they have larger home ranges or are more prone to prospect new territories than females, or because females often take care of all incubation duties, causing them to be on nests and unavailable for detection [34] . Sex differences in the size of the home range or in territorial and dominance behaviour that make males easier to detect or capture than females can also occur, as, for example, in shorebirds [64] and small and medium-sized mammals such as mice, lemmings and raccoons [65] [66] [67] .\nOther behavioural differences may also lead to sexual segregation and sex differences in detectability or catchability that should be considered when estimating the ASR. In the flatfish Pleuronectes platessa, males are more active during the spawning period and spend more time on spawning grounds than females, and these differences can give rise to a predominance of males in commercial catches and measurement bias in the ASR towards males [68] . Sex differences in breeding durations are expected to lead to sex differences in detectability or catchability and result in an ASR estimate that is biased [69] , although their contribution to these quantities has rarely been estimated. In migratory species, potential differences between the sexes in detection and capture probabilities arise because males and females may exhibit differences in arrival dates and duration at stopover sites and breeding grounds, or may over-winter in separate areas or use different migration routes [43, 70] . Therefore, counts obtained from stopover sites risk producing estimates that may not reflect the sex ratio of a population as a whole, but instead reflect sex differences in migratory patterns [71] . Furthermore, when species exhibit sexual segregation with regard to habitat, site-specific detection and capture probabilities can be biased towards the sex concentrated in the habitat where detection or capture is favoured, even if encounter probabilities are otherwise equal between the sexes [63] .\nASR estimation can be further complicated by phenological variation in sex-specific traits (e.g. changes in behaviour and morphology associated with reproduction [72] ), or by differences in the frequency with which males and females skip breeding events [42, 73] , especially when non-breeding adults of either sex often remain undetected [36, 37] . Accounting for variable detectability between the sexes can be complex in monomorphic species, especially in cases where sex can only be determined by molecular techniques or dissection [30] .\nSelective effects of trapping methods or baits may also lead to sex differences in detectability or catchability and bias ASR estimates (reviewed in [74] ). For example, male mirid bugs (family Miridae) are more strongly attracted to light-traps than females and this difference is accentuated when ultraviolet traps are used, because males seem to be more attracted to UV lighttraps than to tungsten filament light-traps [75] . Similarly, trapping methods may lead to marked sex differences in catchabilities and bias in ASR estimates. In the European serin Serinus serinus, baited platform traps capture fewer females than males in comparison to clap nets, probably because dominant males monopolize the baited surface of platform traps [57] . In the fiddler crab Uca pugilator, males are captured more frequently than females in foraging areas than within burrows, and sex ratio estimates are strongly affected by the type of sampling and trapping method that is used [76] . Spatial rstb.royalsocietypublishing.org Phil. Trans. R. Soc. B 372: 20160313 positioning of traps may also generate bias in detectability and sex ratio estimates. For instance, pheromone-baited traps placed in the top of trees may catch a higher number of male moths than those placed in lower canopy positions, and these effects of trap positioning may have important implications for estimations of population dynamics and pest management decisions [77] .\nWhile biases to the ASR due to these different potential sources of errors are often unmeasured, making the accuracy of ASR estimates from the wild difficult to assess, ASR estimates from wild populations suggest reasonable precision when compared across species. In birds that have several published ASR estimates, the intra-class correlation was highly significant (figure 2a). Note that this is not repeatability in the strict sense because the estimators for a given species were often from a different population and/or from different time periods. Similarly, ASRs that were collected for a given species by different estimation methods were also significantly correlated (figure 2b)."}, {"section_title": "Detection-based methods of estimating the adult sex ratio from unmarked individuals", "text": "The multitude of factors discussed above that can differentially affect the detection and capture of males and females, and therefore lead to measurement errors, can be accounted for through the application of statistical methods to yield less biased estimators of the ASR. In the next three sections, we review these approaches. We begin our examination of ways to account for detection differences between the sexes by exploring methods to account for detection bias for the most common type of data used in sex ratio estimation: counts of unmarked males and females in a population. These counts typically come from direct observations of unmarked individuals alive and counted in the field, trapped, killed by collisions (e.g. with vehicles or buildings), or shot by hunters and caught by fishermen. The approaches described in this section illustrate some of the possibilities for ASR estimation when sampling unmarked populations that can be sexually identified in the field. In addition, we refer readers to a method that may be useful to handle uncertain observations where sex is unknown for some individuals. The past two decades have seen the development of several statistical methods to account for detection error in the counts of unmarked populations, i.e. when animals are not individually identified (reviewed in [78, 79] ). This is accomplished by: (i) jointly modelling abundance (often as a Poisson distribution) and the detection probability of each individual (often as a binomial distribution) using hierarchical models that require temporal replication in counts [80, 81] ; (ii) by using ancillary data such as the distance to the detected individual(s) to develop a detection function [82] ; or (iii) by modelling detection as a function of sitespecific covariates using a conditional likelihood model when sites were only visited once [83] .\nDetection-based approaches to estimate the ASR would apply one of the modelling approaches discussed above to counts of unmarked individuals of each sex to generate separate estimates of the abundance of males and females for each sampling unit. These estimates of male and female population size are then used to obtain the ASR. Detectionbased ASRs can be compared among different localities, seasons or years by including spatial and temporal components as factors in the models. The ASR calculated from the abundance estimates corrected for detectability is, in principle, less biased than using ASR estimates derived from raw counts when detection varies between sexes, sites or surveys.\nAn emerging approach to model count data for imperfect detection combines a binomial generalized linear model (GLM) and a standard Poisson GLM [80] . Counts at site i are regarded as a binomial process dependent upon the detection probability p (i.e. the observation process) and N i is a Poisson random variable (i.e. the state process):\n1: State process: N i PoissonðlÞ 2: Observation process: C ij Binomial(N i , pÞ, where N i is the abundance at site i and l the expected abundance (i.e. the mean abundance over all sites). C ij is the count at site i during survey j and p is the individual detection probability. This is the standard formulation of the widely used N-mixture model for analysing counts to derive a population estimate [79] . Additional explanatory variables can be included in both the abundance and the detection models using standard generalized linear modelling techniques. Box 1 illustrates how this type of detection-based method accounts for detection probability and can generate ASR estimates that are less biased than non-detection-based approaches (i.e. using raw count \nWe simulated random populations of males and females for i ¼ 50 sites with a Poisson mean of 10 individuals (five males þ five females) using a true (i.e. data-generating) ASR of 0.5. The number of individuals of each sex at each site was determined with binomial trials; i.e. the number of males in site i (males i ) was determined by a binomial trial with n ¼ N i (the total number of individuals in site i). The populations were sampled in two Scenarios (1 and 2) with different detection probabilities ( p) for each sex. In Scenario 1, p is equal between sexes (0.40), whereas in Scenario 2, p is much larger for males (0.80) than for females (0.25). We simulated counts of males and females at each site using binomial trials with p, and each site was surveyed j ¼ 3 times. For each scenario, we calculated 'observed' and 'estimated' ASRs using the raw count data and the abundance estimates generated with the binomial-Poisson N-mixture model [80] (estimated ASR), respectively. We then compared the values obtained with the known 'true' ASR ¼ 0.5. For each scenario, we estimated confidence limits for the 50 local ASR estimates with a Monte Carlo approach, drawing n ¼ 1000 random samples of abundances of each sex from a normal distribution with a mean and s.d. equal to the mean abundance estimate and its s.e. from the respective (male or female) model. We calculated the ASR for each nth male and female sample and obtained 0.95 confidence limits using the s.d. of the random ASR samples.\nRandom variation among sites resulted in 'realized' ASRs (i.e. the effect of sampling variation on the local estimates of the true ASR) that ranged from 0.14 to 1, with a mean of 0.48 (box figure 1) . In Scenario 1 where p is equal between sexes, both the observed ASR from raw counts and the estimated ASR from the N-mixture model were close to the true value of 0.5 (box figure  1b and c) . For Scenario 2 where males were much more detectable ( p ¼ 0.80) than females ( p ¼ 0.25), the observed ASR from raw counts was biased towards males (mean observed ASR ¼ 0.67, box figure 1d) both within and across sites, while the estimated ASR from the N-mixture model was much closer to the true value (mean estimated ASR ¼ 0.54, box figure 1e). rstb.royalsocietypublishing.org Phil. Trans. R. Soc. B 372: 20160313 data). As detection-based models allow researchers to investigate how abundance varies according to environmental factors [79, 80] , these methods provide the ability not only to generate estimates of the ASR but could be used to directly assess how different factors influence the ASR of populations. Naturally, estimating ASRs from unmarked individuals requires that observed individuals be identified as males or females, which is not always possible. A possible method to handle uncertain observations where some individuals are classified as 'sex not identified' is an extension of the N-mixture model for estimating abundance when the identity of a species is uncertain [86] . The abundance model with species uncertainty estimates the probability of correctly assigning species' identity, in addition to site-specific abundance and detection probabilities. Description of the model structure is extensive, so we refer readers to the original article for details [86] . The model could be adapted for counts of males and females of a single species that also include individuals assigned to a 'sex not identified' category. Then, it would provide unbiased estimates of abundance for each sex, which can then be used to calculate the ASR as described above.\nAlthough count surveys of unmarked individuals are generally simpler and require less effort than capturemark -recapture surveys discussed in the next section, detection-based models usually require large sample sizes to parametrize. Because counts have to be divided between sexes, an even larger overall sample may be necessary to increase the precision of sex ratio estimates. Several methods, including most N-mixture models, require temporally replicated surveys and assume population closure (with respect to migration, births and deaths) throughout the study. Yet, many studies are based on multiple-season datasets with a single visit per season (e.g. the North American Breeding Bird Survey [87] ), where the closure assumption is invalid [81] . Generalized multi-season abundance models [81, 88, 89 ] allow researchers to formally test the closure assumption through estimation of parameters of population dynamics, such as survival probability and recruitment rate [81] , or population growth rate [88, 89] , and therefore, the model can be used to analyse count data when the closure assumption is invalid.\nAlthough the approaches discussed in this section can generate estimates less biased than those derived from raw counts (box 1), we are not aware of any empirical study that has used any of these detection-based methods of estimating the ASR from unmarked individuals. We encourage researchers to use this type of procedure instead of simple counts whenever possible, because situations are very rare that allow every individual to be detected 100% of the time when direct counts are made, even for large diurnal mammals (e.g. [90] [91] [92] ) and, surprisingly, for plants (e.g. [93, 94] )."}, {"section_title": "Detection-based methods of estimating the adult sex ratio from marked individuals", "text": "Observing individually marked or identifiable individuals characterizes many studies of animal behaviour and population biology. When estimating the ASR from counts of marked individuals, it is straightforward to account for detectability or catchability differences between the sexes by accounting for the sex-specific detection probabilities estimated from mark -recapture models, such as CormackJolly -Seber models or multi-state capture-recapture models [2, 95] . They use encounters (resightings and/or recaptures) of individually identifiable organisms, either tagged or recognizable by natural marks or scars (e.g. fin shapes, spot patterns), to generate robust estimates of resighting and demographic rates [96] . Mark -recapture models can be fitted for each sex to estimate sex-specific detection ( p), survival rates, recruitment rates and population sizes (sexspecific abundances). Estimated sex-specific population sizes (N) can be further used to obtain an estimate of the ASR:\nASR ¼ N male =p male N male =p male þ N female =p female : Table 1 . Examples of the use of different approaches for estimating ASR that account for detection differences between the sexes or reconstruct the ASR from sex-specific demographic rates. The vast majority of ASR estimates come from raw counts of unmarked individuals, alive or dead, and do not correct for potential biases associated with sex difference in detectability or catchability (e.g. amphibians, birds, mammals and reptiles [98] ; fish [99] ; crustaceans [76, 100] ; insects [101] . Non-breeding males were significantly more likely to be resighted than non-breeding females ( paired t-test,  t ¼ 2.69, d.f. ¼ 29, p ¼ 0.012) , although detection probabilities varied greatly among years ( p NBM : 0.13-1.0; p NBF : 0.05 -1.0). Even when accounting for the lower detectability of nonbreeding females, parrotlets exhibited male-biased sex ratios in all but 3 years. The large deviation from this pattern in 1992 in the upland population was caused by an extremely low resighting estimate for non-breeding females ( p female ¼ 0.05), and suggests there will be situations where the markrecapture estimator of sex ratio may not perform well [2] .\nThe past 25 years have seen the development of powerful statistical methods and software [107, 108] for analysing a great diversity of mark-recapture data [96] . In general, mark -recapture models require that individuals be individually marked or identifiable, animals do not lose their marks and samples are temporally replicated. Moreover, the time span between capture occasions must be substantially longer than the duration of the capture events [109] . See Sandercock [110] for an outstanding review of the many approaches to structure mark -recapture models and their potential use for estimating demographic parameters that can be applied to modelling sex differences."}, {"section_title": "Indirect estimators of the adult sex ratio", "text": "Indirect methods for estimating the ASR do not directly sample the number of males and females counted or captured in a population, but instead estimate the ASR using relationships that emerge from measures of demography, such as survival, age structure, reproduction and assumed dynamics. Indirect measures of the ASR were initially developed for managing game species using harvest data or when one sex was not easily observed [111] .\nSex ratios have been projected from sex-specific probabilities of survival using the ratio of the sum of the male survival divided by the sum of female survival for adult and/or subadult classes [111] . The method may be extended to incorporate information on juvenile sex ratios and natural and harvest mortality for males and females when data are available [104, 111, 112] . Estimates of the ASR based on survival probabilities can be adjusted for scenarios when survival is equal for all age classes, or differs between juveniles and various different adult stages [111] . Box 2 presents a detailed example for the Kentish plover (Charadrius alexandrinus).\nAge structure inferred from sex-biased harvest data has been used in combination with survival data to derive the sex ratio of a harvested adult population. This approach was first developed by Severinghaus & Maguire [106] for estimating the juvenile sex ratio from hunter kills of deer as the proportion of yearling to adult males divided by the proportion of yearling to adult females. Derivations of this approach have been developed with differing assumptions about demographic rates for the juvenile age class: juvenile survival is equal for males and females, juvenile survival differs between sexes, juvenile sex ratios do not differ from unity and juvenile sex ratios are unequal [111] . Nevertheless, this method and its derivations rely deeply on three assumptions that are often not met in the focal population: harvest probabilities of different age classes are equal, age structure remains constant over time and recruitment rates do not differ between males and females. Figure 3 . Comparison of ASRs (males/(males þ females)) of green-rumped parrotlets estimated by counts of the number of breeding and non-breeding adults of each sex resighted annually (line) and after correcting for detection probability by dividing each count by the annual sex-and stage-specific (non-breeder and breeder) probability of detection (bars) for the upland population (a) and lowland population (b). Adapted from Veran & Beissinger [2] .\nrstb.royalsocietypublishing.org Phil. Trans. R. Soc. B 372: 20160313\nBox 2. Demographic estimate of the adult sex ratio in the Kentish plover.\nA small shorebird, the Kentish plover C. alexandrinus (body mass 40 -44 g) (box figure 2) is often used as an ecological model system to understand costs and benefits of mating systems and parental care because they exhibit diverse reproductive tactics [113 -115] . They produce two to three eggs in a small scrape on the ground and both parents incubate the eggs, although after hatching of the eggs one of the parents usually abandons the brood and re-nests with a new mate. In several plover populations, more female than male parents abandon the young, and Székely & Lessells [114] hypothesized that female desertion is facilitated by a male-biased ASR."}, {"section_title": "Box figure 2. Female Kentish plover incubating the eggs (credit: Hugo Amador). (Online version in colour.)", "text": "To test this proposition, Kosztolányi et al. [105] used 5 years of data from an intensely monitored plover population in Southern Turkey. Using data from 2101 individuals, including 579 molecularly sexed offspring, and by estimating nest survival and sex-specific survival of juveniles and adults and running the model through all age cohorts (box figure 3) , the model showed that males outnumber females in the population (ASR ¼ 0.860, 0.791-0.904 (95% confidence intervals)). The strong male bias was robust because it remained consistent when one year was excluded from the dataset (box figure 4) . If sufficient data are available to estimate sex-specific demography for the entire life cycle of an organism, the male and female proportions of a population can be calculated directly from two-sex matrix population models [2, 95, 118] . Matrix population models are numerical representations of the life cycle of an organism [119] . Single-sex matrix population models, usually female-based, are commonly used to estimate the asymptotic growth rate (l) of a population as well as its sensitivity or elasticity, which measure the impact of change in a demographic rate (e.g. survival, growth or reproduction) on l [120] . In these discrete-time models, nodes denote distinct life-history stages that experience different demographic rates, and the transition between nodes/stages is conditioned on parameters representing key demographic processes (see [119, 121] for reviews). The stable (st)age distribution, which is the proportion of individuals in each (st)age class, is an emergent property if the rates of survival, growth and reproduction remain constant from year to year.\nThe two-sex formulation of a matrix model allows demographic rates to differ between males and females on the basis of empirical observations. Estimates of demographic parameters of interest are used to parametrize matrix elements separately for each sex, and they are linked by a mating and birth function that incorporates the demographic interactions between the sexes. The ASR can be deduced from the model based on proportions of the stable-stage distribution of males and females for the appropriate nodes of interest ( [2] ; figure 4 ). In addition, metrics of sensitivity developed by Veran & Beissinger [2] and applied to the stable-stage distribution instead of l can be used to diagnose potential causes of biased sex ratios by quantifying which demographic parameters contribute most to an unbalanced ASR. For example, despite a sizeable difference in adult survival between green-rumped parrotlet sexes, this rate contributed much less to the skewed ASR than the low rate of female juvenile local survival and philopatry caused by sex-biased dispersal [2] .\nWhile indirect estimators can answer questions about the origin of ASR difference that other methods cannot address, two-sex matrix models require extensive data to parametrize and, if such data exist, it seems likely that it often would be possible to obtain the direct measures of sex ratio discussed in previous sections. Nevertheless, there may be situations where direct estimates of sex ratio do not exist, but data are available to parametrize a two-sex matrix model [122] .\nThe indirect methods discussed in this section assume that model parameters (e.g. annual recruitment, age-specific growth and survival, and harvest rates) remain more or less constant over time because they estimate sex ratios from stable (st)age distributions. This assumption will be violated in nature to varying degrees, so indirect estimations of the ASR should be considered as hypothesized sex ratios rather than actual estimations of the ASR. Nevertheless, these approaches have value, as they can be used to assess the impacts of alternative management scenarios on age-or sex-structure of a population [111] , or to make ecological or evolutionary inferences [2] ."}, {"section_title": "Discussion", "text": "Understanding the causes and implications of ASR variation is essential for the study of population dynamics, the The result of Kosztolányi et al. [105] is consistent with two additional lines of evidence. First, when the mating opportunities of male and female Kentish plovers were estimated experimentally by removing the mate, the remating probability of females was five to eight times higher than that of males [116] ; this difference is consistent with the magnitude of the bias in the ASR estimated by demographic modelling (6.1 times more males than females; [105] ). Note that the demography-based ASR is not entirely equivalent to the experimentally estimated mating opportunities because the latter is a derivative of the OSR [117] . Second, a recent two stage two sex model using the approach of Veran & Beissinger [2] rstb.royalsocietypublishing.org Phil. Trans. R. Soc. B 372: 20160313 evolution of social behaviour and sexual selection in humans and most animals [3, 5, 9, 12] , and the ASR provides important insights for management of species of high conservation concern or commercial importance [16, 17] . However, to advance this field, more accurate and comparable ASR estimates are needed across a wide range of species [4, 101] .\nOur review has five main recommendations. First, we suggest that the proportion of males in the adult population (i.e. ASR ¼ N male /(N male þ N female )) is the best general measure to quantify the ASR. It takes on easily interpreted values between 0 and 1 that reflect the relative abundances of males and females in the adult population. Although the ASR is traditionally expressed as ratios of one sex to the other (e.g. M : F), these have unfavourable properties because they have an upper boundary of infinity and tend to be asymmetric.\nSecond, we think it is useful to expand the established sex ratios to incorporate additional life-history stages. In addition to the well-established terminology of primary, secondary, tertiary, operational and quaternary sex ratios, we also recognize two additional terms: juvenile sex ratios and MSR. Researchers need to bear in mind that some of these represent sex ratios at a given time (i.e. fertilization, birth, maturation), whereas others integrate over a number of age cohorts (e.g. juvenile sex ratio, ASR). Although some of these sex ratios have been intensely investigated in selected organisms, few studies aimed at establishing sex ratio variation across the entire lifespan of animals. As selective processes spill over to affect subsequent life stages (e.g. early developmental experiences may influence survival and reproduction later in life [123] ), studies are needed that investigate causes and implications of sex ratio biases in an integrative way.\nThird, sex differences in morphology, ecology and behaviour are common in nature and are expected to result in sex differences in detectability or catchability, and therefore, could bias ASR estimates [17, 31, 34] . It is necessary to assess the extent to which ASR estimates can be affected by differences in the probability of detecting or catching males and females in wild animal populations [33, 34] . We have also highlighted that ASR estimates can be further biased if nonbreeding adults are missed from sampling due to their less conspicuous lifestyles [36, 37] . As the vast majority of current ASR estimates have been derived using methods that do not correct for these potential biases [17, 98, 124] (table 1) , we encourage researchers to use mark-recapture models or other detection-based methods for unmarked individuals that control for the sources of some of these biases. Nonetheless, we caution against throwing the baby out with the bathwater, given that at least in one taxon, the birds, the published ASR estimates have high intra-class correlation (figure 2).\nEfforts to study ASRs of unmarked populations may benefit from the integration of methods that estimate the probability of correct sexual identification (i.e. adapting [86] to a single-species dataset of male and female counts) and those that estimate demographic parameters from counts (e.g. survival [81] ). This integrative approach would allow estimation of the abundance of each sex, sex-specific survival rates and the ASR while accounting for uncertainty in sexual identification in vertebrate and invertebrate populations. [2] . Notation includes: f, probability of local survival; c, probability of becoming or remaining a breeder; R, fecundity; r, primary sex-ratio; I, immigration rate. Subscripts include: JF, juvenile females; JM, juvenile males. Adapted from Veran & Beissinger [2] . rstb.royalsocietypublishing.org Phil. Trans. R. Soc. B 372: 20160313\nFourth, while mark -recapture-based estimates of ASRs correct for sources of detectability, they sometimes have their own problems. Being captured in a given year could affect the probability of skipping reproduction in the next year and, depending on the sex of adults, could affect ASR estimates [42, 96] . Also, mark -recapture methods require large numbers of marked individuals for reliable estimates. Sex differences in dispersal can distort recapture probability estimates, because permanent emigration can rarely be distinguished from death. Nevertheless, mark -recapture models for marked populations and detection-based methods for unmarked populations should be used for estimating the ASR, and combined with estimation of sex-specific immigration and emigration rates. With increased use of GPS tags and movement monitoring devices, researchers will be able to quantify sex-specific differences in dispersal, activity patterns and other behavioural factors, which should increase our understanding of the sources of sex differences in detectability and, in turn, sex ratio variation.\nIn addition to intrinsic factors that lead to sex differences in detectability or catchability, attention must be paid to the choice of sampling or trapping methods, as bait-based sampling or trapping techniques can have selective effects on males and females, and thus, could give rise to systematic distortions in ASR estimates [57, 74, 76] . A possible solution to this problem could be using spatially and temporally stratified sampling (or trapping) techniques for a given population. As a general recommendation, ASR estimates based on hunting bags should be avoided, because they are admittedly biased by sex and potentially by age due to hunting restrictions and hunter preferences [111] .\nFifth, the ASR is a population parameter that may vary considerably in space and time [50, 102] , and this variation has been noted by wildlife biologists for half a century [125, 126] . Thus, obtaining reliable ASR estimates requires choosing an appropriate spatial scale and, in most cases, carrying out long-term sampling programmes [101] . Studies examining the causes and consequences of spatial and temporal variation in the ASR at the local and regional (i.e. metapopulation) scale are rare [102] , but they are urgently needed for (at least) three reasons. First, in migratory species, estimating the ASR at stopover sites may not reflect the sex ratio of a population as a whole, but only sexual differences in migratory patterns [71] . Second, the ASR may be balanced at a metapopulation scale even when it is locally biased towards one specific sex [127] . And third, ASR estimates may depend on variation in activity patterns [33, 42] ."}, {"section_title": "Conclusion", "text": "Obtaining robust ASR estimates of wild animal populations can be challenging, but current statistical advances offer plausible solutions to major difficulties stemming from the effects of spatial and temporal variation in the numbers of males and females, and detection or capture probabilities that differ between the sexes. We recommend that detection-based methods be useful for estimating ASR in most situations, and point out that studies are needed to establish the consistency between ASR estimates obtained by different estimation methods [31] and control for sex differences in dispersal. These advances will be key to draw proper inferences about the fascinating ecological and evolutionary implications of ASR variation for human and non-human societies. They can also contribute to wildlife conservation, because accurate ASR estimates may be important when assessing viability of animal populations (e.g. reptiles, fish, mammals and birds; reviewed in [17] ) and can lead to better management policies [17, 22, 23] .\nData accessibility. This article has no additional data."}]