[{"section_title": "Review of the Literature", "text": "The literature on doctoral education and nontraditional doctoral students reveals a very significant change over the last fifty years in student populations, their purposes for pursuing the degree, how they participate in their educational programs, and how they fund their education. Comparisons of traditional and nontraditional students are historical because the contemporary doctoral student is, by and large, nontraditional. A comparison of traditional doctoral students, looking back fifty to one hundred years, and the nontraditional students who make up the majority of contemporary doctoral students is given in Table 2.1. The quantity of doctoral degrees awarded each year has grown substantially. The growth has been from 3,500 students in 1900 to 10,000 in  (Golde and Walker, 2006, p. 3), to 48,802 in 2008(National Opinion Research Center, 2009. The number of institutions offering the doctorate in the United States has also grown from only 14 in 1920 to more than 400 today (Golde and Walker, 2006, p. 3). Demographics. Gardner (2009) provides a clear profile of the early traditional doctoral student as \"a demographic that was almost entirely white, affluent, Protestant and male\" (pp. 31-32). There was little change in that demographic between 1900, when 94 percent of doctoral students were men, and 1960, when 89 percent of doctoral students were men (p. 32). After 1960, the shift in this demographic is impressive, and for the first time, in 2001-2002, more women than men received doctoral degrees (p. 33). The first year that women exceeded men for all racial and ethnic groups was 2007. That year women represented 66 percent of the African American doctorates, 56 percent of the Hispanic, and 50 percent of the white (Falkenheim and Fiegener, 2008, p. 4). There has been similar growth in the number of doctoral degrees earned by students of color. Gardner reports that in 1939, 139 African Americans had earned doctoral degrees. By 2004-2005 enrollment of students of color had increased by 167 percent since the late 1930s, according to Gardner. The 2007Survey of Earned Doctorates (National Opinion Research Center, 2008 shows that for the periodJuly 1, 2006, through June 30, 2007, non-Hispanic white students accounted for 79 percent of the doctorates awarded, down from 92 percent in 1987. African American doctorates increased from 787 in 1987 to 1,841 in 2007, while Hispanic doctorates increased from 617 to 1,489. This represents increases of 131 percent and 140 percent, respectively. These data indicate that the greatest gains in doctorates earned by students of color have been realized in the past couple of decades. Full-Versus Part-Time Study. Gardner (2009) reports that the first doctoral students studied full time. Today, half the doctoral students study part time (p. 35). The traditional doctoral student was in the twenty-two to thirty-year-old range; in 2004, the median age of doctoral students in all disciplines was 33.3 years. Nearly two out of three contemporary doctoral students is married or in a \"marriage-like relationship\" (p. 37). Also, nearly a third of the doctoral students are the first person in their family to attend college, with the proportion of first-generation students being even higher for students of color (p. 37). Twenty-eight percent of doctoral recipients in 2005 had fathers who had earned no more than a high school diploma (National Opinion Research Center, 2006). Purpose of Study. As the doctoral student demographic has shifted, so too has the intended purpose for the doctoral degree. The original purpose was solely to \"prepare scholars\" who would teach other scholars rather than to prepare a graduate for \"work in any one sector\" (LaPidus, 1997, p. 1). The doctorate was intended to be \"more than a simple apprenticeship, and that research, in this context, must be more than a technical exercise for producing research results. It must be a vehicle for preparing other scholars\" (p. 2). Gardner (2009) describes the preparation \"of a student to become a scholar; that is, to discover, integrate, and apply knowledge, as well as to communicate and disseminate it\" (p. 11). She defines a doctoral structure that is intended to support the preparation of a scholar as consisting of course work, examination/assessment of skills gained through course work, and production of independent research resulting in a thesis or dissertation (p. 30). Gardner presents three categories of doctoral programs: \"(1) professional doctorate or the first professional degree (MD, JD, or PsyD), (2) professional research doctorate (EdD), and (3) research doctorate (PhD)\" (p. 29). Bourner, Bowden, and Laing (2001) describe the difference between the two research doctorates as follows: \"Whereas the PhD candidate starts from what is known (that is, the literature review), professional doctorate candidates start from what is not known (that is, some perceived problem in professional practice)\" (p. 74). The professional research doctorate emphasizes applied research, an approach that does not necessarily start with what is known to discover new learning. Rather, it focuses on a known and immediate problem that exists in professional practice and on finding a way to address that particular problem. The emphasis on scholarly practice, research, methodology, and process to develop scholars remains intact, but often the emphasis has shifted to a professional practice problem. Perhaps Golde and Walker's definition of the purpose of the doctorate is more useful and contemporary than the traditional preparation of scholars. Their definition is \"preparing stewards of the discipline\" (p. 5). Challenges Facing the Nontraditional Student. There are numerous publications in the literature about challenges facing nontraditional students at the undergraduate level, fewer for students at the graduate level, and very few focused on the doctoral level. Bean and Metzner (1985) considered nontraditional undergraduate student attrition and suggest that \"nontraditional students are more affected by the external environment than by the social integration variables affecting traditional student attrition\" (p. 485). They quote Tinto in saying that \"while traditional students attend college for both social and academic reasons, for nontraditional students, academic reasons are paramount\" (p. 489). They further suggest that the nontraditional population is heterogeneous and it is difficult to \"develop a profile\" (p. 488). Nonetheless, they offer characteristics that include not living on campus, studying part time, and being older. Although their work is at the undergraduate level, it is safe to assume that these conclusions also apply at the graduate and doctoral levels. Steinheider, Costanza, Kisamore, and Reiter-Palmon (2006) report that nontraditional students enter doctoral programs with diverse academic and professional backgrounds and are employed in lower management through vice presidential levels in their organizations. These students have external pressures including raising children and caring for aging parents. The experience that these students bring into the program can be an asset for students and faculty in allowing for direct linkage of program content to the students' work. These students are less willing to simply accept theoretical assumptions and prefer to apply immediately what they have learned. They tend to be less willing to accept a primary research-oriented, traditional style doctoral program (p. 84). Ntiri 2001focuses on access to higher education for nontraditional and minority students, identifying nontraditional students as those who are married, single parents, financially independent, or first-generation students. She identifies \"reentry women\" (p. 135) as adult women who attend college while working full time in a technical, business, or professional field. Ntiri states that black reentry females make up the largest number of reentry females at the graduate and undergraduate levels. Ntiri concludes that many institutions fail to address the reentry woman's multiple and often conflicting demands of family, work, and college. She suggests that the use of technology and distance learning has expanded access for these audiences. Hagedorn and Doyle (1993) look at women doctoral students to assess how age affects institutional choice, retention, and scholarly accomplishments. They conclude that older female students make their institutional choices based on whether the institution offers the desired credential, the location, and the cost. These students spend more time on study than younger female doctoral students, but face obstacles in balancing study with personal time constraints and responsibilities. Maher, Ford, and Thompson (2004) differentiate between women doctoral students who are \"early finishers\" or \"late finishers\" of their doctoral degrees. The study finds that women students take on more responsibility than male students for problems that involve home and child care. Factors that delay degree completion include giving birth during the program, ending a marriage, caring for ailing parents, or experiencing the death of a close family member. Late-finishing women reported more difficulties balancing degree-related and family-related responsibilities."}, {"section_title": "The Traditional Doctoral Student", "text": "Until recently, students traditionally pursued a doctoral degree at a relatively young age (thirty or under), following completion of a baccalaureate and, possibly, a master's degree. The traditional doctoral student was also male, white, and, it appears, generally unmarried with no children. Although there are no good statistics to demonstrate this last characteristic, Gardner (2009) refers to a prevalent faculty opinion that when students have a family, they are no longer immersed in their doctoral studies and no longer displaying \"intensive devotion to a subject\" (p. 36). One element of this devotion was that doctoral students studied full time. They did not have an existing career and a full-time job. They financed their education by receiving tuition waivers or stipends and serving as graduate, teaching, or research assistants and worked in those roles only a limited number of hours per week. So, we can portray the profile of the traditional doctoral student as a twenty-something, unmarried, white male studying full time and serving in some sort of assistant role to his faculty mentor or member of his doctoral committee. He was singularly devoted to his area of study and research."}, {"section_title": "The Nontraditional Doctoral Student", "text": "We know from the literature that the nontraditional student is older, with the age of doctoral graduates averaging 33.3 years old in 2005 across all disciplines. Some disciplines are much older, with education coming in at 42.5 years (National Opinion Research Center, 2006, p. 24). The number of ethnic minority doctoral graduates is still relatively small, but the numbers expanded substantially between 1987 and 2007. Most doctoral students are now married, and many have children. Partly as a result, the contemporary doctoral student seeks greater flexibility in pursuing a doctorate. The contemporary doctoral student is as likely to be a woman as a man, is as likely as not to be studying part time, and is as likely as not to work outside of the traditional graduate, teaching, or research assistant role. Characteristics of a nontraditional student include being older, more engaged in family and work life, financially independent, and studying part time. It may be helpful to take a deeper look at an institution with a large number of nontraditional doctoral students. Capella University is an online university with more than 80 percent of its enrollment at the graduate level, including many nontraditional doctoral students. A very clear profile emerges about the Capella doctoral student. The average age is 43.5 years. More than two-thirds of the students are women (68.67 percent) and a majority are students of color (52.1 percent). Some 59 percent of the students are married. And, although there are no exact data about whether students have children or their number of children, the average family size is 2.8. This would seem to indicate that many of the students have children. That is especially true given that 17 percent of the doctoral students report that they are single parents. Nearly all of the students are studying part time and 90 percent are employed. And it appears that the doctoral student is often the primary financial provider for her family because they report that they provide more than 70 percent of the family's income. That family income level averages just over $50,000 per year. What emerges is a more definitive profile: a forty-something woman of color; married with children; and, if not fully engaged in a career, employed in a job that pays, on average, more than $35,000 per year. She studies part time, for obvious reasons. This is a remarkable contrast to the traditional profile. It comes as no surprise that these students cannot be as intensively \"devoted to a subject\" as traditional students, that they struggle to balance all of their responsibilities, and that they seek out programs that offer them flexibility in how, when, and where they participate."}, {"section_title": "Implications of the Changed Student Profile", "text": "The dramatic change in the profile of the doctoral student over the last twenty-five to fifty years has driven equally dramatic changes in the way students relate to faculty; their reasons for pursuing the doctorate; their expectations for flexibility as they balance career, life, and study; the types of delivery and participation modes they seek; and how they pay for their education. Faculty-Student Relations. One of the most dramatic changes is the role of the faculty and how they relate to their doctoral students. Clearly, the traditional expectation that the student would be immersed in his academic life has been challenged. Although the traditional model still exists, the relative proportion of doctoral students who study full time and work in the various assistant roles has declined as more part-time students have careers already in place. Indeed, the sheer magnitude of the growth of the number of doctoral students would literally not have been possible if the traditional assumptions about a student's complete dedication to study and role as an assistant to faculty had prevailed. In place of that traditional role, the contemporary doctoral student interacts with her faculty mentor on a part-time, intermittent basis. Although this shift in the faculty member's role means less time interacting with students face-to-face, the result is not necessarily a more manageable role. The faculty member working with the contemporary doctoral student must act as facilitator, coach, and colleague much more than the traditional faculty member. The contemporary doctoral student is older, more mature, and brings into the learning situation a wealth of real-world, career experience. The effective faculty member understands this and expects to learn as well as to teach, to act more as a colleague at times than a supervisor. Reasons to Pursue the Doctorate. Because contemporary doctoral students are often already engaged in their careers, they are not as likely as traditional students to be preparing to become full-time faculty members. They often want to teach but on a part-time basis or after retirement. Given the fields in which they are most often pursuing the degree, they are not likely to be preparing to serve as full-time researchers, whether inside or outside of higher education. Instead, they are seeking the degree most often to enhance an existing career or to transition to a different career. This represents a major shift from the origins of doctoral study and the way the doctorate was perceived and pursued only a few decades ago. The preparation of scholars whose sole focus was working either in academic or research settings has been supplanted, to some extent, by the preparation of scholars to pursue a wide range of professional activities. In turn, this shift to a broader array of career options has resulted in more varied and/or applied course content and dissertation topics. Clearly, the shift in some disciplines, particularly the professional areas, is toward applied research. Balancing Study with Career and Family. Another area of substantial change is the shift away from the portrait of a doctoral student as someone who is single, childless, and earning his way through doctoral study by serving as an assistant. The men and women involved in nontraditional doctoral programs generally work full time, have a spouse and/or children, and fit study into already busy lives. This has driven changes in the way the content of doctoral programs is delivered. Whether courses are offered on weekends, in the evenings, or online, flexibility has caused major changes in scheduling, faculty work hours, and more. Students cannot be assumed to be on campus or even coming to campus at all. Increasingly, they study online or in intensive formats that allow them to control when they will engage in study. Support Services. Because the nontraditional doctoral student has many competing demands and does not study full time, educational institutions have designed an interesting array of services to meet these students' needs. Time management courses make a good deal of sense for these students, as do services that are provided online or in concentrated sessions that limit the students' time away from work and family. These include online delivery of writing support, orientation sessions, research support (dealing with institutional review board issues and so on), and tools to create student study groups. There are also dissertation writing \"camps\" where a small number of students come together to spend several days focused on writing their dissertations in a quiet and supportive setting. Paying for the Doctorate. The traditional student generally received financial assistance in the form of a stipend and tuition waiver in exchange for serving as an assistant. In contrast, the nontraditional student studies part time and is employed. She generally pays her own education costs or borrows the money to pay for her studies."}, {"section_title": "A Doctorate Designed for the Nontraditional Student", "text": "To a certain extent, all doctoral programs have had to adapt to the differing focus and needs of the contemporary student. But there are still substantial differences in how a traditional doctoral program is designed and delivered compared to a nontraditional program. For example, Capella University recently designed and is now delivering an EdD program. The intent was to design a program for older students, working in educational settings, who wanted to address leadership and management issues in a manner that solved real professional problems in their work settings, who had to balance their study with career and family, and who were getting a doctorate to enhance their existing careers. The result is a program that is very different from the traditional doctorate. Design elements include the use of cohorts so that students can learn from one another over an extended period, beyond one school term, and enhance opportunities to build their knowledge from term to term. These cohorts mix students whose careers span different settings, responsibilities, disciplines, and roles, including those who work in higher education, K-12 education, consulting, and other educational arenas. The concept promotes peer learning that is broad and deep, prepares students to conduct actionresearch-based dissertations, and encourages doctoral students to consider and perform research from perspectives other than their own. The goal is to develop professional educators into action-research scholars who continually engage in this type of research throughout the remainder of their careers. The program curriculum is designed around the standards of respected P-12 organizations and aligned with the Competencies for Community College Leaders developed by the American Association of Community Colleges. The mix of leadership and management competencies is critical to the program, as both are required in education leadership positions. The student cohorts progress through the course-taking part of the doctoral program in a fixed sequence, developing from novice to expert in both research and academic writing skills. By the conclusion of the course sequence, they have developed an approvable dissertation proposal and are ready to start collecting data. As they move through the program, students maintain a portfolio that allows them to demonstrate the attainment of research skills in a program called FIRM (fully integrated research model), which includes twenty competencies that are learned over seven courses. Each student also engages with external experts who know the area of research or the problem they are addressing and assess the student's work from their expert perspective each term. The whole intent of these elements of the EdD is to recognize the knowledge and the challenges that these older, career-invested, part-time doctoral students bring into the learning experience. Their knowledge is valued and shared throughout the program, while broadening their own abilities to address problems encountered in the practice of their profession, expand their thinking beyond their own setting, and develop an ongoing network of peers who can be critical as well as supportive in both their scholarly and professional pursuits. The program also recognizes the special challenges faced by these older students. They are provided special services or course work that enables them to better manage their time, improve selected skills, and progress and succeed through the program even though they cannot immerse themselves in study. The cohort model itself, especially when combined with a structured course sequence and continuous enrollment, is designed to create a clear path to success."}, {"section_title": "Conclusion", "text": "Although the term nontraditional may not exactly fit any longer, the contemporary doctoral student is far different from the traditional doctoral student. Rather than a single white male, studying full time, on campus, and working in the department to help fund his education, the contemporary doctoral student is more likely to be a married woman with children and a career who is studying part time, often at a distance, and is funding her own education either through her current income or by borrowing. This dramatic shift has occurred relatively recently because women were in the minority of doctoral graduates throughout the twentieth century. Students of color have become more numerous only in the last ten to twenty years. Yet, the shift is real and is going to become more pronounced over time. That is why, even if the term nontraditional could be justified today, the concept of the traditional doctoral student is going to need to change to reflect contemporary reality."}]