[{"section_title": "Abstract", "text": "Abstract\nThe aim was to study the role of leptin in the development of dementia. Methods:\nFollow-up of the ALEXANDROS cohorts, with baseline measurements in 2000. From 1,136 available subjects free of dementia at baseline, 667 subjects had frozen baseline blood samples for measuring leptin and soluble leptin receptor (sOB-R). The free leptin index (FLI) was calculated as the ratio of leptin to sOB-R. Dementia was defined as an MMSE score <22 and a score >5 in the Pfeffer Activities Questionnaire. Results: After 15 years of follow-up, 42 incident cases of dementia were identified. No difference in serum leptin was observed between people with and without dementia, but sOB-R was higher in demented than in nondemented subjects (sOB-R: 44.94 ± 23.97 vs. 33.73 ± 21.13 ng/ml). The adjusted risk for dementia increased, the higher the log sOB (hazard ratio = 3.58; 95% CI 1.72-7.45, p = 0.001). Conclusion: Lower availability of free leptin was found in demented than in nondemented people, suggesting a role of leptin in cognition."}, {"section_title": "Introduction", "text": "As the population in Latin America is aging, dementia is becoming a major public health problem mirroring the rates seen in developed countries. A review of 8 studies in 6 countries [1] found a global prevalence of 7.1% (95% CI 6.8-7.4) in people aged 65 years and older, with rates being twice as high in the illiterate versus literate population. Alzheimer's disease (AD) accounts for most cases of dementia. Similar results are published for Argentina, Brazil and Venezuela in a review done in developing countries by the world federation research group [2] . In Chile, the reported prevalence of dementia in the SABE study was 8.1% in the total sample, with higher rates among women (8.9%) compared to men (6.9%) and 22 .8% in illiterate women [3] . In a representative sample of older urban Chileans, the rates were 7.3% in the total sample but 25.5% among people aged 80 years and older [4] .\nSeveral epidemiological longitudinal studies have shown that obesity in midlife is a risk factor for dementia [5, 6] . Obesity may increase the risk of cognitive impairment by actions at both central and peripheral levels. Vascular health and neurodegeneration have been linked to insulin resistance, low-grade inflammation, dyslipidemia and diabetes, especially for its effect on the brain microcirculation. However, new hypotheses have recently arisen, linking adipose tissue to this association [7] . Although the mechanisms are not clearly elucidated, various pathways mediated by the action of adipokines in certain brain regions have been proposed.\nGrowing evidence on the effect of leptin is emerging. Experimental studies show that leptin modulates structural and functional changes in the hippocampus and improves memory. In leptin-deficient rats, lower brain volume and disruption of hypothalamic pathways have been demonstrated [8] . More importantly, in vitro studies have shown that infusion of leptin reduces β-amyloid secretion and leptin treatment in leptin-deficient rats reduces levels of β-amyloid in the brain [9, 10] . Leptin reduces the activity of β-secretase and increases the APOE-dependent uptake of β-amyloid in neurons [11] . Paradoxically, leptin levels are increased in obesity, and in accordance with experimental studies in rats, leptin also increases with aging [12] [13] [14] .\nThe actions of leptin are mediated by the leptin receptor (OB-R) belonging to the family of class I cytokine receptors [15, 16] . There are leptin receptors in hypothalamic neurons and neurons of the cerebral cortex and hippocampus [17] . Furthermore, the presence of a soluble receptor (sOB-R), which represents the main leptin binding activity, has been demonstrated in peripheral blood [18, 19] and reflects the density of the membrane OB-R [20] .\nThe maintenance of high levels of adiposity besides high leptin levels suggests an alteration of leptin action in obese older adults. Leptin resistance would be produced by an alteration of transport across the blood-brain barrier or intrinsic resistance of the sensitive neurons of the hypothalamus, hippocampus and other brain regions [21] . Therefore, the determination of leptin resistance is crucial to study the association between leptin and dementia. Leptin resistance has been studied by the free leptin index (FLI) highlighting the importance of leptin availability for leptin action.\nIn this context, the current study estimated the independent contribution of leptin availability for developing dementia."}, {"section_title": "Methods", "text": ""}, {"section_title": "Subjects", "text": "Follow-up of the subjects recruited for the Santiago de Chile SABE study [22] and the ALEXANDROS study was designed to study the trajectories of disability associated with obesity in older Chileans [23] . As shown in the data flow ( fig. 1 ), at baseline, 2,026 subjects from the SABE and ALEXANDROS cohorts had complete data and 1,903 were free of dementia. As of June 30, 2015 , information from 1,588 participants was available, 229 were lost to follow-up and 86 refused participation. From the 1,588 subjects, 452 had deceased. After 7,405.9 person-years of follow-up, a total of 106 dementia cases were identified. Among the 1,136 participants evaluated, 667 subjects had frozen baseline blood samples available for the current analysis, among which 42 incident dementia cases were identified.\nThe study protocol was approved by the institutional review board of the Institute of Nutrition and Food Technology of the University of Chile and the Ethics Committee of the Chilean National Council for Science and Technology Research (CONICYT). All the participants provided informed consent for the use of the frozen samples for future research."}, {"section_title": "Diagnostic Criteria", "text": "Dementia was defined with a screening test validated for Chile consisting of a score <22 on the Mini Mental State Examination (MMSE) [24] and a score >5 in the Pfeffer Activities Questionnaire [25] , a combination that estimates the prevalence, with 94.4% sensibility (95% CI 58.9-80.3) and 83.3% specificity (95% CI 72.3-90.7) [26] . Depression was assessed with the Geriatric Depression Scale (GDS-15) [27] and defined as having a score >4."}, {"section_title": "Measurements", "text": "In the cohorts studied, all subjects provided blood samples at the first evaluation. These samples were frozen at -80 ° C. The samples were thawed and plasma levels of leptin, adiponectin and soluble leptin receptor (sOB-R) were determined according to the manufacturer's protocol.\nLeptin levels were measured using ELISA (ALPCO, Diagnostics, Salem N.H., USA). The limit of detection for leptin was 0.50 ng/ml. The intra-assay coefficient of variation was 4.6% and the interassay coefficient of variation was 6.0%. sOB-R was measured by ELISA kit (Cusabio, Biotech Co., Ltd., PR China), with a limit of sensitivity of 0.78 pg/ml, an intra-assay coefficient of variation of <8% and an interassay coefficient of variation of <10%. The FLI was defined as the ratio of leptin to sOB-R. Adiponectin levels were measured using a total adiponectin ELISA (ALPCO, Diagnostics). The limit of detection was 0.019 ng/ml. The intra-assay coefficient of variation was 5.4% and the interassay coefficient of variation was 5.0%."}, {"section_title": "Statistical Analysis", "text": "Continuous variables were expressed as means ± SD and 95% CI. Categorical variables were expressed as medians and percentiles or percentages and 95% CI. Both the difference between sex and the difference between incident cases of dementia and controls were calculated by two-sample mean-comparison test or Pearson's χ 2 test, depending on the type of variables. Previous log transformation of leptin and sOB-R concentrations, and Cox proportional hazard models were used to analyze the association among studied variables and dementia. All statistical analyses were performed using STATA 14 software (StataCorp. 2015, Stata Statistical Software, release 14, College Station, Tex., USA)."}, {"section_title": "Results", "text": "The baseline characteristics of the 667 subjects studied (70% women) are displayed in table 1 . Mean age was 60 years (SD 3.3 years), 8 .7% of the sample lived alone and 60% had less than 8 years of education, which was similar in both men and women. A high proportion of the sample was obese, with rates being higher in women [37.9% (33.33-42.37 )] compared to men [26.5% (20.13-32.90) ]. The frequency of hypertension was 46.5%, that of diabetes was 16.5% and that of depression was 29.6%, similar in both men and women.\nLeptin and sOB-R levels were higher in women (leptin 27.26 ± 15.58 ng/ml; sOB-R 37.55 ± 22.7 ng/ml) than in men (leptin 11.31 ± 9.04 ng/ml; sOB-R 26.858 ± 15.87 ng/ml; p < 0.001). FLI and adiponectin were also higher in women than in men (0.999 ± 0.925 vs. 0.564 ± 0.557, p < 0.001, and 12.91 ± 5.3 vs. 29.14 ± 3.59 ng/ml, p < 0.001).\nAs of June 30, 2015, the incident cases of dementia were 42 (64.3% women) out of 667. The mean age of the cases was higher than that of noncases (67.4 ± 0.49 vs. 65.88 ± 3.02 years, p < 0.01), with a higher proportion having <8 years of education among the subjects with dementia versus those without dementia (83.3 vs. 59.3%, p = 0.02) as shown in table 2 .\nLeptin concentration was not different between the groups; however, sOB-R was higher in subjects with dementia compared to those without dementia (44.94 ± 23.97 vs. 33.73 ± 21.13 ng/ml, p = 0.0012) and FLI was lower in demented compared to nondemented subjects (0.69 ± 0.86 vs. 0.88 ± 0.85, p = 0.081). No differences between the demented and nondemented group were observed regarding hypertension or diabetes at baseline, although the proportion of depression at baseline was higher among incident cases compared to noncases. Differences in nutritional state were observed mainly in the proportion of people with a BMI <20 among the incident cases ( table 2 ) .\nIn table 3 , the plasma leptin, sOB-R and FLI concentration by BMI and waist circumference categories are shown. Higher leptin and FLI were observed in obese compared to Values are means ± SD with 95% CI in parentheses or percentages with 95% CI in parentheses, unless indicated otherwise. *** p < 0.001.\nnormal or underweight subjects and across categories of BMI. No differences in sOB-R were observed but FLI was higher in people with a large waist circumference (1.10 ± 0.95) compared to those with a smaller waist circumference (0.53 ± 0.55).\nCox hazard proportional models ( table 4 ) adjusted for sex, age and education showed that the relative risk of having dementia increased, the higher the log sOB-R (hazard ratio = 3.38; 95% CI 1.72-7.45). Neither obesity, measured by BMI or waist circumference, hypertension nor diabetes were related to greater odds of dementia; however, depression at baseline remained a significant risk factor (hazard ratio = 4.33; 95% CI 1.94-7.49) for dementia. "}, {"section_title": "Discussion", "text": "In this cohort study of community-living people aged 60 years and older in Santiago de Chile, we found that low leptin availability -represented by a high sOB-R and a high FLI -is a risk factor for dementia. sOB-R, the stronger binding activity of leptin, has been shown to modulate plasma leptin [28] regulating the bioavailability of free leptin.\nThe neuroprotective action of leptin has been demonstrated in animal models and has been ascribed to leptin's role in neuroprotection and neurogenesis in the hippocampus [29] . On the other hand, a disorder in leptin signaling at the hippocampus has been observed in AD patients by the same authors. The 8 years of follow-up of the Framingham cohort have shown that leptin is inversely related to AD and directly associated with markers of brain health [30] .\nParadoxically, a number of epidemiologic studies have shown that obesity, characterized by high levels of circulating levels of leptin [31] , increases the risk of dementia and is associated with damage of the brain structure and a decrease in the brain volume [30] . In the Baltimore longitudinal study of aging [32] , the authors have shown that a high BMI is associated with a faster decline in memory and executive function over time. However, longitudinal studies are not conclusive. A study carried out in men in Australia looking for an association with incident AD [33] did not find an association. Insights for these apparent contradictory results are highlighted by the study of the trajectories of dementia by BMI over time in the cardiovascular health study [5] where midlife obesity was associated with higher dementia risk but BMI after 65 years was inversely related with incident dementia. Concordant results were obtained in a twin study [34] conducted in Sweden among 8,534 twins aged 65 years and older, where overweight and obesity at midlife independently increased the risk of AD and vascular dementia. Similar results were observed in a 27-year follow-up study conducted among 10,276 people registered in a health care delivery organization from California [6] , where obesity in midlife increased the risk of dementia independently of comorbid conditions.\nWe did not find an association between dementia and obesity measured by BMI or waist circumference. The Sacramento Area Latino Study on Aging (SALSA) [35] found a lower risk of cognitive impairment in relation to high levels of leptin at the 10-year follow-up only in people with no abdominal obesity but not in subjects with a large waist circumference (men >40 in; women >35 in). However, our results are concordant with the higher availability of free leptin in people without dementia in both obese and nonobese subjects. The higher FLI and lower leptin sOB-R concentrations in obese people than in normal or underweight subjects mean that in this cohort the obese were not leptin resistant. Moreover, in the same cohorts, obese participants have higher survival and lower disability than normal and underweight subjects [36, 37] . On the other hand, among the incident cases of dementia, we found a significantly higher proportion of low weight at baseline compared to subjects who did not develop dementia. This finding is similar to what has been found in some studies showing a weight decrease preceding the appearance of AD [6] and in people with incipient AD [38] , suggesting that the weight decrease is another sign of early brain dysfunction. A limitation of our study is that the diagnosis of dementia was done with a screening test [26] ; therefore, it is possible that some people with incipient dementia were not detected at baseline. However, the screening test has proved to have high sensitivity and specificity and is used in many Latin American countries for population studies [22] .\nAnother limitation is that we do not have obesity data at midlife; therefore, we are unable to determine if earlier obesity is a risk factor for dementia. The longitudinal design and the length of the follow-up (15 years) are the principal strengths of the study.\nThe relationship between obesity and dementia is complex, considering that both obesity and aging are associated with pathophysiological changes through which brain damage can be caused. Although we did not find an association between obesity and dementia, other studies in younger cohorts are needed to assess the effect of demographic origin on that association. The huge lifestyle changes of the Latin American population that have occurred in the past three decades [39] , with a high prevalence of obesity and sedentary behavior in all age groups [40] , should have important implications for the future health of an aging society with an increasing burden of dementia, in which the prevalence of obesity and overweight reaches almost half of the population.\nAlthough it was not the focus of the current research, this study confirms the importance of depression in older people. The fourfold adjusted risk of dementia in people with depression at baseline compared with people not having depression highlights the importance to detect and treat depression in older people."}]