[{"section_title": "Introduction", "text": "Social scientists have devoted a great deal of attention to understanding the effects of educational attainment on a range of outcomes. These effects are a large factor in many policy decisions, such as whether to subsidize education programs for GED certification (Cameron and Heckman (1993) ), how much to invest in preventing students from dropping out of school (Dearden et al. (2009 ), Oreopoulos (2007 ), and setting the age at which children should be eligible to enter school (Aliprantis (2010) ) and the labor market (Deming and Dynarski (2008) ). More generally, it is important to understand the effects of education when designing a range of interventions to improve outcomes, especially those focusing on health (McCrary and Royer (2009) ), early childhood interventions ), labor market skills (Heckman et al. (1999) ), earnings (Card (1999) ), and housing (Sanbonmatsu et al. (2006) ). However, since educational attainment is chosen endogenously by individuals, it is difficult to identify its causal effects (Card (2001) ).\nOne widely used approach to identifying causal effects of educational attainment uses quarter of birth as an instrument for educational attainment, a literature that began with the seminal work of Angrist and Krueger (1991) . This identification strategy uses the naturally occurring variation in birth dates together with schools' entrance cutoff dates to assign different levels of education to children of the same age. This framework has since been used in many settings, but in its original setting it is combined with compulsory schooling laws that prohibit students from dropping out of school before a specific age. Since these compulsory schooling laws apply to students' ages, otherwise similar children are legally able to withdraw from school with differing levels of educational attainment. The crucial identifying assumption of monotonicity in this framework is that quarter or date of birth affects all children's educational attainment in the same way.\nThe contribution of this paper is to show that parents delaying their children's initial enrollment in kindergarten, a practice known as redshirting, makes it all but impossible to interpret estimates of the effects of educational attainment when date or quarter of birth is used as an instrument for educational attainment. Theoretical evidence is presented that redshirting creates violations of the monotonicity assumption necessary to identify many of the causal effects of educational attainment estimated in the literature. The paper also presents empirical evidence from the Early Childhood Longitudinal Study, Kindergarten Class of 1998-99 (ECLS-K) data set indicating not only that redshirting is common, but that heterogeneity in the treatment effect of educational attainment is likely a factor in parents' redshirting decisions. The paper discusses in detail exactly how the interpretation of the estimator breaks down when this evidence is considered. Despite previous scrutiny that has already been given to this identification strategy, date of birth has been and continues to be used as an instrument for the Local Average Treatment Effect (LATE) or Average Causal Response (ACR) of educational attainment in a wide variety of applications. 1 The novelty of this paper is to highlight the distinct methodological problem redshirting creates when date of birth is used as an instrument for educational attainment, an important factor when considering the results from this literature. 2\nThe result presented in this paper is pertinent to the wider discussions about the role of theory in empirical microeconomics (Keane (2010) , Heckman (2010) , Imbens (2010) ), and is especially relevant to discussions about the interpretation of estimates generated by natural experiments (Rosenzweig and Wolpin (2000) ). One line of research on these topics by Heckman and coauthors (Heckman et al. (2006) , Heckman and Urzúa (2010) ) emphasizes that while recent developments in the instrumental variables (IV) literature allow for responses to treatment to be heterogeneous, the monotonicity assumption in these models restricts the choice into treatment from being similarly heterogeneous. The way parents choose to redshirt their children violates this assumption, a scenario Heckman et al. (2006) refer to as essential heterogeneity. This example accentuates the importance of understanding the relationship between the Rubin Causal Model developed in the Statistics literature and the Roy Model developed in the Economics literature (Heckman (2005) , Sobel (2005) ).\nThe paper is organized as follows: Sections 2 and 3 discuss the identifying assumptions of several causal treatment effects within a canonical framework. Section 4 presents the popular application of this framework using date of birth as an instrument for educational attainment to obtain causal effects of schooling. Section 4 also demonstrates how redshirting violates the identifying assumption of monotonicity, and Section 5 examines data from the ECLS-K data set illustrating the empirical magnitude of this problem. Section 6 goes into detail about how the interpretation of estimates obtained by this identification scheme is affected by redshirting, and this Section also presents a very brief overview of the literature affected by this issue. Section 7 concludes."}, {"section_title": "Identifying Treatment Effects Using Randomization", "text": ""}, {"section_title": "The Average Treatment Effect (ATE)", "text": "Consider a standard framework for studying causal treatment effects (Holland (1986 ), Rubin (1974 ). Let Y i (1) and Y i (0) be random variables associated with the potential outcomes in the treated and untreated states, respectively, for individual i. D i is a random variable indicating receipt of treatment, where\n0 if treatment is not received."}, {"section_title": "The measured outcome variable", "text": "Since both treatment states are not observable for any individual i, inference cannot be drawn about the value of Y i (1) − Y i (0). However, causal inference can be made under specific assumptions. One such assumption that allows for inference about average effects on a population, which Holland (1986) calls independence, is that:\nThis assumption is typically operationalized by the researcher's random assignment of individuals to treatment groups. When true, this assumption yields\nas an unbiased estimator of the Average Treatment Effect (ATE):"}, {"section_title": "Identifying Treatment Effects Using Instrumental Variables", "text": "When the researcher does not control the assignment of individuals to treatment groups, and therefore is not assured of independence, one strategy for identifying treatment effects is to search for an instrumental variable. Define \nNote that Equation 1 follows due to Assumption 1-i, and that Equation 2 in its present form represents a comparison of average outcomes between those individuals who \"switch-in\" and those who \"switch-out\" of treatment due to changes in the instrument. Much of the ensuing discussion of instrumental variables is focused on ensuring that Equation 2 identifies a treatment effect of interest by placing restrictions on how changes in the instrument induce changes in treatment. Imbens and Angrist (1994) and Angrist and Imbens (1995) discuss and develop several assumptions that allow for the identification of treatment effects when combined with Assumption 1."}, {"section_title": "Constant Treatment Effect", "text": "Consider a version of Assumption 2 where the researcher assumes a constant treatment effect:\nWhen Assumption 1 and 2a hold, β is identified, as Equation 2 becomes:"}, {"section_title": "The Average Treatment Effect for the Treated (ATT)", "text": "A researcher might also have reason to believe that there is some value of the instrument, Z = w, for which no individual receives treatment. That is:\nIn this case, Equation 2 becomes:\nallowing us to identify what Imbens and Angrist (1994) call the Average Treatment effect for the Treated (ATT) parameter:"}, {"section_title": "The Local Average Treatment Effect (LATE)", "text": "A final approach, originally proposed in Imbens and Angrist (1994) , is to make a monotonicity assumption. The assumption of monotonicity is that if the instrument induces changes in treatment, these changes must be the same for all individuals. This assumption allows for treatment effect heterogeneity, and also allows for some individuals to receive treatment at all values of the instrument. Under the assumption of monotonicity, all of the individuals affected by the instrument are either caused to \"switch-in\" or else to \"switch-out\" of treatment. Specifically:\nAssumption 2c: For all possible values of z and w, either \nallowing us to identify the LATE:\nVytlacil (2002) "}, {"section_title": "Multiple Treatments and the Average Causal Response (ACR)", "text": "Now consider a scenario in which the instrumental variable is still dichotomous, but individuals may receive three treatment intensities:\n2. Angrist and Imbens (1995) develop an extension of the LATE in which Assumption 1-i becomes:\n, and D(z) are jointly independent of Z, while Assumption 2 is the same as necessary to identify the LATE (ie, 2c). Angrist and Imbens (1995) proved that if Assumptions 1 and 2 are true, and P r(D(1) ≥ j > D(0)) > 0 for at least one j ∈ {0, 1, 2}, then it is possible to identify a weighted average of treatment effects, which they call the Average Causal Response (ACR):"}, {"section_title": "Date of Birth as an Instrument for Educational Attainment", "text": "We now consider the widely used application of the LATE and ACR that is the focus of this paper: using date of birth to identify causal effects of educational attainment. In the United States, children are eligible to begin kindergarten if they turn 5 before a specific entrance cutoff date. To continue with the previous framework in which the instrumental variable is dichotomous, consider only those children born in the quarter before (Q b ) or the quarter after (Q a ) the entrance cutoff date. Our instrument Z is a binary variable which takes value 1 if a child is eligible to enroll, and 0 if the child must wait a year before enrolling in kindergarten. That is,\nConsider the group of children first entering kindergarten in the fall of 1998, and define treatment to be educational attainment at age 6. 5 This group is displayed in Figure 1 . Note that some of these children were eligible to enroll in the fall of 1997, but were redshirted. That is, their initial enrollment in kindergarten was delayed by one year. As well, notice that a similar group of children eligible to enroll in the fall of 1998 will wait until the fall of 1999 to enroll in kindergarten for the first time. Evidence will be presented in Section 5 that this phenomenon is not prevalent among children in Q a , as very few children in that group delay their enrollment. Evidence will also be presented in Section 5 that very few children in Q a enroll before they are first eligible. Thus our model will assume that no children in Q a enroll before they are first eligible, and that no children in Q a delay their enrollment. Under these assumptions, just as in the model in Section 3.4, there are three levels of treatment:\n1 if born in Q b and enrolled when first eligible.\nThe three levels of treatment intensity are necessary to allow for the possibility that the monotonicity assumption is violated. As discussed in Angrist and Imbens (1995) , it is only when there are multiple treatment intensities that the monotonicity assumption has testable implications. 6 We further assume that children in each quarter all receive the same schooling as the youngest child born in the same quarter. These assumptions are displayed in Figure 1 . Further assume there exists a latent index:\nand that treatment status depends on quarter of birth through this latent index as follows:\nHeterogeneity is introduced into the model by assuming there are two types of children, τ ∈ {H, L}. We allow for the possibility of two types of heterogeneous treatment effects, {β H 1 , β L 1 } and {β H 2 , β L 2 } , as well as the possibility that there is heterogeneity in how the instrument Z affects one's latent index, γ H 1 and γ L 1 . Thus Equation 5 becomes:\nand our outcome variable is:\nFigure 1 helps to clarify that β 1 is the effect of receiving 0.25 years less schooling at a given age and β 2 is the effect of receiving 0.75 years more schooling at a given age."}, {"section_title": "Heterogeneous Treatment Effects Satisfying the Monotonicity Assumption", "text": "The assumption of monotonicity is that those individuals affected by the instrument must all be affected in the same way. In terms of our model, this assumption is that either γ H 1 = γ L 1 , or else one of γ H 1 or γ L 1 is equal to 0. One example satisfying the assumption of monotonicity is where γ H 1 = γ L 1 = 1. In this case, all parents enroll their children when first eligible. Let S 1 be educational attainment on a child's sixth birthday for those with z = 1, and S 0 be educational attainment for those with z = 0. Changing the instrument from 0 to 1 induces all children to \"switch-in\" to the \nIt is also of interest that since children will receive one of only two treatments (D ∈ {0, 1}), the comparison of outcomes by treatment status in this case will yield the same parameter for the ACR as well as the LATE. Under the assumptions presented here, comparing average outcomes by instrument status allows for the identification of causal treatment effects of educational attainment. "}, {"section_title": "Heterogeneous Treatment Effects", "text": "Equations 8 and 9 have very different interpretations, which raises two empirical questions.\nFirst, is redshirting common? If redshirting is not a prevalent phenomenon, then P r(τ = L) is small, resulting in only minor biases to the LATE or ACR parameter when using date of birth as an instrument for educational attainment. Second, are redshirting decisions different for those with different effects of educational attainment? That is, is it empirically true that for types τ ∈ {H, L} for which γ H 1 = 1, γ L = −1, and Equation 7 accurately describe the redshirting decision, β H 2 = β L 2 ? If this is not the case, then the model of essential heterogeneity just presented is possibly inappropriate.\nThe next Section presents empirical evidence that redshirting is prevalent and that it is appropriate to apply the specified model of essential heterogeneity to the process of redshirting in the data set examined. Together with the theoretical considerations just presented, this empirical evidence complicates the interpretation estimates of the LATE or ACR of educational attainment obtained when using date of birth as an instrument for educational attainment. A detailed example illustrating these complications is considered in Section 6. "}, {"section_title": "Empirical Evidence Regarding the Violation of Monotonicity", "text": ""}, {"section_title": "Data", "text": ""}, {"section_title": "Variables", "text": "Following the terminology in Bedard and Dhuey (2006) , we refer to the relative age at which a child would be observed if they entered kindergarten when first eligible as assigned relative age, and the child's actual age relative to their school's cutoff date as observed relative age. Figure 2 shows this relative age measured in months. For example, consider a child who lives in a state where the entrance cutoff age is exactly 5 years old at the start of the school year. Then a child who is 5 years and 3 months old at the start of the school year when first eligible to enroll is in the relative age group M 4 . If the child redshirts they will join M 16 , and they will be in M −9 if they enter early.\nNote that only in group M 4 will the child's assigned relative age agree with their observed relative age.\nIn order to assign children in the ECLS-K to these relative age cohorts, the ECLS-K public data file was used to obtain data on respondents' exact birth date, as well as school-level entrance cutoff dates. All variables represented as calendar dates were first converted to a daily time line in which day 1 is January 1, 1990. After all time-related variables were first constructed using this time line, these daily variables were divided by 365 to create annual variables. The yearly variables were then multiplied by 12 in order to create variables measured in months. A child's relative age (RA) is constructed as the age (in months) at the cutoff date minus 60. These data are discussed in greater depth in Aliprantis (2010). Table 1 shows the distribution of observations in the ECLS-K in each relative age group when using school-level entrance cutoff dates, including children repeating kindergarten. Table 2 shows the same data, but for the sample including only first-time kindergarteners. If we assume parents' decision rule for determining observed entry age does not change over time, cutoff dates stayed the same between 1997 and 1998, and that any seasonal patterns in number of births are repeated every year, then we may use Tables 1 and 2 to estimate the percentage of children in each relative age group who enter early, when first eligible, or after redshirting. These estimates are presented in Tables 1 and 2. Tables 3 and 4 show these estimates aggregated to the level of quarters."}, {"section_title": "Empirical Evidence that Redshirting is Prevalent", "text": "Examining Tables 2 and 4, note that 27% of children who turned 5 within one month of their school's cutoff date are redshirted, as are 19% of children who turned 5 within one quarter of their school's cutoff date. The percent of children delayed in school by month and quarter rises to 31% and 23%, respectively, if we include children who are held back after starting school (Tables 1 and   3 ). These figures suggest that the scenario described in Section 4.2 is empirically large, with a conservative estimate of P r(τ = L) being 0.19. That is, Equation 9 becomes:\nAn alternative presentation of these data is given in Figure 3 , which follows the assumptions discussed in Section 4 and uses the data from Table 3 to show the cumulative distribution functions (CDFs) of S given Z=1 and Z=0 for the cohort of children first eligible to begin kindergarten in the fall of 1998. Note that these CDFs cross, in contrast to the testable implication of monotonicity proposed in Angrist and Imbens (1995) ."}, {"section_title": "Empirical Evidence of Essential Heterogeneity", "text": "To investigate the relationship between redshirting and treatment effect heterogeneity, Tables 5-7 present descriptive statistics of children in the groups from Figure 1 : Those in Q b who delayed enrollment, those in Q a and Q b who enrolled when first eligible, and those from Q a who enrolled before first eligible. The first column presents these statistics for the entire ECLS-K sample, and the final column presents the P-value of an F-test of the equality of means for children in the 4 groups from Figure 1 . We see that the children who delayed enrollment were disproportionately wealthy, white, male, English-speaking, had better-educated parents and more books at home, and had never received WIC benefits as an infant or child. It is interesting to note that those who delayed enrollment also had mothers who worked less, but there was no difference between the employment patterns of fathers by enrollment status. These redshirting patterns are consistent with those documented in Dobkin and Ferreira (2007) and Deming and Dynarski (2008) .\nThis evidence from the ECLS-K shows that redshirting patterns are different for a specific group of children, but the model of essential heterogeneity in Section 4.2 requires that redshirters are affected differently by educational attainment than other children. Since we never observe the counterfactual of redshirters entering on time, it is difficult to conceive of conclusive evidence that there are, or are not, differences in the effects of educational attainment between redshirters and non-redshirters. The current evidence on the impacts of redshirting examines outcomes only after children have been redshirted (Graue and DiPierna (2000) ).\nHowever, there is empirical evidence that strongly suggests treatment effect heterogeneity between redshirters and non-redshirters. First, parents redshirt children based on perceived treatment effect heterogeneity. Although there is no clear definition of the word \"readiness\" (Ackerman and Barnett (2005)), the fact that parents and schools use some measure of readiness, however imprecise (Stipek (2002) ), means that parents clearly choose to delay there children's entry into kindergarten based on perceived heterogeneity in the effects of educational attainment (Graue (1993) ). Second, there is direct evidence of heterogeneity in the effect of educational attainment on earnings (Chernozhukov and Hansen (2006) ). Finally, there is ample evidence of heterogeneity in the effects of many educational interventions over the demographic variables characterizing redshirters. For example, there is evidence that income (Blau (1999) ), home inputs such as the number of books at home (Todd and Wolpin (2007) , Aliprantis (2010) ), mother's time at home (Datcher-Loury (1988)), mother's educational attainment (Murnane et al. (1981) ), maternal employment (Bernal and Keane (2010) ), gender (Dee (2007) , Hastings et al. (2006) ) and race (Currie and Thomas (1995) , Garces et al. (2002) , Hanushek et al. (2004) , Dee (2004b) , Krueger (1999) ) all play important roles in the effects of education interventions. While inconclusive, this empirical evidence points in favor of the model of essential heterogeneity specified in Section 4.\n6 Example: Angrist and Krueger (1991) Redshirting was likely not prevalent among males in the US born between 1930 and 1959, the sample studied in Angrist and Krueger (1991) (henceforth AK). 7 However, AK introduces the seminal framework for the instrument being discussed, and understanding how redshirting would have affected its estimates helps to illustrate the problems redshirting creates for newer samples in which redshirting is prevalent. Consider the Wald estimates obtained in AK. Let Y be log weekly wages, Z is being born in the quarter either before (Z = 1) or after (Z = 0) the entrance cutoff date, and D is treatment intensity. 8 D is now defined more generally than in Section 4 as educational attainment at a given age, and will be used interchangeably with schooling attainment 7 Considerations related to the diffusion of public kindergarten in the US (Cascio (2009) , Deming and Dynarski (2008) ) may be more relevant to the sample in AK. 8 We abstract from the fact that in AK the value Z = 1 actually indicates a birth date in any of the first three quarters before the cutoff date. "}, {"section_title": "The Case of a Strong Instrument", "text": "Suppose that everyone responds to the laws used as an instrument. This is not necessarily realistic in the case of AK, as it implies that everyone would drop out at the age when first eligible.\nHowever this is a more realistic assumption if the instrument is only entrance cutoff dates and the outcome of interest is measured at a given age for all individuals. Returning to the latent index in \nand Combining Equations 10 and 11 yields the following Wald estimator:\nIt is not clear a priori what parameters from the model in Section 4 we are most interested in estimating. Regardless, Equation 12 shows that the given identification framework leaves all of them unidentified. Moreover, fundamentally different values of these parameters yield the same value for the Wald estimator. Figure 4 illustrates the set {(β H 2 , β H 1 )} solving Equation 12 when the Wald estimator takes the value obtained in Table III "}, {"section_title": "The Case of a Weak Instrument", "text": "The problems created by redshirting are even worse if compulsory schooling laws are a weak instrument. This is a more realistic assumption in the case of laws that prohibit individuals from dropping out of school, and it is one of the main criticisms of AK (Bound et al. (1995) , Cruz and Moreira (2005) \nSimilar arguments hold for E[D|Z = 1] − E[D|Z = 0] to obtain:\nOur problem has grown from one equation with two unknowns to one equation with four unknowns! Again, there are many conceivable values of {β H 2 , β L 1 , π H , π L } solving Equation 13 for the value of β W ald obtained in AK, many of which carry quite different interpretations of how educational attainment effects wages. The complications introduced by redshirting make the Wald estimates all but impossible to interpret, so that \"biased\" is not an accurate label for estimates obtained in this scenario. In our example we are simply unable to identify treatment parameters due to the breakdown in the IV framework."}, {"section_title": "Implications for the Literature", "text": "The preceding example illustrates that parameters of interest may be unidentified when quarter or date of birth is used as an instrument for educational attainment. The implications of redshirting for parameter estimates in the literature will depend on the nature of redshirting in the sample being 9 AK estimate that for men born between 1920 and 1929, E[D|Z = 1] − E[D|Z = 0] = 0.1256 studied, as well as the exact way redshirting interacts with the compulsory schooling laws being used. Nevertheless, there is a large literature for which redshirting might be a relevant concern, as compulsory schooling laws have been used to estimate a wide range of parameters. A sample of these parameters includes the effects of schooling on AFQT scores (Neal and Johnson (1996) , Cascio and Lewis (2006) ), civic participation (Dee (2004a) , Milligan et al. (2004) ), criminal activity (Lochner and Moretti (2004) ), mortality (Lleras-Muney (2005)), happiness (Oreopoulos (2007) ), and general health outcomes (Adams (2002) ); the effects of maternal education on infant health (McCrary and Royer (2009) ) and fertility decisions (Black et al. (2004) ); the effect of parents' educational attainment on children's educational outcomes (Oreopoulos et al. (2006) ); the magnitude of human capital externalities (Acemoglu and Angrist (2000)); and the effects of kindergarten entrance age on educational outcomes (Bedard and Dhuey (2006) , Datar (2006) , Elder and Lubotsky (2008) and McEwan and Shapiro (2008) ). It should also be noted that although the Regression Discontinuity Designs (RDDs) discussed in the literature such as Hahn et al. (2001) and Imbens and Lemieux (2008) are for binary treatments, redshirting has implications for the appropriate application of RDDs."}, {"section_title": "Conclusion", "text": "Beginning with the seminal work of Angrist and Krueger (1991) , a wide literature has sought to estimate the effects of educational attainment using quarter or date of birth as an instrument for educational attainment. In this paper we have provided theoretical and empirical evidence that parents delaying their children's initial enrollment in kindergarten, a practice known as redshirting, makes it all but impossible to interpret estimates of the effects of educational attainment using this identification framework. Theoretical evidence is presented that redshirting creates violations of the monotonicity assumption necessary to identify many of the causal effects of educational attainment estimated in the literature. Empirical evidence from the Early Childhood Longitudinal Study, Kindergarten Class of 1998-99 (ECLS-K) data set demonstrated that redshirting is common, and that a model of essential heterogeneity is likely appropriate for the redshirting decisions of children in the ECLS-K.\nThe result presented in this paper contributes to the wider discussions about the role of theory in empirical microeconomics, as well as the relationship between econometrics and statistics. More specifically, a careful investigation of the complications introduced by redshirting showed that estimates of the effect of educational attainment may become all but impossible to interpret in a model of essential heterogeneity. This scenario resulted in a breakdown of the IV framework in which we were simply unable to identify treatment parameters. This finding has important implications for the literature using date of birth as an instrument for the LATE or ACR of educational attainment. Tables   Table 1: Cohorts of the ECLS-K (By Month) (a) All Children "}]