[{"section_title": "INTRODUCTION", "text": "T he rapid development of computational modelling of the Earth's climate, and in particular of the oceans and atmosphere, has lead in recent years to a deluge of data. Models are increasing in complexity and realism, including more modelled processes, and running at higher and higher spatial resolution (eg, HiGEM 1 ; OCCAM 1/12 degree model 2 ). Research groups involved in such modelling are becoming distributed as consortia, both nationally and internationally, thus increasing the need for data exchange and intercomparison. Examples include the EU MERSEA project (Marine Environment And Security for the European Area -www.mersea.eu.org), NCOF (UK National Centre for Ocean Forecastingwww.ncof.co.uk), DRAKKAR 3 and the IPCC (Intergovernmental Panel on Climate Change). At the same time the volume of observational data is also increasing with both the increasing spatial and spectral resolution of satellite remote sensing, and the development of in-situ observation programs, such as Argo, 4 with 3000 profiling floats continuously sampling subsurface ocean properties. Unfortunately the tools for looking at this vast volume of output have not kept pace with the rate of production, with the result that much of the output, particularly from modelling, is rarely examined, apart from the few diagnostics of particular interest to the project scientist. A new generation of tools is required to enable scientists to browse, explore and analyse such large datasets. Existing analysis tools such as Matlab, IDL, CDAT produce static visualizations of data that lack the interactivity that is needed to allow scientists to examine data seamlessly at all scales. Such tools also usually require the user to understand low-level technical details of data files and to manually perform tedious and error-prone tasks such as the co-localization of models and observations. The OceanDIVA project described in this paper hides unnecessary details from the user, who does not even need to know the physical location of the data being analysed, and provides an interactive interface for model and data exploration. In contrast to the comprehensive set of features and capabilities of more complex software such as Live Access Server (LAS) and the Matlab OPeNDAP Ocean Toolbox, OceanDIVA aims to be a simple tool which allows for easy browsing of both geospatial and statistical outputs of model -observation misfits, initially for oceanography. The recent availability of free geospatial viewing tools through the internet such as Google Earth, NASA World Wind and FreeEarth has demonstrated to a vast community how easy it can be to discover and visualize geospatial data. Many scientific groups have begun to use these ''geobrowsers'' for the visualization and dissemination of data. 5,6,7 The adoption of standard schemes for storing geospatial data and metadata is critical to enable uptake of these new technologies. Geobrowsing tools typically read data in XML (eXtensible Markup Language, http://www.w3.org/XML/) formats such as KML (http://www.opengeospatial.org/standards/kml), GeoRSS (Geographically encoded RSS (Really Simple Syndication), http://georss.org/) and GML (Geography Markup Language, http://www.opengeospatial.org/standards/gml). However, in the atmosphere and ocean communities data are typically stored in binary formats such as netCDF (network Common Data Form, http://www.unidata.ucar.edu/software/ netcdf/) supported by metadata conventions such as Climate and Forecast (CF, http://cf-pcmdi.llnl.gov). The integration of atmosphere-ocean data with geobrowsers and other Geographic Information Systems is an active area of current research. 8,9 NetCDF is a platform independent file format, which is 'self-describing', in that netCDF files contain headers with metadata which describes the binary data in the file. Users are able to add content to the metadata headers in order to better describe the file contents. The CF conventions are an attempt to homogenise the way in which users describe their data in netCDF files. One of the attractions of the netCDF file format is the extensive array of software libraries available -the comprehensive Java NetCDF library (http:// www.unidata.ucar.edu/software/netcdf-java/) being the relevant one for OceanDIVA. The OceanDIVA (Ocean Data Intercomparison and Visualization Application) tool described in this paper is an easy-to-use, web-based tool for efficiently analysing and visualizing data from a distributed data network. Although data are stored in binary formats (netCDF files), the results of analyses are presented in geobrowser-friendly formats, allowing the use of these tools for visualization and diagnostic purposes. It is deployed as a freely-available web application, allowing scientists to use the tool without the need to understand the low-level details of the data file formats or metadata conventions. OceanDIVA can therefore be used easily by consortia and collaborative projects, and encourages ocean and climate scientists to exchange data, and compare model results and diagnostics. The work presented in this paper is particularly aimed at two communities, those of operational oceanography, and of ocean climate and ocean synthesis/reanalysis. Both of these communities are involved in comparing model simulated data with direct ocean observations, and the interpretation or quantitative use of the misfits between these data. For example, the data assimilation process used to initialise ocean or climate forecasts, or to develop a synthesis of past data, requires the use of an Observation Operator H which, operating on the model state H(x), generates the model equivalent of an observation y. This allows the assessment of model-data misfits, H(x)-y, which the data assimilation process will then seek to reduce by various methods. The statistical properties of these misfits can be used to improve the data assimilation procedure 10,11 or to infer necessary improvements to the models. 12 The misfits also enable any user of model results to develop expected uncertainties for how close the results are likely to be to the true ocean state. There are a number of operational oceanography programs around the world, often with overlapping regions of operation, and an explicitly distributed operational oceanography program for Europe through the EU MERSEA and EU-GMES program Marine Core Services, as well as the international GODAE project set up to establish and promote further developments. The OceanDIVA tool is a contribution to encouraging a wider group of experts to get involved with the quantitative assessment of the products of these operational programs. Similarly there are several ocean synthesis programs using data assimilation to develop a more complete description of the historical ocean state over the past few decades in order to better understand climatic change. The products from these synthesis programs are often available online, but all have used different data and different data assimilation methods to achieve their goals. The OceanDIVA tool permits the comparison of different ocean/climate model products with the same set of observational ocean profiles, by allowing the misfits, H(x)-y, to be easily calculated, viewed and interpreted. Many of the ocean synthesis teams contribute to the CLIVAR-GSOP international forum and many of the examples shown here were produced for an intercomparison project of CLIVAR-GSOP. 13 The following section presents the architecture of OceanDIVA and outlines how it is used. Some results are then presented from the exploration of many individual ocean profiles compared against model output, using geobrowsers for display. The next section then presents statistical results designed to identify water mass properties and their errors and shows the results from many ocean synthesis experiments all compared against the same standard set of hydrographic observation profiles. We conclude by discussing the future potential and ongoing developments in the OceanDIVA project."}, {"section_title": "THE OCEANDIVA TOOL", "text": ""}, {"section_title": "Architecture and basic functions", "text": "OceanDIVA is a Java web application currently implemented at the Reading e-Science Centre (www.resc.rdg.ac.uk), which ingests modelled and observed ocean data and allows the exploration and comparison of the two. This is done by first reading in two netCDF files -one containing gridded model data (x) in CF compliant format, and the other containing in situ profile data (y) of ocean water properties (in the ENACT/ENSEMBLES and Argo data formats). Although only temperature (T) and salinity (S) profiles are currently used, OceanDIVA could be easily extended to include other ocean profile data (e.g. CFC-11, Oxygen, chlorophyll). An important aspect of OceanDIVA is that either, or both, of the two files can be read in remotely using, for example, the OPeNDAP protocol (Open-source Project for a Network Data Access Protocol -opendap.org) thereby avoiding the need to download and store large data files. To illustrate its functionality, the architecture of the OceanDIVA tool is shown schematically in Fig 1. The main processing step is the interpolation of the gridded model products, in both space and time, to determine the model equivalent of the ocean observation profiles, ie, the Observation Operator H(x). In the current version OceanDIVA uses a simple nearest neighbour criterion in the horizontal plane, whereby the model grid point closest to the location of the observation profile is selected. In the vertical, depth (z) or temperature levels (T) can be selected to define a vertical coordinate, with T(z), S(z) or z(T), S(T) being evaluated by the observation operator respectively. Future options may include the use of potential density as a vertical coordinate. Model data are linearly interpolated in the vertical (z or T) space to evaluate H(x), with an additional depth criterion used for T levels in cases Fig 1: OceanDIVA architecture. Note that for KMZ output, the KMZ is initially sent to Google Earth (1), and following a click on a profile icon, a request (2) is sent back to OceanDIVA to dynamically generate a png of the profile data, which is then sent back to Google Earth (3) for display in the pop-up window of multi-valued T profiles. Finally, the model-data misfits, H(x)-y, are evaluated. A more complex interpolation method could be used, however the current approach seems adequate for our purposes of giving users a quick view of misfits across large regions. Output is either in the form of KMZ (zipped KML) for viewing in geobrowsers (eg, Google Earth), or graphically as plots of probability density functions (PDFs) of the model-data misfits. If KMZ is chosen, the location of all profiles of in situ data within the selected time frame are shown on Google Earth, or any other similar client application, with a client selectable colour typically indicating the root-meansquared (RMS) misfit between the chosen in situ and model data. Examples of KMZ output are shown in Figs 2 and 3. If PDF output is chosen, a number of user-selected options exist to isolate particular regions or depth/temperature "}, {"section_title": "Client display selection options", "text": "From the web-based OceanDIVA interface, the user makes a number of choices governing which data they want, and how they would like it presented. These choices include; , and the observed data are from the ENACT/ENSEMBLES dataset. Green pins represent profiles whose salinity misfit with the model between the 5 o and 15 o isotherms is less than 0.1 PSU, red pins have misfits of over 0.4 PSU. The area outlined with a white box is enlarged in the top left portion of the screenshot, and shows in more detail the region of the North Pacific mode water. The profile shown in the lower portion of the figure typifies those found in this region, and is shown here simulating a click on a particular profile (#6461 in both cases) in the respective Google Earth screenshots above. Note how the SODA model reproduces the salinity ('A' boxes) and mode water properties ('B' boxes) of this profile more closely than the ECCO-GODAE model 1. Selection of required observational data by date, ocean basin or the type of instrument used to collect the data. 2. Selection of required model data by date and type of model. 3. Selection of the vertical coordinate for use in the observation operator (temperature or depth) 4. Definition of colour-coding for profile symbols, based on size of temperature or salinity misfits (more details are given below). 5. Definition of labels attached to profile symbols. This may be any combination of the profile metadata, eg, maximum depth, ID number, observation date or instrument type. By clicking a given profile symbol within Google Earth a request is sent back to the web application to generate a graphical plot of the individual observed and model profiles in a new pop-up window. OceanDIVA then extracts the desired profile information from the remote data servers and dynamically generates the graphical plot seen in Google Earth. It would be very time-consuming to pre-calculate all possible plots for each series of profiles and so OceanDIVA generates these plots on request. The efficiency of the OceanDIVA system allows this plot to be generated in approximately one second, permitting interactive exploration of the data. The profile symbols and colours may be user-modified in a number of ways according to metadata or data values, although defaults are provided. The mean RMS values over the full range of the vertical coordinate, or over a depth or temperature averaging interval can be used, with defaults available (0-300m, 300-1000m, .1000m). Misfits are shown in a table in the pop-up window in Google Earth, when an individual profile is displayed."}, {"section_title": "Available datasets", "text": "The application of OceanDIVA presented here was stimulated by the CLIVAR Global Synthesis and Observations Panel (GSOP) need for Ocean synthesis intercomparison. Most model products currently available by default in the OceanDIVA interface are ocean models with data assimilation known as ocean syntheses or reanalyses. These include outputs from most of the main operational oceanographic centres and climate reconstruction efforts. The ocean models range from relatively coarse 28 resolution to eddy-permitting 1 4 8 resolution global models and 1/98 resolution regional models. A wide range of data assimilation techniques are used, spanning relatively simple sequential Optimal Interpolation methods to long-window adjoint methods (see Table 1). These model datasets were mostly obtained  Table 1 as compared to September 2004 observations. Warm (cold) biases in the syntheses are positive (negative). All syntheses data are from September 2004 unless noted otherwise through remote OPeNDAP server sites located at each host institute. The current OceanDIVA will in principle read a user's own CF-compliant model data via OPeNDAP, although in our experience differences in headers can still cause problems. OceanDIVA can handle a regular lat-lon model grid as employed by the majority of models in Table  1. The NEMO model however uses a tri-polar grid, and OceanDIVA is able to handle this by using a look-up table to convert between model (i,j) points and latitude/longitude coordinates. The observational data originates from two main sources: the World Ocean Database 14 and the Argo Array. 4 As part of their climate and operational oceanographic activities, the UK Met Office have combined and standardised these two data sources, along with a few supplementary sources, to produce a dataset known as ENACT/ ENSEMBLES. 15 Observations have been subjected to a detailed quality control as part of the UK Met Office's preassimilation procedure. This dataset is ideal for intercomparing and validating various models and was developed in the EU ENACT and ENSEMBLES projects as the reference dataset for data assimilation work. The evaluation of model outputs in the following sections, are with respect to this dataset."}, {"section_title": "OBSERVATION OPERATOR DISPLAYED ON GOOGLE EARTH", "text": "A comparison is now presented of the reproduction of ocean water masses within the different ocean synthesis datasets contributing to CLIVAR-GSOP, using the OceanDI-VA tool to compare against hydrographic profiles. The ocean models in Table 1 were all forced by NCEP or ECMWF meteorology, and include the assimilation of various in situ and satellite ocean data for various periods in the last 50 years. The models differ structurally, in resolution, and in assimilation methodology used to introduce observations. All of these factors can introduce biases, some of which can be identified by comparing with control experiments, which are identical except for lacking ocean data assimilation. Such biases need to be small if the models are to act as useful dynamical interpolators of the assimilated data. In this section we look at examples of water mass comparisons that can be made by displaying individual profile model-data misfits on Google Earth. This display method is most useful for validating an individual model product against observations. Some applications of this geospatial functionality are;  Table 1 as compared to in situ observations. Saline (fresh) biases in the syntheses are positive (negative). All model data are from September 2004 unless noted otherwise 1. Easy viewing of the spatial and temporal distribution of the observed data on all scales, including that of differing instrument types. 2. Colour-coding profile icons according to client specified misfit criteria. 3. Quality control of individual data points which stand out compared to nearby data."}, {"section_title": "Identification of assimilation problems associated with", "text": "certain water masses or profile distributions."}, {"section_title": "Depth and temperature level misfits in the North Atlantic", "text": "Model water mass properties may be compared with data either on depth levels or on isotherms. Whilst the use of isotherms has a long standing in oceanography, for example looking at T-S plots, traditionally data assimilation, and hence observation operators, have only used depth levels. Recently there has been interest in assimilating salinity data on isotherms, 16 as this can offer a number of advantages. 17 In the following discussion salinity is used as an example of data that may be plotted on either depth levels or isotherms. Using isotherms as a vertical coordinate identifies water mass property changes separately from variability due to ocean dynamics, eg, wave motions. One can view salinity on temperature levels and obtain information on the slow thermodynamical characterisation of water mass properties, without the fast dynamical effects concealing important trends in the data. Isothermal coordinates prove particularly useful when ascertaining the boundary between two water masses, as this is difficult to do accurately on depth levels due to the high frequency variability in the ocean dynamics which dominates slower water mass thermodynamic variability. Fig 2 presents model misfits to salinity data profiles in January 2004 from the North Atlantic, using both zand T-level misfits, for the control run of the 18 resolution NEMO ocean model (Nucleus for European Modelling of the Ocean 18 ) run at Reading, UK. 19 There is a clear reduction in salinity misfits in the region when using isotherm coordinates, determined by the greater number of green profile icons. This suggests that the NEMO control run reproduces North Atlantic water mass properties fairly well, but that the halocline position is poorly simulated so that S(z) comparisons show larger errors. This is consistent with the bias errors previously noted for this run. 17 A representative profile from the region is shown on both depth levels and isotherms in the lower half of Fig 2. This illustrates the misplacement of for profiles compared to the WOA05 climatology. Deep (shallow) biases in the syntheses are positive (negative), (b) z(T) probability density functions of observed profiles, (c) misfit in z(T) for profiles compared to the Reading NEMO 18synthesis, (d) typical temperature profiles in the North Pacific Mode water region from observations (red) and from WOA05 (blue), (e) misfit in T(z) for profiles compared to the WOA05 climatology, (f) misfit in z(T) for profiles compared to the ECCO-GODAE synthesis, and (g) misfit in z(T) for profiles compared to the Mercator 1 4 degree synthesis the halocline on depth levels, and the contrasting small misfits in the T-S characterisation of the water mass. This example is a good illustration of how OceanDIVA can easily provide important validation results for the model synthesis experiments. One cannot ascertain from Fig 2 whether the lower average salinity misfit on isotherms is due to a smaller mean misfit (bias), or a reduced standard deviation of the misfit distribution (tightness of fit), or a combination of the two (in this case it is due to a combination of both; on depth levels the mean misfit is 0.1098C, and the misfit standard deviation is 0.1588C, whereas on isotherms these values are 0.0538C and 0.0748C respectively). This information can be obtained from the probability density functions (PDFs) which Ocean-DIVA can also generate (discussed below)."}, {"section_title": "North Pacific mode waters and salinity biases", "text": "Several of the GSOP synthesis products show considerable water mass differences in the North Pacific and here we show the spatial misfit distribution from two of these products. Fig 3 is constructed in a similar manner to Fig 2. The top half of the figure shows the geospatial distribution of the data in the North Pacific for September 2004 as it appears in Google Earth. The profiles are coloured by the salinity misfit between the 58C and 158C isotherms, with the ECCO-GODAE synthesis on the left, and the SODA synthesis on the right (more complete details on the syntheses described here and found in Table 1 are available from the CLIVAR-GSOP website: http://www.clivar.org/data/ synthesis/directory.php). The lower half of the figure reproduces the model and observation profiles selected from the  Table 1 as compared to in situ observations. Saline (fresh) biases in the syntheses are positive (negative). All model data are from September 2004 unless noted otherwise respective Google Earth screenshots above. The western region of the North Pacific shows noticeably larger S(T) misfits in the ECCO-GODAE synthesis than the SODA synthesis. A subset of this region is enlarged in the upper left of each screenshot to show the data in more detail. The profile shown in the lower half of the figure is characteristic of those in the enlarged region. There are two important features that should be noted in Fig 3. There is a salty bias in the ECCO-GODAE data (box A), which is not present in the SODA data (box A'). The GSOP syntheses fall into two subsets in this region between the 58C and 158C isotherms -approximately half show the salty bias, and the rest show very little salinity bias. This is explored in more detail below. The second point is the difference in the way that the syntheses capture the North Pacific mode water. The ECCO-GODAE data shows smooth z(T) profiles and very little sign of a 'mode' in waters with any particular temperature, resulting in depth misfits (box B). The SODA data shows a close match to the observed profile -with waters between 178C and 188C found over a range of depths (box B'). Failure of a synthesis to accurately capture the North Pacific mode water is also manifest clearly in the probability density functions in the following section."}, {"section_title": "STATISTICAL COMPARISON OF MISFITS", "text": "In this section we develop a statistical representation of the ocean water mass misfits from the different synthesis products on a regional basis, using the PDF output option from OceanDIVA. Ocean water masses are defined by their characteristic temperature and salinity properties. The distribution and volumes of different water masses vary over time and their synoptic distribution in many regions was not observed until very recently. By 2004 the network of Argo profiling floats was reaching a global coverage allowing a complete picture of the water masses in the top 2000m of the world oceans to be observed for the first time. In this section we used all the observations reported in a single month, September 2004 consisting of approximately 10 000 profiles globally (of which approximately 5700 profiles contained salinity data) to provide a reference baseline against which to compare misfits from the different ocean synthesis products. Table 2 defines the regions we have compared and the total number of profiles available in September 2004 in each region. Note that in this study we excluded all data collected from TESAC instruments as these data tend to be concentrated in very small areas, and inclusion of these data would result in a strong spatial bias towards the location of TESAC instruments. Moreover, the TESAC data are located in coastal regions which are poorly represented in coarser resolution models. As the location of coastlines can vary in models of different resolution, eliminating these data also ensures that models are compared to the same set of observed data as far as possible. Fig 4 shows the PDFs of the misfits in T(z) from a number of synthesis products in the tropical pacific region (defined here as 308S -308N and 1258W-808E). Fig 5 shows a similar set of PDFs for the S(z) misfits, also in the tropical pacific. Although these comparisons are only based on one month of data the results are fairly robust for other months within these datasets, apart from near-surface features which show some seasonal signals."}, {"section_title": "Standard synthesis misfits in Tropical Pacific", "text": "The synthesis products that use sequential assimilation methods (eg, SODA, ECMWF, Reading), all show fairly narrow PDFs for both T(z) and S(z) at all depths, which are typically slightly narrower than the WOA05 climatology comparison. The products based on long-window adjoint methods such as ECCO-GODAE (and GECCO and ECCO-SIO described below) show a wider spread than WOA05 in the top 500m, although at greater depths the PDFs are comparable to the other products. These figures also illustrate some slight biases, for example: ECCO-JPL is slightly too cold above 400m. A number of synthesis products are only available up to 2001, due mainly to the ERA40 atmospheric dataset ending   Table 2: Ocean regions as used in this study. Note that for the study of T(z) and z(T) the number of observed profiles available was the sum of columns 3 and 4. For the study of S(T) and S(z) the number of profiles available was that in column 3. All numbers of profiles reported here exclude those from TESAC instruments at this time. Hence, to widen the comparison, a number of synthesis products from September 2001 are compared to the observations in September 2004 (far fewer observations are available from 2001 due to the lack of Argo). Misfits will now include additional interannual variability, which can be assessed by comparing the Reading misfits for 2004 and 2001 in Figs 4 and 5. The INGV and CERFACS 2001 products show similar misfits to Reading with little obvious biases. The GECCO and ECCO-SIO 2001 misfits (which use similar methodology to ECCO-GODAE described above) show slightly more spread in the PDFs. Clear biases include: GECCO is too cold and fresh in the upper 200m and too warm and salty between 300-600m; ECCO-SIO has similar biases except that it does not exhibit a salinity bias in the top 200m."}, {"section_title": "Isotherm depth anomalies z (T) and identification of mode water errors", "text": "The mid-latitude ocean basins often have more complex water mass distributions than the tropics, and in particular large mode water volumes are found, 20 all with very similar temperature and salinity properties. Fig 6b shows the z(T) PDFs for observations from September 2004 in the North Pacific region (defined here as 308N -708N and 1008W-1008E). The presence of North Pacific sub-tropical mode water (STMW) can be seen, for example, in the large amount of 17.58C water with depths between 200-400m (also seen in Fig 3). The PDF for T(z) observations would look very similar just turned clockwise by 908, but the misfit plots can actually look quite different. Figs 6a and e show the misfit with the WOA05 climatology for z(T) and T(z) respectively. The North Pacific mode water errors show up very clearly in the z(T) misfits as a large depth error localized around 17.58C. As these errors occur over a range of depths, the T(z) misfits are spread out and thus do not show up clearly. Fig 6d shows a typical pair of profiles contributing to these PDF misfits. The observations (red) show a fairly homogenous layer with uniform temperatures between 200-400m while the WOA05 profile (blue) smoothes this out entirely thereby contributing to the z(T) error at 17.58C seen in the PDF. Figs 6c, f and g show z(T) PDF misfits for the Reading and ECCO-GODAE syntheses for September 2004, and the Mercator synthesis for September 2007 respectively. The Reading synthesis is fairly representative of sequential assimilation results (eg, from SODA, ECMWF, Mercator etc). Mode water errors do stand out at 17.58C but are generally much less marked than for the spatially smoothed climatology in Fig 6a. However, these syntheses do show a similar tendency to have a shallow mode water bias. The ECCO-GODAE synthesis shows a slightly larger mode water depth misfit, but with no obvious depth bias. However there are large positive depth errors in ECCO-GODAE for T , 78C and similar results appear in ECCO-JPL. The Mercator operational product was only available from 2007 onwards, and hence a direct comparison with the observed data from 2004 cannot be made. However, it provides and interesting view of the degree to which interannual variability affects the misfits."}, {"section_title": "Water mass S(T) property errors", "text": "Fig 7a shows a set of PDF misfits for S(T) from the North Pacific region for six of the synthesis products, as well as the Reading NEMO control run. It is clear that water mass misfits from ECCO-GODAE and GECCO stand out, with a large saline bias at all intermediate water temperatures between 5-158C. Fig 7b shows a similar set of S(T) misfits for the South Indian Ocean, again indicating a similar saline bias for intermediate waters between 3-128C in the ECCO runs, and a small fresh bias for T.128C. An indication of the origin of these biases can be seen from the equivalent misfits for the control run of the Reading NEMO model without data assimilation, in the North Pacific and South Indian Oceans. The Reading control run clearly has very similar errors to the ECCO synthesis experiments in both basins. The Reading and ECCO models use quite different numerical models although there will be similarities in the atmospheric forcing. All of the sequential data assimilation schemes introduce data directly into the models (through non-conservative fluxes of heat and mass) and produce fairly tight and unbiased S(T) relationships. However, methods that constrain the syntheses less tightly to in situ observations, such as those of the ECCO project, are less able to correct or maintain unbiased water mass properties over periods of years to decades."}, {"section_title": "Summarising synthesis water mass diagnostics", "text": "This paper has progressed from showing individual synthesis-profile misfits in Google Earth, to showing regional statistical misfits for many synthesis products. We now combine information together to summarise misfits from many synthesis products in a single diagram. The two panels in Fig 8 are similar to a Taylor diagram 21 displaying mean and standard deviation misfits on orthogonal axes (with the total RMS misfits as distances from the origin) for all synthesis products in the North Pacific between the 58C and 158C isotherms. These diagrams correlate with the discussion on North Pacific salinity biases and mode waters in Fig 3, as well as the preceding presentation of PDFs. First note that the bias and standard deviation of misfits tend to increase together for both the water mass properties, S(T), and the isotherm geometry, z(T). So unbiased synthesis products are more likely to have smaller random errors. In addition, products with smaller S(T) misfits also have smaller z(T) misfits. As one might expect, the sequential assimilation systems have the smallest mean and standard deviation errors, and several outperform the WOA05 climatology product. Synthesis products from September 2001 (filled symbols) have larger bias and standard deviations than most products evaluated for September 2004. The temporal difference can be cleanly assessed for the Reading 18 product which is shown for both times. In these respects, similar diagrams for other areas and temperature ranges broadly agree, while other details tend to depend on the area of study. These figures allow a very rapid assessment of many synthesis products using different water mass based measures of the misfit errors."}, {"section_title": "DISCUSSION AND FURTHER DEVELOPMENTS", "text": "A new web application (OceanDIVA) has been described, designed for inter-comparing ocean models and evaluating them against hydrographic profile data, with the ability to link to distributed data sources across the internet. In addition, this application is used to evaluate the CLIVAR-GSOP synthesis products, and show the extent to which the various syntheses reproduce water mass properties in a number of important ocean regions. One particular challenge in performing such an inter-comparison is how to account for the effect spatial inhomogeneities in data distribution have on the resulting statistical distributions. OceanDIVA is particularly well-suited to this by combining the ability to generate PDFs of model-data misfits with the spatial information visualized through Google Earth. Together, these two diagnostics permit the clear assessment of what spatial biases are present. Moreover, the ability to display individual profiles in Google Earth allows the statistical properties such as bias to be easily traced back to the property differences within individual sets of profiles. By using OceanDIVA, and its harvesting of the power and ease-of-use of Google Earth, one can easily and efficiently view both the large and small scale trends in the original data. Additionally, one can efficiently intercompare the datasets, without being concerned by the vagaries of the underlying metadata (see discussion below). Attempting to do this using other available tools, viewing and comparing these differing datasets from remote sources at a variety of scales, would have been a far more complex task. There are limitations of the current analysis that can be removed by treating the data sets in different ways. As a short time window was used, the statistical results in the preceding section only represent spatial variability in the misfits, with no information about temporal changes. Longer time windows with smaller selected regions would allow one to focus on the variability of the properties of particular water masses. Also, the current statistics do not take into account correlated observations, and the results could therefore be dominated by observational data from a much smaller space and time window than those selected in the OceanDIVA tool. This could be tested by using pseudoobservations from WOA05 on a 18 grid to provide a spatially unbiased estimate of water mass differences across the entirety of the regions selected. One significant challenge and limitation to further development of such distributed tools, is the degree to which the CF metadata convention is adopted in the oceanographic community. Although all datasets used in this study were in netCDF format, they varied considerably in terms of naming conventions and internal file metadata. This made it very difficult to use a generic algorithm for reading in model fields, resulting in a series of 'patches' for the different syntheses. The most common issue was a lack of standard name attributes for physical quantities, or an incorrect standard name being applied. Ideally, one should be able to add new model or observed datasets to OceanDIVA simply by providing the URL of the OPeNDAP site hosting the dataset. However, such a system is only possible if rigorous adherence to the CF conventions is observed. NERC grant NE/C509058/1 (as part of the Rapid climate change program), and a NERC contract for the Reading e-Science Centre. The authors would like to thank T Penduff for useful discussions and ideas regarding the PDF diagnostics, as well as the ENSEMBLES and Argo ocean observations projects, without which this study would not have been possible. The Argo data were collected and made freely available by the International Argo Project and the national initiatives that contribute to it (http://www. argo.net). Argo is a pilot programme of the Global Ocean Observing System. We would also like to thank D Stammer and participating groups in the CLIVAR GSOP intercomparison for useful discussions and for making their data freely available."}]