[{"section_title": "Introduction", "text": "Over recent years, as a primary role of school increasing attention has been given in supporting students to envision and prepare for their future careers. Students who are able to plan their future goals have indicated more motivation in learning, in comparison to those who cannot clearly connect the present to the future (Simons, Vansteenkiste, Lens, & Lacante, 2004). This issue has continually been apparent especially in science education, because students, in particular the girls, have gradually lost their interest in learning science and science-related careers during their secondary school years (Blickenstaff, 2005;Riegle-Crumb, Moore, & Ramos-Wada, 2011;Whitelegg, 2001). Students' career aspirations are likely to begin around the age of 11 or 12 (Nurmi, 2005) and develop during the secondary school years through studying and experiencing a variety of activities in and out of school environments as well as interest being stimulated in specific subjects or careers (e.g. King & Glackin, 2010;Wang, 2013). Therefore, those students who have participated more actively in hands-on inquiry-based experiments in their science class, show more interest in science, and indicate their interest in STEM (Science, Technology, Engineering, and Math) careers more frequently than others who have less or no participation at all in such experiments (e.g. Kang & Keinonen, 2017;Jocz, Zhai, & Tan, 2014;Potvin & Hasni, 2014;Gibson & Chase, 2002). Consequently, through a number of projects, science educators have tried to involve students in science activities in order to increase their motivation in learning science and science-oriented careers (e.g. PROFILES; Bolte, Holbrook, Mamlok-Naaman, & Rauch, 2014). Recent research regarding future career orientation has revealed that students' career aspirations, specifically their perspective on career characteristics such as a high salary or family-friendly occupations, can influence the student's interest and involvement in learning. For example, in science education females' perceptions of STEM careers are generally stereotyped as being thing-oriented, having less time for oneself, and being antithetical to communal goals; girls usually prefer more family-friendly, personal contact-oriented occupations than males (Konrad, Ritchie, Lieb, & Corrigall, 2000); as such, females have continuously demonstrated less interest in science and STEM occupations, especially engineering (Ceci & Williams, 2010;Diekman, Brown, Johnston, & Clark, 2010); this apparent difference between male and female interest in science and future career perspectives, has increased over the years (Su & Rounds, 2015). With this knowledge about gender differences and how and to what extent students' career outcome expectations affect their interest, this issue has become important in science education. To date, intensive research has been conducted on gender differences in science, STEM career trajectory, and the effect of a career-related perspective on the student's attitude. However, most of these studies have aimed at investigating high school or college level students, and the primary phase of these gender differences is still ambiguous (Sadler, Sonnert, Hazari, & Tai, 2012). Therefore, in order to extend existing knowledge we conducted a multigroup structural equation model and examined if gender differences in the relationship between students' future career perspectives and their interest in science, could be found at the transition from elementary to lower secondary school."}, {"section_title": "Gender differences in the relation between future career perspectives, interest and career aspirations in science", "text": "According to the Social Cognitive Career Theory (SCCT, Lent, Brown, & Hackett, 1994), outcome expectations can strongly affect interest, and this in turn eventually influences career choice. It is therefore of utmost importance to investigate the effect of outcome expectations on students' science interest and eventually their career aspirations in science. The outcome expectations in the SCCT 'refers to beliefs about the consequences or outcomes of performing particular activities' involving 'presumed consequences of particular courses of action' (Lent, 2013, p. 118). Thus, regarding future career perspectives, these outcome expectations may be to make lots of money, to have sufficient personal time, or to help others. In this article, we use the term 'future career perspectives (FCPs)' when referring to the career-related outcome expectations of the SCCT. With 15-year-old students, Badri et al. (2016) focused on relationships between FCPs and interest-related constructs: attitudes towards science, out-of-school activities, science at school, or interest in science topics. Concerning the FCPs, the 26 statements that were derived from the ROSE (Relevance of Science Education) questionnaire were grouped into 6 FCPs such as teamwork-oriented or independent working environments; these constructs were then put into their hypothesised model, together with interest-related variables. According to the results, a significant direct correlation between students' interest in science topics and FCPs was found. In addition, interest in science mediated the effect of science at school and largely influenced the attitude towards science. However, in their model, all 6 FCPs were used as one latent variable so they could not report as to how each FCP was differently associated with interest. Hazari and her colleagues conducted the PRiSE (Persistence Research in Science and Engineering) project, which surveyed a national sample of college students from the USA, in order to depict the multifaceted phenomenon of students' interest in science and engineering. With respect to gender disparities in physics careers, Hazari, Sonnert, Sadler, and Shanahan (2010) examined the physics identity of 3,829 college students; this covered areas of interest, recognition, performance, and competence in physics. In addition, they investigated how career outcome expectations are associated with the student's physics identity. For this, students were asked what they considered important for future career satisfaction; making money, helping other people, having lots of time for oneself, friends, and family, and so on. According to the results, a significant gender disparity was found between male and female students regarding physics identity. It was also reported that physics identity is correlated with physics-related self-perceptions, and highly corresponds with the future choice of a physics career. However, this identity was negatively correlated to their future desires concerning personal time and people-related motivations but positively with intrinsic fulfilment such as inventing new things or developing new knowledge. Moreover, in the statistical models these variables of career-related outcome expectations, reduced gender differences in physics identity. In other words, it describes that by adding career-related variables in the model, the effect of the gender gap in future career expectation was decreased. Indeed, gender differences or female under-representation in STEM fields, has been thoroughly studied through a lens of future career perspectives or lifestyle preferences (e.g. Diekman et al., 2010;Robertson, Smeets, Lubinski, & Benbow, 2010;Sadler et al., 2012;Su & Rounds, 2015). Su and Rounds (2015) conducted a meta-analysis of 52 articles published between 1964 and 2007 in order to explain gender disparities across STEM fields. Their results clearly presented that engineering disciplines representing thingsorientation working environments were significantly favoured by men and in contrast, social sciences and medical services representing people-orientation working environments, were largely favoured by women. This result is likely due to the fact that women more highly value communal goals than men (e.g. working with or helping other people, Diekman, Emily, Amanda, Elizabeth, & Mia, 2011;Konrad et al., 2000); STEM careers have been perceived as being antithetical to communal goals although, in reality, STEM careers hold the key to helping people and society; in the end, this misperception about STEM careers significantly impedes women's STEM career trajectories (Diekman et al., 2010). Moreover, Diekman et al. (2011) found that communal goal-endorsement still negatively affected students' interest in STEM careers, even after students' past experience and self-efficacy in science had been controlled. Furthermore, gender differences in STEM interest were significantly mediated by communal goals. Overall, their study indicates that this misconception about STEM careers is problematic, since communal opportunities are highly valued when women make vocational decisions. Interestingly, according to the recent review study by Boucher, Fuesting, Diekman, and Murphy (2017), not only women but also communally-oriented men could be deterred by the stereotypic misperceptions of science that are perceived as being uncommunal. Additionally, Brown, Thoman, Smith, and Diekman (2015) reported that regardless of college students' major, enrolment, and gender, when they had the chance to perceive STEM careers as supporting communal values, their interest in STEM careers had been increased. According to Robertson et al. (2010), career persistence in science can be predicted by individual differences in lifestyle preferences that are closely linked to career perspective. For instance, in terms of working hours, women preferred to work less hours than men which was probably due to their preference in spending their time more in pursuit of a quality life than work. In addition, women in their mid-30s put less value on their careers but more on family, friendships, and the community. Men placed more emphasis on their careers, financial compensation, and taking risks. Ceci, Williams, and Barnett (2009) also reported that 'even highly educated women are more likely than men to favour home-centered, adaptive lifestyles, wherein the family and home are paramount, and work is adapted to fit around this choice' (p. 247); this people-oriented lifestyle preference has resulted in fewer women in STEM fields which are possibly perceived as being more work-oriented environments. Not only in science but also in several other fields, this gender difference in lifestyle preference has affected career choices. According to DeMartino and Barbato (2003), women have, for instance, started their own business because of its flexibility and self-autonomy, enabling them to focus more on family needs than work. In contrast, male entrepreneurs have possibly embarked on their own business in order to become wealthy, being willing to take more financial risks than women. Chow and Ngo (2002) also reviewed gender differences in job attribute preferences and stated that for family and personal fulfilment, women are likely to prefer a more family-friendly working environment, job security, and work that is less demanding than that chosen by men. Thus, for those who pursue a personal time-oriented lifestyle, there is maybe more interest in flexible, autonomous, less demanding, and secure positions. Sadler et al. (2012) conducted a retrospective cohort study in order to examine the flux of students' interest in STEM careers during high school; more than 6,000 students in colleges participated. The result indicated that during high school, large gender differences were apparent in STEM career plans. Males were more attracted to careers such as engineering, and their interest in STEM careers remained more stable than that of the females, who in turn showed more interest in health and medicine. In terms of the primary phase of the gender gap, it was reported that initial interest in STEM careers at the onset of high school served as a key predictor of students' STEM career aspiration through to the end of high school. Therefore, when making an analysis of gender disparities in STEM interest, it must be taken into account that the gender gap is already likely to initiate before entrance to upper secondary school."}, {"section_title": "Science interest and career aspiration", "text": "Over the past decade, the importance of interest has been studied and placed as a key topic in the core domains of learning such as science and mathematics. Moreover, since interest has indicated high correlation with students' career trajectories, it has been used as a predictor to measure probabilities of choice in a future career (e.g. Wang, 2013;Tai, Liu, Maltese, & Fan, 2006;Authors, 2017). In the following section, we briefly describe theories and research that are related to interest and how it influences career choice in science. In education, interest has been studied using a number of theories such as Alexander's (2004) model of domain learning, Silvia's Psychology of Constructive Capriciousness (2001), or the person-object theory of interest (e.g. Krapp, 2002). They all hold in common the principle that interestin contrast to other motivational variablesis always object or content specific (e.g. a particular science content, subject, area of knowledge, or activity). Regarding a construct of interest, Krapp (2007) describes three general characteristicscognitive aspects, emotional characteristics, and value-related characteristics. Cognitive aspects refer to the readiness to acquire new knowledge in relation to the person's interest, since 'a person who is interested in a certain subject area is not content with his/her current level of knowledge or abilities in that interest domain' (p. 10). That is, a person who is interested may attempt to expand knowledge and apply it in different situations. Emotional characteristics refer to positive emotions such as the enjoyment that is connected with an interest-triggered action or activity, and value-related characteristics refer to positive personal evaluation on the object of interest since 'a person shows high subjective esteem for the objects and actions in his/ her areas of interest' (p. 11). Similarly, Hidi and Renninger (2006) used three components of interestaffect, knowledge, and value, to introduce the four-phase model of interest development in terms of the sequential growth of interest when considering the measure of these three components. These phases are composed of triggered situational interest, maintained situational interest, emerging individual interest, and well-developed individual interest. Since 'each phase is characterised by varying amounts of affect, knowledge, and value' (p. 112), these four phases are described as a sequential and cumulative process of interest development. The first two phases of interest (triggered and maintained situational interest) 'refer to focused attention and the affective reaction that is triggered at the moment by environmental stimuli, which may or may not last over time' (Hidi & Renninger, 2006, p. 113); the two latter forms of interest (emerging and well-developed individual interest) 'refer to a person's relatively enduring predisposition to re-engage particular content over time, as well as to the immediate psychological state when this predisposition has been activated' (p. 113). The phase of well-developed individual interest has been the focus of several investigations on students' interest in learning science (e.g. Ainley & Ainley, 2011a;Swarat, Ortony, & Revelle, 2012). Based on the Hidi and Renninger's research of model of interest, Ainley and Ainley (2011a, 2011b) focus on the three essential components of individual interest in science stored knowledge, positive feelings, and personal value. By means of the results from PISA 2006, they built and tested several statistical models in order to find the interconnections between those measures of knowledge, affect, and values in science education that relate to students' intentions to participate in further studies and their pursuit of science-oriented occupations. With respect to a cultural perspective, they selected four countries with different cultural backgrounds, based on the World Values Surveys and the European Values Surveys (Inglehart & Baker, 2000;Inglehart & Welzel, 2005). According to the Inglehart cultural map, countries are defined by two macro-cultural value dimensions (2000, p. 29): traditional (T) versus secular-rational (SR), and survival (S) versus self-expression (SE). Accordingly, Ainley and Ainley chose Colombia (T-S), Estonia (S-SR), USA (T-SE), and Sweden (SR-SE) as the most extreme values from each quadrant, in order for their hypothesised model to indicate validities in different cultures. Finally, they reported one model that indicated proper model fits in all four countries and a sound mediation of enjoying science for its personal value and interest in learning science. In addition, these components of interest were highly correlated with students' future participation in science-related activities and careers. However, unlike previous studies, stored knowledge of science was not clearly devoted to constructing the complexity of interest processes in their studies. With regard to the significance of adolescents' career orientation, Tai et al. (2006) used the National Education Longitudinal Study sample from the USA; this was a survey of 24,599 eighth graders, and focused on those participants who had acquired baccalaureate degrees from 4-year colleges or universities. Results revealed that the eighth graders who, at 30-years-old had the aspiration to work in a science-related field, got a Bachelor's in biological science 1.9 times higher, and a physical science degree 3.4 times higher than the eighth graders who did not have any expectation of a science-related occupation. Similarly, Schoon (2001) conducted a longitudinal study with data collected in the UK from 7649 students who were aged 16, and she found that in science 'occupational attainment at the age of 33 was significantly related to the job aspirations expressed at the age of 16' (p. 214). Therefore, students' career aspiration in science is likely to start at secondary school or before, and it largely affects their future goals and actions in attaining occupations."}, {"section_title": "Research context: students' STEM career orientation in Finland", "text": "Finnish students have recently been the source of attention from many other nations; this is not only due to their successful achievements (OECD, 2007) but also to their low variation of performance (OECD, 2016). In addition, Finnish students indicated one unique performance pattern in that girls were more likely to be top performers rather than boys, while the opposite results were indicated in most of the other countries (OECD, 2016). Despite the evidence in many international assessments of Finnish students' success and gender equity in science performance, however, the Finnish educational system is currently challenged by students' low interest in science, science-related careers, and the gender disparities in pursuing STEM careers (OECD, 2016). The empirical data in this study is derived from the Finnish context, thus in this section we briefly discuss the national level curriculum and research related to career aspiration in the Finnish context. The previous (Finnish National Board of Education 1 [FNBE], 2004) and the new National Core Curriculum for Basic Education implemented since 2016 (FNBE, 2014) have included guidance counselling as a subject in grades one to nine. Although more emphasis is placed on career guidance in the upper grades, the curriculum encourages school activities such as 'classroom visits by labour-market representatives, visits to workplaces, project work, the use of informative material from different sectors, and introduction-to-working-life periods' (FNBE, 2004, p. 22); this is achieved by cooperating with the business community so that pupils can develop the abilities necessary to cope with 'transitions within their studies and future careers' (FNBE, 2014, p. 476). In addition, the curriculum has continuously emphasised that pupils should be guided to decide their career aspiration based on their own abilities and interest, not on gender-related role models (FNBE, 2004(FNBE, , 2016. Regarding Finnish students' career perspective and science interest, Lavonen et al. (2008) used the data from ROSE (The Relevance of Science Education, Schreiner & Sjøberg, 2004) and compared two different nations, Finland and Latvia, in order to examine the correlation between students' motivational orientation towards characteristics of occupations and their backgrounds, such as gender, nationality, or interest in science. In Finland, 3626 students from 61 schools answered the survey in. From the Finnish and Latvian data, the study found six characteristics relating to the future occupationpersonally meaningful orientation, leadership orientation, craft orientation, nature orientation, innovation orientation, and social orientationand reported that gender was the most powerful predictor for defining students' future career characteristics; thus a large gender gap was found when selecting a future career. In both countries this was specifically evident in the personal and social orientations preferred by the girls, and the craft orientation preferred by the boys. However, with relation to gender, how differently these career orientations are correlated with science interest was not examined. The authors (2017) also examined factors affecting students STEM (Science, Technology, Engineering, and Mathematics) career trajectory based on the PISA 2015 Finnish data, and found that inquiry-based learning, selfefficacy, outcome expectation, and interest in learning science, were positively correlated with science career orientation for fifteen-year-old students."}, {"section_title": "Purpose", "text": "As stated, the purpose of this study was to narrow the research gap regarding the primary phase of gender differences in science career orientation; in addition, to extend the existing knowledge on how female and male students' FCPs differently affect their interest in science during the transition to secondary school. Specifically, we aimed to investigate gender differences in (1) future career perspectives; (2) science interest; and (3) correlations between students' career perspectives and their interest in science. We used multiple group structural equation modelling to conduct the gender study and in one statistical model the students formed a male group and a female group."}, {"section_title": "Method", "text": ""}, {"section_title": "Research data", "text": "In order to explore the research questions, we used the Finnish data from the MultiCO Project that has been funded by the European Union's Horizon 2020: the programme is called Science with and for Society. The MultiCO project is an ongoing three-year project that was launched in 2015 and focuses on developing scenarios related to science careers. The aim is to make science more attractive to students between the ages of 13 to 15. During the project, teachers, researchers and other partners designed five successive interventions with science-related scenarios. In addition, in order to measure students perceptional changes such as their interest in science, a questionnaire was developed by the MultiCO project team that is based on previous studies such as PRiSE or PISA. The original questionnaire comprises of several pages that concentrate on students' science experiences in and out of school, career aspiration, interest in science, the value of science, etc. (see the attached online supplementary material 1). In this study, the sections were designed to consider three characteristics of interest (personal value, enjoyment, and the cognitive aspect) and future career perspectives (FCPs). Participation in the questionnaire survey took place in September 2015 and was timed directly after participants entered the lower secondary school. The participants were 401 seventh graders (208 females and 193 males, mostly 13-year-olds)."}, {"section_title": "Variables", "text": "On the subject of FCPs, and in order to measure their perspectives of future career characteristics (PRiSE scale; Harvard-Smithonian Center for Astrophysics, 2006), using the fourpoint Likert scale (1. not at all important, 4. very important), students were asked 'What do you consider important for career satisfaction?' As shown in Table 2, nine out of fourteen variables were chosen to represent three career characteristicsoutcome orientation, personal time orientation, and innovation orientationbased on the result of exploratory factor analysis (EFA). EFA is used to determine internal consistency and to reduce the number of original variables to a smaller number of factors. When the absolute loading value on the specific factor is more than 0.3 and no significant loadings of other factors, the variables are considered to belong to the specific factor (Muijs, 2011). Also, correlations between factors were expected lower than 0.7, because the value greater than 0.7 indicates a more than 49% shared variance between factors. EFA was performed using the Principal Axis Factoring with promax rotation. Factors with eigenvalues greater than 1 were extracted and the loadings of more than 0.4 were considered satisfactory. Given the result of the EFA presented in Table 1, and previous literature, three factors explaining 59.8% of total variance were used as independent latent variables in our model shown in Figure 1. In this study, instead of directly measuring students' career choice, we used a conceptualised interest construct as a proxy for career trajectory. This was decided because our target sample was mostly 13-year-old students who are likely just to begin thinking about career aspiration. We did indeed ask students what areas they would choose for their future work, but few students chose only one area (18%), and most of them selected at least two or no areas at all (82%). In addition, there were no significant correlations found between students' intention to work in science-related areas and their interestrelated constructs in science. Consequently, we concluded that our sample students' decisions on their future career were still unsure, and decided to use in this study, the conceptualised interest construct as a proxy for students' future career aspiration. Based on the person-object-theory of interest (Krapp, 2007(Krapp, , 2002, the three defined subcomponents of individual interestpersonal value, enjoyment, and the cognitive aspectwere selected to measure students' interest in learning science. Students' prior knowledge may be one of the important components of interest, but when considering that Ainley (2011a, 2011b) demonstrated that stored knowledge indicated no consistent patterns with other variables, and in addition, the students involved in this study were at the first phase of lower secondary school and had not taken any knowledge measurement tests, we excluded the students' stored knowledge-related variable. Instead, we included the cognitive aspect of interest that represents students' intention to acquire new knowledge (Krapp, 2007). Items reflecting the subcomponents of interest were taken from PISA students' questionnaire (OECD, 2007). Students' personal value of science was measured with four items such as 'I will use science in many ways when I am an adult'. Variables relating to enjoyment in science were measured with three items including 'I enjoy acquiring new knowledge in science'. For both personal value and enjoyment, we used a fourpoint Likert scale with the response 1. strongly disagree to 4. strongly agree. Regarding students' cognitive aspect of interest, students were asked regarding seven topics such as those in physics, chemistry, or biology 'How much interest do you have in learning Figure 1. Hypothesised model of the study. about the following science topics?' these they answered using a four-point Likert scale 1. no interest to 4. high interest level."}, {"section_title": "Data analysis", "text": "We first examined the reliability and validity of the measures of FCPs. Although the variables related to the FCPs were used several times, since there was no validation study up-to-date, we tested the reliability and validity of the measures through several parameters. The reliability of the scales indicating the homogeneity of the items, was measured by calculating Cronbach's alpha for each scale. Although an alpha value above 0.70 is often considered the criterion for internal consistency, Nunnally (1978) suggests the alpha value of 0.50 and 0.60 is also acceptable in the early stages of research. As shown in Table 2, the Cronbach alpha values for the FCP-related scales range from .61 to .78 exhibiting an acceptable level of construct reliability. To accomplish construct validity, convergent and discriminant validity were assessed. Briefly, convergent validity measures that the variables within a single factor are highly related each other, whereas discriminant validity measures whether the variables within a single factor are more strongly correlated to their own factor than to other factors. For this, we performed item-scale correlations calculated using Spearman's correlation coefficient (rho). In order to confirm convergent validity, correlation of item scores with its own hypothesised scale should be higher than other scales. Correlation values over 0.4 were considered satisfactory (Nunnally & Bernstein, 1994). To establish discriminant validity, we compared the average variance extracted (AVE) of each factor with the Personal value I will use science in many ways when I am an adult .84 Science is very relevant to me I find that science helps me to understand the things around me When I leave school there will be many opportunities for me to use science shared variance between factors because, 'if the AVE for each construct is greater than its shared variance with any other construct, discriminant validity is supported' (Farrell, 2010, p. 325). After conducting validity tests for the FCP-related constructs, we preformed confirmatory factor analysis (CFA) and structural equation modelling (SEM) in order to analyze the proposed measurement model including all measures and to examine hypothesised relationships between students' FCPs and their interest in science. The CFA and SEM were conducted using Mplus 7.4, and the maximum likelihood estimation with robust standard errors and a mean-and variance-adjusted test statistic (MLMV), was used as an estimator to calculate chi-square differences between models. Listwise deletion was used to treat missing data, and, as a result, the final analytic sample size for CFA and SEM comprised of 353 students (186 girls and 167 boys). Figure 1 presents our hypothesised model. As Ainley and Ainley (2011a, 2011b) suggested, we constructed a model that depicted the mediate effect of enjoyment of science between personal value and the cognitive aspect of interest in learning science. Therefore, both the direct and indirect effects of all FCPs on enjoyment, personal value, and the cognitive aspect of interest in learning, were measured as shown in Figure 1. In addition, in order to examine gender differences in mediated pathways, we used multiple group structural equation modelling (MGSEM). MGSEM has been adopted to simultaneously test statistical group differences observed in the structural parameters across groups. Thus, this analysis focuses on 'whether or not components of the measurement model and/or the structural model, are equivalent across particular groups of interest' (Byrne, 2010). MGSEM was performed in a series of steps. First, we tested factorial invariance across groups. Factorial invariance indicates whether the model measures the same phenomenon in different groups. For this purpose, we compared an unconstrained model and measurement weights that constrained the model. If no significant differences are found between the two models, it is evidence of invariance across the groups (factorial invariance). We then tested a fully constrained model with all paths being equal for all groups, in order to confirm group differences in structural paths. A significant change in the chi-square model fit between unconstrained and fully constrained models, is taken as evidence of the differences between the groups (metric invariance). Lastly, we measured and compared the standardised coefficients of each group in order to confirm the different effects of FCPs on science interest. In order to assess the quality of measurement and structural model fit, traditional cutoff values were applied as suggested by Wang and Wang (2012); the root-mean-square error of approximation (RMSEA) below .05 or .08, the standardised root mean square residual (SRMR) below .08, the comparative fit index (CFI) above .90 or .95."}, {"section_title": "Result", "text": ""}, {"section_title": "Descriptive statistics", "text": "We calculated sum-variables, an independent samples t-test for equality of means, and Cohen's d values, so as to determine whether there were significant gender differences in the mean levels of the study variables. As shown in Table 3, the boys indicated higher scores in all FCPs than the girls; to be specific, differences in outcome and innovation orientations were statistically significant, and the effect sizes were moderate. Regarding interest-related variables, both girls and boys indicated lower scores than 2.5 in all interest variables, and no significant difference was found between the two groups. In addition, we examined subject interest variables in the same way in order to calculate gender differences in each subject. As shown in Table 4, students presented an average level of interest in physics, chemistry, biology, and geography. However, topics belonging to physics, chemistry, and geology were more favoured by males, and biology by females. The differences were statistically significant with small effect size."}, {"section_title": "Results of validity test for the FCP-related constructs", "text": "Convergent validity was assessed based on item-scale correlation test and the result indicated that item scores correlated higher with own hypothesised scale than other scales as presented in Table 5. In addition, each item correlated higher within the hypothesised scale group items than other items. Discriminant validity was measured by comparing the shared variances against the AVEs between each pair of constructs in order to check whether the AVE for each factor was larger than its shared variance with any other factors. As shown in Table 6, all three AVE estimates were greater than the shared variance estimates involving the factor. Therefore, together with the EFA, it lent credence to convergent and discriminant validity of the FCP-related factors."}, {"section_title": "Results of confirmatory factor analyses", "text": "The results of CFA indicated that the measurement model fits the data well (RMSEA = .045 (90% C.I. = .037 & .053), CFI = .93, SRMR = .066). In addition, all of the factor  loadings were above .4 and significant (p < .001) indicating good convergent validity of the measurement model (Kline, 2011) Results of multiple group comparisons Table 7 presents the differences of model fits for each model. Comparison of chi-square between the unconstrained model (χ2 = 564.82, df = 424) and measurement invariance model (χ2 = 585.09, df = 441) indicated non-significant differences (Δχ2 = 23.54, df = 17, p > .05); in addition, model fits were not improved after the constraint; thus, tests for factorial invariance indicated that the factor loadings were invariant across the groups; that is, the model measured the same phenomenon in different groups."}, {"section_title": "Factorial invariance", "text": ""}, {"section_title": "Metric invariance", "text": "Comparison of chi-square between the measurement invariance model (χ2 = 585.09, df = 441) and the fully constrained model (χ2 = 850.01, df = 497) indicated significant differences (Δχ2 = 405.28, df = 56, p < .05); in addition, model fits were so decreased that the fits of the fully constrained model were not under acceptable criteria; thus, tests for metric invariance indicated that the path coefficients were variant across the groups. Multiple group analysis Accordingly, in order to examine the paths on which girls and boys presented differences, we conducted twelve constrained path analyses by constraining one path for each analysis as shown in Table 8. The results of Wald tests indicated that the paths from outcome to personal value and enjoyment indicated gender differences; the girls' outcome orientation was negatively correlated to the personal value of science while the boys' outcome orientation was negatively correlated to enjoyment. In addition, the paths from personal time to personal value and enjoyment also showed group differences; the girls' personal time orientation was positively associated with their personal value of science while this was the opposite for the boys; the boys' personal time orientation was positively associated with enjoyment in science while this was insignificant in the case of the girls. In addition, since our model presented indirect paths, we further examined each group separately to measure direct, indirect, and total effects of FCPs on science interest. The fits of the final model for each group were satisfactory (RMSEA = .048 (90% C.I. = .036 & .060), CFI = .92, SRMR = .07 and RMSEA = .037 (90% C.I. = .018 & .051), CFI = .94, SRMR = .07 for the girls and boys respectively). Table 9 presents the direct effect of FCPs on students' personal value of science. The relationships of FCPs with the girls' personal value were all significant. Among the FCPs, while outcome orientation was negatively related to personal value, personal time and innovation orientation were positively correlated to personal value. On the other hand, while the other FCPs revealed a non-significant relation, only the personal timeoriented FCP indicated a significant relationship with the boys' personal value of science. Regarding the relationship between the FCPs and enjoyment of science as shown in Table 10, the girls' enjoyment was significantly related to all FCPs; given that all direct effects were non-significant, in the case of the girls the effects were fully mediated by personal value. Similar to the result of personal value and FCPs, the girls' outcome orientation was negatively related to enjoyment, whereas personal time and innovation orientation indicated a positive relationship with enjoyment. Conversely, with all FCPs the boys' enjoyment of science revealed statistically non-significant relationships. Finally, we examined the relationship between FCPs and the students' cognitive aspect of interest in science, specifically science subjects. As shown in Table 11, the total effect of outcome orientation on the cognitive aspect was negative for the girls, while the coefficient of the boys was statistically non-significant; the total effect of personal time orientation on the cognitive aspect was non-significant for both the girls and boys; the total effect of Innovation orientation was strong and positively related to the cognitive aspect of interest in science for both the boys and girls."}, {"section_title": "Discussion and conclusion", "text": "Interest in science plays a pivotal role in motivating students to engage in science-related activities, to enrol in advanced science studies, and to work in the science-related field.  Females and males have shown different traits in being encouraged to persist with science, therefore, fostering interest in science becomes a primary goal of educating students at school. In addition, much research has reported high correlations between students' science interest and their FCPs. Therefore, it is important to study the effect of the FCPs on the interests and eventual science career aspirations of both female and male students. The results of our study indicate that even at the transient stage to secondary school, students clearly show gender differences in FCPs and their relationships with regard to interest in science. Thus, we argue that in Finland, gender disparities in science have already begun before secondary school and the approaches necessary to narrow the gender gap, may be related to students' FCPs. Regarding interest in different science subjects, the result indicates that females have more interest in learning biology, while physics and chemistry are more favoured by males. The result is in line with the study of Blickenstaff (2005) that biology is more open to girls as a femininity continuum of science disciplines. Since biology has been deemed as being more closely related to caring for people or animals, and physics or chemistry are more likely to deal with things (Diekman et al., 2010;Su & Rounds, 2015), the result can be understood in a way that in Finland, females at the age of thirteen are already more oriented towards people-than things-oriented science subjects compared to males. Sadler et al. (2012) indicated that these gender differences were remained stably during the high school so that the girls more preferred health-and medicinerelated occupations while boys preferred more enginnering. Given that primary school science has usually been taught as one subject, an interesting finding shows that students already have preferences in different science subjects even before secondary school when they begin to learn science as a distinct subject area. However, one of the reasons for this can be attributed to the Finnish context of science curriculum for primary school.  According to the Finnish National Board of Education 2004, students in grades 1-4 were taught integrated natural science; this was called 'Environmental and Natural Studies' and focused on sustainable development. The 5th and 6th graders studied science as separate subjects, physics & chemistry, biology & geography. It was interesting that our result clearly presents gender differences in these two categories even though students have retained an average level of interest in science. This result can be explained in several ways; students' early experiences in science, cultural pressure to fill gender roles, or the masculine worldview of science (Blickenstaff, 2005). However, when considering how young the students were, and Finland's high gender equality at school, the reason can be attributed more to the teacher's role in primary school. This role can be addressed from two aspects, one as an instructor and the other as a role model. In relation to their role as the instructor, Whitelegg (2001) argued that teachers could take more control of access to classroom resources, since boys act more aggressively than girls when collecting materials. Thus, an equal opportunity approach to science materials  can influence girls' interest in science by increasing more hands-on experience; in addition, teachers could be careful to choose curriculum materials such as textbooks that indicate less gender-biased pictures or texts. Moreover, it is also emphasised that teachers should be aware of avoiding gender bias in science lessons, giving equal attention to both the boys and the girls. However, considering that about 80% of Finnish primary school teachers are women (reported from World Bank in 2013) and in general, science is an area in which primary school teachers indicate low self-efficacy (Cakiroglu, Capa-Aydin, & Hoy, 2012;Kazempour & Sadler, 2015) in particular female teachers (Lumpe, Czerniak, Haney, & Beltyukova, 2012), we emphasise the role model of the teacher. The primary school teacher is likely to be the representative of the first profession with which students have any contact. As such, if female teachers show a lack of confidence or lack of preference for physics or chemistry, girls may consider the subjects to be less suitable for a woman to study or to be involved in science-related activities and consequently, even at the primary level they may indicate lower interest in physics and chemistry. However, if primary students' interest in science persists until secondary school, (DeWitt, Archer, & Osborne, 2014) it may eventually affect their real career choices in future (Schoon, 2001;Tai et al., 2006). A prospective primary teacher in Finland is expected to teach almost all subjects including science although most of the teacher training curriculum omits to focus on each subject in detail, only covering the basics of all subjects (Malinen, Väisänen, & Savolainen, 2012). As a result, female teachers may face difficulties in teaching, particularly chemistry and physics, as these are essentially thingoriented subjects which tend to be less favoured by females. The female teacher's lowinterest perception of these subjects may be conveyed to the female students which may, eventually, decrease the probabilities of female students' career aspirations in science. Therefore, regarding the primary school science curriculum, integration of science subjects into one instead of two or more subjects, should be taken under consideration so as to minimise teachers' negative perceptions of physics as being a hard science. In line with previous research (Badri et al., 2016;Hazari et al., 2010;Lavonen et al., 2008), the results of our study indicate significant relations between FCPs and science interest, especially in terms of girls. Specifically, the findings present gender differences with regard to outcome orientation, and a future career, and how interest is related to them when learning science. Similar to Lavonen et al. (2008), the boys indicated higher outcome-oriented FCPs than the girls, but its effect was statistically non-significant with personal value, enjoyment, and the cognitive aspect of interest in science. In the case of the girls, although the relationship between outcome FCPs and all interest-related constructs were statistically significant, this was largely in a negative way; that is, the girls' interest in taking a leading position, being rich and well known, was negatively correlated with science interest which in turn is deeply related to future career trajectories in STEM fields (Authors, 2017;Ainley & Ainley, 2011a). The result is contrary to the study of Lavonen et al. (2008) who reported a positive relationship between outcome orientation-related variables and students' interest in becoming a scientist. This inconsistency may be due to the fact that they did not examine boys and girls separately but as one cohort, and used samples both from Finland and Latvia. However, given that these three interest-related constructs are strongly related to students' future career trajectory (Ainley & Ainley, 2011a), this result suggests that girls who place high importance on these extrinsic rewards are likely to perceive science as being irrelevant to their future. Furthermore, as more than half of the girls stated that they had considered such outcomes money, fame, or high positionas important factors for their career satisfaction, the result can be problematic in terms of female science interest and its relation to their future careers (Schoon, 2001;Tai et al., 2006). Although the underlying explanations for these correlations cannot be investigated by our current data, the SCCT model explain that this outcome expectation can be affected by students' learning experience and will affect students' future career choices (Lent, 2013;Kang & Keinonen, 2017). Thus, it is recommended that by introducing STEM careers in and out of school environments in which students could be exposed to scientists who have achieved such outcomes, girls may see science as being more relevant for their future and therefore be more interested in it. Further research will be needed using qualitative methods or longitudinal data to investigate this causal relation. In addition to outcome orientation, gender differences were also discovered in personal time orientation and its correlation with science interest. In the case of the girls, personal time orientation was highly correlated with their personal value and enjoyment of science. Findings from this current study do not support previous research that indicated a negative relationship between personal time and science identity (Hazari et al., 2010). Although Hazari and co-authors controlled gender effect in their model, they did not examine the effect separately by gender, with the result that the relation of personal time and science identity did not explain the gender differences. This result can be interpreted to suggest that if instructors can present a science-related job as being a more personal time-oriented profession, girls in Finnish secondary schools are likely to be more interested in science in future. As discussed earlier, females place high value on communal goals, and because they usually perceive STEM careers as antithetical to their goals (Ceci & Williams, 2010;Diekman et al., 2010) this impedes women from studying and working in STEM fields. In addition, having personal time or spending time with family becomes more important, especially for women as they get older (Robertson et al., 2010), and this lifestyle preference may support or hinder women's career persistence in science careers (Ceci et al., 2009). However, as presented in this study, 13-yearold girls in Finland indicated a positive relation between personal time and science. Maybe in the long term, if the girls are continuously exposed to the fact that science careers could give people more personal time, they may retain their interest in science, resulting in an increased probability of girls choosing science as their future career. In addition, according to Boucher et al. (2017) and Brown et al. (2015), emphasising this personal-time-perspective in relation to science careers is important not only for girls, but also for boys, because regardless of students' gender, students' interest has been affected by their perception on STEM careers as supporting communal values. Our result also indicated that boys' personal time orientation factor was highly associated with their personal value on science similar to girls. In sum, this finding suggests that in order to make science subjects appealing to many students, it is important to highlight the impact of science on their life, the fact that STEM careers hold the key to helping people and society, and how scientists balance their work and life without giving up their personal time. The result of our study regarding innovation orientation and its relation to science interest, is in accord with recent studies that indicate positive correlation between these characteristics (Hazari et al., 2010;Lavonen et al., 2008). In addition, a similar result was revealed from both the girls and the boys, although there are small differences in the values. That is, when students perceive science as a tool to invent new things or to develop new knowledge and skills, the more value they place on innovation orientation in their career choices, the higher their interest in science. Hazari et al. (2010) indicated that among several FCPs, this intrinsic fulfilment was the strongest predictor of physic identity and eventually affected their future choice of science careers. Thus, together with previous research, this study confirms that innovation orientation can be a sound predictor of students' interest in science and their science career aspiration. To sum up, in our study of 13-year-old students, a transient age group to secondary school and a group that has been less under focus in terms of science and sciencerelated career interest, our findings point to important gender differences in science subject preferences, future career perspectives, and their correlations with students' interest in science. Our study contributes to previous literature in that it gives more evidence that the gender gap has already begun before the start of secondary school. In order to avoid this gender disparity, we argue that the 5 th and 6 th graders' curriculum in Finland should be well designed to introduce each science subject; it is also important for primary teachers to perceive the extent to which their modelling can influence students' future interest in science and even future career choices. According to the FNBE (2014), a new curriculum has been launched during the autumn semester of 2016 that introduces integrated science for 5 th and 6 th graders. We can presume that in the near future, research will explore the effect of this new integrated science curriculum in terms of students' preferences in science subjects. Despite their young age, students have already begun to develop their future career perspectives; girls present a clearer distinction between interest and career perspectives than boys. Thus, the results of this study indicate that particular attention to girls' career development is warranted. This study is not, however, without limitation. Firstly, we did not use a variable that directly asked the students' opinion about their future career in science. Since 7 th graders were our target group, we assumed that they had not yet developed a firm perception of their future, so we used interest-related constructs as a proxy for their future aspirations in science. Secondly, a number of general factors have been considered for studying the students' interest; past experiences, economic situation, teaching strategies, parental and school factors, gender or FCPs. Also, as we were only able to use the sample of Finnish students, the result cannot be generalised for other cultures. Therefore, when conducting large-scale international assessments of science education such as PISA or TIMSS, we would hope that FCPs are taken into consideration so that this research can be extended to samples from various cultural backgrounds, using constructs relating to students' science interest. Note 1. Since 2017 the Finnish National Board of Education (FNBE) and CIMO Centre for International Mobility merge to form the Finnish National Agency for Education."}, {"section_title": "Disclosure statement", "text": "No potential conflict of interest was reported by the authors."}]