[{"section_title": "Introduction", "text": "The Survey of Doctorate Recipients (SDR) is a National Science Foundation (NSF) longitudinal survey whose design incorporates features of both repeated panels and rotating panels. The purpose of the survey is to study U.S. doctorate recipients in science, engineering, and health fields. It is conducted approximately every two years. A detailed description of the SDR can be found at NSF (2012). In this paper we restrict our attention to the data collected from 1995 through 2008 (7 waves). At any particular wave a new cohort is selected. The new cohort consists of a sample of recent graduates (from the previous two years) selected from the Doctorate Records File, which is a database constructed mainly from the Survey of Earned Doctorates (http://www.nsf.gov/ statistics/srvydoctorates/). The selected individuals are kept in the sample, i.e., interviewed every two years, until the age of 75, while living in the U.S. during the survey reference week, and Statistics Canada, Catalogue No. 12-001-X while not institutionalized. However, not all the sampled graduates satisfying these characteristics are retained forever. Some individuals, rather than entire cohorts, are dropped from the sample in order to a) include the new graduates in the new cohorts and b) maintain a relatively constant sample size across waves. In Section 2.2 we describe how the selection of the individuals who are dropped is made. Survey weights for cross-sectional analyses of the SDR are already available, but not for longitudinal analyses. Rather than requiring a new longitudinal weight for all the data, the method proposed in this paper is able to use the existing cross-sectional weights for longitudinal analyses without ignoring any data. We concentrate on estimation of parameters of statistical models of the effect of covariates on a response of interest, but the method can also be used for estimation of finite population quantities (Carrillo and Karr 2012). We focus on analysis of the SDR, but our method is applicable to any fixed-panel, fixed-panel-plus-'births', repeated-panel, rotating-panel, split-panel, or refreshment sample survey, as long as for each wave there is a cross-sectional weight to represent the population of interest at that wave. See Smith, Lynn and Elliot (2009), Hirano, Imbens, Ridder and Rubin (2001), and Nevo (2003) for definitions of all these types of longitudinal sample designs. The SDR is a hybrid of repeated-panel and rotating panel designs. It is not purely a repeated-panel design because of the removal of some subjects at each wave. It is not purely a rotating-panel design because entire panels (or cohorts) are not removed, only individuals; additionally, the composition of the finite population of interest changes over time, unlike in a rotating panel survey. Diggle, Heagerty, Liang and Zeger (2002) and Hedeker and Gibbons (2006) point out that, with longitudinal studies, contrary to a cross-sectional study, it is possible to separate age effect (actual change within subjects over time) and cohort effect (difference between units at the beginning of the study period). Survey Methodology, June 2013 151 Statistics Canada, Catalogue No. 12-001-X Hedeker and Gibbons (2006) also suggest that since longitudinal studies allow for the measurement of time-varying explanatory variables (covariates), the statistical inferences about dynamic relationship between the outcome on interest (response) and these covariates are much stronger than those based on cross-sectional studies. When we are interested in the marginal mean of a variable, possibly conditionally on some covariates, and not in measuring change, a longitudinal study is not necessary; a cross-sectional study suffices. However, even in this case, a longitudinal study tends to be more powerful, because each subject serves as his or her own control for any unmeasured characteristics (Diggle, et al. 2002). Our approach differs from the existing alternatives in the literature, which have some limitations for analysis of such data, and in particular for application to the SDR. For example, Berger (2004a) and Berger (2004b) go into detail about the estimation of change using rotating samples, but they assume that the composition of the finite population does not change over time, which is not the case of the SDR. This assumption does not hold in many other large-scale surveys. Also, the methodology proposed by Berger is not easily generalizable to more than two waves. Similarly, Qualité and Tillé (2008) also assume the finite population is fixed over time. Hirano, et al. (2001) and Nevo (2003) present different methods of estimation assuming a fixed-panel plus refreshment for attrition design, but also assume the finite population composition is fixed over time. A time series approach is utilized by McLaren and Steel (2000) and Steel and McLaren (2007) to estimate change and trend with survey data. Although their approach allows for the incorporation of within-subject association in the point estimates, they do not consider covariates in their models (beyond the implicit time covariates). Also, they only discuss the estimation of change for continuous variables. Another alternative for analyzing longitudinal data is to fix the finite population of interest, except perhaps for deaths, which could be allowed. Studies of this kind are those where there are Statistics Canada, Catalogue No. 12-001-X data available only for a single cohort. For example, Vieira and Skinner (2008), Carrillo, Chen and Wu (2010), and Carrillo, Chen and Wu (2011) show some alternatives for modeling with single-cohort survey data. However, to use these kinds of analyses with multi-cohort surveys, one needs to ignore some (or many) available data, for example those data from subjects who are not common to all waves. An example of a weighting procedure of this type can be found in Ardilly and Lavallée (2007). Finally, the approach of Larsen, Qing, Zhou and Foulkes (2011) is appealing, in principle, because it is the way survey practitioners generally proceed. An initial weight is adjusted, among other things for calibration to known totals, in this case totals by survey wave. Nonetheless, for rotating panels this method is still in its infancy; there are some things that are not completely clear how to carry out. For example, it is not clear what the initial weight should be: a constant weight?, the earliest available weight?, the average of the available weights for each case?, or the latest available weight? Also, in the case of dropouts, as there exist in the SDR, the authors do not clarify how to carry out a nonresponse adjustment with this method. Even more, it is not clear why a nonresponse adjustment for dropouts at, say, wave 4 should have any influence on the observations at wave 3, as this methodology permits since there is a single weight for each subject. Additionally, the authors mention that they estimated standard errors, but they do not indicate how to take into account all the features of the sampling design, such as changes over time in the stratification and weighting adjustment classes of the SDR. Our method, on the other hand, utilizes only cross-sectional weights and variance estimation methods, which have been studied thoroughly in the literature and are readily available for the SDR. The rest of the paper is organized as follows. In the next section we give a description of the SDR design. After that, in Section 3, we propose a novel approach for longitudinal analysis of marginal mean models with multi-cohort surveys. Then we present the application of the methodology to the SDR. Finally we offer a few discussion points in Section 5. The SDR design"}, {"section_title": "Finite population", "text": "The SDR finite population of interest can be represented as in Table 2.1. At wave 1, i.e., the first time of interest, there is a finite set, 1 1 or not, who satisfy the requirements of the SDR.  At wave 2 only a subset of the subjects in 1(1) U still satisfy the SDR requirements; we call this subset, of 2(1) N subjects, 2(1) . U In addition, there is a set of new, recent Ph.D. recipients, who have obtained their degree since wave 1, and also satisfy the other requirements of the survey. This set of new graduates in scope is called 2(2) U and is of size 2(2) . N Therefore, at wave 2, there is a total of 2 At the next wave, wave 3, the same process occurs. Some people in 2(1) U leave the population of interest and there are only 3(1) N left in 3(1) . U The same thing happens with the set 2(2) ; U only a subset 3(2) U of 3(2) N among them still satisfy the requirements of the SDR. Additionally, there are 3(3) N recent graduates entering the population of interest; this set is called 3(3) . U In total, the finite population of interest at wave 3 is 3 Statistics Canada, Catalogue No. 12-001-X This procedure, of thinning of old cohorts and adding new cohorts, continues until the last wave of interest, wave . J We notice that the finite population of interest changes at every wave due to two main reasons. Firstly, some of the subjects in the old cohorts are no longer in scope at the current wave, and they are not part of the current target population. Secondly, the recent graduates are added to the target population in the current wave. We denote by = 1, 2, , j J  the wave of interest (outside the parenthesis) and by = 1, 2, , j J   the cohort to which a subject belongs (inside the parenthesis), and therefore wave( cohort )"}, {"section_title": "Sampling", "text": "The sampling design of the SDR has a similar structure to the finite population and is depicted in    the past practice of selecting the sample with probability proportional to size continued, where the measure of size was the base weight associated with the previous survey cycle. For each stratum, the sampling algorithm started by identifying and removing self-representing cases through an iterative procedure. Next, the non-self-representing cases within each stratum were sorted by citizenship, disability status, degree field, and year of doctoral degree award. Finally, the balance of the sample (i.e., the total allocation minus the number of self-representing cases) was selected from each stratum systematically with probability proportional to size. Statistics Canada, Catalogue No. 12-001-X It is worth mentioning that up to 1989 the cohort (or more specifically the graduation year) was part of the stratifying variables (and weight-adjustment cells), but beginning in 1991 it has not been; it was replaced by the disability status. For more details about the subsampling procedure, including the description of the sample allocation, see NSF 2012 s  the quantity j represents the wave to which the sample refers, and j  denotes the sample's cohort, i.e., the wave at which the sample was first selected. The notation for the weights is , ij w where the first subscript identifies the subject, and the second refers to the wave of interest, regardless of when the subject was first selected."}, {"section_title": "Methodology", "text": ""}, {"section_title": "Motivation", "text": "Assume that (in a non-survey context) interest lies in the 1 p  vector parameter  in the following model:  where ij Y is the response variable for subject i at wave , ij j X is a 1 p  vector of covariates, 1 2 = ( , , , ) , one-to-one differentiable \"link function\"; ( )   is the \"variance function\" with known form; and > 0  is the \"dispersion parameter.\" Since, in general, the J J  covariance matrix i  is hard to specify, we model it as a \"working\" covariance matrix; where is a \"working\" correlation matrix, both of dimension , J J  and  is a vector that fully characterizes ( )  R (see Liang and Zeger 1986). To estimate  we select a (single-cohort) sample of n elements from model  and we (intend to) measure each of them at J occasions. If all the elements in the sample respond at every single occasion , j the task can be completed with the usual generalized estimating equation GEEmethodology of Liang and Zeger (1986). However, in any study it is rarely the case that all subjects do respond at all waves. It is more common to have some elements in the sample who drop out of the study. Under this situation, and assuming that the missing responses can be regarded as missing at random or MAR (see Rubin 1976), in particular that the dropout at a given wave does not depend on the current (unobserved) value, Robins, Rotnitzky and Zhao (1995) proposed to estimate  by solving the estimating equations: is the response indicator for subject i at wave , j and ˆi j q is an estimate of the probability that subject i is observed through wave . j For survey applications, one would use the estimating equation where i w is the survey weight for subject . i Another way of writing this We notice that the diagonal elements of ˆw i  are simply wave-specific nonresponse-adjusted survey weights whenever the subject is observed, and are equal to zero whenever the subject is missing. This feature in and of itself suggests a solution to the multi-cohort problem, which will be presented in the next section."}, {"section_title": "A novel approach to combining cohorts in longitudinal surveys", "text": "Based on the discussion in the previous section, if we have a fixed-panel, fixed-panel-plus-'births', repeated-panel, rotating-panel, split-panel, or refreshment sample survey, we propose to estimate the superpopulation parameter  in model  by the solution to the estimating equations: where the sum is over the sample , s i.e., over all the elements selected (for the first time) in any of the samples For the SDR, the construction of the cross-sectional weight for wave j is not too complicated as the different cohorts are selected independently, from non-overlapping populations. The base weight in that case is easy to compute, and all that remains is the adjustment for things like attrition and calibration to known totals in the population ."}, {"section_title": "j U", "text": "On the other hand, in other situations, for example, when a frame of new members does not exist, the new cohort may need to be selected from the overall population at the given wave, or from a frame containing new members plus some old members, or from multiple frames. In such cases, the building of the cross-sectional weights may not be as straightforward, and the theory of multiple frames may need to be used. We refer the reader to the works of Lohr (2007) and Rao and Wu (2010), and references therein, for cases like that. Expression (32) is a generalization of equation 2.25in Vieira (2009). The latter is applicable only when all the subjects have the same number of observations or any missing responses can be regarded as missing completely at random or MCAR (see Rubin 1976). As discussed in Robins, et al. (1995), using such an equation when the missing responses are not MCAR produces inconsistent estimators; therefore, with a rotation scheme like that of the SDR, where not all subjects are dropped (or kept) with the same probabilities, its usage would not be appropriate. "}, {"section_title": "Unbiasedness", "text": "The unbiasedness property of the estimating function is important because, as Song (2007, Section 5.4) argues, it is the most crucial assumption in order to obtain a consistent estimator. Let us define , N  the so-called \"census estimator,\" to be the solution to the following finite population estimating equation: where the sum is over , U i.e., over all the elements who became members of the target The sampling design characteristics of a longitudinal survey can be thought of as those of a multiphase sample, as can be seen in Särndal, Swensson and Wretman (1992, Section 9.9). We therefore use the methodology of multiphase sampling for the derivations. We assume, without loss of generality, that there are only three waves; the derivations with just three waves show the patterns for general , J with respect to unbiasedness and variance. As we mentioned earlier, we assume that ij w is the cross-sectional weight for subject i at wave , j if that subject belongs to , j s and zero otherwise. From the theory of multiphase sampling we have that for is the conditional inclusion  to denote the expectation with respect to the sampling design, we have:   e From these expressions and equation 3.4  means that the mean model needs to be correctly specified; consequently, one needs to pay attention to residual diagnostics for the particular model being fitted."}, {"section_title": "A note on nonresponse", "text": "In the SDR, as in any other (longitudinal) survey, there is nonresponse. Some sampled individuals choose not to participate at all, whereas some subjects participate in some waves but not in others. The SDR remedies this situation by making a nonresponse adjustment to the cross-sectional survey weights. Assume that the nonresponse adjustment at wave j is a multiplication by the inverse of the estimated wave j response probability . rij  For example, the nonresponse-adjusted weight for a person who did respond at wave 3 (and was first selected at wave 2), i.e., for 3(2) , i r  would be We need to redefine the estimating equation, to include only the respondents, as where the sum is over the respondent set , r i.e., Statistics Canada, Catalogue No. 12-001-X over all the elements who belonged for the first time in any of the respondent sets  If additionally, the response mechanism ( ) R can be assumed to be MAR, we then have, for example for 2 2: e e e e e (3.6) where assume that the response propensity at a given wave depends on previous responses (and possibly response history), then those responses should be included in the response model, and so on. The design as well as the model-design unbiasedness follow immediately from (3.6) together with the previous section. Hereafter we therefore ignore the issue of nonresponse for notational simplicity."}, {"section_title": "Variance and variance estimation", "text": "We now develop a (Taylor Series) linearization for the variance of the proposed estimator. The basic technique is due to Binder (1983). For simplicity in the derivations and notation we divide through by ; N we redefine  and let N  be the \"census estimator,\" which satisfies ( ) = . We can write the total error of  as ˆ= ( After some straightforward calculations, the total variance, or more precisely the total MSE, can be decomposed as: where 2 = A A A    for any matrix , Furthermore, by Taylor series expansions we can obtain the following approximations: We then get, for p V and C  in (3.7), where the derivation of (3.9) can be found in the Appendix. In conclusion, so far we have found that: (3.10) In (3.10) all the terms can be estimated by \"plugging in\" the estimate ˆ  except for the term "}, {"section_title": "Design variance of the estimating function", "text": "In order to derive an expression for Var as before. The methodology is that of two-phase sampling (more precisely, multiphase sampling), as discussed in chapter 9 of Särndal, et al. (1992). After some derivations (see Appendix), and defining  ( 1)  e e for = 1, 2, 3, j and 3 > . k j  In general, we have proved the following Property 3.1 The (design) variance of ( ) s N   can be decomposed as: In (3.11), (3.12), and (3.13) we have assumed that the cohorts are design-independent. However, in some cases this assumption may not be tenable; an example of such a case is the multiple frame situation discussed in the first part of Section 3.2. Another instance in which it may not be appropriate to assume cohort independence is when weight adjustments cross cohorts, which is the case of the SDR; we discuss this issue in Section 5. Calculations for the case of three cohorts, in the Appendix, show that (3.13) holds for the variance terms even without independence. The Appendix also identifies conditions under which it is a good approximation for the covariance terms.  to wave. We use only information requested in all the waves of interest: 1995, 1997, 1999, 2001, 2003, 2006, and 2008. To illustrate our methodology, we constructed a model for individuals' salaries over time. The response is the log of salary (in the principal job), with an identity link function, and several covariates; modeling log of salary (as opposed to salary) is a standard practice. There are both time-independent covariates (such as gender) and time-dependent ones (such as employment sector). We have four major classes of covariates. The Degree variables are: degree field, years since degree, and age at graduation. The Job variables are: job field or category, sector, postdoc indicator, adjunct faculty indicator, hours worked per week in the principal job, weeks per year in the principal job, how related is the job to the doctoral degree, part-time for different reasons, number of months since started in the principal job, the starting month in the principal job, whether the employer/type of job has changed since previous wave, and whether changed employer/type of job since previous wave because was laid off or job terminated. The Person's demographics are: gender, citizenship status, race/ethnicity, presence of children in family, marital status, and spouse's working status. Finally, the \"Environment\" variables are: years since 1995, state (of employment), and the consumer price index (of the region of employment). The full list of variables, interactions, and categories can be found in Carrillo and Karr (2011). For categorical variables, the reference category is the one with the largest count. The survey weights that we use for each wave are the final adjusted weights. These weights are the original design weights adjusted for nonresponse and post-stratification. However, the theory that we developed in Section 3 assumes that the weights are the inverse of the selection probabilities; in other words, the original design weights. This is a mismatch whose effect we plan to investigate in the future. On the other hand, the calculations in the last part of the Appendix (which do not assume anything about the weights) suggest that the effect of this mismatch is small."}, {"section_title": "Estimation", "text": "The covariates and interactions that we considered were selected because they were suggested either by exploratory analyses or by the subject matter experts at the NSF. Carrillo and Karr (2011) 1995, 1997, 1999, 2001, 2003, 2006, 2008, and   We now give some conclusions about salaries in the Ph.D. workforce based on the estimated coefficients, which appear in Carrillo and Karr (2011). First of all, a sensible estimate of mean salary considers the intercept, the hours worked per week (whose average is 47), and years since degree (average of 15); so that an estimate of the overall average is exp(9.4 47   2 2 0.038 47 0.0003 15 0.03 15 0.0006) = $52, 067,       for a subject with all other continuous covariates equal to zero and in the reference of all categorical covariates. All other things being constant, women's salaries are about 93.4% those of men, whereas race does not seem to have an effect on salaries. The gender  years since 1995 interaction is not significant; therefore this salary differential is not changing over time. Notice that with a single year's data, we would not be able to evaluate the effect of time. Even more important than that, using only the data from a single wave, say 2008, we would not be able to assess whether the effect of being female is changing over time. Doctorate holders with a management job have the highest salaries, followed by those in health occupations; on the other hand, those with the lowest salaries are the ones employed in \"other\" occupations, followed by those in political science. Among employment sectors, salaries are highest in for-profit industry (20% higher than for the reference category of tenured faculty in public 4-year institutions), followed in order by the federal government, self-employment, non-profit industry, all of which are higher than the reference category. The lowest salaries are those in two-year colleges and in two-and four-year institutions for which tenure is not applicable. The highest single negative effect on salaries also occurs within the education sector. Those with positions as adjunct faculty members have salaries that are approximately 59% of the salaries of comparable doctorate holders. Not surprisingly, postdoctoral salaries are only about 74% of the salaries of comparable people in other types of positions. Sector is also a contributing factor to the hard-to-interpret dependence of salary on the starting month for the current position: salaries are lower for starting months of August and September. Statistics Canada, Catalogue No. 12-001-X Additional analyses show that the monthly effect is present only in the education sector, where, as we have seen, salaries are lower than in industry or government, and in which starting months of August and September are common. Therefore, sector is part of the answer, but not the entire answer. Finer-grained divisions of the education sector, using Carnegie classifications, further reduce, but do not remove, the significance of monthly effects. The SDR does not seem to contain sufficient data to remove the monthly effects entirely, so we have retained the SDR definition of sector. People with degrees in computing and information sciences have the highest salaries (around 20% higher than in the biological sciences), followed by those in electrical and computer engineering and in economics (approximately 16% higher). Doctorate holders in agricultural and food sciences, environmental life sciences, earth, atmospheric, and ocean sciences, and in \"other\" social sciences have the lowest salaries. The \"other\" social sciences are the social sciences excluding economics and political science. Married people have the highest salaries, followed by those who are in married-like relationships, widowed, separated, divorced, and never married. The latter have salaries only around 89% as high as the married ones; one could argue that there is some association between never married and age. The presence of children older than two is associated with higher salaries, but the presence of children younger than two is not. There is an increase of around 3% for every additional year since doctorate graduation, although there is a diminishing effect for higher number of years. We interpret this as the effect Statistics Canada, Catalogue No. 12-001-X of experience. There is a small penalty for receiving the doctorate later in life; for every additional year of age at graduation, the salary reduces by 1%. We also found that the regional Consumer Price Index (CPI) is significant. The higher the CPI, the higher the salary. We could not use the CPI associated with the labor market of employment because the SDR data do not identify geography beyond the state. We included the state in the model as a proxy for cost of living; the state effect is highly significant and some state  .1 shows that the model fits reasonably well for all the reference years as most of the standardized residuals lie between -2 and 2. Also, the distributions of residuals do not seem to greatly differ from year to year. From Figure 4.2 we also conclude that the model fits reasonably well for most people, as most of the lines fluctuate between -2 and 2. Nonetheless, there are a few people for which the model seems to greatly over-predict in 2003 and some few people for whom that happens in 2006. We included several terms in the model to correct this issue but clearly none seemed to do so completely. The last thing we tried was to produce exploratory classification trees for these residual blips. We found that, in the dataset available, the only thing related to them was the survey mode. The Statistics Canada, Catalogue No. 12-001-X blips in 2003 are disproportionately high for web responses, and the blips in 2006 are disproportionately high for CATI responses. We conclude that either there is a mode effect in these two years or those respondents have something different, in those years, that is not included in the available variables.  "}, {"section_title": "Conclusions and future research", "text": "We have proposed a novel approach to combining different cohorts of a longitudinal survey. The major requirement of our method is that there is a cross-sectional survey weight for each wave, or that one can be built from available information. This weight should allow for statistical inference to the population of interest at the corresponding wave. In that case, our method should perform better than usual estimation procedures (where the auto-correlation is not incorporated) in many practical situations, in particular when there is a high auto-correlation among responses from the same subject. In general, survey practitioners avoid as much as possible the use of multiple survey weights. However, in the case of rotating panels this is an appealing approach for at least two reasons. On the one hand, it allows for the use of all the available data in a clear and cohesive way in a single analysis procedure. On the other hand, we have shown how readily available cross-sectional survey weights can be directly used for longitudinal analysis, without the need to develop, store, and distribute an additional longitudinal weight or weights. Our method is directly applicable to any kind of longitudinal survey as long as there are crosssectional survey weights available (or these can be created) at each wave, and these weights represent the population of interest at the particular wave. For the theory that we developed about the variance of the estimator proposed, we utilized the (cross-sectional) design weights , ij w which are the inverse of the inclusion probabilities. Yet for the application in our model for salary in the SDR we used the final (cross-sectional) survey weights, which are not the original design weights, but adjusted (in the usual way) weights. This mismatch requires further exploration. Similarly, in our derivations of the variance, we assumed that the cohorts were independent. However, the SDR does not totally satisfy this assumption for two reasons. Firstly, at any particular wave, the selection of the sample from the old cohorts is not performed independently across cohorts. In order to reduce the number of strata, since 1991 the NSF has collapsed strata Statistics Canada, Catalogue No. 12-001-X over year of degree receipt for the old cohorts. Additionally, the post-stratification adjustments made to the design weights do not condition over cohort either, and as a result, weights are shared across cohorts. This sampling selection scheme and weighting adjustment procedure violate the independence across cohorts. Some additional calculations (included in the Appendix) have shown that the independence among cohort is not such a crucial requirement for our variance estimation method to produce good approximations, as explained in Section 3.3.1. In future research we plan to evaluate in more detail the impact of this issue.  The two sums in A are model-independent, i e and k  e (in B) are two modelindependent terms, and A and B both have model-expectation zero; therefore,    where, for line (A.1), we assume that the (three) cohorts are design-independent. Now, where Diag{ } e is, for a column vector , e a diagonal matrix with diagonal entries being the elements of , e and    Let us do each of the terms in (A.2) in turn, beginning with 2 1(1) , N D we have: ( where (1) (  where (2) (   With similar calculations, we obtain the corresponding expressions for   can be written as:"}]