[{"section_title": "", "text": "Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu). As such, the investigators All statistical analyses were performed in R programming language version 3.4.0."}, {"section_title": "173", "text": "The R-script is available at http://github.com/barupal/ADNI 174 175"}, {"section_title": "Results", "text": ""}, {"section_title": "176", "text": "The main objective of the study was to identify lipid co-regulatory modules that were 177 associated with AD diagnosis and its clinical and pathological features. In this direction, 178 we first computed univariate association models and obtained raw p-values for each 179 lipid. Next, we identified lipid co-regulatory modules, which were then used as set- "}, {"section_title": "Regression models for individual lipids", "text": ""}, {"section_title": "188", "text": "We first tested all individual lipids for their association with both early and late AD 189 pathogenic markers and cognitive changes (Supplement Table S2 ). Raw p-values from 190 these association models will be used as an input for the lipid set enrichment analysis in Table S3 ). 48% (168/349) of 202 all lipids were associated with at least one AD-phenotype (Table S3) were correlated with three AD-phenotypes, but no set correlated with all five phenotypes. magnitude. We found a high overlap of lipid sets that were associated with both SPARE-AD and 385 total tau, reinforcing the usability of these serum lipids as biomarkers for neurodegeneration. 386\nThese lipid sets included phosphatidylcholines and sphingolipids that were enriched in 387 polyunsaturated fatty acyls (PUFA) eicosapentaenoic acid and arachidonic acid (EPA, AA). 388\nThese fatty acids are main components of brain lipids(38, 39). The loss of brain tissue may cause 389 an increase in levels of serum lipids that include EPA and AA as acyl groups through lipid 390 remodelling (40, 41). We here identify lipid pathways associated with tau-mediated brain atrophy 391 that eventually contributes to AD. 392 393 4.4 AD diagnosis and cognitive decline 394 Previous publications reported that lower levels of PUFA in AD subjects across multiple 395 lipid classes, along with higher levels of monounsaturated lipids (4, 8, 9, (42) (43) (44) (45) (46) . We "}, {"section_title": "Diagnosis", "text": ""}, {"section_title": "Abeta142", "text": "Tau AdasCog13 Figure 3 Figure 4"}, {"section_title": "SPARE-AD", "text": ""}]