[{"section_title": "", "text": "It has proven to be more dangerous than SARS-CoV and MERS-CoV due to its alarming transmission rate through respiratory droplets, encountering infected persons or contaminated surfaces. 4 SARS-CoV-2 was first identified by meta-transcriptomic sequencing from the bronchoalveolar lavage fluid of a patient in China and the sequence was made available at Global Initiative on Sharing All Influenza Data (GISAID) platform on 12 th January 2020. 5 Phylogenetic analysis shows that about 30 kb genome of this new RNA virus is most closely related to a group of SARS-like coronavirus (humans and bat) with 89.1% similarity. 5 "}, {"section_title": "SARS-CoV-2 has 14 open", "text": "reading frames (ORF), which codes for structural, accessory non-structural and replication proteins. ORF1ab is the largest of all having 21,291 nucleotides and codes for replicase polyprotein. Structure protein genes located downstream to ORF1ab, aligned in the following order-spike (S), envelope (E), membrane (M) and nucleocapsid (N) with ORFs that code for accessory non-structural proteins are located in between. SARS-CoV-2 forms a capsid of lipid bilayer with embedded E, M and S proteins. 6 Till the time any drug or efficient vaccines are developed, the biggest challenge in front of the scientific committee and health workers is to contain the spread of the virus by testing, tracing and isolation of infected subjects until recovery.\n. CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020. 11.27.20237032 doi: medRxiv preprint Since the first SARS-CoV-2 sequence was made available, more than 140,000 complete genome sequences have been added to the list by laboratories across the world. Despite a large number of sequences being available, it is still not clear how fast the virus mutates and if the mutations impact its virulence in the context of the growing pandemic. In addition, very little information is available regarding the clinical proteome of the virus. Until recently, only a few proteins, mainly including structural proteins N and S have been identified from clinical swabs. Besides, host proteome studies from clinical samples are necessary to fill the void in understanding the host response to viral infection.\nIn this study, genomic analysis of COVID-19 was performed by next generation sequencing (NGS) on swab samples of Reverse transcription-polymerase chain reaction (RT-PCR) positive individuals, collected from Bangalore, India. Variant analysis of these samples showed a high mutation rate, with ≥11 mutations observed per sample. Phylogenetic analysis of these sequences with other variants from India as well as across the world revealed their close relation to one of the Bangladesh isolates, which had showed European origin. SARS-CoV-2 phylogeny indicated the prevalence of isolates showing multiple origins within a country. Overall, through genomic analysis of SARS-CoV-2, our study highlighted increasing variations (SNPs) in the viral genome and their role to understand its evolution and virulence.\nIn addition to sequencing the genome by NGS, our study also explored the COVID-19 clinical proteome and host-protein responses by using high-resolution mass spectrometry (HRMS). We performed HRMS on swab samples of both RT-PCR positive and negative patients. In total, we identified 41 peptides matching to 13 different COVID-19 proteins, including proteins from ORF1ab polyprotein, Spike glycoprotein, ORF3a, ORF9b and Nucleocapsid. Additionally, the host proteomic analysis revealed significant differences between RT-PCR positive and RT-PCR . CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint negative host proteomes. We found 441 proteins to be uniquely present in positive samples. Most of these proteins are involved in neutrophil degranulation and activation pathways indicating host immunological response to the virus. In conclusion, our analysis confirms the presence of COVID-19 peptides in nasal swab samples and proteomic analysis also predicted host responses to viral infection, including identification of the neutrophil response as a key host response against COVID-19 infection."}, {"section_title": "Sample Collection", "text": "Nasopharyngeal swab samples were collected from the diagnosed patients as a part of routine monitoring. Part of the samples after diagnosis were sent to the lab for research purpose. Samples were classified into positive and negative based on the RT-PCR result targeting E and RNAdependent RNA polymerase (RdRp) genes of the virus. Samples were collected only after the approved consent of the patients who were informed about the study. The study was conducted after approval of the institutional human ethics committee, IISc (19-01092020)."}, {"section_title": "RNA Library Preparation", "text": "Total RNA from nasopharyngeal swabs of three positive patients (RT-PCR test) was extracted using Trizol based extraction. RNA samples were quantified using Qubit RNA Assay HS (Invitrogen). RNA purity was checked using Nanodrop and integrity was assessed on TapeStation using RNA HS ScreenTapes (Agilent). Qiagen SARS-CoV-2 Primer (Qiagen) was used to prepare libraries from RNA extracted from COVID-19 positive subjects. Viral RNA was converted to cDNA and used as a template for multiplex PCR with primers spanning the entire genome of the virus. The amplicons were then pooled and purified before proceeding for library preparation.\n. CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020. 11.27.20237032 doi: medRxiv preprint During library preparations, the amplicons were subjected to a series of enzymatic steps that repair the ends, tails the 3' end with a single 'A' nucleotide, followed by ligation of the adapters. The adapter-ligated products were then purified and enriched using a limited cycle PCR. The final cDNA libraries were purified and checked for fragment size distribution on TapeStation using D1000 DNA ScreenTapes (Agilent)."}, {"section_title": "Next-generation sequencing of SARS-CoV-2", "text": "Prepared cDNA libraries were quantified using Qubit High Sensitivity Assay (Invitrogen).\nQuantified libraries were pooled and diluted to final optimal loading concentrations for cluster amplification on Illumina flow cell followed by sequencing on Illumina HiSeq X instrument to generate 150 bp paired-end reads."}, {"section_title": "Mutation analysis", "text": "Initially, the quality of the reads was checked using FastQC v0.11.9. 7 Further, the sequencing adapters clipped at 5' and 3' end of reads were trimmed using Cutadapt v2.9. 8 The adapter trimmed pair-end reads were then aligned to the Wuhan reference genome (Accession No. NC_045512.2) downloaded from NCBI. 9 The fast and accurate read alignment was achieved by using BWA v.0.7.12 aligner. 10 The aligned reads were sorted, removed soft-clippings and then variant calling was performed using GATK variant caller. 11 The reported variants were then annotated to study their effects in proteins and genes using SNPEff tool. 12 The variant class, amino acid changes and other relevant annotations were added to the variants."}, {"section_title": "Nucleotide Sequence Accession Number", "text": "The SARS-CoV-2 whole genome sequences have been submitted to NCBI under the accession number PRJNA668889."}, {"section_title": "Phylogenetic Analysis", "text": ". CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint\nThe evolutionary history was inferred by using the Maximum Likelihood method and the Tamura-Nei model. 13 The tree with the highest log likelihood (-525441.09) was generated. The initial tree for the heuristic search was obtained automatically by applying Neighbor-Join and BioNJ algorithms to a matrix of pairwise distances estimated using the Tamura "}, {"section_title": "Sample preparation for Mass spectrometry", "text": "In-solution sample preparation was done to extract the peptides from the protein solution.\nBriefly, samples collected in VTM were centrifuged at 14,000 rpm for 15 min at 4°C. The supernatant was collected in a separate microcentrifuge tube and the pellet was washed with 1x PBS. Further, the pellet containing epithelial cells was lysed by 1x Triton buffer (chilled). Lysate in the supernatant was collected after centrifuging at 14,000 rpm for 20 min at 4°C. Both lysate and supernatant were proceeded for protein precipitation by the addition of chilled acetone and kept at -80°C for 2 hrs. Precipitated proteins were washed with chilled acetone and dissolved in 50mM ammonium bicarbonate. Proteins were reduced using 10mM DTT (Sigma-Aldrich) in 50mM ammonium bicarbonate at 56°C for 45 mins followed by alkylation with 55mM iodoacetamide in 50mM ammonium bicarbonate at 37°C for 30 mins in the dark. In-solution digestion was carried out by adding trypsin (Promega) 1µg/µl to a final protease to protein ratio of 1:50 (w/w) and incubated at 37˚C for 16 hours, with frequent shaking. Digestion was stopped using formic acid and all the samples were subjected to vacuum dry.\n. CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint"}, {"section_title": "Mass Spectrometry and Database Search", "text": "The dried trypsin digested peptides were reconstituted in a mixture of 20% ACN and 80% MQ containing 0.01% formic acid. The protein digests were analyzed using Agilent 1290 Infinity II LC system coupled with Agilent Advance Bio Q-TOF (6545XT). The column used for chromatography was Agilent AdvanceBio Peptide Map (2.1x 150mm, 2.7µ). Mobile phase A was MQ (0.1% formic acid) and mobile phase B was ACN (0.1% formic acid). The peptides were separated by using a 90 min gradient flow at a flow rate of 0.4 ml/min. The MS and MS/MS scan were acquired in the positive mode and stored in centroid mode. The following MS data acquisition parameters, Vcap was set at 3500V, drying gas flow rate and the temperature was set at 12 L/min and 270 C, respectively. Collision energy with a slope of 3.6V/100 Da and an offset of 4.8V was used for fragmentation. The precursor ion data were captured in a mass range of 200-1800 m/z and product ions data were acquired in the range 50-2900 m/z. Reference exclusion was given for 0.05min after 1 spectrum. The raw data were analyzed using MaxQuant software (v1.6.2.10) and processed through the MS excel sheet. The database analysis was performed against SARS-CoV-2 proteome and Homo sapiens proteome in the UniProt database (Proteome ID-UP000005640).\nThe following search parameters were used for the database analysis: Precursor mass tolerance:\n10ppm, fragment mass tolerance: 40ppm with cysteine carbamidomethylation as a fixed modification and methionine oxidation and protein N-term acetylation as variable modifications."}, {"section_title": "MS Data repository", "text": "Mass spectrometry proteomics data acquired on nasopharyngeal swabs have been deposited to the ProteomeXchange Consortium via the PRIDE 15 partner repository under dataset identifiers PXD021896 and 10.6019/PXD021896. . CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint"}, {"section_title": "Gene ontology and Pathway Analysis", "text": "All Uniprot IDs of host proteins found exclusively in COVID-19 positive samples were extracted and analyzed through DAVID Tool for conversion to Entrez IDs. These Entrez IDs were then used for the identification of Gene Ontology terms and pathways. Statistical significance of the genes involved in positive samples was analyzed using the R package, clusterProfiler. To determine whether any terms annotate a specified list of genes at a frequency greater than that would be expected by chance, clusterProfiler calculates a p-value using the hypergeometric distribution.\nStatistically enriched GO terms were then plotted and analyzed through dot plot, category net plot (Cnetplot) and enrichment map (Emap)."}, {"section_title": "Genome sequence reveals emerging mutations in SARS-CoV-2", "text": "Since the first SARS-CoV-2 genome sequence was shared on 12 th Jan 2020, 5 there are more than 133,000 genome sequences are available at GISAID to date. 16 To correlate the sequence of prevailing COVID-19 with those reported earlier, we carried out Illumina HiSeq X, NGS of SARS-CoV-2. COVID-19 RNA from nasopharyngeal swabs, tested positive by RT-PCR was converted to cDNA and processed for NGS as described in the methods section. NGS analysis retrieved the complete genome sequence from all three samples. FastQ files generated from NGS were reference mapped to SARs-CoV-2 isolate, Wuhan-Hu-1 (Accession No. NC 045512.2) with 100% genome coverage. The alignment of these 3 isolates with reference genome showed the prevalence of single nucleotide polymorphism (SNPs) (Figure1). Sample 1, 2 and 3 showed 11, 16 and 19 SNPs, respectively. The number of mutations observed are higher than the average mutations per sample . CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint of around 7 worldwide. 17 Further, to see the evolutionary relationship of these isolates we constructed a phylogenetic tree using MEGA X software. Phylogenetic analysis showed that sample 2 and 3 are more closely related and all three are in close relation to one of the Bangladesh isolates, which appears to be originated from France isolates. Distinct clade-wise assignment revealed that all the isolates belong to G derived clade (European origin), isolate 1 to GR and isolate 2 and 3 to GH."}, {"section_title": "Figure 3", "text": "Clinical proteome of SARS CoV-2\nDespite an ample collection of genome information, the information on clinical proteome of COVID-19 is ill explored. Only around 15 studies reported the proteome of SARS-CoV-2. 18 We carried out HRMS analysis of SARS-CoV-2 clinical proteome. Part of the nasopharyngeal samples . CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint obtained from 12 COVID-19 positive patients were analyzed using Agilent Advance Bio Q-TOF (6545XT). Extracted proteins from swabs were reduced, alkylated and digested as described in the methods section. From MS/MS spectra recorded at FDR ≤1% we were able to identify 41 unique peptides matching to 13 different viral proteins. The maximum number of peptides were attributed to ORF1ab polyprotein. As showed in peptide-map in Figure 3 Figure 4A represents the Venn . CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint diagram of host proteins. We identified 441 proteins to be uniquely present in positive sample, 246 exclusively in negative sample and 158 found common to both.\nWe classified unique proteins from the proteome of positive samples to their GO terms and pathways to characterize host protein dynamics upon viral infection. The statistical significance of GO was further analyzed using the R package, clusterProfiler. In total, proteins unique to positive samples were classified into 244 GO terms. Figure 3B showing a dot plot for the top 30 GO terms according to their statistical significance. We found neutrophil mediated immune responses including degranulation and activation of neutrophil to be higher in positive samples (35 gene count). The abundance of proteins involved in these pathways found to be enriched in positive samples. Additionally, we observed a large collection of proteins involved in the cellular response to oxidative stress and toxic substance and in metabolic pathways, for instancenucleoside/ribonucleoside triphosphate metabolic process, NAD and NADH metabolic process, amino acid metabolism and glycolytic process. Apart from these, we also observed increased number of proteins involved in RNA processing mechanism including-regulation of RNA/mRNA stability, splicing and localization to Cajal bodies. Among host immune responses, proteins involved in interleukin 12 and 7 mediated signaling pathways were also identified in the positive samples. Figure 3D showing enriched map plot for the pathways identified for unique proteins present in positive samples. Our results indicate that viral infection modulates host in all aspectsbiologically, molecularly and cellularly for its survival.\n. CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity."}, {"section_title": "(which was not certified by peer review) preprint", "text": "The copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint direct effect on protein structure and function, but the emergence of new mutations with time may modulate its virulence. Also, mutations in the extragenic region may impact RNA folding, transcription and replication ability. 20 Based on the marker mutations within the phylogenetic cluster, GISAID introduced a nomenclature system for major clades. Distinct clade wise assignment reveals that all the isolates belong to G derived clade (European origin), isolate 1 to GR and isolate 2 and 3 to GH specifically, highlighting the current prevalence of G originated clades. Though there are 6 major clades currently, more clades can be classified in future with emerging and settling mutations.\nTo map the evolution and spread of SARS-CoV-2, a global whole-genome phylogenetic tree was created. We observed no direct correlation between isolates and geographic regions though some isolates showed close relations with other isolates of the same country or neighboring countries. For instance, isolates from India mapping close to neighboring countries like to protein 3a and 9 to structural proteins S (2) and N (11) . Detection of ORF9b with two peptides . CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (Figure 4) , as also reported previously, which showed that host cells try to combat viral load by alleviating immune response especially, mediated by macrophage, complement and IL-6 signaling. 26, 27 Here we observed enrichment of neutrophil-mediated immune responses which are known to play a crucial role in airway infections and elicit antiviral response. 28 Not many studies are there who commented on the role of neutrophils in COVID-19 and more or less their role is not very clear. Though they are important for effective immune response, they can also be cytotoxic and lead to hyperinflammation through degranulation and lysis during severe pneumonia. [28] [29] [30] With increasing studies showing upregulated neutrophil genes and neutrophilattracting chemokines in SARS-CoV-2, current literature also showed their role in damaging host inflammatory responses through involvement of NETs and increased neutrophil-to-lymphocyte . CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint ratio observed in severe cases, indicating their association to COVID-19 pathology. [31] [32] [33] Hence, further studies would be useful in dissecting their role and to understand the mechanism involved in severe cases.\nWe also observed more proteins involved in the cellular response to IL-12 and IL-7, which has a role in adaptive immune system mainly T-cell mediated immune response. As expected, we observed a heightened response to oxidative stress. An additional cluster of proteins identified in clinical swabs mainly enriched in RNA processing (splicing, spliceosomal components), mRNA stability, localization to Cajal body and RNA metabolism. This result relates to previous studies which also suggested splicing as a crucial pathway for SARS-CoV-2 survival. 21 35, 26 Overall, through our study we suggest a complete alteration of host processes affecting cellular, metabolic or biological functions. Furthermore, our global proteomics unravels cellular and molecular pathways for therapeutic interventions. Essentially, our result suggests that proteomics can not only offer timely and sensitive diagnosis but also has the ability to reveal prognosis and severity of viral infection.\nAltogether our study combining genomics and proteomics revealed genome-wide SNPs, COVID-19 proteome and dynamics of host proteome in clinical samples. In combination with etiological and patient severity details, multiomics studies cannot only predict the progression of . CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint SARS-CoV-2 but will also help in identifying drug targets to offer counter treatment for this as well as for future pandemics. is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint . CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint . CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint . CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint . CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint . CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint . CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) preprint\nThe copyright holder for this this version posted November 30, 2020. ; https://doi.org/10.1101/2020.11.27.20237032 doi: medRxiv preprint"}, {"section_title": "DISCUSSION", "text": "To strengthen the understanding of SARS-CoV-2 in terms of its origin, virulence and host-virus pathogenesis we have analysed the virus genome, proteome as well as host protein response in COVID-19 patients. Our genomic analysis based on these three samples from Bengaluru, which is an urban city in the Southern part of India confirms a high rate of mutation in Indian isolates.\nEarlier studies observed a low mutation rate of the virus, with an average of 7.23 mutations per sample. 17 This rate seems to vary between countries whilst India (8.40), Kazakhstan (9.47) and\nBangladesh (9.47) show high mutation rate per sample as compared to the world's average. Whilst India's average mutation rate is estimated around 8.40, our all three isolates showed ≥11 mutations per sample, with an average mutation rate of 15.33, which is significantly higher than those reported previously. As previous studies were conducted during early phase of pandemic hence, low mutation rate was observed. In total, we found 27 SNPs out of which 14 results in synonymous mutation, 11 missense mutation and 2 are extragenic in nature, observed in the 5'UTR region. there is no change in entropy for 241C>T transition. But entropy is significantly changed for 110C>T transition, not only for that particular base but also for the stem it belongs as compared to WT. This transition may impact viral RNA processing and expression through altered binding of predicted host RBPs-BRUNOL4, RBM38 and SRSF2. 19 So far, the virus has maintained its genome integrity by avoiding large scale indels and most of the mutations observed are in form of SNPs ( Figure 1 ). The silent mutations could cause a cumulative effect in the long term, in terms of translational efficiency by changing codon usage. Missense mutations may or may not have a . CC-BY-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity."}]