[{"section_title": "Abstract", "text": "Many developed are conducting studies to increase their citizens' interest in the STEM fields and educate STEM-literate individuals. These studies include STEM-related curricula and professional development programs to enhance knowledge and skills of teachers who will implement them. In the last five years, Turkey has also been following these developments closely and carrying out activities to this end. One example of these studies is in-service training activities conducted by Kayseri STEM Center affiliated with Kayseri Directorate of National Education (MoNE). The aim of this study was to find out the effects of Kayseri MoNE STEM Centre on teachers' Professional development. It was implemented as a special case study. Study data were collected by means of semi-structured interviews, field notes and semi-structured observation tools. Results of the study revealed that Kayseri Professional Development Program of Ministry of National Education has an enhancing effect on STEM-related knowledge and skills and implementation of these skills in their classes."}, {"section_title": "Introduction", "text": "Turkey has a developing economy dependent on technological and industrial manufacturing. Business areas in the fields of industry and technology are in need of a large number of qualified staff well-trained in 'STEM (Science, Technology, Engineering and Mathematics)' areas, which cover science, technology, engineering and mathematics. Also to stay in the race in the global world, rapid progress is essential in these areas. Yet, national and international assessments show that students' achievement levels in science, technology, engineering and mathematics are low, their interest in these areas is decreasing and they do not opt for these areas in their career choices. In a study carried out by İstanbul Aydın University (2014), distribution of the first 1000 students entering numerical fields (related with mathematics and science skills) between the years 2000 and 2014 was investigated by percentage of placement in STEM fields. While in 2000, the rate of placement in STEM fields was 85.63%, it decreased to 27.88% in 2010, increasing to 38.23% again in 2014. Of the students entering numerical fields in 2014, placement rate of males in STEM fields was 81.39%, while it was 18.61% among females. As a result, it was found out that there is a drastic decrease in the number of students placed in STEM fields by year and there is a wide gap between settlement rates of males and females in related fields. Also results of the International Mathematics and Science Study status determination were examined. According to the science examination given to the 8th graders during TIMSS-2011 (Trends in International Mathematics and Science Study), Turkey obtained 463 points well below the world average, behind the United Arab Emirates, but only one row above Lebanon. This finding is confirmed by results obtained from national tests. For example, science and technology exam averages in 2013 SBS (Placement Test) reveal that students' performance was quite low with the average 6.76 net responses out of 20 questions.\nOne of the most important factors affecting students' success in science and mathematics can be said to be their attitude towards the course. If they develop positive attitudes towards science and mathematics, their success tends to increase in those courses and they choose more STEM fields for career (Bybee, 2010; Han et al., 2015) . Existing research suggests that there is a significant relationship between teachers' teaching methods and materials they use in classes and students' attitudes towards the course (Yangın, Sidekli and Gökbulut, 2007) . To develop positive attitudes among students towards STEM areas, it seems necessary to ensure engaging in interesting and effective teachinglearning process linked to everyday life. It has become mandatory to use the methods and teaching materials in order to improve the quality of science and mathematics education, to increase students' interest in the course and make association between science and everyday life.\nTherefore, it has recently been thought that it would be more efficient to teach mathematics and science by making references to technology and engineering subjects with an integrative approach (STEM -Science, Technology, Engineering and Mathematics) (NRC 2012) . In this way, students' awareness and interest levels in STEM career can increase and they can get the opportunity to establish relationship between everyday life and science (Moore et al., 2013) .\nThe STEM approach has become widespread in the United States with the reports of \"Tapping America's Potential: The Education for Innovation Initiative and National Academies\" published after 2005, and \"Rising above the Gathering Storm: Energizing and Employing America for a Brighter Economic Future\" published in 2007. According to these reports, American STEM work force is expected to increase by 14% between the years 2010 and 2020; nevertheless, this increase cannot be adequately met with trained individuals in STEM fields, thus a crisis will happen in the future. Following these reports, STEM education was identified by politicians as a key to revive the American economy and promotion of the STEM education has become a general policy. Since then, investments have been made in various STEM fields and an increasing number of STEM Schools have been opened in parallel (Pinnell et al., 2013) . STEM programs and STEM schools based on STEM education have also been established in seven states in the USA (Raju. and Clayson, 2010) .\nIt is seen that professional development programs are being carried out in various centers for teachers to improve the effectiveness of education in STEM schools in the USA. The most popular and active of these centers is the National Center for Technology Literacy within the Science Museum in Boston. This center provides in-service training in engineering and technology for K12 teachers. In the center, the professional development program includes online courses with handmade projects and \"Engineering is the basics\" workshops particularly offered to classroom teachers (Hannoverrapor, 2013) .\nLikewise, European Union countries are facing a crisis in the STEM fields. Despite developments in STEM fields, the number of students interested in careers in areas related to science, technology and engineering is decreasing year by year and only few female students want to study in the STEM fields as a result (Rocard et al., 2007) . Therefore, researchers across Europe have been encouraged to develop collaborative projects in science and society fields by the European Union. In this framework, many projects were developed such as inGenious as a part of the 7th Framework program implemented between the years 2007 and 2013.\nIn Turkey, the case can be said to be similar to and even worse than the STEM fields in the United States and European Union countries. According to a survey carried out by TÜSİAD (Turkish Industrialists' and Businessmen's Association), only 19% of the labour force employed in STEM field in Turkey (manufacturing and heavy industry, retail and services sector) are graduates of STEM field (64% male and 34% female). In addition, it is stated in the report that demand for labour force in STEM field will further increase in 5 years, but the demand will not be able to be met by existing or future labour force in the STEM fields. This result is also supported by findings reported by ÖSYM (Student Selection and Placement Center) as official testing and evaluation authority in Turkey. According to the ÖSYM, the percentage of students graduating from STEM fields in years 2011 and 2012 was 19%, which increased only to 22% during 2012 and 2013.\nIn Turkey, the term STEM has been newly recognized. In the framework of the Vision 2023 project, new courses such as science applications and mathematical applications were included in the elementary curriculum as a part of the MoNE (Ministry of National Education) Strategic Plan for 2010-2014 with ultimate aim of improving access to STEM education and the quality of STEM education (Marulcu and Barnett, 2013) . In connection with STEM centers, several, not many though, STEM Centers were established. The earliest and the most popular of these centers is Kayseri MoNE STEM Center established by Kayseri Provincial Directorate of National Education. In this center, various courses are offered to teachers in various disciplines from elementary to high school in order to help them gain knowledge and skills related to STEM. The most important features of this center might be listed as being the first example in Turkey, consisting of specialized teachers from different branches in the center, providing consulting services to schools, being conducted in state schools, exponential increase of the number of teachers who participate in in-service courses over the years and nature of the study. Since the major influence created by Kayseri MoNE STEM Center in the STEM field attracted the attention of the higher education institutions in our country, various studies are also being carried out by those universities. As an example; İstanbul Aydın University STEM Center, STEM Laboratory of Hacettepe University (H-STEM Lab, 2014), Muş Alparslan University and Recep Tayyip Erdoğan University can be mentioned. Although Kayseri Ministry of Education STEM Center is an effective organization, there is scarcity of research on effectiveness of the professional development programs developed by the center so far. Considering this research gap, present study was planned by researcher to shed light into this issue.\nThe aim of this study was to find out the effects of Kayseri MoNE STEM Centre on teachers' Professional development."}, {"section_title": "Method", "text": "Since the aim of the research is to describe an existing situation, it was carried out as a special case study in which semi-structured interviews, field notes, and semi-structured observation instruments were used for data collection. Study sample consisted of 6 teachers and 9 students from four schools in central Kayseri. During sample selection, one school was selected from each of the high schools, secondary schools and elementary schools where STEM applications are carried out by using purposive sampling. 2 teachers from each school participated in the study along with 3 students for each teacher. Interviews and observations were carried out in the learning environment where STEM design activities are realized by students. Demographic information is given below about the study sample. "}, {"section_title": "Results", "text": "Study data were analyzed with descriptive analysis and summarized under two headings."}, {"section_title": "Views of Teachers", "text": "The findings obtained from observations and interviews with teachers are summarized in following tables:\n1. Did you have any information about STEM education before joining the courses organized by Kayseri MoNE STEM Centre? Half of the teachers stated that they had not heard of the STEM approach by the time they attended the course. The other half of the participant teachers said that they took part in the events due to the attention and curiosity raised by Kayseri MoNE STEM Center. Cls-T1: …students enjoy making things from small pieces. They are learning with fun. Even passive students are attending the course… A method adapting engineering to the subject of the course"}, {"section_title": "What do you think about STEM education after attending the course?", "text": ""}, {"section_title": "Phy-T2", "text": "Phy-T2: we need engineers for the future. The number of engineers has increased in my class.. An approach that helps students exhibit positive attitudes toward lessons Sci-T2, Cls-T2 Cls-T1: In every lesson, students want to be engineers and design models..."}, {"section_title": "A method that allows learning by doing", "text": ""}, {"section_title": "Phy-T1", "text": "Phy-T1: they learn by making their own models, they are having a lot of fun... All of the participating teachers noted that they developed a positive attitude towards the STEM approach. Most importantly, it seems that they hold positive views and attitude about applicability of the STEM approach in class. During school observations, it was found out that teachers together with students design models in laboratories as an extracurricular activity and competitions are held among students to produce several creative models."}, {"section_title": "What do you think about applicability of the STEM approach in the classroom since you attended the course?", "text": "5. Have you taught lessons based on the STEM approach since you attended the course? 6. What are the obstacles you face in applying the STEM approach in your classroom? Table 7 . The obstacles that teacher's face in applying the STEM approaches in their classroom."}, {"section_title": "Themes", "text": "Teachers Example of sentence explaining the theme STEM activities take too much time Phy-T1, Phy-T2, Sci-T1, Sci-T2, Cls-T1, Cls-T2 Phy-T1: Soon after I attended the course, I had the gears model built in physics lesson. But we could make a model in 2 hours. ... Both there was chaos and it took too much time... The curriculum is not suitable for STEM Phy-T1, Phy-T2, Sci-T1, Sci-T2, Cls-T1, Cls-T2 Sci-T2: current science curriculum is not appropriate for this, I think. There are no engineering design activities in the curriculum..."}, {"section_title": "Crowded classes", "text": "Cls-T1 Cls-T1: Classes are crowded, the material is not enough. Some students stay passive during activities, which makes students unhappy.."}, {"section_title": "Lack of materials", "text": "Cls-T1, Cls-T2 Cls-T2:Materials are too expensive to buy and use at all grade levels...\nIt is understood from interviews and observations with teachers that almost all of them implement STEM activities in free activity or science practice lessons or in laboratory after school lessons. As a reason for not implementing the STEM activities in class, majority of the teachers indicated the timeconsuming nature of such activities and inappropriateness of the course curriculum for implementation of the STEM approach. They think it is impossible to finish the curriculum and students cannot obtain academic success due to these reasons. 7. What is the impact of STEM applications on students? Phy-T1, Phy-T2, Sci-T1, Sci-T2, Cls-T1, Cls-T2 Phy-T2: The students really enjoy making models of STEM, they go to the laboratories and dealing with models even during break time… Uninterested students are eager to participate in STEM activities Phy-T1, Phy-T2, Sci-T1, Sci-T2, Cls-T1, Cls-T2 Phy-T1: I saw passive students design very beautiful models. I was surprised by many students… Female students participated in the activities Phy-T1, Phy-T2, Sci-T1, Sci-T2, Cls-T1, Cls-T2 Sci-T2: I am very pleased to see that especially girls made models. Even, one became the first in a robot competition.\nCreative ideas were put forward Phy-T1, Phy-T2, Sci-T1, Sci-T2, Cls-T1, Cls-T2 Cls-T2: They did very creative things and I was very surprised. One of the students made a cement mixer. Their problem solving skills developed Phy-T1, Phy-T2, Sci-T2, Sci-T1: While making models, they solved the difficulties they faced as a group with quite original ideas. For example, in the absence of materials, they could produce alternative materials.."}, {"section_title": "Communication skills developed", "text": "Phy-T2, Sci-T2, Cls-T1, Cls-T2 Cls-T1: I think their communication with each other was developed because they can express their demands and wishes so well…"}, {"section_title": "Views of Students", "text": "The findings obtained from observations and interviews with students are summarized in following tables:\n1. What are your thoughts about this implementation? Phy-S1, Phy-S2, Phy-S3, Sci-S1, Sci-S2, Sci-S3, Cls-S1, Cls-S2, Cls-S3 Cls-S3: It is very tasteful to do something with these materials and I love it so much. My father will buy the same for me, too.. It is a very nice feeling to design things Phy-S1, Phy-S2, Phy-S3, Sci-S2, Sci-S3, Cls-S1, Cls-S2, Cls-S3 Sci-S2: I was going to be a dress designer, but I gave up. I will design machines because it is much more beautiful. It gives me pleasure to design something Phy-S2, Sci-S2, Cls-S3 Phy-S2: I enjoy making or breaking things. These things are just for me, very enjoyable. My creativity is developing in lessons Phy-S1, Phy-S2, Sci-S1, Sci-S2, Sci-S1: We do creative things with friends, even we are amazed at the things we do. I put my free time into good use during break time or outside school Phy-S1, Phy-S2, Sci-S1, Sci-S3, Phy-S3: As soon as the class finishes, I run to the laboratory in order to add a few more pieces to the model I built in class and to immediately complete it.\nA majority of teachers indicate that interest in the science course has increased particularly among females and disinterested students, and their creativity and communication skills of students have developed through STEM activities. During observations in the laboratories, it was seen that especially females are very willing to do activities and groups completely comprised of females carried out works. Investigation of the STEM models demonstrated that different and creative models are exhibited in the laboratory and classroom.\n2. What do you want to be in the future? Why did you choose this job? (Students gave multiple answers for this question. Below are listed the top three answers) Phy-S3, Sci-S1, Sci-S2, Sci-S3, Cls-S1, Cls-S2, Cls-S3\nWe made a small robot with my friends, I will build larger robots when I grow up… Computer engineer Phy-S1, Phy-S2, Phy-S3, Sci-S2, Sci-S3, I will be a computer programmer and I will make brain for robots, artificial brains... Astronaut Cls-S1, Cls-S2, Cls-S3 I will be an astronaut, I will go up to the space, and I will live there..."}, {"section_title": "Car designer", "text": "Phy-S1, Cls-S2 I love engines and I dream of making powerful cars.. Mechanic designer Phy-S1, Sci-S2, Cls-S1 I want to design machines which will help people."}, {"section_title": "Scientist", "text": "Phy-S3, Cls-S3 I would like to do research as a scientist and make different machines Crane operator Sci-S1, Cls-S3\nWe made a crane model with friends, I was loved it so much Doctor Sci-S1, Sci-S3 Doctors make good MoNEy.\nn addition, interest of females and males in STEM professions is compared in a table: It is seen that majority of the students choose professions related with STEM, especially nearly 100 % of the females choose those professions."}, {"section_title": "Conclusion and Discussion", "text": "This study shows that practical professional development program implemented by in Kayseri Ministry of Education (MoNE) STEM Center has a significant impact on teachers' developing positive interest and attitude towards STEM fields. According to Wang and et al., the most important factor affecting applicability of an approach is the positive attitude held by teachers regarding application of the approach in the class. It was found out that majority of the teachers developed positive attitude towards the implementation of the STEM approach in class as a result of the STEM course. Still, STEM activities are implemented as extracurricular activities due to the high amount of time required for such activities, incompatibility of the current curriculum with the STEM approach and exam success concern. Our findings seem supportive of the results noted by Shahali and et al. in their study carried out with teachers. Apart from that, examination of the impact of STEM approach on students revealed that students have a positive attitude towards STEM activities particularly engaging girls and passive learners in hand-on activities. Positive reaction of students regarding STEM activities has led them to opt for STEM fields for their future profession. Particularly considering the decreasing interest of university students in STEM related professions in Turkey, it becomes obvious how important the STEM courses held by Kayseri STEM Center. It is suggested to start similar courses in different provinces so that this approach could be expanded across Turkey. In this way, teachers would have received in-service training thanks to the courses based on the developed application for implementation of this approach in class at desired levels. Additionally, primarily curricula based on STEM approach should be developed for implementation of this approach in classes in Turkey. Apart from that, many studies conducted on the attitudes towards science emphasize that female students have very little interest in the natural sciences compared to male students (Hannoverrapor, 2012; Siew et al., 2015) . Interestingly, in present study, female students could develop positive attitude towards science thanks to the STEM activities guided by teachers who participated in the course. Therefore, it seems likely to increase female students' interest in science by using the STEM approach."}]