[{"section_title": "Introduction", "text": "The rapid spread of SARS coronavirus 2 (SARS-CoV-2) demands an immediate public health emergency, and no FDA approved treatment/vaccines are currently available. SARS-CoV-2 Spike (S) protein (1267 amino acids) is essential for virus entry through binding with the host receptor angiotensin converting enzyme II (ACE2) and mediating virus-host membrane fusion (Boopathi et al., 2020; Sarma et al., 2020) . The S protein contains two functional domains (S1 and S2). The S1 (residues 14-685) domain performs the function of virion attachment with human ACE2 receptor on epithelial membrane cell surface, followed by its internalization, hence initiating the infection (Hasan et al., 2020) . This binding induces certain conformational changes in the S protein, which results the S2 (residue 686-1273) to mediate fusion with cellular membrane. The receptor-binding domain (RBD) of the SARS-CoV-2 S protein are highly conserved and directly involve in binding to human ACE2 (Yuan et al., 2020) . Since, ACE2 is not mutated/evolved to recognize S protein of SARS-CoV-2; therefore, using alternative of ACE2 with more binding affinity for S protein than the wild type receptor, may inhibit entry of SARS-CoV-1& À2 into human cells. This strategy can play important role in devising therapeutics of SARS-CoV-2. Several studies have proposed small compounds based inhibitors as therapeutic agents for Covid-19 (Aanouz et al., 2020; Elmezayen et al., 2020; Gupta et al., 2020; Khan et al., 2020; Wahedi et al., 2020) . The small compounds based drugs may not efficiently block the entire binding patch of S protein. On the other hand, the peptides based therapeutics can block the entire binding interface (RBD) of S protein (Wan et al., 2020b) , as reported for HIV peptide based drug Fuzeona (Jenny-Avital, 2003; W ojcik & Berlicki, 2016) . There is growing interest in peptide based therapeutics for Covid-19 treatment (Pant et al., 2020) and approximately 140 peptide based drugs have been evaluated in clinical trials (Fosgerau & Hoffmann, 2015) . Peptide based drugs have little side effects and little drug tolerance compared with chemical drugs (Bruno et al., 2013) .\nIn order to block the fusion of SARS-CoV-2 S protein with human cells, a recent study has reported a neck and transmembrane deficient ACE2, called as soluble ACE2 (sACE2), that can block the entry of SARS-CoV-2 into the host cell (Procko, 2020) , which is also found safe in healthy human subjects (Haschke et al., 2013) and patients with lung disease (Khan et al., 2017) . Recombinant sACE2 is under clinical trials for COVID-19 treatment in Guangdong province of china (Clinicaltrials.gov #NCT04287686). The study proposed that mutations in ACE2 receptors interface may increase S/ACE2 interaction. Another study has proposed a 23 amino acid peptide, derived from ACE2 (amino acid position 21-43), which can bind with SARS-CoV-2 S protein with a low nanomolar affinity, and can block the attachment of SARS-CoV-2 to human ACE2 .\nSince, the binding residues of ACE2 involve in interaction with RBD are located at amino acid position 21-119 (Wan et al., 2020a; Yan et al., 2020) , therefore, we hypothesized that this fragment carrying all the binding residues will have better binding affinity for RBD and can hinder the interaction of SARS-CoV-2 with human ACE2, hence blocking its entry into the epithelial cells. We designed a truncated version (tACE2) of ACE2 receptor covering the binding residues and performed protein-protein docking and molecular dynamic simulations to analyze its binding affinity for RBD and complex stability. The tACE2 will compete with wild type human ACE2 receptors for binding to SARS-CoV-2, as they will have more binding affinity for S protein. This will allow all SARS-CoV-2 viral particles to bind strongly with the tACE2, blocking all its available binding sites for the host ACE2 receptors, thus inhibiting its entry into the cell which will be eliminated through body defense mechanisms. We further determined the soluble expression for tACE2 in E. coli, a suitable host for bulk production of tACE2."}, {"section_title": "ACE2 and SARS-CoV-2 spike protein structures and sequence alignment", "text": "The PDB structure of ACE2 and RBD of SARS-CoV-2 S glycoprotein (PDB ID: 6m17) was obtained from PDB database. In order to determine the variation in the SARS-CoV-2 S glycoprotein sequence reported from different regions of the globe, 61 S glycoprotein sequences of SARS-CoV-2 including reference sequence (NC_045512, reported from Wuhan, china) were retrieved from NCBI. Multiple sequence alignment of the sequences was performed through MEGA-X. The aligned sequences were then analyzed for amino acid variations."}, {"section_title": "Truncation of ACE2 and structure optimization", "text": "The PDB structures of ACE2 and RBD were repaired for their missing loops and optimized for energy minimization and amino acid side chain clashes through FoldX (Schymkowitz et al., 2005) . Side chains were optimized through FoldX to remove Vander Waals' clashes by mutating residues with bad energy values into new rotamers with energy minimization (Van Durme et al., 2011) . The optimized three dimensional (3 D) structures of ACE2 and RBD were used to design truncated ACE2 and studying protein-protein interactions. Based on protein-protein interactions between ACE2 and RBD shown in ACE2-RBD complex (PDB ID 6m17), a truncated version of ACE2 was produced by removing the C-terminus residues from amino acid position 116-768, leaving a truncated N-terminus fragment tACE2, from 21-119 amino acid position. The first 20 residues of ACE2 is the signal peptide (Huang et al., 2003; Turner & Hooper, 2004) , therefore it was also removed. The structure of tACE2 was produced through I-TASSER, which build the model by assembling continues fragments of multiple threading templates, identified through Replica Exchange Monte Carlo (REMC) simulations (Yang et al., 2015) ."}, {"section_title": "Protein-protein docking", "text": "In order to determine binding affinity of both intact and truncated ACE2 with SARS-CoV-2 S glycoprotein, rigid body protein-protein docking tools; ZDOCK (Pierce et al., 2014) , ClusPro (Kozakov et al., 2017) , Patchdock (Schneidman-Duhovny et al., 2005) and a flexible protein-protein docking tool, HADDOCK (Van Zundert et al., 2016) were used. The energy function used by ZDOCK is Z score, which is a cumulative of pairwise shape complementarity function with desolvation and electrostatics. The ZDOCK rank the top 10 predicted docking poses on the basis of Z score (Chen et al., 2003) . ClusPro uses PIPER's scoring function, which contains terms of shape complementarity, electrostatics, and pairwise potentials applied on the top 1000 conformations produced and ranked on the basis of cluster size. Patchdock uses patchdock score as the energy function which ranked the docked model based on desolvation energy, interface area size and geometric score (Zhang et al., 1997) . HADDOCK is a flexible docking method used for docking of protein-protein complexes. HADDOCK drive the docking process by retrieving information from experimentally identified protein complex interfaces. The HADDOCK scoring function consists on combination of various energies and buried surface area. The scoring of the models was performed according to the HADDOCK score. All the generated docking poses of ACE2 and Spike protein were visualized through PyMOl (Schrodinger, 2010) .\nRBD was docked with intact and truncated ACE2 through HADDOCK, a flexible protein-protein docking tool. The method allows the side-chains and backbone atoms of both the protein and receptor flexible during docking run . HADDOCK scoring function (HADDOCK score) is a linear combination of non-bonded intermolecular van der Waals (VWs), Coulomb electrostatics energies and empirically derived desolvation energy term (Vangone et al., 2017) .The HADDOCK-Score of ACE2 and tACE2 was À111 and À126.6, respectively, (The more negative the better). Similarly the VWs and electrostatic energy of tACE2-RBD complex was also greater than the ACE2-RBD complex, which shows higher binding affinity of tACE2 for RBD than the intact ACE2 (Table  1 ). The RMSD value of ACE2 and tACE2 in complex with RBD were 0.7 and 0.8, respectively, showing the high likelihood of the docked complexes with native-one (Vangone et al., 2017) . In order to further confirm these docking scores, rigid docking was also performed through Patchdock, Z-dock and ClusPro protein-protein docking tools. The docking results obtained for ACE2 was compared with tACE2 in term of energy functions of each docking tool (Table 2 ). All the three docking scores are higher for tACE2 than that of the intact ACE2, indicating high affinity of tACE2 for RBD.\nOur docking results showed that seven residues of ACE2 Glu23, Thr27, Asp30, Glu35, Tyr 83, Asn 330 and Lys 353 of ACE2 interact with RBD residues Lys417, Lys458, Asn487, Tyr 489, Gln493, Tyr495, Gly496, Thr500 and Gly502, respectively, which is almost similar to the binding residues profile of ACE2 interface reported previously (Yan et al., 2020) , with additional Thr27 and Glu35 reported by our docking results (Figure 1(A, B) ). However, the tACE2 form a different binding residues network than the intact ACE2. Our docking results showed that Ser23, Asn31, Tyr30, Glu36, Gln40, Gln76 and Arg95 of tACE2 are involved in binding with RBD ( Figure 1(C,  D) ). This seems that the truncation has produced the conformational changes in the tACE2-RBD complex which results in exposure of buried binding residues , thus facilitate higher binding of tACE2 to the RBD as compared to the native ACE2, which are in agreement with previously reported peptides inhibiting viral attachment with the host cell (Koehler et al., 2013) ."}, {"section_title": "Protein-protein binding affinity prediction", "text": "Based on the HADDOCK score and the docking RMSD value, the docked complexes of ACE2 and tACE2 with RBD were analyzed for binding affinity DG (kcal mol À1 ) and stability using protein binding energy prediction (PRODIGY) server (Xue et al., 2016) . The server predicts the binding affinity and stability on the basis of structural properties of the proteinprotein complexes. Stability of the protein-protein complex is measured through dissociation constant K d (M). The run was performed at different temperatures ranging from 25 to 36˚C. The protein-protein docked complex with the minimum RMSD and higher binding affinity was considered for MD simulation to further confirm stability of the complex."}, {"section_title": "Molecular dynamic (MD) simulations", "text": "MD simulation of the RBD domain in complex with intact ACE2 and tACE2 was performed through GROMACS 5.0.4 (Abraham et al., 2015) . Simulation was performed by using charm 36.0 force field and TIP3P cube box as water model. The protein complex in the cubic box was solvated with water molecules to provide an aqueous environment. The system was then neutralized with addition of 3 Na ions followed by energy minimization for removal of conflict between the atoms. The system was then equilibrated through NVT and NPT at constant temperature (300 K) and pressure (1 bar), respectively. Langevin thermostat was applied to regulate temperature of the system. MD simulation was then run for 20 ns."}, {"section_title": "Post translation modifications predictions", "text": "In order to determine post translation modifications (PTMs) in ACE2, the protein sequence was submitted to PTM-ssMP server, which combines the submitted sequence and site specific modification profile to predict PTM sites in mammalian protein (Liu et al., 2018) . Since, glycosylation is the most abundant and diverse posttranslational modification of proteins, therefore, we further determined the O-glycosylation sites in ACE2 using NetOGlyc 4.0 Server which specifically predict the GalNAc-type O-glycosylation site, unique to Ser and Thr (Steentoft et al., 2013) . We further determined the N-glycosylation sites by using NetNGlyc-1.0 Server using a threshold value of 0.5 (Gupta et al., 2004) ."}, {"section_title": "Solubility prediction of tACE2 for expression in E. coli", "text": "In order to express the tACE2 in E. coli, its soluble expressionat 37 C was determined through CamSol Intrinsic and CamSol Structurally Corrected online solubility prediction tools (Sormanni & Vendruscolo, 2019) . CamSol determines the solubility on the basis of amino acid sequence, while CamSol Structurally Corrected tool determines the solubility profile on the basis of the structure, which accounts for amino acid distribution in the structure and their solvent exposure. Both run was performed at pH 7.0. In both methods, the solubility profile scores higher than 1.0 denotes highly soluble regions, while scores lower than À1 indicates poor solubility in E. coli."}, {"section_title": "SARS-CoV-2 S protein showed sequence conservation in the receptor binding domains", "text": "In the current study, we have proposed a truncated version of ACE2 that comprises the binding interface for receptor binding domain (RBD) of SARS-CoV-2 Spike protein. Recently, in-vitro binding assay have confirmed that RBD is mainly responsible for initial binding to ACE2, which further mediate virus entry into the host cell (Lan et al., 2020) . Variation in the RBD sequence was analyzed in the SARS-CoV-2 genome reported from various region of the globe so far (Shu et al., 2020) . The sequence alignment showed more than 99.99% homology for RBD domain, with only single variation R408I in the SARS-CoV-2 genome reported from India ( Figure S1 ). The rest of the SARS-CoV-2 genome sequences submitted throughout the globe have identical RBD sequence, which indicate that the SARS-CoV-2 RBD is highly conserved globally. Structural elucidation has also found the RBD domain as highly conserved (Lan et al., 2020)."}, {"section_title": "Designing truncated variant of human ACE2", "text": "In order to block the Spike protein attachment to the cell, the ACE2/RBD binding interface comprising residues from position 21-119 of ACE2 was selected as truncated version of ACE2.The structure of tACE2 was built through I-TASEER with C-score 1.22. The C-score value in range À5 to 2 shows correctness of the fold. The high C-score for tACE2 suggest the highly likelihood of the structure. The tACE2 fragment contains almost all binding residues involve in binding with RBD domain of SARS-CoV-2 (Yan et al., 2020) , covering two complete helices (Lan et al., 2020) . This suggests that rational design of a binder based on this interface with enhanced affinities to RBD may play vital role by blocking the SARS-CoV-2 spike protein interaction with ACE2, thus inhibiting viral entry into the host cell. Previously, peptides based strategies have been employed successfully to inhibit fusion of the SARS-CoV-1 S protein and membrane receptor (Du et al., 2009) . Another recent study has reported a 23 amino acid based peptide, a homologue of ACE2 binding interface, which successfully bind with S protein with low nanomolar affinity . Since, the binding residues for ACE2 are located at distant location on RBD, thus providing a larger protein binding site, which is difficult for a small size therapeutic peptide to cover the entire binding sites on RBD. However, our proposed tACE2 fragment carrying almost all the binding residues that can block the attachment of RBD with the intact ACE2."}, {"section_title": "tACE2 demonstrated higher affinity with RBD than wild type ACE2", "text": "Since, docking methods are not reliable for predicting binding affinity between protein-protein complexes, due to their simple scoring functions (Ram ırez & Caballero, 2016). As binding affinity of protein-protein complex also depends on dissociation constants (K d ), pH and temperature (Kastritis & Bonvin, 2010) , while these parameters are not included in the benchmark of docking scoring functions. Therefore, we determined the binding affinity of ACE2 variants for RBD through PRODIGY server, which determine the binding affinity based on structural properties of the protein-protein complexes (Vangone & Bonvin, 2015) . The ACE2 and tACE2 complexes showed À10.7 and À12.7DG (kcal mol À1 ) binding affinity for RBD, respectively, at temperatures ranges from 20 to 37 C, showing higher binding affinity of tACE2 for RBD than the intact ACE2 (Table 3) . Similarly, the dissociation constant K d value of tACE2-RBD complex was more than three-fold lesser than the intact ACE2-RBD complex, showing that tACE2 is more tightly bound to RBD. The smaller K d value indicates high stability and strong binding affinity between protein-protein complex (Johnson et al., 2007) . The ACE2 variants showed a significant decline in K d value when temperature was increased from 20 C to 36 C, leading to a lower K d (9.8 Â 10 À10 M) for tACE2 (higher affinity) than that of intact ACE2 (2.6 Â 10 À8 M) at 36 C.This K d value of tACE2 is lesser than the previously reported K d value (47 nM) of SBP1 (an ACE2 derived peptide of 23 amino acid) to RBD . The optimum stability of the complexes was found at 36˚C (Table 3 ). The dramatic changes of binding kinetics might be caused by reduced stability of ACE2 complex below optimum temperature 36˚C (Zhao et al., 2018) ."}, {"section_title": "MD simulation showed stability of tACE2-RBD complex", "text": "In order to determine the structural stability and dynamic behavior of intact ACE2-RBD and tACE2-RBD complexes, we performed MD simulation for 20 ns using GROMACS 5.0.4. The docking pose of each complex obtained from HADDOCK with lowest energy was selected for MD simulation run. To investigate structural stability of the complex, RMSD plot of the complex backbone was produced. A uniform RMSD plot signifying structural stability of tACE2-RBD complex. The RMSD value for tACE2 complex was 0.2-0.25 nm, while intact ACE2 showed 0.25-3.0 nm RMSD (Figure 2 ). The RMSD value of tACE2-RBD complex is lesser than SBP1-RBD complex, reported previously, which is almost 0.8 nm , showing higher stability of tACE2-RBD complex. Root mean square fluctuation (RMSF) was determined to evaluate the residues flexibility of both ACE2 and RBD in the docked complexes. The high RMSF values indicate the mobility of residue side chains in relation to their average position (Kumar et al., 2014) .The RMSF plot shows the residues of RBD in tACE2 complex are stable with a few peaks with RMSF more than 0.2 nm (Figure 3(B) ), while RBD of ACE2 complex shows many residues with rmsf above 0.35 nm (Figure 3(D) ).The residues of tACE2 at position 24, 30, 40, 76 and 95 showed reduction in rmsf value due to creating binding interactions with RBD (Figure 3(A) ). The residues involved in binding with other protein, present lower RMSF values, reveal the most stable regions of the complex (Ardalan et al., 2018) .Similarly, the residues window of 470-480 of RBD showed higher fluctuation to 0.25 nm, while decrease in fluctuation at the binding residues positions (Figure 3(B) ). The most violent fluctuation in the intact ACE2 was observed at C-terminus, which was above 0.7 nm (Figure 3(C) ).\nThe overall RMSF values of both tACE2 and RBD are below 0.2 nm, which indicate that tACE2 complex with RBD is stable, which are in agreement with a previously reported rmsf value 0.4 nm, showing complex stability (Maqsood et al., 2020) . The overall trajectories obtained after every 100 ps during a 20 ns MD simulation run, very small backbone deviation for both the intact ACE2 and tACE2 complex was observed (Figure 4) . However, the amino acid region 470-489 of RBD has shown backbone fluctuation highlighted as yellow (Figure 4(C) ), which we suggest the region of binding site for ACE2. Previously, the amino acid region of the SARS-CoV-2 spike protein (480-488) was also reported as binding region for ACE2 (Ibrahim et al., 2020) . À185.2 Ã The HADDOCK score is defined as: 1.0 Evdw þ 0.2 Eelec þ 1.0 Edesol þ 0.1 EAIR. ÃÃ The Z-score produced by HADDOCK indicates standard deviations from the average cluster (the more negative the better). Radius of gyration (R g) of both ACE2 complexes describes overall spread of molecule during a 20 ns MD run. A low Rg value indicates better structural integrity and folding behavior (Erva et al., 2016) . A slight increase in Rg value of the intact ACE2-RBD complex was observed during first 5 ns of the run, then after no further drifts till end ( Figure 5 , red line), however, the tACE2-RBD complex was found stable throughout the MD run ( Figure 5 , violet line), which indicates its structural integrity. Overall, the MD simulation results confirm that tACE2 form a more stabilized complex with RBD and suggest its inhibitory features for SARS-CoV-2 Spike glycoprotein."}, {"section_title": "PTMs analysis", "text": "Post-translational modifications (PTMs) play important role in protein-protein interactions (Su et al., 2017) . Since, experimental methods are high-cost and time-consuming, therefore, it is necessary to theoretically predict PTMs site on protein to be expressed heterologously. PTM-ssMP, which predict PTMs sites on human protein based on local sequence and site specific modification profile (Liu et al., 2018) . ACE2 analysis through PTM-ssMP server predicted ubiquitination at position 74 and 304, phosphorylation at 606 and O-glycosylation at 720 residue position. The PTM site at 74 is important for protein degradation and have no role in PPIs (Lecker et al., 2006) . In transmembrane proteins, the extracellular domains may only be N-glycosylated (Gupta et al., 2004) . However, there was no N-glycosylation and Oglycosylation site predicted for tACE2. These results conclude that there is no PTMs site predicted on tACE2, which is important for protein-protein interactions. Interestingly, an experimental study reported that the lack of glycosylation do not affect the binding of SARS-CoV-1 RBD to human ACE2 (Chakraborti et al., 2005) , which strongly support our designed tACE2 fragment, if expressed in E. coli may bind efficiently with RBD of SARS-CoV-2 S glycoprotein. Figure 2 . RMSD plot of the ACE2-RBD (red) and tACE2-RBD complex (violet) backbone atoms. The tACE2 complex showing less RMSD value than the intact ACE2, indicating its higher complex stability than the intact ACE2. "}, {"section_title": "tACE2 predicted soluble expression in E. coli", "text": "Since, there was no PTM site predicted in tACE2, therefore, E. coli would be an ideal host for its large scale expression. E. coli is the easiest, quickest, and cheapest expression host with a fully known genome, most widely used for hetrologous expression of recombinant protein (Basit et al., 2019) . Since, ACE2 is eukaryotic protein; therefore, its expression in its native form in E. coli will be uncertain, as most of the eukaryotic protein showed insoluble expression in E. coli, which need to be refolded invitro , which is costly and time consuming. That's why, the protein that express in soluble form in E. coli are referred as \"low hanging fruit\", as their bulk production is cost effective and easy to recover (Maqsood et al., 2020) . Both sequence and structure based solubility prediction tool using CamSol software predicted expression of intact ACE2 in a completely insoluble form in E. coli with intrinsic solubility score À1.027 and complete soluble expression of tACE2 with a solubility score of 1.23. The software generate solubility profile with one score per residue, where regions with scores higher than 1 denote highly soluble regions, while scores lower than À1 showing poorly soluble ones (Figure 6(A, B) ). These results propose E. coli as a suitable host for soluble expression of tACE2 using pET28a (þ) as an expression vector, which favors single step purification."}, {"section_title": "Conclusion", "text": "Structure-based rational design of inhibitory protein with enhanced affinities to the SARS-CoV-2 Spike glycoprotein may facilitate development of potential therapeutics. In this study, we have designed a truncated version of human angiotensin converting enzyme 2 as a potential inhibitor of spike glycoprotein. The truncated protein tACE2 was extensively studied through protein-protein docking and MD simulation for binding to RBD of SARS-CoV-2 spike glycoprotein. We found that tACE2 can bind to RBD with a higher binding affinity and form more stabilized complex than the intact ACE2. In addition, the tACE2 sequence predicted soluble expression in E. coli, which makes it an easy target for rapid production at large scale for SARS-CoV-2 prevention. We believe that this study narrow down the region of interaction between SARS-CoV-2 S glycoprotein and human ACE2 and paves the way to further enhance the binding affinity between tACE2 and SARS-CoV-2 S glycoprotein through rational design. This will open a new path to COVID-19 treatment."}, {"section_title": "Disclosure statement", "text": "The authors declare no conflict of interest."}]