[{"section_title": "Abstract", "text": "This article provides data for five different neuropsychiatric disorders-Attention Deficit Hyperactivity Disorder, Alzheimer's Disease, Autism Spectrum Disorder, Post-Traumatic Stress Disorder, and Post-Concussion Syndrome-along with healthy controls. The data includes clinical diagnostic labels, phenotypic variables, and resting-state functional magnetic resonance imaging connectivity features obtained from individuals. In addition, it provides the source MATLAB codes used for data analyses. Three existing clustering methods have been incorporated into the provided code, which do not require a priori specification of the number of clusters. A genetic algorithm based feature selection method has also been included to find the relevant subset of features and clustering the subset of data simultaneously. Findings from this data set and further detailed interpretations are available in our recent research study (Zhao et al., 2017) [1]. This contribution is a valuable asset for performing unsupervised machine learning on fMRI data to"}, {"section_title": "a b s t r a c t", "text": "This article provides data for five different neuropsychiatric disorders-Attention Deficit Hyperactivity Disorder, Alzheimer's Disease, Autism Spectrum Disorder, Post-Traumatic Stress Disorder, and Post-Concussion Syndrome-along with healthy controls. The data includes clinical diagnostic labels, phenotypic variables, and resting-state functional magnetic resonance imaging connectivity features obtained from individuals. In addition, it provides the source MATLAB codes used for data analyses. Three existing clustering methods have been incorporated into the provided code, which do not require a priori specification of the number of clusters. A genetic algorithm based feature selection method has also been included to find the relevant subset of features and clustering the subset of data simultaneously. Findings from this data set and further detailed interpretations are available in our recent research study (Zhao et al., 2017) [1] . This contribution is a valuable asset for performing unsupervised machine learning on fMRI data to Data is available with this article and also in a public repository: https:// github.com/xinyuzhao/identification-of-brain-based-disorders.git"}, {"section_title": "Value of the data", "text": "We describe an analysis pipeline that can identify different neuropsychiatric disorders in an unsupervised fashion and measure their correspondence with clinically defined labels as well as phenotypic clusters.\nThis approach can be used to develop imaging biomarkers of neuropsychiatric disorders, which could potentially be used as an aid by the clinician, in addition to currently available subjective markers, to improve diagnostic precision.\nThe data and code provided in this article can be used for reproducing the results in the research article entitled \"Investigating the correspondence of clinical diagnostic grouping with underlying neurobiological and phenotypic clusters using unsupervised learning\" [1] . They can also be applied to study other neuropsychiatric disorders.\nCluster labels identified using the proposed analysis pipeline can be used by other researchers to improve upon our clustering results."}, {"section_title": "Data", "text": "Four different datasets are presented in this article. Each dataset includes: The codes are composed in MATLAB, which contains implementation of three existing unsupervised clustering methods, i.e., hierarchical clustering [2] , ordering points to identify the clustering structure (OPTICS) [3] , and density peak clustering (DPC) [4] , along with genetic algorithm (GA)-based feature selection [5] ."}, {"section_title": "Experimental design, materials and methods", "text": "In this work, a general pipeline has been developed that can cluster subjects into different neuropsychiatric disorders in an unsupervised way, along with further characterizing the similarity of such neurobiologically-informed clusters with phenotypic/behavioral clusters and clinically determined clusters. Four different datasets were used. Three of them -ADNI (Alzheimer's Disease Neuroimaging Initiative), ADHD-200, and ABIDE (Autism Brain Imaging Data Exchange) -are publicly available. The fourth one -posttraumatic stress disorder (PTSD) and post-concussion syndrome (PCS) -was acquired in-house. The proposed pipeline was verified using these datasets which contains the following different disorders: Attention Deficit Hyperactivity Disorder (ADHD) from ADHD-200, Alzheimer's Disease (AD) from ADNI, Autism Spectrum Disorder (ASD) from ABIDE, PTSD and PCS from data acquired in-house. The following four different connectivity matrices obtained from functional magnetic resonance imaging (fMRI) data were used to define the neurobiologically informed feature space: statistic functional connectivity (SFC), variance of dynamic functional connectivity (vDFC) [6] , statistic effective connectivity (SEC) [7] , and variance of dynamic effective connectivity [8] . Hierarchical clustering, DPC and OPTICS were separately used as the clustering algorithms. GA was used to select the most optimal set of features, which maximizes the similarity between clusters obtained from connectivity, phenotype/behavior and clinical labels.\nFurther details about the data acquisition and analysis pipeline are presented in the research paper associated with this data release [1] . The documentation of data and code are presented within this article, as well as in GitHub repository: https://github.com/xinyuzhao/identification-of-brain-baseddisorders.git."}, {"section_title": "Disclosures", "text": ""}]