[{"section_title": "Abstract", "text": "(NACME) was founded in 1974 to ensure American competitiveness in a fl at world by leading and supporting the national eff ort to expand U.S. capability through increasing the number of successful African American, American Indian, and Latino women and men in science, technology, engineering and mathematics (STEM) education and careers. NACME Alumni hold leadership positions in industry, medicine, law, education and government. With funding from corporate and individual donors, NACME has supported over 24,000 students with more than $124 million in scholarships and other support. Currently NACME provides scholarship support to more than 1,300 college of engineering students through a national network of 50 partner universities. NACME's STEM education strategy incorporates a continuum of programs and activities from middle school through workforce entry. Visit us at www.nacme.org.\nThe College Affordability Crisis College aff ordability serves as a signifi cant barrier to postsecondary degree a ainment. According to the Na onal Center for Educa on Sta s cs, for the 2010-11 academic year, the average cost for undergraduate tui on, room, and board was $13,600 at public ins tuons, $23,500 at private for-profi t ins tu ons, and $36,300 at private not-for-profi t ins tu ons. Since the turn of the century, a er adjus ng for infl a on, the prices for undergraduate tui on, room, and board at public ins tu ons rose by 42 percent, and prices at private not-for-profi t ins tu ons rose by 31 percent"}, {"section_title": ".", "text": "College enrollees have been forced to absorb increasing amounts of debt due to these rising educa onal costs. In the 2007-08 school year, 65.6 percent of college seniors reported taking out student loans to fund their undergraduate educa on 2 . The average debt level among students who earned their bachelor's degree has steadily risen in the last decade, even when adjus ng for infl a on, as seen in This issue, which the Na onal Ac on Council for Minori es in Engineering, Inc. (NACME) refers to as The College Aff ordability Crisis, can be par cularly problema c for low-income families. The 2007-08 Na onal Postsecondary Student Aid Study revealed that 48.3 percent of dependent students whose parents earned less than $20,000 took out Federal loans, while 54.6 percent of dependent students whose parents earned between $20,000-$39,999 also took out loans 4 . The aff ordability of an ins tu on plays a large factor in helping students decide where to a end college. In a na onal survey of 192,912 fi rst-me, full-me college students entering 283 four-year colleges and universi es, 66.6 percent of respondents reported that the current economic situa on signifi cantly aff ected their college choice, and 13.4 percent reported that not being able to aff ord their fi rst-choice was \"very important\" in deciding which ins tu on to a end 5 . Once enrolled, many students are forced to work in order to support themselves fi nancially, which can o en be detrimental to their schoolwork. In the Beginning Postsecondary Students Longitudinal Study, which tracked the six-year college comple on rate of a na onally representa ve sample of over 12,000 students who began college in the fall of 1995, students who did not complete their degree were more likely to have worked 15 hours or more a week in college (42.6 percent, compared with 27.1 percent among those who completed their degrees) 6 . Many students from low-income families choose not to enroll in college a er comple ng high school. In 2010, the immediate college enrollment rate of high school completers from low-income families was 30 percentage points lower than the rate of high school completers from high-income families (82 to 52 percent) . While URMs face other obstacles to earning postsecondary degrees, par cularly in the STEM fi elds, the rising cost of a college educa on is par cularly problema c. On the 2009 Baccalaureate and Beyond Longitudinal Study, a higher percentage of African American (27.7 percent) and American Indian/Alaska Na ve students (25.4 percent) reported accumula ng high student loan totals ($33,500 or more) in their undergraduate programs compared to their peers (15.9 percent of all students)."}, {"section_title": "NACME SCHOLARS PROGRAM", "text": "To alleviate this issue, NACME provides block grants to colleges and universi es that, in turn, distribute funding to talented African American, American Indian, and La no students enrolled in engineering programs as part of their fi nancial aid packages. NACME is responsible for more than $4 million in scholarships awarded annually to underrepresented minority engineering students. The annual survey of NACME Scholars asks students to rate the rela ve importance of 14 possible sources of funding for their undergraduate educa on. In 2011-12, 85 percent rated the NACME Scholarship as \"very important\" to funding their educaon, as seen in Table 2 ."}, {"section_title": "n = 101", "text": "Percentage Number NACME Scholarship 85% 86\nFellowship or scholarships other than NACME 71% 72\nFederal or state grant (e.g. Pell grants, Lottery scholarships, etc.) 67% 68\nStudent loans from the school you attended, or from the federal or state government (repayable aft er you leave school) 56% 57\nFinancial support from parents, spouse, relatives (not to be repaid) 53% 53\nEarnings from internships/co-ops or other non-work-study employment 52% 52\nWork-study 30% 30\nTuition waivers 22% 22\nFinancial assistance from your employer 18% 18\nCredit cards 13% 13\nLoans from banks that are not specifi cally student loans 9% 9\nLoans from parents or other relatives (to be repaid) 8% 8"}, {"section_title": "GI Bill benefi ts 7% 7", "text": "Armed forces reserves or ROTC funds 4% 4 "}, {"section_title": "POLICY CONSIDERATIONS", "text": "College aff ordability is a signifi cant problem in the American educa onal system that must be addressed. We encourage policymakers and educa onal ins tu ons to pursue the following policies and prac ces:\n1. Reduce the amount of student loans disbursed to low-income students. Several schools have instuted policies that eliminate loans from the fi nancial aid package of low income students"}, {"section_title": "11", "text": ". More universies should follow this model to ensure that low-income students have fair access to higher educa on."}, {"section_title": "Increase both merit and need-based grant and scholar-", "text": "ship support allo ed to undergraduates. Support funding opportuni es, like the NACME Scholarship, that allow students to earn a degree without gradua ng with high debt.\n3. Invest in the community college pathway. Only 13 percent of students a ending public two-year colleges took out student loans in 2007-08 12 .\nResearch has shown that community colleges serve as an important pathway to a baccalaureate for URMs in engineering (including NACME Scholars 13 ), so increased investments in these ins tu ons are needed to best serve these students. "}]