[{"section_title": "", "text": "rial, reflecting the scope of interests of the four coauthors, who are well-known ornithologists and conservation biologists with interests in bird and habitat monitoring and mapping. An important resource, it plays a very useful role in summarizing bird counting methods, and the many examples and illustrations document survey methods for a variety of situations.\nAlthough it covers a wide range of topics, Bird Census Techniques is not a complete resource for designs and methods of bird surveys. An enormous number of programs exists worldwide, and Bibby et al. tend to highlight surveys and methods used in the UK and Europe. The book does an admirable job in defining the imperatives of survey design and in reviewing the advantages and disadvantages of major techniques, but sometimes does not follow through in defining the difficulties associated with many of the described methods and in suggesting alternatives. It also tends to dodge some of the technical issues by introducing the topics, then suggesting additional references in lieu of additional discussion. Although this approach undoubtedly improves readability by reducing the amount of detail, it also limits readers' access to details that are crucial for understanding the limitations of some methods and the value of other approaches.\nEarly on in Bird Census Techniques, the authors suggest that the quality of information needed in surveys differs depending on the goals. They suggest that although many survey methods provide biased estimates of bird abundance, they are sufficient for other goals such as estimation of population change. Unfortunately, our present state of knowledge does not allow us to reasonably make this assessment; we often do not know whether the information many methods collect will prove to be useful. Hence, while I agree with the authors' optimistic view that most surveys have some value, the real need is to establish when particular methods can meet goals, how other methods are deficient, and what can be done to improve the quality of the information. Often, these issues cannot be addressed from observation of existing methods. It is useful to understand what others have done, but it is not useful to replicate the mistakes of the past; all survey methods should be subject to review and revision. Presentations of existing surveys must never lose sight of the potential for incorporating improved estimation procedures.\n''Census Errors'' (Chapter 2) provides a quick view of some of the statistical details associated with counting birds. All survey methods and designs must be judged with regard to two fundamental issues: accommodation of detectability (i.e., the notion that some birds go undetected during sampling, and that this pro-portion detected can vary over space and time) and sampling frames (the grouping of the population into sample units so that all parts of the target population have some chance of being sampled). With monitoring programs and conservation activities, these issues become of crucial importance; when adversarial situations arise, most of the data presently collected on bird populations simply will not stand the scrutiny. When describing a sampling method, it is necessary to document how these issues are to be addressed. These topics are important, and (perhaps showing my own bias as a quantitative ecologist) I would have preferred both a stronger Chapter 2, in which a firm basis for discussing these topics was established, and more explicit reference to means of assessing the quantitative value of survey methods. For example, introductory discussion of sample designs for probabilistic samples is given slightly more than one page of text in Bird Census . Although the topic is revisited throughout the text (e.g., p. 67; p. 95-96; 166-167; 198-199) , presentation of more of the general details at the start would have been beneficial, as would references and discussion of adaptive sampling and other efficient sampling methods (e.g., Thompson and Seber 1996) . Chapter 2 also introduces the issue of detectability in the context of accuracy and bias, and briefly describes the three standard approaches to accommodating detectability: (1) standardization of methods, (2) modeling during analysis, and (3) direct estimation of detection rates during sampling. In my view, standardization is necessary for surveys, but generally is not sufficient to ensure consistency in detection rates of birds; all sampling methods should have some capability for estimation of detectability.\nTerritory mapping (Chapter 3) is a good example of a sampling method of ambiguous value. Many ornithologists view territory mapping as the best bird sampling method, primarily because it appears to provide an exhaustive sample from a site. Although territory mapping has been used for decades to monitor birds on several continents, has rigorous standards for implementation, and has a large base of research on factors that influence mapping efficiency, the method is subject to a variety of errors and inconsistent interpretations. Observer differences can influence analyses of change over time within sites, indicating that results from territory mapping must be treated as unadjusted counts in analysis (i.e., with great caution). I found the extensive description of the method and the frank discussion of its limitations to be very interesting and useful. The authors note that color marking of birds is one way of enhancing the value of the mapping technique; it is also possible that application of capturerecapture methods using maps simultaneously collected by two observers would provide reasonable estimates of population size for the site.\nThe line transect discussion (Chapter 4) is a valuable contribution, as the authors describe a well-developed sampling method that incorporates detectability estimation. By collecting distance data from the transect line to the bird, distance procedures can be used to estimate bird densities. The authors describe the estimation procedure, and discuss use of computer software (Program Distance, Thomas et al. 1998 ) for data analysis. Many readers should find the description of field and analytical methods to be of interest. One item that needs more emphasis is the technical issue that transects should not be located on roads or other disturbed areas, as detection distances and densities observed along roads may not be representative of the entire region of interest. The authors address this issue, but only as a note in the final paragraph of their second example. It is also interesting to note that three of the four examples presented do not use distance methods for estimation, but treat the transects as indexes to abundance.\nIt is gratifying to note that distance-sampling methods are also recommended in conjunction with point counts (Chapter 5), although the authors note that estimation is slightly more complicated for ''point transects.'' They recommend that investigators adopt standards similar to ongoing studies to allow comparability with other data. I would temper this recommendation by suggesting that if the ongoing studies do not include distance estimation, the new studies collect distance information or use some alternative approach for detectability estimation. ''Comparability'' is often an illusion, and comparisons of unadjusted (for detectability) counts are always dependent on a variety of untestable assumptions. Although I was a bit singed by the authors' criticism of the North American Breeding Bird Survey in this section (and would note that the references they cite are quite old), I agree with them. It is time we address these criticisms, before these commentaries undermine this very important survey. As with the line transect section, only one of the examples contains actual use of detectability estimation. Finally, I note that recent applications of double-observer counting methods to point counts (Nichols et al. 2000) provide an alternative to distance methods for population size estimation.\nI was quite disappointed by Chapter 6, on estimating species richness of birds, although this disappointment reflects more the limitations of existing studies than the descriptions in Bird Census Techniques. A variety of ad-hoc procedures exist for evaluating species richness of birds, but a well-developed statistical theory also exists for appropriate estimation of species richness using capture-recapture methods (e.g., Nichols and Conroy 1996, Bouliner et al. 1998 ). The only reference to these new procedures appears on p. 127, and even then it is combined with a discussion of empirical species-accumulation curves. Investigators interested in estimation of community attributes should look at the recent literature of this rapidly evolving field.\nThe chapter on capture and marking methods contains a simple introduction to capture-recapture, along with a discussion of catch-per-unit-effort methods. The authors only briefly mention the Otis et al. (1978) models, and detailed examples are limited to a simple Lincoln-Peterson estimate of population size and a Du Feu et al. (1983) model that is essentially a multiplesample extension of the Lincoln-Peterson, as first described by Craig (1953) . Capture-recapture estimation is a very flexible tool, with many developments that are relevant not only to studies of banded birds but also to estimation of species richness and detectability from counts of unmarked birds. A recent issue of the Journal of Agricultural, Biological, and Environmental Statistics (6[2] :2001) contains a series of papers on capture-recapture methods that would be of value to readers interested in designing a capture-recapture study, and extensive internet resources exist for analysis of capture-recapture and related studies (e.g., Program Mark, White 2001). Discussion of catch per unit effort in Bird Census Techniques is not about statistically based catch-effort models, but instead involves development of indexes based on population counts from constant-effort or standardized banding sites. I view these approaches as quite limited, as even adjusted count indexes to population size can be criticized. However, the authors do reference some statistical approaches to estimation of population size from these data. At the end of the chapter, there is a brief reference to radio-telemetry studies, but it is more a basic introduction to techniques than a description of their use in population estimation. Readers should consult White and Garrott (1990, Chapter 10) for details regarding use of radio-telemetry in population estimation.\nOne would think that ''Counting Individual Species'' (Chapter 8) would provide the most focused studies, as goals should be best defined and surveys tailored to life histories of these species. Surprisingly, this is only partially true, as the surveys described are primarily natural-history based rather than statistically based. While these surveys adequately focus on the timing, habitats, and responses best for counting, often they only provide counts of observable individuals rather than population estimates. In all of these studies, the key to an appropriate population estimate is to combine counts of observable individuals with appropriate statistical techniques to define an unbiased estimation procedure. The value of the presentations in Chapter 8 is not in providing models for other investigations to use, as it is unlikely that most of the surveys discussed could provide these unbiased estimates, but in defining the experimental situation on which future studies can be designed.\nChapter 9, ''Colonial Nesting, Flocking, and Migrating Birds,'' provides valuable information on the physical and biological constraints on sampling, as well as a review of methods presently used to sample the species. As in Chapter 8, it is often difficult to ascertain the value of the surveys, most of which rely on standardization to ensure consistent counts. Incorporating capture-recapture, double-observer or other detectability-estimation procedures would greatly enhance their value, and the authors indicate several examples of use of estimation in the context of the survey designs. More emphasis is due to some North American surveys, in particular the North American Waterfowl Breeding Ground Survey, which is perhaps the largest and best-designed wildlife survey in the world (Smith 1995) .\nThe chapter on distributional studies begins with a useful discussion of the development of a classical atlas study, with emphasis on UK atlases. Many atlas efforts tend to be conservative, relying on methods and goals of earlier projects. Here, the authors make progress toward defining modern conservation goals for atlases. Atlases could be much more effective if they incorporated estimation procedures for species richness and population size as part of their designs; otherwise, population size estimates from atlas data are often little more than a guess (with a few exceptions noted by the authors), and absence is confounded with nondetection of a species. The primary North American example the authors present is the Root (1988) summary of Christmas Bird Count data; it would have been useful for the authors to have included a separate section on mapping survey data rather than blending this example in with the discussion of standard atlases. This chapter contains a section on bird distribution associated with habitats that briefly covers some of the technical issues of estimation of habitat use relative to availability.\nThroughout the book, emphasis is placed on the need to consider habitat issues both for designing and interpreting bird surveys. In the final chapter, the authors discuss mapping local habitats as an adjunct to mapping bird counts; collection of habitat data in the field; and use of habitat data in bird-habitat association studies and in modeling regional-scale distribution. Generally, the primary value of this chapter is in describing an approach to local habitat modeling and site-specific description of habitats from local studies; the use of remotely sensed habitat data is only briefly mentioned. It would have been useful to have a discussion of the connection of field-collected habitat data with remotely sensed data. This is an important issue when using these bird-habitat models as predictors of bird distributions; unless predictors are based on remotely sensed information, it is difficult to extrapolate to relevant areas.\nBird Census Techniques represents an important advance in that it explodes some myths about the value of methods such as territory mapping, and advocates the use of detectability estimation in ways that should be accessible to ornithologists. However, the task the authors set for themselves is daunting; there are just too many methods to describe. A bewildering number of methods is presented, especially in the later chapters where the careful critiques given to primary methods described in earlier chapters are often lacking. Even so, some important surveys are omitted, reflecting perhaps the fast pace of survey development in the last years of the twentieth century. Statistical methods are also developing rapidly, and the authors by necessity provide only superficial descriptions of many relevant methods. Even though many references are provided, readers would be wise to extend their literature review to current literature and to the internet, which is an important resource for details on survey protocols and new statistical developments. The real strength of this book is the description of how bird sampling can be fit to the life histories and habitats of bird taxa. Bird Sampling Techniques, in conjunction with a more statistically oriented text such as Thompson et al. (1998) "}]