[{"section_title": "Abstract", "text": "We discuss contemporary theories in mathematics education in order to do research on research. Our strategy consists of analysing discursively and ideologically recent key publications addressing the role of theory in mathematics education research. We examine how the field fabricates its object of research by deploying Foucault's notion of bio-politics-mainly to address the object \"learning\"-and Žižek's ideology critique-to address the object \"mathematics\". These theories, which have already been used in the field to research teaching and learning, have a great potential to contribute to a reflexivity of research on its discourses and effects. Furthermore, they enable us to present a clear distinction between what has been called the sociopolitical turn in mathematics education research and what we call a positioning of mathematics education (research) practices in the Political."}, {"section_title": "", "text": "mathematics could no longer be seen as a subject for elites who managed to climb to the highest levels of education. Parallel to the emergence of the concept of Humanity-men (sic) as a coherent rational subject, his own source of meaning, knowledge and action, where civilisation was equated to scientific and technological progress-mathematics became a social need. The success of the civilised world depended on the inclusion of informed and participative masses. Thus, the teaching of school mathematics in Modern, massive educational systems became an important element in constituting the rational, cosmopolitan minds of twentieth-century citizens (Popkewitz, 2009b; Radford, 2011) .\nIn order to satisfy such societal demand, fields of research such as mathematics education emerged with the task of finding new ways of ensuring that the subject of mathematics in the curriculum reaches all students. In the last three decades, mathematics education research has been growing exponentially, with various highly specialised topics being examined in regional, national and international publications. One of these topics is the role of theory in mathematics education research (Sriraman & English, 2010a) . A considerable amount of synthesis studies have presented a \"state-of-the-art\" of the different conceptual frameworks deployed in the field (e.g. Cobb, 2007; Lester, 2010; Prediger, Arzarello, Bosch & Lenfant, 2008; Silver & Herbst, 2007; Sriraman & English, 2005 .\nWhen a field begins to raise questions not only about its primary object of study, but also about itself and its status as a science, this is usually called reflexivity (Bloor, 1976; Bourdieu, 2001) . Such has been the case for many social sciences that, at a certain point of their development, turn back upon themselves to investigate their own ways of working (e.g., Clifford, 1988) . The very first stage of reflexivity is that of research synthesis providing an overview of what the field knows about its research objects. Yet, a more interesting level concerns the effects of research in generating particular discourses, with its encompassing ideologies. We argue that the recent boom in studies around what is and what counts as theory-including this very same special issue-is an important exercise of reflexivity that contributes new understandings of the objects of discussion (e.g. Radford, 2008a) , descriptions of the several theories used (e.g. Cobb, 2007; Silver & Herbst, 2007) and consideration of the affordances when combining multiple theoretical approaches (e.g. Arzarello, Bosch, Gascón, & Sabena, 2008; Gellert, 2008; Sriraman & English, 2010a) . However, there are few studies exploring the effects of the area of academic enquiry (e.g. Duarte, 2009; Lundin, 2012; Martin, 2011) . Our contribution to this special issue considers the theoretical tools for a second level of reflexivity through the examination of mathematics education research, its discourses and effects.\nIn particular, we argue that any attempt to advance mathematics education as a field of scientific enquiry cannot be blind to the theses that it proposes about the objects of study and what such theses make possible-and impossible-to research. Such a type of reflexivity is a step towards the realisation of understanding mathematics education as practices-even the use of the adjectives \"social\", \"cultural\", \"political\", \"ideological\", etc. with the noun is redundant since the field of practice is all of these attributes at the same time and inseparably. The so-called \"social turn\" (Lerman, 2000) and \"political turn\" (Valero, 2004b; Gutiérrez, 2010) have provided awareness that the social, cultural and political \"dimensions\" of mathematics education are important to consider side by side with the mathematical, cognitive and psychological ones. In doing so, researchers have brought into mathematics education theoretical frameworks from anthropology, sociology, philosophy, linguistics, psychoanalysis, critical theory, and feminist and postcolonial studies. The fact remains, however, that, although these turns have started placing mathematics education in relation to social, cultural and political dynamics, the closure of the object of research to the learning of mathematics makes difficult a theorisation of the field as no other than the study of teaching and learning processes and contexts.\nIn order to make our case, we have done research on theory research. We systematically analysed key publications that in the recent years have discussed what is theory and what is its role. We deployed two sets of theoretical tools to make evident how mathematics education research has been primarily focused on developing optimal learning scenarios for mathematics, namely the focus on learning and the specificity of mathematics that distinguish it from other fields of educational research. Such discourse is analysed in reference to Foucault's (1997) concept of bio-politics. We also take advantage of Slavoj Žižek's (1989, 2006 ) ideology critique to show how \"mathematical learning\" has become the sublime object of the field's ideology and, as such, a stumbling block in the process of reflexivity. We conclude by suggesting a displacement in the way we conceive the importance of school mathematics. Such a displacement has important consequences for the way we perceive the object of mathematics education research."}, {"section_title": "The importance of researching research", "text": "Elsewhere we have studied the discourses of mathematics education research concerning \"power\" and the \"political\" (e.g. Pais, 2011 Pais, , 2012a Valero, 2008; Pais & Valero, 2011) . Researching research approaches it as an activity that generates particular systems of reason, (Foucault, 2002) cultural theses (Popkewitz, 2009a) and ideologies (Žižek, 1989) that format what is possible to think about practice. Mathematics education research is not an innocent activity producing a diagnosis of the state of mathematics education practices or proposing solutions to the problems of practitioners. Rather, it is an active participant in shaping, discursively, the possibilities of seeing and inventing practice (Valero, 2010) . Research produces languages and tools, which shape what we see and say about the very same world of mathematics education. As Brown (2008) argues, the theoretical and analytical lenses we deploy in our research \"comprise particular choices in terms of the analytic filters that we apply, governed by underlying ideological motivations and trends of which we are not always aware\" (p. 249). For us, a study of mathematics education practices as being Political has necessarily to cover research and its discourses, and the way in which such discourses contribute to the formation of particular subjectivities and ideologies in and through mathematics education.\nIn this article, we focus our analysis on what counts as theory in mathematics education research and take advantage of the considerable number of recent publications-comprising conference proceedings (PME33, ICME11, CERME), special journal editions (ZDM), book chapters (Cobb, 2007; Silver & Herbst, 2007) and books (Sriranam & English, 2010 )addressing this issue. Since any theory of learning is an analytical framework, which not only describes but also constitutes research objects (Lester, 2010, p. 70; Presmeg, 2010a, p. 98) , these studies offer an opportunity to map the theses that emerge in the field about what are the objects of its study and how researchers productively deal with them. For our purposes here, we have focused our analysis of the texts on the question: What is the object of mathematics education research as expressed, implicitly or explicitly, in these publications?\nNotwithstanding the plurality of approaches and the variety of discussions, we identify three common threads. First of all, there is general agreement that mathematics education research is about the learning-and as a correlated variable also teaching-of mathematics. This is nothing new. Since the first ICMI study of reflexivity in the field, participants clearly expressed this position: Mathematics education research is a discipline which studies \"the practice of mathematics teaching and learning at all levels in (and outside) the educational system in which it is embedded\" (Sierpinska & Kilpatrick, 1998, p. 29) . What we find interesting is the observation that this statement applies to studies adopting strictly psychological or mathematical frames, as well as many of the increasing number of studies within the social and political turn. For the latter, \"mathematics learning\" is pivotal. The difference is that there is recognition that such learning is influenced by other \"factors\" such as the social, political or cultural conditions of students, families or schooling that affect mathematical learning, as if those factors were separable aspects of learning and not the very same core of mathematics education practices.\nThe importance of considering theoretical frameworks other than those traditionally focused on psychology, cognition and affect is justified by the fact that learning of mathematics takes place in classrooms, and these are first of all social, cultural and political spaces (Presmeg, 2010a, p. 98) . Sriraman, Roscoe and English (2010) elaborate what they consider to be the cultural, social and political nature of mathematics. Why is school mathematics involved in the exclusion of particular groups of people considered to be disadvantaged? How can research to change this tragic reality be developed? They refer to the works of Eric Gutstein, Ole Skovsmose, Leone Burton, and Ubiratan D'Ambrosio among others to exemplify research on the cultural, social and political nature of mathematics education. However, they regret that some of these studies-such as the more philosophical writings of Skovsmose (e.g. 2009)-do not provide ideas for teaching (p. 625). In commenting the paper by Sriraman et al. (2010) , Yasukawa (2010) argues for the need to politicise mathematics education, and she raises important questions for research:\nWhat mathematics is really needed to be learned for people to become active citizens? What knowledge (including mathematical knowledge) and critical thinking skills are needed for students to interrogate the practices of qualculations [sic] that are defining principles of equity and fairness in particular ways, and not other ways? (p. 642, our emphasis)\nYasukawa's understanding of politicisation of mathematics revolves around learning, and the way to achieve the high goals of equity and fairness is regarded in terms of mathematical knowledge.\nA second thread in the texts we analysed is the explicit formulation of the purpose of mathematics education research: to improve the teaching and learning of (primarily) school mathematics (e.g. Lerman, 2010; Niss, 2007) . The reasons for improvement may vary, but among the most common are supporting and developing intelligence, spreading high morals, strengthening self-confidence, and consolidating democracy (Lundin, 2012) . However, it is largely assumed that mathematics education research is supposed to function as a crucial force in the everlasting battle of assuring \"mathematics for all\", 1 so that a better society can be possible (Bishop & Forgasz, 2007; Skovsmose & Valero, 2008) . Lundin (2012) has discussed the fallacy of this line of argumentation. What he calls the standard critique of mathematics education consists of describing the current state of affairs of school mathematics as suffering from a variety of malfunctions, and the role of mathematics education research to fix them. By analysing the way mathematics education research engages with \"word problems\", Lundin shows that research cannot solve these malfunctions and that, they are ultimately created by mathematics education research itself. This is because the common idea that mathematics is becoming more and more important for the future of society-and without such knowledge young adults are disadvantaged and vulnerable 2 -is not an objective reality, but concomitant to \"the formation of a perspective which makes the world appear in such a way as to make this competence relevant\" (p. 4). The importance of knowing mathematics in order to understand and master the world, far from being a given reality, is the result of the frenetic activity of all those who believe in it. Lundin calls it an engagement en masse in pretending that school mathematics can help students understand the world and can ultimately lead to a betterment of society.\nA third thread in the texts is that the specificity of mathematics is normally invoked by researchers to differentiate mathematics education from other fields of educational enquiry. In this field, \"[…] mathematics and its specificities are inherent in the research questions from the outset. One is looking at mathematics learning and one cannot ask these questions outside of mathematics\" (Sierpinska & Kilpatrick, 1998, p. 26) . From this perspective, the specificity of mathematics comes from the object \"mathematics\", its intrinsic characteristics as a science, and its value as knowledge of competence. However, if we follow the twist given by Lundin, the specificity of mathematics can also be understood in terms of the role it has played in educational systems, not as knowledge or competence, but as a means of governamentalisation (Foucault, 1991) . As a school subject, it has been doing this better than any other area of the school curriculum (Popkewitz, 2004) .\nIn pointing out these three threads, we are not expressing our dis/agreement with these assertions. We are problematising the effects of the discourses in mathematics education to the Political. We argue that the structuring of field around \"learning\" and mathematics inhibits a political conceptualisation of the field. In what follows, we address closely how, on the one hand, learning has been used to make school mathematics an efficient mechanism of biopolitics and, on the other hand, mathematics functions as the sublime object of the field's ideology, making it difficult for researchers to conceive of its importance in terms other than knowledge and competence. In both cases, mathematics education is defined not by its intrinsic characteristics, but by the crucial discursive and ideological role it plays within educational systems and society."}, {"section_title": "Theories of learning in mathematics education", "text": "In mathematics education research, the word \"theory\" is mostly taken to refer to \"learning theory\". This is particularly evident in the articles by Cobb (2007) and Silver and Herbst (2007) . For instance, Cobb identifies experimental psychology, cognitive psychology, sociocultural theory and distributed cognition as the most influential philosophies informing the field. He concludes by suggesting that researchers should do a bricolage of these different theoretical trends as long as they provide better designs for the task of improving the teaching and learning of mathematics. In comparison, Silver and Herbst (2007) argue for the necessity to move towards a grand theory that could help us organize the field, \"much in the same way as evolutionary theory has produced a complete reorganization of biological species\" (p. 60). They propose to view theory as a mediator between problems, practice and research. Mathematics education research is formulated as a science of treatment that, by understanding the symptoms of students' difficulties in mathematics, aims at designing and applying proper treatments, with the hope of curing defects in learning: \"The evolving understanding of the logic of errors has helped support the design of better instructional treatments, in much the same way that the evolving understanding of the logic of diseases has helped the design of better medical treatments\" (Silver & Herbst, 2007, p. 63) . Despite their differences in how to organise theory, Cobb and Silver and Herbst agree that theory(ies) allows the researcher to investigate the learning of mathematics. Sriraman and English (2005, 2010b) contest the claim that the field should move towards a unified theory-as suggested by many who dislike the proposal of bricolage and would like to make of mathematics education a \"normal science\" in the Kuhnian sense (e.g. Silver & Herbst, 2007) . They stress the difficulty of abstracting in one single meta-narrative the multiple and diverse practices of mathematics education. These practices are embedded in different social and cultural contexts that need to be taken into account, rather than blurred for the sake of theory edification. This perspective resonates with what is usually called postmodernism. Postmodern theorists turn up their noses at concepts such as \"universality\" or \"totality\" (Lyotard, 1984) . Instead, they emphasise the existence of multiple realities, each one with its own universality (Seidman, 1994) . This is particularly the case with research within what Gutiérrez (2010) has recently called the sociopolitical turn in mathematics education. She states, \"educators who take a socio-political perspective stance recognize that mathematics education is identity work\" (p. 17), and they engage in transforming it in ways that privilege more socially just practices towards marginalised students. This underlines equity and social justice, and the political role of mathematics education for researchers and practitioners. What is the role of theory in an approach that takes mathematics education as a cultural, social and political practice? Again, the answers vary. However, we notice the centrality of learning in the way theory is perceived. Notwithstanding the authors' awareness of the political nature of school mathematics, when thinking about mathematics education, researchers direct their efforts towards the amelioration of the process of teaching and learning mathematics, whether through identity work involving marginalised students (e.g. Gutiérrez, 2010) , engaging in mathematical task-building in relation to the political problems students experience (e.g. Gutstein, 2003) , exploring with students examples of \"mathematics in action\" in society (e.g. Skovsmose, 1994) or valorising different cultures in the classroom (D'Ambrosio, 1994) . Although much of this research takes advantage of theories than can hardly be considered theories of learning-for instance, Skovsmose draws on Critical Theory to develop a critique of the role mathematics plays in society-the solutions for the problems of practice are considered in terms of the practice alone.\nIn what follows, we focus mainly on the role of theory as seen by Cobb and Silver and Herbst. Moreover, we analyse research within the sociopolitical turn in Section 4."}, {"section_title": "Learning and bio-politics", "text": "According to Biesta (2005) , the tendency towards the learnification of education, that is, the reduction of the study of educational phenomena to the study of administrable, engineerable learning processes, contributes to erase political considerations from educational research. This is part of a larger societal trend that addresses fundamental social problems as if they are the object of expert management and administration (Agamben, 1998; Foucault, 1991 Foucault, , 1997 . Foucault (1991 Foucault ( , 1997 shows us that the government of life is achieved through two fundamental technologies that act upon the individual and the population. On the one hand, the technologies of the self refer to the processes of subjectification that force individuals to bind themselves to their own identity, defined by the degree of adherence to social norms. On the other hand, the political techniques or bio-power refer to the way the state assumes and integrates the care of natural life of individuals into its very centre.\nAs an example of the first, we can describe research in mathematics education as a technology of the self. Popkewitz (2004) evidences the mechanisms through which school mathematics constructs a set of learning standards that are closely related to the administration of children rather than to an agenda of mathematical knowledge. Mathematics pedagogy, based on psychology and social psychology, generates knowledge about children and how they can effectively appropriate the mathematical content to acquire competences, behaviours and attitudes (e.g. being participative, competent, having self-esteem). From this perspective, school mathematics serves the appropriation of behaviours and modes of thinking and acting that make each child governable. Mathematics education research provides the precise labels and techniques to effectuate the governmentalisation of children through school mathematics. The concern of researchers for improving mathematical learning is the fuel for the effective instalment of technologies of the self.\nAs an example of bio-power, we can mention the recent emphasis on measuring and evidence-based research that fully reduces human beings to numbers representing mathematical performances. The mass-scale comparative studies as, for example, the Trends in International Mathematics and Science Study (TIMSS) and the OECD Program for International Student Assessment (PISA) represent the most prominent manifestation of this phenomenon. These international, comparative, measurement studies are, to an increasing extent, brought into the political sphere placing pressure on national governments to regulate their educational systems according to the standards stipulated by the tests (Biesta, 2009; Wilson, 2007) . This is what has been happening in the last 8 years in many developed countries where education tends to be transformed, on account of politicians' demands for accountability, into an evidence-based profession. Consequently, political measures contribute to formatting teaching and learning of mathematics in a clear and crude way. Teachers tend to tailor their instructional practices to the format of the test, out of concern that, if they design their teaching differently, their students will fail. Although they might know all the didactical novelties and methods to promote learning in a meaningful way to students, they will \"educate\" their students in the ways the system considers to be legitimate (Lerman, 1998; Wilson, 2007) . Research supporting the construction of these systems and their implementation by teachers in classrooms are highly implicated in setting these mechanisms into operation.\nThe interplay between the two mechanisms of subjectification-techniques of subjective individualisation and procedures of objective totalisation-creates a twofold political strategy which Foucault (1997) calls bio-politics: the growing inclusion of human natural life (as opposed to political life) within the mechanisms and calculations of power. In this way, politics is made operational. Its purpose is no longer to be a place where alternative emancipatory ways of living together can be thinkable, but to engage in the global regulation for the sake of the species' biological reproduction. For Agamben (1998) , who built upon the work of Foucault, the only real question to be decided is which form of organisation would be the most suitable for the task of securing the care, control and use of bare life: human life stripped from its entire political dimension and reduced to its biological entity. Human bare life is that type of existence that can be measured, calculated and predicted. In other words, it is the object and result of technical expertise. Recognising this condition, Žižek (2006) argues that, today, we live in a post-political society: Politics has surrendered to specialised social administration, targeting the bare life of the individual by controlling its fluctuations according to global standards of normality.\nJust as politics is being replaced by administration, education has given up its place in favour of learning and specialised, subject-matter pedagogy and didactics. In the case of mathematics education research, the privileging of learning theories functions as a mechanism of bio-politics in constructing certain subjectivities and governing them, stripping them from their political condition. In the following, we illustrate how such a mechanism operates in one of the recent sociocultural theories on mathematics education."}, {"section_title": "Ideology and bio-politics in operation", "text": "The cultural theory of objectification (Radford, 2006a (Radford, , b, 2008b is arguably one of the most solid and well-documented theorisations about teaching and learning mathematics within a sociocultural framework. Taking advantage of Vygotsky's and Leontev's cultural, historical psychology and also Husserl's and Peirce's phenomenological epistemologies, the theory presents learning as the reaching of a culturally objective piece of knowledge that students acquire through a social process of objectification mediated by signs, language, artefacts, the body and social interaction as they engage in cultural forms of reflecting and acting. The notion of learning as being, a dialectical process where learning is both objectification (knowing) and subjectification (being or becoming), is a way of dealing with the traditional dichotomy of the individual and the object of knowledge. Learning is more than constructing logicomathematical, mental structures or picking up ready-made knowledge. It is also an ethical and political activity where the subject is constantly renewed and constructed in the meeting with culture: \"The meanings circulating in the classroom cannot be confined to the interactive dimension that takes place in the class itself; rather they have to be conceptualized according to the context of the historical-cultural dimension\" (Radford, 2006b, pp. 21-22) .\nThe theory claims addressing the historical and cultural constitution of mathematics education practices, within which the meanings of being a student and a teacher are produced-that is, the social identifications they are subjected to. However, the tools of the theory are systematically brought in operation in analyses of classroom materials, where the emphasis on learning situations of particular mathematical notions leaves unattended the analysis of the ways in which the \"historical-cultural context\" constantly permeates the situations. History and culture are condensed in the history of the culture-bounded mathematical object being objectified, in the mediation of cultural artefacts in thinking, and in the teacher's awareness of such constitution to guide the student's mathematical explorations. As Radford (2006a) asserts, \"cultural conceptual objects are like lighthouses that orient navigators' sailing boats\" (p. 58). Once defined by the mathematical community and by the curriculum, the culturally and socially constructed mathematical object is what \"pulls the interaction up in a certain direction-more precisely in the direction of the cultural conceptual object\" (p. 58). In different papers, the analysis of dialogues between teachers and students-on the concept of rate of change and derivatives (2006a), movement and graphics (2006b), or equations (2011)-converges towards a notion of \"culture\" confined to the mathematical object around which revolves the teacher and students' collective spaces of activity (Radford & Roth, 2011) . Teaching consists of generating and developing activities \"heading toward a fixed pattern of reflexive activity incrusted in the culture\" (Radford, 2006b, p. 14) . This fixed pattern should be \"in accordance with curricular standards\" (p. 21).\nWhile the theory succeeds in building a strong ontological and epistemological foundation for the learning of mathematics (e.g., Radford, 2008b) , its attempt to argue for its political rooting is less convincing. The emphasis on mathematical objectification and subjectification makes the research gaze to ignore all the \"non-mathematical\" complexities that both teachers and learners experience in their everyday practice (Brown, 2008; Stentoft & Valero, 2010; Valero, 2004a) . Thus, the subjectification proposed by the theory is that of students becoming through the meeting with objects of culture recognized as mathematical in the closed space of mathematics classrooms. The political is assumed by the theory to be epitomised in the mediated nature of mathematics and learning-teaching relationships established in classroom situations. From a Foucaultian point of view, it can be argued that this type of subjectification is a technology of the self, set in operation by expert teachers and researchers, with the effect of providing an effective governmentalisation of the learners into a reduced form of identity as a mathematics learner that has to converge towards the social norms of a mathematical culture. In the double act of binding the individual to his/her such a reduced identity and of locating the individual in a community (Radford, 2008b, p. 227-229) set up for his/her redemption (Popkewitz, 2008) , research done from this theoretical standpoint contributes to reproducing \"forms of being in mathematics (and, as a consequence, of knowing mathematics) in the strictest sense of the term\" (Radford, 2008b, p. 229) . In other words, the reduction of human beings to their condition as mathematics thinkersteachers or learners-that constructivist theories had already effectuated (Valero, 2004b ) is left untouched.\nThe theory and the analyses captured our attention because Radford claims to draw on Marxism (Presmeg & Radford, 2008) . In our view, the construction of a Marxist-inspired theory of learning without the full recognition of the political economy that Marx put forward ends up amputated (Jameson, 1991; Žižek, 1995) . By disavowing the fundamental economic dimension of Marxism, the cultural theory of objectification may produce a case of what Žižek (1995, p. 9) calls \"progressive amnesia\": Marxism is recovered but deprived of its most fundamental core. Thus, the theory falls short of bringing an understanding of mathematics education practices within the Political, even if that is its original intention. Furthermore, by presenting a discourse that appeals to a political dimension, the theory may easily be guided towards an effective reduction of the political life of subjects to their acquisition of mathematics."}, {"section_title": "The specificity of mathematics", "text": "In the review of Sriraman and English (2010a) , Fried (2011) raises the question of the specificity of mathematics within what he calls \"the new socio-political mathematics education\" (p. 8). In his reading, the centring of mathematics education around the issues of equity and social justice turns these themes into the content of the field while, at the same time, and paradoxically, posits mathematics as a privileged space for social change:\nAs a theory of mathematics education, this new socio-political mathematics education, therefore, says (a) that mathematics is not at the heart of mathematics education and must be subordinated to more general social issues, or, at the other extreme; (b) that mathematics has a privileged position in dealing with global social problems such as poverty and gender inequality (Fried, 2011, pp. 90-91) .\nThere are two important aspects here that are relevant to a discussion of the specificity of mathematics. Firstly, mathematics education, as an educational practice, is immersed in the political arena of schooling. Although it seems clear that learning mathematics is different from, for instance, learning geography, there are important common educational problems that outweigh the specific problems of any school subject. If the community recognises that, when dealing with the process of teaching and learning mathematics in schools, there are social and political \"aspects\" that influence it, how does research address such dimensions? Finding answers to this question has led mathematics educators to the social and political turns (Gutiérrez, 2010; Lerman, 2000) . It is difficult to maintain that we can analyse certain problems involved in the learning of mathematics only within the domain of psychology and mathematics. Even researchers who fiercely defend the centrality of mathematics in the definition of mathematics education end up asserting that, with regard to teaching and learning mathematics, \"[a]ll that is needed is time, patience, desire and empathy\" (Eisenberg & Fried, 2009, p. 146) . None of these conditions have anything to do with mathematics. Time is obviously an economical and political variable, which many teachers complain is never enough, and patience, desire and empathy are psychological or psychoanalytical attributes.\nWhen problems appear that cannot be explained within the theoretical straitjacket of mathematical learning, they tend to be, as noted by Gates and Zevenbergen (2009, p. 162) , discarded since it is not the responsibility of mathematics education to address such political issues. This can be the case even within studies in the social turn. For example, Abreu, Bishop and Presmeg (2002, p. 4 ) state that changing school mathematics practices \"depends of course on changing the formal educational structures that determine and shape the particular mathematics education practice experienced by the students in their schools\". However, they promptly add that such a task \"is beyond the scope of this book\". Although many researchers acknowledge the social and political aspects involved in reforming mathematics education, they end up investigating problems as if they could be solved through better classroom practices.\nIndeed, the accepted aim of mathematics education research as provider of solutions for the betterment of teaching and learning practices (Cobb, 2007; Niss, 2007; Silver & Herbst, 2007; Sriraman & English, 2010b) sharply contrasts with the fact that, despite the amount of research produced in the last three decades, we are far from achieving equitable mathematics education of a high quality for all (Atweh, Graven, Secada, & Valero, 2010) . Some authors would even argue that the situation has worsened in the last two decades (Baldino & Cabral, 2006; Gates & Vistro-Yu, 2003) . In the face of this fact, some researchers have pointed to the discrepancy between the increasing sophistication of research and persistent failure in school mathematics worldwide (e.g. Eisenberg & Fried, 2009; Lesh & Sriraman, 2005) . For example, such a problem is commonly viewed in terms of the gap between research and practice. This is particularly evident in the way the role of theory is defined. Whether theory is considered as a mediator between practice and research (Silver & Herbst, 2007) , as informing designs for the classroom (Cobb, 2007) or as a mean of political awareness , the assumption is that theory should result in some kind of \"insight for action\" for the betterment of the work of teachers and students: \"It remains one of our many challenges to clearly demonstrate how theoretical considerations can enhance the teaching and learning of mathematics in the classroom and beyond\" (Sriraman & English, 2010b, p. 11) .\nIn this respect, the problem is displaced from research itself and posited on the way governments, schools and teachers fail to \"acquire\" and implement the knowledge originating from academia. In research, everything goes well; we know the best methods, theories and strategies. The problems of implementation rest in the school settings. It is then that researchers argue that we are dealing with a truly political problem, and mathematics education, as a field of scientific enquiry, can do little within the spectrum of the broader social order. Even though the problem of providing \"mathematics for all\" is far from being strictly didactical-as generally acknowledged (e.g. Abreu et al., 2002) -the research is carried out as if it actually was. We argue that the field, by the way it disavows the Political (Pais & Valero, 2011) and perceives itself as a reformist force, is in fact generating the problem. This is in tune with the standard critique (Lundin, 2012) previously mentioned and also with the research developed by Klette (2004) , who argues that the lack of change in mathematics education reforms is not just a problem of \"application\" but also an embedded part of research itself. She argues that the \"denial of change\" (p. 3) is being constructed from the beginning, in the theoretical, methodological and conceptual ways in which research is done.\nHow is this discussion related to the specificity of mathematics? We need now to consider the second aspect involved in the quotation from Fried (2011) above. While a sociopolitical theory apparently discredits mathematics, it actually increases its importance by regarding it as a privileged science, which can resolve problems that, in their very nature, are political and economical. Mathematics is flagged as the \"thing\" that allows not just the proper qualification for certain professions, or some kind of personal joy (Boaler, 2009) but also to solve the problems of social justice, oppression, poverty, sexism or racism. Mathematics-or the lack of it-is posited as the object which seems to be missing in a world full of inequalities (Lundin, 2011) . This was particularly evident during the 1960s, with the Sputnik Shock. The United States reacted by positioning mathematics and its education as crucial knowledge for surpassing the Soviet Union in scientific, technological and economical terms (Kilpatrick, 1997) . Even today, mathematics and science are the school subjects that will secure a winning position in the global market (e.g. OECD, 2006) .\nŽižek (1989) calls these objects sublime objects of ideology. And Lundin (2011) takes them into consideration when he asserts that:\nEven though the term mathematics refers to an enormously rich variety of ideas, methods, algorithms, techniques and, if you like, institutions and practices, it does not contain the answer to these problems [poverty, segregation, lack of democracy, economical growth, etc.]. I claim that the very idea of mathematics as commonly conceived should be understood as a symptom of the society which believes in it. It helps us make sense of the puzzle, but simultaneously makes serious rearrangement of the pieces seem unnecessary (and impossible or even absurd). (p. 11)\nAs suggested by Lundin (2012) , apropos the use-value of mathematics-in optimising the mundane activities of people-while its utility may not be very important in eradicating racism, sexism, economical inequality and the like, the very attempt to make it important contributes in a fundamental way to the formation of a reality in which we imagine such importance to take place. As such, mathematics education is politicised by means of a de-politicisation of issues of equity, social justice, economy and, ultimately, politics itself.\nWe contend, therefore, that the \"specificity of mathematics\" has been functioning as the fantasy-scenario (Žižek, 2006) , disabling the community from a true comprehension of the role mathematics education plays within the Political. This is the basic definition of Lacan-Žižek's notion of ideology 3 : a totality set on effacing the traces of its own impossibility, by means of displacing the internal and all-pervasive contradiction of society-where inequality, exclusion and injustice prevail-with an external and contingent series of events that could be approached by mathematics education. Positing mathematics as a \"weapon in the struggle\" for a better world (Gutstein, 2012) reinforces even more the \"faith\" (Lundin, 2012) in the idea that better mathematics is the solution for problems that by their very nature are economical and political. Instead of positing itself in the picture as part of the problem, research ends up creating ideological injunctions whose purpose is precisely to disavow such reflexivity. In short, in the well-intentioned action of achieving a better world through mathematics education, sociopolitical research fails to acknowledge, in the corrupted reality in which they lament, the ultimate consequence of their own act. To paraphrase Lundin (2012) , the very idea of a simultaneous formation of competence to read and change the world using mathematics and a perspective which shapes the world in a way that makes this competence relevant, is peculiar to and characteristic of mathematics education research. As a result, we are left at a threshold: If the purpose is the high ideals of democracy, social justice and equality, \"the route via mathematical thinking, in which we currently invest so much, is a dead end\" (p. 11). We are compelled to find other ways to move forward."}, {"section_title": "Final remarks", "text": "It now becomes clear why we have been referring to the Political with a capital P. We do so in order to distinguish what has been in fact a \"politicisation\" of a series of domains previously considered \"apolitical\" by sociopolitical research in mathematics education, from a Political conceptualisation of mathematics education itself. While the former is centred on the issue of change conceived in terms of what Seidman (1994) calls \"politics of difference\", 4 and concerned with changing identities (Gutiérrez, 2010) , the latter opens the possibility of calling into question the very structuring theses of discourse orienting research practice. Thus, we completely support Sriraman and English's contention that a sociopolitical approach \"forces one to re-examine the fundamental nature and purpose of mathematics education in relation with society\" (2010b, pp. 25-26). However, we emphasise how the very notion and form of the political within which a sociopolitical perspective operates is grounded in the depoliticisation of research.\nWe sought to show the deadlock produced by the theses that research discourses fabricate about the object of research, maintained by the learnification and the mathematical specificity dominant in theory. Such situation inhibits a conceptualisation of mathematics education within the Political. Indeed, other researchers have been using similar theoretical frameworks to the ones we use here. Tony Brown, Margaret Walshaw, Tânia Cabral, Candia Morgan and Roberto Baldino, among others, have, for some years, been dealing with Foucault, Lacan and Žižek in their investigations. They have provided different and challenging readings of the teaching and learning of mathematics, and regretfully, their work goes generally unaddressed in the studies on theory we analysed. But contemporary theory-particularly that stemming from the works of Foucault and Žižek-makes possible for us to posit also mathematics education research itself as an object of study. Such is, in our view, the potential of the research carried out in this article. That is, research that, by teasing out the assumptions and discourses generated in other studies, allows us to \"estrange\" ourselves from the self-evidence of mathematics education as an established field of scientific enquiry. It is our contention that such an approach, although not directly aimed at providing some kind of insight for action, can help us redefine the coordinates we use to make sense of the problems of the field."}]