[{"section_title": "Abstract", "text": "The purpose of this research was to examine pre-service science teachers' academic motivation and academic self-efficacy toward biology. The sample consisted of 369 pre-service science teachers who enrolled in the faculty of education of two universities in Turkey. Data were collected through Academic Motivation Scale (AMS) (Glynn & Koballa, 2006 ) and Academic Self-efficacy Scale (ASES) (Woo, 1999) . The findings revealed that pre-service science teachers' academic self-efficacy and academic motivation toward biology are high. Additionally, combination of the independent variables was significantly related to the academic self-efficacy scores, while it was not significantly related to the academic motivation. More specifically, it was found that only university variable made a statistically significant contribution to the prediction of pre-service science teachers' academic motivation and academic self-efficacy. There were strong, positive correlations between pre-service science teachers' academic motivation and academic self-efficacy and subdimensions of AMS and ASES except 'test anxiety'. The relationship of test anxiety with all of the subdimensions was small."}, {"section_title": "Introduction", "text": "According to the Trends in International Mathematics and Science Study (TIMSS) results, Turkish students' performances have been low for years and it hasn't changed in terms of grade level. In the distribution of science achievement in TIMSS 2011, Turkish students' average points are significantly lower than the center point of the TIMSS 4th and 8th grade (Martin, Mullis, Foy & Stanco, 2011) .\nWithin the scope of science lesson at TIMSS, three separate courses consisting of physics, chemistry and biology were given. The current study is focused on biology course mainly. The achievement of the biology course is lower than the center point of the TIMSS as well (Martin, Mullis, Foy & Stanco, 2012) . The failure arises from some important and remarkable factors. According to researchers, factors that are influential on students' achievement in science are attitude toward science, education policy makers, instructional processes, students' self-efficacy and students' family background information (Gonzalez & Miles, 2001; Özdemir, 2003; Uzun, Gelbal & Öğretmen, 2010) . Besides, in several international researches, it is stated that teacher training and experience and teachers' job satisfaction are associated with student learning and achievement (Abazaoglu, 2014; Greenwald, Hedges & Laine, 1996; Nye, Konstantopoulos & Hedges, 2004; Rivkin, Hanushek & Kain, 2005) . Pajares (2002) suggested that training pre-service teachers, who are the elementary science teachers of the future, is important to obtain basic information, skills and competency to overcome occupational inability for individuals (Ekici, Fettahlıoğlu & Sert-Çıbık, 2012) .The more they view themselves as qualified, the more likely their student's biology success will be high.\nIn order to overcome occupational or personal inability, pre-service science teachers' motivation and self-efficacy toward biology should be high. Bandura (1986) defines self-efficacy as \"People's judgments of their capabilities to organize and execute courses of action required to attain designated types of performances\". So as to stress underlying reason for the academic failure, academic self-efficacy should be understood clearly. Academic self-efficacy is related to students' confidence of academic task capabilities (Zajacove, Lynch, & Espenshade, 2005) .\nAcademic self-efficacy toward biology is defined as \"person's judgements and beliefs related to themselves about learning the field of biology successfully\" (Ekici, Fettahlıoğlu, & Sert-Çıbık, 2012) .\nIn addition to self-efficacy, one more important concept used in education is motivation. Pintrich and Schunk (2002) define motivation as \"process whereby goal-directed activity is instigated and sustained.\" Actions, beliefs, interests, perceptions and values are within motivation (Lai, 2011) . These concepts are also related to academic motivation that instigate and sustain students. Academic motivation is defined by Gottfried (1990) as \"enjoyment of school learning characterized by a mastery orientation; curiosity; persistence; task-endogeny; and the learning of challenging, difficult, and novel tasks\" (p. 525). Motivation has prime importance to attract students' attention, encourage learning actively and enable them to be creative, productive individuals and constructive, (Uyulgan & Akkuzu, 2014) .\nResearchers stated that there is a positive correlation between self-efficacy and motivation. For example, Chowdhury and Shahabuddin (2007) pointed out that self-efficacy seems to be associated with motivation. Similarly, Schunk (1990) stated that self-efficacy strengthens the learner's motivation. Since students' views about their own capabilities are an important source of motivation, if students view themselves as capable in terms of learning, they will cope with learning disabilities to accomplish their goals (Wang, Wu, & Huang, 2007) . When self-efficacy perceptions increase, individuals' skills and capabilities improve (Pintrich & Schunk, 2002) and this also increases individuals' motivation. Self-efficacy is activated to improve motivation, in cases where feedback is given towards the achievement of learning goals (Bandura, 1982) . There are various ways that self-efficacy perceptions contribute to motivation; including for example: determining individuals' goals; how much they spread on effort; how long they struggle against difficulties; and putting up resistance to failures (Bandura, 1994) .\nAlthough studies related to motivation and self-efficacy are of considerable interest to researchers (e.g, Aluçdibi & Ekici, 2012; Ekici et al., 2012; Güvercin, Tekkaya, & Sungur, 2010; Hevedanlı & Ekici, 2009; Mavrikaki, Koumparou, Kyriakoudi, Papacharalampous, & Trimandili, 2012; Özatlı, 2006; Özkan, 2003) , it appears that no study has been conducted on this topic relating to biology. Consideration of the level of motivation and self-efficacy is important because it could help students achieve better outcomes in biology (Aluçdibi & Ekici, 2012) . Motivation and self-efficacy of individuals are directly proportional to their success in biology (Bandura, 1997; Pajares, 1997; Schunk, 1982,) . In other words, students with high self-efficacy and motivation toward biology have more success in academic activities such as active participation in class, asking questions, and taking note of the recommendations provided by the instructor (Pajares, 1996; Schunk & Pajares, 2001; Wolters & Rosenthal, 2000) . Furthermore, if students are not well motivated and have low self-efficacy, they fail biology (Arwood, 2004; Cavallo, Rozman, Blinkenstaff & Walker, 2003; Druger, 1998; Glynn, Taasoobshirazi & Brickman, 2009 ).\nThe current research study could be helpful for both in-service and pre-service training and improvement of science and biology teachers vocational qualifications. Moreover, pre-service teachers' performance and efforts in the future can be estimated and revision of the education programs can be provided with this study (Yılmaz, 2012) . The findings of this study may also explain some of the reasons why students fail biology in international exams such as TIMSS and PISA and help to find ways to overcome this failure.\nThe Council of Higher Education, which is responsible for the supervision of universities, determines science education curriculum that is same for almost all universities in Turkey. The science education curriculum includes physics, chemistry and biology. The courses related to biology start to be taught in the second year of the university in this curriculum. Table 1 shows the compulsory courses and their contents which are taught in both universities. Definition, areas, and importance of genetics and biotechnology, their effects on life, and a brief overview to its historical development; birth of modern genetics; cytoplasmic inheritance; natural selection, adaptation, mutations; molecular biology; gene technology; human genetics and genetic diseases; opportunities for science and technology provided by genetic engineering; fundamental principles of biotechnology, and biotechnological applications."}, {"section_title": "Environmental Science", "text": "The concept of the environment, people and environment, population and environment; regional and local environmental problems; biodiversity and biodiversity in Turkey; environmental institutions and their activities; environmental education, and sustainable development."}, {"section_title": "Earth Science", "text": "Definition and subject of geology; general information about earth; properties of the basic ingredients that compose earth's crust; tectonic plate movements; and stratigraphy.\n3 Evolution Definition of evolution, its supporting evidences; Darwin's Theory of Evolution and New Synthesis Theory; inorganic evolution; evolution of animals and plants; human evolution; exemplification of these topics from daily life and its association to the science curriculum."}, {"section_title": "Specific Issues in Biology", "text": "Genetically modified foods (GMOs); stem cell technology; organ transplantation and importance of organ donation; importance of biology in terms of sociology and technology; development processes of drugs and cosmetic products, and their effects on nature; use of microorganisms in removing environmentally hazardous substances; prepared foodstuffs and their preparation processes and hazards; chemicals and their biological effects; organisms in our immediate environment and their effects on health; biological sensors; DNA replication; nanotechnology usage in biology; bioinformatics.\nIn addition to pre-service science teacher training courses about biology given in Table 1 , there are some courses which include pedagogical contents in the science education curriculum in Turkey. Because, according to Magnusson, Krajcik, and Borko (1999) PCK model, individuals who will be teacher must have some competencies consisting of subject matter knowledge (SMK), pedagogical knowledge (PK) and knowledge of context (KofC) After the acquisition of specific teaching skills, pre-service teachers undergo training at elementary schools in their final year at the university. In the current study, when the sample was selected, it was believed that individuals who understand the importance of undergraduate courses will provide the best data. Hence, this study was conducted with sophomores, juniors and seniors."}, {"section_title": "Purpose and Research Questions", "text": "The aim of this study was to investigate pre-service science teachers' academic motivation and academic self-efficacy toward biology. Three research questions guided the study:\n1. What are pre-service science teachers' academic motivation and academic self-efficacy toward biology?\n2. How well do gender, grade, age and university predict pre-service science teachers' academic motivation and academic self-efficacy toward biology?\n3. Is there a relationship between pre-service science teachers' academic motivation and academic self-efficacy, and among their subdimensions?"}, {"section_title": "Method", "text": ""}, {"section_title": "Research Design", "text": "Survey research design was used to achieve the purposes of this study. In a survey research, researcher is generally interested in how and how much of the responses vary -their variability, how closely some responses are related to others and how responses differ within specific demographic variables or with measures of social, political or psychological variables (Krathwohl, 1998) . Using the data obtained through survey, correlational and causal comparative analyses were carried out to address the research questions of the present study."}, {"section_title": "Sample", "text": "The sample consisted of 369 pre-service science teachers who enrolled in the faculty of education of two universities in Turkey. These two universities were selected because they are convenient for the researchers. The study was conducted on 97 males (26 %) and 272 females (74 %) whose mean age was 21.62 (range: 18-26). The three groups comprised 94 sophomores, 195 juniors and 80 seniors."}, {"section_title": "Instruments", "text": "The participants were asked to answer a questionnaire including demographic questions regarding pre-service science teachers' grade, age, gender and university, Academic Motivation Scale (AMS) (Glynn & Koballa, 2006) and Academic Self-efficacy Scale (ASES) (Woo, 1999) respectively.\nWhile AMS consists of 30 items each one has 5 responses and available responses for these items are from \"Never\" to \"Always\", ASES consists of 40 items having 5 responses and available responses for items are from \"Scarcely\" to \"Very often\" (Table 2 ). Before adapting scales to pre-service science teachers, these scales were suitable for high school students. Since scales were revised and adapted, validity and reliability of the study were needed to be measured. In order to determine the reliability and validity of the scales, a pilot study was conducted. The alpha reliabilities of AMS and ASES were found as .85 and .96 respectively, which means the reliabilities of these scales are high (Kalaycı, 2006) . AMS and ASES were adapted into Turkish by Ekici (2009a) and Ekici (2009b) respectively, for her study which was conducted in Turkey. However, the items and available responses are given here in English.\nThe 30 items of the Academic Motivation Scale (AMS) and 40 items of Academic Self-efficacy Scale (ASES) were subjected to principal components analysis. Before principal components analysis was performed, the suitability of data was assessed for factor analysis as recommended by Pallant (2005) . The Kaiser-Meyer-Oklin values of AMS and ASES were .73 and .88 respectively, thus falling above the recommended value of .60 (Kaiser, 1974) and the Barlett's Test of Sphericity (Bartlett, 1954) After performing principal components analysis, ASES consists of three subdimensions which are namely 'Biology Experiment', 'Comprehension and Understanding' and 'Problem Solving'. The format of the scale was designed to investigate pre-service science teachers' academic self-efficacy toward biology."}, {"section_title": "Data Collection", "text": "The data were collected within a month in spring semester of 2013-2014 academic year. Before starting to collect data, the necessary permissions to conduct the research and the ethical permission from Ethical Committee were obtained from the two universities. Before the administration of the questionnaires, all participants were given and signed a consent form confirming that they volunteered to participate this study. All the questionnaires were administered by the same researcher to be sure about consistency of procedure of data collection. Each questionnaire took around 20 minutes to complete. The questionnaires were answered in the same lesson."}, {"section_title": "Data analysis", "text": "In this section, three kinds of statistical analysis were used. Firstly, descriptive statistics and then in order to examine how well gender, grade, age and university predict pre-service science teachers' academic motivation and academic self-efficacy, multiple linear regression analyses were conducted. Finally, preliminary analysis technique consisting of Pearson product-moment correlation was used to explore relationships among variables.\nPrior to the multiple regression analysis which was conducted for two independent variables separately, some assumptions which consist of homoscedasticity, independence of residuals, linearity, multicollinearity, normality and outliers were checked. Since tolerance values for each variable are not less than .1 and VIF values are smaller than 10, there was no violation of the multicollinearity assumption. Tabachnick and Fidell (2013) define outliers as those with standardised residual values above 3.3 or less than -3.3 in the scatter plot. Another way to find outliers is to control residuals statistics table and Mahalanobis part. Since critical values are greater than 18.47 for four independent variables and maximum values for Cook's Distance are smaller than 1, there is no violation for the outlier assumption. Residuals are roughly rectangularly distributed with most of the scores concentrated in the center along the 0 point. Therefore, there is no curvilinearity. Hence, homoscedasticity and linearity assumptions are satisfied. Since Durbin Watson values are between 1.5 and 2.5, independence of residuals assumption is satisfied. Additionally, related pairs, homoscedasticity, linearity and outliers assumptions were checked for Pearson product-moment correlation. Assumptions of this analysis were satisfied as well. Table 3 lists descriptive statistics for the subdimensions of AMS. In this study, for both scales, the mean scores higher than 3 are accepted as higher mean scores whereas the mean scores lower than 3 are accepted as lower mean scores. The highest and lowest mean scores were yielded by 'intrinsic motivation' subdimension (M = 4.80) and 'test anxiety' subdimension (M = 2.87). Table 4 lists the mean scores, standard deviations and percentages of respondents along the subdimensions of AMS. There are six items that had a mean score above 4.0. Over 81% of pre-service science teachers agreed that they enjoyed learning biology. 79% of participants thought understanding biology gives them a sense of accomplishment. More than 80% of respondents stated that they put enough effort into learning biology and earning a good biology grade was important for them. 77.5% agreed with the item 'I like to do better than the other pre-service science teachers on the biology tests'. Distribution of participants' answers toward test anxiety is normal. Therefore, interpretation of this subdimension is hard. In a rather different dimension, more than half of participants (64 %) have self-confidence toward biology course, biology experiments and biology tests and believe biology is relevant to their life and personal goals. More than half of the pre-service science teachers (63 %) considered that biology could help their carrier and getting a good job (49 %). Table 5 lists descriptive statistics for the subdimensions of ASES. The highest and lowest mean scores were yielded by 'biology experiment' (M = 3.78) and 'problem solving' subdimensions respectively (M = 3.69). "}, {"section_title": "Results", "text": ""}, {"section_title": "Students' Academic Motivation and Academic Self-Efficacy toward Biology", "text": ""}, {"section_title": ".2 Prediction of independent variables on academic motivation", "text": "A multiple regression analysis was conducted toinvestigatehow well gender, grade, age and university predict pre-service science teachers' academic motivation toward biology. The combination of the predictor variables was not significantly related to the academic motivation scores [F(4,256)=1.90, p>.0005] . The sample multiple correlation coefficient was .029, indicating that approximately 2.9% of the variance of the academic motivation scores can be accounted for by the combination of gender, grade, age and university. These values are presented in Table 7 . "}, {"section_title": "Prediction of independent variables on academic self-efficacy", "text": "In order to understandhow well gender, grade, age and university predict pre-service science teachers' academic self-efficacy toward biology, multiple regression analysis was conducted. The combination of the predictor variables was not significantly related to the academic self-efficacy scores [F(4.274)=2.66, p<.0005] . The sample multiple correlation coefficient was .037, indicating that approximately 3.7% of the variance of the academic self-efficacy scores can be accounted for by the combination of gender, grade, age and university. These values are presented in Table 8 . More specifically, as it seen in Table 9 , it was found that university variable made a statistically significant contribution to the prediction of pre-service science teachers' academic self-efficacy and academic motivation (p<0.05), while other variables didn't make any contribution (p>0.05). "}, {"section_title": "Relationship between Subdimensions of Academic Motivation", "text": "In order to measure relationships between subdimensions of academic motivation toward biology, Pearson's correlation coefficients were generated. Table 10 shows intercorrelation coefficients among all subdimensions.\nResults indicated that the correlation between 'intrinsic motivation' and 'self-confidence' was the strongest (r = .68) and the correlation between 'relevance learning biology' and 'test anxiety' was the lowest (r = -.01). "}, {"section_title": "Relationship between Subdimensions of Academic Self-efficacy", "text": "Pearson's correlation coefficients were conducted in order to measure relationships between subdimensions of academic self-efficacy toward biology. Intercorrelation coefficients among subdimensions were showed in Table 11 . Results indicated that the correlation between 'comprehension and understanding' and 'biology experiment' was the strongest (r = .84). Besides that, there is a very strong positive relationship between 'comprehension and understanding' and 'problem solving' and between 'problem solving' and 'biology experiment'. "}, {"section_title": "Relationship between Academic Motivation and Academic Self-Efficacy", "text": "Pearson's correlation coefficients were generated to measure relationships between subdimensions of academic motivation and self-efficacy toward biology. Table 12 shows intercorrelation coefficients among subdimensions of academic motivation and subdimensions of academic self-efficacy. According to the results, while the correlation between 'test anxiety' and 'problem solving' was found as the lowest (r = .08), the correlation between 'self-confidence' and 'comprehension and understanding' was the strongest (r = .68). Note. *Correlation is significant at the .05 level (2-tailed).\n**Correlation is significant at the .01 level (2-tailed).\nThere are strong positive relationships between 'intrinsic motivation' and all three subdimensions of self-efficacy. In addition, there are strong positive relationships between 'relevance learning biology' and these three subdimensions. 'Responsibility in learning biology' is also strongly positively correlated with the three subdimensions. Lastly, 'self-confidence' is strongly positively correlated with all three subdimensions of academic self-efficacy."}, {"section_title": "Discussion", "text": "The aim of this study was to examine pre-service science teachers' academic motivation and academic self-efficacy toward biology.\nRegarding the first research question, the results of the study showed that pre-service science teachers' academic self-efficacy and academic motivation toward biology are high.\nFirst, the highest and lowest mean scores on AMS were yielded by 'intrinsic motivation' and 'test anxiety' respectively. Similarly, in the study of Ekici (2009a) , high school students had the lowest mean score on \"test anxiety. It was also found that participants had lower mean scores on \"extrinsic motivation\". Supporting data suggested that as test anxiety increases, individuals' extrinsic motivation also increases in the direction of self-assertion (Karagüven, 2012) . Additionally, Aluçdibi and Ekici (2012) stated that classroom management profile of biology instructors is a significant predictor of the students' level of test anxiety in biology exam. For example, if the biology instructor is careless and s/he leaves the students on their own devices, it would be reasonable that the students would have high levels of test anxiety. Hence, the instructors of biology courses may have an influence on pre-service science teachers' test anxiety levels.\nAlmost 80% of the respondents enjoy learning biology and thought that understanding biology gives them a sense of accomplishment. They stated that they put enough effort into learning biology and earning a good biology grade is important for them. 64 % have self-confidence toward biology course, biology experiments and biology tests, and believe biology is relevant to their daily life and goals such as carrier choices and getting a good job. It is well-known that earning high grades and having a good job are one of the most important issues among university students, and it makes these findings rational.\nSecond, the highest and lowest mean scores on ASES were yielded by 'biology experiment' and 'problem solving' subdimensions respectively. Similarly, in Ekici's (2009b) study, high school students had lowest mean score on \"problem solving\" dimension. However, in her study it was found that the students had highest mean score on \"comprehension and understanding\". The reason for this difference between her study and our study may be university education includes many experiments while most high schools do not, and students generally enjoy doing experiments rather than solving problems. did not make any contribution. Additionally, one of the universities is in better condition than another university at both academic motivation and academic self-efficacy. If we examine the reasons thoroughly, first, the students of the two universities got almost the same points on the university entrance exam. Second, names and contents of the courses in these two universities are same. Third, physical structures of two universities like laboratory and classroom layouts are similar. This suggests that the difference between two universities may be due to the external effects like instructor in that some instructors rely on routines to make students feel safe, but some of these routines may cause boredom and tiredness. Pintrich and Schunk (2002) suggested that whether students are motivated to learn or not, and whether they are in need of control and coercion to do their school-works have an influence on their motivation and self-efficacy. This is also related to Tosti-Vasey and Willis (1991) and Bailey' (1999) point of views. According to Bailey (1999) , current academic staff tended to spend more time on reading and research. In turn, these efforts increase students' academic motivation and self-efficacy.\nRegarding the last research question, for the subdimensions of AMS, the results indicated that the correlation between 'intrinsic motivation' and 'self-confidence' was the strongest. Similarly, as a finding of another study, a cyclical relationship was found between self-confidence and intrinsic motivation (Capel & Gervis, 2009 ). In addition to that, there are many studies which state that intrinsic motivation affects students' academic achievement through the influence of learning strategies and self-confidence (e.g., Pae, 2008; Walker, Greene, & Mansell, 2006; Wang, Peng, Huang, Hou, & Wang, 2008) . Thus, this finding is reasonable.\nThe results also indicated that the correlation between 'relevance learning biology' and 'test anxiety' was the lowest. This correlation was also low in the study of Ekici (2009a) In fact, it is well-known that if an individual is interested in learning biology, s/he would have a positive attitude and accordingly s/he will enjoy the course and probably will not have a high level of test anxiety.\nRegarding the subdimensions of ASES, the results indicated that the correlation between 'comprehension and understanding' and 'biology experiment' was the strongest. There are some other studies that supports our findings. For example, it was suggested that laboratory works are usually used to develop students' comprehension and understanding of science (Garnet, Garnet & Hackling, 1995) and supply a suitable environment to develop scientific process skills and problem solving abilities (Hofstein & Mamlok-Naaman, 2007) . Mıhladız, Duran, Işık, and Özdemir (2011) stated that science teachers' self-efficacy beliefs in science teaching and their science laboratory competencies are positively correlated. In fact, the courses like 'General Biology' and 'General Biology Laboratory' are complementary, so that it is reasonable to find a strong relationship between these two subdimensions. For example, if a student is good at comprehension and understanding of a biological concept, s/he would probably be also good at its practice in the laboratory. In Bouffard-Bouchard, Parent, and Larivee's (1991) study, results revealed that students with higher self-efficacy for successful problem solving display greater performance monitoring and persist longer than do students with lower self-efficacy.\nThere is a strong positive relationship between 'intrinsic motivation' and all three subdimensions of self-efficacy. In their study, Aluçdibi and Ekici (2012) also found a strong positive relationship between biology course motivation and intrinsic motivation, interest for learning biology, and responsibility for learning biology. Self-efficacy has an important role in science education and it is one of the most important components of motivation. Students can be motivated from internal and external sources and intrinsic motivation refers to be driven by internal rewards. The proposed relationships between self-efficacy and intrinsic motivation have been investigated in the literature for a long time (e.g., Bandura, 1982; Sungur, 2007; Tabernero & Hernández, 2011) . Tabernero and Hernández (2011) also suggested that the level of self-efficacy determine the intrinsic motivation. Because there is not any similar study about the two factors 'relevance learning biology' and 'responsibility in learning biology', we cannot make a comparison. However, reasonably, it can be said that students who have high levels of self-efficacy toward biology will be eager to learn biology and take responsibility in biology.\nThere are strong positive relationships between ''self-confidence' and self-efficacy. Self-efficacy is a situation specific self-confidence (Bandura, 1986) , a belief that one is competent to handle the task at hand. The levels of self-confidence affect the levels of self-efficacy. The opposite direction is also true. Learners with high self-efficacy are more confident and have higher learning objectives ).\nIn conclusion, in this study it was found that pre-service science teachers' academic motivation and academic self-efficacy are closely related and there is a need to investigate this relationship in a more detailed way both in the literature and through research. For example, qualitative research should be conducted to learn why students have low academic motivation and self-efficacy, and develop academic motivation and self-efficacy of students or pre-service teachers. Additionally, biology teachers or instructors have great and important tasks to increase students' motivation and self-efficacy as they teach their courses."}]