[{"section_title": "", "text": "neural network consists of an input layer, hidden layers, and an output layer. The images to classify constitute the input layer. The hidden layers identify features in those images. Based on those features, the output layer classifies those images. The hidden layers consist of a series of convolutional layers and pooling layers. A convolutional layer consists of neurons that connect to a grid of neurons in the previous layer. Convolution extracts the features of the grid of neurons in the previous layer. Pooling extracts representative features from the convolutional layer. Through repeated convolution and pooling, information can be compressed and the features needed to classify images can be identified. To classify the images, training a convolutional neural network is necessary. Each layer of neural networks has parameters that decide outputs of neural networks. By following training step, the parameters are set to the values that neural networks can classify the images. The procedures of training neural networks are as follows. The first step is the collection of training data that is the correct pairs of input and output. The second step is optimization of the parameters to reduce the error between the correct output and the neural networks' output calculated from the pair input. The third step is the iteration of the second step in order to determine the parameters that reduce the loss for the entire training data. The neural networks can output the same value as the training data using the parameters determined in the third step. Nevertheless, the neural networks could not output correct values that has features not existing in the training data. Therefore, it is preferable to use as much data as possible for training data and use various possible forms of the actual input data."}, {"section_title": "Applications involving pathology images", "text": "Whether cancer cells are metastatic is an important factor in determining treatment. One proposal is to use a convolutional neural network to detect metastasis in pathology images (6) . This method was used to analyze a set of pathology images from patients with breast cancer (the Camelyon16 dataset (7)), and it had a diagnostic accuracy of 92.4%, which is much higher than the accuracy of pathologists (73.2%). With the neural networks, the program can rapidly detect metastasis in large numbers of images. Methods of classifying breast cancer using a neural network trained with pathology images have been proposed (8) (9) (10) (11) (12) (13) (14) ."}, {"section_title": "Applications involving magnetic resonance imaging (MRI), positron emission tomography (PET), and computed tomography (CT) images", "text": "The accurate diagnosis of Alzheimer's disease (AD) and its early stage is essential to its timely treatment and possible delay. A method of identifying AD from MRI and PET images using a neural network has been proposed (15) . This method extracts features from MRI and PET images of the brain and it detects AD based on features from those two types of images. This is accomplished using multimodal stacked deep polynomial networks to identify the features of AD (16) . Multimodal stacked deep polynomial networks were used to analyze multimodal neuroimaging data from patients with AD (ADNI dataset (17) ) and that approach identified AD with an accuracy of 97.13%, which was higher than the accuracy of other multimodal learning methods. Methods of classifying brain conditions and cancers using a neural network trained with MRI, PET, and CT images have also been proposed (18-25)."}, {"section_title": "Applications involving X-rays Images", "text": "Like the method of diagnosing disease based on MRI and PET images described in Section 2.2, a method of diagnosing disease based on X-rays images has been proposed (26) . This method diagnoses disease based both the accuracy and speed of diagnosis. In addition, images could be obtained and used to train a neural network with no involvement of a specialist. Medical images could be obtained at a hospital that lacks a specialist and transferred remotely to a specialist for diagnosis. Physicians can only diagnose a limited number of patients, but automated diagnosis using a neural network can diagnose a large number of patients all over the world. These advantages are why neural networks will be increasingly applied to fields with a shortage of specialists."}, {"section_title": "Applications of neural networks trained with data from medical records", "text": "This section describes what neural network can predict with data from medical records (45) (46) (47) (48) (49) (50) (51) (52) . Prediction using a recurrent neural network is shown in Figure. 2. The main purpose of the use of neural network is to aid a physician. Predicting a medical event allows a physician to know where to focus his or her attention. Based on the prediction of a patient's next visit, the physician can instruct the patient to come to the hospital earlier so that symptoms will not worsen. A normal neural network cannot be applied to time-series problems because it uses only current data. A recurrent neural network can be applied to sequential data. The output of each hidden layer is generated based on its previous output and its current input. Thus, current output includes both the previous output and current input. This allows a recurrent neural network to forecast a time series over a long period of time."}, {"section_title": "Prediction of medical events based on electronic health records (EHRs)", "text": "A method of predicting medical events (symptom information, medication information, timing of visits, etc.) based on past electronic medical records has been proposed (53) . This method uses a recurrent neural on chest X-rays using a convolutional neural network. This approach was better at detecting pneumonia than practicing radiologists. In addition, this method identified 14 types of diseases in a chest X-ray dataset (Chest X-ray 14 (27) ) at a higher rate than other methods. Methods of classifying chest conditions and dental caries using a neural network trained with X-rays have also been proposed (28-34)."}, {"section_title": "Applications involving endoscopy images", "text": "A method of detecting gastrointestinal disease in endoscopy videos has been proposed (35) . This method can classify multiple types of gastrointestinal diseases using a convolutional neural network. This method had an accuracy of 96.9% at distinguishing six classes of images (blurry images, images of the cecum, images of the normal colon, images of polyps, images of a tumor, and images showing the Z-line). This method can be used to provide physicians with endoscopic images of the gastrointestinal tract in real time. Methods of identifying angiodysplasia and other conditions using a neural network trained with endoscopy images have also been proposed (36-37)."}, {"section_title": "Applications involving images of the skin", "text": "Neural networks have been trained with images from diagnostic equipment, and they have also been trained with images of the skin. A method of classifying skin lesions based on images of the skin has been proposed (38) . This method uses a dataset of 12,945 images of the skin including 2,032 diseases to train a convolution neural network. This method separated lesions into three classes (benign lesions, malignant lesions, and non-neoplastic lesions) with an accuracy of 72.1 ± 0.9% (mean ± standard deviation), which is higher than the accuracy of two dermatologists (65.56 and 66.0%). In addition, dedicated equipment is not needed to obtain images of the skin, so this method could be used on a mobile device such as a smartphone. Methods of classifying melanoma and other skin lesions using a neural network trained with images of the skin have also been proposed (39-44)."}, {"section_title": "Summary of Section 2", "text": "Each of the methods described involves a neural network trained using various medical images to replace diagnosis by a physician. This is because diagnosis is often based on imaging and because a convolution neural network facilitates image analysis. The applications described in Sections 2.1 to 2.5 suggest that a convolution neural network can diagnose disease more accurately than a physician. Thus, diagnosis based on imaging is likely to be performed entirely by neural networks in the future. Neural networks improve network, which is effective at analyzing sequential data. A recurrent neural network that was trained with 8 years of electronic medical records from 260,000 patients and 2,128 physicians predicts future medical events. This method performed 79.58% recall using 85% of that data as training and 15% as the test."}, {"section_title": "Predicting medications in use based on EHRs", "text": "Estimates are that 50% of the medicines being taken by patients are not listed in electronic medical records (54) . Therefore, a method of predicting medicines being taken by patients has been proposed (55) . This method uses a recurrent neural network trained with electronic medical records, and it is highly accurate. In multilabel classification of medicines, micro-averaged area under the curve of this method is 0.926."}, {"section_title": "Summary of Section 3", "text": "Applications involving a neural network trained with data from medical records aid physicians rather than replacing them. The application described in Section 3.1 provides information needed for patient care and the application described in Section 3.2 augments the information given to a physician. This is because a neural network generates a rule based on a large volume of input data. These data are mainly EHRs. Developing a system that uses a neural network to aid a physician is difficult. Data are needed to train the neural network, and those data must contain information that the network can use to generate rules. Moreover, generating a rule may not always be possible. Furthermore, there may not be sufficient data with which to train the neural network. A diagnosis is made based on a physician's knowledge and imaging, so a neural network can generate a diagnostic rule. A neural network is effective at making predictions based on existing information with a certain level of accuracy. When a neural network is used to make a prediction without such information, knowing whether data are insufficient or whether generation of a rule is not possible is difficult. Thus, neural networks can aid physicians. Physicians are human beings, and they can make mistakes and they have limitations. A neural network can be used to alleviate or compensate for those flaws."}, {"section_title": "Application of neural networks to medicine in the future", "text": "The applications in Sections 2 and 3 can be categorized into two types: automated diagnosis and physician aids. Currently, 45% of WHO member countries have less than 1 physician per 1,000 population (56) . Considering the current shortage of physicians, automated diagnostic systems using neural networks are needed more than physician aids.\nAutomated diagnosis could be used in several areas of medicine in the future. Developing an automated diagnostic system for each disease and examination would prove costly, so automated diagnostic systems are most needed in fields where physicians are in short supply. Given the number of patients per specialist, the top three fields in which those systems can be applied are vascular and interventional radiology, interventional cardiology, and neuroradiology (57) .\nVascular and interventional radiology is a medical sub-specialty of radiology utilizing minimally-invasive image-guided procedures to diagnose and treat diseases in nearly every organ system. Imaging is guided by X-rays, ultrasonography, or CT. In interventional cardiology, the heart is depicted on X-rays via catheterization so that a procedure can be performed. Fluoroscopy is often used to depict the heart. Neuroradiology is a subspecialty of radiology focusing on the diagnosis and characterization of abnormalities of the central and peripheral nervous system, spine, head, and neck using neuroimaging techniques. Imaging modalities include MRI, CT, and ultrasonography.\nIn the three specialties above, a diagnosis is made and treatment is provided using MRI, CT, X-rays, and ultrasonography. Automated diagnosis using a neural network would be useful in these fields. Diseases encountered in the three specialties above relate to the vascular system, heart, brain, spinal column, head, neck, and tumors/cancer. Hence, neural networks will be applied to a wider range of diseases related to the vascular system, heart, brain, spinal column, head, neck, and tumors/cancer in the future."}, {"section_title": "Conclusion", "text": "Medical applications of the neural networks mentioned in Section 2 -3 are shown in Table 1 . Applications of neural networks can mainly be classified into two types. Neural networks like those in Sections 2.1 to 2.5 take the place of a physician to identify or detect disease. Neural networks like those in Sections 3.1 to 3.2 assist a physician in providing care.\nA diagnosis based on imaging is likely to be highly accurate because the images have features that a neural network can extract. Diagnosis using a neural network seems to be the main way in which neural networks will be applied to medicine in the future. Considering the number of patients per physician, neural networks could be used to diagnose diseases related to the vascular system, heart, brain, spinal column, head, neck, and tumors/cancer in three fields: vascular and interventional radiology, interventional cardiology, and neuroradiology. This would not only decrease the workload for physicians but it would also increase diagnostic accuracy and lead to the early detection of disease. "}]