[{"section_title": "Abstract", "text": "International students represent a large percentage of the student population in science, technology, engineering, and mathematics (STEM) "}, {"section_title": "", "text": "To pursue studies at a higher education institution in the United States, all international students are required to obtain a visa for temporary stay from the U.S. embassy in their country and maintain a legal status during their studies. There were 974,926 international students (students who were not U.S. citizens or permanent residents) enrolled at U.S. colleges and universities in the academic year /2015 (Institute of International Education, 2015 . Today, a significant proportion of international students in the U.S. enroll in science and engineering (S&E) programs (NSB, 2016) . In the post-9/11 era, between 2008 and 2014, enrollment grew at the undergraduate level by 48% (76,780 to 149,090) and at the graduate level by 27% (152,230 to 209,020) . S&E fields are identified with the highest potential of improving individuals' employability, productivity, and earnings, in a competitive global labor market (Freeman, 2010) . As a result, the well-resourced network of U.S. research universities remains a prime destination for international students (Douglas & Edelstein, 2009 ). An area of discussion among governments and employers is how to best facilitate the graduates' retention in the U.S. labor market after completing their studies.\nA major reason to retain them is that international graduates in S&E fields are a potential supply of human capital for the U.S. economy. Findings based on a recent survey of the Earned Doctorates (NSB, 2016) indicated their willingness to pursue employment in the U.S. For example, temporary visa holders (e.g., student status known as an F-1 or a J-1 visa), the majority of whom were international graduates of U.S. universities, accounted for 52% of academic post-doctorate positions. The Survey of Doctorate Recipients also showed that the average international graduate has a stay-rate of over 5 years in the U.S. workforce (NSB, 2016) . Another key indicator was growth in the number of high-skill immigrants who were obtaining working visas (Kerr & Lincoln, 2014; Shih, 2016) . Working visas (also known as H-1B visas) for foreign-born high-skill workers are issued for up to 3 years with possibility of an extension to 6 years (Science and Engineering Indicators, 2016) . In 2014, the United States Citizen and Immigration Services Department issued 161,400 H-1B visas (work permit visas), an increase of 27% since 2010 (U.S. Department of State, 2016) .There is little empirical evidence, however, about the employment experiences of international graduates in the U.S. labor market.\nPrevious work has focused mainly on high-skilled immigrants (not specific to S&E) who came to the U.S. primarily for employment opportunities (Hunt & Gauthier-Loiselle, 2010; Kerr & Lincoln, 2010) . In general, high-skilled immigrants are ranked as the most cited scholars and patent holders, leaders in technological firm start-ups, and recipients of Nobel prizes in STEM fields (Hunt, 2011; Peri, Shih, & Sparber, 2015; Stephan & Lewin, 2001) .\nAlthough there is a net 'brain gain' associated with this recruitment of foreign-born workers, research suggests that the presence of internationals negatively affects the employment outcomes of American citizens. Card's (2005) analysis of the 2000 Census data showed no significant difference in earnings between American citizens and immigrants in locations with high immigrant populations. However, Borjas (2003) posited that Card's analytical approach overlooked economic factors which influence the migration of American workers to other cities. To overcome this limitation, he compared groups in relatively fixed locations by skill/education level from the 1960-1990 U.S. Decennial Censuses and the 1998-2001 Current Population Surveys. The findings were not clear on whether the internationals negatively affected the employment outcomes of American-borns, as both the American citizens and immigrant populations were highly substitutable in the labor market, based on education and work experience as reflected in their earnings. Also, Borjas and colleagues expanded their first study by including data from the 1960 National Census, and incorporated self-employed workers as a part of the labor supply, but excluded their wages as it represented non-labor inputs (Borjas, Grogger, & Hanson, 2011) . The results further confirmed that American citizens and immigrants with similar skills are perfect substitutes, with no clear differences in earnings when there is a high labor demand.\nResearch specific to the S&E labor market has also focused on the broad population of high-skilled immigrants, again not specific to international graduates of U.S. institutions. The same concerns were whether S&E high-skilled immigrants are taking jobs that would have been otherwise taken by American-born citizens, or whether their additions to the supply of labor will cause a decrease in overall wages. These issues have been researched by Bound and colleagues in two separate studies. In the first paper, Bound, Braga, Golden, and Turner (2013) considered the impact on the labor market for computer scientists and electrical engineers in two periods of increased demand for professionals in these fields: during the 1970s (personal computer boom) and the 1990s (internet boom). The main difference was that while there was an increase in educational attainment within the domestic labor market in both periods, there was a substantial inflow of computer scientists and electrical engineers from other countries during the 1990s. The study acknowledged the difficulty in measuring the extent to which immigrants were taking jobs that would have been otherwise occupied by U.S. citizens. However, there was evidence of the growth of overall wages during the 1990s despite the inflow of immigrants to the U.S. labor market.\nIn a second study, Bound and colleagues further examined the wage effects from the inflow of high-skill immigrants on American computer scientists. They compared two scenarios, the labor market including American citizens and the smaller immigrant population before the internet technology boom in the 1990s with a larger labor supply, including American citizens but with the addition of the increase in labor flow of immigrants (Bound, Braga, Golden, & Khanna, 2015) . In their research, they found that in the short run the increase in the number of American-born college graduates combined with the growth among high-skilled immigrants had a negative effect on wages. However, over time, the increased production of new technology products further spurred the demand for workers in new support areas. Overall, it seems that during times of economic booms, there were greater demands for immigrant workers in particular fields; however, the effect of high-skill immigration on the wages of American-born workers is not clearly fully explained.\nA limitation of the previous studies consists in the way immigrant workers were classified. Immigrants were mainly defined as those who were born abroad, and were either a non-citizen (permanent residents or visa holding workers) or a naturalized citizen (U.S. citizenship granted to a foreign national). There is an important difference between these groups, as immigrants who became naturalized citizens likely spent more time in the U.S. and had different access to educational and work opportunities. This current study overcomes this limitation by clearly identifying the international student population (i.e., likely foreign-born on student visa F-1) and excluding those on post-graduation training. Focusing only on graduates of U.S. colleges improves the comparability of the two groups (foreign-born and U.S.-born workers) by assuming all have similar education level (though it is likely that some international students may have previous college education from their countries of origin). We also narrow our population to S&E degree recipients, which represent the largest group of international graduates from U.S. universities (NSB, 2016) .\nTherefore, this study adds to the high-skill immigrant literature by comparing the employment and earnings of international graduates (foreignborn) and American-born graduates of U.S. universities in S&E fields. The analysis utilizes data on the education and employment history of U.S. college graduates, taken from the 2013 Scientists and Engineers Statistical Data System (SESTAT; National Science Foundation, 2016). The focus of the study is on those who entered the labor market in 2004-2006, 2007-2009, and 2010-2013 . These three periods correspond to before, during, and after the recent U.S. economic recession (National Bureau of Economic Research, 2010; U.S. Bureau of Labor Statistics, 2012), thus controlling for differences in the economic environments experienced by the S&E graduates when they first entered the U.S. labor market."}, {"section_title": "THEORETICAL BACKGROUND", "text": "Human capital theory puts forth that individuals with higher levels of education are at an advantage in the labor market. This is a widely used theoretical framework to explain employment outcomes of college educated workers over time (Becker, 2005; Hayek, Thomas, Novicevic, & Montalvo, 2016; Schultz, 1961) , and is applicable to the context of this study to compare the earnings and sector of employment of international students with American-born graduates. Education credentials signal innate and acquired skills that contribute to one's employability and ultimate economic productivity (Becker, 1993; Crook, Todd, Combs, Woehr, & Ketchen, 2011) . In today's knowledge-driven economy, employers hire innovative workers that contribute to the profitability of companies (Altonji & Blank, 1999; Bowles & Gintis, 2011; Browne & Misra, 2003) . A major source of human capital has been the inflow of international students who completed their studies at U.S. universities with the hope of entering the U.S. labor market. It is important to recognize that these individuals may have varied levels of formal schooling and professional experience from their home country which expand and diversify their human capital. This suggests that international graduates of U.S. universities may attain varied employment outcomes based on the demand for their expertise and the recognition of their economic value by American employers.\nThis current study seeks to control for the variability in human capital characteristics generated by possible differences between the domestic and foreign human capital, by focusing only on individuals who graduated from U.S. universities: American-born and international graduates. From a pure human capital perspective, all things equal, upon completion of their studies both groups of graduates with similar academic credentials should have comparable employment outcomes when entering job market in periods of similar economic growth."}, {"section_title": "RESEARCH METHOD", "text": "The purpose of the study was to examine the employment status and earnings of foreign-born S&E graduates of U.S. universities who first came to the U.S. on temporary visas (known as F-1 and J-1 visas) for study or training, by comparing their labor market outcomes in 2013 to Americanborn (U.S. citizens) graduates. The study also differentiated the foreign-born graduates by their 2013 visa status (i.e., temporary residency versus permanent residency or citizenship). Since the time when graduates enter the labor market affects their outcomes, we considered three cohorts of graduates (2004-2006, 2007-2009, 2010-2013) , who were about 9, 6, and 3 years out of college. The study addressed the following research questions:\n1. What are the differences in human capital (i.e., degree level, college field of study) and labor market characteristics (i.e., period when entering the labor market, employment status, employment sector, salary) by citizenship/visa status?\n2. What are the effects of citizenship/visa status, human capital factors (i.e., degree level, college field of study) and labor market characteristics (i.e., period when entering the labor market, current employment sector) on the earnings of college graduates in 2013?"}, {"section_title": "Data", "text": "The study employs data from the 2013 SESTAT available for public use (NSF, 1999) . This integrated data system is based on a series of surveys that collected information on the education and employment of collegeeducated U.S. graduates in S&E fields. SESTAT combines data from three surveys: the National Survey of College Graduates (NSCG), the National Survey of Recent College Graduates (NSRCG), and the Survey of Doctorate Recipients (SDR). As a result, the target population consists of all individuals who are holders of a university degree in science, engineering, health-related, or S&E related fields (all defined as generally S&E by the NSF). The sampling design included a weighting methodology that accounts for varied sampling probabilities, non-responses, varied characteristics of underrepresented populations, and unknown eligibility (full description of sampling/survey methodology is available on the NSF website). The 2013 SESTAT dataset consists of 104,599 respondents that represent over 55 million college graduates."}, {"section_title": "Research Sample", "text": "First, we included in the sample all respondents who obtained their highest degree in the U.S., which represented over 92% of the SESTAT sample. We considered the highest, and not the most recent degree, as an indicator of human capital possessed by the individual (actually, the highest degree is also the most recent degree for over 99.9% of respondents).\nSecond, we focused our study on recent graduates from three periods: Cohort 1 (2004 Cohort 2 (2007 Cohort 2 ( -2009 ; Cohort 3 (2010 Cohort 3 ( -2013 , which represented about 42% of the SESTAT sample. The times of highest degree completion were chosen to capture the integration of college graduates in the labor market during periods of different economic growth. The literature on high-skill immigration pointed to changes in the employment outcomes of both American citizens and immigrants during different economic periods (Bound et al., 2015) . Therefore, we expected to find that employment and earnings of international college graduates were affected by the time they entered the U.S. labor market. According to the National Bureau of Economic Research, the most recent recession in the U.S. began in December 2007 and ended in June 2009. In 2007, the unemployment rate was 5.0%, which was somewhat stable for the previous 30 months. The unemployment rate peaked at 10.8% in October 2009 and had decreased since then towards pre-recession rates (NBER, 2010; U.S. Bureau of Labor Statistics, 2012). Our rationale was that Cohorts 1 and 3 graduated during periods of growing employment rates while Cohort 2 entered the labor market during the 2008 recession period.\nThird, we selected only S&E graduates for this study, those who completed the highest degree in four areas: Computer and Mathematical Sciences; Biological, Agricultural, and Environmental Life Sciences; Physical and related sciences; Engineering. These graduates represented about 40% of the entire SESTAT sample.\nFinally, we limited our analysis to comparing American-born graduates and two groups of foreign-born graduates who came to the U.S. with the primary intent to pursue study or training (i.e., best proxy for international students). The foreign-born graduates were differentiated by their 2013 citizenship/visa status: (a) had now a permanent residency status (or were already U.S. citizens); or (b) were still on temporary visas in 2013. Graduates excluded from the analysis were foreign-born who never had a temporary visa (e.g., first came to the U.S. on a permanent visa) and consequently were either naturalized U.S. citizens or permanent residents in 2013. Other foreign-born graduates excluded from the analysis were temporary residents who came as dependents and for temporary work, or through other temporary visa arrangements. We noted that international students who came to the United Statea with the primary intent to pursue study or training, and were subsequently employed (or in search of employment) by U.S. firms after completing their studies, represented about two-thirds of all foreign-born graduates who came to the United States on temporary visas. Applying these four selection criteria, we obtained a research sample of N = 14,400 of whom about 12% were foreign-born (weighed sample)."}, {"section_title": "Variables", "text": "Citizenship or visa status is the main design variable of this study; the main inquiry of the study is whether temporary residents experience more barriers to employment and career advancement than their Americanborn counterparts with similar credentials. Among the foreign-born graduates who came to the United States on a temporary visa with the primary intent to pursue study or training (that we will interchangeably call international graduates), we differentiate two groups-those who were able to secure already a more permanent status (and became legally permanent residents or citizens), and those who were still on a temporary visa. The three groups enable a clear differentiation of the effect of citizenship/visa status progress through immigration stages on the labor market outcomes of high-skilled S&E workers in the United States.\nA second design variable is contextual in nature and indicates the period when respondents completed their highest degree in the United States and likely entered the labor force. We anticipate that entering the labor market during the economic recession could be more challenging for foreign-born U.S. educated S&E workers, which could affect their employment and earning situation.\nThe study focuses on two sets of variables (i.e., education and work related) that all describe college graduates' human capital. First, educational credentials (degree level and field of study) inform on graduate employability in a labor market that experiences periods of growth and stagnation (Kim, Wolf-Wendel, & Twombly, 2011) . Second, even if overall the U.S. economy is in need of S&E workers, different employment sectors may have different demands for this high-skilled S&E workforce. In this study, the labor market outcomes of college graduates are indicated by their employment status, sector of employment, and annual salary.\nWe acknowledge that other factors such as gender, marital status, nationality, age, etc. have an effect on wages and hiring practices particularly in S&E jobs. However, we limit the focus of this study on the effects of citizenship/visa status and the period entering labor market.\nStatistical techniques used in the study consist of bivariate analysis (chi-square tests and ANOVA) and linear regression analysis. We compute normalized weights based on the survey weights (WTSURVY) available in the data, which preserve the sample size but reproduce the proportions in the population."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Comparison Between S&E American-Born and Foreign-Born Workers", "text": "Although age is not an accurate proxy of employment or educational history and is not included in the analysis, this demographic characteristic is relevant to understanding the sample. The average age of graduates in the sample was 31.3 years old in 2013, and varied from 36.5 years for the foreign-born graduates who had already obtained permanent residency or citizenship status (FBP), to 31.1 years for the American-born (AB), and 30.2 years for the foreign-born still on temporary visas (FBT). Although all foreign-born graduates in the sample entered the U.S. initially on temporary visas with the primary intent to study, it is likely that those who already obtained permanent residency may have had more work experience from their country of origin or elsewhere. The fact that foreignborn graduates on temporary visas belong to a younger age group may suggest they have not acquired formal higher education and/or work experience before pursuing their studies at U.S. universities.\nThe scope of this section is to compare the three citizenship/visa groups with respect to education and employment characteristics by using bivariate analysis. In Table 1 , we present the column percentages of AB, FBP and FBT groups across the corresponding categories of each categorical variable. For comparison, we also show the marginal percentages for all graduates. The last column shows whether there is a significant association between the citizenship/visa status variable and each of the education and employment variables. First, if we consider when did respondents obtain their highest degree and likely entered the labor market, we notice that roughly one-third of the entire sample graduated in each of the three periods considered in this study, with more graduates (36%) from the latest period. However, there is a clear disparity between the two foreign-born groups in terms of graduation period. First, if we consider when did respondents obtain their highest degree and likely entered the labor market, we notice that roughly one-third of the entire sample graduated in each of the three periods considered in this study, with more graduates (36%) from the latest period. However, there is a clear disparity between the two foreign-born groups in terms of graduation period. Among the older FBP group, 51% were 9 years out of college, and only 17% were 3 years out of college. Among the younger FBT group, only 16% were 9 years out of college, and 57% were 3 years out of college. This suggests that the two foreign-born graduate groups, who are on average 6 years apart in terms of age, are not only at different stages in terms of progression through the immigration/residency process, but also at different stages in terms of entering the labor market. The FBP group is at an advantage; the foreign-born college graduates who have secured a permanent residency status, have all the employment rights of Americanborn graduates, so they can change employers and compete for any job, even if they may have obtained their legal permanent residency through their first employer. Meanwhile, the FBT graduates who have been only on temporary visa continue to depend on the benevolence of the current employer and have limited labor force mobility.\nLevel of college education differentiates the American-born and foreign-born graduates, with only 6% of the American-born earning a master's or Ph.D. as compared to 40% among the FBP and 22% among the FBT groups. Clearly, the foreign-born college graduates from 2004-2013 obtained higher levels of education, which is likely to reflect on their labor market outcomes. It is also possible that more foreign-born graduates with advanced degrees had a chance to maintain temporary visa status after graduation through employment, and then change to permanent residency.\nThere were also differences in field of study among foreign-born and American-born college graduates. Foreign-born graduates were likely to obtain degrees in engineering and computer sciences. More than half of the younger foreign-born graduates on temporary visas obtained degrees in engineering, which may represent a more recent trend in attracting engineering international students. The proportions of degrees in biological sciences were also competitive and very different among the three groups: 33% of the American-born, 25% of the FBP and 13% of the FBT respondents obtained degrees in these fields. Interest in physical sciences was low (7-8%) among all groups. Overall, both degree level and field of study may give an advantage in the labor market to foreign-born S&E workers who are likely to have advanced degrees in applied fields such as engineering and computer sciences.\nResults indicated that foreign-born college graduates were slightly more likely to be employed than the American-born graduates: Only 88% of the American-born in the sample were employed in 2013 as compared to 92% and 93% for FBP and FBT, respectively. Among those who were employed, most found jobs in business/industry sector that employs about 70% of the FBP, 69% of the American-born and 64% of the FBT groups. Not surprising, those who were still on temporary visa found employment in educational institutions (35%) rather than government (2%), as compared to the American-born graduates who were the most likely to be employed by government (12%). Meanwhile, educational institutions employ about onefifth of the American-born and FBP S&E college graduates. When comparing the employment sectors for the two foreign-born groups of S&E workers, the FBP group was less likely to be employed by an educational institution as compared to government or business. Since the two foreignborn groups were in two different (sequential) stages of the immigration process, it appears that educational institutions could be the first employer to support the path toward permanent residency for the high-skilled workers on temporary visas. However, educational institutions may not be the final employment sector for an S&E workforce dominated by graduates in engineering, computer sciences, and even biological sciences.\nResults did not show a significant difference among the three groups in terms of quality of employment. Overall, about 90% of college graduates work a full year and about 91% of graduates have full-time jobs. However, among the FBT group, only 87% work full year and among the FBP group, only 89% have full-time jobs.\nIn terms of 2013 annualized salaries, an ANOVA test shows statistically significant difference (p < .001) between the three groups: the foreign-born who obtained citizenship or permanent residency making about $87,500 as compared to foreign-born on temporary visa making almost $73,600 and the U.S. born graduates making $65,800 per year. Certainly, a combination of degree level, field of study and employment sector, as well as a larger proportion (51%) being 9 years out of college gives advantage to the FBP group. It is, however, remarkable that the FBT group is doing so well, which could be the result of a high level of education, and large proportion of engineering graduates."}, {"section_title": "Modeling Earnings", "text": "Multivariate analysis allows us to examine the relative contribution of various factors to college graduates' earnings. In order to control for potential confounding variables, such as years of working in the labor market, advanced degree attainment and employment sector, we conducted three separate linear regression models for each cohort, using annualized salary as the dependent variable and citizenship/visa status, degree level, field of study, and employment sectors as independent variables (predictors). The earning analysis included only graduates who were employed in full-time jobs. The adjusted R-squared indicates that about 17%, 27%, and 16% of the variation in salary is explained by the predictors included in the model for Cohort 1, Cohort 2 and Cohort 3, respectively. Table 2 presents unstandardized coefficients and their standard errors (in parentheses) as well as the significance of the t-tests for parameter estimates, for each cohort. Table 2 . Regression model for annualized salary ($) by cohorts. Note. Cohort 1 = 9 years out; Cohort 2 = 6 years out; Cohort 3 = 3 years out; FBP = Foreign-born, naturalized/permanent; FBT = Foreign-born, temporary. Unstandardized coefficients and their standard errors are rounded to the nearest unit; *** p < .001, ** p < .01, * p < .05 Table 2 shows an average salary varying by cohort from about $49,100 to $47,400 and $43,900 for the reference group: American-born, with a bachelor's or professional degree, in computer/math sciences, employed by an educational institution. As expected, those who graduated recently earn less. The three models show similarities in the contributions by various predictors, although the best fit is noticeable for Cohort 2 (larger R 2 ). For instance, being FBP has a positive on salary for all cohorts, although this is significant only for Cohort 2. On the contrary, FBT graduates have a very significant salary advantage for Cohort 1. Meanwhile, the FBT group earns less than the FBP group for later cohorts.\nDegrees in biological sciences and physical sciences had lower earning powers than degrees in computer sciences for all cohorts, while degrees in engineering had higher earning power, particularly for Cohort 1. On the other hand, a graduate degree brings an earning premium of almost $39,900 for Cohort 1 and about $23,200 for Cohort 3. The employment sector premium is also significant since working in government jobs, and business/industry sector leads to earning increases varying between $19,100 and $24,100 for the government sector, and between $18,700 and $32,700 for the business/industry sector. Large positive contributions to the full models were due to having a graduate degree and working in a business/industry or a government job. Large negative contributions to the full models were due to having a degree in life sciences or physical sciences. When controlling for all factors, the earning gaps were not so large between the American-born and foreign-born S&E workers who were 3 years out of college (Cohort 3). However, differences were more significant for FBT graduates who were 9 years out of college (Cohort 1) and for FBP graduates who were 6 years out of college (Cohort 2)."}, {"section_title": "Earning Patterns by Citizenship/Visa Groups", "text": "For this study, we compared the earnings by the two design factors: citizenship/visa status and graduating cohort. Figure 1 shows the adjusted earnings that correspond to the mean earnings of each citizenship/visa group and graduating cohort when controlling for all other variables in the models. The graph shows the expected downward in 2013 earnings for the most recent cohorts who had less time to compete in the labor market and secure better paid employment. Overall, earnings are higher for foreign-born workers which could be a result of differences in human capital (as shown in Table 1 ). The downward trend is particularly clear for the AB group, with earning differences of about $2,000 between Cohorts 1 and 2 and about $3,000 between Cohorts 2 and 3. Similar patterns of earnings change are noticeable for the FBP graduates, with earning difference of about $4,000 between Cohorts 1 and 3; although higher earnings are noticeable in Cohort 2 which could be the result of higher level of education among the FBP group. When comparing Cohorts 2 and 3, the lines of downward earnings are almost parallel, with the highest earnings shown by the FBP group and the lowest earnings by the AB group which can be mainly attributed to differences in level of education. These graduates entered the labor market during (Cohort 2) and immediately after the 2008 recession (Cohort 3).\nHowever, the slopes of downward earnings are more pronounced for the FBT residents at all times. Overall, the FBT workers did not have same economic growth opportunities as the AB or FBP. Although FBT 9 years out of college (Cohort 1) had the highest earnings, the dramatic downward earnings lead finally to a narrowing of the earning gaps by citizenship/visa among the 3 years out of college graduates (Cohort 3). Second, Figure 1 shows that FBT graduates appear to be the most affected in terms of earnings when comparing Cohort 1 and Cohort 2, which means entering the labor market before (2004-2006) and during (2007-2009) "}, {"section_title": "DISCUSSION AND CONCLUSION", "text": "In this study, we examined the employment status and earnings of foreignborn S&E graduates of U.S. universities who came to the U.S. on temporary visas for study or training, by comparing their labor market outcomes to U.S.-born S&E graduates over the past decade. Foreign-born graduates were grouped into two categories-foreign-born permanent (FBP), i.e., Green Cards holders or naturalized U.S. citizen; and foreign-born temporary (FBT), i.e., temporary visa holders. Results indicated that all foreign-born college graduates obtained higher levels of education between 2004 and 2013, were more likely to be employed, and more likely to have higher annual earnings than U.S.-born graduates in S&E fields.\nBefore discussing the implications of these findings, it is important to contextualize our findings. First, the international students, who were subsequently employed by U.S. firms, represent about two-thirds of foreignborn graduates who came to and studied in the U.S. Second, as indicated by the National Science Board surveys of U.S. college graduates (NSB, 2016) , the average stay rate of international graduates in the U.S. labor market is 5 years after completing their studies, with increasing representation in postdoctoral positions. These indicators suggest that the foreign-born graduates considered in this study represented those who overcame the challenges of entering the U.S. labor market and were progressing through immigration which likely affected their employment outcomes. The foreign-born graduates may be experiencing difficulty finding employers willing to invest in work-visa sponsorship process. It is also likely that even if employers are willing to invest in international workers, the stern visa application process and the limited number of visas granted yearly by the USICS is an impediment, particularly for private employers. Hence, the findings of this study should be taken from the perspective that the foreign-born graduates in this study represent those who have overcome both initial immigration and employment barriers and are entering the U.S. high-skilled immigration process.\nThe level of college education, as a human capital indicator, differentiated the U.S.-born and foreign-born graduates, showing higher education achievements for visa holders. For instance, only 6% of the U.S.-born have a master's or Ph.D. degree as compared to 40% among the FBP and 24% among the FBT groups. Results also indicated that only 88% of the U.S.-born in our sample were employed in 2013 as compared to 92% and 93% for FBP and FBT, respectively. Therefore, the FBP group with higher levels of college education appears to be more employable. However, some unobserved variables were not considered in our analysis. There is a body of literature, outside of the scope of this study, which highlights the education mismatch (over/under education) of graduates based on their education level, employers' perceptions of their economic worth, and their earnings (Chiswick & Miller, 2009; McGuinness, 2006; McGuinness & Sloane, 2011) . Further studies should investigate whether employers are more willing to hire foreign-born college graduates with higher degree credentials rather than less educated U.S.-born graduates. Also, further research may examine whether foreign-born graduates are more willing to accept new employment with lower earnings than according to their credentials and experiences.\nOur findings show significant differences in salaries among S&E graduates, with FBPs making about $87,500 as compared to FBTs making almost $73,600 and the U.S.-born graduates making $65,800 per year in 2013. Clearly, internationals earned higher wages than U.S.-born, probably due to their higher education attainment, as mentioned above. It is safe to assume, however, that the internationals are willing to pursue higher education to improve their marketability. The fact that FBPs earn the highest salary is encouraging and helps explain international students' willingness to pursue employment in the United States. It is also worth noting that the foreign-born workers on temporary visas earned less than those in more permanent residency status. Previous studies also suggested that changes in visa status significantly increase the earnings trajectories of highly skilled foreign-born workers in S&E occupations (Lindsay & Avato, 2013; Roh, 2013) .\nCritical to the labor market outcomes of college graduates is the sector of employment. In general, S&E graduates have a higher representation in the industry sector, which typically provides higher financial rewards in comparison to academic occupations (Biggs & Richwine, 2014; Guttenplan, 2012; NSB, 2016; Yang & Webber, 2015) . Therefore, the growing employment of foreign-born graduates in academia, for instance in post-doctoral research positions, may be reflected in the earnings of those on temporary visas. The FBT group could be at a financial disadvantage by being largely employed by the academic sector. However, this could be a necessary step for obtaining sponsorship for their work (H-1B) visas before enjoying more employment mobility and searching for new job opportunities.\nA final point of discussion has to do with the time of employment. Previous research points to increasing flow of high-skilled immigrants into the U.S. labor market during periods of economic boom (Bound et al., 2015; Bound et al., 2013) . This study focuses on graduates of U.S. universities who entered the labor market in 2004-2006, 2007-2009, and 2010-2013 (represent cohorts per NSB survey cycles), which correspond to before, during, and after the recent U.S. economic recession (National Bureau of Economic Research, 2010; U.S. Bureau of Labor Statistics, 2012). The differences in 2013 earnings showed in this study were mainly the result of time spent in the labor market. The earlier cohorts would have more time to compete and secure better-paid employment or advance in their jobs. However, foreign-born workers show greater earning loss based on time of entry into the labor market (difference by cohorts) in comparison to the U.S.-born graduates. Those who graduated between 2007 and 2009 (Cohort 2) showed lower earnings in 2013. In addition, we observed that there was a closing of the earnings gap between the U.S.-born workers and foreign-born. Hence, we suggest that foreign-born workers were negatively affected by the economic recession.\nIn conclusion, it is widely acknowledged that foreign-born graduates have contributed to the U.S. economy and scientific work force (Lowell & Avato, 2013; Stephan & Levin, 2001; Yang & Webber, 2015) . There is an increasing demand for post-doctoral training or employment in S&E fields for foreign-born graduates in the U.S. (Freeman, 2006; Kim, Bankart, & Isdell, 2011) . The findings of this study suggest some policy implications for recruiting and retaining highly skilled foreign workers in S&E fields. To recruit international students and retain the best and brightest U.S. educated foreign-born graduates, the government should offer a more clear and viable path to immigration. Institutions of higher education and government agencies can develop partnerships as well as scholarships to recruit more U.S.-born students in S&E programs (Freeman, 2006) ."}]