[{"section_title": "Abstract", "text": "Comparative, quantitative biogeographic studies are revealing empirical patterns of interspecific variation in the sizes, shapes, boundaries, and internal structures of geographic ranges; these patterns promise to contribute to understanding the historical and ecological processes that influence the distributions of species. This review focuses on characteristics of ranges that appear to reflect the influences of environmental limiting factors and dispersal. Among organisms as a whole, range size varies by more than 12 orders of magnitude. Within genera, families, orders, and classes of plants and animals, range size often varies by several orders of magnitude, and this variation is associated with variation in body size, population density, dispersal mode, latitude, elevation, and depth (in marine systems). The shapes of ranges and the dynamic changes in range boundaries reflect the interacting influences of limiting environmental conditions (niche variables) and dispersal/extinction dynamics. These processes also presumably account for most of the internal structure of ranges: the spatial patterns and orders-of-magnitude of variation in the abundance of species among sites within their ranges. The results of this kind of \"ecological biogeography\" need to be integrated with the results of phylogenetic and paleoenvironmental approaches to \"historical biogeography\" so we can better understand the processes that have determined the geographic distributions of organisms."}, {"section_title": "INTRODUCTION", "text": "If there is any basic unit of biogeography, it is the geographic range of a species. Most biogeographic research is the study of the structure and dynamics of 597 0066-4162/96/1120-0597$08.00 geographic ranges: their sizes, shapes, boundaries, overlaps, and locations. Biogeographers study the spatial patterns of dispersion of ranges, the temporal patterns of changes in ranges, the relationships between ranges and phylogenies, and the processes that produce these patterns. Some biogeographers are concerned with a particular region, so they may consider only a portion of the range of one or more species. Others are interested in the distributions of multiple species: of clades, taxonomic groups, functional groups, or overall species diversity. Nevertheless, nearly all biogeographic research is attempting to answer questions about the processes that determine the location in space and the shifts in time of the ranges of species.\nIn the present chapter we review what is known about the patterns and processes that characterize the ranges of species. We are concerned primarily with variation among species in a clade, taxon, or functional group in the size, shape, and internal structure of ranges. Because these features of ranges are all related to the environmental factors and ecological processes that limit distribution and abundance, we are also concerned with range boundaries: their location and configuration in space and their changes over time. Each major topic is divided into two subsections. In the first, \"Patterns,\" we review the empirical information on the quantitative characteristics of ranges and their relationships to other variables. While space does not permit us to mention all of the relevant data and published studies, we try to survey what is known and to provide many citations. In the second subsection, \"Processes,\" we discuss the mechanisms that have been or might be invoked to account for the patterns. Here we are necessarily more speculative, because many of the patterns have only recently been discovered, and hypotheses about mechanisms are still being developed and evaluated. We hope that our chapter will stimulate the effort to better characterize the pattems and to better understand the mechanistic processes that produce them."}, {"section_title": "A Digression: Defining Species and Ranges", "text": "If the geographic range of a species is a basic unit of biogeography, then biogeographic research will depend on how species and their ranges are characterized. The definition of species has been complicated in recent years by two important advances in phylogenetic systematics. One is the use of molecular genetic information for phylogenetic reconstructions and taxonomic revisions. Studies of variation at the molecular level have often revealed genetic discontinuities within taxa that had formerly been considered to be single species (e.g. 60) . The second complication has come from the introduction of new evolutionary (92) and phylogenetic (22) species concepts. The former would define as a species any population that is sufficiently isolated from other populations so as to be an independent evolutionary unit. The latter would consider as a species any population in which a unique derived character (apomorphy) is fixed. Application of these new species concepts has resulted in the splitting of species into multiple new species based on their distinctive molecular genetic characteristics. These changes in systematics have the merits of making the definition of species consistent with the theory and practice of reconstructing phylogenetic relationships using molecular data, but they create practical problems for practicing taxonomists and all other individuals who are faced with the task of identifying living organisms in the field or their preserved remains in fossil deposits or museum collections. There are also problems at higher levels of classification, because phylogenetic systematists are using the concept of clade, defined as all of the descendants of common ancestor, to redefine traditional taxonomic groups.\nWe do not mean to be critical of these developments. Indeed, the recent advances in phylogenetic reconstruction-together with recent studies of earth history and fossil organisms-are leading to greatly increased understanding of the history of plant and animal distributions. We would, however, make two pleas. First, we emphasize the need for practical, operational, and reasonably standardized species definitions, so that biogeographers and other scientists can identify their organisms and can apply the advances in phylogenetic reconstruction to their own studies. In the meantime, quantitative studies of geographic ranges will have to be based on existing taxonomic classifications and published studies that provide standardized range maps or other data on the distributions of many species. Second, we ask that the zeal for applying phylogenetic reconstructions to comparative ecological and biogeographic studies be tempered by the realization that other factors affect abundance, distribution, and diversity. The constraints of phylogeny certainly influence contemporary ecological relationships and geographic distributions, but ecology and geography also influence phylogeny. It is no more reasonable to demand that phylogenetically explicit analyses be included in comparative ecological and biogeographic studies than it is to demand that earth history and ecology be incorporated explicitly in phylogenetic reconstructions. Phylogenetic analyses can make important contributions to comparative biogeography (e.g. 87), but they are neither necessary nor sufficient to address all of the interesting questions.\nEfforts to do comparative, and especially quantitative, research in biogeography are also complicated by problems of defining and mapping geographic ranges (11, 31, 32, 88) . Like attempts to define and classify species, efforts to characterize geographic ranges of species necessarily involve reducing a complex phenomenology to a greatly simplified abstraction. The real units of geographic ranges are the complex spatial and temporal patterns in which individual organisms are dispersed over the earth. Any maps or other characterizations of the geographic ranges of species necessarily simplify such complex distributions.\nMost comparative biogeographic research relies on data compiled from the literature or from other sources, such as museum specimens and biological surveys. The original data on distributions of species, and the range maps that are constructed from them, have problems of precision, accuracy, and interpretation. The range is most often mapped as an irregular area. Such \"outline maps\" are often so simplified that they do not depict either holes within the range boundaries where a species does not occur or islands around the perimeter where isolated populations are found. Somewhat more precision is afforded by \"dot maps\" that plot each location where a species has been recorded. Most published range maps attempt to define the historical range of a species. This means that the range encompasses all localities where a species is known to have regularly occurred in the past, including areas where it formerly was present but is now extinct and areas that it has recently colonized. Unless the map is up to date, however, it may not include all locations where a species has recently been recorded. The mapped range usually does not incorporate records of occurrence that are judged to represent individual organisms that have dispersed or been transported by humans beyond the normal distribution of a species.\nGiven the problems in defining species and their ranges, a naive reader may wonder whether there is any point in trying to do research in comparative biogeography-of trying to quantify patterns and to understand the processes that produce them. While it is important to be aware of these problems, they are hardly crippling. Indeed, problems of precision, accuracy, and completeness of information are common to most ecological and systematic research. When, as is usually the case with geographic ranges, there are orders of magnitude of variation among the entities being compared, small differences owing to human factors are not likely to be important."}, {"section_title": "An Historical Perspective", "text": "Considering the long history of biogeography and the central place of the geographic range in biogeographic research, it is surprising that most comparative studies of the characteristics of ranges have been done within the last 15 years. The earliest biogeographers, including de Candole, Wallace, Hooker, and Darwin, were concerned with factors that limited distribution and influenced species composition and diversity, but they rarely focused explicitly on geographic ranges. Perhaps the first person to do so was Willis (94), whose treatise Age and Area quantified the areas of geographic ranges of species in several taxonomic groups, pointed out the wide variance and distinctive shape of the frequency distributions, and advanced the hypothesis that the areas reflected the age of the taxa and thus the time since they differentiated from an ancestor. While Willis's ideas seem quaint today, he must be regarded, along with Arrhenius (4) who worked on species-area curves, as one of the pioneers of quantitative biogeography.\nFor most of the twentieth century, research on geographic ranges was directed primarily toward trying to identify the environmental factors responsible for range boundaries of particular species. This work was often motivated by practical concerns about what limited the distribution of commercially valuable plants (e.g. 56) , invasive weeds and insect pests (e.g. 1, 91), or potential agents of biological control (e.g. 25, 50) . Connell's (20) classic experimental investigation of the factors limiting the distribution of the barnacle Chthamalus stellatus remains one of the most thorough and rigorous studies. Connell's work was typical of much of the research on range boundaries, however, in that it was on a small spatial scale, focused on a few limiting factors, and had a more ecological than biogeographic flavor.\nThe discipline of biogeography gained new vigor in the second half of the twentieth century, stimulated in large part by the contributions of Darlington, Croizat, MacArthur & Wilson, Nelson, Platnick, and Rosen. In 1977, Sydney Anderson published the first of several papers based on measuring the areas of the mapped geographic ranges of vertebrates in North America and Australia (2, 3) . Primary credit for stimulating interest in quantitative studies of geographic ranges, however, must go largely to Rapoport, whose creative and insightful monograph Aerography was published in English in 1982 (73) . Rapoport not only anticipated nearly all of the ideas in the present review article, he also investigated many of them by collecting data and performing elegantly simple analyses.\nThe last decade has seen a gratifying increase in comparative and quantitative studies of geographic ranges. Such studies have been greatly facilitated by advances in computer technology. Large computerized data bases compiled from museum collections, standardized biological surveys (e.g. the North American Breeding Bird Survey and Butterfly Survey), and other records provide detailed accounts of occurrence for many taxa. Published range maps, often prepared from these data bases, provide relatively standardized representations of the distributions of many species. Other data bases make available information on geography, geology, climate, soils, vegetation, and other environmental variables from earth-based and remotely sensed sources. Development of computer hardware (e.g. scanners and digitizers) and software (e.g. statistical and graphics packages, and Geographic Information Systems) permit the quantification, representation, and analysis of distributional patterns. Advances in mathematical and simulation modeling (e.g. nonlinear dynamics, cellular automata, and agent-based models) facilitate understanding of complex, spatially explicit processes. While the recent availability of data bases and of new analytical and modeling tools has already contributed greatly to biogeographic research, they promise even greater contributions in the future."}, {"section_title": "SIZE OF RANGE", "text": ""}, {"section_title": "Patterns", "text": "There is enormous variation in the sizes of geographic ranges of individual species. Among the smallest are the natural distributions of the Soccoro isopod (Thermosphaeroma thermophilum) and the Devil's Hole pupfish (Cyprinodon diabolis), each of which occurs in a single freshwater spring with a surface area of less than 100 m2 (M Molles, personal communication; 68). Among the largest ranges are those of several marine organisms, such as the blue whale (Balaenoptera musculus), which include most of the world's unfrozen oceans, areas on the order of 300,000,000 km2. Among terrestrial organisms, species with very large native ranges include the peregrine falcon, barn owl, and osprey, which are widely distributed over all of the continents except Antarctica. Of course, modem Homo sapiens is now one of the most widely distributed species, and humans have carried several species of symbionts and exotics with them as they have spread over the entire earth.\nTwo features of the variation in range size are especially interesting. One is its sheer magnitude. Just for comparison, the 12 orders of magnitude variation in area of geographic range is much greater than the variation in genome size, but much less than the variation in body size among all living organisms (about 6 and 21 orders of magnitude, respectively; 11). The other is that this variation is of two types. For some organisms, the geographic range is approximately the same size as the home range of an individual organism, so that the species is composed of a single, freely interbreeding population. This is true not only for species with tiny ranges, such as Soccoro isopod and Devil's Hole pupfish mentioned above, but also for some of the animals with the largest ranges, such as some pelagic marine fishes, seabirds, and whales. For the majority of organisms, however, the geographic range is many orders of magnitude larger than the ambit of an individual, and the species is comprised of numerous populations, isolated by distance and often by geographic barriers to dispersal.\nThe frequency distribution of range sizes among the species in a large clade or taxonomic group has a distinctive shape. Many species have smallto moderatesized ranges, and a few have very large ones. This pattern was first documented by Willis (94) , but it has been confirmed by many subsequent investigators working on many different kinds of organisms (e.g. 2, 31, 34, 55, 70, 73) . The shape of the frequency distribution is highly right-skewed when plotted with area on a linear axis, but more normal-shaped or perhaps even left-skewed The same data are plotted on a linear axis (above); and on a logarithmic axis (below). These distributions are similar to those observed for birds, mammals, and other organisms (11, 30) .\nwhen plotted on a logarithmic axis (see example for pines in Figure 1 ). Within the limits of the accuracy of the range maps and taxonomy, this pattem appears to be very general. While we hesitate to call it universal, we know of no clear exceptions. Superimposed upon or embedded within this general distribution of range sizes are additional patterns. The range of variation is specific to particular taxonomic or functional groups of organisms. This is apparent at several levels. Closely related species, such as congeners, tend to have range sizes more similar than those of more distantly related species (11, 57) . This suggests that intrinsic characteristics of the organisms inherited from their common ancestors influence the ecological interactions that limit geographic distribution. The influence of taxonomic and functional constraints on range size are even more apparent when very distantly related and dissimilar organisms are compared.\nFor example, among terrestrial and freshwater organisms, the smallest ranges of vascular plants and fishes (< 1 kM2) are several orders of magnitude less than the smallest ranges of birds and mammals (on the order of 10,000 kM2). Similar variation occurs among marine taxa, where studies have related some of it to dispersal capabilities. For example, marine mollusk species that do not have a planktonic larval phase in their life cycle tend to have smaller ranges than do species with more readily dispersed planktotrophic larvae (45, 58) .\nThere are additional patterns of variation in range size with characteristics of the organisms. Several investigators have explored the relationship between range size and body size (9, 11, 13, 14, 30, 34, 35, 36, 37, 69) and range size and abundance (5, 6, 7, 10, 13, 14, 34, 37, 69) . These relationships can be characterized by correlations: i.e. in most cases there are highly significant positive correlations between range size and both body mass ( Figure 2 ) and some measure of average population density ( Figure 3 ). There is usually,\nl xlOc ixio' lxlO~ lxlOC lxlO~ lxlO Body Mass (g) Figure 2 Relationship between area of geographic range and body size on logarithmic axes for 391 species of North American land birds (from Brown & Maurer 1987 ). Note that while there is a marginally significant positive correlation (r = 0.08, 0.05 < P < 0.10), the data points tend to fall within a triangular space so that most species of large body size have large geographic ranges. ). There is a significant positive correlation (r = 0.18; P < 0.01); most of the data fall within a triangular space so that most species with high abundances have large ranges. however, a great deal of residual variation. Brown & Maurer (9, 11, 13, 14) have pointed out that it may be more informative to consider the overall pattern of variation in bivariate plots on logarithmic axes (Figures 2 and 3 ). While there is considerable variation, it is constrained to certain combinations of the variables. Some of these constraints may be absolute: For example, the maximum size of geographic range may be constrained by the area of the continent over which the organisms are distributed. Other constraints may be relative or probabilistic: For example, it is not impossible for an organism of large body size to have a very small geographic range, but it is highly unlikely.\nOne of the most interesting patterns of variation in range sizes occurs in ecogeographic gradients: Range size tends to decrease with decreasing latitude and decreasing elevation in terrestrial environments and to increase with increasing depth in marine environments. The latitudinal pattern was documented for subspecies within species by Rapoport (73) and subsequently shown to hold for species within higher taxonomic groups (82) . The generality of the relationship and its occurrence in elevational and depth gradients have been explored by Stevens (82, 83, 84) , who called the empirical pattern \"Rapoport's Rule.\" The pattern is apparent when range size is measured either as the area of the geographic range or as the latitudinal, elevational, or depth range of the species distribution.\nThe majority of studies have found that the species with the smallest ranges are consistently confined to the tropical end of latitudinal gradients, the lower end of elevational gradients, or the shallow end of depth gradients (28, 61, 64, 70, 84, 87) . It is probably not coincidental that the regions with the smallest ranges are also the regions of highest species diversity for the taxon. Thus in the genus Pinus, which is an exception to the typical latitudinal gradient of species diversity, both the highest species richness and the smallest geographic ranges occur at mid-latitudes (85) . The few studies that question the empirical generality of Rapoport's Rule are either of marine organisms (77, 80) or for the continent of Australia (81) . For marine taxa, depth range rather than latitudinal range most influences the range of environmental conditions that a species experiences (84) . The fact that Australia has low species diversity in its arid center and that climatic variability peaks at mid-latitudes (M Westoby, personal communication) is also consistent with its exception to the more common latitudinal pattern of range size distributions.\nMaps of geographic ranges show enormous variation in their shapes. In fact, despite the emphasis of many historical biogeographers on similar distributions and congruent area cladograms, the differences in the shapes and locations of ranges are perhaps more striking than the similarities-and this is as true of the ranges of clades or higher taxonomic groups as it is of individual species. Nevertheless, there appear to be some general patterns.\nRapoport noticed that despite the orders of magnitude variation in the areas of ranges of North American mammals, the periphery-to-area ratio remained relatively constant. That is, when he measured the perimeter of the range boundary and the area encompassed within that boundary, he found that the ratio of the two variables was approximately 10 and did not vary with range size.\nHowever, Rapoport's observation about perimeter-to-area ratios should not divert attention from the great variation in the shapes of ranges: some are compact and globular whereas others are long and attenuated. A simple way to convey much information about shape is to plot two distances across the range as a function of each other. It would be interesting to do this for the longest and shortest linear dimensions. Brown & Maurer (11, 14) did something slightly different but perhaps equally informative. They plotted maximum north-south distance as a function of maximum east-west distance, thus referencing variation in shape with respect to geography. The result is the kind of graph shown in Figure 4 , in which the line of equal distances has been plotted for reference. In such a graph, ranges with equal dimensions, such as circles or squares, would Kilometers East -West Figure 4 Shapes of geographic ranges of North American and European land birds and North American terrestrial mammals. Each data point represents a species. The maximum north-south dimension of the range is plotted against the maximum east-west dimension (both on logarithmic axes), so that the smallest ranges are in the lower, left-hand part of the graphs. The diagonal lines show equal dimensions, so that points above the lines correspond to ranges that are attunuated in a north-south direction, and points below the lines correspond to ranges that are elongate in an east-west direction. (From Brown & Maurer 1989) fall along this line, with small ranges to the left and large ones to the right; ranges attenuated in a north-south direction will fall above the line, whereas those attenuated east-west will fall below the line. The few such graphs that have been compiled show interesting patterns. Although there is considerable scatter, North American mammals, birds, and reptiles all show a consistent trend: Small ranges tend to be oriented north-south, whereas large ones tend to be aligned east-west. European mammals and birds present an interesting contrast, with both the small and large ranges being oriented east-west. Other studies (40, 84) have considered the three-dimensional shapes of the ranges of marine organisms in relation to ecological gradients. Another interesting feature of range shape is the number, size, and location of the holes and fragments. The range tends to become less continuous toward the periphery. Rapoport (73) likened the idealized pattern to a slice of Swiss cheese. The center of the range may be relatively continuously inhabited, but toward the periphery, increasingly large, closely spaced holes appear until they coalesce to form islands at the outer range boundary. Rapoport (73) and Stevens & Enquist (85) have analyzed the number, size, and location of the geographically isolated range fragments that are plotted on detailed range maps. Most range maps, however, depict only the largest and most isolated fragments. The detailed data on the spatial distribution of abundance from standardized surveys potentially provide much more accurate information on the phenomenon of holes and fragments in species ranges (see section on \"Internal Structure of Ranges\" below). While most range fragments appear to be located around the periphery of the range, sometimes the range consists of two or more widely isolated portions (12, 88) . Presumably these disjunctions have formed as a result of longdistance colonization, vicariance, or wholesale range contraction as discussed under the heading of \"Range Boundaries\" below.\nMost maps of geographic ranges and most quantitative studies based on range maps ignore the area inside the range boundary. Exceptions are contour maps and other kinds of maps that show variation in abundance within the range. Most such maps have been published fairly recently, following the compilation of large computerized data sets and the development of Geographic Information Systems (GIS) to reference, map, and analyze spatially explicit data. Such maps, and the extensive data on spatial variation in abundance from which they are derived, provide invaluable information on the \"internal structure\" of the geographic ranges of species. Investigation of this internal structure-searching forpatterns and erecting and testing null and mechanistic hypotheses-promises to contribute greatly to understanding most of the phenomena related to sizes, shapes, and boundaries of ranges that are discussed above. While studies of the internal structure are just in their infancy, some interesting results have ben obtained.\nFirst of all, there appears to be wide variation in abundance within the range. As mentioned above, many areas within the boundaries of published range maps are uninhabited, i.e. local abundance is zero. But this is still a great oversimplification, because there is typically enormous variation in abundance at those localities where the species occurs (11, 15, 67) . While the abundance of some rare species may vary from zero to a few individuals, that of some classes of rare species (see 33, 72) and most common ones may vary by several orders of magnitude. The frequency distribution of abundance among multiple sites throughout the range appears to have a characteristic shape: Zero or a very few individuals occur at most locations, but tens or hundreds are found at a few sites ( Figure 5; 15 ). For example, for most common passerine birds censused in the North American Breeding Bird Survey (BBS), the modal number of Ri* Of route individuals counted at a site is typically one (and almost always less than five), although the maximum number can be in the hundreds or even thousands.\nOur studies of avian distributions based on the BBS have revealed at least five patterns in the spatial distribution of abundance within the range (10, 11, 15, 67; see also 17, 27, 51, 53, 54) . First, there is spatial autocorrelation: Abundances tend to be more similar among nearby localities than distant ones. Second, while there are some changes in abundance at local sites over time, at many sites abundances of particular bird species have remained quite similar over the last 20 years. Third, spatial variation in abundance tends to be greatest near the center of the range, where the sites of highest abundance but also sites with zero and low abundance occur. Abundance tends to be uniformly low near the boundaries of the range. Fourth, an exception to the previous pattern is that when the range boundary coincides with a coastline, abundance often tends to be relatively high right up to the coast rather than decreasing as the boundary is approached as it does toward the other edges of the range (67) . Fifth, comparisons among species, even closely related, ecologically similar ones, show that the both the spatial patterns of abundance and the temporal changes in abundance at sites are highly species specific (8) .\nMaurer (66) has taken a somewhat different approach to characterize the internal structure of the range. He used spatially explicit BBS data on abundances of bird species to calculate a fractal dimension of distribution, which provides information on the degree and size of fragmentation. This approach has other applications, such as analyzing the fractal nature of range boundaries to distinguish between artefacts of mapping and real features of the scale and pattern of distribution."}, {"section_title": "Processes", "text": "Empirical patterns, such as the seemingly general relationships between range size and other variables presented above, call for mechanistic explanations. Before postulating specific mechanisms, however, it is important to show that there is a pattern to be explained. The apparent pattern should be tested against the null hypothesis that the observed distribution is simply the result of sampling or some other random process (41) . Unfortunately, there is usually not just one applicable null hypothesis. There are multiple possible null hypotheses that incorporate different amounts of information about the system, and consequently these null models differ in the mechanisms and degree of \"biological realism\" that are implicitly assumed. At a first level, it is important to test a frequency distribution against a normal or lognormal distribution, and a bivariate relationship against a bivariate normal (or bivariate lognormal) distribution, because random sampling and other kinds of simple stochastic processes tend to produce normal distributions. Most of the patterns discussed above are readily distinguished from univariate normal or bivariate normal distributions. A possible exception is the univariate frequency distribution of range sizes on a logarithmic axis for some taxa; further testing and exploration of this pattern is warranted.\nMore complicated null models that incorporate more of the structure of the data and/or more deterministic mechanisms are usually easy to construct but harder to reject (41) . For example, Colwell & Hurtt (19) have developed several alternative null hypotheses for the latitudinal version of Rapoport's Rule. These make different assumptions about how geographic ranges are distributed on and constrained by the spherical geometry and basic geography of the earth. Some of these null models produce patterns similar to Rapoport's Rule. It is important to note, however, that failure to reject even a simple null hypothesis does not necessarily mean that an empirical pattern is due simply to uninteresting random processes. Perhaps the best example comes from quantitative population genetics, where a normal-shaped frequency distribution of a trait can usually be assumed to reflect not small random errors of sampling or measurement but rather the additive influence of many genes with small effects.\nWhile it will be worthwhile to continue to test some of the empirical patterns of range size further against null models, it is also appropriate to develop and test hypotheses about deterministic processes that may have produced the patterns. Two classes of mechanisms have typically been invoked to account for the patterns described above. One class might be termed dynamic processes of colonization and extinction (and sometimes speciation). The other class might be called niche processes or mechanisms of limitation by environmental variables. These two classes of processes are not mutually exclusive. Indeed, they are both operating simultaneously in many cases. But often one or the other may be sufficient to explain a particular pattern. Thus, for example, to account for the fact that most organisms of large body size have large geographic ranges, it seems reasonable to invoke a high probability of extinction due to small total population size. Similarly, ecological limiting factors can probably account for most of the variation in distribution and abundance of any given species, and hence for the size and boundaries of its geographic range. However, the critical factors and parameter values can be expected to be different for each species, and to be difficult and costly to.measure. Many studies have identified one or a few of the limiting niche dimensions (see above), but we are not aware of any study that has quantified the entire niche of a species and then tested the ability of this characterization to predict the size and limits of the geographic range.\nOn the other hand, there are cases where an explanation based on just one process is unsatisfying. An example is an explanation for the relationship between range size and abundance or latitude that is based solely on colonization/extinction dynamics. It has been suggested that locally dense populations are more likely to export emigrants, which in turn are more likely to colonize other areas, both \"source\" habitats capable of sustaining populations and \"sink\" habitats requiring a continual influx of immigrants in order to persist (46) (47) (48) (49) . But even though such a mechanism might be plausible to account for the maintenance of the positive correlation between distribution and abundance, many investigators would not be satisfied with it. They would want to know why some species are more abundant and more widely distributed in the first place. Such a question would seemingly have to be answered by information about the environmental factors that affect population growth and dispersal. Similarly, one might invoke lower extinction rates in the tropics to account for the smaller geographic ranges there. While this might provide a partial explanation, most investigators would want to know what it is about tropical environments that enables species with small ranges-and perhaps also low population densities-to persist. Is it constancy of current climatic conditions, absence of pandemic diseases, lack of large-scale historical disturbances, or some other factor or combination of factors?\nThe apparent constancy of perimeter-to-area ratios noted by Rapoport suggests that, when considered at the same spatial scale, large ranges have smoother boundaries than do small ranges. While this might suggest something interesting about colonization-extinction dynamics, ecological limiting factors, or some combination of these, it is first important to evaluate an alternative hypothesis: that it simply reflects the unintentional bias of the map makers. There is an inherent tendency to draw maps with a fractal structure, including more detail about boundaries (and other features) as the spatial scale decreases (65, 75) . In many cases, including Hall's (44) treatise on North American mammals which Rapoport used for many of his analyses, small ranges are typically mapped at greater magnification than large ones. Thus the apparent constancy of periphery-to-area ratios over a wide range sizes should be reevaluated. If the fractal inclinations of map makers can be circumvented, however, the peripheryto-area ratio is one simple measure of range shape that warrants further study.\nBrown & Maurer (14) suggested that the patterns of north-south and east-west orientation described above reflect the physical geography of the continents. The east-west orientation of large ranges in both North America and Europe was suggested to reflect the ultimate influence of the major east-west oriented belts of climate and vegetation on species with large ranges. The difference between the continents in the orientation of small ranges (north-south in North America and east-west in Europe) was suggested to reflect the influence of environmental variables associated with smaller-scale geographic features such as the orientation of major mountain ranges, river valleys, and coastlines, in determining the boundaries of smaller ranges. These ideas could be pursued further with analyses of range shapes in relation to abiotic and biotic environmental variables in other kinds of organisms in other geographic and ecological settings such as on other continents or in the oceans.\nThe edges of geographic ranges are set primarily by ecological factors that limit local distribution and abundance. The numerous case studies of range boundaries document the many kinds of abiotic and biotic factors that can limit individual species. Most of these studies have inferred that a particular factor is limiting, because the range boundary is closely correlated with a particular value of the parameter (e.g. 74, 78, 79) , but some are based on more direct evidence such as experimental manipulations (e.g. 20) or observations of range shifts in response to environmental changes (e.g. 67). The environmental factors limiting ranges are so varied that it is hard to generalize about them. Each species has a unique ecological niche: a set of environmental variables that limit abundance and distribution because survival and reproduction can occur only within a certain range of parameter values. Any niche variable, either independently or in interaction with other variables, can determine a local range boundary. The boundary of the entire geographic range, especially if the range is large, is set by multiple niche variables limiting local or regional distribution at different locations around the periphery (12) . While the role of multiple limiting factors is trivially obvious-e.g. many species have part of a range boundary at a coastline and part of one inland-the total number of niche variables responsible for the entire range boundary warrants theoretical and empirical study. We have done some preliminary computer simulations that suggest that the number of independent environmental variables that have?an important influence on distribution and abundance of a species may be modest, on the order of five to ten. If there are too many parameters, each of which is distributed independently in space and can assume values preventing the occurrence of a species, then the places where the species can live will be few and widely separated.\nOne general pattern of range limitation mentioned above is the relative importance of abiotic and biotic limiting factors in ecological gradients. In most ecological and geographic gradients the majority of species appear to find one direction to be physically stressful and the other to be biologically stressful, and as physical stress diminishes, there is a corresponding decrease in the average size of the range and an increase in overall species diversity. While the empirical patterns are becoming increasingly clear, it is difficult to sort through the correlated phenomena to develop and test hypotheses about causal mechanisms (but see 11, 21, 59, 63, 78, 79, 82) . Efforts to do so soon encounter some of the big unresolved questions about the ecological and biogeographic processes that generate and maintain the spatial patterns of biological diversity: questions such as \"What does it mean to say that an environment is physically harsh or stressful?\", and \"What is the relationship between species diversity and the number and strength of interspecific interactions?\" This should be a fruitful area for research, but with the caveat that satisfying answers probably will not come easily.\nThe view that multiple niche variables largely set the boundaries of geographic distributions accords well with what is known about one class of range shifts, the local and incremental expansion or contraction of distribution. van den Bosch et al (89) have modeled one kind of such shifts, the rapid range expansion of a colonizing species such as an introduced exotic. Their model makes standard exponential population growth spatially explicit by incorporating a dispersal parameter. When this model is parameterized for well-studied invading populations, it seems to fit the observed pattern of range expansion quite well. Since this model and the data on invading species suggest that the rate of range expansion is exponential or nearly so in the absence of environmental limits, and since most species are not rapidly expanding their ranges, we can infer that most existing range boundaries are set by limiting environmental variables.\nWhen cases of incremental range expansion and contraction have been studied, changes in critical environmental conditions that have made previously unfavorable areas habitable or vice versa have often been identified (e.g. 67, 86) . When effects of environmental changes have been investigated, usually the range shifts of species are highly individualistic. This is true in the case of the range shifts that have occurred in response to the large changes in climate and other abiotic conditions at the Pleistocene-Holocene transition (18, 23, 42) and of recent range shifts that have occurred in response to activities such as predation and habitat alteration (62) . Less frequently, there are coincident shifts in the ranges of multiple species, which appear to be caused by changes that have occurred in one or more environmental variables (often in a suite of correlated variables) that are important niche variables for these species (e.g. 29, 67) .\nThe exact position of the range boundary is determined by the interaction of the population processes of birth, death, and dispersal with the spatial and temporal variation in the environment. It is possible to imagine a variety of circumstances, modeled by Pulliam (71) , such that the peripheral populations represent some combination of sources, where births exceed deaths and emigration exceeds immigration, and of sinks, where the opposite conditions obtain. Whether a population is a source or sink will depend on the local environmental conditions and on the proximity of and rate of exchange of dispersing individuals with other populations. It is possible to imagine a variety of situations, ranging from highly vagile organisms, such as some birds, in which most of the populations near the range boundary are sinks (43) , to more sedentary organisms (or good habitat selectors), such as some plants, in which most of the peripheral populations occur in local patches of favorable environment. Unfortunately, the necessity for detailed data on demography and dispersal make it difficult to distinguish sources from sinks empirically.\nDifferent kinds of processes must be invoked to account for the other class of range shifts: long-distance dispersal across a barrier to found an isolated population. The success of introduced species in so many parts of the world indicates that many, probably most, species do not live everywhere they can; barriers to dispersal prevent their occurring in distant but otherwise habitable areas. There is a large literature on range expansion by means of such barriercrossing dispersal, which is exemplified by, but not limited to, colonizing islands (16, 93) and invading exotics (26, 52) . At this point it must be emphasized that the distinction made above between the two classes of range shifts emphasizes the extremes of a continuum. The entire subject of metapopulation dynamics focuses on the processes and consequences of small-scale colonization and extinction (39) , and these processes undoubtedly occur around the boundaries of many geographic ranges.\nMuch research needs to be done to explore the generality of the above patterns with respect to different kinds of organisms and geographic regions and to develop and test hypotheses about causal mechanisms. Nevertheless, it appears that most of the spatial variation in abundance reflects the influence of spatial and temporal variation in environmental variables on population dynamics, both local population regulation and metapopulation colonization-extinction dynamics. Clearly most of the variation is not just random noise. There is too much regular pattern, and we have in some cases tested and rejected simple null models (15) . We suspect that ultimately it will be possible to explain most of the variation in any particular species with a model of how spatial and temporal variations in limiting niche parameters affect local and regional population dynamics. But the species-specificity of the patterns of variation suggests there will be little generality at this level of analysis. Each species will have a unique niche, defined by particular environmental variables and ranges of parameter values, and each species will have unique population dynamics, a consequence of its life history and dispersal characteristics.\nThere may, however, be some generality in the ways that important environmental factors, especially abiotic ones such as climate, geology, and soils in terrestrial systems or oceanographic conditions in marine systems, vary and covary in space and time. There may also be, as mentioned in the section on range boundaries, some generality in the number of important niche dimensions that limit the distribution and abundance of a species, and in the way that these interact with each other and with population dynamic processes to produce the orders-of-magnitude variation and the spatial and temporal patterns of abundance. It should be possible to explore these questions through computer simulation modeling and empirical studies of a few selected species."}, {"section_title": "SHAPE OF RANGE", "text": ""}, {"section_title": "RANGE BOUNDARIES Patterns", "text": "We cannot review here the enormous literature on the factors that have been implicated to set boundaries on the geographic ranges of species (but see 30 and references therein). Most of the studies focus on specific environmental conditions that appear to limit local distribution along one edge of the range. These environmental factors typically appear to be specific to the species or higher taxon being studied. There has been little attempt to review, reanalyze, and synthesize the results of all the relevant studies, so there may be more general patterns than those considered below.\nOne pattern that may have considerable generality concerns the relative importance of abiotic and biotic limiting factors along different margins of species ranges (59) . Dobzhansky (24) and MacArthur (63) suggested that biotic interactions tended to limit distribution and abundance at lower latitudes, whereas abiotic factors were more likely to be limiting at higher latitudes. Intertidal ecologists have developed a similar paradigm: Abiotic factors related to exposure to physical stress between tides set the upper limits of distribution, whereas predation and interspecific competition set the lower limits (21) . Similar patterns appear to occur in other ecological gradients such as elevational and aridity gradients in terrestrial environments and depth gradients in aquatic environments; in one direction along the gradient the distributions of species are limited by increasing physical stress, while in the other direction they are limited by increasing numbers and impacts of biological enemies. These patterns of range limitation in geographic and ecological gradients appear to be related not only to each other, but also to Rapoport's Rule, because the direction of gradient in which biotic factors appear to limit distributions is the direction in which sizes of the ranges of species decrease and the numbers of other species increase (85) .\nA second general feature of many range boundaries is that they are extremely dynamic. While some boundaries such as those corresponding to coastlines and other major, relatively permanent geographic features may appear to remain relatively constant, other boundaries are constantly shifting (see examples in 12, 38, 53) . All kinds of patterns can be observed. Some species ranges have expanded along one or more boundaries, while others have contracted, and still others have shifted back and forth. Probably the best documentation of range boundary shifts is available at two contrasting spatial scales. On the one hand, the recent fossil record documents many range shifts that accompanied the global changes in glacial geology, climate, and vegetation during the Pleistocene, and especially within the last 10,000 years following the retreat of the last continental ice sheets and the development of an interglacial climatic regime (18, 23, 27, 42) . On the other hand, museum collections and ecological surveys document many range shifts within the last two or three centuries, most undoubtedly caused in part by human activities (1, 17, 26, 29, 43, 52, 53, 62, 67, 86, 88, 89, 91) .\nBoth the fossil and the written record document several kinds of range shifts. One is the relatively gradual, incremental expansion or contraction of the distribution along an existing range boundary. Another involves the long-distance dispersal of one or a few individuals across a \"biogeographic barrier\" to found a new and isolated population. Alternatively, the formation of a barrier may break up a once continuous distribution and create isolated, disjunct populations. Biogeographers refer to these latter two kinds of range changes, which involve either the crossing or formation of barriers, as dispersal and vicariant events, respectively. Finally, there are collapses of ranges: rapid contractions of once widespread species to one or a small number of isolated sites. At least at the extremes, the large changes that result in populations isolated by barriers after long-distance dispersal or range collapse are distinct from the incremental expansions and contractions that occur around the edges of the range."}, {"section_title": "INTERNAL STRUCTURE OF THE RANGE", "text": ""}, {"section_title": "THE ROLE OF HISTORY", "text": "Except for some introductory comments on phylogeny, no mention of history has appeared in this review. Brown (1 1) has pointed out that the word \"history\" is used in two different and sometimes confusing ways by biogeographers, ecologists, and evolutionary biologists. There is the history of place: the changes in geology, climate, and other environmental factors that are extrinsic to particular kinds of organisms. Then there is the history of lineage: the changes in the intrinsic characteristics of organisms that have been inherited from their ancestors. The history of place is not usually affected by the history of lineage (although some kinds of organisms do substantially alter the environment for themselves and for other organisms). The history of lineage, however, is profoundly influenced by the history of place, because the intrinsic characteristics of organisms were molded in part by interactions with past environments.\nMany characteristics of species and multispecies clades, including the size, shape, boundaries, and internal structures of their geographic ranges, reflect the influences of both the history of place and the history of lineage. The characteristics of past environments have acted as selective agents to influence the environmental requirements and tolerances, and the demographic, life history, and dispersal characteristics of contemporary organisms, and these characteristics in turn affect the geographic range. The history of place has also influenced past colonization, speciation, and extinction events in ways that may affect present geographic distributions, for example through changes in the kind, location, and severity of barriers to dispersal. The complex, interacting influences of the histories of place and lineage on characteristics of geographic ranges is a fertile area for research. Unfortunately, limited space and expertise preclude a more thorough treatment here.\nWe believe that the apparent division between \"ecological\" and \"historical\" biogeography inhibits a thorough, synthetic understanding of the patterns of distribution and the contemporary and historical processes that have produced them. Too often ecological biogeographers have ignored the influences of past environments and phylogenetic constraints on current distributions. We are guilty of this to some extent in this review. Too often historical biogeographers have focused so exclusively on phylogenetic history that they have ignored the influence of past and present environments. Too often both ecological and phylogenetic biogeographers have ignored the insights into past distributions and environments that can only come from studies of the fossil record. There are, however, encouraging signs of the emergence of a synthetic perspective that incorporates information from phylogenetic reconstructions, the fossil record, and ecological studies to provide a more complete understanding of the processes that have shaped geographic distributions (76, 90) ."}, {"section_title": "CONCLUSION", "text": "Although the geographic range of a species has always been a basic unit of biogeographic research, only recently has a synthetic view of the range begun to emerge. This view is largely owing to the revitalization of biogeography as a modern quantitative science, with a rigorous empirical and theoretical basis. It has been facilitated by the accumulation of large quantitative data bases, the development of computer software for statistical and spatially explicit analyses, and advances in mathematical and computer simulation modeling. These advances have not only made available many data on the spatial distributions of organisms, they have also contributed to the discovery of empirical patterns in the characteristics of species ranges and their relationships with other variables.\nThe discovery of quantitative patterns in the characteristics of ranges has led inevitably to the search for the causal processes and the development and testing of hypotheses about the mechanisms. While there is much more to be learned about the patterns and especially about the processes, a synthesis is emerging. The geographic range is the manifestation of complex interactions between the intrinsic characteristics of organisms-especially their environmental tolerances, resource requirements, and life history, demographic, and dispersal attributes-and the characteristics of their extrinsic environment-in particular those features whose variation in space and time limit distribution and abundance. The consequences of these interactions influence all characteristics of geographic ranges: their sizes, shapes, boundaries, and internal structures.\nWe conclude by emphasizing two major areas of research where quantitative studies of geographic ranges have the potential to make a major contribution that will extend beyond biogeography and result in wide interdisciplinary influence. One contribution will be to a synthesis between the earth sciences and the biological sciences. The geographic ranges of organisms provide a wealth of information on the complex relationships between the physical environment of the earth and the biological characteristics of the organisms that live on the earth-and between earth history and the history of life. The other contribution will be to a synthesis between biogeography and the other basic and applied biological sciences concerned with biodiversity. The present and past relationships of the geographic ranges of species to the environment, both abiotic conditions and other organisms, provide insights into the fundamental processes that determine distribution, abundance, and ultimately diversity. There are intriguing patterns in the sizes, shapes, and boundaries of ranges in relation to the latitudinal and other geographic gradients of species diversity. Further study of these relationships should contribute both to increased understanding of the processes that generate and maintain diversity and to practical efforts to conserve biodiversity."}]