[{"section_title": "Abstract", "text": "Cigarette addiction is driven partly by the physiological effects of nicotine, but also by the distinctive 33 sensory and behavioural aspects of smoking, and understanding the neural effects of such processes 34 is vital. There are many practical difficulties associated with subjects smoking in the modern 35 neuroscientific laboratory environment, however electronic cigarettes obviate many of these issues, 36\nand provide a close simulation of smoking tobacco cigarettes. We have examined the neural effects 37 of 'smoking' electronic cigarettes with concurrent functional Magnetic Resonance Imaging (fMRI). 38\nThe results demonstrate the feasibility of using these devices in the MRI environment, and show 39 brain activation in a network of cortical (motor cortex, insula, cingulate, amygdala) and sub-cortical 40 (putamen, thalamus, globus pallidus, cerebellum) regions. Concomitant relative deactivations were 41 seen in the ventral striatum and orbitofrontal cortex. These results reveal the brain processes 42 involved in (simulated) smoking for the first time, and validate a novel approach to the study of 43 smoking, and addiction more generally. 44 "}, {"section_title": "Introduction 46", "text": "Smoking is a major worldwide health problem, and current treatments for cigarette addiction are 47 only partly effective. The behavioural and sensory aspects of smoking are thought to be important 48 aspects of cigarette addiction, independently of the effects of nicotine (Rose, 2006; Balfour, 2004) . 49 Aspects of the multi-sensory (visual, tactile, olfactory, taste) experience of smoking can act as a 50 powerful cue that reliably triggers craving and withdrawal symptoms in smoking addicts (Niaura et 51 al., 1998) . This is consistent with the incentive-sensitization theory of addiction (Robinson & 52 Berridge, 1993; 2001) , which proposes that neutral stimuli can promote drug-seeking behaviour 53 through association with drug effects, and that this is mediated through sensitization of particular 54 brain systems, principally the ventral striatum. 55\nResearch on the neural effects of smoking addiction has generally followed two largely independent 56 paths. One has been concerned with the neurophysiological effects of nicotine and has generally 57 used alternative routes of administration (intravenous, cutaneous patch, oral; e.g. Stein to index dopamine release. The latter study showed that smoking-related changes in euphoria were 68 related to dopamine release in the caudate and putamen, though not in the ventral striatum. 69 Domino et al. (2013) used regular and denicotinized cigarettes to examine dopamine release; both 70 showed effects on dopamine throughout the striatum, but the denicotinized cigarettes led to 71 significantly less dopamine release. Cosgrove et al. (2014) Verio MRI scanner (Siemens Healthcare, Erlangen Germany). Imaging consisted of a gradient-echo 129 sequence; TR = 300 ms, TE 1 = 5.19 ms, TE 2 = 7.65 ms, flip angle = 60°, 1.5 x 1.5 x 2 mm voxels, 35 130 axial slices, bandwidth = 1520 Hz/pixel at two echo times: 1.93 and 4.39ms. A phase difference 131 image between the two echo times was used to characterize the disturbance to the magnetic field 132 (B0) from each ENDS. A spin-echo sequence was used to characterize disturbances to the applied RF 133 (B1) field; TR = 5s, TE=8.5ms, 1.2 x 1.2 x 3.5mm voxels, 40 axial and coronal slices, bandwidth = 134 800Hz/pixel. 135\nSubsequently, one subject (Author MBW) completed a scan using each of the five brands in a similar 136 manner to the subjects in the main experiment (described below). These scans used a dual-echo, 137 echo-planar imaging (EPI) sequence for BOLD contrast with 36 axial slices, aligned with the AC-PC 138 axis (TR = 2000 ms, TE1 = 13 ms, TE2 = 31 ms flip angle = 80°, 3 mm isotropic voxels, parallel imaging 139 factor = 2, bandwidth = 2298 Hz/pixel). The ENDS devices were therefore assessed for general 140 magnetic susceptibility, and in particular for their potential to generate artefacts when used by a 141 subject during a BOLD EPI acquisition. 142"}, {"section_title": "Subjects", "text": ""}, {"section_title": "143", "text": "Subjects were 11 (3 females) daily or semi-regular social smokers, who were in good general health. 144\nOne (male) subject was subsequently excluded from analysis because of excessive (> 5 mm) head 145 movement and failure to comply with the task, which left a final group of 10 (mean age of 29.1 146 years; SD = 5.91). The mean number of cigarettes smoked daily for this group was 10.1 (SD = 5.6). 147\nSubjects were not asked to abstain from smoking on the day of the scan, and were therefore not in a 148 nicotine-deprived state. 149\nTasks and scanning procedure 150\nData were acquired on a Siemens 3T Magnetom Trio MRI scanner (Siemens Healthcare, Erlangen, 151\nGermany), equipped with a 32-channel phased-array head coil. Subjects held the ENDS in their right-152 hand, with the right elbow cushioned so that they could comfortably hold it on their chest, close to 153 their mouth, in order to minimise the hand movement required on each trial. Subjects could view a 154 back-projected image on a screen in the rear of the scanner bore via a mirror mounted on the head-155 coil. They were instructed to try to avoid looking down (e.g. along the scanner bore, towards the 156 ENDS) as they inhaled, in order to counteract the natural tendency to nod the head forward slightly 157 when looking down. 158\nBased on the results of the initial testing (see results section) the 'Njoy' device was selected as a 159 good candidate device for use in the main experiment. A fresh ENDS was used for each subject, and 160 the only modification made was the removal of the plastic end cap covering the LED. This was 161 required in order to provide higher light output and a better signal for the opto-electronic recording 162 device. The optical fibre was attached to the end of the ENDS by a rubber connector, and remained 163 in place throughout the scan. The output of the device was recorded by a standard analogue-to-164 digital recording system (PowerLab 8/35, AD Instruments, Oxford UK), and physiological parameters 165 (respiration via a respiratory belt around the subjects' chest, and cardiac data via a pulse-oximeter 166 on the index finger of the left hand) were recorded on the same system. 167\nAt the beginning of the scan session high-resolution T1-weighted anatomical images were acquired 168 using a magnetization prepared rapid gradient echo (MPRAGE) sequence with parameters from the 169 Alzheimer's Disease Research Network (ADNI; 160 slices x 240 x 256, TR = 2300 ms, TE = 2.98 ms, flip 170 angle = 9°, 1 mm isotropic voxels, bandwidth = 240Hz/pixel, parallel imaging factor = 2; Jack et al., 171\n2008) along with B0 field-map images (sequence as described above). Subjects then completed two 172 functional scans (sequence as described above) of ten minutes duration each. The first was the cued 173 smoking task that consisted of 20 trials with inter-trial intervals that varied randomly between 20, 174 25, and 30 seconds (mean = 25s). On each trial, a three second countdown (3, 2, 1) was displayed in 175 the centre of the screen, followed by the word 'SMOKE', displayed for two seconds. A fixation cross 176 was present throughout the inter-trial interval. Participants were instructed to time their inhalations 177 on the ENDS to coincide with the 'SMOKE' cue. The second task was the naturalistic smoking task, 178 where there were no visual cues, and subjects were instructed to smoke 'naturally' throughout the 179 ten minute scan. 180"}, {"section_title": "Data analysis 181", "text": "All analysis was conducted using FSL (Smith et "}, {"section_title": "Results", "text": ""}, {"section_title": "213", "text": ""}, {"section_title": "ENDS MR compatibility 214", "text": "None of the five ENDS contained ferromagnetic components such as might experience torque inside 215 the magnetic field, however, two were found to have metallic bodies upon disassembly (see table 1 ). 216\nWhile no large torques would be expected, eddy currents will be induced in the conductive body 217 from the MRI's RF activity (Schenk, 1996) . These eddy currents generate unwanted counter-acting 218 magnetic fields as seen in supplementary figure 2, and may pose a safety risk from heating of the 219 conductor. Further, most metals have a magnetic susceptibility, χ, far enough (> 10 -5 ) from the χ of 220 water that image distortion is expected. While an aluminium body would have a modest effect, 221 nickel or stainless steel would create large image distortions. If the ENDS could be used parallel to 222 the main magnetic field B0, the cylinder-shaped body would not perturb B0 outside the ENDS. 223\nHowever, when used normally the ENDS would be transverse to the main magnetic field; resulting in 224 a dipole perturbation in cylindrical coordinates (ρ, φ) of\n. These 225 characteristic dipole patterns are illustrated in supplementary figure 1. 226\nThe MRI environment had no apparent effect on the operation of any of the tested ENDS devices. 227\nThe magnetic susceptibility artefacts produced by the different devices varied widely (see 228 supplementary figure 2 for high and low-susceptibility examples). Unsurprisingly, the larger devices 229 with metal construction produced the most detrimental effects, but even the smaller devices 230 produced some areas of signal loss on the MRI phantom images. However, the smaller devices 231 produced no obvious image artefacts in the test with a human subject, suggesting that they would 232 be suitable for use in the main experiment. 233"}, {"section_title": "234", "text": ""}, {"section_title": "Task Results 235", "text": "In the main study, figure 1 illustrates the resulting pattern of brain activity that occurred in the cued-236 smoking task, time-locked to the smoking events. Large activation clusters are seen in the dorsal 237 motor cortex in the left hemisphere, consistent with movements of the right hand during smoking 238 trials. More lateral motor activity likely represents oro-facial movements on smoking trials. Other 239 cortical regions strongly activated were the mid-insula, the amygdala, and the (dorsal) anterior 240 cingulate gyrus. Strong activation of sub-cortical regions is also seen, principally in the thalamus, 241 globus pallidus, and putamen. Relative deactivations associated with smoking events were also seen 242 in a large region encompassing parts of the ventral striatum (nucleus accumbens and ventral 243 caudate) and extending forward into orbitofrontal cortex. An additional area of deactivation was 244 also seen in more dorsal frontal cortex. "}, {"section_title": "275", "text": "Discussion 276\nThese data demonstrate the feasibility of using ENDS in the MRI environment, and reveal the neural 277 correlates of (simulated) smoking for the first time. A wide network of activated areas included 278 cortical (motor cortex, insula, cingulate, amygdala) and sub-cortical (thalamus, putamen, globus 279 pallidus, cerebellum) regions, with corresponding significant deactivations in ventral striatum and 280 orbitofrontal cortex. 281\nThe most prominent result is the activation in left motor cortex which can plausibly be attributed to 282 hand and oro-facial movements associated with the smoking task. The activation clusters in the right 283 cerebellum are also most plausibly related to the motor components of the task. While certainly part 284 of the behavioural repertoire of smoking, these results are unsurprising, and will not be discussed 285\nfurther. Of more interest are the results in other regions, particularly the thalamus and striatum. 286\nPrevious work has identified differences in dopamine release in the caudate and putamen in 287 smokers vs. non-smokers (Takahashi et al., 2008) , and the striatum is widely considered to be a key 288 set of brain structures that support addiction ( recently showed that the connectivity of the orbitofrontal cortex was highly related to subjective 298 craving measures. The current findings are consistent with the established role of the ventral 299 striatum and frontal cortex in drug craving, and further suggest that activity in these areas is actually 300 reduced during active drug consumption, with the rewarding aspect of consumption mediated by 301 more dorsal striatal regions. The results are also highly consistent with the previous PET study by 302 Berridge et al. (2010) which showed smoking-related euphoria was related to dopamine release in 303 the dorsal, but not ventral, striatum. The general activation pattern involving the brain's reward 304 circuitry also implies that use of ENDS may have a similar rewarding effect as traditional cigarettes. 305\nIt is important to note that the current data say relatively little about the neural effects of nicotine. 306\nAlthough the ENDS used contained nicotine, the modelling of the brain response was time-locked to 307 the action of smoking. Nicotine (absorbed into the blood through the vapour produced by the ENDS) 308 is likely to only enter the brain between 5 and 20 seconds after each inhalation (Berridge et al., 309 2010) , and modelling this effect within a conventional fMRI design would be difficult, since the 310 timing of the nicotine 'hit' after each trial is somewhat uncertain. There is a large literature on 311 nicotine and its pure pharmacological effects are relatively well understood (e.g. Stein et al., 1998; 312 Yamamoto, Rohan & Goletiani, 2013) . The current data stand as complementary to this literature, 313\nand provide a visualisation of brain processes related to the consumption of nicotine in a relatively 314 naturalistic manner. 315\nResults from the cued task were robust, while results from the naturalistic task were noticeably 316 muted in comparison. There are several plausible explanations for this finding. Firstly in the 317 naturalistic study the number of smoking events varied across subjects (mean = 28.8, SD = 15.4) and 318 this produced more between-subject variance in the data. Secondly, the timing of events in the 319 naturalistic study was determined by the subjects, and therefore did not necessarily conform to 320 optimal principles of fMRI experimental design (Friston et al., 1999; Dale, 1999) ; this could affect the 321 signal-detection power of the experiment. Thirdly, the naturalistic scan was always conducted after 322 the cued scan and subjects were possibly nicotine-sated in the latter scan, leading to less activation 323 in the striatal (i.e. more reward-related) regions. Fourth, the task demands of each scan were quite 324 different, with one requiring active focus and attention on the external cue task, while the other did 325 not. One other aspect of the design deserves comment, which is the use of a purely baseline control 326 condition in both tasks. In this initial study we were concerned with demonstrating the technical 327 feasibility of using ENDS in this way, but also with visualising the neural correlates of the entire 328 behavioural and sensory repertoire of smoking. The comparison of 'smoking' with 'not smoking' 329\n(that is, a resting baseline) provides this. Future work may be concerned with dissecting the various 330 components of the response using appropriate control conditions. For instance, sham-smoking with 331 a non-functional device may be a useful control condition for subtracting out the motor aspects of 332 the response. 333\nFuture work using similar methods may also be focussed on optimising the equipment, procedure, 334 and analysis strategy. The market for electronic cigarettes has shown explosive growth in recent 335 years, and new products are being launched almost on a daily basis. The first generation 'cig-a-like' 336 devices used here are designed to mimic traditional cigarettes, and this visual mimicry may be 337 helpful in reducing withdrawal symptoms (Dawkins et al., 2015 plastic construction and use non-magnetic Lithium polymer or 'LiPo' batteries) are probably the best 344 current option for this kind of work. The other useful feature of these devices is the end-mounted 345 LED, which allows for easy monitoring of task compliance, with the simple device used here. 346\nAlternative analysis strategies for studies of this type may be focussed on visualising the trial-by-trial 347 effect of nicotine on the brain, or the cumulative effect over the course of the experiment. This 348 would be difficult because of the reasons mentioned above, but is perhaps feasible using a more 349 flexible statistical model, or model-free analysis approaches such as Independent Components 350 Analysis (ICA). 351\nThis demonstration of the feasibility of using ENDS in the MRI environment has served to validate an 352 entirely novel approach to the study of cigarette dependence, and the more general brain 353 mechanisms of addiction. We have also revealed for the first time the full neural effects of active 354 (simulated) smoking, which includes activation in a network of cortical (motor, insula, cingulate, 355 amygdala) and sub-cortical (putamen, thalamus) regions, with relative deactivation in ventral 356 striatum and orbitofrontal cortex. Together with previous work on nicotine, and cue-reactivity in 357 smokers, these findings provide a more complete picture of the neural effects associated with 358 cigarette smoking, and addiction in general. "}]