[{"section_title": "", "text": "analyze the behaviors and outcomes of the student sample. The teacher survey instrument was administered to one mathematics or science teacher of second follow-up sample members enrolled in mathematics or science in a NELS:88 sampled school. It collected teacher evaluations of student characteristics, and performance and curricular information. Parts 1, 2, 3, and 4 contain an overview of the study, descriptions of data collection instruments and processes, and a review of sample design and weighting. Parts 5 and 6 describe data control, preparation, and processing. Chapter 7, and Appendix D, contain the information necessary to use the file. In all, there are 10 appendixes with supplemental information. Fourteen tables and 12 figures present some study data. (SLD) *********************************************************************** * Reproductions supplied by EDRS are the best that car be made * * from the original document. Introduction This manual provides guidance and documentation for users of the public release data for the teacher component of the National Education Longitudinal Study of 1988 (NELS :88). Information about the purpose of the study, the data collection instruments, sample design, data collection, and data processing procedures is presented in this manual."}, {"section_title": "1.1", "text": "The NELS:88 Second Follow-Up Teacher Survey The NELS:88 teacher component was designed to provide teacher information that could be used to analyze the behaviors and outcomes of the student sample. The teacher survey instrument was administered to one mathematics or science teacher of second follow-up sample members enrolled in mathematics or science in a NELS:88 sampled school. The questionnaire elicited teacher evaluations of student characteristics, performance in the classroom, and curricular information about the classes taught to sample members. It also collected background information about the teachers and their schools, including both teacher demographic and professional characteristics, information about teachers' school activities, such as parent-teacher and teacher-school interactions, and perceptions of school climate and culture."}, {"section_title": "1.2", "text": "The Second Follow-Up Teacher Sample The teacher survey attempted to collect one mathematics or science teacher report for each sampled student enrolled in a mathematics or science course in a NELS:88 sampled school; teachers of NELS:88 students who were not enrolled in one of the NELS:88 schools were not eligible for the teacher survey. Because the subject area of the teacher report was either mathematics or science, the student needed to be enrolled in one of these subject areas to be eligible for a teacher report. In the base year teacher survey, either a mathematics or science teacher reported on each student. Students enrolled in only one class, mathematics or science, were eligible for the one teacher report, regardless of the subject area of their base year teacher report. For students in the second follow-up who were enrolled in both mathematics and science, either a mathematics or science teacher was surveyed depending on the student's base year subject area assignment. Although the student sample constitutes a nationally representative cross-section of 1992 twelfthgrade students, the NELS:88 teacher sample does not constitute a nationally representative sample of twelfth-grade teachers alone. The teacher sample was entirely student driven. Each teacher's appearance in the sample depended upon his or her linkage to a sampled student who chose to participate in the NELS:88 second follow-up, and not all students were enrolled in schools in which the teacher survey was conducted. Additionally, the sample does not constitute a representative sample of teachers even in the two subject areas to which the teacher study was restricted. Unlike the base year, in which the school sample constituted a representative sample of all eighth-grade schools in the nation in 1988, the second follow-up school sample was determined by the dispersior patterns of base year and first follow-up sample members to twelfth-grade schools, and does not constitute a national probability sample of schools. Even if all the teachers in the two subject areas in the NELS :88 schools had been included, the population from which NELS :88 teachers were selected would not have been representative of all twelfth-grade teachers in the nation. Although it is possible to create teacher-level and course-level data sets using the second fellowup teacher data, they are not valid probability samples and no statistical weight has been provided for this level of analysis. However, the NELS:88 second follow-up contextual weight adjusts the teacher data 13 1 Fl: Teacher Component Data File User's Manual used in conjunction with the student data such that it provides, for example, nationally representative samples of both seniors and 1988 eighth graders enrolled in math or science courses in 1992."}, {"section_title": "1.3", "text": ""}, {"section_title": "Structure of the Teacher Data File", "text": "The teacher data file is organized at the level of student-teacher pairs. Data from 5,657 teachers :inked to 15,695 students are contained in the teacher file. This file also contains student information, class information, and teacher background information. An identification code permits linkage to other files (see Chapter VII for instructions for making this link). Further details of the file structure for the teacher survey are provided in Chapter VI. Because the second follow-up teacher data cannot be used to make generalizations to the population of twelfth-grade teachers, teacher weights have not been provided on the teacher data file. However, because the NELS :88 teachers are, essentially, informants on NELS:88 students, the contextual student weight available on the teacher file can be used in conjunction with the teacher data when students are employed as the central unit of analysis and their teachers as a source of contextual data. Weighted frequencies in the codebook to this user's manual reflect use of the second follow-up contextual weight, F2CXTWT, with the teacher data."}, {"section_title": "1.4", "text": "Organization of the Data User's Manuals NELS:88 data sets have been produced in both public use and restricted use form. The public use data files reflect alteration or supprersion of some of the original data imposed to minimize the risk of statistical disclosure of the identity of responding individuals and institutions. The restricted use files preserve the original data free of all confidentiality e3its. Data files with high disclosure potential, specifically the transcript file and the school effectiveness study file, are available in restricted form only. This manual may be utilized with both the public use and restricted use data files. Variables that were modified or suppressed on the public use files, but appear on the restricted use version of the data, are included in the codebook in their modified public use form. A more detailed discussion of measures used to preserve respondent confidentiality, and of procedures for gaining access to restricted use data, may be found in section 1.8 of this manual. In addition to documentation for the restricted use transcript and school effectiveness study data files, five manuals have been produced for the NELS:88 second follow-up, one to accompany each of the five public release files: student, dropout, parent, teacher, and school. Each manual furnishes the user with information and documentation about NELS:F.i8 and the specific public release data file. While this manual intended for use with the second follow-up teacher component data, a data file user's manual was also produced and released to accompany each of the four public release data files of the base year and each of the four public reicase data files in the first follow-up surveys. Information on these publications and other documentation for NELS:88 is discussed in section 1.8 of this manual."}, {"section_title": "Overview", "text": ""}, {"section_title": "NCES's National Education Longitudinal Studies Program", "text": "The U.S. Department of Education's Natiou,_ Center for Education Statistics (NCES) is mandated to \"collect and disseminate statistics and other data related to education in the United States\" and to \"conduct and publish reports on specific analyses of the meaning and significance of such statistics\" 2 14 The four NELS program cohorts (NLS-72 seniors, the HS&B sophomores and seniors, and NELS:88 eighth graders) are displayed in Figure 1-2 according to their initial and subsequent survey years and their modal age at the time of each survey. As illustrated, NLS-72 seniors were first surveyed in 1972 at age eighteen and have been resurveyed five times since, with the last survey occurring in 1986, when these respondents were about thirty-two years of age. The HS&B cohorts have been surveyed at points in time that would permit as much comparison as possible with the time points selected for NLS-72. NELS:88 is designed to fit into this larger analytical scheme. The NELS:88 first follow-up sophomore class of 1990 parallels the HS&B sophomore class of 1980; similarly, the second follow-up senior class of 1992 will parallel the 1980and 1982HS&B, and 1972 The National Education Longitudinal Study of 1988 (NELS:88): Overview The base year of the National Education Longitudinal Study of 1988 (NELS:88) represented the first stage of a major longitudinal effort designed to provide trend data about critical transitions experienced by students as they leave elementary school and progress through high school and into postsecondary institutions or the work force. This study of the 1988 eighth-grade cohort collects data about educational processes and outcomes pertaining to student learning, predictors of dropping out, and the effects of schools on students' access to programs and equal opportunity to learn. The first follow-up in 1990 provided the first opportunity for longitudinal measurement of the 1988 baseline sample. It also provided a comparison point to high school sophomores ten years before, as studied in HS&B. The study captured the population of early dropouts (those who leave school between the end of eighth grade and the end of tenth grade), while monitoring the transition of the student population into secondary schooling. Freshening the NELS:88 sample to represent the tenth-grade class for 1990 makes trend comparisons with the HS&B sophomore cohort possible. The second follow-up took place in 1992, when most sample members entered the second term of their senior year. The second follow-up provides a culminating measurement of learning in the course of secondary school, and also collects information that will facilitate investigation of the transition into the labor force and postsecondary education after high school. Freshening the NELS:88 sample to represent the twelfth-grade class of 1992 makes trend comparisons with the senior cohorts that were studied in NLS-72 and HS&B possible.' The NELS:88 second follow-up resurveyed students who were identified as dropouts in 1990, and identified and surveyed those additional students who left school after the first follow-up. The third follow-up is occurring in 1994, when most sample members will be in postsecondary education or in the labor market. The Goals of the 1994 round are to provide data for trend comparisons Note, however, that the HS&B 1980 sophomore cohort in 1982 does not strictly constitute a representative sample of the nation's 1982 seniors, but rather a representative sample of 1980 sophomores two years later. Because of the sample freshening that took place in NELS:88 (but not in HS&B), the subset of NELS:88 sample members who were high school seniors in the spring of 1992 are nationally representative of seniors and are comparable to the NLS-72 and HS&B 1980 probability samples of twelfth graders."}, {"section_title": "2", "text": "The process referred to here as freshening added students who were not in the base year sarnpling frame, either because they were not in the country or because they were not in eighth grade in the spring term of 1988. The 1990 freshening process provided a representative sample of students err fled in tenth grade in the spring of 1990. The 1992 freshening process provided a representative sample of students enrolled in twelfth grade in the spring of 1992.  with NLS-72 and HS&B, and to continue cross-wave comparisons with previous NELS:88 rounds. The third follow-up will permit researchers to assess the effect of eighth-grade and high school curricular experiences on postsecondary education choice. The third follow-up will provide the means by which access of individuals with different backgrounds to quality educational institutions can be examined. The third follow-up will facilitate study of the influences of high school education experiences on postsecondary education and employment opportunities and choices. Labor force participation, postsecondary persistence, curricular progress, and family formation are further research topics which will be explored by the third follow-up. Additionally, the third follow-up will provide a basis for assessing how many dropouts have returned to school and by what route, and will measure the access of dropouts to vocational training programs and to other postsecondary institutions. A fourth follow-up will take place in 1997 or 1998.\nIn addition to the NLS-72 and HS&B postsecondary transcripts files available within the NELS program, postsecondary transcripts are also available for 1985-86 and 1989-90 college graduates, through the NCES 1987 and 1991 Recent College Graduates Transcript Studies. Transcripts will also be collected for college graduates surveyed in 1994 as part of the NCES Baccalaureate and Beyond study. A-2 1 1 :3 F2: Teacher Component Data File User's Manual described below. Users manuals or other forms of documentation are available from NCES for all the data files. These auxiliary data files greatly expand the analytic capabilities of the core data sets, and researchers are encouraged to become familiar with them."}, {"section_title": "NELS:88 Study Objectives", "text": "NELS:88's major features include the integration of student, dropout, school, parent, and teacher studies; the initial concentration on an eighth-grade student cohort with follow-up at two year intervals; the inclusion of supplementary components to support analyses of geographically or demographically distinct subgroups; and the design linkages to previous longitudinal studies and other current studies. Multiple research and policy objectives are addressed through the NELS:88 design. The study is intended to produce a general purpose data set for the development and evaluation of federal educational policy. Part of its aim is to inform decision makers, education practitioners, and parents about the changes in the operation of the educational system over time, and the effects of various elements of the system on the lives of the individuals who pass through it. Specifically, NELS:88 focuses on a number of interrelated policy issues including: identification of school attributes associated with achievement; the transition of different types of students from eighth grade to secondary school; the transition of secondary students to postsecondary education or the work force; the influence of ability grouping and program type on future educational experiences and achievements; determinants of students' dropping out of the educational system; and changes in educational practices over time. One of the defining features of NELS:88 is the extensive attention it gives to the role of parents. The second followup parent survey (the parent survey was also conducted in 1988) gathered data on the effect of parents' attitudes and behaviors on educational or career choices, financial preparation for postsecondary education, the correlates of active parental involvement in the school, and the parent's role in the educational success of their children. Appendix C provides an overview of some of the key policy issues of education research and the second follow-up student, dropout, and teacher items which are related to them. The NELS:88 design enables researchers to conduct analyses on three principal levels: crosswave, cross-sectional at a single time point, and cross-cohort by comparing NELS:88 findings to those of HS&B and NLS-72. The first of these levels provides NELS:88 with its primary objective: to serve the purposes of longitudinal measurement. The sampling and data collection designs give priority to maintaining and surveying a substantial number of base year sample members, as well as sustaining overlopping but analytically distinct cohorts of sophomores and seniors.' Users of NELS :88 data will be able to study the effect of a wide variety of factors on students' educational and professional attainment. The longitudinal data gathered from students, and augmented through parent, teacher, school administrator, and school record (for example, academic transcripts) accounts of students' progression The second analytic level within NELS:88 is cross-sectional. By beginning with a cross-section of 1988 eighth graders, following a substantial subsample of these students at two-year intervals, and freshening the 1990 and 1992 samples to obtain representative national cross-sections of tenth and twelfth graders, the study also provides a statistical profile of America's eighth graders, high school sophomores, and high school seniors. Finally, NELS:88 has been designed to provide researchers with data for drawing comparisons with previous NCES longitudinal studies. After the release of NELS:88 first follow-up data, researchers were able to conduct trend analyses with the 1980 sophomore cohort of HS&B. With completion of the NELS:88 second follow-up, comparisons may be made among NELS:88, HS&B, and NLS-72 senior cohorts. To facilitate cross-cohort comparisons, many of the content areas contained in the HS&B base year survey were repeated in each wave of NELS:88, and data processing and file conventions have been kept consistent, to the maximum extent feasible, with HS&B and NLS-72. For users specifically interested in conducting trend analyses of NLS-72, HS&B and NELS:88 data, further information on content and design similarities and differences between these three studies is presented in Appendix D of the NELS:88 Second Follow-Up: Student Component Data File User's Manual."}, {"section_title": "Base Year Study and Sample Design", "text": "The base year study design comprised four components: surveys and tests of students, and surveys of school administrators, parents, and teachers. A student questionnaire gathered information about basic background variables and a range of other topics including school work, educational and occupational aspirations, and social relationships. Students also completed a series of curriculum-sensitive cognitive tests to measure educational achievement and cognitive growth between eighth and twelfth grades in four subject areas--reading, mathematics, science, and social studies (history/government). A school administrator questionnaire was completed by school principals or headmasters. It gathered descriptive information about the school's teaching staff, the school climate, characteristics of the student body, and school policies and programs. One parent of each student was asked to respond to a parent survey intended to measure parental aspirations for children, family willingness to commit resources to children's education, the home educational support system, and other family characteristics relevant to achievement. Finally, selected teachers in two of the four subject areas completed a teacher questionnaire designed to collect data about school and teacher characteristics, evaluations of the selected students, course content, and classroom teaching practices. In the NELS:88 base year, a two-stage stratified probability design was used to select a nationally representative sample of eighth-grade schools and students. Schools constituted the primary sampling unit; the target sample size for schools was 1,032. A pool of 1,03z schools was selected through stratified sampling with probability of selection proportional to eighth-grade size and with oversampling of private schools. A pool of 1,032 replacement schools was selected by the same method. Of the 1,032 initial selections, 30 proved to be ineligible. Of the 1,002 eligible selections, 698 participated. An additional 359 schools (supplied by alternative selections available from the replacement pool) also participated, for a total school sample of 1,057 cooperating schools, of which 1,052 schools (815 public schools and 237 private schools) contributed usable student data. For 1,035 of these 1,052 schools, both student and school administrator data were received. In the NELS:88 base year design, students were the secondary sampling unit. Tne second stage--student sampling --produced a random selection of 26,432 F2: Teacher Component Data File User's Manual students among participating sampled schools, resulting in participation by 24,599 spring term 1988 eighth graders.' On average, each of the participating schools was represented by 23 student participants. Additional information about the base year sample design is provided in the NELS:88 Base Year Sample Design Report.' Figure 1-3 lists the NELS:88 survey components, instruments, and modal grades for the base year, first follow-up, and second follow-up."}, {"section_title": "First Follow-Up Core Study and Sample Design", "text": "The first follow-up of NELS:88 comprised the same components as the base year study, with the exception of the parent survey, which was not repeated in the 1990 round. In addition, three new components--the dropout study, base year ineligible study, and school effectiveness study--were initiated in the first follow-up, and a freshened sample was added to the student component. As in the base year, students were asked to complete a questionnaire and cognitive test. The cognitive test was designed to measure tenth-grade achievement and cognitive growth between 1988 and 1990 in the subject areas of mathematics, science, reading, and social studies (history /geography /civics). The student questionnaire collected basic background information, and asked students about such topics as their school and home environments, participation in classes and extra-curricular activities, current jobs, their goals and aspirations, and opinions about themselves. Following the base year design, a school questionnaire was completed by school principals, and two teachers of each student were asked to complete a teacher questionnaire. First-time participants in NELS:88 completed a new student supplement, containing basic demographic items which were asked in the base year but not repeated in the first follow-up. The first follow-up also surveyed and tested youths who had dropped out of school at some point between the spring term of the 1987-88 school year and the spring term of the 1989-90 school year. The dropout questionnaire collected information on a wide range of subjects, including reasons for leaving school, school experiences, absenteeism, family formation, plans for the future, employment, attitudes and selfconcept, and home environment. The selection of students in the first follow-up was implemented in two stages. The first stage of sampling involved the selection of 21,474 students in the eighth-grade NELS:88 sample in 1988.8 Because some sophomores in 1990 were not in the country or were not in the eighth grade in the spring term of 1988, the representative subsample of the eighth-grade cohort was augmented through a process called freshening. The goal was to provide a representative sample of students enrolled in the tenth grade in the 1989-90 school year. Freshening added 1,229 tenth graders (of whom 1,043 were found to be eligible and retained after final subsampling) who were not contained in the base year sampling frame. Several components were added to the first follow-up to increase its analytic power. One of these enhancements, the base year ineligible (BYI) study, was added to the first follow-up in order to ascertain the 1990 school enrollment status and the 1990 NELS:88 eligibility status of students who were excluded from the base year survey due to a language barrier or physical or mental disability which precluded them 4 The sample size of 26,435 cited in the NELS:88 Base Year Student Component Data Filo User's Manual is a typographical error.  from completing a questionnaire and cognitive test. Any eligible students were included in both the first and second follow-up. In addition to the BYI study, the school effectiveness study (SES), designed to sustain analyses of school effectiveness issues, was conducted in conjunction with the first follow-up. The within-school student sample of 251 participating first follow-up high schools in the thirty largest metropolitan statistical areas was augmented to produce a probability sample of both schools and students within the framework of the primary longitudinal study."}, {"section_title": "Second Follow-Up Core Study and Sample Design", "text": "The NELS:88 second follow-up repeats all components of the first follow-up study. In addition, the parent component is included once again in the second follow-up. Two new componentsthe transcript and course offerings componentswere initiated in the second follow-up. The course offerings component was implemented as a part of the school effectiveness study. The transcript component was undertaken for sample members as described in section 1.6.5. Sample freshening was also implemented in the second follow-up to provide a representative sample of students enrolled in the twelfth grade during the spring term of the 1991-1992 school year. Each student and dropout selected for the first follow-up was included in the second follow-up. From within the schools attended by the sample members, 1,500 twelfth-grade schools were selected as sampled schools. Of the 1,500 sampled schools, the full complement of component activities occurred in 1,374 schools. For students attending schools other than those 1,374 schools, only the student and parent questionnaires were administered. Retaining the entire first follow-up sample in the 1992 round provides an optimally efficient sample for the NELS:88 second follow-up while satisfying researchers who are interested in maximizing the presence in the study of rare policy-relevant populations. The student sample was then augmented through freshening at the NELS:88 selected schools, the aim of which was to provide a representative sample of students enrolled in the twelfth grade during the spring term of the 1991-92 school year. Freshening added 364 twelfth graders (of whom 243 were deemed eligible) who were not contained in the base year sampling frame, either oecause they were not in the country, or were not in the eighth grade in the spring term of 1988/ Additional information about the second follow-up sample design is provided in Chapter of this /manual and in the forthcoming NELS:88 Second Follow-Up Sample Design Report. Most in-school surve, sessions were held in the period from January through March 1992, though a few took place as late as June 1992. Dropout data collection occurred between January and October 1992. Figure 1-4 illustrates the longitudinal design of NELS:88. As in the previous waves, students were asked to complete a questionnaire and cognitive test. The cognitive test was designed to measure twelfth-grade achievement and cognitive growth between 1988 and 1992 in the subject areas of mathematics, science, reading, and social studies (history/citizenship/ geography). The student questionnaire asked students about such topics as academic achievement; student perceptions and feelings about their curriculum and school; family structure and environment; social relations; and aspirations, attitudes, and values, especially as they relate to high school and occupational or postsecondary educational plans. The student questionnaire also gathered data about the family decision-making structure during the critical transition from secondary school to postsecondary education or the work environment. The student questionnaire contained a supplement for early graduates, the intent of which was to document the reasons for and circus stances of early graduatit n. If a student was Figure 1-4: Longitudinal Sample Design of NELS:88 (1988NELS:88 ( -1994 a first-time participant in NELS:88, he or she also completed a new student supplement, containing basic demographic items which were asked in the base year but not repeated in the second follow-up. A school administrator questionnaire, as in the first follow-up, was completed by school principals or headmasters. In a departure from the base year and first follow-up teacher surveys, only one teacher, either a mathematics or science teacher, was asked to complete a questionnaire for each sampled student enrolled in these subject areas in a NELS:88 sampled school. The second follow-up, in addition to surveying students who were enrolled in school, surveyed and tested youths who had dropped out of school at some point between the spring term of the  school year and the spring term of the 1991-92 school year. The dropout questionnaire collected information on a wide range of subjects, including reasons for leaving school, school experiences, absenteeism, plans for the future, employment, attitudes and self-concept, and home environment."}, {"section_title": "Second Follow-Up Design Enhancements", "text": "Two new components, the transcript and the course offerings components, were added to the NELS:88 second follow-up. These components provide archival data which describe the academic experience of high school students and the curricula offered by their schools. The complete high school transcript record was collected for 1) the contextual samplestudents attending sampled schools in the spring of 1992; 2) all dropouts, dropouts in alternative programs, and early graduates, regardless of school affiliation; and 3) triple ineligibles enrolled in the twelfth grade in the spring of 1992, regardless of school affiliation. Triple ineligibles are sample members who were ineligible for the base year, first follow-up, and second follow-up surveys due to mental or physical disability, or language barrier. NELS:88 course-taking data will provide not only a baseline against which future student outcome measures can be compared, but will illuminate trends when contrasted to the 1982 HS&B high school transcript study, the 1987 National Assessment of Educational Progress (NAEP) transcript study, and the 1990 NAEP transcript study. The course offerings component provides curriculum data from second follow-up school effectiveness study schools through which school effects on student outcomes can be studied. The, school effectiveness study (SES) was added to the first follow-up to provide a probability sample of tenth-grade schools, with a sizable and representative within-school sample of students, through which longitudinal school-level analysis (comparable to 1980-82 HS&B sophomore cohort analysis) could be conducted. In the first follow-up school effectiveness study, permission to conduct the study was gained from 251 schools and 248 of those schools were final SES participants. The second follow-up school effectiveness study returned to 247 of the 251 cooperating first follow-up SES schools, conducting freshening on both longitudinal and SES sample members, and selecting additional students from the pool including students who transferred into the school since the 1989 selection of SES students. The second follow-up school effectiveness study was enhanced by the addition of archival data collected by the new course offerings component, and was further augmented by the administration of free response science and mathematics cognitive test items in SES schools. 1.7"}, {"section_title": "NELS:88 Sponsors", "text": "The NELS:88 sponsor, the U.S. Department of Education's National Center for Education Statistics (NCES), provided federal agencies, states, and educational institutions with an opportunity to expand the scope of the base year, first follow-up, and second follow-up studies and enrich them through a variety of means. Enhancements sponsored by various groups included: sample supplements for states NELS:88 Data and Documentation NELS:88 base year, first follow-up, and second follow-up data are available in both public use and restricted use versions on both magnetic tape and on compact disc (CD-ROM). While this manual is specifically designed for use with the public release files, it is also appropriate for use with the restricted data. Because multilevel microdata (that is, individual-level data from multiple, linkable sources) carries with it some risk of statistical disclosure of institutional or individual identities, the NELS:88 data have been extensively analyzed to determine which items of information, used alone, in conjunction with other key variables, or in conjunction with public external sources such as school universe files, have significant disclosure potential. Variables that were found to pose significant disclosure risks were suppressed or altered to remove or substantially reduce such risks. For example, in some cases, continuous variables have been recast as categorical variables, fine-grained categorical variables have been more grossly recategorized. In a few instances, data elements have been suppressed or changed. Because of this, a particular school or individual student might be characterized in terms of a certain variable on the restricted use version of the NELS:88 data, but be coded to missing on the public files, coded to an adjacent response F2: Teacher Component Data File User's Manual user's manual was provided for use with each public release first follow-up data file.12 The student data file user's manual encompasses both the 1988 and 1990 waves of the study. Other first follow-up documentation, including an assessment of sampling and the psychometric properties of the cognitive tests are reported in the NELS:88 First Follow-Up Final Technical Report.\" Special reports and tabulations based on first follow-up findings have either been published or are in preparation at this time. These reports, and their estimated release dates, are listed in Appendix B. An electronic codebook released in the spring of 1993 is housed on CD-ROM and includes public use student, school, and teacher data from the base year and first follow-up waves of NELS:88. Also included in the first follow-up electronic codebook released on CD-ROM are public use data from the base year parent survey and dropout data from the first follow-up. The electronic codebook is MS-DOS based and menu driven. This on-line codebook system allows PC or PC-compatible computer users to: search a list of relevant variables based on key words or variable names; view frequencies for each variable; view question text; write SAS or SPSS control card files which can be used to construct a data system file; and, generate a codebook of selected variables. Documentation includes an instruction guide to codebook operation and a technical appendix which outlines computer system requirements for codebook use. 1.8.3 Second Follow-Up Tapes, Electronic Codebook on CD-ROM, and Documentation Five user's manuals have been produced for the NELS:88 second follow-up public release files, one to accompany each of the following components: student, dropout, parent, teacher, and school. Each manual furnishes the user with general information and documentation both about NELS:88 and a specific public release data file. Although the five user's manuals are written for use with the public release data files, they may also be utilized with the restricted use files. Additional manuals will be produced for use with the transcript and school effectiveness study restricted use data files. The second follow-up magnetic tapes and ECB/CD-ROM comprise all components of the second follow-up survey, as well as updated base year and first follow-up files. The student cognitive test scores have been updated for the second follow-up release of the base year, first follow-up, and second followup files, and the ECB features windows with both weighted as well as unweighted frequencies and percentages. A user's guide is available for the ECB and CD-ROM products. 12 Ingels, S.J.;Lindmark, J.T.;Myers, S.L. April 1992;NCES 92-030, 92-083, 92-084, 93-085 (ERIC ED 347-780). 13 Ingels S.J., Scott L.A., Rock D., Pollack J., Rasinski K.;Chicago: NORC, 1993;Washington D.C.: NCES, 1994. Other second follow-up restricted data files, such as the high school transcript survey, the school effectiveness study (SES), and the early graduate supplement, also appear on CD-ROM but not in the ECB format. These files can be downloaded to floppy diskette or hard drive on a PC, and/or uploaded to mainframe or other machines. The files can be converted to systems files for use with standard statistical software packages. Chapter VII of this manual contains additional information on the magnetic tape and CD-ROM releases. Additional forms of second follow-up documentation, including an in-depth assessment of sampling and non-sampling error, the sampling design, the psychometric properties of the cognitive tests, and various analysis reports are planned. These reports, and their estimated release dates, are listed in Appendix B. F2: Teacher Component Data File User's Manual U."}, {"section_title": "Data Collection Instruments", "text": "This chapter provides a brief description of the survey instruments and cognitive tests used in the NELS:88 second follow-up. The data collection instruments for the second follow-up were similar in content and form to those utilized in the prior waves. The instruments consisted of a teacher, student, dropout, parent, and school administrator questionnaire, and cognitive tests for students and dropouts. The new student supplement, added in the first follow-up to elicit demographic information from newly freshened students, was again administered in the second follow-up. An early graduate supplement was added for students who graduated from high school before their in-school data collection session in the spring of 1992. Instrument development was guided by the research objectives of NELS:88. Questionnaires were designed to meet the longitudinal goals of the study, and items were chosen based on their utility in predicting or explaining future outcomes as measured in the second follow-up or later survey waves. All of the questionnaires employed in the base year, first follow-up, and second follow-up surveys were framed to provide continuity and consistency with earlier NCES education longitudinal studies, as well as to address new areas of policy concern and to reflect recent directions in theory. Where appropriate, NELS:88 drew test and questionnaire content from NLS-72, HS&B, and other NCES studies, such as the National Assessment of Educational Progress (NAEP) and the Schools and Staffing Study (SASS), to ensure a common standard of measurement that would permit comparisons with other important data sources, and maximize the utility of NELS:88 data. For example, NELS:88 mathematics tests were designed so that NELS:88 and NAEP test scores can be equated, and so that HS&B and NELS:88 mathematics test results can be equated as well. Appendix E of the NELS:88 Second Follow-Up: Student Component Data File User's Manual contains an outline of the items which overlap between the NELS:88 base year, first follow-up, and second follow-up student questionnaires, the NLS-72 base year student questionnaire, and the base year HS&B senior cohort student questionnaire. A field test of the NELS:88 second follow-up conducted in 1990 and 1991 examined survey instruments and procedures and played a key role in instrument development. The second follow-up field test included six survey components: the school administrator, student, the cognitive test battery, dropout, and parent surveys, and the transcript component.' Upon completion of field test data collection, the information gathered was used to inform planning for the main study. Analysis of field, test data was also used to improve the measurement properties of test and questionnaire items, as well as to identify items which needed to be modified or deleted for reasons of instrument length or item format. A detailed description of the second follow-up field test can be found in the Field Test Report: National Education Longitudinal Study of 1988 Second Follow-Up.2 Because of the similarity between the second follow-up documents and the base year and first follow-up instruments, the content areas of the base year and first follow-up questionnaires are not described in this manual. However, Appendix E of the NELS:88 Second Follow-Up: Student Component Data File User's Manual provides a comparative overview of the items used in the base year and first follow-up student and dropout questionnaires, and identifies differences in and ad;''' ions to thematic areas in the second follow-up survey instruments. Appendix C of this manual provides an overview of the In the original design of the NELS:88 second follow-up, the teacher survey was included as an optional component of the study. Funding for the option was not received in time for ;:s inclusion in the second follow-up field test. 2 Dowd, K. et al.;v. 1;1991;Chicago: NORC. ERIC ED 335-418. 18 34 F2: Teacher Component Data File User's Manual content areas of the second follow-up student and teacher instruments. Since longitudinal data users may benefit from being able to take into account the data that will be collected in 1994, a description of the NELS:88 third follow-up questionnaire topic areas can be found in Appendix N of the NELS:88 Second Follow-Up: Student Component Data File Users Manual."}, {"section_title": "2.1", "text": "Teacher Questionnaire The NELS:88 teacher component was designed to provide teacher information that can be used to analyze the classroom and teacher influences on NELS:88 students, including their effect on longitudinal student outcomes. The design of this component does not provide a stand-alone analysis sample of teachers, but instead permits specific teacher characteristics and practices to be related directly to the learning context and educational outcomes of sampled students. The teacher questionnaire is a critical instrument for investigating the student's specific learning environment. In the second follow-up, teachers were asked to respond to the questionnaire items in relation to a specific list of sampled students enrolled in their classes. A thirty-minute questionnaire was collected for only one of the two cognitive test subjects, mathematics or science, if the student was enrolled in a class in one of the subjects. In the base year, either a mathematics or science teacher was surveyed for each student. In the second follow-up, the subject area of the teacher report collected for students who were enrolled in both mathematics and science was the same as the base year subject area. However, if the student was enrolled in only one of the subject areas in the second follow-up, the mathematics or science teacher was surveyed regardless of whether it was a mathematics or science teacher who was surveyed for the student in the base year. The teacher questionnaire attempts to illuminate questions of the quality, equality, and diversity of educational opportunity by obtaining information in the following four content areas: Teacher's assessment of the student's school -related, behavior and academic performance, educational and career plans and goals. Respondents completed this section with respect to the sample members they instructed in a particular subject matter. Information about the class the teacher taught to the sample member (e.g., track assignments, instructional methods, homework assignments, and curricular contents). In this section of the instrument, classroom topic coverage (\"Opportunity to Learn\") items have been articulated with the cognitive tests subjects. Information about the school social climate and organizational culture (e.g., teacher autonomy, participation in determining school policy, and relationships with the principal). Information about the teacher's background and activities (e.g., academic training, subject areas of instruction, years of teaching experience, and participation in professional growth activities)."}, {"section_title": "Abbreviated Teacher Questionnaire", "text": "Near the close of the data collection period an abbreviated version of the second follow-up teacher questionnaire was administered over the telephone to teachers for whom a questionnaire had not been collected or for a total of 8.2 percent of the teacher sample. The shortened version of the original 35 19 F2: Teacher Component Data File User's Manual instrument contained selected critical items of the full-length version of the questionnaire and other key policy-relevant items. Appendix G lists the items included in the abbreviated teacher questionnaire."}, {"section_title": "Adapting the Teacher Questionnaire for Telephone Administration", "text": "Because the teacher data were collected through self-administration and telephone administration, a number of steps were taken in the second follow-up to minimize mode effects. Interviewers were trained to adapt the questions to make sense when read over the telephone. Additionally, teachers were asked to read along in the questionnaire during the telephone interview if they had a copy of the selfadministered version of the questionnaire available."}, {"section_title": "2.2", "text": "Relationship Between the Teacher Instrument and Other Second Follow-Up Instruments The data collected by the teacher instrument is contextual data against which student outcomes and characteristics can be measured. The data collected by the teacher instrument does not comprise a stand-alone, generalizable data set. Researchers should use the teacher reports in conjunction with the data collected by the student and dropout questionnaires and cognitive tests. Like the teacher component, the school administrator survey also provides contextual data intended to be used with student data to facilitate measurement of student outcomes."}, {"section_title": "23", "text": "Student Questionnaire and Cognitive Tests Sample members who attended school during the spring term of the 1991-92 school year were administered a student questionnaire, either at an in-school or off -campus survey session. Sample members administered a student questionnaire also included: those identified as dropouts at some earlier time but who returned to and remained in school during the spring term of 1992; and students who had left school but had already passed the General Educational Development test (GED) or had obtained some other equivalency certification. The sixty-minute, self-administered questionnaire collected information on a wide range of topics, including students' background, language use, home environment, perceptions of self, occupational or postsecondary educational plans, jobs and household chores, school experiences and activities, work, and social activities. Information collected by the second follow-up student questionnaire supplies a baseline for the study of the NELS:88 cohort's transition to postsecondary education or entry into the labor market. The second follow-up student and dropout questionnaires were available in both English and Spanish.3 In addition to the student questionnaire, students completed a series of cognitive tests which were also administered at their in-school or off campus survey sessions. The combined tests covered four subject areas and included 116 items to be completed in 85 minutes. The cognitive tests are briefly described below: 3 Eight dropouts and 41 students completed the Spanish-language questionnaire in the NELS:88 second follow-up. Because of the small number of questionnaires completed in Spanish, a separate flag was not created for these cases. The percentage of questionnaires completed in Spanish--around 0.2 percent--is similar to the percentage of HS&B seniors who opted to complete Spanish-language questionnaires in 1980/1982 This subtest contained five short reading passages or pairs of passages, with three to five questions about the content of each. Questions encompassed understanding the meaning of words in context, identifying figures of speech, interpreting the author's perspective, and evaluating the passage as a whole. Mathematics (40 questions, 30 minutes) Test items included word problems, graphs, equations, quantitative comparisons, and geometric figures. Some questions could be answered by simple application of skills or knowledge, others required the student to demonstrate a more advanced level of comprehension and/or problem solving."}, {"section_title": "Science (25 questions, 20 minutes)", "text": "The science test contained questions drawn from the fields of life science, earth science, and physical science/chemistry. Emphasis was placed on understanding of underlying concepts rather than retention of isolated facts. History/Citizenship/Geography (30 questions, 14 minutes) American history questions addressed important issues and events in political and economic history from colonial times through the recent past. Citizenship items included questions on the workings of the federal government and the rights and obligations of citizens. The geography questions touched on patterns of settlement and food production shared by other societies as well as our own. NORC's subcontractor, the Educational Testing Service (ETS), developed the cognitive test battery for the second follow-up. Six forms of the cognitive test battery were produced in the second follow-up, each comprising a different combination of mathematics and reading difficulty levels. Each sample member's test form was determined by his or her scores on the base year and/or first follow-up mathematics and reading tests; freshened students and first follow-up nonrespondents received the intermediate version of the second follow-up cognitive test battery. The purpose of the multilevel design of the second follow-up cognitive test battery was to guard against ceiling and floor effects which may occur when testing must span four years of schooling. This adaptive approach tailors the difficulty of the reading and mathematics tests to the ability of the respondent, thereby leading, given limitations in testing time, to a more accurate measurement than a single level design. Psychometric properties of the cognitive tests are discussed in the forthcoming 1VELS:88 Second Follow-Up Final Psychometric Report, the forthcoming 1VELS:88 First Follow-Up Final Technical Report, and the Psychometric Report for the NELS:88 Base Year Test Battery,' all obtainable from NCEr"}, {"section_title": "Dropout Questionnaire", "text": "During the data collection period from January through October 1992, a dropout questionnaire was administered to sample members who, based on data gathered through administration of a status F2: Teacher Component Data File User's Manual screener, were not in an academic program leading to a high school diploma and had not received a GED by the spring of 1992. The dropout questionnaire collected data about the last school attended by the sample member and the school's climate, :easons for leaving school, and actions school personnel, parents, and friends took when the respondent stopped going to school. Respondents also reported on their likelihood of returning to and graduating from high school, and described their current activities, employment history, and future plans. The hour-long, self-administerP4 questionnaire was normally completed with an NORC Interviewer present, at either a group or single survey session and was available in both English and Spanish. However, in some cases the dropout questionnaire was administered as a telephone interview. In addition to the dropout questionnaire, an 85-minute cognitive test battery was also administered to dropouts when possible. Because of the difficulty in collecting test data from dropouts, and because data from many dropouts was collected in telephone interviews which preClude testing, the NELS:88 second follow-up achieved a comparatively low (41 percent) cognitive test completion rate for dropouts. The dropout questionnaire was designed to facilitate comparisons with the NELS:88 second follow-up student questionnaire, the first follow-up dropout questionnaire, and the HS&B 1982 dropout questionnaire. This item overlap with the student questionnaire permits users to contrast factors such as school environment, family life, aspirations, and self-perceptions of students with the responses of dropouts. The overlap of 1982 and 1992 dropout items facilitates comparison of contemporary dropouts with those of a decade before. All sample members appear on the student data file regardless 'of their spring 1992 enrollment status. Basic classification variables and test data appear for both students and dropouts, though dropout questionnaire data appear separately on the dropout component data file. To facilitate the use of school contextual data with dropout data, on the restricted use CD-ROM delivery of the second follow-up data, a link is provided between a dropout and the first or second follow-up school the dropout last attended."}, {"section_title": "Adapting Student and Dropout Questionnaires for Telephone Administration", "text": "To adapt the second follow-up student and dropout questionnaires for telephone interviewing, two abbreviated versions of the instruments were administered during the final weeks of data collection. Adaptation of the student and dropout questionnaires for telephone administration was guided by the need to preserve each question's original meaning while wording each question so that it made sense when read aloud. One abbreviated version of the student and dropout questionnaires excluded a small number of questions which did not lend themselves to being read aloud. A second abbreviated version of the questionnaires was administered to sample members who explicitly refused to complete the full length instrument and consisted mainly of locator information and key items. The mode of administration for the abbreviated instruments was primarily telephone interview; however, a small percentage of abbreviated questionnaires were completed by personal interview."}, {"section_title": "New Student Supplement", "text": "Because basic demographic information collected by the base year student questionnaire were not collected again in the first and second follow-up student questionnaires, this information was collected in a new student supplement for students who participated in the study for the first time in the second follow-up. The self-administered supplement was available in .00th English and Spanish and took approximatdy 15 minutes to complete. It contained demographic questions such as birthdate, sex, family socioeconomic status, and race/ethnicity about students and their families. Early Graduate Supplement NELS:88 participants who graduated from high school prior to data collection in the spring term of 1992 completed the second follow-up early graduate supplement to the student questionnaire. The intent of this supplement was to document the reasons for and the circumstances of early graduation, the adjustments required to finish early, and respondents' activities compared with those of other school survey members. The items for the second follow-up early graduate supplement were modeled on those used in the HS&B sophomore cohort early graduate supplement administered in the HS&B first follow-up in 1982."}, {"section_title": "2.8", "text": "School Administrator Questionnaire The primary purpose of the school administrator questionnaire was to gather general descriptive information about the educational setting and environment associated with the individual students who were selected for participation in NELS:88. This school information describes the overall academic climate in terms of specific school practices and policies as well as enrollments and educational offerings. The information obtained through the school administrator questionnaire provides supplemental data to that provided by the student questiormaire so that student outcomes can be considered in terms of school measures. In the second follow-up, a self-administered, forty-five minute school administrator questionnaire was completed by the school principal, headmaster, or other knowledgeable school official designated by the school administrator of NELS:88 schools. The questionnaire was divided into five content areas as described below: General school characteristics, such as grade span, school and twelfth-grade enrollment sizes, and school control and demographic characteristics. In addition, questions were asked about college preparatory services and vocational programs offered to twelfth graders. General student characteristics of the twelfth-grade class, including average daily attendance rates, ethnic and racial composition, percentage of students with limited English proficiency, and numbers of students receiving special school services. Teaching staff characteristics encompassing such areas as the number of full-time and part-time faculty, departmentalization of faculty, salary levels, and evaluation of teachers. School policies and programs including requirements for minimum competency and proficiency tests, and programs for language minority students. School governance and climate such as administration practices, school reforms, types of parental involvement, student behavioral problems within school, and areas of principal's control. The questionnaire was designed so that the first four sections could be answered either by the school principal or by a designee who was able to provide the requested information. Only the principal could answer the last section which asked for his or her subjective opinions regarding the school environment. F2: Teacher Component Data File User's Manual 2.9 Parent Questionnaire The parent questionnaire was designed to collect infor, iation from parents about factors that influence educational attainment and participation. The objective of the parent questionnaire was to provide data that could be used primarily in the analysis of student and dropout behaviors and outcomes, and only secondarily as a data set by itself. The questions focused on family background and socioeconomic characteristics, and on the character of the home educational support system. In addition, the parent instrument collected data related to parental behaviors and circumstances with which the student or dropout may not be familiar, such as parental education and occupation. The questionnaires also contained more sensitive questions about income, postsecondary educational costs and financial aid decisions, and religious affiliation. English and Spanish language versions of the questionnaire were made available to parents in both the base year and second follow-up. In the second follow-up, a self-administered forty-minute questionnaire was mailed to parents of both students and dropouts. One focus of the second follow-up questionnaire was postsecondary educational costs and financial aid decisions. Because this information was not available to most parents until tilt spring of 1992, the parent questionnaire was mailed to parents in Mry 1992. The instructions in the questionnaire and accompanying letter directed the most knowledgeable parent or guardian, defined as the parent who knows the most about the student's or dropout's educational activities and related behaviors, to complete the questionnaire. In accordance with this definition, the respondent was self-selected."}, {"section_title": "24", "text": ""}, {"section_title": "40", "text": "F2: Teacher Component Data File User's Manual III. Sample Design and Implementation; Survey Error Assessment This chapter describes the design and procedures used for selecting schools and students into the NELS:88 base year, first follow-up, and second follow-up samples and for selecting the second =-J1low-up teacher sample. It provides information on the calculation of sample weights and the relative efficiency of the sample design. This chapter also provides information about procedures used to adjust sample weights for nonresponse and about the effect of unit and item nonresponse and other potential sources of bias on estimates."}, {"section_title": "NELS:88 Sample Design", "text": "The following section describes the sample design of NELS:88, from its base year inception through the first and second follow-ups. Beginning from a straight forward two-stage stratified sample, the complexities of the NELS:88 sample design have grown exponentially with each subsequent wave."}, {"section_title": "Base Year Sample Design", "text": "The NELS:88 base-year survey employed a two-stage, stratified sample design, with schools as the first-stage unit and students within schools as the second-stage unit. Within each stratum, schools were selected with probabilities proportional to their estimated eighth-grade enrollment to achieve virtual self-weighting. In addition, schools were oversampled in certain special strata so that policy-relevant subgroups would be adequately represented in the sample. Within each school approximately 26 students were to be randomly selected (typically, 24 regularly sampled students and two, on average, OBEMLA-supplement Hispanic and Asian/Pacific Islander oversampled students). In schools with fewer than 24 eighth graders, all eligible students were selected. Because of the incidence of small schools in the NELS:88 sample, the average--within school sample size for the base year --was 25 students (or 23 participating students). From a national frame of about 39,000 schools with eighth grades, a target sample size of 1,032 schools was set. Some 1,052 schools--815 public and 237 privateparticipated and provided usable eighth-grade student data. NORC's sampling frame was the school database compiled by Quality Education Data, Inc. (QED) of Denver, Colorado. The QED list contained information about whether a school was urban, suburban, or rural. NORC used this information for stratification purposes. The QED list did not at that time contain information about the racial/ethnic composition of individual public schools usable for the NELS:88 sampling frame. Racial/ethnic composition data were obtained from Westat, Inc. in its capacity as an NORC subcontractor for the NELS:88 base year study. As part of their work on the National. Assessment of Educational Progress (NAEP), Westat had obtained data from the Office of Civil Rights (OCR) and from other sources (e.g., district personnel) that identified those schools with a minority enrollment of greater than 19 percent. Use of this data set facilitated the explicit stratification and allocation of schools with very large percentages of black or Hispanic students. Stratification information on whether a school was public, Catholic (private), or other private was obtained from the QED list and lists of private schools. Readers who desire more detail on the base year sample design should consult the NELS:88 Base Year Sample Design Report."}, {"section_title": "First Follow-Up Sample Design", "text": "There were three basic objectives for the NELS:88 first follow-up sample design. First, the sample was to include approximately 21,500 students who were in the eighth-grade sample in 1988 (including base year nonrespondents). This longitudinal cohort was to be distributed across 1,500 41 25 F2: Teacher Component Data File User's Manual schools. Second, the sample was to constitute a valid probability sample of all students currently enrolled in the tenth grade in the 1989-1990 school year. This entailed freshening the sample with students who were tenth graders in 1990 but not in the eighth grade during the 1987-1988 school year. Third, the first follow-up was to include a sample of students who had been deemed ineligible for base year data collection (because physical, mental, or linguistic barriers prevented them from participating) so that those able to take part could be added to the first follow-up student sample, and demographic and school enrollment information could be obtained for them. Longitudinal Cohort. The general sample design strategy for this component of the sample involved subsampling students selected for the base year with non-zero probabilities related to characteristics of their 1990 schools. Base year students who had dropped out of school between 1988 and 1990 were subsampled with certainty (their probabilities of selection were set equal to one). Base year students attending school in 1990 were subsampled with probabilities related to the number of other base year students attending the same school. Base year students who were reported to be attending a school with at least 10 other base year students were sampled with certainty. All other students were sampled with probabilities greater than zero, but less than one. Including nonrespondents, the NELS:88 base year sample comprised 26,432 students. Of these, 96 were deemed out of scope for the 1990 first follow-up (including students who had died or moved out of the United States). Among the remaining 26,336 students, 348 were found to have dropped out of school; all of these students were selected into the first follow-up with certainty (probability of selection equal to one).1 Distribution of Students in Schools. It was determined that the remaining pool of 25,988 students were distributed among 3,967 schools.' As had been anticipated, the distribution of these students among schools was highly skewed. It was found that approximately 75 percent of the students (19,568 of 25,988) were attending approximately 23 percent (908 of 3,967) of the schools; each of these schools included at least 11 base year students. All of these 19,568 students were included in the first follow-up with certainty. The remaining 6,420 students were distributed among 3,059 schools with 10 or fewer members of the base year sample. Their sampling probabilities for the first follow-up depended on the number of base year students the school contained. The efficiency of this design relative to one with no subsampling at all was 66.5 percent.' These schools--or, more precisely, clusters of base year students--were subsampled to achieve the final NELS :88 first follow-up school sample, after the conclusion of the 1989 spring term. There were 1,468 schools (1,506 student clusters) selected. The 348 dropouts comprise 250 dropouts whose status was confirmed by the student's home, 58 sample members whom the school reported to have dropped out but field interviewers could not locate, and 40 students who were institutionalized. The latter group are not necessarily dropouts in strict sense of the first follow-up dropout definition because in some cases they were receiving academic instruction. However, they were grouped with the dropouts to ensure that they would remain in the first follow-up sample with certainty. 2 When the school a student was attending could not be identified, a separate \"school\" of size one was created. This was the case for 221 students who could not be located and ten students who were in home study. Hence, the number of actual schools was 3,736."}, {"section_title": "3", "text": "The measure of efficiency was computed as 1/11 + RV) 100%, where RV is the relative variance of the weights required to compensate for the different rates of subsampling."}, {"section_title": "4", "text": "F2: Teacher Component Data File User's Manual However, the schools at which the first follow-up teacher survey and school administrator survey were conducted were a specific subset of the NELS:88 schools. This subset was the schools selected via their student populations during the subsampling of the eighth-grade cohort after the spring term of 1989, if and only if a NELS:88 student remained enrolled in the school when student data collection was conducted during the spring of 1990.\nTeacher questionnaire coverage rate for each student who has completed a BY, Fl and F2 student questionnaire. Teacher questionnaire coverage rate for each student who has completed a BY and/or F2 student questionnaire. Panel students only.\nAnalysts who are employing variance estimation software should note that the student ID reflects the NELS:88 sampling plan in the following way: the left-most two digits of the ID represent the stratum identification number for the case; the middle three digits are the primary sampling unit (PSU) for the school; and the last two digits identify the student uniquely within the stratum and PSU. 80 1 (1 2 F2: Teacher Component Data File User's Manual in order to maintain confidentiality, a school ID number is not included on the second follow-up public use teacher file."}, {"section_title": "First Follow-Up Sample Enhancements and Modifications", "text": "Freshened Sophomore Sample. The second sampling objective was to create a valid probability sample of students enrolled in tenth grade in the 1989-1990 school year; this goal was achieved by a process called freshening. The freshening procedure was carried out so that students who were not enrolled in the eighth grade in the U.S. in 1988 had a chance of being selected for the sample. The freshening process could yield zero, one, or more than one new sample member in a given school. A total of 1,229 new students were added to the tenth-grade sampleon average; just less than one student per school. Some of these freshened students were dropped in the subsampling process described below either because they themselves were not included in the subsample or because the base year student to whom they were linked was not included. Some 1,043 students selected through the freshening procedure remained in the final first follow-up sample. Subsampling the Eighth-Grade Cohort and Freshened Sophomore Samples. After the initial selection of the longitudinal cohort, the combined longitudinal-freshened sample was further subsampled. The students dropped from the first follow-up as a result of subsampling were also excluded in the second follow-up. Two categories of sample members were subsampled: 1) students who had transferred out of the school from which they had initially been selected for the first follow-up sample; and 2) first follow-up nonrespondents who were classified as potential dropouts. NORC selected a 20 percent subsample of transfer students and a 50 percent sample of \"potential dropouts.\" Table 3.1.3-1 lists the first follow-up sample by race and means of entry into the sample. Sample of Base Year Ineligibles. The NELS:88 base year sample excluded students for whom the NELS:88 survey instruments would be unsuitable (i.e., students with a mental disability and students who are not proficient in English) and students whose physical or emotional problems would have made participation in the survey unduly difficult. A final sample of 653 of these students were selected for a followback study of these students. The eligibility status of these students was reassessed, their school enrollment status and basic demographic characteristics were determined, and student questionnaire data were obtained from those deemed able to complete a questionnaire. Further detail on sample eligibility in the base year is provided in the NELS:88 Base Year Sample Design Report and in the forthcoming NELS:88 First Follow-Up Final Technical Report. Chapter III of the NELS:88 Second Follow-Up: Student Component Data File User's Manual includes additional detail about sample freshening, student subsampling, and base year sample ineligible students."}, {"section_title": "Second Follow-Up Sample Design", "text": "There were five basic objectives for the NELS:88 second follow-up sample design. First, the sample was to constitute a valid probability sample of all students enrolled in the twelfth grade in the 1991-1992 school year. This entailed freshening the sample with students who were twelfth graders in 1992 but were not in the eighth grade in the U.S. in the 1987-88 school year, just as the first follow-up sample had been freshened in 1989 to achieve a 1990-91 representative sample of sophomores. Additionally, it was necessary to reassess the eligibility status of selected students found in previous 4 3 27 F2: Teacher Component Data File User's Manual Figures in this table represent the first follow-up constructed variable frequencies. This variablerace identified at the time of sampling--is not the same variable included on the data files and reported in the codebooks. This variable was used because it was the only race variable that was constructed for initial sample members dropped in final subsampling. 1,821 members of the eighth-grade longitudinal cohort and 169 freshened tenth graders were dropped in Phase 3 subsampling. In addition, 7 members of the eighth-grade longitudinal cohort were discarded because they were selected in error during the base year.° This table is based on the original (1992)(1993) release of the first follow-up student file. The second follow-up (1994) release of the first follow-up student data contains a slightly different sample number than the original release. Additional details about the sample numbers of the two releases are on page 26 of section 3.1.2 of the Second Follow-Up: Student Component Data File User's Manual, under the subheading \"Subsampling the Eighth-Grade Cohort and Freshened Sophomore Samples.\" waves to be ineligible, and to include them in the cohort if they were determined to be eligible for the second follow-up. Second, to continue the examination of the dropping out phenomenon, dropouts were to be retained with certainty. Third, it was highly desirable for policy analysis purposes to retain the maximum number of Hispanics, Asians, and American Indians from the first follow-up sample. Fourth, to minimize nonresponse bias first follow-up nonrespondents were to be retained with certainty. Fifth, the sample was to be clustered in 1,500 schools from which contextual data--including school administrator, teacher, and transcript data--would be collected. It was hoped that these goals could be achieved with minimal loss to both sample efficiency and effective sample size. Longitudinal Cohort. When second follow-up tracing of cohort members was completed, it was found that the first follow-up sample (that is, the sum of base year respondents and nonrespondents retained after first follow-up subsampling and first follow-up freshened students) was much more widely dispersed than had been anticipated. After eliminating the locations of the \"known\" dropouts (N=1,564) from consideration (dropouts were sampled with certainty), the remaining eligible sample of students 28 44 F2: Teacher Component Data File User's Manual (N=18,726) was dispersed among 3,224 schools /locations.'`I ncluding dropouts, there were 4,788 locations. Once non-school locations associated with dropouts, early graduates, institutionalized sample members, home study students, and unlocatable sample members were subtracted from the total, there were 2,258 school sites. It was clear that even if no attempt were made to satisfy the second goal --retention with near certainty of Hispanics, Asians, and American Indians from the first follow-up sample--that the fifth goal of achieving a cluster of students in 1,500 schools could not be met without significant losses in sample efficiency, effective sample size, or both. Table 3.1.4-1 shows the distribution of students eligible for second follow-up sampling (excluding dropouts) by school size, as well as the number of schools with at least one sample member who was either Hispanic, Asian, or American Indian. The data in the table indicated that to achieve disproportionate retention of minority students most of the schools containing these students would have to be selected, leaving few additional sample selections to distribute among the remaining school sites and contradicting the initial samplingylan to include with certainty any school with at least five NELS:88 sample members enrolled at the sehOol. After consideration of several alternative allocations taking into account the negative effects of subsampling on sample efficiency, the strong desire to retain as many Hispanics, Asians, and American Indians as possible, and the substantial investment made in two prior rounds in obtaining student, parent, teacher, and school data for those students who would have been subsampled out--it was decided to include all first follow-up sample members in the second follow-up sample. Initial Selection of the Second Follow-Up School Sample. All first follow-up sample members remaining after subsampling were included in the second follow-up (all sample members dropped from the first follow-up due to subsampling were also excluded from the second follow-up). Additionally, the teacher, school administrator, and transcript components were limited to a maximum of 1,500 schools. For this reason it was still necessary to select a sample of schools, although the students falling outside that sample would not be excluded from the study. For students in the 1,500 schools selected, the full range of datastudent, teacher, school administrator, parent, and transcript data--were collected; for the students in a school not among those selected, only student and parent data were collected. A total of 2,258 schools were identified in the second follow-up tracing of the NELS:88 first follow-up sample; 1,500 of these were targeted for contextual data collection. In the spring of 1991, interviewers traced students to schools, and all 1,030 schools identified as having four or more first follow-up sample members enrolled were included in the school-level sample with certainty (i.e., probability of 1.0). Prior to the fall of 1991 the contextual school sample was finalized through the following sampling process. A random sample of 45 of the 60 (probability =0.75) schools containing three sample members was selected. A random sample of 104 of the 160 (probability =0.65) schools containing two first follow-up sample members was selected for retention. Finally, a random sample of 4 In the second follow-up, dropouts were defined differently for sampling purposes than for data collection purposes. (See the NELS:88 Second Follow-Up: Dropout Component Data File User's Manual, section 4.3.1 for further details regarding the definition of dropouts for data collection and assignment of questionnaire.) For sampling purposes, dropouts comprised all individuals who were classified in the first follow-up as ever having dropped outthat is, dropouts (individuals who were not enrolled in school in the spring term of 1990) and stopouts (spring term 1990 students with a recorded 1988-1990 dropout episode), regardless of their school enrollment status as of the second follow-up spring term 1991 tracing effort. In other words, dropouts who had since returned to school and stopouts who remained in school were still counted as dropouts for sampling purposes, along with institutionalized individuals and the additional dropouts identified during second follow-up tracing.   20   65  43   22   21   55  43  12   22  40   31  9   32  27  5    22   21   1   13  12   1    6  6  0   6   5   1   5   3   2    7  6   1   30  4  2  2   31  5   5   0  32  2   1  1   33   1   1   0  34   1   1   0  35  2  2  0  36   3   3   0  37   1   1   0  38   1   0   1   40   1   1   0   41   2   1  1   44   1   0   1   30   46 F2: Teacher Component Data File User's Manual Note: known school-leavers are not included in the numbers above. 321 of the 1,008 (probability =0.31845) schools identified as containing one first follow-up sample member was selected for retention in the sample. In the fall of 1991 interviewers confirmed the enrollment of students at schools previously identified as enrolling three or fewer NELS:88 students. School Sample for Freshening Purposes. Like the first follow-up student and school samples, the movement of students among schools resulted in a somewhat amorphous base from which to select schools and collect data. Students could have transferred any time between the time they were traced to a specific school in the spring of 1991 to the fall of 1991, when they were freshened in the fall of 1991, and when student and school administrator data were collected during the spring of 1992. It was possible for students to transfer to either a school that had been identified as a NELS:88 second follow-up sampled school or to a non-NELS:88 school. Because students may have transferred between schools at any time during the spring or fall of 1991, freshening did not necessarily occur at each of the 1,500 sampled schools in the second follow-up. Freshening occurred only at those schools enrolling NELS:88 sample members as of the first day of the 1991-1992 school year.' School Sample for Purposes of the Teacher Survey. The school sample for the purposes of collecting contextual data from teachers included a subset of the 1,500 contextual schools at which NELS:88 sample members were still enrolled at the beginning of student data collection in January 1992. However, by the end of second follow-up data collection, there were only 1,374 contextual schools at which at least one student was enrolled. The second follow-up teacher sample is distributed in 1,264 of Only those freshened sample members who remained in school through the spring term became members of the HS&B-comparable NELS:88 sophomore cohort. However, autumn sophomores who had dropped out by spring were surveyed in both the first and second follow-ups. While these \"freshened dropouts\" were included on the original first follow-up public release, in the current re-release these cases appear only on the privileged use files. 4 31 F2: Teacher Component Data File User's Manual the 1,374 contextual schools.' Figure 3-1 provides an illustration of the longitudinal sample design of the base year, first follow-up, and second follow-up cohorts and their inclusion in the second foliow-up contextual sample. Users should note that teacher data from this sample of schools, to be used in analysis with second follow-up student data, must be used with a weight, F2CXTWT, calculated separately for the students included in the contextual components sample. If that weight is not applied, there will be a potential for systematic bias with respect to those factors associated with attendance at schools with fewer NEU :88 students. For example, students who are more likely to transfer to different schools will be underrepresented if the weight is not applied."}, {"section_title": "Second Follow-Up Teacher Sample", "text": "The second follow-up teacher sample included one mathematics or science teacher of each student in the contextual components sample who was also enrolled in mathematics or science at the time of second follow-up data collection. Because teachers were selected based on whether they taught one of these subjects in a contextual school, the teacher sample does not constitute a strict probability sample of teachers. The student is the appropriate level of analysis, and users are advised to employ the teacher data as a contextual data source which informs student-level analyses. The second follow-up teacher sample was designed to articulate with the collection of student questionnaires and the administration of student cognitive tests. Because most learning by twelfth-grade students occurs in the fall term of their senior year and because these students sometimes disengage from their high school career in the spring term, student data collection was scheduled as early as possible during the spring term of the 1991-1992 academic year: most in-school data collection sessions occurred in January, February, and March of 1992. This \"frontloading\" of second follow-up student data collection was unlike the base year and first follow-up when student data collection in those rounds was concentrated in March through June. The spring term teacher was selected for the base year and first follow-up teacher surveys in order to parallel the student data collection schedule in those rounds. Second follow-up data were collected for most students in January through March of 1992, but some in-school data collection sessions were scheduled on or after April 1, 1992. Teachers were selected for the teacher survey in a way that reflected the span of time across which in-school data collection sessions were scheduled. For students whose in-school data collection session was scheduled for before April 1, 1992, the fall term teacher was selected for the teacher survey. For students eligible for the teacher survey in schools with in-school data collection sessions on or after April 1, 1992, the spring term teacher was surveyed.' However, the resulting distribution of the teacher sample indicated that 80.0 percent of the students had the same selected teacher 7 Due to unit nonresponse and because 4,834 students were not enrolled in either a mathematics or science class in the 1991-1992 academic year, not all of the 1,374 contextual schools have teachers and students who were included in the second follow-up teacher survey or who are represented on the public use teacher file. These selection criteria mean that if a student's fall term teacher was to be selected but the student was not enrolled in mathematics or science in the fall, then a teacher report was not collected for the student. Conversely, if the student's spring term teacher was to be selected for the teacher survey, but the student was not enrolled in either subject in the spring term, then a teacher report was not collected for the student. F2TEOFLG = 0 for these students on the public use teacher data file.    The 15,695 student records on the teacher public use data file includes 9,853 participants and 1,008 nonparticipants. This column also includes 4,834 students who were not enrolled in a mathematics or science class, and therefore were not included in the teacher survey. F2: Teacher Component Data File User's Manual for both the fall and spring terms. Another 17.5 percent of students were instructed by the fall term teacher only. A total of 2.5 percent of students were instructed by the spring term teacher only. Students in the second follow-up contextual sample who were enrolled in either a mathematics or a science class were included in the second follow-up teacher survey. Unlike the base year and first follow-up teacher surveys in which up to two teachers per student were included in the teacher sample, the second follow-up teacher survey only selected one teacher--either in mathematics or science --for each student enrolled in at least one course in these subject areas. In the fall of 1991, the names of the mathematics and science teachers of NELS:88 students in the 1,500 contextual schools were collected. For any schools at which the spring term teachers were surveyed, the names of the teachers of the NELS:88 students were collected in early 1992. For students enrolled in only one course, that one mathematics or science teacher for the student was selected for the teacher sample. If a student was enrolled in both a mathematics and a science class, one of the teachers was selected based on the base year assigned subject area combination for the student. For freshened students added to the first or second follow-up who were enrolled in both mathematics and science in the second follow-up, the subject area combination of the student's linked partner was used to determine which teacher should be selected for the teacher survey. When a student was enrolled in more than one course in the selected subject area, the following decision rule was invoked to determine the selected teacher: first, the teacher who instructed the more advanced course was selected; second, the teacher of the course in which the student spent more time was selected; and finally, one of the teachers was selected randomly. Although the second follow-up teacher sample was primarily defined in the fall of 1991, the inclusion of teacher data on the teacher file was limited to student participants who were in the contextual sample. Data collected from teachers of student nonparticipants or students who were not included in the final contextual sample were excluded from the teacher file. Table 7.2.2-1 in Chapter VII highlights key similarities and differences between the base year, first follow-up, and second follow-up teacher files."}, {"section_title": "Calculation of Weights", "text": "The general purpose of weighting survey data is to compensate for unequal probabilities of selection and to adjust for the effects of nonresponse. Weights are often calculated in two main steps. In the first step, unadjusted weights are calculated as the inverse of the probabilities of selection, taking into account all stages of the sample selection process. In the second step, these initial weights are adj-e:,ted to compensate for nonresponse; such nonresponse adjustments are typically carried out separately within multiple weighting cells. This is the process that was applied to weighting NELS:88 data in all rounds."}, {"section_title": "Calculation of Base Year Sample Weights", "text": "The base year weights were based on the inverse of the probabilities of selection into the sample and on nonresponse adjustment factors computed within weighting cells. Two different weights were calculated to adjust for the fact that not all sample members have data for all instruments. The weight BYQWT applies to 24,599 student questionnaires (and is also used in conjunction with base year parent data), while BYADMWT applies to the 1,035 completed school administrator questionnaires. These weights project to the population of approximately 3,008,080 eligible eighth graders in public, Catholic, and other private schools in 1988."}, {"section_title": "F2: Teacher Component Data File User's Manual", "text": "The base year weighting procedures consisted of two basic stages: Stage 1. Calculation of a preliminary base year weight based on the inverse of the, product of the probabilities of selection for the base year sample. Stage 2. Adjustment of this preliminary weight to compensate for \"unit\" nonresponse, that is, for noncompletion of an entire school questionnaire or student questionnaire. The unit varied depending upon the weight being adjusted. The nonresponse-adjusted school weight was derived as the product of the school's preliminary weight times a nonresponse adjustment factor intended to adjust for the fact that 17 sampled schools did not return a completed questionnaire. The preliminary weight for students was based upon the inverse of the probability that the student's school was selected into the sample multiplied by the inverse of the probability that the student was sampled within the school. The nonresponse-adjusted student weight was derived as the product of the student's preliminary weight times a nonresponse adjustment factor intended to adjust for the fact that some of the sampled students did not participate, that is, did not return a completed questionnaire. Statistical properties of the base year weights are presented in Table 3.2.1-1. Each school appearing on the NELS :88 base year school file, and each student appearing on the NELS :88 student file, has a value for the final weight variable. The weight represents the probability of selection into the sample, in addition to a factor that adjusts for nonresponse. Thus, the weight serves the purpose of allowing a particular case to represent other nonsampled cases within its sampling stratum, and to represent nonresponding cases similar to it in various respects. Because separate final student and school weights have been provided, the construction of each will be considered separately in the following discussion. Base Year School Weights. The final school weight, BYADMWT, was derived using a multistage process. First, an initial weightwhich represented the inverse of the school's selection probability--was attached to each school record in a file containing records for all eligible schools in the NELS:88 sample. A logistic regression procedure was used to estimate in terms of a probability of nonresponding the degree to which each of the responding schools resembled a nonresponding school. This estimated probability of nonresponse was the first adjustment factor applied to a school's weight. Next, a polishing proceduremulti-dimensional rakingfurther adjusted the weights to sum to known population totals within strata. Estimating the nonresponse probability for each of the responding schools was possible because key background information on almost all of the nonresponding schools was available. The final result of these procedures was a weight for each of the responding schools adjusted to compensate for nonresponse. For the purpose of adjusting the school weight, a nonresponding school was defined as a school for which both school administrator questionnaire data and student questionnaire data were unavailable. Base Year Student Weights. The final student weight, BYQWT, was also derived using a multistage process. A design weight for each eligible student on a participating school's sample roster represented the student's probability of selection within the school. A student-level nonresponse adjustment factor was calculated by forming weighting cells based upon the combination of certain levels of variables representing school type, region, ethnicity, and gender. For each student, the product of a preliminary school weight and the student's design weight was formed. (The preliminary school weight was slightly different from BYADMWT. BYADMWT was adjusted to accommodate the 17 schools for which school administrator questionnaire data were unavailable though student questionnaire data had been obtained. The preliminary school weight eliminated this step in the adjustment process. Thus, it is appropriate for application to the 1,052 schools with student questionnaire data available). This product was summed for participating and nonparticipating students within weighting cells. The ratio of the sums for all sampled students to participating students was used as the nonresponse adjustment factor for each student's design weight.\nStep 4. Perform multidimensional raking. Sample members who were not freshened in the second follow-up had their second follow-up nonresponse adjusted weight further adjusted through a raking step. The total sum of the weights and percentage distributions that were used in raking were developed as follows: a) Targets were developed that used the second follow-up expanded sample weight. The second follow-up expanded weight is a weight that was calculated for every sample member in order to estimate national dropout rates .1°It was used in developing total sum of weights targets to ensure consistency in dropout rates derived when using questionnaire weights. These targets were calculated separately for each of the eight questionnaire weights and reflected the characteristics of each weight's inference population. Two types of target numbers were developed. The sum of expanded weights for a given questionnaire weight's inference population was used as the target total population for that questionnaire weight. Weighted frequency distribution using the expanded weights associated with a questionnaire weight's inference population were calculated for the following: dropout rates between base year and first follow-up; dropout rates between first follow-up and second follow-up; and first follow-up status (from step 1) and second follow-up status (from step 1). b) Additional percentage targets were developed for raking using first follow-up weights. Calculated independently for each of the eight weights according to the characteristics of each inference population, these targets used FlIQWT for sample members who had been eligible for the first follow-up questionnaire or the first follow-up design weight for those who were not. Weighted frequencies calculated using these weights were used as target distributions. These target categor'Qs included race (white, black, Hispanic, API, American Indian, unknown), gender, base year school region, base year school type, and base year school urbanicity. Results of Weighting. To check the second follow-up contextual weight, its statistical properties were analyzed. Table 3.2.3-2 displays the mean, variance, standard deviation, coefficient of variation, minimum, maximum, skewness, and kurtosis for the weight. Tables showing results for the remaining weights can be found in the student, transcript (transcript weight), and parent (parent weight) data file user's manuals and the NELS:88 Second Follow-Up Sample Design Report."}, {"section_title": "Calculation of First Follow-Up Sample Weights", "text": "Two weights were developed for the overall NELS:88 first follow-up sample. The first, or basic, weight applies to all members of the first follow-up sample who completed a first follow-up questionnaire, regardless of their participation status in the base year. The basic weight (F 1QW1) allows projections to the population consisting of all persons who were either in the eighth grade during the 1987-88 school year or in the tenth grade during the 1989 -90 school year. Thus, this population encompasses both populations of prime analytic interestthe population of 1990 tenth graders (including those who were not eighth graders in 1988) and the 1988 eighth-grade population (excluding any additional 1990 tenth graders). By selecting the appropriate sample members, analysts can use this basic weight to make unbiased projections to the first of these populations (i.e., 1990 tenth graders). The second, or panel, weight applies to all members of the first follow-up sample with complete data from both rounds of the study. The panel weight (F1PNLWT) can be used to make projections to the other key analytic population--1988 eighth graders (excluding those ineligible for base year data collection). In the first follow-up a contextual weight was not developed for use with the school administrator and teacher data. Because students were subsampled in the first follow-up and all NELS:88 schools they attended were included in the school administrator sample, a contextual school weight was not necessary."}, {"section_title": "r 4", "text": "F2: Teacher Component Data File User's Manual Analysts who are interested in performing analyses of first follow-up student data in conjunction with the first follow-up school administrator data should use the first follow-up basic student weight, F 1QWT. In the second follow-up, students were not subsampled, but only a subset of schools attended by the NELS:88 cohort was included in the school administrator sample, and a special contextual weight, F2CXTWT, was developed for cross-sectional analysis with second follow-up school data. Analysts who are interested in comparing both first follow-up and second follow-up contextual data for students should refer to the following section for a complete description of the uses of the second follow-up contextual weight, F2CXTWT."}, {"section_title": "Calculation of Second Follow-Up Weights include:", "text": "Explanation of Weights. Eight weights were developed for inclusion on the data files. They"}, {"section_title": "F2QWT", "text": "This cross-sectional weight applies to all members of the second follow-up sample who completed a second follow-up questionnaire, regardless of their participation status in previous rounds. It allows projections to the population consisting of all persons who were either in the eighth grade during the 1987-88 school year, in the tenth grade during the 1989-90 school year, or in the twelfth grade .n the 1991-92 school year. By selecting the appropriate sample members with the flag G12COHRT, analysts can use F2QWT to make unbiased projections to such populations as 1992 twelfth graders. F2CXTWT This cross-sectional weight applies to students who attended the schools selected for inclusion in the teacher and school administrator components and who completed a second follow-up questionnaire. The population was .restricted to early graduates and students who were in the schools during spring data collection. This weight allows analysts to generate national statistics using the school administrator and teacher data despite the bias against small cluster sizes in sample selection. F2PNLWT This panel weight applies to sample members who completed a questionnaire in all three rounds of NELS:88. This can be used to make projections to the population of 1988 eighth graders. F2F1PNWT This panel weight applies to all sample members who completed both a first follow-up and a second follow-up questionnaire, regardless of base year status. This allows projections to the population consisting of persons who were in the eighth grade in 1988 or in the tenth grade in 1990. By selecting appropriate sample members with the flag F2F1PNFL, analysts can use F2F1PNWT to make projections to such populations as 1990 tenth graders. F2TRSCWT This cross-sectional weight applies to all early graduates, dropouts, students in sampled schools during spring data collection, and all sample members who were both ineligible for all three rounds of NELS:88 and were in the twelfth grade during the 1991-92 school year for whom we received a transcript. F2TRP1VVT This panel weight applies to sample members who were participants in 1988, 1990, and 1992 (all three rounds of NELS:88) and for whom transcript data are F2TRP2Vir This panel weight applies to sample members who were participants in 1990 and 1992 (the first and second follow-up) and for whom transcript data are available. F2TRP2WT allows analysts to perform panel analyses using transcript data in conjunction with 1990 and 1992 test and questionnaire data. F2PAQWT This cross-sectional weight applies to all students for whom a parent questionnaire was collected during the second follow-up. The Second Follow-Up Contextual Weight: Cross-sectional and Panel Analyses. F2CXTWT is to be used in cross-sectional analyses of second follow-up teacher and school data in conjunction with the student and dropout data. A contextual panel weight was not developed for analysis of contextual data across rounds of NELS:88. Researchers who are interested in using prior rounds of teacher or school administrator data in conjunction with second follow-up contextual data should use the second follow-up contextual weight, F2CXTWT, instead. Due to factors such as nonresponse in prior rounds, this weight is not as precise as a contextual panel weight but is a functional approximation.' Process for Calculation of Second Follow-Up Weights. A basic four-step process was defined for the calculation of all eight questionnaire weights. The first step, developing a classification scheme, was done at the beginning of the weighting process for all students in the sample. The values remained static and were used for all weights. Steps 2 through 4 were followed for all weights, but the results of each were tailored according to the characteristics of each weight's specific population. Step 1. Develop a classification scheme. All sample members were divided into sample groups depending on their status during data collection for each round of NELS:88. Freshened students were assigned the status of their linked student. Students whose status was unknown had their status imputed based upon the distribution of status across others in their base year, first, or second follow-up categories and, where group size permitted, race and gender were also considered. The basic classifications for a single round are: Researchers should exercise caution when employing the contextual weight, F2CXTWT, in a panel analysis. In particular, they should carefully assess bias relative to the subpopulations of interest and their specific analytic goals. It may also be desirable to compare results obtained from alternative weighting \"approximations\" (e.g., for 1988-1992, F2TRP1WT) to determine which provides the best result. In this classification scheme, \"dropout\" (following the High School and Beyond definition) refers to a student who has left a diploma-granting high school program. This included, members who were not pursuing an education at all, home study students, members who were continuing their education in a non-traditional setting (e.g., preparing for the GED examination), and institutionalized sample members. There are two exceptions to this general rule. First, early graduates were included in the \"in school\" category. Second, because sample members in non-traditional schools during the first follow-up were classified as students then, they were treated as such during the calculation of their first follow-up status. \"Ineligible\" refers to members who were not surveyed due to a language barrier or a mental or physical incapacity. \"Expected grade\" means tenth grade in the first follow-up and twelfth grade or early graduate in the second follow-up. Step 2. Establish second follow-up design weight. The design weight reflects the selection probabilities for each case for a given population. Sample members may have multiple design weights that vary depending upon the weight that is being calculated. For the weights unaffected by school sampling (F2QWT, F2PNLWT, F2F1PNWT) and for the dropouts, early graduates, and ineligible twelfth graders in F2TRSCWT, the design weight used is equal to the first follow-up design weight.' Second follow-up freshened students take on the first follow-up design weight of the student they were linked to in the freshening process. When sample members are included due to their association with a sampled school in F2TRSCWT and for all members in the F2CXTWT population, it is equal to the first follow-up design weight divided by their school's second follow-up selection probability. For students represented in the parent sample, the calculation of F2PAQWT uses the first follow-up design weight divided by the parent's second follow-up selection probability. Step 3. Adjust for second follow-up nonresponse. Nonresponse adjustment cells were based upon combinations of the classification values from step 1 as well as race (Hispanic, API, other, unknown), and gender for the members of that weight's population. The second follow-up design weight for each responding sample member was inflated by a factor equal to the inverse of the weighted response rate for their cell. This yielded their nonresponse adjusted weight. This step was performed independently for each weight calculated. For second followup freshened students the nonresponse adjusted weight serves as their final weight."}, {"section_title": "9", "text": "Included in the transcript data files are approximately 90 students who were ineligible in all three rounds of NELS:88 and were seniors in 1992."}, {"section_title": "3.3", "text": ""}, {"section_title": "Standard Errors and Design Effects", "text": "In this section we discuss the calculation of standard errors as a measure of sampling variability in survey results; the standard error is an estimate of the expected difference between a statistic from a particular sample and the corresponding population value. to For sample members not freshened in the second follow-up, the process involved using a multidimensional raking procedure to adjust the second follow-up design weight where the marginal target categories were !)ased on roster race (API, Hispanic, other, unknown) and gender, base year school type, base year school region, base year school urbanicity, and the status values from the classification scheme described above in step 1. Target margins for the expanded weight were calculated using the first follow-up expanded sample weight (a similar weight developed in the first follow-up for estimating the 1988-90 dropout rate) for students for whom one was calculated and first follow-up design weights for the first follow-up sample members who did not receive a first follow-up expanded weight (such as the freshened). Second follow-up freshened students have their second follow-up design weight as their expanded sample weight. This step was performed for the sample as a whole.  Survey Standard Errors. Because the NELS:88 sample design involved stratification, disproportionate sampli.ig of certain strata, and clustered (i.e. multi-stage) probability sampling, the resulting statistics are more variable than they would have been had they been based on data from a simple random sample of the same size. The calculation of exact standard errors for survey estimates can be difficult and expensive. Popular statistical analysis packages such as SPSS (Statistical Program for the Social Sciences) or SAS (Statistical Analysis System) do not calculate standard errors by taking into account complex sample designs. Several procedures are available for calculating precise estimates of sampling errors for complex samples. Procedures such as Taylor Series approximations, Balanced Repeated Replication (BRR), and Jackknife Repeated Replication (JRR) produce similar results.\" Consequently, it is largely a matter of convenience which approach is taken. For NELS:88, NORC used the Taylor Series procedure to calculate the standard errors. Design Effects. The impact of departures from simple random sampling on the precision of sample estimates is often measured by the design effect (designated as DEFF). For any statistical estimator such as a mean or a proportion, the design effect is the ratio of the estimate of the variance of a statistic derived from consideration of the sample design to that obtained from the formula for simple random samples. The square root of the design effect (also called the root design effect, and designated as DEFT) is also useful. The following formulas define the design effects and root design effect: where DESIGN-SE designates the standard error of an estimate calculated by taking into account the complex nature of the survey design, and SRS-SE designates the standard error of the same estimate calculated as if the survey design was a simple random sample."}, {"section_title": "Base Year Standard Errors and Design Effects", "text": "Selection of Base Year Items. Standard errors and design effects were selected for 30 means and proportions based on the NELS:88 base year student, school, and parent data.\" The 30 variables from the student questionnaire were selected to overlap as much as possible with those variables examined in High School and Beyond. The remaining variables from the student questionnaire and from the parent and school questionnaires were selected randomly from each topical, section of each questionnaire. Standard errors and design effects were calculated for each statistic both for the sample as a whole and for selected subgroups. For both the student and parent analyses, the subgroups were based on the student's sex, race and ethnicity, school type (public, Catholic, and other private), and socioeconomic status (lowest quartile, middle two quartiles, and highest quartile). For the school analysis, the subgroups were based on two levels of school type (public and combined private) and eighth-grade enrollment (at or below the median and above the median)."}, {"section_title": "First Follow-Up Standard Errors and Design Effects", "text": "Standard errors and aesign effects were also calculated for 30 means and proportions based on the NELS:88 first follow-up student and dropout data.\" The goal was to estimate standard errors/design effects for all respondents including dropouts, on the one hand, and separately for dropouts, on the other. Because a special contextual weight was not constructed in the first follow-up, standard errors and design effects were not calculated separately for the school component."}, {"section_title": "Second Follow-Up Standard Errors and Design Effects", "text": "Standard errors and design effects were also calculated for 30 means and proportions based on the NELS:88 second follow-up student, dropout, and parent data. As in the first follow -up analysis, the goal was to estimate standard errors/design effects for all respondents including dropouts and separately for dropouts. Selection of Second Follow-Up Items. The same selection criteria were used for all components in selecting the items for standard error and design effect analysis. The first criterion was whether a question had been used in the NELS:88 base year analyses of standard errors and design effects. Because some items included in the base year standard error and design effect analysis were not repeated in the second follow-up, it was necessary to select new items for the analysis. Policy relevance was the criterion for selecting the remaining items. This criterion was applied in order to ensure that variables that are important to analysts, thus likely to have a higher frequency of use, were represented. ThcQe remaining items consisted primarily of critical items in the student questionnaire. For the contextual For a more detailed presentation of design effects for individual items for the total sample and for various subsamples, see the NELS:88 Base Year Sample Design Report. For tables of base year parent and school administrator questionnaire data standard errors and design effects, see the respective base year data file user's manuals, or the sample design report. For a more detailed presentation of the first follow-up design effects for individual items for the total sample and for various subsamples, see the NELS:88 First Follow-Up: Student Component Data File User's Manual. F2: Teacher Component Data File User's Manual sample, standard errors and design effects were calculated using the contextual weight for the same 30 variables employed for the student component standard error and design effect analysis discussed in Chapter III of the NELS:88 Second Follow-Up: Student Component Data File User's Manual. Results. Standard errors and design effects were calculated for each of the items for the sample as a whole and for selected subgroups. The subgroups were based on the respondent's sex, race/ethnicity, school type (public, Catholic, and other private), socioeconomic status (lowest quartile, middle two quartiles, and highest quartile), and uxbanicity (urban, suburban, and rural. The standard errors and design effects were calculated using the second follow-up contextual weight, F2CXTWT. (A description of the contextual weight is presented in section 3.2.3.) Results for the student questionnaire items are shown in Tables 3.3.4-1 and 3.3.4-2."}, {"section_title": "Additional Sources of Nonobservational Error", "text": "Analysis of survey error is important for understanding the potential bias in making inferences from an obtained sample to a population. Sampling errors occur because the data are collected from a sample rather than a census of the population. Sampling error analyses for NELS:88 (documenting standard errors of measurement and design effects for key variables) were presented earlier in this chapter (see section 3.3). In this section, other sources of nonobservational error are discussed. Nonobservational error results from measurements not being taken from a portion of the population.' Several factors comprise nonobservational error, including nonresponse biases caused by unit and item nonresponse and undercoverage. Nonresponse is readily quantified. While many data quality factors are difficult to measure in the non-experimental context of large-scale survey administration, NELS:88 offers the possibility of comparing reports from multiple sources, thereby permitting some approximate but useful validity parameters. Following is a discussion of nonobservational error in the teacher component in terms of nonresponse., A detailed discussion of student undercoverage appears in the NELS:88 Second Follow-Up: Student Component Data File User's Manual."}, {"section_title": "Second Follow-Up Unit Nonresponse", "text": "Unit nonresponse occurs w' en an individual respondent (such as a teacher, student, or school administrator) declines to participate, or when the cooperation of a school cannot be secured. In the base year, an analysis of school-level nonresponse suggested that, to the extent that schools can be characterized by size, control, organizational structure, student composition, and so on, the impact of nonresponding schools on the quality of the student sample is small (for details, see the NELS:88 Base Year Sample Design Report, pp. 33-39). School nonresponse has not been assessed in the second followup for two reasons. First, there was very little school-level nonresponse--the school administrator questionnaire completion rate exceeded 97 percent. Second, the second follow-up sample was studentdriven, unlike the base year sample. Hence, even if a school refused, the individual student was pursued outside of school. The effect of student-level nonresponse within the responding schools was not assessed in the base year, although males, blacks, and Hispanics tended to be nonparticipants more often than females, whites or Asians. The effects of individual nonparticipation in the base year, first and second follow-ups will be systematically examined, and reported in future NELS:88 documentation. 14 Groves, R. M., Survey Errors and Survey Costs. New York: John Wiley and Sons, 1989, page 11. 43    Analysis of survey error is important for understanding potential bias in making ,inferences from an obtained sample to a population. Sampling and nonsampling errors are the key constituents of total survey error. Sampling error is quantified through the standard errors and design effects for key variables. There are various sources and types of nonsampling measurement error, including estimate error or bias associated with unit (individual) nonresponse and item nonresponse. This section reports specifically on nonsampling error as a function of item nonresponse. In addition to its role as a potential source of bias, item nonresponse also has the effect of diminishing the number of observations that can be used in calculating statistics from affected data elements and thus increases sampling variances. Since item nonresponse is an important potential and uncorrected source of data bias, it is necessary to measure its impact so that analysts can properly take potential response biases into account. Item nonresponse occurs when a respondent fails to complete certain items on the survey instrument. While bias associated with unit nonresponse has been controlled by making adjustments to case weights, item nonresponse has generally not been compensated for in the NELS:88 teacher component data set. There are two exceptions to this generalization. The first exception is machine editing, through which, occasionally, certain nonresponse problems are rectified by imposing inter-item consistency, particularly by forcing logical agreement between filter and dependent questions. Thus, for example, the missing response to a filter question can often be inferred if the dependent question has been answered. Because the edited files were used in the nonresponse analysis reported below, this adjustment to item nonresponse is reflected in the results of the analysis. The second exception is that some key student-level classification variables have been constructed in part from additional sources of information when student data are missing. Thus, data from school records (for example, student sex or race/ethnicity as given on the sampling roster) or other respondent sources (for example, the new student supplement) have been used to replace missing student data. Because composite variables were not included in the nonresponse analysis, this adjustment of missing data is not reflected in the statistics reported below. A further point to note is that there may be some hidden nonresponse in the NELS:88 questionnaires that is impossible to quantify. This is the case because for a few questions, a \"mark all that apply\" format was used. While such a format results in slightly less burden on the respondent, it also makes it impossible to distinguish between a negative response and nonresponse. This conflation of negative response and nonresponse creates the potential for nonresponse biases that cannot be measured and thus cannot become the basis for precise warnings to users about the limitations of data. A final point to note is that, implicitly, unit nonresponse is a further source of missing item datathat is, nonparticipating teachers complete no questionnaire items. Because no special teacher weight adjusts for teacher-level nonresponse, analysts cannot compensate for the bias that arises if nonrespondents would have answered the questionnaire differently than respondents. For this reason, \"total response\" should be thought of as the survey (unit) response rate times the item response rate. For the second follow-up teacher survey, the student-level, teacher coverage rate is 90.7 percent, and the item response rate is 89.4 percent. Together they yield a total response of 81.1 percent. Two objectives structure this item nonresponse analysis. One objective is to quantify mean questionnaire nonresponse overall. A second objective is to describe nonresponse patterns in terms of questionnaire item characteristics. In order to realize the first objective, average nonresponse rates were calculated for each item. In order to fulfill the second objective, nonresponse was measured as a function of three characteristics: 1) position in the questionnaire; 2) topic; and 3) whether the item was contingent on a filter. Population and Data File Definitions. Definition 1: \"Item\" For purposes of this analysis, \"item\" refers to each data element or variable. For a question composed of multiple subparts, each subpart eliciting a distinct response is counted as an item for item nonresponse purposes. Thus, a single question that poses three subquestions is treated as three variables. Definition 2: \"Response Rate\" NCES standards stipulate that item response rates (Ri) \"are to be calculated as the number of respondents for which an in-scope response was obtained (i.e., the response conformed to acceptable categories or ranges), divided by the number of completed interviews for which the question (or questions if a composite variable) was intended to be asked.\": Ri weighted # of respondents with in-scope responses weighted # of completed interviews for which question was intended to be asked In-scope responses were considered to be valid answers (including a \"don't know\" response when this was a legitimate response option). Out-of-scope responses were multiple responses to items requiring only a single response, refusals, and missing responses."}, {"section_title": "Definition 3: \"Analysis Populations\"", "text": "Item nonresponse analysis population. Each student who completed a student questionnaire and for whom a teacher report in mathematics or science is included on the teacher component data file. Definition 4: \"Teacher Questionnaire Data File\" The public use teacher file with machine-edited, student-weighted data were used as the basis for the analysis. Nonresponse rates of composite and other constructed variables were not examined in this analysis. Definition 5: \"Nonresponse\" For the teacher questionnaire several numerical reserved codes were used to categorize nonresponse. The reserved codes and definitions appear below. The first three--reserved codes 6, 7 and 8--define out-of-scope or illegitimate nonresponse, and were used as the basis for this nonresponse analysis. 6 = Multiple Response. For an item that required one response only, the respondent marked more than one response, and the multiple response could not be resolved. 63 47 F2: Teacher Component Data File User's Manual 7 = Refused Critical Item. Respondent was unwilling to answer the question at the time of the questionnaire administration and upon nonresponse follow-up by survey administrators. 8 = Missing. The response datum is illegitimately missing. That is, a datum that should be present for this respondent is missing. 9 = Legitimate Skip. The response datum is legitimately missing. That is, owing either to responses to preceding filter questions or to other respondent characteristics data for this item should not be present for this respondent. Responses under reserved code 9 were not included in the nonresponse analysis. DK = \"Don't Know\". \"Don't Know\" is often used as a nonresponse code. In the NELS:88 data set, \"Don't Know\" is embedded as a legitimate response category in some of the questionnaire items. For purposes of this analysis, \"Don't Know\" was not classified as a nonresponse. Item-level Nonresponse. Table 3.4.1-1 shows descriptive statistics for teacher questionnaire item nonresponse overall and for items grouped into categories depending upon their position in the questionnaire, the topic they addressed, and whether they were part of a skip or filter pattern. The mean item nonresponse rate for the NELS:88 second follow-up teacher questionnaire is 10.6 percent. Mean teacher item nonresponse compares favorably with other second follow-up questionnaire item nonresponse rates, for example student (12.1 percent) and school administrator (15.5 percent). During the survey's closing stages, one math or science teacher of 715 NELS :88 second followup students (6.6 percent) was administered an abbreviated questionnaire by telephone. Abbreviated teacher questionnaires were administered when necessary to gain teacher cooperation. The teacher abbreviated survey consisted primarily of items designated as critical. While administration of abbreviated questionnaires necessarily decreases mean item response, teacher mean item nonresponse remains well below student and school administrator mean item nonresponse. Appendices F and G list the critical items in the teacher questionnaire and the abbreviated teacher questionnaire items respectively. Higher levels of teacher survey item response can be attributed to two factors: fewer teacher items dependent on a filter question, and more teacher questionnaire critical items than either the student or dropout questionnaires. The following paragraphs examine these factors more closely. Item-level Nonresponse by Item Placement and Characteristic: Teacher Questionnaire. Respondent burden associated with the length of the second follow-up teacher questionnaire may have contributed to item nonresponse. Mean item nonresponse in the final third of the teacher questionnaire is 15.8 percent, compared with 6.7 percent in the first third and 9.: percent in the second third. Item Nonresponse by Topic. Most teacher questionnaire topics appear to be subject to uniform nonresponse rates as displayed in table 3.4.1-1. Topics which exhibit high item nonresponse rates usually occur at the end of the instrument and are usually dependent on a filter item. One example of this phenomenon is the group of questions which ask teachers to describe teacher enrichment programs (F2T4_18 F2T4_21). Most of these items occur on the last page of the questionnaire. Respondent burden was a likely contributor to nonresponse in these items. Additionally, nonresponse at the filter question which precedes the teacher enrichment items was carried through to the dependent items, compounding nonresponse in the dependent items.  Section two, \"Class Information,\" question 16 (F2T2_16), is an exception. This item asks math teachers to answer a mathematical word problem. Math teachers avoided this question in large numbers (23.8 percent) when compared to the mean item nonresponse rate for the \"Class Information\" section (7.3 percent). During data collection, many teachers expressed their displeasure with question 16. This displeasure undoubtedly contributed to nonresponse in F2T2_16. em N nr RQekylepgi Aen cethn Fil ter Qugati o Second follow-up teacher questionnaire nonresponse is twice as great in items dependent on a filter question. Dependent items carry with them missing data from the corresponding filter item. Teacher questionnaire filter items would probably have benefitted from the High School & Beyond practice of making nearly all filter items critical and thus subject to retrieval. The nonresponse rates reported here for items dependent on a filter question are inflated to the extent that the rates contain \"hidden skips.\" Hidden skips are those missing responses that would have been skips had the respondent answered the appropriate filter item. Unfortunately it is not possible to quantify hidden skips. Teacher survey item response rates may be higher relative to second follow-up student and dropout item response rates because fewer items are dependent on a filter question. Only 40.8 percent (169 items) of the teacher questionnaire's items are dependent on a filter compared with 46.7 percent (224 items) in the dropout questionnaire, and 50.9 percent (287 items) in the student questionnaire. Teacher Survey Item-Level Nonresponse by Critical Items. The nonresponse rate for teacher survey critical items is 7.2 percent, well above the rate found in the second follow-up student questionnaire (3.3 percent) or the second follow-up dropout questionnaire (4.2 percent). The teacher instrument contains 165 critical items, triple the number in the student questionnaire (50 items), and well F2: Teacher Component Data File User's Manual above the number (110 items) in the dropout instrument. While a longer retrieval interview made it more difficult to retrieve all of the teacher critical items, the greater number of items designated as critical nay have contributed to the increased overall teacher response rate. Table 3.4.1-2 lists the weighted and unweighted nonresponse rates for the critical items. Summary and Conclusions. Second follow-up teacher questionnaire item response rates benefitted from the inclusion of fewer items dependent on a filter question, and more critical items than either the student or dropout questionnaires. Mean weighted teacher questionnaire total response, 81.1 percent, is well within the NCES standard. NCES's standard asserts that total weighted response (unit nonresponse multiplied by item nonresponse) should be at least 70 percent. Second follow-up teacher questionnaire total response compares favorably with second follow-up student questionnaire total response (80.1 percent) and second follow-up dropout questionnaire total response (77.4 percent     "}, {"section_title": "IV. Data Collection", "text": "This chapter describes the data collection procedures for all components of the NELS:88 second follow-up: student and dropout, teacher, school administrator, parent, and academic transcript and course offerings. The design of the second follow-up closely resembled that of the first follow-up and was executed in three phases which spanned two years. Self-administration and telephone administration were the primary modes of data collection for the components of the second follow-up. Although data collection did not occur for the teacher component until the third phase of the study in 1992, pre-data collection activities related to the teacher component were conducted in the first and second phases of the study in 1991. Phase three was conducted i 1992 and constituted the data collection effort. Figure 4-1 summarizes the activities conducted during the three phases of the second follow-up."}, {"section_title": "4.1", "text": "Second Follow-Up Pre-Data Collection Activities Phase 1. Conducted from January through June 1991, phase 1 involved securing state, district, and school-level cooperation for the study as well as tracing sample members. State cooperation with NELS:88 was secured for all fifty states and the District of Columbia. District and school-level cooperation were secured for first follow-up schools with four or more sample members still in attendance in the spring of 1991. Tracing sample members served two purposes: defining the schools to be included in the second follow-up sampling process and locating sample members for data collection. As in the first follow-up, the second follow-up study was designed such that only students attending a school included in the second follow-up school sample would receive the full complement of contextual data including teacher and school administrator reports. To maximize the number of students to receive the full complement of contextual data, interviewers attempted to trace all sample members to either their first follow-up school of attendante or to a new school. Once students were traced to a school, the second follow-up school sample was drawn such that the greatest number of students would be included in the school sample and receive the full complement of contextual data. The second purpose of tracing related to data collection. Interviewers attempted to trace students to their first follow-up or new school of attendance, and prior to the beginning of phase 2 the sample of second follow-up schools was finalized. If an interviewer was unable to confirm school enrollment for a cohort member through the first follow-up school or a new school, the interviewer traced the sample member to a home address to confirm that the student was enrolled in a school or that tti student had left school. Through tracing students to a first follow-up school, a new school, or a home address, and through the selection of the schools to be included in the second follow-up school sample, interviewers were able to forecast whether a student's data would be collected through a second follow-up school or if a sample member would need to be contacted separately during data collection. Confirmation of a sample member's enrollment status determined which type of questionnaire--student or dropout--the sample member would be administered during the data collection period. Phase 2. From September to December 1991, phase 2 pre-data collection activities occurred for all components of the study, and some phase 1 activities continued. District and school-level cooperation was gained for any schools selected for the second follow-up sample for which cooperation was not gained in phase 1. Tracing continued for sample members who were not located during phase 1, and enrollment was verified again for students who were traced to a school which was selected for the second follow-up school sample. Students attending a school not included in the second follow-up school sample 7 1  and sample members who had left school were also traced again to their school of attendance or to a home address. Table 4.1-1 summarizes the results of district and school contacting and student tracing in phases 1 and 2. Interviewers visited each of the second follow-up schools to conduct activities in preparation for data collection for all components of the study. For student data collection, they scheduled in-school data collection sessions and worked with school personnel to identify how parental permission for surveying students would be gained for an individual school. Using school rosters, interviewers freshened the student sample to allow a random sample of twelfth graders who were previously excluded from the study because, for example, they were not in the U.S. or in the eighth grade in 1988, and did not have a chance to be selected for the base year sampling frame. See Chapter III of the NELS:88 Second Follow-Up: Student Component Data File User's Manual for a complete discussion of freshening the student sample. This column represents the portion of the phase 1 sampled schools (N=1,500) that had at least one core sample member still enrolled at the end of the school contacting phase (phase 2) of the study. These numbers reflect the schools at which cooperation with the study was gained rather than the final subset of NELS :88 schools whose students were included in the contextual sample. Data were collected for the contextual components (the teacher, school administrator, parent, academic transcript, and course offerings components). To identify the sample for the teacher survey, they compiled the names of mathematics and science teachers of the student sample members. Interviewers alerted school administrators to the questionnaire that they would receive during data collection. Interviewers collected parent address and telephone information for the parent survey. Course catalogs were collected, and interviewers collected samples of student transcripts to inform data collection and data preparation for the high school transcript component. Final Tracing Results. After the tracing of sample members was comeleted, 97.3 percent (N=20,623) of the 21,188 second follow-up sample members had been located. Agure 4-2 illustrates the results of the second follow-up locating efforts. Of the 21,188 sample members, 83.3 percent were enrolled in high school, 8.2 percent were verified dropouts, 0.5 percent were identified by school officials as dropouts but were not confirmed as such, 4.1 percent were sample members who had already completed an alternative program, 1.3 percent were deemed ineligible to participate in the second followup study (e.g., deceased or moved out of the country), and 2.7 percent could not be located. (Due to rounding, the above percentages sum to 100.1 percent)."}, {"section_title": "4.2", "text": "Second Follow-Up Data Collection Activities Phase 3. Data collection for the second follow-up was conducted from January through December 1992. Although the data collection periods of the individual components of the study were staggered, there was a high degree of overlap between the data collection periods of the individual components, and most data were collected from January through June 1992, the spring term of the 1991-1992 acadeinic year. Figure 4-3 shows the field periods of each component of the study. Most of the components of the survey utilized more than one mode of data collection, usually self-administration and telephone administration of the survey instruments. In some cases abbreviated versions of the instruments were implemented as discussed in Chapter II of this manual."}, {"section_title": "Teacher Survey", "text": "The teacher survey was designed to articulate with the student cognitive tests and included one mathematics or science teacher of students at NELS:88 sampled schools when the student was enrolled in one of these classes. To minimize the amount of time between the collection of the student and teacher data, either the fall or spring term teacher was selected depending on when student data were collected at a school, and the questionnaires were mailed to the teachers in two waves. Eighty percent of sampled students at NELS:88 schools who were enrolled in a mathematics or science class were instructed by the same mathematics or science teacher during the entire 1991-1992 academic year, and 20.0 percent were instructed by different teachers in the fall and spring. Of the 20.0 percent who were instructed by different teachers, 17.5 percent of students were instructed by fall term teacher, and 2.5 percent of students were instructed by only the spring term teacher. For students who had different mathematics or science teachers in the fall or spring term, the fall term teacher was mailed a questionnaire 'n early February if the in-school data collection session at a student's school was scheduled for a date before April 1, 1992. If the data collection session was scheduled on or after April 1, then the spring term teacher was mailed a questionnaire in early March 1992. Since most in-school data collection occurred during January through March of 1992, teachers of most students were mailed a questionnaire in early February. This design was based on the assumption that, if the student's fall and spring teachers were different, in the first three months of the spring term, the fall term teacher would be more familiar and able to assess the student than the spring term teacher would be. On or after April 1, it was assumed that the spring term teacher had sufficient exposure to the student in order to make a full assessment of the student and that three months after the beginning of the spring term, the fall term teacher might have difficulty recalling the student's performance. After identifying whether the fall or spring term teacher would be selected for the teacher survey, the subject area of a student's teacher report was determined. If the student was enrolled in only one class out of the two subject areas, mathematics or science, then the one teacher was selected. However, Because this information is not available to many parents until the end of their teenager's senior year, parent data collection began in May 1992, to ensure that parents could answer these questions fully. if the student was enrolled in both mathematics and science, the subject area of the teacher report was the same as the base year selected subject for the student. Some students who were enrolled in both a mathematics and a science class were added to the first follow-up or second follow-up through freshening. For the freshened students who were enrolled in both mathematics and science, the subject area of the student's teacher report was the base year selected subject of the student's linked partner in the freshening procedure. Two weeks after the teacher questionnaires were mailed, nonresponding teachers were prompted for the return of the questionnaire with a postcard reminder. Beginning two weeks after the postcard reminder was mailed to teachers, nonresponding teachers were prompted for the return of the questionnaire over the telephone. Interviewers attempted to interview over the telephone any teachers who did not respond within two weeks after the postcard and telephone prompts. Figure 4-4 shows the number and percentage of the 5,657 teachers on the file who completed a self-administered questionnaire, a telephone-administered questionnaire, and a telephone-administered abbreviated questionnaire. Figure  4-5 illustrates the mode of completion of the teacher instrument for the 10,861 students who were eligible for the teacher component, and for whom student data are also available. To minimize mode effects between self-administration and telephone administration of the instrument, interviewers were trained to adapt the questions to make sense when read over the telephone. Additionally, teachers were asked to read along in the questionnaire during the telephone interview if they had the copy of the questionnaire mailed to them."}, {"section_title": "Second Follow-Up Student Survey and Cognitive Tests", "text": "In-school Survey Sessions. From January to June 1992, in-school survey sessions were held in all cooperating NELS:88 schools still enrolling second follow-up sample members. Second follow-up data collection procedures were very similar to those used in the first follow-up. Student questionnaires and cognitive tests in math, science, reading, and social studies were administered at in-school, group data collection sessions averaging approximately 9 students. Survey administration was usually conducted in a school classroom or library and consisted of several steps. Students first completed the student questionnaire, and, if applicable, the new student supplement of he early graduate supplement. Students who had transferred into or out of a school within the two weeks prior to the survey session were asked to report on their previous school of attendance. Transfer students who had been at the surveyed school for two weeks or longer were asked to report on their current school. After the students completed the student questionnaires, an 85 minute battery of cognitive tests was administered. The tests consisted of four timed sections devoted to mathematics, reading, science, and social studies (history/citizenship/geography). Once the test battery was completed, an attempt was made to retrieve missing (or inappropriately marked) questionnaire items before the student left the classroom. Interviewers reviewed the questionnaires to ensure that all critical items were completed. An oval indicating \"no retrieval\" was marked whenever the missing data could not be retrieved due to respondent refusal or inability to clarify a vague response. At the end of the survey session, arrangements were made to conduct make-up sessions for students who were scheduled but unable to attend the initial survey session or whose schedules required that they leave before completing both instruments. If fewer than five students were scheduled for a make-up session, school staff were asked to handle the arrangements and oversee its administration; however, to ensure respondent confidentiality, school staff were prohibited from reviewing the student 62 C to Figure 4-4 NELS:88 second follow-up teacher questionnaires completed by mode of administration for teacher: with at least one student participant (N=5,657) 7.7%"}, {"section_title": "Abbreviated Version Telephone Administered", "text": "Questionnaires Figure 4-5 NELS:88 second follow-up mode of completion of teacher data for student participants eligible for, and included on the teacher public use data file (N=10,861)* *Note: The total student sample size for the teacher public use data file is 15,695. Of this total, 10,861 students were enrolled in a mathematics or science class and were iterefore eligible for the teacher study. The remaining 4,834 students were not enrolled in a mathematics or sciences lass and were ineligible for the teacher study. The variable F2SUBJCT in the teacher codebook contained in Appendix I illustrates this distribution. 64 64 F2: Teacher Component Data File User's Manual questionnaire for completeness. When five or more students were scheduled for a make-up session or when school staff were unavailable to conduct a make-up session, interviewers arranged a return visit to the school. The second follow-up study attempted to collect a complete questionnaire and cognitive test from students and dropouts; however, for some student sample members only an abbreviated version of the student or dropout questionnaire was collected, or the cognitive test was not collected at all. Off-campus Survey Sessions. Off-campus survey sessions, typically attended by one to three students, were conducted primarily from March to July 1992. Students who were not enrolled in sampled schools, who had missed in-school data collection sessions, or who were enrolled in schools that had refused to participate in the study were invited to off -campus sessions and administered the student questionnaire and cognitive tests. Dropouts were also asked to attend these sessions and were surveyed alongside sample members who were currently enrolled in school. As with in-school survey sessions, off -campus survey sessions in the second follow-up were nearly identical to those in the first follow-up. If a sample member was unable to attend an off -campus group survey session, he or she was surveyed either over the telephone or in-person. When the student questionnaire was administered over the telephone, cognitive test data were not collected."}, {"section_title": "Dropout Survey", "text": "The NELS:88 second follow-up dropout survey sought to interview all sample members who had left school prior to graduation, including both first follow-up dropouts who had not returned to school and sample members who dropped out after the first follow-up. All sample members appear on the student data file regardless of their spring 1992 enrollment status. Basic classification variables and test data appear for both students and dropouts, though dropout questionnaire data appear separately on the dropout component data file. School Enrollment Classification and Data Collection. In order to determine which sample members should complete a dropout questionnaire, school enrollment status was classified for all sample members during the spring of 1992. Four types of enrollment classifications were identified as illustrated by Figure 4-6. The first were high school students who were enrolled in a school which offered programs ending in the granting of a diploma. These students were administered the student questionnaire and the cognitive test battery. Early graduates were included in this classification, and were asked to report retrospectively on the school from which they graduated and to complete supplemental questions about their reasons for graduating early. The second type were sample members who dropped out of high school but later returned to a high school program to obtain a high school diploma. These sample members were administered the student questionnaire and, when possible, the cognitive test battery. The third type were sample members who dropped out of high school but went on to seek an equivalent to a high school diploma such as the General Educational Development test (GED). If an alternative completer had finished the requirements of his or her alternative program, a student questionnaire was collected from the student. If the alternative completer had not yet fulfilled the requirements for certification, the sample member was administered a dropout questionnaire. In both cases, the cognitive test battery was also administered when possible. Note: A within-round dropout-returnee is, in NELS:88 parlance, a \"stopout.\" During the second followup, a stopout was defined as a sample member who had dropped out of school at some point in the 1990-1991 or 1991-1992 school years, but had returned to school by the spring of 1992. A similar definition was employed in the NELS:88 first follow-up. In the above diagram the term \"dropin\" refers to a sample member who dropped out of high school, then returned to high school (making the sample member a stopout as described above), and then dropped out of high school again for a final time. The fourth type were dropouts receiving no academic instruction. These sample members had left their high school by the spring of 1992 and were not working toward an alternative certification. Dropouts were administered a dropout questionnaire and, when possible, the cognitive test battery. Regardless of whether a dropout completed a student or dropout questionnaire, data collection efforts for the dropout component of the second follow-up were similar to those in the first follow-up survey. Interviewers attempted to survey most dropouts in off -campus survey sessions with testing conditions similar to in-school sessions. For analytical purposes, sample members classified as alternative completers can be included or compared with either high school completers or dropouts. Additionally, alternative compieters can be examined separately, depending on the needs of the analyst. For a complete description of the dropout component, see NELS:88 Second Follow-Up: Dropout Component Data File User's Manual."}, {"section_title": "School Effectiveness Study", "text": "Because the NELS:88 second follow-up core study was conducted at 97.8 percent of the schools at which the school effectiveness study was conducted, data were collected for students in these schools using the same data collection procedures as second follow-up cohort students. Self-administered student questionnaires and cognitive tests were administered to SES students through both in-school and off -campus survey sessions. Unlike student cohort sample members, most SES students received an additional forty minute free-response cognitive test after they completed the eighty-five minute test battery. The subject area of the free-response test was randomly selected for each school in either mathematics or science. In the 247 participating SES schools, SES sample members were administered the student questionnaire and cognitive tests. If SES students missed in-school data collection sessions, they were surveyed at off -campus survey sessions. Unlike the data collection procedures for the student cohort sample members, SES students who were no longer attending the school with which they were associated were not pursued or surveyed; however, enrollment status was gathered for these students from the SES schools. The teacher, parent, transcript, and course offerings components were also conducted for the SES sample members. A more detailed discussion of the school effectiveness study will be presented in forthcoming documentation, which will accompany the release of those data."}, {"section_title": "Followback Study of Excluded Students", "text": "In the first follow-up study, most classification changes were made for a sample of students who had been excluded from the base year study. Of the 618 base year ineligible sample members (BYIs), 580 were located and 312 were reclassified as eligible during the first follow-up. (Table 4.2.4-1 in the NELS:88 Second Follow-Up Student Component Data File User's Manual contains additional completion rate data for the BYI study.) In the second follow-up, the remaining ineligible students--BYIs who were ineligible in the first follow-up or more rarely, students who were eligible in the base year but who became ineligible in the first follow-up through the occurrence of some sort of incapacitation--were pursued as a part of the Followback Study of Excluded Students. The Followback Study of Excluded Students (FSES) of the NELS:88 second follow-up attempted to reassess the eligibility status and ascertain the enrollment status of students who: 1) had been excluded because of linguistic, mental, or physical obstacles to participation when the baseline sample of eighth 8 67 F2: Teacher Component Data File User's Manual graders was drawn in the 1987-88 school 1,r, and were subsampled into the Base Year Ineligible Study in the first follow-up; 2) were eligible in the base year but became ineligible in the first follow-up; or, 3) were identified as ineligible when selected through the freshening process in the first follow-up. If the students had since become eligible for NELS:88, the followback study attempted to survey them. The followback study continued the first follow-up base year ineligible study for several purposes. First, if the 5.3 percent of the potential base year sample declared ineligible differed in key characteristics or outcomes from the sample of students included in NELS:88, this difference could bias baseline results and subsequent longitudinal measurements. By learning more about these excluded students and their current school enrollment status, one might correct for potential undercoverage bias that could affect key national estimates, such as dropping out between eighth and twelfth grade. Second, an individual's eligibility status could potentially change. A student excluded on language grounds in 1988 or 1990 could have gained sufficient proficiency in English by 1992 to complete the student questionnaire. Like the complementary activity of sample freshening, the followback study of excluded students helped to generate a nationally representative sample of twelfth-grade students. Third, eligibility rules were modified in the first follow-up and retained in the second follow-up to allow for completion of the student questionnaire in both Spanish and English. By giving 1988 and/or 1990 excluded students who could complete a questionnaire only in Spanish the opportunity to do so in 1992, the revised first follow-up eligibility rules were successfully carried back to the base year cohort. Data Collection Procedures. Data collection for the followback study of base year excluded students took place during the main study data collection effort between April and October 1992. Interviewers attempted to identify excluded students who were eligible to be added to the longitudinal sample in the second follow-up. They obtained the following information about the excluded student from the student's current school, school last attended, or the student's home: Sex (if unknown): male or female; Race/ethnicity (if unknown): white, black, Hispanic, Asian/PI, American Indian, other; School enrollment status: student, dropout, or dropout in alternative program; and, Eligibility: English/Spanish language proficiency, lack of mental or physical disability (i.e., ability to complete a questionnaire), reading ability level of at least eighth grade. After collecting the above information about the students, interviewers attempted to identify whether or not the student was capable of meaningful participation in the survey under normal conditions. To make this assessment, interviewers were instructed to obtain reports from persons with first-hand knowledge of the students, such as a special education teacher, a bilingual teacher, a language arts teacher, or a guidance counselor. Interviewers often spoke with several staff members to identify the staff member who was most qualified to assess whether or not the student could participate. Unless there were severe mental or physical disabilities or lack of facility with written English or Spanish and the member was unable to complete the survey instruments under normal circumstances, the student was considered eligible to participate in the study. Eligibility information was gathered for 94.7 percent of the excluded sample members. For excluded students who were identified as eligible, student or dropout questionnaires were administered 68 8b F2: Teacher Coniponent Data File User's Manual either in-person or over the telephone. Cognitive tests were administered to a small percentage of these students. For students who remained ineligible, school enrollment status and other key characteristics were obtained."}, {"section_title": "School Administrator Survey", "text": "In February 1992, school administrator questionnaires were mailed to the principal or headmaster of selected NELS:88 schools with second follow-up sample members still in attendance. Completed selfadministered questionnaires and telephone interviews were collected from February through June 1992. For any interviews conducted after the end of the 1991-1992 academic year, school principals were asked to refer to the previous academic year. As in the first follow-up the school principal or headmaster could delegate all but one of the sections to another knowledgeable school official. The school principal was specifically required to complete the fifth section of the questionnaire on school governance and school climate. Two weeks after the school administrator questionnaire was mailed to principals and headmasters, a postcard was mailed to all principals asking them to return the questionnaire if they had not already completed and returned it. Two weeks after the postcard reminder was mailed, interviewers began prompting nonresponding principals over the telephone for the return of the questionnaire. About three weeks after each principal was prompted for the return of the questionnaire over the telephone, interviewers began calling nonresponding school administrators to attempt to collect the questionnaire over the telephone. An abbreviated version of the school administrator questionnaire was administered to nonresponding principals near the end of the data collection period. Because questionnaires from school principals were completed in two different modes of data collection, by self-administration and telephone administration, a number of steps were taken to minimize any mode effects. Telephone interviewers were trained to adapt the questions in a way which made sense when asked over the telephone. If a school administrator had a copy of the questionnaire, he or she was encouraged to read along in the questionnaire as the interviewer asked the questions over the telephone."}, {"section_title": "Parent Survey", "text": "In May 1992, parent questionnaires were mailed to all parents and guardians of students and dropouts who had completed a student or dropout questionnaire. The self-administered questionnaires instructed the parent or guardian who was most knowledgeable about the teenager's current living situation and educational plans to complete the questionnaire. Accordingly, the parent sample was selfselected. The timing of the second follow-up parent survey was different from the timing of the base year parent survey due to differences in the content of the questionnaires. Because the second follow-up parent questionnaire included questions on financial aid for postsecondary education and this information is not available to most families until late in the spring of teenagers' twelfth grade, the parent survey was not conducted at the same time as the student and dropout surveys. However, parent respondents were asked to refer to the spring of 1992 when completing the questionnaire. The base year parent survey was conducted concurrently with the student data collection. Two weeks after the questionnaires were mailed, a postcard reminder was mailed to all parents. For parents who had already completed the questionnaire, the postcard thanked them for their 89 69 F2: Teacher Component Data File User's Manual participation. For parents who had not yet returned their questionnaire, the postcard asked them to complete and mail the questionnaire to NORC at their earliest convenience. Starting two weeks after the postcard reminder was mailed to parents, telephone interviewers began prompting nonresponding parents over the telephone for their completed questionnaire. Telephone interviews were attempted with a subsample of parents who did not respond to the postcard and telephone prompts. To minimize mode effects between self-administration and telephone administration of the instrument, interviewers were trained to adapt the questions to make sense when read over the telephone. Additionally, parents were asked to read along in the questionnaire during the telephone interview if they had the copy of the questionnaire mailed to them. Special steps were taken to ensure comparable completion rates for the parents of minoritylanguage (Hispanic and Asian/Pacific Islander) sample members. In the initial mailing of questionnaires to parents, both English and Spanish questionnaires were mailed to parents of Hispanic students and dropouts so that an Hispanic parent could complete the questionnaire in the language with which the parent was more comfortable. Spanish-speaking interviewers were trained to administer the questionnaire over the telephone in Spanish when necessary. As in the base year parent survey when 575 Spanishlanguage questionnaires (2.5% of all parents and 23.0% of Hispanic parents) were completed, 373 Spanish-language parent questionnaires (2.1% of all parents and 21.6% of Hispanic parents) were completed during the second follow-up. While a native language questionnaire was not available to Asian and Pacific Islander parents, parents who spoke the most common Asian languages were prompted over the telephone for the return of the questionnaire by a native speaker. The languages in which these parents were prompted included Chinese, Japanese, Tagalog, Korean, and Vietnamese. In the respondent's native language, Asian telephone interviewers explained why the parent's participation in the study was important and encouraged them to seek the assistance of another adult for completing the English version of the questionnaire; however, no translation of the questionnaire into these languages was conducted over the telephone."}, {"section_title": "Academic Transcripts", "text": "In August 1992, transcript survey materials were mailed to the principals of the NELS:88 and non-NELS:88 schools attended or most rer;eney II-tended by sample members of the student cohort. Because of the variability in transcript format across schools, explicit instructions for transcript preparation were provided. School staff were asked to retrieve from alternate sources any data elements that were not included on the school's transcripts. Transcript preparers were also asked to note any transfers of students to new schools after data collection, to facilitate the pursuit of additional records from transfer schools. Two weeks after survey materials were mailed, nonresponding principals were prompted for the return of transcripts with a postcard reminder. Principals who did not return transcripts within three weeks of the postcard prompt were prompted over the telephone. Telephone prompting of nonresponding principals continued from October 1992, to February 1993. Field visits to schools requesting assistance in the preparation of transcripts were conducted in February and March 1993."}, {"section_title": "Second Follow-Up Data Collection Results", "text": "Tables 4.11-1 through 4.11-2 summarize the data collection results for the NELS:88 second follow-up study. Second follow-up school questionnaire coverage rate for each student who completed a questionnaire and was enrolled in an eligible contextual school. Second follow-up teacher questionnaire coverage rate for each student who completed a questionnaire and was enrolled in either a mathematics or science class. 565 unlocatable cases were assumed to be eligible students for the purposes of calculating student completion rate, and are included in the total of 18,209. Refers to the second follow-up school. Not Applicable-Completion rates by school type, urbanicity, and region are calculated based on the school a student attended in the second follow-up. Because dropouts are not linked to schools on the public use magnetic tape, it is not possible to calculate combined student and dropout completion rates for these subgroups. Refused/Missing refers only to the status of a sample member's ethnicity. It does not refer to sample members who did not participate in the second follow-up. School questionnaire coverage rate for each student who has completed a BY, Fl and F2 student questionnaire. School questionnaire coverage rate for each student who has completed a BY and/or F2 student questionnaire."}, {"section_title": "'", "text": "Refers to 8th -grade schools. "}, {"section_title": "Data Control and Preparation", "text": "This chapter describes the procedures used to control teacher data before transforming responses from second follow-up questionnaires into a data file. Several procedures were implemented to prepare these documents for data capture, including monitoring the receipt of completed questionnaires, editing completed questionnaires, retrieving missing data, and preparing the documents for archival storage. Data preparation activities spanned the entire length of the NELS:88 second follow-up teacher survey, beginning with tracing and securing school cooperation, through monitoring and machine editing, and ending with the preparation of public use data files."}, {"section_title": "5.1", "text": ""}, {"section_title": "Monitoring and Receipt Control Procedures", "text": "Questionnaire data were tracked and receipted for all respondent populations. Once a teacher questionnaire was returned by a respondent, the completion status of the questionnaire for that teacher was entered into the microcomputer based Survey Management System (SMS). The database identified the status of each teacher questionnaire in the sample and stored the date that data for each respondent was received."}, {"section_title": "5.2", "text": "In-house Editing and Data Retrieval Editing was conducted to review completed questionnaires, to identify problems requiring policy decisions, and to prepare the questionnaires for data entry. After each questionnaire was logged into the SMS, it was edited for missing critical items. Critical items were questions judged as having important policy relevance. A complete listing of critical items appears in Appendix F. Critical items were retrieved for questionnaires in which responses to one or more of the critical items were missing, illegible, or contained multiple codes when only one was required. Interviewers called respondents and attempted to elicit a response to the missing critical item(s). If an error could not be resolved in this way, then the appropriate code was assigned to the question to indicate missing, multiple, or refused responses."}, {"section_title": "5.3", "text": "Data Capture and Archival Storage Data entry for the teacher questionnaires was performed chrough an optical mark reading procedure by Questar Data Systems, Inc. All teacher questionnaires r're photographed onto microfilm. After the questionnaires were scanned, the booklets were microfilmed and then destroyed. The rolls of microfilmed questionnaires were returned to NORC for archival storage. 5 73 F2: Teacher Component Data File User's Manual VI. Data Processing of the Teacher Questionnaires Data processing activities spanned the entire length of the NELS:88 second follow-up teacher survey, beginning with tracing and securing school cooperation, development of the teacher sample, through receipt control and machine editing, and ending with the preparation of public and privileged use data files and user's documentation. This chapter describes the post-conversion steps taken to ensure that coded responses to the second follow-up teacher questionnaire are valid and consistent."}, {"section_title": "6.1", "text": ""}, {"section_title": "Machine Editing and Data File Preparation", "text": "Conventions for editing, coding, error resolution, and documentation adhered as closely as possible to the procedures and standards previously established for HS&B and NLS-72. The teacher data were optically scanned and detection of out-of-range codes was completed. The data were converted to machine-readable form, and a raw data tape was generated. Sequences of logical machine edits and visual inspection of the output included: resolving inconsistencies between filter and dependent questions, supplying the appropriate missing data codes for questions left blank, detecting illegal codes and converting them to missing data :odes and investigating inconsistencies or contradictions in the data. Frequencies and crosstabulations for each variable were inspected before and after these steps to verify the accuracy and appropriateness of the automated machine editing processes. Inconsistencies between filter and dependent questions were resolved in the machine editing process. In most instances, dependent questions that conflicted with the skip instructions of a filter question contained data that, although possibly valid, were superfluous. For instance, respondents sometimes indicated 'no\" to a filter question and then continued to answer \"no\" to subsequent dependent items. When a filter question indicated that subsequent questions(s) should have been skipped, the subsequent dependent questions were set to a value of legitimate skip, except for one situation. In the exception, if the dependent questions were answered in a manner that was inconsistent with the filter but consistent within the dependent items, the filter was back edited (changed) and made consistent with the dependent responses. If a multiple response, or if no answer was given to a filter question, the question was assigned the appropriate reserved code (\"6\" or \"8,\" see below) and all subsequent questions that might have been skipped were processed as if the respondent should have answered them. The frequency with which responses were recoded to legitimate skip for each skip pattern was closely monitored. Frequency distributions of responses before and after editing were inspected. All filter questions and their respective dependent items were displayed in crosstabulations so that staff could verify the accuracy of the recoding. After improperly answered questions were converted to blanks, the teacher data were passed through a second step in the editing program that supplied the appropriate reserved codes to fill blank fields. Where a value was not provided by the respondent, a reserved code fills the field. The reserved electronic codes and their meanings are: If the field is longer than one column, the right-hand column contains one of the &love codes and the rest of the columns are filled with \"9\"s. Items with unusually high nonresponse or multiple responses were checked by verifying the data in the questionnaire on microfilm. The conventions used to assign SAS and SPSS-X variable names are as consistent as possible with HS&B and NLS-72. In those two surveys, variable names were assigned according to the survey wave in which they are created and the question number. A similar system was developed for NELS:88. For example, the variable name F2T2_9A refers to the second follow-up (\"F2\") teacher survey (\"T\"), part 2 (\"2_\"), question 9, part A (\"9A\"). When possible, the symbol is used within the teacher survey variable names to separate the questionnaire part number from the question number. A user might otherwise incorrectly interpret the variable name as referencing question 29A, rather than part 2, question 9A."}, {"section_title": "CD-ROM Electronic Codebook", "text": "An electronic codebook (ECB) permits PC users to interact with all of the features of a conventional hardcopy codebook and its accompanying documentation. In a very large, complex survey such as NELS:88 with multiple highly elaborated codebook text files, the Compact Disc (CD) medium provides the necessary capacity to carry a tremendous amount of data in a very compact and convenient form. CD-ROM is a form that can be copied to and read by a microcomputer. The information on CD-ROM is \"Read-Only.\" This feature protects the data on the disk from accidental alterations, such as a user unintentionally writing over the encoded information. In addition to numerous hardcopy codebooks that accompany magnetic tape releases on NELS:88, ECBs are also now available to users. These permit users to search for variables based on key words and names. The ECB displays question text and frequencies for each variable in order to assist users in deciding which data elements may be useful in planned analyses. The ECB is also a tool for selecting variables for subsequent analysis, writing SAS or SPSS-PC code for file construction of the designated variables, and even generating a codebook of the chosen set of variables. More detailed information on the features of the NELS:88 ECBs and the survey waves and components for which ECBs are available appears in Chapter VII. F2: Teacher Component Data File User's Manual VII. Guide to the Data Files, Documentation and CD-ROM Electronic Codebooks Fourteen NELS:88 study components are now available on magnetic tape or CD-ROM (Compact Disc Read-Only Memory) format. Magnetic tape and CD-ROM releases of the NELS:88 data contain files that are specific to one survey wave and one component, such as the second follow-up student component data. Table 7-1 displays these NELS:88 products, by study component and by survey year. The student and dropout data sets are the central units of analysis in NELS:88. Each of the student data files may be examined as an independent entity or may be combined for observation of the maturation of the original student cohort over time. The student and dropout data files released in the second follow-up of NELS:88 may be combined with data from second follow-up surveys of parents, teachers and school administrators. The most powerful analyses are possible when students are viewed in the context of these fundamental influences across the four-year time frame that is now available. The NELS:88 files are designed to be merged and used to examine how differing student outcomes are related to various structural patterns, as measured by parental, teacher and other school influences, and/or the ways in which these change over time. The contextual data files are dependent upon and subsidiary to the student and dropout files in NELS:88. The contextual data files are not stand-alone samples. The only exception is the base year school file, which is representative of eighth-grade American schools and their principals in 1988. For example, the second follow-up teacher survey is not a representative sample of American teachers, but rather is a sample of selected math and science teachers of the student cohort. Therefore, inferences from the teacher data file cannot be legitimately made if these data are viewed in isolation from the student files. Several types of st, nt sample members are included in the files; therefore, the user must take care to select the correct set. Among the types of sample members in the student data set are: 1) students who were added in the first or second follow-ups to freshen the sample; 2) sample members who have participated in one, two or all three waves of the survey; and 3) Base Year Ineligible sample members who were found to be eligible and subsequently included in the first and second follow-up surveys of NELS:88.' Eight analytic populations, both cross-sectional and longitudinal, are now represented in the NELS:88 student sample. Different research questions apply to different student populations. In order to choose the correct NELS:88 student sample and produce accurate results, analysts must use the proper sample identification and questionnaire availability indicators as well as the correct statistical weight. Section 7.1 introduces the reader to statistical software packages that can be used with the NELS:88 data sets and the importance of sample indicators and statistical weights in the production of accurate results. Section 7.2 includes a complete description of the content and organization of the second follow-up teacher data files. Finally, section 7.3 offers an explanation of the hardcopy codebook and an introduction to the electronic codebooks. Note however that the sample of reclassified Base Year lwligibles (i.e., those found to be eligible in the first follow-up and second follow-up rounds) had not been released for analyses prior to the second follow-up. The method for naming variables in NELS:88 follows a few simple patterns. \"F2\" refers to the second follow-up, \"Fl\" refers to the first follow-up, and \"BY\" refers to the base year. An \"F2\" in the prefix means that the variable has been created in the second follow-up for second follow-up sample Since by definition dropouts could only be identified and studied after the initial round of the survey, there is no base year dropout component. members. This is an important distinction since some variables that measure the same concept have been created for data sets in more than one round of the survey. In addition, if new information becomes availablefor example, for students who have not heretofore participated in NELS:88certain ciassification variables are revised to reflect this new information. The r,ore recent the creation of a composite, the more likely that it contains the most accurate values. Variable names designated for the second follow-up teacher files begin with \"F2T\" (second follow-up teacher) and indicate the part (1, 2, 3 or 4) of the questionnaire, as well as the question number within that part. For example, F2T3_10C, is question 10C from part 3 of the teacher questionnaire. The delimiter \"_\" separates the part number from the questionnaire item number. Exceptions to this naming convention are the four variables in the identification section: STU_ID (student ID), F2TCH_ID, F2SUBJCT, and F2CLS ID (see section 7.2.1 below for more information on these key variables). The procedures recommended for analysis of NELS:88 data with SAS or SPSS-X are outlined in Appendix D. Both the magnetic data tape releases and the CD-ROM media include files that contain the appropriate control cards for each of these statistical packages. Analysts who wish to create an SPSS-X system file from a SAS system file (or vice-versa) can do so and should seek support from their own computer support in order to obtain the necessary information. Questionnaire Indicators and Statistical Weight. One of the first steps to take before running statistical analyses is to select the proper participation flags and weights. Relevant flags and weights are found on all component files: student, dropout, school, teacher, and parent files. NELS:88 data files are designed to be used as weighted data sets in all analyses, with teacher data designed to be linked to the student file. The complexity of the sample design of NELS:88 virtually ensures inaccurate results if the data are analyzed on an unweighted basis. Clusteriilg, multistage selection, and disproportionate sampling all contribute potential bias and various degrees of unreliability, which can be avoided by using the weights provided to analyze specific subsets of the sample. Sampling weights are discussed in detail in Chapter III.' When the user combines a sample indicator with the appropriate weight, population estimates are produced. In order to accommodate contextual analyses, a special indicator for selection of the contextual sample, F2CXTFLG, has been constructed. It is the partner to the cross-sectional statistical weight that has been constructed for the contextual sample, F2CXTWT, and the two variables, both of which are included on the teacher file, should be used together. The teacher flag, F2TEQFLG, identifies the students in the contextual sample for whom teacher data are available on the second follow-up teacher file. F2CXTFLG use for identifying sample members enrolled in an eligible contextual school (included in the school administrator and teacher components) and sample members in these schools who were also student participants. use for producing weighted student contextual component statistics, in conjunction with either cross-sectional or longitudinal student analyses that also involve school administrator and/or teacher data.' F2TEQFLG The teacher file includes student participants in the contextual sample regardless of whether or not the student received a teacher report. F2TEQFLG allows analysts to select the students on the file for whom teacher data are available. The values of F2TEQFLG are: The student was eligible for a teacher report, but student's teacher did not complete a teacher report for that student A teacher report is available for the student on the teacher file The student was not eligible for the teacher survey because the student was not enrolled in a mathematics or science course Additionally, Figure 3-1 in Chapter III illustrates the status of NELS:88 longitudinal sample members from 1988 to 1992 and includes the numbers of these sample members for whom teacher data is available in the second followup. Longitudinal Analyses with Teacher Data. Although F2CXTWT can be used for cross-sectional analyses of second follow-up teacher data with the student data, a contextual panel weight has not been constructed for NELS:88. In instances where there is an analyzable population of interest for which no specific weight has been produced, some existing weights may provide reasonable approximations. Refer to Chapter III for a complete discussion of F2CXTWT and the other NELS:88 second follow-up weights."}, {"section_title": "7.2", "text": ""}, {"section_title": "Content and Organization of the Teacher Public Use Data File", "text": "The teacher public use data file consists of 15,695 records. There is one record for each studentteacher-subject combination. Records for student nonparticipants are not included on the second followup teacher data file. Variables on the data records that are drawn from the teacher questionnaire are ordered in the same sequence as they appear in the printed questionnaires. Appendix E contains a copy of the second follow-up teacher questionnaire. The questionnaire information and respondent results are also replicated in the hardcopy codebook that is displayed in Appendix I. The record layout that appears in Appendix H shows the order of the data elements in each record. Each item is referred to by its SAS (SPSS-X) variable name as defined in the control cards provided with the data file. Four files are provided for the second follow-up teacher component. They are: 3 Analyses that use 1992 teacher data with 1988 eighth graders in 1992 or with 1990 tenth graders in 1992 could utilize F2CXTWT to obtain an approximate estimate. Analysts may want to compare results from this weight with those produced by alternative approximations generated by the transcripkpanel weights. F2: Teacher Component Data File User's Manual The first variable on all of the raw data files, STU_ID, is a unique seven-digit student identification code. This number remains with the student or dropout throughout NELS:88. To link student records across two or more waves of the survey (1988, 1990, and 1992) or between survey components (student, dropout, teacher, school, parent, and transcript), analysts should use STU_ID. The student ID code consists of a five-digit base year school ID followed by a two-digit student code. Though both sets of numbers were randomly assigned to maintain confidentiality, the IDs contain embedded linking, stratum and PSU information.' Students added to the first or second follow-ups through freshening were linked to a core sample member. The base year school ID of the linked student was used as the root of the added student's ID. Thus, in all cases, the student ID links the students and dropouts to a base year school. On the second follow-up public use teacher file, the seven-digit student identification number ( STU_ID) is followed by three additional identifiers:"}, {"section_title": "F2TCH", "text": "F2TCH_ID is a four-digit sequential identification code for the second follow-up teacher respondents. F2TCH_ID allows analysts to identify which students with teacher data were instructed by the saote teachers. A school identification code was imbedded in the first follow-up teacher identification code and a separate school ID is included on second follow-up restricted use teacher file. However,"}, {"section_title": "F2SUBJCT", "text": "F2SUBJCT is a one-digit code which indicates the subject area of a student's teacher report. The value 'M' indicates that the teacher instructed the student in a mathematics class and that the student's teacher was asked to complete the questions about the student's mathematics course 'S' indicates that the teacher instructed the student in a science course and that the student's teacher was asked to complete the questions about the student's science course. Of the teachers who reported on more than one NELS:88 student, a small percentage of them reported,on different students in different subject areas. For these teachers, the value of F2SUBJCT on a student-teacher record is still determined by the subject area in which the teacher instructed that student."}, {"section_title": "3F2CL,SED", "text": "F2CLS ID is a two-digit code which allows analysts to identify which students instructed by the same teacher were enrolled in the same class. The teacher data are organized as one record per student which contains the teacher's report on the student, the course data for the student, and the information on the teacher' background and school characteristics for the student. About 25 percent of teachers instructed more than one student Eligible for the teacher survey. If, for example, a teacher instructed two NELS:88 students in one class and two different students in another class, F2CLS_ID would indicate which students were enrolled in the first versus the second class. Values 91 and 92 of F2CLS ID identify seven students for whom a teacher report was collected; however, the class information section, part 2 of the questionnaire, was missing for these students. Value 91 indicates that the student's teacher report was from a mathematics teacher despite the missing class information section, and value 92 indicates that the student's teacher report was from a science teacher despite the missing class information section."}, {"section_title": "The Teacher Public Use File Record Layout", "text": "The logical record length, block size and record layout for the second follow-up teacher component data file is in Appendix H. The layout shows how variables are ordered within the records for each student record on the file. Items taken from the hardcopy questionnaire appear on each data record in the same order as they appear in the second follow-up teacher questionnaire contained in Appendix E. The variables in the record layouts are identified by the SAS and SPSS-X variable names that have been designated for each data element. No more than eight characters may comprise a SAS or SPSS-X variable name. The first two characters of the variable names from the parent questionnaire indicate the survey wave in which the variable was created. Thus, BY in the prefix of the variable name indicates a base year questionnaire item, while F2 in the prefix of the name refers to the second followup. The third character in the variable name represents the NELS:88 component, with \"T\" for the teacher component, \"S\" for student, \"D\" for dropout, \"C\" for the school component, and so on. F2T refers to the second follow-up teacher questionnaire as the source document for the second follow-up teacher survey. \"F2T\" is followed by the section number of the questionnaire from which an item is taken. The naming scheme for items that report teacher responses is completed by the suffix of the 81 1 ( 3 F2: Teacher Component Data File User's Manual variable name, which consists of the question number and part. For example, F2T4_4A is question 4, part A from the fourth section (teacher background) of the second follow-up teacher questionnaire."}, {"section_title": "A Note about the Teacher Data File and Codebook", "text": "The teacher data file is structured at the level of student-teacher pairs. The objective of the teacher survey was to obtain a teacher report for each student eligible for the teacher survey. The frequencies displayed in the codebook represent distributions of student-teacher pairs. Each student-teacher record contains the student ID number, the teacher's rating of the student, the class information about the course in which the teacher instructed the student, and the teacher's report on the school climate and the teacher's background. If users choose to organize results at the course-level or at the teacher-level, then the resulting Ns will consequently be different from those that are shown in the NELS:88 codebooks. Analysts should be aware that the teacher data organized at the level of courses or at the level of teachers do not constitute valid, stand-alone probability samples. Because the student sample members constitute the basic unit of analysis in the NELS:88 study design, a number of special considerations need to be taken when analyzing the teacher data. In this section considerations for teacher file usage are listed for the base year, first follow-up, and second follow-up teacher surveys. Table 7.2.2-1 highlights some key differences between the teacher surveys in the three rounds of NELS:88. Special Considerations for Base Year Teacher File. The base year teacher file is made up of individual student-teacher records. Each record includes a teacher's rating of a student, the class information for the course in which the teacher instructed the student, and the teacher's report on the teacher's background and on the school characteristics. Although the base year teacher file is constructed at the level of student-teacher pairs, class-level and teacher-level data sets can be created using SAS and SPSS-X cards provided with the teacher data file. Refer to section 1.1.3 of the Base Year: Teacher Component Data File User's Manual for additional information about creating these data sets. Over 95 percent of students were eligible for two teacher ratings because they were enrolled in both courses in their assigned combination of subject areas. The student is the appropriate unit of analysis for use with the teacher data. For students with ratings from two teachers, analysts may need to create two sets of variables, one set for the first student-teacher record and one set for the second student-teacher record. Because class information pertains to one of four different subject areas for each teacherstudent record on the teacher file, analyses using BY2_17 to BY2_29 require sorting the sample by subject area as indicated by the variable, SUBJECT. The appropriate level of analysis is the student. Unlike the base year teacher file, SAS and SPSS-X cards which facilitate creation of course-level and teacher-level data sets have not been provided. These data sets can still be constructed by using CLS_ID and TCH_ID. Users are advised that teacher and course-level data sets do not constitute valid, stand-alone probability samples. Eighty-nine percent of students received two teacher ratings in the first follow-up. When possible the teacher reports were collected in the same subject combination that was used for the student in the base year. If a student was not enrolled in both base year subjects, then up to two subject substitutions were implemented for the student. The results is that a total of ten different subject area combinations appear on the first follow-up teacher file. Refer to section 3.2 in the First Follow-Up: Teacher Component Data File User's Manual for the substitution rules and a list of the ten combinations subject areas. For the 89 percent of students who received two first follow-up teacher ratings, analysts may need to create two sets of variables, one for the first teacher and one for the second teacher. Unlike base year nomenclature, the first follow-up variable names in the class information section of the questionnaire indicate when a question about the teacher's course is subject specific. For example, the 'E' in F1'I2E19A indicates that the teacher reported on a NELS :88 student in an English class and that this question applies to that English class. Students who were freshened in the first follow-up were assigned the same base year subject area combination as their linked partner, and if they were not enrolled in one or both of the assigned subject areas, subject areas were substituted for them using the same substitution rules that were used for all first follow-up students. Teacher frequencies in the First Follow-Up Teacher Component Data File User's Manual were generated at the student level using the student weight and multiple teacher reports per student. Teacher frequencies in the Base Year Teacher Component Data File User's Manual were generated at the teacher level (in addition to the student and course levels); hence, weighted percents were not reported. For the combined base year, first follow-up, and second follow-up electronic codebook, the NELS:88 base year procedure--which does not utilize the student weight to produce teacher item response category percentswas consistently employed for the presentation of the 1988 to 1992 rounds. Special Considerations for Second Follow-Up Teacher File. Only one teacher report was collected for each stude,it enrolled in either a mathematics or a science class. For students who were enrolled in both mathematics and science, either mathematics or science was selected to provide maximum comparability with the student's selected subject combination in the base year. No additional subject substitutions were implemented. To avoid collecting data from twelfth graders near the end of their senior year when they were more likely to disengage from their high school careers, most in-school data 84 1 07 F2: Teacher Component Data File User's Manual collection sessions were scheduled for January through March of 1992. To ensure that the collection of teacher reports occurred close to student data collection and administration of cognitive tests, teacher data collection began in February 1992. The teacher questionnaire was collected from students' fall term teachers at schools with inschool data collection sessions through March, texause the fall term teacher would have greater exposure to the t-,tudent and be more able to provide a complete assessment of the student than the spring term teacher would have been able to provide. However, for the 8.1 percent of schools with in-school data collection sessions from April through June, the spring term teacher was surveyed. In the second follow-up, variables in the class information section of the survey instrument do not srzify whether a question is for a teacher instructing a NELS:88 student(s) in a mathematics or science class. Analyses involving F2T2_14 to F2T2 26, the subject-specific questions in the class information section, should be performed in conjunction with the variable F2SUBJCT which identifies the subject area of a student-teacher record."}, {"section_title": "Packaged Statistical Programs", "text": "The procedures recommended for analyses of NELS:88 data with SAS are outlined in Appendix D. SPSS-X can also be used and both the magnetic data tape releases and the CD-ROM media include files that contain the appropriate control cards for each of these statistical packages. Analysts who wish to create an SPSS-X system file from a SAS system file (or vice-versa) can do so and should seek support from their own computer support facilities in order to obtain the necessary information."}, {"section_title": "7.3", "text": "Guide to the NELS:88 Codebooks The codebooks that have been provided for each wave of the survey fully describe and assist interpretation of each of the variables on each of the data files. The codebooks summarize all key information for each data element, including: the variable name, question number and content; the tape position and format on the file for each variable; valid and/or missing responses to each item; and, the unweighted frequency counts, percents, and weighted percents for each response category. Two related types of codebooks are provided for NELS:88--a hardcopy and an electronic codebook (ECB). Both forms of the codebook chronicle the details analysts need to interpret properly the results of each item: the exact wording of the question that was presented to the respondent, the distribution of all legitimate answers among survey participants, the location and type of data element for each variable on the file, as well as names and labels provided for use with statistical software. For some items the basic presentation is supplemented with additional notes about using the data. The first type of codebook is the hardcopy codebook included in the NELS:88 data user manuals. Hardcopy codebook displays are described and illustrated in section 7.3.1. The second type of codebook is the NELS:88 electronic codebook (ECB). The electronic print files that are produced by the hardcopy codebook software are used as the foundation (the input files) for the ECB software. ECBs provide several advantages. First, the NELS:88 ECBs reside on CD-ROM (Compact Disc Read-Only Memory) and, given the right equipment and software, can be accessed by and copied to a user's personal computer. The NELS:88 data sets have also been released on CD-ROMs, a far more concentrated medium for archiving information than magnetic tapes. The PC mode is both more convenient and far less expensive than mainframe operations for most users. Second, ECBs permit users to scroll through the same variables and survey results found in all versions of the codeboc. s electronically. In addition, analysts interact with the ECB software to select only those data elements needed for the user's specific analyses. The result is a user-controlled subset of the variables that is fully equipped with the tools required for statistical analysis. The labor-intensive steps that were formerly required to accomplish these preliminary steps to analysis, such as typing in exact variable names, have been rendered obsolete by the ECB system. Additional information on ECBs is given in section 7.3.2."}, {"section_title": "7.3.1", "text": "Hardcopy Codebooks in NELS:88 Data User's Manuals Both the hardcopy and the ECB versions of the NELS:88 codebooks contain the basic information available on each variable in the NELS:88 data sets. Therefore, even those readers who plan to use ECBs should be familiar with the material in this subsection in order to take full advantage of the ECB.     Question number: The question number shown includes the teacher questionnaire part number and item number and is taken directly from the teacher questionnaires. I:ems such as the statistical weight have variable names that reflect their content."}, {"section_title": "2.", "text": "Tape position: This item gives the starting and ending tape position of each variable on the data tape.\nSome of the label statements given in the SAS card files may need to be eliminated because of SAS system limitations present at many computer installations."}, {"section_title": "3.", "text": "Variable format: This item indicates the type of variable, its width, and the number of positions following the implicit decimal point, if any.\nThe large number of VALUE statements in the PROC FORMAT section requires that a special DD statement be placed just after the // EXEC SAS statement to increase the capacity of the format library during a SAS run: //LIBRARY DD SPACE= (TRK,(25,25,60)) Since this may not be possible at some computer installations, it may be necessary to delete some VALUE statements."}, {"section_title": "4.", "text": "SAS and SPSS-X variable name: Each variable in the data set is identified by a unique SAS and SPSS-X variable name. In the teacher component data sets, when space allows, the survey wave (F2) and the questionnaire part and item number are used in the variable name. Users should refer to the variable by its SAS (SPSS-X) variable name in any computing procedures, rather than by its question number.\nWhen working with large files, it may be necessary to override the default work space with the following DD statement: Place the //WORK DD statement just after the // EXEC SAS statement (or after the //LIBRARY DD statement, if that is included as well)."}, {"section_title": "SAS (SPSS-X) variable label:", "text": "A short variable label appears after the variable name. This label is the same as the variable label in the SAS (SPSS-X) data definition cards on the tapes or CD-ROM."}, {"section_title": "6.", "text": "Original question wording: This reproduces the exact question wording as it appeared in the questionnaire.\nWhenever variables are needed from several files (i.e., second follow-up teacher and student), the files may be merged by STUD) using SAS MERGE statements. A simple one line MERGE statement will put variables from separate files together in a single record for analysis. Users are reminded to first sort the files by the variables selected for merging; that is, sort both files by STUID."}, {"section_title": "7.", "text": "Response categories: This item provides either the original response categories in the case of questionnaire items or the recoded or constructed response categories for special variables such as a statistical weight. For display in the codebooks, continuous or very sensitive variables have been recoded to collapse all valid values into one or a few response categories. This allows the codebook tables to show the frequency counts, unweighted percentages, and adjusted weighted percentages for continuous variables without printing each distinct value that the variable can take. These value labels are not the same as those on the SAS (SPSS-X) data definition cards. Condensed value labels that do not cause truncation problems are provided with the data definition cards. Response codes: This item provides the actual numeric codes that appear on the data tape in the tape positron specified (except for continuous variables, where the actual values that appear on the tape have been recoded to produce the frequency counts and percentages). Certain codes, discussed below, are reserved to indicate missing data, legitimate skips and so forth.\nFor very large files, the user may encounter problems when sorting. Various options may be added to the //EXEC SAS card to circumvent these problems. A suggested example is given below (consult the SAS manual for descriptions of these options): It is suggested that the user include the LENGTH statement when creating new variables, in order to save space and computer memory."}, {"section_title": "9.", "text": "Frequency counts: This item shows the unweighted frequency counts for all records that were processed, including records that have missing data codes, legitimate skips, and so forth.  Weighted percentage frequencies: This column displays percentages based on response counts weighted up to the relevant population. Cases with reserved code values are excluded from the computation.\nFor many tabulations, PROC TABULATE produces the most readable output. The SAS user may use the format statements (provided) for classification variables to produce the row values of tabulate tables."}, {"section_title": "12.", "text": "Reserved codes: In this data set certain codes, termed \"reserved codes\" have been chosen to always stand for certain situations. These reserved codes and their interpretations are: 6 = multiple response more than one response where only one response was called for 7 =refusal respondent refused to answer an item or refused to resolve a multiple response where only one was called for, either at the time of que tionnaire administration or during telephone follow-up. 8 =missing data data that should be present for this respondent is missing, but respondent did not necessarily refuse to provide data 9 =legitimate skip because of responses to preceding questions, data for this item should not be present for this respondent; that is, the value is legitimately missing These reserved codes are the same as those used in the NLS-72 and HS&B surveys. The codes as listed above apply to variables with single-column data fields. For variables with fields -Treater than one column, the left-most columns are filled with 9's (e.g., 96, 996, 9996). Note that in the example shown in Figure 7-1, sample members who were in the contextual components sample but who were not enrolled in a mathematics or science course at the time of second follow-up data collection are shown on a separate line from other missing cases. Finally, additional comments and notes may be included and displayed below the standard information in the codebooks described in Figure 7-1. These comments alert researchers to the potential for nonresponse bias, a relation to another similar variable or composite, a recoding of a continuous variable in order to improve the codebook presentation, or to recodes or suppressions of sensitive data for confidentiality purposes."}, {"section_title": "The NELS:88 Electronic Codebook System (ECB)", "text": "The electronic codebook combines the convenience, simplicity and cost efficiencies of personal computers (PCs) with CD-ROM technology. Thousands of NELS:88 variables, the extensive statistical software programs and commands that transform the data in analyses, and electronic versions of data user manuals reside on a single CD-ROM. All are accessible with the MS-DOS operating system and statistical and word processing software that the user is likely already accustomed to working with on his or her own PC; however, a user must already have access to PC-SAS or SPSS-PC. Virtually all steps that must be undertaken prior to actual analysis on the data files may now be conducted within the ECB. 88 1 1 i The ECB software is designed to acquaint the user with the available survey measures and responses by means of on-line, fully documented codebooks. Users may browse through the documentation, searching on both variables names, labels, and question text to find items that are suitable for the research question at hand. The final version of the ECB includes weighted and unweighted frequency distributions. Users can move quickly in the ECB between questionnaire items, sample indicators, composite variables, or between components of the study and may select variables of interest, up to 255 variables per session. A window shows how many variables have been tagged at any one time. The process culls a set of variables, and only those variables, that are appropriate to the user's own research issue. Since variable names and labels are already in electronic form on the ECB, onerous tasks (such as typing in this information) that were formerly necessary are eliminated. The ECB permits users to write SAS-PC or SPSS-PC program code and/or command statements in order to construct system files of the selected variables. Finally, a print file of a codebook containing the frequencies for only the tagged items is another ECB option. The print file may subsequently be used to generate individualized hardcopy codebooks of the selected variables, providing a convenient reference during subsequent data analyses. In order to use the new ECB technology, the following are required: a NELS:88 Compact Disc; a CD-ROM reader, used to read or copy the NELS:88 CD-ROM to a personal computer; an IBM-compatible personal computer (PC), minimally a 286 system; up to 10 Mb space on the PC for the full ECB system; and,5 a substantial amount of space for the data files. Although up to 165 Mb is required for all publicly-available base year, first follow-up and second follow-up data sets, it is not necessary to copy and/or analyze all of these files simultaneously. The NELS:88 Compact Disc includes installation procedures, programs and files required by the codebook system, the raw data files and data user manuals (in WordPerfect format). Different Versions of the ECBs. The base year school sample is representative of all schools in the nation enrolling eighth graders in 1988. On the first follow-up ECB which includes base year files, information reflecting these schools has been released at two levels of analysis: aggregated at the level of the school (one record for each school), as well as distributed at the level of the students who attended those schools (one record for each such student). However, the second follow-up ECB only includes the base year school data at the level of the student. The 1994 release of the first follow-up data contains minor adjustments to the cases that are included on the files. For example, sample members found to have been sampled into the study in error 5 Space requirements will vary by the ECB component that is selected, the number of variables that may be chosen for generation of a hardcopy codebook, and by the statistical package usud by the researcher. 112 89 F2: Teacher Component Data File User's Manual have been deleted, and base year ineligible students found to be eligible in the first or second follow-up have been added. A few of the first follow-up variables have also been updated for the second follow-up release of the first follow-up data. Such adjustments are possible in longitudinal studies as new information becomes available or technical advancements become feasible. Although Table 7.3.2-1 includes both the interim and final versions of the second follow-up CD-ROM, this manual primarily discusses the contents of the final version of the second follow-up CD-ROM. The final second follow-up ECB encompasses thirteen of the major component files through the second follow-up of NELS:88. (The fourteenth major component dataset, the transcript files, appears on the final restricted-use CD-ROM that is not in the ECB format.) Cognitive test variables on all three waves of the survey have been refined and the first follow-up cases have been enhanced by the deletion of ineligibles and the addition of survey-eligible BYI sample members. Both the restricted use and public use CD-ROMs display a weighted and an unweighted frequency window. A number of restricted-use ASCII files are also available on a separate CD-ROM; these files are not in electronic codebook format. These files include 1) the transcript component data file, data file user's manual, and files of SAS and SPSS control cards for transcript data, 2) all first follow-up and second follow-up School Effectiveness Study data files and control cards, 3) the second follow-up early graduate student supplement, 4) the cognitive test item file which is also on the restricted use CD-ROM that contains the ECB, 5) the expanded sample file, and 6) selected zip code-level community contextual variables drawn from the 1990 Census files for NELS:88 schools. Contents of this CD-ROM are more fully described in the NELS:88 Second Follow-Up Final Technical Report. Magnetic tape versions of the public use data can be ordered from the U.S. Department of Education, Information Technology Branch at (202) 219-1522. The NELS:88 public use data on ECB/CD-ROM, which includes documentation for the ECB, can be ordered by calling Peggy Quinn at (202) 219-1743. The ECB is a qualitative advance over older approaches to complex data sets. The ease with which the pre-analysis phase is handled by the ECB is expected to increase both the number and types of users drawn to the NELS:88 database and, consequently, the variety of research topics addressed. Additional development of the ECB concept is expected to add useful enhancements. Critiques and suggestions on the ECB, the hardcopy codebook and other elements of the NELS:88 data user manuals are welcome. Please address your comments to: The title of the survey to which access is desired. A detailed discussion of the statistical research project that necessitates accessing the restricted NCES survey data. The name and title of the most senior official having the authority to bind the organization to the provisions of the license agreement. The name and title of the principal project officer who will oversee the daily operations. The number, name, and title of professional avd technical staff who will access the survey data base. Each professional or technical staff member with access to the data is required to sign and have notarized an affidavit of nondisclosure. In addition to the core sample and survey described in the main text, several other supplemental components were undertaken and data files generated under the auspices of NELS:88. In the base year survey, these included: several state augmentations; a supplement of hearing-impaired students, funded by Gallaudet University; a supplement of Reformed Christian schools that are members of the Christian Schools International Organization, funded by the Barnabas Foundation; and the NELS:88 Enhancement Survey of Middle Grades Practices, funded by the Office of Research in the Office of Educational Research and Improvement (OERI), through the Johns Hopkins University Center for Research on Effective Schooling for Disadvantaged Students (CDS). The first follow-up wave of NELS:88 also included supplemental components: the state augmentations, continued from the base year; the School Effectiveness Study, supported by funds from the John D. and Catherine T. MacArthur Foundation, and by NCES; and the Base Year Ineligible study (BYI), also sponsored by NCES. The second follow-up wave of NELS:88 included continuations of the base year and first follow-up state augmentations; the school effectiveness study; the continuation of the first follow-up Base Year Ineligibles study; and the continuation of the Christian schools supplement. These auxiliary data files greatly expand and enrich the analytic uses of the study. In the base year, the NCES-sponsored core sample of 1,052 participating schools and 24,599 participating students was increased to 1,242 participating schools and 28,397 participating students, respectively, as a result of the state augmentations and Christian schools supplements. The first follow-up School Effects Augmentation added some 6,400 students to the initial base year retained sample of 21,474 students. The second follow-up added over 1,300 SES students to replace students lost due to attrition (such as transfers and dropouts). Data for the state augmentations and other supplements discussed below do not appear on the NCES public release files for NELS:88."}, {"section_title": "Christian Schools Supplement", "text": "A sample of Reformed Christian schools that are members of the Christian Schools International (CSI) Organization was drawn to supplement the NELS:88 base year school sample. The sample was selected from CSI schools with probability proportional to eighth-grade size. Two disproportionately large school units were double-sampled. Of the initially contacted 58 schools, 41 schools agreed to participate. (Due to the double-sampling of the two schools, the number of sampling units was 43.) Students, parents, teachers, and school administrators were surveyed. Students completed both the cognitive test battery and the questionnaire during the in-school survey sessions held in their schools. Base year sample members and their parents were surveyed again in the second follow-up."}, {"section_title": "State Augmentations and Supplements", "text": "In an effort to enhance the statistical precision of their state samples, four states sponsored sample augmentations in the base year by adding schools and students in their states. Three of these states also sponsored instrument supplements in the form of additional questions pertaining to policy issues of interest to their states. Three of the four states which augmented their samples in the base year continued to provide funds in the first follow-up for following and collecting data for the initial base year state augmentation samples which were retained in the first follow-up, and two states continued to sponsor instrument supplements in the first follow-up. The second follow-up continued the augmentation supplements in these two states."}, {"section_title": "Hopkins Enhancement Survey of NELS:88 Middle Grades Practices", "text": "The Survey of Middle Grades Practices enhanced the NELS :88 base year school questionnaire by collecting new information to monitor middle grades reform in the schools attended by NELS:88 eighth graders. The questionnaire for this supplemental survey was designed by the Center for Research on Effective Schooling for Disadvantaged Students (CDS) of the Johns Hopkins University and the data collection was conducted by NORC. The school principals who provided base year information in the NELS:88 school questionnaire were asked to participate in this enhancement survey between late October 1988 and February 1989. The enhancement survey augmented the information in the base year school questionnaire with additional information on school organization, guidance and advisory periods, rewards and evaluations, curriculum and instructional practices, interdisciplinary teams of teachers, transitions and articulation practices, involvement of parents, and other practices recommended for middle grades reform. Included in the enhancement survey was an alternative version of an item on classroom organization. This item from the Hopkins Enhancement Survey data was appended to the base year school file. It should be noted that the original question on the organization of classroom instruction (see base year school codebook, BYSC18, in the NELS:88 Base Year: School Component Data File User's Manual) was asked during the 1987-1988 school year, while the correction item was asked during, and references, the 1988-1989 school year."}, {"section_title": "Past Studies and Data Files Related to NELS:88 Available from NCES", "text": "Data from the earlier NCES longitudinal tudies--NLS-72 and HS&B--may also be of interest to users of the NELS:88 data. These data sets are of special interest for researchers interested in crosscohort comparisons between the sophomores of NELS:88 first follow-up (1990) and HS&B base year (1980), and, in the future, comparisons of the 1992 NELS:88 seniors and the HS&B sophomore and senior cohorts in 1982and 1980, and NLS-72 seniors in 1972 In addition to the core surveys for HS&B and NLS-72, described in Chapter I, records studies were undertaken, including the collection of the high school transcripts' of the sophomore cohort and the collection of postsecondary education transcript2 and financial aid data for the seniors. Data files for these studies and other HS&B data, such as parent surveys, school surveys, teacher comments, etc., are In addition to the HS&B and NELS:88 high school transcripts available from the NELS program, two other NCES high school transcript data sets are also available, from records studies of graduating seniors in NAEP schools: the 1987 and 1990 High School Transcript Studies."}, {"section_title": "HS&B Base Year Files", "text": "The Language File contains information on each student who, during the base year, reported some non-English language experience either during childhood or at the time of the survey. This file contains 11,303 records (sophomores and seniors combined), with 42 variables for each student. The Parent File contains questionnaire responses from the parents of about 3,600 sophomores and 3,600 seniors who are on the Student File. Each record on the Parent File contains a total of 307 variables. Data on this file include parents' aspirations and plans for their children's postsecondary education. The NELS:88 Second Follow-Up: Parent Component Data File User's Manual contains a crosswalk between the items included in the HS&B parent surveys and the NELS:88 base year and second follow-up parent surveys. The Twin and Sibling File contains base year responses from sampled twins and triplets; data on non-sampled twins and triplets of sample members; and data from siblings in the sample. This file (2,718 records) includes all of the variables that are on the HS&B student file, plus two additional variables (family ID and SETTYPE--type of twin or sibling). The Sophomore Teacher File contains responses from 14,103 teachers on 18,291 students from 616 schools. The Senior Teacher File contains responses from 13,683 teachers on 17,056 students from 611 schools. At each grade level, teachers had the opportunity to answer questions about HS&B-sampled students who had been in their classes. The typical student in the sample was rated by an average of four different teachers. Preliminary analyses by NCES indicate that the files contain approximately 76,000 teacher observations of sophomores and about 67,000 teacher observations of seniors. The Friends File contains identification numbers of students in the HS&B sample who were named as friends of other HS&B-sampled students. Each record contains the IDs of sampled students and IDs of up to three friends. Linkages among friends can be used to investigate the sociometry of friendship structures, including reciprocity of choices among students in the sample, and to trace friendship networks. Merged HS&B Base Year, First, Second. Third, and Fourth Follow-Up Files The First Follow-Up Sophomore File contains responses from 29,737 students and includes both base year and first follow-up data. This file includes information on school, family, work experiences, educational and occupational aspirations, personal values, and test scores of sample participants. Students are also classified in terms of high school status as of 1982 (that is, dropout, same school, transfer, or early graduate). The First Follow-Up Senior File contains responses from 11,995 individuals and includes both base year and first follow-up data. This file includes information from respondents concerning their high school and postsecondary experiences and their work experiences. The Second Follow-Up Sophomore File has all base year, first follow-up, and second follow-up data for 14,825 members of the sophomore cohort. Data cover work experience, postsecondary 1,J A-3 F2: Teacher Component Data File User's Manual schooling, earnings, periods of unemployment, and so forth, for the sophomore cohort, who by this time had been out of high school for two years. The Second Follow-Up Senior File encompasses all base year, first follow-up, and second follow-up data for the 11,995 individuals who constitute this follow-up sample. Data cover work experience, postsecondary schooling, earnings, periods of unemployment, and so forth, for the senior cohort, who by this time bad been out of high school for four years. The Third Follow-Up Sophomore File includes all base year, first follow-up, second follow-up, and third follow-up data for the 14,825 members of the sophomore cohort. Data cover marriage and family formation, work experience, postsecondary schooling and interest in graduate degree programs, earnings, periods of unemployment, and alcohol consumption for this cohort, who by 1986 had been out of high school for four years. The Third Follow-Up Senior File includes all base year, first follow-up, second follow-up, and third follow-up data for the 11,995 individuals who constitute this follow-up sample. Data cover marriage and family formation, work experience, postsecondary schooling and interest in graduate degree programs, earnings, periods of unemployment, and alcohol consumption for the senior cohort, who by 1986 had been out of high school for six years. The Fourth Follow-Up Sophomore File includes all base year, first, second, third, and fourth follow-up data for the 14,825 members of the sophomore cohort. Data cover marriage and family formation, work experience, postsecondary schooling, earnings, and periods of unemployment for this cohort, who by 1992 had been out of high school for ten years. HS&B fourth follow-up data are scheduled to be released in 1994."}, {"section_title": "Other HS&B Files", "text": "The High School Transcript File describes the coursetaking behavior of 15,941 sophomores of 1980 throughout their four years of high school. Data include a six-digit course number for each course taken, along with course credit, course grade, and year taken. Other items of information, such as grade point average, days absent, and standardized test scores, are also contained on the file. The Offerings File contains school information, course offerings, data for 957 schools. Each course offered by a school is identified by a six-digit course number. Other information, such as credit offered by the school, is also contained on each record. The Updated School File contains base year data (966 completed questionnaires) and first follow-up data (956 completed questionnaires) from the 1,015 participating schools in the HS&B sample. First follow-up data were requested only from those schools that were still in existence in the spring of 1982 and had members of the 1980 sophomore cohort currently enrolled. Each high school is represented by a single record that includes 230 data elements from the base year school questionnaire, if available, along with other information from the sampling files (e.g., stratum codes, case weights). The Postsecondary Education Transcript File for the HS&B seniors contains transcript data or dates of attendance, fields of study, degrees earned, and the titles, grades, and credits of every course attempted at each school attended, coded into hierarchical files with the student as the highest level of aggregation. Although no survey forms were used, detailed procedures were developed for extracting and processing information from the postsecondary school transcripts that were collected for all members A-4 121 F2: Teacher Component Data File User's Manual of the 1980 senior cohort who reported attending any form of postsecondary schooling in the first or second follow-up surveys. (Over '7,000 individuals reported over 11,000 instances of school attendance.) The Postsecondary Education Transcript Mlle for the HS&B sophomores includes transcript data for over 6,000 members of the 1980 sophomore cohort who reported in the follow-up survey that they had attended a postsecondary institution. The data file created for this study includes detailed information about program enrollments, periods of study, fields of study pursued, specific courses taken, and credits earned. An updated transcript file is being prepared as part of the 1992 HS&B fourth follow-up. The HS&B HEGIS and PSVD File contains the postsecondary school codes for schools HS&B respondents reported attending in the first and second follow-ups. In addition, the file provides data on institutional characteristics, such as type of institution, highest degree offered, enrollment, admissions requirements, tuition, and so forth. This file penirits analysts to link 1-1S&B questionnaire data with institutional data for postsecondary schools attended by respondents:"}, {"section_title": "The Senior Financial Aid", "text": ""}, {"section_title": "NLS-72 Files", "text": "The NLS-72 Base Year Through Fourth Follow-Up (1979) File contains data from the base year through fourth follow-up for over 23,000 respondents. Data include school experiences and test results during the base year and subsequent activities related to work, postsecondary schooling, military service, family formation, and goals and aspirations. The NLS-72 Fifth Follow-Up File consists of the results of the fifth follow-up survey, carried out in 1986, when sample members were about thirty-two year's old. Data include work experience going back to 1979, postsecondary schooling, extensive family formation history, periods of unemployment, goals and aspirations, and selecte\" attitudes. Records in this file can be linked through student ID to those in the NLS-72 Base Year Through Fourth Follow-Up (1979). The NLS-72 Teacher Supplement File contains the responses of the portion of the fifth follow-up NLS-72 sample who had obtained teacher certification and/or had teaching experience. Data include certification history, subjects taught, years of experience, attitudes toward teaching as a career, and subsequent work experiences of those who had left teaching. These data can be linked through the respondent ID to the NLS-72 Fifth Follow-Up File and to the NLS-72 Base Year Through Fourth Follow-Up File. The Postsecondary Education Transcript Study of the NLS-72 Sample contains transcript data on dates of attendance, fields of study, degrees earned, and the titles, grades, and credits of every course attempted at each school attended, coded into hierarchical files with the student as the highest level of aggregation. Although no survey forms were used, detailed procedures were developed for extracting and pr( essing information from the postsecondary school transcripts that were collected in 1984 for all A-`) F2: Teacher Component Data File User's Manual members of the NLS-72 cohort who reported attending any form of postsecondary schooling in any of the firs, through fourth follow-up surveys. (Over 14,000 individuals reported over 24,000 instances of school attendance.) The files provided on the public release tape include SAS cards and SAS system files for the NELS:88 second follow-up teacher data file. The SAS system file for the teacher survey includes: Users who plan to analyze NELS:88 data on personal computers can seek counsel in the Guide to the NELS:88 ECB/CD-ROM. The sections that follow pertain primarily to mainframe applications. The following are situations which may be encountered when using large data files with SAS and suggestions for handling them."}, {"section_title": "1.", "text": "Use the '(KEEP=...)' and '(DROP=...)' options in the 'SET' statement and/or in the 'DATA' statement when creating working data files so that unwanted variables are not included in the files. The '(KEEP=...)' option does not reorder the variables in the new data set. The files are large and lie SAS cards associated with all of the variables within a file require a great deal of memory. Eliminating unwanted variables and the cards associated with them will reduce the amount of memory necessary to run jobs."}, {"section_title": "5.", "text": "The formats given in the PROC FORMAT step here are not permanently associated with each variable. Whenever they are needed for a procedure, it is necessary to include them in this PROC FORMAT step before the procedure(s) that will use them. In the following example PROC FORMAT is used first to make a temporary library of formats (sets of value labels). Then PROC FREQ is used to access the First Follow-Up teacher SAS 1 = \"APPLIES\" 2 = \"DOES NOT APPLY\" 6 = \"MULTIPLE RESPNSE\" 7 = \"REFUSED\" 8 = \"MISSING\" 9 = \"LEGITIMATE SKIP\""}, {"section_title": "TABLES F2T4_9B1; '111LE \"BACHELOR'S DEGREE MAJOR IN MATHEMATICS\";", "text": "At the end of each SAS card file, there is a frequency procedure which contains FORMAT statements for every variable for which there is a format. These FORMAT statements can be used in any SAS procedure. However, if there are a large number of format links, they must be divided into several format statements to work. (Using about 90 format links in the format statement proved successful on the University of Chicago mainframe)."}, {"section_title": "10.", "text": "Output from SAS can be downloaded to personal computers for production of final reports. NCES has available a program for taking into account the sample design when computing standard errors. The program, known as Cl'AB, is a Taylor series based routine that uses an ASCII file to compute standard errors for crossclassifications. The program also produces labeled tabular output suitable for use in publications. CTAB is available for use on microcomputers, and can be obtained through NCES. 11. Use the NCES-and NORC-defined composite and classification variables whenever possible to simplify programming. These classification variables were carefully constructed and, for some of them, sources of data from outside the teacher questionnaire were merged into the teacher data to construct the variables. 12. SAS and SPSS-X system files can now be converted at many computer installations. Contact your own facility to obtain the information necessary to create an SPSS-X file from SAS and vice versa. 13. There is a peculiarity with version 6.06 of SAS. The symbol \"%\" will not be winced if it appears as the first character in the first variable label on a printed page. The data from this survey will be used by educators and by federal and state policymakers to address important issues facing the nation's schools: educational standards, curriculum tracking, dropping out of school, the education of the disadvantaged, the needs of language minority students, incentives for attracting students to the study of science and mathematics, and the features of effective schools."}, {"section_title": "CONFIDENTIALITY", "text": "As a matter of policy, the National Center for Education Statistics is required to protect the privacy of individuals who participate in voluntary surveys. We want to let yod know that: 1. Section 406 of the General Education Provisions Act (20-USC 1221e-1) and Public Law 100-297 allow us to ask you the questions in this questionnaire. 2. You may skip any questions you do not wish to answer. 3. Your responses will be merged with those of others, and the answers you give will never be identified as yours. The public reporting burden for collection of this information is estimated to average one half-hour (30 minutes "}, {"section_title": "MARKING DIRECTIONS", "text": "Use only a soft lead pencil (No. 2 is best). Make dark marks that fill the oval. Erase cleanly any answer you wish to change. Make no stray markings of any kind."}, {"section_title": "CORRECT MARKS INCORRECT MARKS 4000", "text": "Ge giz 0 o This questionnaire is part of a major longitudinal study designed to provide trend data about critical transitions experienced byyoung people as they develop, attend school, and embark on their careers. Some of the students who were selected as part of a nationwide random sample when they were in eighth grade are now attending your school. Your school has agreed to participate in this study. Mathematics and science teachers of these students are being asked to complete this questionnaire. Other teachers in these departments may be asked to complete only Parts Three and Four about their departments or subject areas and themselves. You should have one of two forms attached to the front cover or inside of this questionnaire --either a list of students from your classes or an instruction to complete only Parts Three and Four. If neither form is attached or if you have a special teaching situation about which you are not sure how to answer (for example, you teach one student in more than one class), please call Terry Burke toll-free at NORC at 1-800-788-7203. We are seeking information from you to supplement other study data about students and their schools. This questionnaire has four very different sections: Part I asks you questions about the characteristics and behaviors of the sampled student(s) whom you have in one of your classes. Individual students are referred to by \"Student Number,\" as shown in the List of Students attached to the inside of this questionnaire. Part I asks you to write the student's initials below the student's number. Part II asks a series of questions about the classes which you taught to the students about whom you answered questions in Part I. As you will see, Part II contains room for responses on a maximum of five classes. Part Ill asks a series of questions about the climate and practices of your school and your subject area or department. If you teach classes in more than one subject area, answer questions in Part Ill about the subject area in which you teach the greatest number of students listed on the Student List. If you teach the same number of students on the Student List in math and science classes, answer Part III about the subject area in which you spend more time teaching. If the letter attached to the questionnaire asks you to complete only Part III and Part IV of the questionnaire, please answer Part III about the subject area indicated in the letter. Part IV requests some general information about you. Please answer directly on the questionnaire by darkening the oval or by writing your response in the space provide. We realize that you are very busy; however, we would appreciate it if you would complete the questionnaire and return it to NORC in the enclosed prepaid envelope within the next two weeks. THANK YOU VERY MUCH FOR YOUR HELP WITH THIS IMPORTANT STUDY."}, {"section_title": "115", "text": "-3 --  The appropriate level for this student 3   3   3   3   3   3   3   3   3   .   3   3   3   3   3   3 Too difficult for this student.                1 -it Is possible to explain why. 2 -It is Just \"one of those things\" to be remembered. 3 -I'm not sure. .n4 The              13. To what extent has each of the following people at this school helped you Improve your teaching or solve an instructional or class management problem? 16. Indicate the degree to which each of the following is a problem with students in your school.    19,-) 19. In the teacher enrichment programs you attended this year, were any of the following topics discussed? In-depth study of a specialized  Does student perform below ability"}, {"section_title": "F2T1 12", "text": "Does student complete homework on time F2T1_13 How often student is absent"}, {"section_title": "F2T1 14", "text": "How often is student tardy"}, {"section_title": "F2T1 15", "text": "How often is student attentive in class"}, {"section_title": "F2T1 16", "text": "How often is student disruptive in class"}, {"section_title": "F2T2 3", "text": "Track of class in which teacher instructed student F2T2_4 Achievement of student in class compared to average twelfth grader"}, {"section_title": "F2T2_5 Number of students enrolled in class F2T2_6", "text": "Number of racial/ethnic minority students in class F2T2_7 Why teacher was assigned to class F2T2_8 Minutes of homework assigned each day F2T2_14A Emphasis given to understanding nature of proofs"}, {"section_title": "F2T2 I4B", "text": "Emphasis given to memorizing facts, rules, and steps F2T2 14C Emphasis given to learning to represent problems in multiple ways F2T2:14D Emphasis given to integrating different branches of mathematics F212 _14E Emphasis given to understanding multiple approaches to problems"}, {"section_title": "F2T2 14F", "text": "Emphasis given to performing calculations with speed and accuracy "}, {"section_title": "F2T214G", "text": ""}, {"section_title": "Description", "text": "Was probability taught or reviewed Was calculus taught or reviewed Frequency of individual or small group experiments or observations Frequency of demonstrations or leading students in observations Frequency of written reports on experiments or observations Frequency of discussions on current issues or events in science Frequency of computer use of data collection and analysis Frequency of computer use for demonstrations/simulatiors Frequency of students giving oral reports Frequency of students designing and conducting own projects Frequency of discussions of opportunities in science and technology Frequency of discussions about controversial technologies Was cell structure and function taught or reviewed Was genetics taught or reviewed Was diversity of life taught or reviewed Was metabolism and regulation of the organism taught or reviewed Was behavior of the organism taught or reviewed Was reproduction of the organism taught or reviewed Was human biology taught or reviewed Was evolution taught or reviewed Was ecology taught or reviewed Was atomic and molecular structure taught or reviewed Were properties of and changes in matter taught or reviewed Was the periodic system taught or reviewed Were energy relationships in chemical systems taught or reviewed Were reactions taught or reviewed Was inorganic chemistry taught or reviewed Was organic chemistry taught or reviewed Was environmental chemistry taught or reviewed Were chemistry of life processes taught or reviewed Was nuclear chemistry taught or reviewed Were forms and sources of energy taught or reviewed Were forces, time, and motion taught or reviewed Were molecular or nuclear physics taught or reviewed Were energy or matter transformations taught or reviewed Were sound and vibrations taught or reviewed Was light taught or reviewed Were electricity and magnetism taught or reviewed Were solids, fluids, and gases taught or reviewed Classroom control over selecting textbooks Classroom control over selecting content, topics, and skills taught A one pound bag contains 60 percent more than MBAs than green ones. Write a mathematical statement that represents the relationship between the tan (t) and green (g) MAUI, using t and g to .tend for the number of tan and green WM*. "}, {"section_title": "F2T43 YEAR OF TEACHER'S BIRTH", "text": "What is the year of your birth 1925AND BEFORE 1926-19301931-19361936-19401941-19451946-19601951-19561956-19601961 RESPONSE  CODES  FREQ  CENT  PCT  RESPONSE  CODES  FREQ  CENT  PCT  -   Monresponse for this item exceeds the NCES standard. Due to potential nonresponse bias, users should exercise caution when choosing this variable for analysis."}, {"section_title": "RESPONSE", "text": ""}, {"section_title": "NOTE:", "text": "Nonresponse for this item exceeds the NCES standard. Due to potential nonretponss bias v.sers should exercise caution when choosing this variable e for onslysis. Nonresponse to, this item *zooids the NCES standard. Due to potential nonresponse bias users should seerciss caution when choosing this variable e for analysis.\nNonresponso for this item exceeds the NCES standard. Due to potential nonrosponse bias, users should exercise caution when choosing this variable for analysis. Nonresponse for this item exceeds the NCES standard. Due to potential nonresponse bias, users should exercise caution when choosing this variable for analysis.\nNonresponse for this item exceeds the NCES standard. Due to potential nonresponse bias, users should exercise caution when choosing this variable for analysis. 15696 100.0% 100.0%\nNonresponse for this item exceeds the NCES standard.\nNonresponse for this item exceeds the NCES standard. Due to potential nonresponse bias, users should 'xi:raise Due to potential nonresponse bias, users should exercise caution when choosing this variable for analysis. caution when choosing this variable for analysis. Nonreeponte for this item exceeds the NCES standard. Due to potential nonresponse bias, users should exercise caution when choosing this variable for analysis.\nNonresponse for this item exceeds the NCES standard. Due to potential nonresponse bias, users should exercise caution when choosing this variable for analysis. Indicates whether the student attended the same school during data collection in the first follow-up and second follow-up.\nThis variable was supp d on the public data file by NCES in accordance with the confidentiality provisions of PL 100-297. "}, {"section_title": "BEST COPY AVAILABLE", "text": ""}, {"section_title": "2(38", "text": "This flog does not indicate that the small portion cf students who moved from first follow-up school but returned to the school by data collection in the second follow-up were at the school continuously."}, {"section_title": "GLOSSARY OF NELS:88 TERMS", "text": "Note: Words in the glossary have been cross-referenced. If a word used in a definition has its own entry elsewhere in the glossary, the word appears in italics in its first usage under each entry. Alternative completer: The NELS:88 second follow-up distinguished three levels of enrollment status: students enrolled in a regular high school program, dropouts who had enrolled in (or had completed) some alternative (non-diploma) high school equivalency accrediting program (for example, preparation classes for the GED test), and dropouts receiving no alternative instruction. The term \"alternative completer\" was used for dropouts receiving any sort of instruction to prepare them for equivalency certification, and for dropouts who had already received the GED or other equivalency certification. In terms of questionnaire completion, alternative completers were treated in two ways. Dropouts receiving alternative instruction in preparation for possible equivalency certification were administered the dropout questionnaire. Those dropouts who had received the GED or other high school equivalency certification were treated as school completers, and were administered the student questionnaire. ASCII: American Standard Code for Information Interchange. A standard method for encoding characters; includes codes representing upper and lower case letters, numerals, and punctuation. Augmentation students: See State augmentation students. Base year ineligible (BYI) study: A NELS:88 First follow-up study which sought to locate and survey eligible respondents who were part of the Base Year sample, yet were ineligible to participate in the Base Year due to mental or physical incapacity, language barrier, or other factors. (See entry for \"Followback study of excluded students.\") Bias (due to nonresponse): Difference that occurs when respondents differ as a group from nonrespondents on a characteristic being studied. Bias (due to undercoverage): This bias arises because some portion of the potential sampling frame is missed or excluded. For example, if the school list from which a school sample is drawn is incomplete or inaccurate, school undercoverage may occur. In NELS:88 the most important potential source of undercoverage bias was exclusion of 5.37 percent of the potential sample of eighth graders in the base year. (See entry for \"Base year ineligible study\" and \"Followback study of excluded students.\") Bias (of an estimate): The difference between the expected value of a sample estimate and the corresponding true value for the population. Burden: Formally, this is the aggregate hours realistically required for data providers to participate in a data collection. Burden also has a subjective or psychological dimension: the degree to which providing information is regarded as onerous may depend on the salience to the respondent of the questions that are being posed and on other factors such as competing time demands. BY: NELS:88 Base Year Study conducted in 1988. Carnegie units: A standard of measurement used for secondary education that represents the completion of a course that meets one period per day for one year. J-1 F2: Teacher Component Data File User's Manual CCD: Common Core of Data. Data annually collected from all public schools in the United States by the National Center for Education Statistics. CD-ROM: Compact Disk Read-Only Memory. A computer storage disk in the same physical form as an audio CD. A CD-ROM can store approximately 650 megabytes of digital data. NELS:88 data are available both in magnetic media, such as tapes, as well as in optical laser disc media, such as CD-ROM. Ceiling effect: The result of a cognitive test having insufficient numbers of the more difficult items. In a longitudinal study, ceiling effects in the follow-up testings can cause change scores to be artificially constrained for high ability examinees. More information (that is, smaller error of measurement) is obtained with respect to ability level if high ability individuals receive relatively harder items (and if low ability individuals receive proportionately easier items). The matching of item difficulty to a person's ability level yields increased reliability at the extremes of the score distribution where it is most needed for studies of longitudinal change. That is, the measurement problems related to floor and ceiling effects in combination with regression effects found at the extreme score ranges seriously hamper the accuracy of change measures in longitudinal studies. Hence one strategy employed in NELS:88 to minimize ceiling effects was to develop test forms that are \"adaptive\" to the ability level of the examinee. The multilevel tests used in the first and second follow-ups of NELS:88with test assignment based on prior test performancework to minimize the possibility of ceiling effects biasing the estimates of the score gains. (See entry for \"Floor effect.'') Certainty school: A first or second follow-up school attended by four or more NELS:88 sample members, as determined by tracing and data collection efforts. These schools are included in the sample with certainty (probability = 1). All NELS:88 first follow-up sample members in the school at the time of data collection were included in the second follow-up. Closed-ended: A type of question in which the data provider's responses are limited to given alternatives as opposed to an open-ended question. (See entry for \"Open-ended.\") Cluster size: The number of NELS:88 sample members attending a particular high school. Codebook: A record of each variable being measured, including variable name, columns occupied by each variable in the data matrix, values used to define each variable, unweighted frequencies, unweighted percents, end weighted valid percents. (See entry for \"electronic codebook.\") Cognitive test battery: One of the two parts of the Student Survey (the second part being the student questionnaire). Four achievement areas (mathematics, reading, science, and social studies [history/ citizenship /geography]) were measured. Cohort: A group of individuals who have a statistical factor in common, for example, year of birth or grade in school or year of high school graduation. NELS:88 embraces three overlapping but distinct nationally-representative grade cohorts: 1987-88 eighth graders, 1989-90 high school sophomores, and 1991-92 high school seniors. Composite variables: A composite variable is one that is constructed through either the combination of two or more variables (socioeconomic status, for example) or calculated through the application of a mathematical function to a variable. Also called a \"derived variable\" or \"constructed variable.\" F2: Teacher Component Data File User's Manual Confidence interval: A sample-based estimate expressed as an interval or range of values within which the true population value is expected to be located (with a specified degree of confidence). Contextual data: In NELS:88, the primary unit of analysis is the student (or dropout), and information from the other study components, referred to as the contextual data, should be viewed as extensions of the student data--for example, as school administrator, teacher, and parent reports on the student's school learning environment or home situation. Core school: School that was selected between Phases 1 and 2 of the second follow-up to receive the full complement (School Administrator, Teacher, Transcript) of study components, and for in-school data collection sessions. Core student: Students who are part of the primary cohort of NELS:88, in contrast to state augmentation or School Effectiveness Study students. The core students include those chosen as eighth graders in the 1988 Base Year Study and those added to the sample through freshening procedures during the first or second follow-up. Core study: The original NELS:88 study, in contrast to the study with additions and follow-up additions like the state at.vne.lation studies and the School Effectiveness Study. Course offerings: School-level summaries of courses offered and of course enrollment levels; while in IIS&B course offerings data were collected for all schools, in NELS:88 such data have been collected only for schools in the School Effectiveness Study. Cross-sectional survey: A cross-sectional design represents events and statuses at a single point in time. For example, a cross-sectional survey may measure the cumulative educational attainment (achievements, attitudes, statuses) of students at a particular stage of schooling (for example, eighth grade, tenth grade, or twelfth grade). In contrast, a longitudinal (or repeated measurement of the same sample units) survey measures the change or growth in educational attainments that occurs over a particular period of schooling. The longitudinal design of NELS:88 generates -by means of sample \"freshening\"--three representative cross-sections (eighth graders in 1988, high school sophomores in 1990, seniors in 1992) and permits analysis of individual level change over time through longitudinal analysis and of group level and intercohort change through the cross-sectional comparisons. (See entry for \"Longitudinal or Panel Survey.\") Data element: The most basic unit of information. In data processing it is the fundamental data sli-ucture. It is defined by its size (in characters) and data type (e.g. alphanumeric, numeric only, true/false, date) and may include a specific set of values or range of values. Design effect: A measure of sample efficiency. The design effect (DEFF) is the variance of an estimate divided by the variance of the estimate that would have occurred if a sample of the same size had been selected using simple random sampling. Sometimes it is more useful to work with standard errors than with variances. The root design effect (DEFT) expresses the relation between the actual standard error of an estimate and the standard error of the corresponding estimates from a simple random sample. Dropout: The term is used both to describe an event --leaving school before graduating--and a status --an individual who is not in school and is not a graduate at a defined point in time. The \"cohort dropout rate\" in NELS:88 is based on measurement of enrollment status of 1988 eighth graders two and four years later (that is, in the spring term of 1990 and the spring term of 1992) and of 1990 sophomores two years later. J-3 2 7 4 F2: Teacher Component Data File User's Manual A respondent who has not graduated from high school_ or attained an equivalency certificate and who has not attended high school for 20 consecutive days (not counting any excused absences) is considered to be a dropout. In contrast, transferring schools--for example, from a public to a private school--is not regarded as a dropout event, nor is delayed graduation (as when student is continuously enrolled but takes an additional year to complete school). A person who drops out of school may later return and graduate: at the time the person left school initially, he or she is called a \"dropout,\" and at the time the person returns to school, he or she is called a \"stopout.\" Early graduate: A student who graduated from high school in less than the typical amount of time. For example, if a student graduated in December of his/her senior year (when the majority of his/her classmates graduate the following May or June), the student is categorized as an early graduate. In the main study data collection, early graduates were administered a special supplement in the student questionnaire along with the cognitive test battery. Electronic codebook (ECB): While hardcopy codebooks with item stems, response categories, associated response frequency distributions, unweighted percents, and weighted valid percents are contained within the NELS:88 user's manuals, NELS:88 data are also available on CD-ROM in an electronic codebook (ECB) format. For example, the electronic codebook created for the combined base year first follow-up NELS:88 data is a menu-driven system that allows users to perform functions such as the following: (a) search a list of NELS:88 BY-Fl database variables based upon key words or variable names/labels; (b) display weighted and unweighted percentages for each variable in the database; (c) display question text for each variable in the database; (d) select or tag variables for subsequent analysis; (e) generate SAS -PC or SPSS-PC+ program code /command statements for subsequently constructing a system file of the selected variables; and (0 generate a codebook of the selected variables. An electronic codebook is also being prepared for the NELS:88 second follow-up data, and will again be housed on a CD-ROM. ETS: Educational Testing Service. NORCs subcontractor for NELS:88 cognitive test development and evaluation. Fl: The NELS:88 first follow-up, conducted in 1990. F2: The NELS:88 second follow-up, conducted in 1992. File: Refers to a data file containing a set of related computerized records. Floor effect: The result of a cognitive test being too difficult for a large number of the examinees, causing the low ability examinees to receive chance scores on the first testing, and on subsequent testings if the test remains too difficult. Floor effects result in an inability to discriminate among low ability individuals at time one or time two, and there will be no reliable discrimination among examinees with respect to amounts of change. A possible solution, utilized in NELS:88, is to develop test forms that are \"adaptive\" to the ability level of the examinee, which tends to minimize the possibility of floor effects biasing the estimates of the score gains. Followback study of excluded students: A continuation in the NELS:88 second follow-up of a special substudy begun in the first follow-up as (see entry for) the base year ineligibles study. Freshening: A NELS:88 sampling procedure by which high school sophomores were added in the first follow-up who were not in the eighth grade in the U.S. two years before. This process was repeated in the second follow-up, adding high school seniors who were not in the eighth grade in the U.S. four years J-4 ( () F2: Teacher Component Data File User's Manual before, and not in the tenth grade in the U.S. two years before. This process ensured that the sample would be representative of the 1992 senior class by allowing 1992 seniors who did not have a chance for selection into the base year (or the first follow-up) sample to have some probability of 1992 selection. GED recipient: A person who has obtained certification of high school equivalency by meeting state requirements and passing an approved exam, which is intended to provide an appraisal of the person's achievement or performance in the broad subject matter areas usually required for high school graduation. (See entry for \"GED test\" and \"Alternative completer.\") GED test: General Educational Development test. A test administered by the American Council on Education as the basis for awarding a high school equivalent certification. HS&B: High School and Beyond. The second in the series of longitudinal education studies sponsored by NCES. The HS&B Base Year study surveyed sophomore and senior students in 1980. IEP: Individualized Education Program in special education for students with a mental or physical disability. IRT: Item Response Theory. A method of estimating achievement level by considering the pattern of right, wrong, and omitted responses on all items administered to an individual student. Rather than merely counting right and wrong responses, the IRT procedure also considers characteristics of each of the test items, such as their difficulty, and the likelihood that they could be guessed correctly by lowability individuals. IRT scores are less likely than simple number-right or formula scores to be distorted by correct guesses on difficult items if a student's response vector also contains incorrect answers to easier questions. Another attribute of IRT that makes it useful for NELS:88 is the calibration of item parameters for all items administered to all students. This makes it possible to obtain scores on the same scale for students who took harder or easier forms of the test. IRT also permits vertical scaling of the three grade levels (grade 8 in 1988, grade 10 in 1990, grade 12 in 1992). Item nonresponse: The amount of missing information when a valid response to an item or variable was expected. (See entry for \"Unit-nonresponse.\") LEP: Limited English Proficient. A concept developed to assist in identifying those language-minority students (individuals from non-English language backgrounds) who need language assistance services, in their own language or in English, in the schools. (See entries for \"NEP\" and \"LM.\") The Bilingual Education Act, reauthorized in 1988 (PL 100-297), describes a limited English proficient student as one who: 1) meets one or more of the following conditions: a) the student was born outside of the United States or the student's native language is not English; b) the student comes from an environment where a language other than English is dominant; or c) the student is American Indian or Alaskan Native and comes from an environment where a language other than English has had a significant impact on hisfher level of English language proficiency; and 2) has sufficient difficulty speaking, reading, writing, or understanding the English language to deny him or her the opportunity to learn successfully in English-only classrooms."}, {"section_title": "276", "text": "3-5 F2: Teacher Component Data File User's Manual LM: Language Minority. A fully English proficient student in whose home a non-English language is typically spoken. This groups includes students whose English is fluent enough to benefit from instruction in academic subjects offered in English. Longitudinal or panel survey: In a longitudinal design, similar measurementsof the same sample of individuals, institutions, households or of some other defined unitare taken at multiple time points. NELS:88 employs a longitudinal design that follows the same individuals over time, and permits the analysis of individual-level change. (See entry for \"Cross-sectional survey.\") Machine editing: Also called forced data cleaning or logical editing. Uses computerized instructions in the data cleaning program that ensure common sense consistency within and across the responses from a data provider. Microdata (microrecords): Observations of individual sample members, such as those contained on the NELS:88 data files. MSA: Metropolitan statistical area. A large population nucleus and the nearby communities which have a high degree of economic and social integration with that nucleus. Each MSA consists of one or more entire counties (or county equivalents) that meet specified standards pertaining to population, commuting ties, and metropolitan character. (However, in New England, towns and cities, rather than counties, are the basic units.) MSAs are designated by the Office of Management and Budget (OMB). An MSA includes a city and, generally, its entire urban area and the remainder of the county or counties in which the urban area is located. A MSA also includes such additional outlying counties which meet specified criteria relating to metropolitan character and level of community of workers into the central city or counties. Multidimensional raking: An adjustment procedure in weighting whereby the sum of the weights for each marginal category of respondents in the follow-up rounds of NELS :88 was made equal to the corresponding sum of the final prior round weights for that group. NAEP: The National Assessment of Educational Progress."}, {"section_title": "NAIS:", "text": "The National Association of Independent Schools. This organization enuorsed NELS:88. NAIS schools form a base year school sampling stratum in NELS:88, and NAIS constitutes a category within the restricted use file school control type variable. NCEA: The National Catholic Educational Association. This organization endorsed NELS:88. NCES: The National Center for Education Statist ,s, Office of Educational Research and Improvement, of the U.S. Department of Education. This governmental agency is the primary sponsor of NELS:88, and is also the sponsoring agency for (among other studies) NAEP, HS&B, and MIS -72. NELS:88: The National Education Longitudinal Study of 1988. Third in the series of longitudinal education studies sponsored by NCES. The study began in 1988 with the eighth-grade class of that year. The study has collected data in 1988, 1990, and 1992 on student's school experiences, as well as background information from school administrators, teachers and parents (in the base year and second follow-up only). The study seeks to learn about students' educational experiences and outcomes from eighth grade through high school and beyond. J-6 2 7 F2: Teacher Component Data File User's Manual NEP: No English Proficiency. A student who does not speak English. (See entry for \"LEP.\") NLS-72: The National Longitudinal Study of the High School Class of 1972. This project was the first in the series of longitudinal education studies sponsored by NCES. Noncertainty schools: Schools in which fewer than four (three, two or one) NELS:88 students attended. These schools were not subsampled for participation in the School Administrator, Teacher, and Transcript components. Additionally, the survey instruments were not administered in group sessions in the schools, as was done in the certainty schools. Nonresponse: (See entry for \"Item nonresponse\" and \"Unit nonresponse.\") Nonsampling error: An error in sample estimates that cannot be attributed to sampling fluctuations. Such errors may arise from many sources including imperfect implementation of sampling procedures, differential unit or item nonresponse across subgroups, bias in estimation, or errors in observation and recording. NORC: The National Opinion Research Center at The University of. Chicago. NORC conducts NELS:88 for the National Center for Education Statistics. NSF: The National Science Foundation, which is one of the sponsors of NELS:88. The National Science Foundation awards grants and contracts to individuals and organizations to conduct research. NSF sponsored two components of the second follow-up: 1) additions to the student questionnaire to learn about students' experiences and their exposure to mathematics and science curricula, and 2) a teacher survey of mathematics and science teachers to obtain evaluations of their NELS:88 student(s) and to learn about their classroom practices and background preparation for teaching. OBEMLA: The Office of Bilingual Education and Minority Languages Affairs, U.S. Department of Education. OBEMLA funded a NELS:88 supplement that inquired into the education experiences of students whose native language is other than English. OMB: The Office of Management and Budget, U.S. Executive Branch. OMB is a federal agency with the responsibility for reviewing all studies funded by executive branch agencies. OMB reviewed, commented on, and approved the NELS:88 questionnaires, as indicated by their approval number and its expiration date in the top right corner of the questionnaire covers. Open-ended: A type of question in which the data provider's responses are not limited to given alternatives. Optical disk: A disk that is read optically (e.g., by laser technology), rather than magnetically. (See entry for \"CD-ROM.\") Optical scanning: A system of recording responses that transfers responses into machine-readable data through optical mark reading. This method of data capture was used for the NELS:88 student questionnaires and cognitive tests, as well as for the parent and teacher questionnaires. (In contrast, responses to certain other questionnaires, such as the school administrator questionnaire, were keyed by using conventional data entry methods.) Out-of-sequence: This term means that a student is not in the grade that he/she would be in if progressing with the majority of the cohort through school. For example, most NELS:88 sample 2e8 J-7 F2: Teacher Component Data File User's Manual members were in the tenth grade in the 1989-90 school year; one would be described as out-of-sequence if found to be in the eleventh grade in the 1989-90 school year. Parent, . NETS-targeted parent/guardian: The NELS:88 Parent Component sought to collect information from parents of eligible student/dropout respondents. It was asked that the parent or guardian who knew most about his or her child's educational experience complete the questionnaire. PIN: Personal Identification Number. A unique number assigned to each district and school. Population: All individuals in the group to which conclusions from a data collection activity are to be applied. Weighted results of NELS:88 data provide estimates for populations and subgroups. Population variance: A measure of dispersion defined as the average of the squared deviations between the observed values of the elements of a population or sample and the population mean of those values. Postsecondary education: The provision of formal instructional programs with a curriculum designed primarily for students who have completed the requirements for a high school diploma or equivalent. This includes programs of an academic, vocational, and continuing professional education purpose, and excludes avocational and adult basic education programs. Poststratification adjustment: A weight adjustment that forces survey estimates to match independent population totals within selected poststrata (adjustment cells). Precision: The difference between a sample -based estimate and its expected value. Precision is measured by the sampling error (or standard error) of an estimate. Probability sample: A sample selected by a method such that each unit has a fixed and determined probability of selection. QED: Quality Education Data. QED is a commercial firm that publishes national directories of all public and private schools and districts. Its list of schools in the U.S. constituted the sampling frame for the base year, and provided important information on school location, principal's name, minority enrollment, and other characteristics. Range check: A determination of whether responses fall within a predetermined set of acceptable values. Record format: The layout of the information contained in a data record (includes the name, type, and size of each field in the record). Records: A logical grouping of data elements within a file upon which a computer program acts. Reliability: The consistency in results of a test or measurement including the tendency of the test or measurement to produce the same results when applied twice to some entity or attribute believed not to have changed in the interval between measurements. Sample: Subgroup selected from the entire population. Sampling error: The part of the difference between a value for an entire population and an estimate of that value derived firc:n a probability sample that results from observing only a sample of valuea."}, {"section_title": "J-8", "text": "(-) H. , , Sampling variance: A measure of dispersion of values of a statistic that would occur if the survey were repeated a large number of times using the same sample design, instrument and data collection methodology. The square root of the sampling varian :e is the standard error. School administrator questionnaire: This questionnaire was to be completed by the principal and/or someone designated by the principal. The questionnaire sought basic information about school policies, number of students in each class, curriculum offered, programs for disadvantaged and disabled students, and other school characteristics. School climate: The social system and culture of the school, including the organizational structure of the school and values and expectations within it. School Coordinator: A person designated in each school to act as a contact person between the school and NORC. This person assisted with establishing a survey day in the school, and in some cases where the school cluster size was very small, the School Coordinator administered the student instruments. School Effectiveness Study: A component of NELS:88 added to the first follow-up to permit the study of school effects. The supplement substantially increased cluster sizes and provided in-school representative student samples at approximately 250 urban and suburban schools in the thirty largest MSAs in order to permit researchers to assess the impact of various school characteristics (such as structural and management characteristics and school climate) on student outcomes (such as student achievement and educational experience). This component was continued in the second follow-up, and included student, school administrator, teacher, and parent questionnaires, transcript surveys, as well as a course offerings component. Standard deviation: The most widely used measure of dispersion of a frequency distribution. It is equal to the positive square root of the population variance. Standard error: The positive square root of the sampling variance. It iv. a measure of the dispersion of the sampling distribution of a statistic. Standard errors are used to establish confidence intervals for the statistics being analyzed. State augmentation students: In the base year, certain states funded a sample of additional schools in the state to produce a representative sample of schools in the state. In this sense, the state's sample was \"augmented\" to maximize the utility of the NELS:88 data for those states. The students from those base year schools were designated as \"augmentation\" students, and were followed and surveyed in the first follow-up, though the students had dispersed to many tenth-grade schools. In the second follow-up these students were rveyed again. Stopout: A student who had one or more occurrences of school non-attendance for 20 or more days (not including any excused absences) who subsequently returned to school. In NELS:88, this term was used for temporary dropouts v4 a round (e.g., out of school in fall 1989 but back spring 1990, as contrasted to 1990 dropouts who were back in school in spring term of 1992). Student questionnaire: One of the two parts of the student survey (the other part is the cognitive test battery). This instrument contained a locator section for tracing sample members for future waves of NELS:88 and a series of questions about courses taken, hours spent on homework, and perceptions of the school and the home environment."}]