[{"section_title": "", "text": "Accumulation of β-amyloid (Aβ) in the brain is associated with memory decline in healthy individuals as a prelude to Alzheimer's disease (AD). Genetic factors may moderate this decline. We examined the role of apolipoprotein E (ε4 carrier "}, {"section_title": "INTRODUCTION", "text": "In healthy individuals, high β-amyloid (Aβ) levels suggest that preclinical Alzheimer's disease (AD) has begun. 1, 2 However, variability in the extent of cognitive and clinical impairment in Aβ + healthy individuals suggests other factors influence Aβ-related cognitive decline. 3, 4 The major genetic risk factor for sporadic AD is the apolipoprotein E (APOE) ε4 allele: 5, 6 apoE may be involved in AD pathogenesis directly, through increasing Aβ accumulation, reducing clearance of Aβ or modifying Aβ-synaptic toxicity, [5] [6] [7] or indirectly, through reducing synaptic plasticity, increasing neuroinflammation or affecting concurrence of cerebrovascular events. 3, 8 In accord with this, a recent study of 490 healthy individuals aggregated from the Australian Imaging, Biomarkers and Lifestyle (AIBL) Study, the Alzheimer's Disease Neuroimaging Initiative (ADNI) and the Harvard Aging Brain Study showed that carriage of the ε4 allele increased substantially the rate of memory decline in healthy individuals with high Aβ levels (Aβ + ε4 + ) over a median follow-up period of 1.5 years. 9 This analysis also showed that individuals who were ε4 carriers but with low Aβ (Aβ − ε4 + ) showed no memory decline compared with ε4 non-carriers with low Aβ (Aβ − ε4 − ), suggesting that, by itself, the APOE ε4 allele is not associated with memory decline. However, as the APOE ε4 allele is associated with increased cognitive decline in healthy individuals, 10 and earlier diagnosis of AD, 11 the effect of APOE ε4 on Aβ-related cognitive decline warrants further investigation over time intervals greater than 18 months.\nAnother strong genetic candidate for moderating Aβ-related memory decline is the brain-derived neurotrophic factor (BDNF) Val66Met polymorphism. BDNF is important in the biological basis of learning and memory in animals and humans. 4, [12] [13] [14] Prospective studies show that in healthy and mild cognitive impairment groups from both the AIBL and ADNI cohorts, BDNF Met carriage is associated with faster Aβ-related memory decline and hippocampal atrophy over 3 years but is unrelated to Aβ accumulation, [15] [16] [17] suggesting that BDNFVal66Met moderates the effects of Aβ on synaptic integrity in preclinical AD. 17 To our knowledge, no study has examined the interaction between BDNF, APOE and Aβ-related memory decline.\nThe overarching aim of this study was to explore potential interactions between Aβ, APOE and BDNF on cognitive decline in 333 healthy individuals who had undergone Aβ neuroimaging, genetic testing and 54-month clinical follow-up as part of the AIBL study. First, we examined whether episodic memory (EM) and other aspects of cognition would remain stable over 54 months in "}, {"section_title": "MATERIALS AND METHODS Participants", "text": "Participants were recruited from the AIBL healthy adult group, the recruitment of which has been described previously. 18, 19 Briefly, exclusion criteria included the following: schizophrenia, depression (15-item Geriatric Depression Score ⩾ 6), Parkinson's disease, symptomatic stroke, uncontrolled diabetes and alcohol use exceeding two standard drinks per day for women or four per day for men. Participants underwent medical, psychiatric and neuropsychological assessments at baseline, 18-, 36-and 54-month follow-up. 19 At each assessment, a clinical review panel considered all available medical, psychiatric and neuropsychological information to classify clinical status. 19 Clinical classification was blinded to neuroimaging results. Group demographic and clinical characteristics are provided in Table 1 , with the number of participants whose diagnostic classification changed or who withdrew from the study shown in Figure 1 . The study was approved by and complied with the regulations of three institutional research and ethics committees. 19 All participants provided written informed consent."}, {"section_title": "Measures", "text": "Neuroimaging. Aβ imaging with positron emission tomography (PET) was conducted using either 11 C-Pittsburgh Compound B (PiB), 18 F-florbetapir or 18 F-flutemetamol. PET methodology has been described in detail previously. 18, 20, 21 A 30-min acquisition was started 40 min post injection of PiB and a 20-min acquisition was performed 50 min post injection of florbetapir and 90 min post injection of flutemetamol. For PiB-PET, standardized uptake value (SUV) data were summed and normalized to the cerebellar cortex SUV, resulting in a region-to-cerebellar ratio termed SUV ratio (SUVr). The whole cerebellum was the reference region for florbetapir, 21 while for flutemetamol the reference region was the pons. Consistent with these studies, SUVr was classified dichotomously as either negative (Aβ − ) or positive (Aβ + ). PiB studies were classified Aβ + when SUVr ⩾ 1.5, 18 florbetapir, when SUVr ⩾ 1.11 ref. 21 and for flutemetamol when SUVr ⩾ 0.62. 20 Aβ + levels were further classified as being 'high' Aβ + (SUVr PiB41.9; flutemetamol40.82; florbetapir41.29) or 'low' Aβ + (SUVr PiB = 1.5-1.9; flutemetamol = 0.62-0.82; florbetapir = 1.11-1.29)."}, {"section_title": "22,23", "text": "Genotyping. A blood sample was taken from each participant for genotyping. The BDNFVal66Met polymorphism (rs6265) was included in a custom Illumina GoldenGate assay, which included 1536 singlenucleotide polyorphisms, and was performed by the Beijing Genomics . The development and validation of each cognitive composite score has been described previously. 23, 24 Data analysis For each composite cognitive score, three planned comparisons were constructed using repeated-measures linear mixed-effects model with maximum likelihood estimation and an unstructured covariance matrix. Linear mixed modeling was employed because of its ability to model both fixed and random effects, which accounts for multiple sources of variability in longitudinal studies. In addition, both empirical and theoretical models of AD show that once the threshold for Aβ positivity is reached, there is a linear trend in cognitive decline, neurodegeneration and amyloid accumulation until a clinical diagnosis of AD is reached. 1, 2, 25 In these analyses, Aβ status (\n, time, APOE × Aβ interaction, APOE × time interaction, Aβ × time interaction and APOE × Aβ × time interaction were entered as fixed factors; participant as a random factor; age, premorbid intelligence and anxiety levels as covariates; and cognitive composite score as the dependent variable. Within the model, the magnitude of difference from the Aβ − ε4 − group was expressed using Cohen's d. 26 Where the planned comparisons indicated differences between group trajectories, group means (95% confidence intervals (95% CIs)) for each assessment were estimated from the model and differences in these between Aβ + ε4 − and Aβ + ε4 + groups at each assessment were determined by the extent of overlap between the 95% CIs associated with those means.\nTo examine the effect of BDNFVal66Met, separate linear mixed-effects models were conducted for each composite score in Aβ + individuals. Table 1 . Demographic and clinical characteristics of the full sample and of study groups − group was defined as clinically important cognitive impairment. 27 The time to reach this criterion was estimated for each group based on linear mixedeffects model-derived linear functions."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Demographic and clinical characteristics", "text": "At baseline, statistically significant differences between groups were observed for age, premorbid intelligence and anxiety symptoms (Table 1) . No other demographic or clinical characteristics differed between groups. There was no difference in the proportion of individuals in the ε4 + or ε4 − groups who were classified as high Aβ + ( Table 1) .\nEffect of Aβ levels and ε4 on cognitive change Group mean slopes for each Aβ-ε4 group for each composite cognitive score are summarized in Table 2 . Relative to Aβ − ε4 − , the Aβ + ε4 + group showed a significantly faster decline on all cognitive composites, with these differences moderate to large in magnitude ( Table 1 ). The rate of verbal EM decline in the ε4 + BDNF Met group indicated it met criterion for clinically significant impairment within 3 years from enrolment ( Figure 2b ). In contrast, extrapolation of the rate of verbal EM decline suggested that ε4 + BDNF Val/Val group would meet criterion for clinically significant impairment within 10 years. Groups did not differ in the rate of decline on the executive function and attention composites (Table 3) . Finally, relative to the ε4 − BDNF Val/Val group, the ε4 − BDNF Met group did not show a significantly faster decline on any cognitive composite. DISCUSSION EM and all other aspects of cognition remained stable over 54 months in Aβ − individuals, irrespective of ε4 status, which replicates and extends previous observations from AIBL 23, 28 and other cohorts. [29] [30] [31] The absence of any ε4-related cognitive decline in the current Aβ − individuals is also consistent with findings of a recent study 9 and supports the hypothesis that there are no Aβ-independent effects of APOE on cognitive decline in healthy individuals, even when studied over more than 4 years. Compared with the Aβ − ε4\n− group, Aβ + individuals showed faster decline in EM, and this decline was increased by ε4 + (Figure 2a) . Recently, the exacerbation of Aβ-related memory decline by ε4 carriage in healthy individuals was shown over 1.5 years. 9 The current findings support and extend this report by demonstrating that APOE ε4 carriage does exacerbate Aβ-related cognitive decline in healthy individuals, and persists over more than 4 years. Neurologically, APOE can affect both intrinsic (for example, synaptic plasticity and neuroinflammation) and extrinsic (for example, cerebrovascular disease) factors. 3, 8, 32 As all participants in the AIBL study have well-controlled risk factors for cardiovascular disease, 19 the risk of concomitant cerebrovascular events over the period of observation was reduced. Further, as there is increasing experimental evidence that APOE isoforms have a direct effect on Aβ deposition, clearance and Aβ-mediated synaptotoxicity, 5-7 a likely explanation for the cognitive decline seen in the Aβ + ε4\n+ group is that APOE moderates the direct effects of Aβ accumulation. These results differ from previous reports, where we and others found no effect of ε4 carriage on Aβ-related cognitive decline. 23, 28, 30, 33 The most likely reason for this lack of effect was that the smaller sample sizes used in these studies resulted in reduced power to detect any effects of ε4 on Aβ-related cognitive decline. 23, 28, 30, 33 We reported previously that BDNFVal66Met moderated Aβ-related changes in cognition and neurodegeneration in both healthy older and mild cognitive impairment groups in AIBL and ADNI, although it did not moderate the rate of Aβ deposition. [15] [16] [17] Consistent with evidence indicating that BDNF is necessary for synaptic plasticity in the hippocampus, 4 we proposed that BDNFVal66Met affects the clinical manifestation of early AD by influencing the ability of the brain to tolerate Aβ toxicity. 16, 17 In the current study, we explored whether BDNFVal66Met moderated any relationship between Aβ, ε4 and cognition. The Aβ + ε4 + BDNF Met group showed faster decline in EM and language compared with both the ε4 − BDNF Val/Val and ε4 − BDNF Met groups (Figure 2b) . The ε4 + BDNF Val/Val group showed a moderate rate of cognitive decline. Consistent with our previous observations, [15] [16] [17] BDNFVal66Met, such as APOE, did not moderate any cognitive variable in Aβ − individuals.\nThese results raise some important prognostic issues in managing preclinical AD and the implications for communicating these group data to individuals. The data demonstrates clearly that the rate of cognitive decline in preclinical AD is moderated by the combination of at least two genetic loci: Table 1 ). Another way of expressing these observations is to consider the length of time between establishing an individual's Aβ, ε4 and BDNF status and a criterion for clinically significant cognitive impairment (performance o1.5 s.d. below controls, 27 dashed horizontal line in Figure 2 ). In the Aβ − group, irrespective of ε4 status, there was no evidence of decline over 4.5 years (Figure 2a) . In contrast, extrapolation of the EM decline observed in the Aβ + ε4\n+ group showed that clinically significant memory impairment would be met~9 years after enrolment, while the Aβ + ε4 − group would take~27 years. Taking into consideration the additional effect of BDNF in Aβ + individuals, the effect of BDNF is seen clearly in the ε4 + subgroup where BDNF Val/Val homozygotes would meet criteria for clinically significant impairment after~10 years (similar rate based on ε4 + status alone) but the accelerated rate of memory decline in the BDNF Met group meant that they met this criteria after only 3 years (Figure 2b ). Although there is some evidence in the model that even at baseline the Aβ + ε4 + BDNF Met group performs worse than the other three groups, this difference was not statistically significant. One limitation of natural history cohorts is that the baseline performance of each individual is defined by their first visit, rather than symptom onset. As such, the data presented here can be interpreted as suggesting that the combination of Aβ + , ε4 + and BDNF Met does accelerate cognitive decline significantly such that even at the first assessment this decline is already evident. A diagnosis of mild cognitive impairment is typically made when objective evidence of clinically significant memory impairment is accompanied by individuals' acknowledgement of that impairment, usually corroborated by an informant. 27 General cognitive function and functional activities are also typically preserved. 27 Over the course of this study, relatively few healthy individuals were classified as meeting clinical criteria for mild cognitive impairment/AD (Figure 1 ). This indicates that although some individuals met criteria for clinically significant impairment, these individuals, or their caregivers, had not acknowledged any problems with cognition. We have reported previously that subjective memory impairment in the AIBL healthy cohort does not predict objectively defined cognitive impairment or Aβ levels. 34 Presumably, individuals with clinically significant memory decline observed here will begin to report subjective memory complaints in the future.\nAn important caveat is that as three radioligands were used to measure Aβ, SUVr data could not be integrated to form a single continuous measure of Aβ burden. However, we found no relationship between the proportions of individuals who were high and low Aβ + in the Aβ + ε4 + and Aβ + ε4 − groups, suggesting that the faster decline observed in Aβ + ε4 + was not due to more advanced disease at enrolment. Second, although the large number of healthy individuals who have undergone Aβ PET neuroimaging in the AIBL cohort has allowed for this report to investigate the effects of APOE and BDNF on the clinical manifestation of high Aβ, the resultant sample sizes remain relatively small. Further, the AIBL study is also not a representative population sample. Healthy participants in the AIBL study were highly educated, were of Caucasian backgrounds and had few existing or untreated medical, neurological or psychiatric illnesses. Participants selected for neuroimaging were also enriched for APOE ε4 carriers. As such, these results need to be replicated in other more representative and ethnically diverse prospective cohorts of healthy individuals. Finally, APOE and BDNF are unlikely to be the only factors that moderate the clinical manifestation of Aβ; rather, other co-morbidities (for example, cerebrovascular disease) and lifestyle and genetic factors will need to be considered in future work."}, {"section_title": "CONFLICT OF INTEREST", "text": "CLM is an advisor to Prana Biotechnology Ltd and a consultant to Eli Lilly. RHP and PJS are scientific consultants to Cogstate Ltd. PM is a full-time employee of Cogstate Ltd. DA has served on scientific advisory boards for Novartis, Eli Lilly, Janssen and Pfizer Inc. RNM is a consultant to Alzhyme. CCR has served on scientific advisory boards for Bayer Pharma, Elan Corporation, GE Healthcare and AstraZeneca, has received speaker honoraria from Bayer Pharma and GE Healthcare and has received research support from Bayer Pharma, GE Healthcare, Piramal Lifesciences and Avid Radiopharmaceuticals. VLV served as a consultant for Bayer Pharma and has received research support from a NEDO grant from Japan. All other authors declare no conflict of interest."}]