[{"section_title": "", "text": "addition, phonics and integrated language arts instruction were common in schools enrolling more high-achieving children from affluent families (Xue 2002). The national focus on promoting proven effective methods for teaching reading suggests the need for information on the reading instructional activities that children experience as they begin formal schooling. This is important in light of the concern with providing learning opportunities to all children, and especially to those who are economically and educationally disadvantaged. In this study, we first examine the frequency that kindergartners spend in different types of reading instructional activities in their classrooms in the United States. Next, we examine the relationships among child, family and classroom/program characteristics, children's experience with various types of reading activities, and their gains in reading over the kindergarten year. This study uses data from the Early Childhood Longitudinal Study, Kindergarten Class of 1998-99 (ECLS-K) to answer the following questions: 1. Which of the various reading instructional activities do kindergartners do most often? 2. Who has opportunities to participate in the various types of instructional activities? school year was chosen to participate in the study. Children were administered a two-stage individual I U.S. Department of Education, National Center for Education Statistics, (2000) ECLS-K Base Year Public-Use Data File, Kindergarten Class of 1998-99, Data Files and Electronic Code Book: User's Manual. NCES 2001-029. 4 assessment in the areas of reading, mathematics, and general knowledge in fall of 1998 and spring of 1999. In addition, kindergarten teachers in the sampled schools were asked to complete a set of selfadministrated questionnaires about themselves, their students, and their classrooms. The data used in this paper come from the child assessment and teacher questionnaire instruments in the fall and spring of the kindergarten year.2 This paper analyzes data from the subset of 14,975 children who attended kindergarten for the first time in fall of 1998 and were administered a reading assessment in English in both fall and spring of the kindergarten year and who had complete teacher questionnaire data.' Descriptive statistics were used to describe the reading instruction children received in various kindergarten programs, and how instruction differed by the characteristics of the children and their schools. Next, linear regression analyses were used to examine the relationships of the child, family, and kindergarten program characteristics to the gains children made in reading during the kindergarten year. All results discussed in the paper are statistically significant at the .05 leve1.4"}, {"section_title": "Measures", "text": "Information in this paper was collected through child assessments and teacher questionnaires. Below is a brief description of the measures and characteristics used from these information sources. More detailed information on the measures can be found in the Early Childhood Longitudinal Study, Kindergarten Class of 1998-99: Base-Year Public-use Data Files User's Manual (NCES 2001). Reading/writing instructional activities: Kindergarten teachers responded to a series of selfadministered questionnaire items in the spring of 1999, describing the frequency with which various reading and writing instructional activities occurred in their classrooms (1=never, 2=once a month or less, 3=2-3 times a month, 4=1-2 times a week, 5=3-4 times a week, 6=daily). Figure 1 shows the mean frequency of each of the individual reading and writing instructional activities that represent phonetics, whole language, and emergent literacy approaches. Using principal components analysis with Varimax rotation, four sets of reading activity scales were created based on the individual items. The four reading activity scales and the items that comprise them included: Writing For example, the set of basic decoding skills activities includes working on letter names, practicing writing the alphabet and working on phonics corresponds to activities emphasized in phonics instruction (National Reading Panel 2000;Snow, Burns, and Griffin 1999). The reliability of these sets range from .53 to .78. The low subscale reliabilities of three of the scales (i.e., basic decoding, comprehension, and skills-based activities) may be a function of the low number of items comprising each of these scales. Kindergartners received a score for the writing-based activities scale if they had valid data for at least 4 of the 6 items that composed the scale and they received scores for the other three reading activity scales if they had valid data for at least 2 of the 3 items that composed each scale. Children's scores on each of the four reading activity scales were the mean of all item scores that comprised each scale. Reading assessment scores: Children were administered an untimed, individualized 2-stage assessment in reading using computer adaptive testing in the fall and spring of kindergarten. Child and family characteristics: Kindergartners' reading classroom practices and gains in reading were examined in relation to selected child and family background characteristics' including: Child's sex (male, female). Fifty-one percent of the sampled kindergartners were boys. Child's race/ethnicity (White, non-Hispanic; Black, non-Hispanic; Hispanic; Asian/Pacific Islander; Other, non-Hispanic).8 Sixty-one percent of the children were White, 18 percent were Black, 14% were Hispanic, 3 percent were Asian or Pacific Islander, and 4 percent were from Other, non-Hispanic backgrounds. Family socioeconomic status (SES) (lowest 20 percent, middle 60 percent, highest 20 percent). This composite in the ECLS-K database is derived from the following variables: mother/female guardian's education level, father/male guardian's education level, mother/female guardian's occupation, father/male guardian's occupation, and household income. For this paper, the family SES quintile variable was collapsed into three groups representing children in the lowest 20 percent, the middle 60 percent, and the highest 20 percent of the range of SES values. School and classroom characteristics: The reading practices in children's classrooms and children's reading gains were also examined in relation to the characteristics of their kindergarten classrooms and schools, including: School sector (public, private). Eighty-four percent of the sample attended public schools. Kindergarten program type (half-day, full-day). Fifty-three percent of the children attended full-day kindergarten programs. Percent of minority children in the classroom (Less than 50 percent minority children, 50 percent or more minority children). Sixty-seven percent of the sample attended classrooms with less than 50 percent minority enrollment. School income level (less than 50 percent low-income children, 50 percent or more lowincome children).9 Fifty-seven percent of the children attended schools with less than 50 percent low-income enrollment."}, {"section_title": "Findings", "text": "Which of the various reading instructional activities do kindergartners do most often? In general, kindergartners were engaged most often in basic decoding skill activities, such as working on letter names, practicing writing the alphabet, and working on phonics (table 1). On average, kindergartners spent time almost every day on basic decoding skills activities. They also were exposed at least weekly to comprehension-based activities, and about 2-3 times a month to writingbased and skills-based activities. This was true both for kindergartners attending a full-or a half-day program. Who has opportunities to participate in the various types of instructional activities? The frequency of each reading activity was higher for kindergartners in full-day programs than for those in half-day programs (table 1). In some cases, the frequency of opportunities for kindergartners to participate in various types of reading activities was also related to the type of school in which they were enrolled. For instance, the frequency of writing-based activities for kindergartners attending public schools (both half-and full-day programs) was higher than for kindergartners in private schools (3.2 vs. 2.5 half day; 3.7 vs. 3.1 full day, effect sizes (ES) = .75 SD and .58 SD respectively). Since the majority of kindergartners (85 percent) attend public schools (West, Denton, and Reaney 2001), the remaining analyses reported in this paper concentrate on kindergartners in public schools. The frequency of children's participation in different reading instructional activities in kindergarten was examined in relation to characteristics of the children, their families, classrooms, and schools (tables 2 and 3). Results are reported separately by kindergarten program type (half-or fullday) since the frequency of reading instruction was related to the length of children's instructional day. Several noteworthy findings include the following: The frequency of basic decoding skills activities (e.g., working on letter names) in the classroom was similar for kindergartners across all of the child, classroom, and school measures considered in this paper. Kindergartners in half-and full-day public programs had opportunities to participate in basic decoding skills activities on almost a daily basis (5.6 and 5.8, respectively). The frequency of comprehension-based activities (e.g., reading silently) varied by children's fall kindergarten reading proficiency level, the school low-income level and race/ethnicity in full-day kindergarten programs. For example, children in full-day programs performing at proficiency levels 2 and 3 (i.e., identifying beginning sounds and identifying ending sounds) had more opportunities to participate in comprehension-based activities during the week than kindergartners performing at the lowest reading proficiency level (i.e., those not able to identify letters) (5.0 and 5.1 vs. 4.7, ES =.27 and .40 SD, respectively). Also, full-day kindergartners attending schools with high proportions of low-income children had less exposure to comprehension activities than children with fewer low-income students in their schools (4.7 vs. 5.0, ES = .27 SD). In full-day kindergartens, Hispanic and Asian/Pacific Islanders had more exposure to these activities than White kindergartners (5.1 vs. 4.8, ES = .27 SD). 9 1 0 In half-day kindergarten programs, Asian/Pacific Islander children had greater opportunities to participate in comprehension-based activities than White kindergartners (4.7 vs. 4.4, ES = .26 SD). The frequency of writing-based activities (e.g., writing stories/reports) differed by kindergartners' family SES, their fall reading level, the concentration of low-income children attending the school, and race/ethnicity. For example, full-day kindergartners in schools with 50 percent or more lowincome children enrolled had less frequent exposure to writing-based activities than children in schools with lower concentrations of low-income children enrolled (3.6 vs. 3.9, ES = .33 SD). Children performing below level 1 had less exposure to writing-based activities than those performing at level 3 (3.6 vs. 3.8, ES = .20 SD). Asian/Pacific Islanders in full-day programs had higher levels of exposure to writing-based activities than White and Black children (4.0 vs. 3.6 3.9, ES = .30 .40 SD) and Hispanic kindergartners had more frequent exposure to such activities than White kindergartners (3.9 vs. 3.7, ES = .20 SD). In half-day programs, children at the lowest reading level (i.e., below level 1, not able to identify letters) had less exposure to these activities than kindergartners with skills at the third reading level (3.1 vs. 3.4, ES = .33 SD). In addition, Asian/Pacific Islander children had greater exposure to writing-based activities than Black kindergartners (3.3 vs. 3.0, ES = .33 SD). The frequency of skills-based reading activities (e.g., using basal reading texts) varied by kindergartners' family SES, percent minority in the classroom, the school's income level and kindergartners' race/ethnicity. For example, in full-day programs, kindergartners from the highest SES level were engaged in skills-based activities less frequently than children from lower SES levels (2.8 vs. 3.2-3.4, ES=.29 and .44 SD, respectively). Also, children in full-day kindergarten programs with less than 50 percent classroom minority enrollments had less exposure to skillsbased reading activities compared with kindergartners in classrooms with higher minority enrollments (3.1 vs. 3.5 ES = .29 SD). In terms of the concentration of low-income children in the school, full-day kindergartners in schools with high concentrations of low-income children were exposed more often to skills-based activities than kindergartners in schools with fewer lowincome children (3.4 vs. 3.0, ES = .29 SD). Furthermore, Black kindergartners had the most opportunities to practice skills-based activities of all racial/ethnic groups of children (3.5 vs. 3.0 3.2, ES=.22 .37 SD). In half-day kindergarten programs, children in classrooms with 50 percent or higher minority enrollments participated in skills-based reading activities more often than kindergartners in classrooms with lower minority enrollments (2.9 vs. 2.5, ES = .36 SD). In addition, White kindergartners in half-day programs had less frequent exposure to skills-based activities than Hispanic kindergartners (2.6 vs. 2.9, ES =.27 SD). Are the various instructional activities used in public school kindergarten classrooms associated with children's reading gains? On average, half-day kindergartners made a gain of 9.4 points on the reading scale over the course of the school year, while full-day kindergartners made a gain of 10.5 points. These gains from fall to spring are larger than one standard deviation, relative to the fall reading scores. Based on the differences found in children's reading instruction in kindergarten, exploratory linear regression analyses were used to examine whether the frequency of exposure to different types of reading instructional activities were related to children's gains in reading over the kindergarten year. A series of regression models were used to model the relationship between the frequency of exposure to various reading instructional practices and children's gains in reading during kindergarten, after controlling for other factors (table 4). In the first model (table 4, model 1), children's reading gains were examined in relation to their sex, race/ethnicity, family SES, and kindergarten program type, which would serve as control variables for the final descriptive regression analysis. Model two (table 4)  whether children's gains in kindergarten might be related to their initial status in reading at the start of the school year. The final regression model (table 4, model 3) controlled for variables from the first two models and also examined the relationship of the four types of reading activities (i.e., literature-based activities, basic decoding skills activities, comprehension activities, and skills-based approach activities) with kindergarten reading gains, net of other characteristics included in the model. The relationships of the child, family, and kindergarten program type variables to kindergarten reading gains were similar across all 3 of the regression models. Since this was the case, the results are presented in terms of the final model.\" The focus of the exploratory regression analyses in this paper was to describe the relationships between the frequency of exposure to the different types of reading activities and children's gains in reading over the kindergarten year, after controlling for other characteristics, rather than make causal interpretations between instructional practices and reading achievement. Based on the analyses, reading gains were found to be positively associated with many of the types of reading activities that were measured. After controlling for children's individual and family characteristics, the kindergarten program type and the elapsed time between assessments, children in classrooms where skills-based, basic decoding, and comprehension-based activities were practiced more often made greater reading gains over the school year. For example, a one-point increase on the basic decoding skills scale translated to almost a half-point gain (b = 0.44) in reading during the school year. A one-point increase in the skills-based scale was related to about a third of a point reading gain (b=0.33) and a one-point gain in the comprehension activities scale translated to a fifth of a point (b=0.21) increase in children's reading gains during kindergarten, after controlling for other characteristics. The writing-based activities scale was not statistically significantly related to children's reading gains after controlling for other variables. The regression results also indicate that several of the control variables used in the model were associated with children's gains in reading over the kindergrten year (table 4). After controlling for other variables in the model, males showed smaller gains, about two-thirds of a point lower (b=-0.69) over the kindergarten year than females. Reading gains were also related to children's race/ethnicity I I Since regression analyses identify significant relationships after controlling for other factors associated with the dependent variable, effect size criteria were not applied to the regression coefficients. Thus, findings from this paper may differ from previous ECLS-K publications that use less complex models to examine relationships between children's characteristics and their kindergarten reading gains (e.g., West, Denton, and Reaney (2001). t3 and family SES. Black kindergartners showed smaller gains, about one and one-half points lower (b= -1.58) than White kindergartners and Asian kindergartners showed larger gains that White kindergartners. Kindergartners from families in the middle and high socioeconomic levels showed larger gains than kindergartners from families in the low socioeconomic levels, about one and a third points (b= 1.36) and about two points (b=1.94), respectively. Also, full-day kindergartners gained 1.1 more points in reading than half-day kindergartners during the school year, after controlling for other variables in the model. Kindergartners' gains were also related to the amount of elapsed time between ECLS-K assessments and children's initial reading status, after controlling for other characteristics. As anticipated, the elapsed time between assessments was positively related to reading gains. In contrast, children's fall kindergarten reading scores were negatively related to gains made over the kindergarten year. This result indicates that children who entered kindergarten with lower reading achievement levels made greater gains over the kindergarten year in reading than those children who began kindergarten with higher reading achievement. Since none of the children in the ECLS-K obtained a perfect score on either the middle or upper level forms of the assessment battery, a ceiling effect can be discounted.I2 Rock and Pollack (2002) indicate that the complex patterns that can occur with respect to gain scores are not always properly summarized in a single overall measure of gain. This is especially true for adaptive tests such as the ECLS-K Kindergarten First Grade assessment battery. Thus, these authors recommend the use of an alternative measure of overall gain that can take into consideration the amount of gain, as well as where on the scale the gain is occurring, such as the percent of maximum possible gain."}, {"section_title": "Summary", "text": "Reading and writing instruction in kindergarten classrooms include a wide array of instructional activities from learning letter names, decoding words, recognizing words, and reading storybooks to writing stories. In addition, teachers may use basal reading texts and workbooks to teach reading and writing. The sets of instructional activities identified in this paper represent elements of both the phonetics and whole-language orientations. 12See the Early Childhood Longitudinal Study -Kindergarten Class of 1998-99 (ECLS-K), Psychometric Report for Kindergarten and First Grade, Working Paper (NCES 2002-005) for more information. This paper examined the frequency that kindergartners' teachers engaged in various reading instructional activities in their classrooms to provide information on kindergartners' exposure to various sets of reading activities during the school week. The findings in this report showed that the most prevalent reading activities (i.e., those done on a daily basis) in which kindergartners participated were the set of basic decoding skill activities. However, basic decoding skill activities were not the only frequently occurring reading activities in children's kindergarten classrooms. Children also had access to other types of reading activities during the school week, such as writing-, comprehension-, and skills-based activities. These findings clearly showed that kindergartners were exposed to not just one type of reading activity but to a variety of reading activities during the school week. Kindergartners are known to vary greatly in the skills they bring to school. By the end of kindergarten, all kindergartners gained reading skills, albeit different reading skills (West, Denton, and Reaney 2001). Moreover, their reading skills varied by child and family characteristics. The findings in this paper showed that the frequency of exposure to the different sets of reading activities was associated with child, family, and school characteristics. For example, kindergartners from some minority backgrounds engaged more often in skills-based reading activities than White kindergartners. Children who know the relationships of sounds to letters (i.e., proficient at reading proficiency levels, 2 and 3) at the beginning of kindergarten participated more frequently in comprehension-based and writing-based activities during the school week than those just beginning to read (i.e., proficient at level or below). These findings combined with those reported by West, Denton, and Reaney (2001) that White and Asian children had higher levels of reading skills in kindergarten than Black and Hispanic children suggest that the frequency of exposure to certain sets of reading activities may be based on the children's reading skills children with lower levels of reading proficiencies are exposed to more of the fundamentals of reading whereas those with higher-level reading skills are being exposed to more of the comprehension activities. This paper examined the relationships of different reading instructional approaches to the overall reading gains children made in public school kindergarten program classrooms, after controlling for several characteristics of the children and their families, classrooms, and schools. Analysis of the relationship of kindergarten teacher reports of the types of reading activities that occur in their classrooms on a weekly basis and the skills and knowledge kindergartners demonstrated in reading on the ECLS-K assessments shows that children made significant gains in reading during the kindergarten year. Gains in overall reading were related to child, family, and kindergarten program characteristics. On average, kindergartners gained 10 points in reading. This paper found that for .15 each one-point increase in the frequency of children's exposure to basic decoding, skills-based, and comprehension-based activities, their reading gains increased by a fifth to almost one half of a point. The ECLS-K provides a rich database that can be utilized to further study the development of reading in all children. It provides five proficiency level scores in reading (e.g., letter recognition, beginning sounds, etc.). The relationships of these proficiencies with different reading instructional activities could be individually examined for children in both public and private schools to identify the types of reading instructional activities that promote reading gains in specific skill levels. In addition, since some non-school factors (e.g., sex, race/ethnicity) were found to be associated with learning, examination of the interaction of different types of reading instructional activities with other factors such as children's nonlinguistic abilities and orientation (e.g., attention), motivation, and family literacy practices contributing to variability in reading development is warranted. Further study is necessary to investigate the finding that children who began kindergarten with high reading skills made smaller gains during the kindergarten year. It is recommended that an alternative measure, such as the percent of maximum possible gain, be used to take into consideration where the gain is taking place on the reading scale. In addition, further investigation could be conducted using multilevel statistical modeling to examine the relationships of reading instruction with the structural and organizational features of schools.   Child's sex 3.2 (SD = 0.90) 5.6 (SD = 0.53) 4.4 (SD = 1.14) 2.7 (SD = 1.12) 4.4 2.6 *School income level is only available for public schools and is defined by the percent free or reduced luncheligible enrollment or by receipt of schoolwide Title I assistance (if free/reduced lunch-eligible data were missing). NOTE: Frequency scale: 1= never; 2= once a month or less; 3 = 2-3 times a month; 4 = 1-2 times a week; 5= 3-4 times a week; 6=daily. Estimates are based on children who were first-time kindergartners and were assessed in English. SOURCE: U.S. Department of Education, National Center for Education Statistics, Early Childhood Longitudinal Study, Kindergarten Class of 1998-99 (ECLS-K), Fall 1998 and Spring 1999. Table 3. Mean frequency with which public school full-day kindergartners are exposed to various groups of reading instructional activities in their classrooms, by selected child, family and school characteristics: Spring 1999 School income level* Less than 50% low income 0.07 0.03 0.08 0.08 50% or more low-income 0.12 0.06 0.12 0.14 *School income level is only available for public schools and is defined by the percent free or reduced luncheligible enrollment or by receipt of schoolwide Title I assistance (if free/reduced lunch-eligible data were missing). NOTE: Frequency scale: 1= never; 2= once a month or less; 3 = 2-3 times a month; 4 = 1-2 times a week; 5= 3-4 times a week; 6=daily. Estimates are based on children who were first-time kindergartners and were assessed in English. SOURCE: U.S. Department of Education, National Center for Education Statistics, Early Childhood Longitudinal Study, Kindergarten Class of 1998-99 (ECLS-K), Fall 1998 and Spring 1999. Table 3a. Standard errors of the mean frequency with which public school full-day kindergartners are exposed to various groups of reading instructional activities in their classrooms, by selected child, family and school characteristics: Spring 1999 50% or more low-income 0.09 0.02 0.06 0.10 *School income level is only available for public schools and is defined by the percent free or reduced luncheligible enrollment or by receipt of schoolwide Title I assistance (if free/reduced lunch-eligible data were missing). NOTE: Frequency scale: 1= never; 2= once a month or less; 3 = 2-3 times a month; 4 = 1-2 times a week; 5= 3-4 times a week; 6=daily. Estimates are based on children who were first-time kindergartners and were assessed in English. SOURCE: U.S. Department of Education, National Center for Education Statistics, Early Childhood Longitudinal Study, Kindergarten Class of 1998-99 (ECLS-K), Fall 1998 and Spring 1999."}, {"section_title": "21", "text": ""}, {"section_title": "25", "text": ""}]