[{"section_title": "Introduction", "text": "Salt marshes are highly productive ecosystems, providing an array of ecosystem services (Costanza et al. 1997;Gedan et al. 2009;Zedler and Kercher 2005). At a local scale, salt marshes play an important role in food supply, nutrient cycling, contaminant filter, sediment storage, and flood control. At a broader scale, salt marshes help regulate regional climate and provide critical habitat for continental and intercontinental migratory species (Zedler and Kercher 2005). Despite these important benefits, a significant fraction of salt marshes has been lost due to land development, filling and dredging, or damaged by anthropogenic modifications (Gedan et al. 2009). Sea level rise has also a significant impact on the condition and health of coastal salt marshes, especially for those with a limited sediment supply (Morris et al. 2002). Salt marsh halophytic vegetation is composed of communities adapted to survive different submersion periods. As a result, the distribution of plant communities is usually a function of salt marsh elevation relative to sea level (Silvestri et al. 2005;Isacch et al. 2006;Lenssen et al. 1999). In fact, the interactions between flooding regime, local topography, and ecophysiological performance may result in a diversification of vegetation species along inundation gradients (Silvestri et al., 2005;Boutin and Keddy 1993;Isacch et al. 2006). This diversification, at the landscape level, is often represented as belt-shaped vegetation type communities around channels and ponds, where the land is higher. Thus, as sea level rises, these communities might transgress landward toward higher areas or disappear altogether if inland marsh expansion is impossible. As a countermeasure to increasing natural and anthropogenic pressures, acquisition of long-term information on spatial distribution of salt marsh vegetation communities is urgently important, and will help to develop effective strategies for salt marsh management, protection, and restoration (Belluco et al. 2006; Harvey and Hill 2001;Silvestri et al. 2005). Compared to expensive field measurements in areas with low accessibility, remote sensing has outstanding advantages in its synoptic coverage and repeatability. In terms of classification of salt marsh communities or species by a remotely sensed approach, most studies focused on the usage of high spatial or high spectral (hyperspectral) imagery by either reducing spectral mixing effects in smaller pixels or increasing discriminative capability in a highdimensional attributes space (Bachmann et al. 2002;Gilmore et al. 2008;Laba et al. 2008;Timm and McGarigal 2012;Whiteside and Bartolo 2015). The high discrimination capabilities demonstrated through the usage of high resolution spatial and hyperspectral data is in turn balanced by their relatively high cost and low availability, which relegate salt marsh monitoring to small regions and few temporal snapshots. Multispectral imagery at medium spatial resolution is an alternative option for salt marsh monitoring applications. These sensors can cover a wide geographic area, have a high temporal depth of the archive, and are freely available. However, high similarity in the spectral signatures of various vegetation species leads to low accuracies for vegetation classification based on a mono-phase image, even at the community level (Harvey and Hill 2001;Klemas 2013). One example is NOAA Coastal Change Analysis Program (C-CAP), which employs individual Landsat images as primary data and produced classification map for coastal land cover spanning 25 vegetation categories. However, C-CAP regards the whole coastal salt marsh area as a unique class named Estuarine Emergent Wetland (Fig. 1a). Recently, significant spectral Vegetation Indices (VIs) have been derived from field spectral observations at different monthly resolutions (Feilhauer et al. 2013;Fernandes et al. 2013;Gao and Zhang 2006). This raises the possibility of accurate discrimination of salt marsh vegetation communities by means of VIs time-series constructed form multispectral, medium-resolution imagery. Good results have been achieved through time-series spanning 1-3 years with a combination of different VIs (e.g., NDVI, NDAVI, WVI, WAVI) and time scales (e.g., seasonal, monthly in the growing season, monthly in the whole year) (Davranche et al. 2010;Gilmore et al. 2008;Sun et al. 2016;Villa et al. 2015;Wang et al. 2012). Among VIs, the Normalized Difference Vegetation Index (NDVI) is accepted as a stable general indicator of community type, plant biomass, vegetation phenology, and photosynthetic performance of salt marsh vegetation (Kerr and Ostrovsky 2003;Sun et al. 2016). Neither as spectrally powerful as hyperspectral nor as spatially detailed as high-spatial imagery, a multispectral medium-resolution vegetation mapping with NDVI time-series can go beyond the local scale and short time intervals providing long-term earth observations (la Cecilia et al. 2016;Sun et al. 2017). However, the reduced number of useful images should be considered before applications. The difference between total images and viable images becomes large in coastal zones, where salt marsh vegetation communities grow. Here the frequent cloud cover and the fluctuating tidal stage lead to a reduced number of viable images with an uneven and discrete temporal distribution. How to synthesize information from these irregular time series of images is therefore critical for the long-term monitoring of salt marshes. In this study, we explore new approaches to monitor salt marsh vegetation communities with Landsat TM/ETM+ multispectral remote sensing data. Our goal is to determine the evolution of marsh vegetation at the Virginia Coast Reserve (VCR), USA, through a series of classification maps spanning 30 years. Salt marsh vegetation communities are classified with the C5.0 decision tree, which is suitable for salt marsh analysis given its ability to achieve high accuracies with the boosting algorithm. Our specific objectives are: (1) to construct a reference monthly NDVI time-series (MNTS) for vegetation classification and compare its performance with a classification based on mono-phase images from each month; (2) to generate a series of classification maps balancing accuracy with frequency, using a flexible MNTS approach acting on all viable Landsat TM/ETM+ imagery during 1984-2011; (3) based on the classification maps of salt marsh vegetation communities, to explore spatio-temporal variations in salt marsh communities and determine trends in vegetation cover within the salt marshes of VCR."}, {"section_title": "Materials", "text": ""}, {"section_title": "Study area 100", "text": "Our study area is the Virginia Coast Reserve (VCR), a typical barrier-lagoon-marsh system located on the Atlantic side of the Delmarva Peninsula, USA. These lagoons comprise intertidal and subtidal basins located between the barrier islands and the Delmarva Peninsula (Fig. 1a). Tides are semidiurnal, with a mean tidal range of 1.2 m. Mean Higher High Water (MHHW) at Wachapreague channel (NOAA station 8631044, Fig. 1a) is 0.68 m above mean sea level, whereas Mean Lower Low Water (MLLW) is -0.65 m. Marsh vegetation is dominated by Spartina alterniflora (S. alterniflora), with a height ranging between and 100 cm. "}, {"section_title": "Definition of salt marsh vegetation communities", "text": "To define salt marsh vegetation communities, we start from the mapping units proposed by McCaffrey and Dueser (1990) for hydric-halophytic herbaceous vegetation at the VCR. This classification system, derived from the interpretation of 1:20000-scale false color aerial images and field surveys, delineates mapping units based on species composition, growth form, leaf and stem density, tidal influence, and distinct vertical elevation. The classification has been widely accepted with slight modification for salt marshes across the eastern shore of the United States (McCarthy and Halls 2014;Pengra et al. 2007;Timm and McGarigal 2012). However, narrow ecotones and small vegetation patches were undetectable at the medium spatial resolution of Landsat images used in our study. We therefore combined several adjacent mapping units of McCaffrey and Dueser (1990). The final definition of each salt marsh vegetation community used herein is (  "}, {"section_title": "Data set", "text": ""}, {"section_title": "Remote sensing data", "text": "The remote sensing data used in our study include Landsat imagery, NAIP aerial imagery, C-CAP land cover maps, and a Lidar DEM. Landsat5 TM data provided nearly continuous coverage of the earth surface from 1984 to 2011 at a spatial resolution of 30 m. Landsat7 ETM+ SLC-on data (1999)(2000)(2001)(2002)(2003), with similar spectral distribution and same spatial resolution, is an efficient way to enhance the imagery availability. The images from 1984 to 2011 for a Landsat scene centered over the VCR (Path: 014, Row: 034) were acquired from the United States Geological Survey (USGS) Earth Explorer and were used for the construction of monthly NDVI time-series (MNTS). NOAA Coastal Change Analysis Program (C-CAP) maps cover intertidal areas, wetlands, and adjacent uplands. These maps include 25 land use and vegetation classes with the spatial resolution of 30 m and update every five years starting in 1992. In total, 5 C-CAP land cover maps were obtained from NOAA office for coastal management, for the years 1992, 1996, 2001, 2006, and 2010. In the C-CAP classification system, the whole salt marsh area of the VCR was categorized into a unique class labeled Estuarine Emergent Wetland. Thus, the maximum extent of this class from each period was used to delimit the salt marsh region of our study (Fig. 1b). The National Agriculture Imagery Program (NAIP) acquires aerial imagery at a resolution of 1 m for the United States during the agricultural growing season. A total of 6 NAIP county mosaic images were collected from United States Department of Agriculture (USDA) Geospatial Data Gateway for the years 2004, and 2011). These images were used as the reference data for accuracy assessment of classification maps during 2002-2011 by labeling the corresponding salt marsh vegetation community with random points (Fig. 1c), generated with the assistance of ArcGIS software (Foody 2002;Theobald et al. 2007). A LiDAR DEM of the VCR was downloaded from Virginia Coast Reserve Long Term Ecological Research (VITA 2011). The LiDAR DEM with a cell resolution of 3.048 m, was created from LiDAR points (~ 1 m spacing) acquired in March 25-30, 2010. The horizontal and vertical datum are NAD83 and NAVD88, and the vertical accuracy was validated at less than 0.15 m. A water mask file was also attached to control for tidal regime during data collection (Fig. 1d). In our study, a coordinate transformation and a spatial resampling were first applied to the LiDAR DEM to match the datum (WGS84 UTM 18N) and spatial resolution (30 m) of the Landsat images. Then, areas without tidal inundation were used to ascertain the elevation for each salt marsh vegetation community."}, {"section_title": "Field data and training samples", "text": "Data on end-of-year biomass is available for 17 sites marshes at the VCR from 1999 to 2014(Christian and Blum 2014) ( Fig. 1b). For each site, 4 transects were established for each marsh community (defined as creek bank, low marsh, high marsh, and transition). The location was determined with GPS and additional information, such as biomass, plant height, and population density, was also recorded. After extracting the annual invariant plots for low marsh and high marsh and projecting them to image coordinate (WGS84 UTM 18N), training samples of LM and HM were ascertained. Simultaneously, by comparing the Landsat images with the classification map of McCaffrey and Dueser (1976) (Fig. S1), we obtained the texture and color characteristics of ULM and TF. These characteristics were adopted to identify the invariant plots, namely training samples, of ULM and TF by overlaying several images from different decades and seasons. In total, 1391 pixels of training samples (including 331 for TF, 381 for LM, 365 for ULM, and 314 for HM) were employed from 40 invariant plots to build a classifier ( Fig. 1b)."}, {"section_title": "Water level data", "text": "Tidal level data were collected from NOAA Tides and Currents. The verified hourly water level data from the Wachapreague (no. 8631044) and the Kiptopeke (no. 8632200) tide gauge stations were used to determine the water level related to each Landsat image ( Fig. 1a)."}, {"section_title": "Methods", "text": ""}, {"section_title": "Assessment of available Landsat imagery", "text": "In coastal regions, frequent cloudy weather severely blurs the clarity of satellite images and reduces the reliability of classification results. Tidal flooding significantly affects vegetation reflectance, resulting in an underestimation of vegetation indices such as NDVI. Thus, an assessment of viable satellite imagery is the first step to guarantee high quality of time-series construction. We correct each image for cloud cover and tidal inundation using the NASA Landsat Ecosystem Disturbance Adaptive Processing System (LEDAPS) software, which provides a series of Landsat TM/ETM+ products including surface reflectance, CFmask band (mask for clouds and cloud shadows), and LandWater band (distinguishing between land and water). A two-step cloud cover filter strategy is proposed to avoid the cloud cover effect. First, a total of 379 Landsat images, including Landsat 4/5 TM during 1984-2011 and Landsat ETM+ scan off during 1999-( Fig. 3a), were preliminarily filtered, eliminating all scenes with a cloud cover above 40%. Then, we further reduced the dataset to 254 scenes with a blurred percent less than 40%. The blurred percent was defined as: where A(salt marsh) is the area of salt marsh. A(cloud) and A(could shadow) correspond to the area of clouds and cloud shadows falling on the salt marsh region. The clouds and cloud shadows for each image were detected by the CFmask band with the label values of 2 and 4. To reduce the effect of different tidal stages, we determined a tidal height threshold above which the satellite image is less affected by tidal inundation. To ascertain this threshold, the tidal height for 254 candidate images was first calculated by the verified hourly water level data from the Wachapreague tide gauge station (no. 8631044), with linear interpolation to the time of image acquisition. This water data covers the whole study period except for the years 2006 and 2007. To estimate the tidal height during that period, an equivalent Wachapreague tidal height was approximated by a linear interpolation of the tidal height from the Kiptopeke tide gauge station (8632200, Fig. 3b). For each tidal level, the subaerial part of the marsh was separated from the submerged part using the LandWater band with the label value of 0, determining the percent of land for each image. Results show that the percent of land first gradually decreases then rapidly drops for an increasing tidal level. Two discrete linear fittings are thus proposed to determine the critical tidal level threshold above which the marsh is flooded (Fig. 3c). The data were separated in two groups by a prescribed tidal level, and a linear fit applied to each group obtaining two coefficients of determination. By varying the tidal level from 0 to 150 cm with a step of 1 cm, the tidal height threshold was determined as the x-coordinate that maximizes the sum of the coefficient of determinations of the two linear fits. The final threshold was 92.4 cm above MLLW. A total of 160 images had a water level below the threshold and were selected as viable images for our analysis. "}, {"section_title": "Construction of the reference MNTS", "text": "Determination of the monthly sampling rate must consider the tradeoff between the revisit frequency of Landsat and the intra-annual phenological dynamics of salt marsh vegetation. During the period 1999-2003, more images are available from the two satellites (Landsat5 TM and Landsat 7 ETM+ SLC on) and allow the construction of a monthly Landsat time-series with a short time interval. 12 tiles of images acquired in 2001-2002 were selected and their detailed information referred in Table 1. These images were radiometrically corrected to surface reflectance using the LEDAPS software, which applies MODIS atmospheric correction to Landsat TM/ETM+ data based on 6S radiative transfer model. The NDVI of each image was then calculated and combined in an orderly manner to a monthly NDVI times-series. "}, {"section_title": "C5.0 decision tree", "text": "The C5.0 algorithm was used to build a classification decision tree in order to map salt marsh vegetation communities. This algorithm uses the information gain ratio criterion to determine the best attribute and possible threshold to separate different classes (Quinlan 1999). An advanced ensemble classifier method, named boosting, is also integrated into the C5.0 decision tree algorithm (Quinlan et al. 1996). In our study, all the training samples was used to build the C5.0 decision tree, whose accuracy was verified by random validated points labeled with the salt marsh vegetation community category. To set the parameters of the decision tree, NDVI from different months served as attributes and the confidence level and minimum case were set to 0.25 and 15 (almost 1% of training data), respectively. Ten decision trees were built by the boosting algorithm."}, {"section_title": "Construction of flexible MNTS", "text": "Even though the superior performance of MNTS for salt marsh classification has been proven (Sun et al. 2016;Wang et al. 2012), it is still hard to directly apply such method to all viable Landsat images due to their irregular and scattered temporal distribution (Fig. 3a). For example, owing the lack of images from 1984 to 1992, in this period it would take almost 9 years to obtain a classification map using a MNTS based on images from 12 months. The accuracy of this map would be low since vegetation likely changed during such a long time interval. Therefore, we used the NDVI of only few key months rather than the values of 12 months to circumvent the lack of suitable Landsat imagery in some years. A twostep procedure including full subset assessment and iterative selection was proposed to construct the flexible MNTS (Fig. 4a). The whole procedure was automatically implemented in Matlab and R software. Reference subsets assessment. In order to determine the optimal MNTS, the predicted accuracy (the overall accuracy of the subset from the reference MNTS) was assessed for each possible subset of months, Iterative selection. After the predicted accuracies were assigned to all subsets, the average time interval between classification maps as well as the total number of classification maps for the period 1984-2011 can be calculated for a given predicted accuracy with an iterative process (Fig. 4b). We first create an empty collection to store information for each month. We then add the next available image to the collection, skipping images for months already present in the collection. In this way we create a series of subsets with a different number of images from consecutive months. For each subset, we determine the predicted accuracy from the reference MNTS for 2001-2002. For example, if the subset contains images from July, August, and November, we assign to it the accuracy of the 2001-2002 subset with images from July, August, and November. If the predicted accuracy of the subset is greater than the target one, the information (e.g., combination of images, time interval) is recorded. This process is repeated until all possible MNTS are recorded for a given accuracy. Finally, the average time interval between two classification maps is computed as the ratio between the number of years (28, between 1984 and 2011) and the final number of maps. A series of multi-phased classification maps of salt marsh vegetation communities is finally generated based on the information from the flexible MNTS. Fig. 4 Flow chart depicting the method used in our study. (a) General technique procedure; (b) detailed description of the iterative process to determine all flexible MNTS for a given accuracy."}, {"section_title": "Results", "text": ""}, {"section_title": "Comparison between MNTS and mono-phased images", "text": "Tidal flats (TF) are characterized by very low NDVI values in all seasons (see the reference MNTS curve for 2001-2002 in Fig. 5a). In particular, the NDVI values between July and October are significantly lower than those of the other salt marsh vegetation communities, indicating that this is the optimal period for tidal flat identification and separation from salt marsh. The NDVI curves for the three salt marsh vegetation communities (LM, ULM, HM) have a similar trend -the NDVI peaks during the late growing season (from July to September), while the minimum is in winter (from February to March). The NDVI value of the LM is significantly lower in almost every month, facilitating the discrimination of this community. The NDVI value for HM is significantly higher than the others in summer. HM can therefore be identified by NDVI values between June to August. In contrast, the separability of each class using the surface reflectance curve from a mono-phase image during the growing season (July 5, 2002) is not very good (Fig. 5b). In the surface reflectance curve, although large differences can be observed in the bands 4 and 5 for HM, no significant differences are present for the other three classes (TF, LM, and ULM). Based on 1000 random validated points with the real salt marsh classes interpreted on the NAIP of 2004, a confusion matrix was introduced to further quantify the classification results. The overall accuracy of classification maps using a mono-phased image in the period 2001-2002 is on average 0.735; the overall accuracy rises to a maximum of 0.776 in September and falls to a minimum of 0.679 in January (Fig. 6a). The user's and producer's accuracies for each class fluctuate tremendously and always display low values-the user's accuracy for TF from December to February ranges from 0.110 to 0.202 and the producer's accuracy for ULM in January is lower than 0.557 (Fig. 6b, c). In contrast, the overall accuracy of the classification map (Fig. 7) using the reference MNTS reaches 0.898, approximately 0.163 higher than the average accuracy of mono-phased classification maps. Moreover, the user's and producer's accuracies for each class (except for TF) is always above 0.87, higher than the maximum value of any mono-phased image classification. It is noted that the accuracies for TF is still not quite satisfactory even after the significant improvement by the MNTS approach, which seems a contradiction against the observed high separability (Fig. 5a). This is probably associated with the distributed discrepancy between training and validated samples and the commission error from unstable inlets and eroding marshes, where the transition from marsh to tidal flat or vice versa is very fast (details in section 5.1).   "}, {"section_title": "Relationship between predicted accuracy and average time interval between classifications", "text": "Predicted accuracy varied as a function of the number of months and month subsets used for classification mapping (Fig. 8a). In general, the average predicted accuracy rises with the number of months used in the analysis, while the variability in accuracy among subsets having the same number of months decreases. For subsets using a high number of months in the time-series construction, the increment in accuracy is not very large, indicating that an excessive number of months could be inefficient for the purpose of accuracy improvement. For example, the maximum predicted accuracy (0.898) is reached using images from only 10 months (Fig. 8a, b). February and August are relatively important for the identification of salt marsh vegetation communities, since 28 (82.3%) of the 34 subsets with highest accuracy include the NDVI of these two months (Fig. 8b). Fig. 8 (a) Predicted accuracy as a function of the number of months used in the MNTS. Labeled values represent the total number of subsets considered using that number of months; (b) subsets having the three highest accuracies for a given number of months used in the analysis (black squares mean that a particular month was selected for that subset, in parenthesis the number of months). Using a large number of months in the analysis increases the time interval between classification maps, affecting the temporal resolution of the study. To determine the optimal subset, we plot the average time interval between two subsequent maps as well as the number of resulting maps as a function of predicted accuracy (Fig. 9). A significant linear descending relationship (R 2 =0.98) is revealed between the predicted accuracy and the number of maps. A total of 26 classification maps can be obtained for a predicted accuracy of 0.78. In turn, the number of maps sharply decreases to 4 for a predicted accuracy of 0.89. The average time interval between maps increases from 1 year for an accuracy of 0.78 to 7 years for an accuracy of 0.89 with a hyperbolic relationship (R 2 =0.96). In general, the higher is the chosen accuracy, the lower the number of maps and the longer the average time interval between maps are, reducing the effectiveness of the analysis. Based on these results, we choose 8 classification maps separated on average by 3.5 years with a predicted accuracy of 0.86 (Table 2, Fig. S2-S9). To further validate our method, the classification map of 1988 was compared with the map of McCaffrey and Dueser (1976), yielding an accuracy of 0.778. Four classification maps acquired after 2000 were also verified with random validated points labeled with the real salt marsh classes interpreted on NIAP images. It is worth noting that the average overall accuracy for the classification maps was 0.844, lower than the predicted value (Table 2). This discrepancy between predicted and validated accuracy is probably due to changes in image quality for time-series construction (details in section 5.2).   19881984-1988/ 5 19850228_LANDSAT5_TM 19870306_LANDSAT5_TM 19870509_LANDSAT5_TM 19880714_LANDSAT5_TM 19840921_LANDSAT5_TM 19871016_LANDSAT5_TM 19871117_LANDSAT5_TM McCaffrey and Dueser (1976) 0.778 19921989-1992/ 4 19920115_LANDSAT5_TM 19890327_LANDSAT5_TM 19890412_LANDSAT5_TM 19890615_LANDSAT5_TM 19890725_LANDSAT4_TM 19891021_LANDSAT5_TM 19891106_LANDSAT5_TM --19961993-1996/ 4 19960211_LANDSAT5_TM 19950312_LANDSAT5_TM 19930712_LANDSAT5_TM 19950904_LANDSAT5_TM 19951022_LANDSAT5_TM 19961109_LANDSAT5_TM 19931219_LANDSAT5_TM --19991997-1999/ 3 19980421_LANDSAT5_TM 19990705_LANDSAT7_ETM+ 19990806_LANDSAT7_ETM+ 19990923_LANDSAT7_ETM+ 19981030_LANDSAT5_TM 19991118_LANDSAT5_TM 19981201_LANDSAT5_TM --20022000-2002/ 3 20020126_LANDSAT5_TM 20020219_LANDSAT7_ETM+ 20020323_LANDSAT7_ETM+ 20000504_LANDSAT7_ETM+ 20020611_LANDSAT7_ETM+ 20010803_LANDSAT5_TM 20010912_LANDSAT7_ETM+ 20011022_LANDSAT5_TM 20021118_LANDSAT7_ETM+ NAIP 20040.869 20052003/ 3 20050219_LANDSAT5_TM 20030310_LANDSAT7_ETM+ 20040405_LANDSAT5_TM 20050611_LANDSAT5_TM 20040811_LANDSAT5_TM 20051001_LANDSAT5_TM 20031129_LANDSAT5_TM NAIP 20050.838 2007/ 2 20060206_LANDSAT5_TM 20060411_LANDSAT5_TM 20070516_LANDSAT5_TM 20060801_LANDSAT5_TM 20060918_LANDSAT5_TM 20061004_LANDSAT5_TM NAIP 20080.848 2011-2011 NAIP 2011 0.821"}, {"section_title": "Elevation of salt marsh vegetation communities", "text": "The LiDAR DEM of 2010 and classification map of 2011 were overlapped to extract the elevation for each class at a pixel level. The elevation distributions for each class are shown in Fig. 10a. The Tidal Flat class displays a large distribution of elevations because unvegetated overwash fans having high elevation are included in this class. Differences in elevation among classes was demonstrated by one-way ANOVA (ANalysis Of VAriance) with unequal sample sizes (Table 3). The Mean Square of elevation between classes (MS b , 2570.34) is much larger than the Mean Square of elevation within classes (MS w , 0.17). As a ratio between MS b and MS w , the F statistic equals to 15458.14, which is extremely high and renders the p-value almost near to 0 (<0.05). That indicates the average elevation of the four classes is not the same at the confident level over 95%.  To determine whether the average elevations of the vegetation classes were different, the Tukey HSD (Honestly Significant Difference) for post-hoc analysis was further performed (Fig. 10b, Table 4). From all 6 pairwise comparisons, both lower and upper confidence intervals are uniformly negative even for neighboring classes (i.e., TF-LM, LM-ULM, and ULM-HM). Therefore the average elevation of any class is significantly different from the others. Quantitatively, with the confidence level over 95%, the elevation of TF is 0.525 to 0.546 m lower than the elevation of LM, the elevation of LM is 0.268 to 0.281 m lower than the elevation of ULM, and the elevation of ULM is 0.200 to 0.227 m lower than the elevation of HM. Salt marsh vegetation communities are therefore segregated by elevation, and might respond to sea level rise and vertical sediment deposition (details in section 5.3). "}, {"section_title": "Spatial and temporal variations in salt marsh vegetation communities", "text": "The classification map of 2011 indicates that TF, LM, ULM, and HM account for 11.3% (36.4 km 2 ), 62.7% (201.4 km 2 ), 20.1% (64.4 km 2 ), and 5.9% (19.0 km 2 ) of the VCR area, respectively. North of Cedar Island ULM and HM are more common whereas LM dominates the bays south of Cedar Island (Fig. 7a-c). Unvegetated TF areas comprise washover deposits, small tidal creeks, and eroded marsh area ( Fig. 7c-g). Note that here we only consider areas within the NOAA C-CAP class of estuarine emergent marsh, therefore TF represent areas that used to be vegetated at the time of the NOAA classification and eventually became unvegetated because of different processes. By comparing the 8 classification maps (Fig. 11), TF and HM experienced a significant increase in area from 1984 to 2011 (15.1 and 5.0 km 2 respectively), accompanied by a large reduction in ULM (15.5 km 2 ) and a subtle decrease in LM (4.6 km 2 ) ( Fig. 12a). A significant quadratic polynomial relationship can be fitted between year and the cumulative percent of area change (Fig. 12b). The diverse curvatures of the fitting curves suggest two different evolution trajectories: one for TF and HM, whose increment in area mainly took place before 2000, the other for ULM, whose area decreased after 2000. Between 1988 and 2011, only a small part of the area (17.4%) underwent vegetation conversion, and 93.6% of the change involved neighboring salt marsh vegetation communities (i.e., TF to LM, LM to ULM, and ULM to HM, Fig. 12c). The conversion from LM to TF and from ULM to LM and HM are the most sizable. 20.1 km 2 of LM has been replaced by TF, either through erosion of marsh boundaries in the southern part of VCR or through overwash events that buried marsh vegetation in the backbarrier area (Fig. 11b, f). 6.4 km 2 of ULM became HM, mostly in the marshes between Cedar island and the mainland (Fig. 11a); 13.8 km 2 of ULM scattered in the whole area was transformed in LM ( Fig. 11c, e).  1988,1992,1996,1999,2002,2005,2007, and 2011 corresponding to the 6 study sites in Fig.6. Fig. 12 (a "}, {"section_title": "Discussion", "text": ""}, {"section_title": "Classification uncertainty from MNTS", "text": "Unlike mono-phased classification maps, the accuracy of which is based on the ability to discriminate spectral characteristics, the classification based on MNTS relies on the temporal stability of each class during the time interval selected for the classification (Feilhauer et al. 2013). On the premise of high separability for each class, the accuracy will be high if the classes are stable, otherwise the accuracy will be low. From this point of view, clouds and cloud shadows, tidal oscillations, and a sudden transition from one vegetation community to another can give rise to uncertainties in the MNTS classification. Most misclassifications were observed for random validated points falling in ecotones, and were caused by transition from one community to another (ULM to LM, LM to TF, etc.). A 40% threshold for the clouds filter still allows some clouds and cloud shadows in the images, possibly reducing mapping accuracy (Fig. 13b). This notwithstanding, only in few cases a region was covered by clouds for more than one image of the time series, so that information from consecutive images was able to fill the gap through the boosting algorithm of C5.0 decision tree. As an example, the region of  (Fig. 13e). Voted by each tree from the boosting algorithm, the final classification map presents a comprehensive result, which is only partly affected by any individual image of the time series (Fig. 13f). The accuracy of the TF class in these regions was relative low (Fig. 6b, c), particularly when the accuracy assessment was based on the comparison to high resolution imagery. To guarantee precision, the training samples for TF were selected within the relatively stable tidal flats with continuous absence of vegetation. But for the accuracy assessment, several random points fell on the unstable tidal creeks and adjacent zones, explaining the low user's accuracy of TF despite the high separability in the MNTS curve (Fig. 6, Fig. 7). "}, {"section_title": "Discrepancy between predicted and validated accuracy", "text": "To further explore the difference between predicted and validated accuracy, we generated the classification maps during 2004-2011 at different predicted accuracy levels. Their overall accuracy was subsequently validated by random validated points. The average validated accuracy is less than the predicted accuracy (Fig. 14a), and the difference between predicted and validated accuracy is higher when the predicated accuracy is either small (<0.79) or large (>0.86). The classification maps produced with a low predicted accuracy include mono-phased NDVI classifications, resulting in a lower validated accuracy. This is because mono-phased NDVI classification is heavily affected by clouds and shadows, since the missing information in the clouds area cannot be replaced by other images. For a high predicted accuracy, more months are integrated in the time series and the time interval between each classification map is long. For example, when the predicted accuracy is over 0.86, only two classification maps can be acquired for the period 2004-2011, each spanning at least 4 years. During such long periods, changes in vegetation communities at the ecotones cannot be ignored, leading to a difference between classification maps and NAIP images. Consequently, the difference between predicted and validated accuracy becomes larger, despite the increase in predicted accuracy (Fig. 14a). In contrast, all images from the reference MNTS were acquired in only two years (2001)(2002), reducing the error due to vegetation change. This effect is also the cause of the low accuracy (0.778) obtained by comparing the classification map of 1988 and that of McCaffrey and Dueser (1976), taken 13 years apart (Table 2). For a predicted accuracy between 0.79 and 0.86, the difference between the predicted and validated accuracies is quite small, and it is possibly due to the quality of the images: the images from the flexible MNTS of 2002 have fewer clouds and lower tidal levels (Fig. 14b, c). The correlation between predicted and validated accuracy can be well depicted (R 2 =0.96) by a linear function, which differs of a merely 0.0194 from the standard 1:1 line (Fig. 14a). We can thus trade off high accuracy for a short time interval between classification maps, as long as we avoid either small predicted accuracies affected by image quality or large predicted accuracies affected by changes in vegetation surfaces. The advantages of the flexible MNTS increase when two or more remote sensors are used (e.g. TM and ETM+, Fig. 3a). With more satellites entering in operation with spectral distribution and spatial resolution similar to Landsat (e.g., Landsat8 OLI, Sentinel2 MSI, HJ-1 CCD), we can forecast that the increased availability of images for the construction of time-series will reduce the difference between predicted and validated accuracy, paving the way for a more robust application of our method. "}, {"section_title": "Application of multi-phased classification mapping to salt marsh vegetation communities", "text": "Traditional long-term monitoring of salt marsh vegetation has mostly relied on field measurements, which usually require considerable sampling effort and time. These field investigations are rather challenging in vast coastal salt marsh systems like the VCR due to limited field accessibility and complex terrain. In our study, an archive of historical remote sensing images organized into flexible MNTS was proven to capture the evolution of salt marsh vegetation communities. Multi-phased classification maps were generated to detect spatial patterns and temporal variations of salt marsh vegetation communities, which are often difficult to obtain with in situ observations. Commonly, medium spatial resolution remote sensing data like 30-m Landsat TM/ETM+ are too coarse to discriminate different salt marsh species. Only in few cases a time-series strategy similar to the one proposed here was able to classify marsh vegetation down to the species level (Gilmore et al. 2008;Sun et al. 2016). This fine classification was impossible in our study because of the spatial distribution of salt marsh species among various study sites. In the VCR, except for LM, which has an almost uniform cover of S. alterniflora, the communities of ULM and HM have mixed vegetation with patches of different species. Interspersed vegetation severely affects the ability to discriminate species using medium spatial resolution imagery. Even without a classification down at the species level, classification maps of salt marsh vegetation communities provide insight on the response of vegetation to sea level rise, because relative elevation is well represented by salt marsh vegetation (section 4.3). For example, ULM is likely to morph into LM when sea level rise outpaces vertical accretion. Similarly, an eroding LM is transformed in TF. From this point of view, the change map of salt marsh vegetation communities (Fig. 15) not only describes vegetation succession, but also the morphological evolution of the system. Conversion of ULM to HM in the Northern part of VCR ( Fig. 15b-d the upper limit of the salt marsh and the upland forest is well documented in this area (Bachmann et al. 2001;Chambers et al. 1999). Compared to native species, P. australis stabilizes surface sediments, traps suspended sediments, has a large tolerance to varying salinity and moisture regimes, and a higher ability to accumulate organic matter. Large storms, wrack deposits, and winter ice can disturb the native marsh vegetation favoring the expansion of P. australis. A distribution map of P. australis at the VCR indicated that the encroachment of this invasive species partly explains the expansion of HM at the expenses of ULM (Fig. S10, S11). The timing of ULM expansion is also peculiar, with high rates between 1987 and 2000 and reduced rates between 2000 and 2012 ( Fig. 12b), corroborating the hypothesis that sea-level rise, and more generally, global warming, might not be the cause of this conversion. Overall, vegetation communities typical of high elevations are replaced with vegetation communities thriving at low elevation, possibly indicating that sediment accretion is not enough to compensate sea level rise, and that on average the VCR salt marshes are becoming lower. 13.8 km 2 of ULM scattered across the entire VCR were converted to LM, with a conversion rate increasing in the last 20 years (Fig.    11b, c). Marshes bordering open water ( Fig. 14d-g), are also susceptible to storm waves, which trigger lateral erosion (Fagherazzi et al. 2010;Fagherazzi and Wiberg 2009). This erosion resulted in 15.1 km 2 of net conversions of LM to TF. Interestingly, the LM area that was lost and became TF is of the same order of the ULM area that became LM due to sea level rise (Fig. 12a). As a result, the total LM area has not changed much in the last 30 years (Fig. 12b). On the contrary, the extension of ULM dramatically decreased due to conversion to LM (likely due to an increase in sea level) and the expansion of HM (possibly due to invasive species). During 1984-2011, the total area that experienced a transformation toward habitats typical of lower elevations (37.7 km 2 ) is twice as much the area than experienced a conversion toward habitats with higher elevations (18.3 km 2 ), implying a general transgressive trend for the entire VCR system. "}, {"section_title": "Conclusions", "text": "Long-term spatial information on vegetation communities is required to understand the evolution of salt marshes and how they are affected by environmental and anthropogenic drivers. Multispectral, medium-resolution imagery can capture vegetation evolution when an inter-annual time-series strategy is adopted, despite the limited spectral and spatial resolutions. Here we present a flexible monthly NDVI time-series (MNTS) approach based on all viable Landsat data from 1984 to 2011. The method generates multiple classification maps that allows tracking the evolution of vegetation communities in time. The general relationship between overall accuracy and average time interval between classification maps is presented. To our knowledge, this is the first attempt to apply the method to a series of sparse historical images for long-term monitoring purposes. The main conclusions can be summarized as follows: 1MNTS using Landast images are capable to accurately discriminate salt marsh vegetation communities, despite noise form clouds cover and tides. This is evidenced by the high overall accuracy of 0.898, 0.163 higher than the accuracy of a mono-phased image. (2) A significant hyperbolic relationship (R 2 =0.96) exists between accuracy and average length of the time-series used for classification. This relationship allows generating long-term classification maps balancing accuracy versus number of classification maps. (3) The temporal evolution of salt marsh vegetation communities in the Virginia Coast Reserve is discerned from 8 classification maps spanning the period 1984-2011. The area of Upper Low Marsh has diminished of 19.4% (15.5 km 2 ) with a recent accelerated trend (R 2 =0.92). This area was converted either in High Marsh or Low Marsh. On average, communities lower in the tidal frame have become more common (+37.7 km 2 ), with few areas transitioning to communities typical of higher elevations (+18.3 km 2 )."}]