[{"section_title": "Abstract", "text": "This article examines empirically the effect on the variance estimate due to the use of hot deck imputation with a nearest neighbor donor in comparison with the pairwise fractional hot deck imputation methodology in the 1999 Survey of Doctorate Recipients."}, {"section_title": "Introduction", "text": "Imputation is commonly used to deal with nonresponse and incomplete data in surveys. Usually, the use of imputed values as observed values produces appropriate estimates of smooth statistics (totals, means, proportions, etc) as well as non-smooth statistics (quantiles, etc), if the imputation does not cause severe systematic bias. However, the dangers are well known of not correcting the variance estimates to reflect the uncertainty due to missing data. This may lead to larger underestimation as the proportion of imputed values increases when treating the imputed values as observed. Over the years, a number of methods have been suggested in the statistical literature to overcome these issues (Kalton & Kasprzyk, 1986; Brick & Kalton, 1996; Groves et al., 2004) .\nAmong other reasons, imputation techniques typically are not used with survey data because their users are unfamiliar with techniques of analyzing missing data. Due to operational convenience, most of the commonly Adriana Pérez is an Associate Professor of Biostatistics in the School of Public Health. Email: adriana.perez@uth.tmc.edu. used statistical packages do not incorporate adjustments for missing data into their analysis. For simplicity, often an entire observation with one missing variable response is eliminated.\nFollowing Shao and Steel's (1999) description, two general perspectives exist to obtain variance estimators for large complex sample surveys after imputation: design-based and model-assisted perspective (including multiple imputation). Paraphrasing their definitions: the variance estimate in a designbased perspective accounts for repeated sampling from a fixed finite population and uniform nonresponse within an imputation cell.\nUsing the model-assisted perspective, the variance estimate is with respect to the sample design and response as well as to the model used for the imputation method (Särndal, Swensson, & Wretman, 1992; . Variance estimators under a multiple imputation perspective (Rubin, 1987) , are reasonable using Bayesian inference but are not applicable for design-based or deterministic imputation methods (Shao, 2002) . The model-assisted perspective variance estimation methods will not be discussed any further.\nSeveral variance estimation methods exist under the design-based perspective after imputation. Two examples are linearization methods (i.e., Taylor series expansions (Chen & Shao, 1997; Chen & Shao, 2000; Kim, 2001)) and replication methods (i.e., Jackknife (Rao & Shao, 1992) , bootstrap (Shao & Sitter, 1996) and balanced half samples (Lee, Rancourt, & Särndal, 1995; Rao & Shao, 1996; Shao, Chen, & Chen, 1998; Shao & Chen, 1999; Kim, 2001; . Lee, Rancourt and Särndal (2002) discussed the differences between these approaches. All these methods provide adequate estimates. The choice depends on the users, the need for the estimation of variance components, the computational burden, the adaptability of the sampling fraction and the response mechanism (Lee et al., 2002) .\nThis article is focused on the effect on the variance estimates in the 1999 Survey of Doctorate Recipients (SDR) (National Science Foundation, Directorate for Social, & Division of Science Resources Statistics, 2002). In the next section, the 1999 SDR survey methods will be discussed. Next, a description of the aspects of nearest neighbor hot deck imputation method, fractional imputation, successive difference replication method and the effect of multiple weighting stages will be provided. All these methods are used here to evaluate the variance estimates of this survey. This study extends the proposal of pairwise fraction imputation by Kim and Fuller (1999) on the use of variance estimation with pairwise fractional hot deck imputation and the successive difference replication method."}, {"section_title": "The 1999 Survey of Doctoral Recipients (SDR)", "text": "The 1999 SDR is a National Science Foundation (NSF) survey conducted by the U.S. Census Bureau (National Science Foundation et al., 2002 (National Science Foundation et al., 2002) .\nThe 1999 SDR survey sample size was 40,000. The sample was systematically selected from three groups using the probability proportional to size selection methodology. The three groups were the new cohort (doctoral recipients between July 1996 and June 1998), the nearly new cohort (doctoral recipients between July 1992 and June 1996) and the old cohort (doctoral recipients prior to July 1992) (National Science Foundation et al., 2002) .\nThe sampling strata consisted of 240 strata for the old and nearly new cohorts and were defined by demographic group, degree field and sex. The same 240 strata (six of which were empty) defined the sampling strata for the new cohort (US Bureau of the Census et al., 2003a) .\nItem non-response was observed in this survey in all variables except seven. All seven were critical variables and had to be filled in order for the response to be considered complete. Hence, two imputation methods were used: logical imputation and hot deck imputation. Logical imputation was used when the answer to a question could be determined by the answer to another question either within the same survey year or from a prior survey round (US Bureau of the Census, Demographic Statistical Methods Division, & Health Surveys and Supplements Branch, 2001a) . Logical imputation will not be addressed further in this article.\nHot deck imputation was implemented using a nearest neighbor donor. The auxiliary variables selected to identify the pool of donors were determined by prediction models for each variable in the survey with item nonresponse. A serpentine sorting on the auxiliary variables was implemented to determine the nearest neighbor donor response (US Bureau of the Census et al., 2001a) . This survey allowed for the use of information from any one donor a maximum of four times. The missing mechanism and the tentative reasons for missing values in this survey is likely missing at random (Perez, 2003) .\nBase weights of the 1999 SDR data were computed by the U.S. Census Bureau (US Bureau of the Census, Demographic Statistical Methods Division, & Health Surveys and Supplements Branch, 2001b) . To obtain the final weights, the base weights underwent several adjustments to correct for duplicates, frame ineligibles, never earned doctorate case and control totals. Included in these weighting adjustments were a non-interview adjustment and a ratio adjustment via a raking methodology ( "}, {"section_title": "Methodology Nearest Neighbor Hot Deck Imputation", "text": "Hot deck imputation refers to the process where missing responses or items are replaced by values selected from respondents within the same survey.\nThe respondent selected as a donor is chosen by using observable values from auxiliary variables. The 1999 SDR survey used the hot deck imputation method based on imputation cells (US Bureau of the Census et al., 2001a) . This means that in using auxiliary variables known for respondents and nonrespondents, the sample was divided into cells. Sorting was performed within each imputation cell and a neighboring case was selected as a donor for each missing value. Then, the missing value was replaced by the selected value within that cell (Chen et al., 2000) ."}, {"section_title": "Fractional imputation", "text": "Fractional imputation identifies the method where each missing response or item is replaced by several imputed values drawn from the responding values in an imputation cell (Fay, 1996; Kim et al., 1999) . Fractional imputation provides an adjustment method for variance estimation in design-based estimators in the presence of missing values (da Silva & Opsomer, 2002) .\nFractional imputation estimators were designed to reduce the imputation variance by using more than one donor for a recipient and increasing the weight of the donor for each missing item by a value equal to a fraction of the original weight of the missing observation. Respondents who are not donors retain their original weights. Pairwise fractional hot deck imputation is a special case of fractional imputation where two distinct donors are selected for each missing item. The assumption for this method is that there are at least two donors in each imputation cell (Kim et al., 1999) ."}, {"section_title": "The Successive Difference Replication Method", "text": "The current approach in calculating the 1999 SDR variance estimates is the successive difference replication method (SDRM). Wolter (1984) developed the basic theory of the successive difference method and later Fay and Train (Fay & Train, 1995) extended this theory with replicates generating the SDRM. The variance estimator is calculated based on the squared differences between neighboring sample cases. The SDRM produces variance estimates with a greater number of degrees of freedom than other replication methods. To create the replicates, the SDRM variance estimator uses an orthogonal Hadamard matrix. Because the 1999 SDR used 160 replicates, a 160x160 Hadamard matrix was formed."}, {"section_title": "Notation", "text": "Paraphrasing, Kim and Fuller's (2004) notation: let P be a finite population containing indices 1, …, N . P is stratified into H strata with h N units in the h -th stratum. The SDRM variance estimator for θˆ can be defined without loss of generality as (ignoring the finite population correction factor) in equation (1):\nwhere r is the replicate sample ( r =1,…, k ). k is the total number of replicate samples, In the imputation procedure, let ij a be the number of times that i y is used as a donor for the missing j y . R S is the set of indices of the sample respondents and M S is the set of indices of the sample nonrespondents. Let us define\n, then the distribution of a is called the imputation mechanism. In addition, when i y is used as a donor for element j, let\n• ij w be the fraction of the original weight for element j.\n• ij w is called the imputation fraction (Fuller & Kim, 2001; . . The ij a are nonnegative and the sum of the imputation fractions of the donors for a missing item is mandatory to be one:\n. In the case of a pairwise fractional hot deck imputation, the imputation fractions,\n• ij w , are equal to 0.5. A linear estimator using fractional hot deck imputation can be written as in equation (2):\nThe term in parenthesis equation (2) is called the imputation adjustment weight. Kim and Fuller(1999) \nθˆ is unbiased and consistent under an ignorable response mechanism. These authors also estimated the variance of this fractional hot deck imputation in terms of the imputation cells."}, {"section_title": "Variance Estimation After Pairwise Fractional Hot Deck Imputation", "text": "Extending the idea of variance estimation after imputation (Kim, 2002; Kim et al., 1999) , if the imputed values from the pairwise fractional hot deck imputation are treated as true values and apply the successive difference replication method then the variance estimator can be expressed as in equation (3): • ij w are the imputation mechanism and imputation fraction, respectively, they will take on the same value across all replicates. This is to ensure the correct calculation of the imputation adjustment weight."}, {"section_title": "Effect of Multiple Weighting Stages On Variance Estimation After Imputation", "text": "Frequently, multiple stages of weighting adjustments are implemented in survey (Valliant, 2004) . The main aim of the weighting plan is to produce final weights that reduce the nonresponse bias in the survey estimates, balance for noncoverage, and adjust sample estimates to control totals. Each stage introduces a different source of variability in an estimator that may perhaps be important to reflect when estimating variances. The advantage of variance estimation through replication is that it can explicitly account for all the stages in estimation by repeating each adjustment separately for each replicate. This concept will be evaluated in this study."}, {"section_title": "Methods Implemented On 1999 SDR Data", "text": "As mentioned previously, this research focuses on variance estimation after imputation of the 1999 SDR. The pairwise fractional hot deck imputation procedure was evaluated and compared to the variance estimates with the ones obtained when treating the imputed values as observed. Five variables were selected: Race, Hispanic, Gender, Citizenship, and Median Basic Annual Salary of the doctoral scientist and engineers. The Woodruff (1952) method was used for calculating the median and its corresponding standard error was estimating using the program described by Gossett et al (2002) . Employment status is a variable without missing data that was used in forming estimates for this study. Separate replicates were computed for each variable of interest as the response mechanism differs for each one. Employment, in combination with the aforementioned variables, was used to calculate 19 survey estimates.\nAfter identifying two donors per missing value for each of the variables selected, the imputation adjustment weight was calculated. However, this imputation adjustment weight can be calculated at three stages of the weighting adjustment process: using the base weights, using the weights after the noninterview adjustment or using the final weights (US Bureau of the Census et al., 2001b) . It was decided that all three stages should be explored and the corresponding replicates needed for the SDRM under all three weighting stages were calculated for evaluation purposes. The three weighting stages being evaluated are discussed in Methods B, C and D below. Method A is the nearest neighbor hot deck imputation used in the 1999 SDR, and did not include an imputation weighting adjustment.\n• Method A: The original sampling weights based on the one donor hot deck imputation methodology were used and the imputed values were treated as observed values. The imputation weight adjustment was not used in this method.\n• Method B: The base weights were used to obtain the imputation adjustment weights. The imputation adjusted weights were then adjusted to include the non-interview and raking adjustments.\n• Method C: The base weights were used to obtain the non-interview adjusted weights. The non-interview adjusted weights were then used to determine the imputation adjustment weights. Finally, the raking adjustments were the final weighting step in the weighting process for this method.\n• Method D: After applying the noninterview and raking adjustments to the base weights to create the final weights, the final weights were then used to obtain the imputation adjustment weight.\nThis empirical evaluation will allow for a determination of the stage of the weighting process at which the imputation weighting adjustment should be performed. In addition, it will allow for an evaluation of the impact of using a single hot deck imputation versus a pairwise fractional hot deck imputation.\nAfter the replicates were computed, the point estimates and their corresponding standard errors were obtained. Statistics combining employment status with variables with missing values used the imputation adjustment weight for the variable with missing values. As an example, when the employed male estimate was formed, the imputation adjustment weight reflected the adjustments due to the gender variable being imputed.\nThe standard errors ( SE ) which do not take the imputation adjustment into account (Method A) were compared with the standard errors which take into account the imputation adjustment (Methods B, C and D). To assess this comparison, the relative difference (RD) was used. For example, when comparing method B versus method A the RD is in equation (4):\nThe RD measures the magnitude of over or under estimation of the alternative method B compared with the current baseline method A. It is important to highlight that all SE are estimates of standard errors instead of true standard errors and furthermore all are subject to sampling errors."}, {"section_title": "Results", "text": "The imputation rates in the 1999 SDR are relatively low and are provided in table 1. Table  1 presents the point estimates for the 19 estimates selected on the doctoral scientists and engineers for methods A through D. As expected due to the low imputation rates, the point estimates did not vary significantly with either method across all the statistics selected. Table 2 presents the variance estimates with methods A through D; and includes the relative variances comparing each method B, C and D to method A. The results in table 2 suggest that (i) the variance estimator is lower when the pairwise fractional imputation methods is used and (ii) there is no preference on the weighting stage of the adjustments, except for the median of the basic annual salary where a 17% reduction on its variance is obtained using method D."}, {"section_title": "Conclusion", "text": "The purpose of this article was to perform the pairwise fractional hot deck imputation to evaluate the effect on the variance estimates due to the imputation procedure. The use of this method shows a lower variance in comparison to the single hot deck imputation method which treated the imputed values as observed values. This is achieved in most of the variables of interest. Exceptions are Naturalized U.S. citizen and employed Naturalized U.S. citizen. For these exceptions, the relative difference is slight at most (1.1%) when compared with the hot deck imputation method.\nNevertheless, the effort involved may argue that the need of having an imputation adjustment weight for each variable may not have been necessary in this particular survey with its low imputation rates. Interestingly, this empirical evaluation confirms the disadvantage pointed out by Kim (2002) that its computation can be cumbersome for a large dataset such as the 1999 SDR.\nThere are limitations to the empirical evaluation. i) The dataset does not have a serious missing data problem which does not allow us to determine clearly which method should be preferred under what conditions. ii) Separate replicates were computed for each variable of interest, assuming an independent univariate missingness pattern. Neither the nearest neighbor hot deck nor the pairwise fractional hot deck imputation methods allows incorporation of multivariate missingness variables to estimate their replicates. iii) The true variance of the SDR data is unknown; for that reason this empiric investigation does not quantify the true relative efficiency.\nFurther investigation is needed on how to obtain an imputation adjustment weight for the entire survey, as well as how to use/obtain imputation adjustment weights for statistics where more than one variable with missing data are required. Monte Carlo simulations identifying the true variance for a pseudo SDR population as well as incorporating several patterns and missing data mechanisms beyond missing completely at random need to be explored. Table 1 . Doctoral scientist and engineers in 1999: Point estimates using four methods. Method A: hot deck imputation using one donor and treating the imputed values as observed values. Method B: pairwise fractional hot deck imputation using the base weight to obtain the imputation adjustment weight. Method C: pairwise fractional hot deck imputation using the noninterview weight to obtain the imputation adjustment weight. Method D: pairwise fractional hot deck imputation using the final weight to obtain the imputation adjustment weight. "}, {"section_title": "Point Estimates", "text": ""}]