[{"section_title": "", "text": "APPENDIX C -Resilience of the Homeless Residents of the Alabama, Louisiana, and Mississippi Gulf Coast Survey: Personnel ........................................................................ REFERENCES ............................................................................................................... Table 1 Number of Hazard Events by Type ....................................................................... Table 4 Data Collection and Sources ................................................................................ Table 5 Survey Coding ..................................................................................................... Physical Capital .............................................................................................................. xi                  "}, {"section_title": "ix LIST OF TABLES", "text": ""}, {"section_title": "LIST OF ILLUSTRATIONS", "text": ""}, {"section_title": "CHAPTER I -INTRODUCTION", "text": ""}, {"section_title": "Overview", "text": "This chapter discusses the hazard trends and their impacts on the Gulf Coast region. A discussion of resilience efforts that are underway since Hurricane Katrina (2005) in collaboration with local community agencies, such as the Gulf of Mexico Alliance, to prepare for and mitigate future hazard impacts is also presented here. Finally, the issue of resilience of the homeless populations residing in the coastal counties of three Gulf Coast states, i.e. Alabama, Mississippi and Louisiana, is discussed to justify the need for this study, which is followed by the research questions and objectives of this study.\nA significant amount of research has examined hazard vulnerability and resilience, but very few of this research have in fact focused on homeless populations. Because the majority of the world's population lives within close proximity to oceans, it can be assumed that most of the homeless population lives in densely populated coastal communities as well. The Gulf Coast region is susceptible to and has been heavily affected by disasters, such as tropical cyclones and tornadoes, and these will likely increase in frequency and severity due to climate change. Although Gulf Coast communities recognize the hazards they face, they very often prioritize economic development opportunities over mitigation activities (Smith and Deyle 1998). Local administrations have formulated little or no policy regarding the evacuation and safety of the homeless population. This chapter provides a definition of homelessness in context of this study, which is followed by a comprehensive review of the concept of vulnerability and resilience. A discussion of social and physical capital that influences the resilience of a community is also presented, following which a summary of the literature is presented to justify the need for this study.\nA mixed methods approach using primary data collected by questionnaire survey and secondary spatial data sets was used to answer the research questions. In the following sections, an introduction to the study site where this research was undertaken, and a discussion of the data sets used, their sources, and the data processing steps are presented. Finally, the spatial and statistical analyses that were implemented to answer the questions discussed.\nChapter Five summarizes the availability of social and physical capital to homeless populations and their social and physical networks. This chapter also discusses the significant variables that determine the resilience of homeless individuals to help with policy preparation to provide some of these capital to increase resilience of these individuals. Finally, a discussion of the implication of this study's findings along with future directions for this research is presented."}, {"section_title": "Hazard Trends in the Gulf Coast Region and Their Potential Impacts", "text": "Whether natural or anthropogenic, hazards are an inherent part of human society. In particular, hydro-meteorological hazards are responsible for significant societal impacts (Kar 2014). The National Climate Assessment report (2014) has indicated that the United States will likely experience an increase in flooding and tropical cyclones due to climate change. The Gulf Coast is expected to experience more adverse impacts from tropical cyclones than any other region in the United States (Emanuel 2005;Subcommittee on Disaster Reduction 2005;Webster et al., 2005;Donnelly and Woodruff 2007). In fact, the ten costliest hurricanes that were presidentially declared disasters between 2004 and 2010 made landfall in this region and caused billions of dollars of damage (NOAA 2011). Since 1956, 9,088 disasters (Table 1) have been declared in the Gulf Coast States: Alabama (1,207), Florida (1,440), Louisiana (1,366), Mississippi (1,274), and Texas (3,801).  The oil and gas industry in the Gulf Coast region is highly developed and produces almost 52 percent of the oil and gas of the entire United States (NOAA 2011). Approximately 50 percent of leased acreage for oil and gas production in this region is located in deep water (below 1000 feet). This makes oil production susceptible to tropical cyclones, as was seen during hurricanes Ivan and Katrina when a number of platforms were destroyed, leading to reduced production and widespread economic impacts among coastal communities (NOAA 2011). Episodic events, such as the failure of Deepwater Horizon and other oil rigs have also been seen to impact the economic and environmental systems of the Gulf Coast region (Colten et al., 2012). While natural and anthropogenic hazards are not new to the Gulf Coast, the resilience of its residents is of concern, specifically, that of the homeless populations who are paid little attention by emergency management agencies and are not accounted for in disaster mitigation policies."}, {"section_title": "Resilience Efforts along the Gulf Coast", "text": "Although there are many groups focusing on increasing the resilience of the Gulf Coast, the Gulf of Mexico Alliance (GOMA) is a frontrunner. GOMA (Cutter, et al. 2008). CARRI, originally created at Oak Ridge National Laboratory, identifies a list of improvements needed to make a community more resilient to disasters (Gulf of Mexico Alliance 2016). CARRI is currently headquartered in Gulfport, Memphis, and Charleston, and is to be initiated in several other Gulf Coast communities. This process has already been started in Gulfport, Mississippi and New Orleans, Louisiana (Gulf of Mexico Alliance 2016)."}, {"section_title": "The Problem", "text": "An extensive amount of research has been conducted on hazard vulnerability and resilience, but little of it has focused on people experiencing homelessness. The Gulf Coast region, because of its location, is susceptible to both natural and anthropogenic hazards (e.g. tropical storms, oil spill, tornadoes) (Carter et al., 2014). With climate change, the Gulf Coast is at a higher risk of experiencing an increased number of disasters in the future, especially hydro-meteorological events (Moser, et al. 2014). Unfortunately, local governments have almost no policy regarding the evacuation and safety of homeless residents (i.e., literal and chronic sheltered and unsheltered homeless). The majority of counties and parishes in the study area has no policy, but inform those that are at-risk to make alternate arrangements for evacuation (Jackson County Public the most innovative in the study area, and uses a system called \"Evacuspots,\" that has pickup locations spread throughout the parish, as well as a home pickup service if individuals cannot move to the designated pickup locations (City of New Orleans Health Department 2016, Evacuspots 2015). This is important because the homeless are particularly vulnerable due to their lack of access to technical resources (i.e., televisions, radios, cell phones, landline telephones, and computers), which also limits their access to alerts and warnings and other information about disasters."}, {"section_title": "Research Questions", "text": "The purpose of this study is to determine the resilience of the homeless populations residing in Mobile County, Alabama; Jefferson and Orleans Parish, Louisiana; and Harrison and Jackson County, Mississippi, to disasters based on their social and physical capital. The following research questions were examined in this study to assess resilience of homeless populations: (i) What is the social capital (e.g., immediate family, extended family, friends, acquaintances, and other relationships that will provide assistance during a disaster) of homeless individuals and how does it contribute to their resilience to disasters? and (ii) What is the physical capital (e.g., access to disaster information, financial capital to evacuate, automobiles, and technology) of homeless individuals and to what extent it contributes to their resilience to disasters? The 6 social and physical capital criteria were combined together using Multi-Criteria Evaluation technique (MCEdiscussed in the methodology chapter) to determine final resilience index for each study county that is home to homeless populations."}, {"section_title": "CHAPTER II -REVIEW OF RELATED LITERATURE", "text": ""}, {"section_title": "Homelessness", "text": "Defining who is \"homeless\" is essential to this study. This includes \"literal homelessness,\" meaning an individual is temporarily homeless, and \"chronic homelessness,\" meaning the person has been homeless repeatedly or for long periods of time (Jencks 1995;Virginia Commonwealth University 2015). Also, relevant are the subcategories of homelessness, which include: \"sheltered and unsheltered homeless\" and emergency or transitional housing (Jencks 1995;Virginia Commonwealth University 2015). Emergency and transitional shelters are places where the homeless population can reside overnight (United States Census Bureau 2012). Unsheltered homeless refers to the people living on the streets or other places that are unsafe and uninhabitable for human residence (Jencks 1995; Virginia Commonwealth University 2015)."}, {"section_title": "Disaster Resilience and Vulnerability", "text": "Although a great deal of research has been undertaken to determine the vulnerability and resilience of communities to disasters, most studies have failed to incorporate homeless populations. Likewise, very little research has focused on examining the vulnerability and resilience of the homeless populations with specific regard to disasters. It is apparent from what research exists, however, that social capital and physical accessibility are essential to determining the resilience of homeless communities to disasters (Ahern et al., 2002;Borgatti, Everett and Johnson 2013;Colussi 1998;Cutter, et al. 2008;Davis 2004;Foster n.d.;Heijmans 2004;Johnson and Griffith 2010;Kawachi et al. 1997;Lin 2001;Nowell, et al. 2013;Peacock, et al. 2010;Portes 1998;Putnam 2000;Stablein 2011;Varda et al., 2009;Wisner, Blaikie, et al. 2007;Yuko et al., 2004). Before assessing the disaster resilience of homeless populations on the Gulf Coast, it is important to understand what vulnerability and resilience mean in the context of this research. Vulnerability is a dynamic condition and a multi-disciplinary concept. However, in the social science disciplines, vulnerability is considered to be impacted by socioeconomic and environmental factors of a community, and changes with time, location and among social groups (Cutter 1996;Cutter et al. 2000;UN 2004). Also, a number of definitions exist for vulnerability within the social science literature. In this study, vulnerability is defined as \"the potential and degree of susceptibility of an individual group or community to experience adverse impacts of hazards due to social-cultural, physical, economic, and environmental conditions,\" while disaster resilience is defined as the ability of a community to return to pre-disaster condition depending upon its socioeconomic, cultural, and physical variables (Burton et al. 1993;Blaikie et al. 1994;Cannon 1994;Kasperson et al. 1995;Cutter 1996;Mileti 1999;McCubin 2001;Rose 2004). This definition of vulnerability argues that disasters do not just happen, but are the outcomes of a variety of different factors (Oliver-Smith 1994). This definition also argues that not all people are affected equally during a disaster (Allen 1994), because vulnerability and resilience of culturally, ethnically, and economically diverse populations differ during a disaster depending upon their social and physical capital. A number of models and indices have been developed to determine vulnerability and resilience of communities with regard to hazards (Colussi 1998;Cutter, et al. 2008;Foster n.d.;Peacock, et al. 2010;Wisner, Blaikie, et al. 2007). For instance, the Resilience Capacity Index (RCI) model uses the following twelve, equally-weighted variables: income equality, economic diversification, regional affordability, business environment, educational attainment, population without disability, population out of poverty, population with health insurance, civic infrastructure, metropolitan stability, homeownership, and voter participation (Foster n.d.). The Pressure and Release Model is one of the main models used to represent vulnerability as a function of risk and hazard such that risk is considered to be a product of vulnerability and hazard (Risk = Vulnerability x Hazard) (Wisner, Blaikie, et al. 2007). However, this model is considered to be too simplistic. The Access Model developed by Wisner, Blaikie, et al. (2007), not only expands the Pressure and Release Model, but also attempts to measure risk at the household and individual level. The Access Model includes more detailed socioeconomic information, a temporal component (time of year, length of hazardous event, length of event build-up), and helps determine which populations are vulnerable, predicts potential outcomes of a hazard event, analyzes policy implications, and determines how to cope with a disaster (Wisner, Blaikie, et al. 2007). The newest vulnerability framework is the RAND framework, created by the RAND Corporation, which is used to assess risk associated with terrorism: Risk = Threat * Vulnerability * Consequence (Center for Technology and National Security Policy 2010). According to this framework, threat is defined as \"the probability that a specific target is attacked in a specific way during a specific time period,\" vulnerability is defined as \"the probability that damage occurs given a specific attack type, at a specific time, on a given target,\" and consequence is defined as \"the expected magnitude of damage given that a specific attack type, at a specific time, on a given target, results in damage\" (Center for Technology and National Security Policy 2010). Like vulnerability, resilience is a multi-disciplinary concept with a variety of definitions (Holling 1973;Hamel and Välikangas 2003). Resilience as a concept is inversely related to vulnerability and is dynamic in nature. In social science research, resilience is considered to be a result of internal and external stimuli, and of private and public policy decisions (Mileti 1999;Rose 2004), and a product of socio-economic, cultural, and political variables (Tinch 1998;Mileti 1999;Rose 2004 (Peacock, et al. 2010). Cutter et al. (2010) conducted a study in which 36 variables were derived from publicly available data and from a number of resilience studies. These indices despite their success fail to monitor the resilience of homeless populations. From the studies conducted on resilience, it is evident that community resilience is dependent on both social and physical capital, which was determined in this study to assess resilience of the homeless populations."}, {"section_title": "Social Capital and Networks", "text": "Social capital refers to one's voluntary inclusion in social groups and individual relationships that are trustworthy and are mutually beneficial, and in this case, the benefits (i.e., shelter, money, food, clothing, and transportation) of being in a group during a disaster (Davis 2004;Heijmans 2004;Kawachi et al. 1997;Lin 2001;Portes 1998;Putnam 2000;Yuko et al., 2004). Social networks are relationships among people that describe and form a social system (Borgatti, Everett and Johnson 2013). Ahearn et al., (2002), in their study of the effects of the 2002 Sniper Attacks in Washington D.C., discovered that the homeless community had become more \"fearful, sad, and angry,\" and adjusted their behaviors to become more cautious, just as those that were not homeless. This study revealed that communities with strong emotional and social networks, whether they are homeless or not, are more likely to be healthier and less likely to suffer depression after a disaster than others (Ahern et al., 2002). Stablein (2011) in his study of social capital of homeless youth discovered that the homeless are much more likely to go to their peers for support as opposed to institutional or community support, such as shelters and soup kitchens. Varda et al., (2009) researched the effects of social networks during Hurricanes Andrew and Katrina using variables, such as socioeconomic status, employment, disabilities, age, housing status, and the quality and availability of transportation. They found that those with extensive personal and group networks are much more likely to adjust and recover after a disaster event. Kawachi et al., (1997) found that populations belonging to lower income groups do not invest as much as those with a higher income into their social networks, which ultimately leads to a higher mortality rate. In addition, those with higher social capital recover more quickly (Kawachi et al. 1997). Despite availability of social capital, this research indicates that the homeless population is much less likely to be as resilient as the rest of the population. "}, {"section_title": "Physical Capital and Road Networks", "text": "Physical capital refers to a person's wealth of or access to assets (Colussi 1998;Cutter, et al. 2008;Foster n.d.;Peacock, et al. 2010;Wisner, Blaikie, et al. 2007). In terms of resilience, physical capital refers to built infrastructures (e.g., residential, commercial and industrial buildings; lifelines-power lines, sewer systems, water, telecommunication, and transportation; and critical facilities-hospitals, schools, fire stations, police stations), and items (i.e., health coverage, finances, access to cellular/smart phones, television, weather radio, and transportation) that influence resilience of an individual and his/her ability to mitigate disaster impacts (Colussi 1998;Cutter, et al. 2008;Foster n.d.;Peacock, et al. 2010;Wisner, Blaikie, et al. 2007). From the perspective of mitigation actions, a major component of physical capital is to conduct proximity analysis to determine the closest facilities that can be used for shelter and evacuation, and also the assessment of space availability to provide shelter. Like gravity model, road network analysis is used to determine the best path to travel from one location to another, to define service areas, to find the closest facility to a location, and to show where additional facilities can be located in order to better serve a population, depending upon the impedance being used (e.g., time and distance) (ESRI 2013 Given the lack of policies and programs in place for the homeless population along the Gulf Coast counties to help that are susceptible to both natural and anthropogenic hazards, in this study an attempt was made to identify factors that impact social and physical capital of the homeless populations, and to determine resilience of the homeless populations to future coastal hazard events. While census data and primary data collected via survey were used to assess social capital and social network through Gravity Model, location/allocation modeling and closest facility modeling were implemented to determine homeless populations' access to built infrastructures, which subsequently impacts their physical capital."}, {"section_title": "18", "text": "CHAPTER III -METHODOLOGY"}, {"section_title": "Study Site", "text": "The Gulf Coast region is highly prone to both natural and anthropogenic hazards (e.g., tropical storms, oil spills, tornadoes, etc.) (Carter et al., 2014 For this study, the counties/parishes identified above were selected because these counties/parishes have the highest poverty rate in the state, and homeless shelters from these counties/parishes with easy accessibility to social services were sampled. Because permission is required to visit homeless shelters in order to protect clients of the shelters and meet the confidentiality policy requirements, those homeless shelters in the study counties for which permission was obtained from the shelter's managerial staff were surveyed to collect primary data. Surveys were obtained from seven shelters: Seashore Mission in Biloxi (11 surveys), Salvation Army-New Orleans (10 surveys "}, {"section_title": "21", "text": "Although many people moved away from the Gulf Coast after Hurricane Katrina, the population has steadily been begun increasing since 2010. Within the study area, the most rapid growth is occurring in Orleans Parish (Table 2), are area known for its devastation following Hurricane Katrina.  "}, {"section_title": "Data Collection", "text": "Both primary and secondary data from a variety of sources representing different information were collected for this research (Table 4). Administrative county boundaries and associated demographic data (population, gender, race, poverty, and employment statistics) were collected from the U.S. Census Bureau and Bureau of Labor Statistics. Road network data was obtained from TIGER Road files-U.S. Census Bureau, which was used for road network analysis, geocoding, and location/allocation modeling. Church, hospital, and school data were obtained from the United States Geological Survey's Geographic Names Project, which were also used for network analysis and location/allocation modeling to identify potential locations that the homeless population can use for shelter and aid during disasters and emergencies. Land use/cover information was collected from the National Oceanic and Finally, a list of homeless shelters (eight shelters in Alabama, twenty-six shelters in Louisiana, and twelve shelters in Mississippi), their addresses and contact information of managerial staff within the study counties/parishes was obtained from the Homeless Shelter Directory. From this list, a sub-set of shelters was selected based on a number of criteria: (1) a previously established relationship with the shelter's managerial staff, 2the type of shelter (e.g., females only, males only, families only, addiction rehabilitation), (3) the capacity of each shelter (e.g., if capacity information was available, shelters were chosen from highest to lowest capacity), and (4) the willingness of shelter personnel to participate. However, many shelters for which contact information was collected no longer exist and therefore, were eliminated from this study analysis. "}, {"section_title": "Sampling Methods", "text": "Due to the small population of homeless people and managerial staff-and that the participation of homeless people in the survey was dependent on their presence and availability in a specific shelter when the survey was administered-clustered and purposive sampling techniques were used to collect data from the homeless population and shelter personnel. Survey administration in a shelter, which ensured that the homeless population was accessible in that location, was also deemed a more efficient way to conduct this research given that outside of the shelters, the homeless are usually in places invisible to the public eye. This approach also ensured the safety of the surveyors. A sample size of 100 homeless people was originally chosen because it would be a sufficient size to accurately describe the population and would be possible to complete in a timely manner. However, during the data collection process it became apparent that undertaking individual interaction with the homeless population was difficult; hence, only 50 surveys were used in the study."}, {"section_title": "26", "text": ""}, {"section_title": "Survey Instruments", "text": "Two survey instruments were deployed to collect primary data on physical and social capital and on the social networks of homeless people at the shelters. The questionnaires used for the homeless population and shelter personnel (Appendix B and C) contained primarily yes-no questions and write-in answers. Responses were obtained primarily via paper surveys administered through face-to face interaction with the homeless people. Hard copy surveys were also mailed to certain shelters that prohibited face-to-face interaction with the homeless population. Due to lack of access of the homeless population to internet, online survey administration, which was originally intended to increase survey responses, was not implemented. While the survey of the homeless population contained questions focusing on the social and physical capital and networks, the survey for shelter personnel included questions pertaining to their opinions of the homeless population's social and physical capital, social networks and relationships, and their previous experiences with disasters. The survey for shelter personnel also included questions regarding the local disaster policies and its usefulness and relevance to the homeless population. Because the number of survey responses obtained from the shelters' personnel was insufficient to conduct statistical analyses, these responses were coded and analyzed using qualitative approach. Information about how the government agencies and non-governmental organizations might better assist the homeless population during disasters was obtained from the homeless people and the shelters' staff through observations and casual conversations. Like the small sample size of the shelter personnel survey, because of the small sample size of this data and because the data gathered may not be able to be compared within itself (e.g., opinions of policy and personal experiences during disasters), these data were qualitatively analyzed."}, {"section_title": "Data Processing", "text": ""}, {"section_title": "Survey Coding", "text": "Survey data was coded and entered into SPSS for analysis ( Table 5). Questions that required participants to write-in answers were entered in text (e.g., social capital city or state) or number format (e.g., zip code, age, number of years homeless). States, counties, and parishes were coded by their Federal Information Processing Standards (FIPS) Code. If the question required a yes-no response, the information was coded as \"1 = yes\" or \"0 = no\". Questions with multiple nominal responses were coded beginning with the number \"1\" at an increment of one from left to right, or top to bottom. Likert scale questions were also coded from \"1\" with an increment of one from low agreement/accessibility to high agreement/accessibility. There is one exception to the public transportation variable, which included a value of \"0\" a response that states the individual is unfamiliar with public transportation. "}, {"section_title": "Spatial Data Processing", "text": "Assistance locations (i.e., schools, hospitals, churches, and fire stations) were obtained as text files containing latitude and longitude information pertaining to each location. The text file was first converted to a CSV file and was then geocoded in ArcMap using \"PRIM_LAT_DEC\" as latitude and \"PRIM_LONG_DEC\" as longitude. From the large point shape file, individual point shape file was create for each of the following assistance and community centers-schools, churches, hospitals, fire stations by using the following attribute queries-\"FEATURE_CL = \"School\" or \"FEATURE_CL = \"Church\" or \"FEATURE_CL = \"Hospital\" or \"FEATURE_NA = \"Fire.\" From each shapefile, the assistance and community centers were extracted for each study county and parish. Finally, the shapefiles were projected into North American The homeless shelter point shapefile was created by geocoding the addresses obtained in a CSV format using an address locator. Geocoding is the process of taking a pair of coordinates or an address in order to locate it on the surface of the earth (ESRI 2013). All other point shapefiles were reverse geocoded for road network analysis and for use outside of this study. Reverse geocoding is the opposite process of geocoding, and finds the addresses of points based on their coordinates."}, {"section_title": "Data Conversion", "text": "The land use/cover data obtained from NOAA-CCAP for 2001-2006 and 2006-2010 were used to determine the change in land uses during 2001-2010. The abandoned land uses (i.e., if the land has not reverted back to its original urban use since Hurricane Katrina, then it was considered to be a potential location for homeless population) were reclassified to indicate potential locations for homeless people. First, the land use categories (Table A1, Table A2) were reclassified into the following five categories: \"Urban,\" \"Non-Urban,\" \"Open,\" \"Water,\" and \"No Data\" (Figure 2). \"No Data\" includes pixels with land cover data, and were excluded. The second reclassification was used to determine land uses that have undergone changes during 2001-2010 using the previous classified land uses ( Figure 3, Table A3). Specifically, the following six land use change categories were created: \"Abandoned,\" \"Developed,\" \"To Non-Urban,\" \"To Open,\" \"To Water,\" and \"No Change.\" The \"abandoned\" category includes urban land use locations that changed to non-urban land    "}, {"section_title": "32", "text": "A polygon shape file of the final land-use type was created, which contained only \"abandoned\" and \"open\" land use classes. A centroid layer of these polygons was then created and projected from Albers Equal Area Conic to North America Datum 1983 Universal Transverse Mercator Zones 15N (Louisiana Parishes) or 16N (Alabama and Mississippi Counties) for other analysis. Centroids of polygons those intersected with water bodies, wetlands and wildlife refuge areas, and centroids that were within 30 meters (i.e., one-pixel size in the land use/cover layer) of the above-mentioned land cover features were assumed to be uninhabitable. Therefore, these centroids were removed from the point shapefile representing abandoned locations that have the potential to be used by the homeless population. The final centroid file was then used for location/allocation modeling and closet facility analysis."}, {"section_title": "Data Analysis", "text": "This study includes multiple scales of analysis. The social scale of this research was individuals who participated in the survey, given the study's focus was on homeless people residing in Mobile County, Alabama; Jefferson Parish and Orleans Parish, Louisiana; and Harrison County and Jackson County, Mississippi. The spatial scale was the county or parish level in the study states. For ease of implementation of spatial and statistical analyses, spatial analyses were conducted using a raster data model at a spatial resolution of 30m x 30m, which corresponds to the resolution of the land use/cover layer obtained from NOAA C-CAP."}, {"section_title": "Road Network Analysis", "text": "Road network analysis determines the physical proximity and access of homeless population to places of assistance during a disaster. Taking this into account, hospitals, churches, schools, and fire station facilities were included in this analysis (Colussi 1998;Cutter, et al. 2008;Foster n.d.;Peacock, et al. 2010;Wisner, Blaikie, et al. 2007) in order to identify potential shelter locations that are at close proximity to the study shelters. In order to determine the accessibility of homeless individuals to disaster assistance services and the locations where more assistance centers could be placed in future in order to better serve the homeless population and other population as well, closest facility modeling and location/allocation modeling were used. Closest facility modeling is a type of Network Analysis that determines the distance between a set of origins (i.e., abandoned area centroids) and destination points (i.e., hospitals, schools, churches, and fire stations) based on road network and topographic conditions by using Dijkstra's algorithm (ESRI 2013). Location-allocation modeling is used to determine potential locations for certain facilities based on the capacity of existing facilities with regard to specific demand (ESRI 2013). In this study, this modeling approach was used to determine where additional assistance facilities (i.e., hospitals, schools, churches) should be located to better serve the demand of a specific location (i.e., abandoned area centroids) (ESRI 2013). Distance was used as impedance because this study assumes that the homeless individuals do not have vehicles or sufficient finances for other modes for transportation, and will be forced to walk to assistance facilities (Figure 4)."}, {"section_title": "Convert USGS Board of Geographic Names", "text": "Data  "}, {"section_title": "Modeling Resilience", "text": "The social capital and physical capital of the homeless were measured using Social Capital variables that were used to determine resilience of the homeless individuals and their data sources including survey questions that were used to collect information for specific variables, and the studies that were used to identify the variables are listed in Table 6. Physical Capital variables that were used in this study to for resilience index, their data sources, and other studies that have used these variables are listed in Table 7.  To determine resilience of the homeless population based on their social and physical capital, Weighted Linear Combination (WLC)-a type of multi-criteria evaluation techniques-was used. WLC allows stakeholders to weight a set of factors influencing a final outcome or a decision (Kar and Hodgson 2008;Drobne and Lisec 2009). Because each factor could have varying importance, their weighting tends to be a subjective process (Drobne andLisec 2009, Malczewski 2000). Each factor is rated before being multiplied with its corresponding weights and all weighted outputs are added to determine a final score Equation 4, where Score = total score for the location, FRj = factor rating for factor j, n = total number of factors/criteria, wj = weight assigned to factor j such that percent African-American, 3.7 percent multiple ethnicities, and 1.9 percent other. In terms of gender, 48.1 percent of respondents were male and 51.9 percent were female. "}, {"section_title": "Social Capital among the Homeless", "text": "According to survey responses, 60.0 percent of respondents indicated that they will receive assistance during a disaster from their immediate family relationships, 48.7 percent informed that they will receive aid from friends while 35.9 percent indicated their assistance will be from extended family, 41.0 percent indicated their aid will be from acquaintances, and lastly 15.8 percent have other relationships that will assist them during a disaster. Evidently, closer relationships (e.g., family and friends) are more willing to provide different forms of disaster assistance. Immediate family relationships are the most willing to provide assistance financially, emotionally, with evacuation and clothing, with food and shelter, and with technology as well, and this relationship is tied with friends in terms of aiding with evacuation ( Figure 6).  Males overall are more likely to have immediate family, extended family, friends, and acquaintances who are willing to assist them during a disaster than females ( Figure   8). Independent sample t-test results, however, show that females are more likely to have other relationships (e.g., relationships not classified as immediate family, extended family, friends, or acquaintances) that will assist them (t (41.891) = -1.617, p = 0.013), and have relationships willing to assist them that are located within the same community (t (27.000) = -2.121, p = 0.043), within the same state (t (27.000) = -2.121, p = 0.043), and those located in other states as well (t (27.000) = -2.423, p = 0.022). Females also have friends who will help financially (t (27.000) = -2.423, p = 0.022), emotionally (t (27.000) = -2.423, p = 0.022), with evacuation (t (27.000) = -2.423, p = 0.022), with food and shelter (t (27.000) = -2.423, p = 0.022), with clothing (t (27.000) = -2.423, p = 0.022), and technology (t (27.000) = -2.423, p = 0.022) more than males.  Survey results also indicated that those who have experienced a disaster have a higher rate of having disaster social capital with all relationships and all assistance types (Figure 9). Independent samples t-test results showed that there is a significant difference between those who have experienced a disaster and those who have not, with regard to friendship, social capital, and assistance ( Figure 10). Those who have experienced a disaster are significantly more likely to have friends who will assist them (t (32.172) = -2.723, p = 0.010), and have relationships willing to assist them who are located within the same community (t (38.000) = -5.707, p = 0.000), within the same state (t (42.858) = -3.144, p = 0.003), and beyond the state as well (t (38.428) = -1.839, p = 0.074). They also have friends who will assist them financially (t (38.000) = -4.613, p = 0.000), 0.000). Friends appear to be extremely important to the homeless, and they often consider their friends to be family.   (t (37.000) = -3.141, p = 0.004) who are willing to assist them financially (t (37.000) = -3.389, p = 0.002), emotionally (t (41.668) = -2.559, p = 0.014), with evacuation (t (41.668) = -2.559, p = 0.014) and technology (t (37.000) = -3.635, p = 0.001). This situation could be due to the association of the homeless individuals with other homeless people within the shelter or with veterans. It is also important to note that individuals who responded 'yes' to having social capital that will provide food and shelter often meant that they would only be provided food rather than shelter because of their relationships with other homeless individuals."}, {"section_title": "Social Networks among the Homeless", "text": "Social network analysis revealed that 32.7 percent of the homeless population has social capital located within the same community, 34.6 percent has social capital located within the state, and 55.8 percent has social capital located out-of-state. However, gravity model ( Figure 11, Table A4, Table A5) results indicated that only 41.4 percent of the disaster social capital relationships are located out-of-state. Of those relationships, the highest numbers of connections (Table 8) are within New Orleans, Louisiana (34 percent); Pascagoula, Mississippi (13 percent); Mobile, Alabama (11 percent); and Biloxi, Mississippi (9 percent). City-pair locations with higher populations (e.g., New Orleans, Louisiana or Mobile, Alabama) that are close together (e.g., New Orleans, Louisiana and Metairie, Louisiana), or are within the same city, ranked higher. Locations with smaller populations (Table 9) (e.g., Mount Vernon, Alabama or Shelby, Mississippi) and/or are further apart (e.g., Mount Vernon, Alabama and Baytown, Texas) ranked lower. In a comparison of results of both variations of the gravity model output (i.e., Equation 2-no connection use, and Equation 3-connection use), it is interesting to note that at the extreme ends of the spectrum, each city pair has the same ranked value, making the number of connections irrelevant. However, by incorporating the number of connections did increase the ranks of some city-pairs that had a very large number of connections (e.g., New Orleans, Louisiana), and decreased the ranks of some city-pairs with a small number of connections (e.g., Shelby, Mississippi).     "}, {"section_title": "Public Transportation", "text": "Survey analysis indicated that about 52.0 percent of participants use public transportation, and according to one-way ANOVA (F(2, 51) = 5.230, p = 0.009) there With regard to transportation access: 11.5 percent of respondents were not familiar with public transportation, 17.3 percent stated that public transportation is not accessible at all, 11.5 percent and 15.4 percent indicated that public transportation is minimally and moderately accessible respectively, and 44.2 percent stated that public transportation is very accessible. However, Alabama participants did state that public transportation is much more widely available \"in the city.\" Given the lack of any public transportation in Mississippi, it is not surprising to note that the respondent's observation about transportation in Mississippi was not significant."}, {"section_title": "Financial Capital", "text": "The survey results indicated that 20. "}, {"section_title": "Experience and Knowledge", "text": "The majority of participants (74 percent) have experienced a disaster before. As a result, 41.5 percent disagreed and 37.8 percent agreed that they are well prepared for a disaster, but 20.8 percent were neutral in their response (Figure 13). There was also a significant difference between states with regard to respondents' knowledge of a disaster and their preparedness as determined by one-way ANOVA (F(2, 49) = 4.249, p = 0.020). A The majority of the homeless believe that their community has a good emergency evacuation plan: 28.9 percent disagreed, 38.5 percent were neutral, and 32.7 percent agreed that their community has a good evacuation plan. "}, {"section_title": "Information Sources", "text": "The most prevalent sources from which the homeless receive disaster related information ( Figure 14) are television (74 percent), followed by family and/or friends (72 percent) ( Figure 14). There was a statistically significant differences between states in regards to receiving information from family and friends as determined by one-way ANOVA (F(2,49)   has to travel for any assistance is 5.9 kilometers (M = 0.9, SD = 0.8). The results also indicated that an overwhelming number of assistance centers are located in the center of the city as opposed to suburban areas (Figure 16)."}, {"section_title": "Jefferson Parish, Louisiana", "text": "In  Results also depicted that 90.8 percent of the homeless population lives within one kilometer of any emergency assistance location and the entire population resides within a maximum distance of 3.2 kilometers (M = 0.5, SD = 0.4) of assistance locations. The findings also show that an abundance of assistance centers is present in the center of the 62 metropolitan area while the outer portion of the parish has an overwhelming lack of any assistance center (Figure 18)."}, {"section_title": "Orleans Parish, Louisiana", "text": ""}, {"section_title": "Harrison County, Mississippi", "text": "In Harrison County, Mississippi, about 0.2 square kilometers of abandoned land and 12.1 square kilometers of open land (a total of 1.6 percent of total land area) are available for shelter along primary roads and in rural areas. Results also depicted that 51.7 percent of the homeless population lives within one kilometer of any emergency assistance location; however, the maximum distance the population has to travel for assistance is 15.6 kilometers (M = 1.8,SD = 2.3). This study also showed that a majority of assistance locations are present along the coast, and along main roads and highways (Figure 19). to an emergency assistance location (i.e. within one kilometer); however, the population will have to travel a maximum distance of 9.7 kilometers to get to an assistance center (M = 1.6, SD = 1.7). It is also evident that majority of the assistance locations are present in the larger coastal cities of Pascagoula, Ocean Springs, and Gautier (Figure 20).  Only the northern portion of the parish was pictured because the majority of the southern portion of the parish is uninhabitable swampland. Figure 18. Location/allocation model: Locations in need of additional assistance in Orleans Parish, Louisiana for the homeless population."}, {"section_title": "Jackson County, Mississippi", "text": "Only the urbanized portion of Orleans Parish was pictured because the majority of the eastern portion of the parish is uninhabitable swampland.  "}, {"section_title": "Predicting Disaster Resilience of the Homeless", "text": ""}, {"section_title": "Variables Impacting Resilience of the Homeless", "text": "Principal Component Analysis (PCA) was conducted to determine the significant socioeconomic, social capital and physical capital variables influencing the resilience of the homeless populations in the study site. First, PCA was used to determine which socioeconomic variables (Table 10)   PCA was then conducted to determine the social capital variables with significant impact on disaster resilience of the homeless (Table 11). The results indicate that (based on cumulative component loadings) those individuals with access to friends and acquaintances who are in a position to provide financial and technological support as well 69 as food and shelter will be more resilience. These individuals will be able to adapt and recover from a disaster as opposed to the individuals lacking any connection with friends and acquaintances. The eight social capital variables explain about 90% of the variance in the data, and hence were used as independent variables to determine resilience. Lastly, PCA was conducted to determine which physical capital variables contribute most to the resilience of the homeless to disasters (Table 12). Again, only nine variables were able to explain almost 73% of variance in data. These variables include access to disaster information using modern technologies (social media, telephones, cell phones), financial affordability, access to an automobile, which inherently influence resilience of an individual, and hence were used in the analysis as independent variables. "}, {"section_title": "Impact of Social and Physical Capital on Resilience", "text": "A Multiple Linear Regression (MLR) ( Table A6)  A MLR (Table A7) was also implemented to determine the relationship between resilience (dependent variable ranging in score from -8 to 8) of the homeless and their social capital (independent variables determined by PCA). The regression equation (F(8, 71 41) = 2.485, p = 0.027) resulted in a coefficient of multiple determination (R 2 ) of 0.327, which again indicated that social capital is also able to explain only 32.7% of resilience. In other words, social capital also contributes to one third of the homeless individuals' resilience. Having friend assistance located out-of-state (p = 0.01) and acquaintance assistance with technology (p = 0.4) were significant. A MLR (Table A8)  To predict the relationship between resilience (dependent variable) and both physical and social capital variables, a MLR (Table A9) was conducted, which resulted in a regression equation (F(17, 27) = 1.988, p = 0.054), with an R 2 of 0.556. Both social and physical capital were able to explain 55.6% of resilience of the homeless population. Finally, combining all the socioeconomic, physical and social capital variables as independent variables, a MLR was conducted (Table A10), which resulted in an equation F(19, 0) with an R 2 of 1.000. Overall, the resilience of homeless individuals is influenced by their socioeconomic, social capital and physical capital variables. Using MCE (discussed in methodology), mean of each socioeconomic, social capital and physical capital variable was multiplied with its corresponding standardized coefficient value resulted from its respective MLR. Finally, the product results were summed to determine predicted disaster resilience index based on available social capital (Table 13) and physical capital (Table 14) for each of the three states. The results (Table   13) show that in terms of social capital, Alabama ranks highest (0.206), followed closely behind by Louisiana (-0.045), and then Mississippi (-0.065). Lower values are consistent with lower resilience.  (Table 14) shows that in terms of physical capital, Louisiana ranks highest (1.455), followed closely behind by Alabama (1.313), and Mississippi (0.255). When Social Capital and Physical Capital variables were combined, the results (Table 15) show that homeless individuals are more resilient in Alabama (2.831) because of their access to social and physical capital as opposed to Louisiana. In Mississippi (resilience index = -0.566), these individuals are more vulnerable due to lack of many of these capital."}, {"section_title": "CHAPTER V -CONCLUSIONS", "text": ""}, {"section_title": "Homeless Social Capital and Networks", "text": "Strong social capital and networks can have a dramatic impact on the resilience of the homeless. This study found that immediate family members and friends are essential to the homeless population's disaster social capital. While homeless individuals rely heavily upon these relationships, they are aware that their immediate family and friends may not be able to assist them given their own financial situation. This study shows that Black people are more likely to have immediate family, extended family, and friends willing to help them than White people; however, Whites are more likely than Blacks to have acquaintances and other relationships who are willing to help them in the event of a disaster. These results are consistent with other studies that report that Blacks are more likely to have smaller networks than Whites (Ajrouch, Antonucci and Janevic 2001), but overall are more likely to keep in close contact with their relatives (Ajrouch, Antonucci and Janevic 2001, Cantor, Brennan and Sainz 1994, Johnson and Barer 1990. Males overall are more likely to have immediate family, extended family, friends, and acquaintances who are willing to assist them during a disaster than females, consistent with findings that report that males are more likely to have larger social networks (Benenson 1990). This is important because women prefer dyadic relationships (Benenson 1990), and exclude others during competitions when they feel threatened (Benenson 2011), which ultimately lowers their resilience. The results of this study also show that those who have experienced a disaster have a higher rate of having disaster social capital with all relationships and assistance types. Those that have experienced a disaster were also more confident in answering social capital and network questions. In addition, counties where drug rehabilitation locations were sampled, social capital and social networks increased, as well as survey response confidence. When analyzed together, this suggests that those that have experienced dire situations are more likely to have a better understanding of the social capital and resources available to them. Further analysis of social networks suggests that those that live in larger cities, especially New Orleans, are more likely to have relationships within close-proximity. Social network analysis also revealed that those currently residing in drug rehabilitation centers have little to no social capital within their communities. The situation is particularly true of the women located at Mission of Hope in Mount Vernon, a small remote town in Alabama. Although strong social capital and networks are critical to disaster resilience, only a small portion has local social capital, and 1 in 4 homeless persons have no social 76 capital. The homeless tend to stay physically close to their family members, or often move to a close larger metropolitan area where there tend to be more available social services. Shelter personnel views of homeless disaster social capital is varied; however, they do feel that if the homeless do have disaster social capital, it is only for emotional assistance. Disaster social capital of the homeless varies upon: financial assistance from friends and acquaintances; technology assistance from friends and acquaintances; assistance from friends and acquaintances that reside out-of-state; and food/shelter and evacuation assistance from friends. Disaster social capital resilience is highest in Alabama, followed by Louisiana and Mississippi. Alabama is rated the highest because they have the highest average amount of acquaintances willing to assist them financially and with technology. Louisiana is rated the second highest because they have the highest average amount of friends willing to assist them from out-of-state, which is the most significant variable in predicting resilience. Mississippi's mean values for each of these variables are normally less than half that of Alabama and Louisiana, resulting in Mississippi being the least resilient among the three states."}, {"section_title": "Homeless Physical Capital and Networks", "text": "Physical capital is fundamental to disaster resilience. Unfortunately, a small portion of the homeless population has enough money to evacuate, own an automobile, or have access to public transportation which increases their vulnerability. While the homeless generally have access to technologies that provide disaster information, majority of the time these technologies are part of the shelter rather than being with the individuals to be able to provide access to any information if a disaster occurs during day time. Thus, the lack of access to technologies makes the homeless overall more vulnerable to future disasters. Mississippi. No significant differences were found with these categories in Alabama, as Alabama's is more resilient than Mississippi, but less resilient than Louisiana. The homeless are also more likely to have access to a cell phone and use public transportation in Louisiana than Alabama, and no significant differences with Mississippi; however, Alabama participants did state that public transportation is much more widely available \"in the city.\" This may explain why homeless individuals are more likely to have automobiles in Alabama than Mississippi. These results show how much less resilient the homeless in Mississippi are when compared to other coastal states. The most prevalent source of disaster information the homeless receive is through television, followed by family and/or friends, radio, shelter personnel, internet, text messages, telephone, social media, face-to-face visits from police officers or fire fighters, weather radio, cell phone companies, sirens, emergency management, and posters. The Additionally, across the entire study area, only 61.9 percent of the homeless population's locations are less-than or equal-to one kilometer away, or 11.1-minute walk for the average person, from receiving emergency assistance (Daamen and Hoogendoorn 2003). However, it would take an average person 5.6 minutes to walk to assistance in Alabama is ranked second highest because it scores higher in ethnicity, and has individuals that are more likely to be homeless for the first time, have been homeless fewer times overall, and are more likely to have acquaintances willing to assist them that reside out-of-state, have automobile access, and receive disaster information through text messages and cell phone companies. Alabama probably ranks higher with regard to social capital because the shelters interviewed in Alabama were both drug rehabilitation centers; so, the participants probably have a better support system and are more likely to be temporarily homeless than those interviewed in Louisiana and Mississippi, most of which were not from a rehabilitation facility. Mississippi ranked the lowest in nearly every category, and the homeless there are more likely to be chronically homeless and lack in social and physical capital than both of the other states. Physical capital has the most effect on predicting the disaster resilience of the homeless, followed by their socioeconomic characteristics and social capital. In order to increase the resilience of the homeless, more evacuation programs should be implemented, following New Orleans's Evacuspot program; however, additional locations should be placed in more rural areas and the homeless should be informed of where all these pickup points are located and the pickup schedule. In addition, the government should provide cell phones for the homeless in order to notify the homeless about disasters through push notifications. This will also allow the homeless to call and request a pickup if they are physically unable to reach the pickup locations themselves. Social workers and medical professions should also be more involved in assisting the homeless to evacuate, as shelter personnel believe that homeless individuals have health issues that would make it difficult to evacuate and homeless individuals tend to trust health professionals."}, {"section_title": "Limitations and Future Directions", "text": "If this survey is implemented in the future, a larger sample size should be used, and the surveys should be taken through a computer in order to more accurately assess the social capital of homeless individuals without overwhelming them. The current survey tool has five possible locations for homeless individual's social capital that can be used for each relationship type in order to not overwhelm the participant; however, if a participant has more than five relationships that will help them during a disaster, they were not included. If a survey program was used, it would allow for individuals to state the number of relationships they have in each location and would only add additional social capital assistance locations when the previous question was answered. It would also be helpful to include a checklist of other locations where the homeless could identify where they have received additional assistance. Lastly, questions regarding the health and financial status of homeless individuals would be very informative in understanding evacuation needs. This research will contribute to the field of geography, especially hazards research. This research is of utmost importance to the underserved population of the homeless community. Research has been conducted extensively on populations affected by disasters, but little has been conducted on the homeless, and even less on the socioeconomic and physical conditions that contribute to their disaster resilience. It will also create a new model for analyzing the resilience of the homeless and other special-needs groups through GIS to disasters. Information discovered in this research can potentially help lower the death rate of the homeless when a disaster occurs. The research findings will be crucial for governing officials, homeless shelter personnel, and other community organizations to create policies that are in the best interests of the homeless community. This research will also allow for a marginalized group's voice to be heard and potentially help create bottom-up policy to better support their needs. The Red Cross, FEMA, local governments, and other emergency management agencies will receive a copy of the report; raw survey data, survey tool, and model to assess homeless/at-risk group disaster resilience. Letter  93   Table A1.  Table A2."}, {"section_title": "APPENDIX A -IRB Approval", "text": ""}, {"section_title": "NOAA-CCAP Land Cover Category Codes", "text": ""}, {"section_title": "First Re-classification of SQL Statements", "text": "Water (1) (\"2001_Code\" >=13 AND \"2001_Code\" <= 18) OR (\"2001_Code\" >= 21 AND \"2001_Code\" <=25) (\"2006_Code\" >=13 AND \"2006_Code\" <= 18) OR (\"2006_Code\" >= 21 AND \"2006_Code\" <=25) (\"2010_Code\" >=13 AND \"2010_Code\" <= 18) OR (\"2010_Code\" >= 21 AND \"2010_Code\" <=25) Open ( (\"2010_Code\" >=6 AND \"2010_Code\" <= 12) OR (\"2010_Code\"= 20) Urban 4\"2001_Code\" >=2 AND \"2001_Code\" <= 4 \"2006_Code\" >=2 AND \"2006_Code\" <= 4 \"2010_Code\" >=2 AND \"2010_Code\" <= 4 Table A3."}, {"section_title": "Second Re-classification of SQL Statements", "text": "No Change/Unknown 0Default value = 0 To Water (1) (\"2001RC\" >=2 AND \"2001RC\" <=4) AND \"2006RC\" =1 (\"2006RC\" >=2 AND \"2006RC\" <=4) AND \"2010RC\" =1 Open 2(\"2001RC\" >=1 AND \"2001RC\" <=4) AND \"2006RC\" =2 (\"2006RC\" >=1 AND \"2006RC\" <=4) AND \"2010RC\" =2 To Non-Urban (3) (\"2001RC\" =1 OR \"2001RC\" =2) AND \"2006RC\" =3 (\"2006RC\" =1 OR \"2006RC\" =2) AND \"2010RC\" =3 Abandoned (4) \"2001RC\" =4 AND \"2006RC\" =3 \"2006RC\" =4 AND \"2010RC\" =3 Developed (5) (\"2001RC\" >=1 AND \"2001RC\" <=3) AND \"2006RC\" =4 (\"2006RC\" >=1 AND \"2006RC\" <=3) AND \"2010RC\" =4 "}]