[{"section_title": "I. Introduction I. Introduction", "text": "The study and development of models of infectious disease dynamics surely plays a fundamental role in facing an unknown outbreak. Nevertheless, such models often create controversy about how, when, and whether their could be a useful tool in helping policy decisions [1] . In the Covid-19 crisis, it seems that some articles have been written more to convince the local authorities than to scientifically discuss the real situation of the spreading of the outbreak in each country. In this paper, we analyse how, in the early stage of the pandemic, the mitigation strategies adopted by the local authorities can be monitored by using the weekly spreading rate of the countries, and, at the end of the outbreak, how they can be evaluated by studying the skew-normal distributions that fit the daily confirmed cases and deaths curves of each country. It is clear that the more timely the action of the local authorities turns out to be, the more effective is the result. The number of confirmed cases is only a reliable number if a testing strategy is adopted. Without it, we do not know in which stage of the disease the country is at a certain time. Many of the European countries followed a similar weekly spreading rate in their apparent early stage of the disease, but, for example, for Italy/Spain and Germany/Austria it led to completely different results in facing the outbreak. As we shall see in detail later, the massive testing strategy adopted by the German and Austria authorities created the positive difference in favour of these countries.\nOften, the countries are compared to each other by using their Total Confirmed Cases (TCC). This is obviously misleading due to their different populations. Nevertheless, the Total Confirmed Cases per Million (TCCpM) could also be misleading. Let us for example consider the following number taken by [2] on May, 30. Belgium, Spain, the UK, Italy, Iceland, and Singapore appear with a TCCpM number between 4000 and 6000. Are they in a similar situation in facing the Covid-19 pandemic? The answer is immediately found by looking at their number of Total Deaths per Million (TDpM), which are 815, 580, 566, 551, 29, and 4 respectively. Showing a clearly different result in facing the outbreak. New Zeland, Australia, South Africa, and South Korea also have a mortality rate comparable with the Singaporean one, but their TCCpM are around 300, well below than the TCCpM of Singapore. It is important to observe that, without a vaccination, immunization also plays a fundamental role. So, in the previous cases, Iceland and Singapore surely obtained the best results in facing the Covid-19 outbreak, whereas the European countries had the worst ones. The perfect way to face the outbreak is reaching the maximum number of immunization together with a minimum number of deaths per million. This point should be highlighted in scientific discussions and, clearly, in the media information.\nIf a country does everything well and in time, the mortality is controlled. If the action of the local authorities in adopting mitigation measures and testing strategies is not effective, health care systems get overwhelmed and the mortality rate increases to critical values. During the outbreaks in Italy and Spain, the not timely action in preventing or isolating and a weak testing strategy, led to collapsed healthcare systems and the mortality rate reached scary values, despite people being forced to stay at home, to leave their houses only for shopping (food and other necessities), for medical issues, and to travel to and from work only when absolutely necessary. Brazil, in time, banned international travel, football matches, and closed its land borders, shut down all non-essential public services (first of all universities and primary and high schools) and private businesses, with employees working from home, and commerce was restricted to supermarkets, pharmacies, restaurants (for takeaway or delivery only), gas stations and other critical services. Despite its not effective testing strategy when facing the outbreak, the timely action seems, at the moment, to give good results in terms of deaths if we compare the early Brazilian stage of the disease to the European one, where strict lockdowns were adopted. Obviously Brazil is a big country, so when we talk of good results, we need to be careful. Indeed, while some Brazilian States plan to relax the quarantine rules, others, which are facing a collapse of their health systems, are planning, following the Europe example, a strict lockdown with a ban of on unnecessary circulation of people and vehicles. Worldwide, we also find different approaches. By quickly implementing public health measures, Hong Kong demonstrated that COVID-19 transmission can be effectively contained without resorting to the strict lockdown adopted by China, the USA, and Western Europe. The Hong-Kong TCCpM is around 145 and the mortality of 0.5 (TDpM). As one of the most heavily affected epicenters during the SARS epidemic in 2003, Hong Kong was better equipped to face the Covid-19 outbreak compared to other countries. Improved testing, hospital capacity to handle novel respiratory pathogens, population understanding the need to improve personal hygiene and to maintain physical distancing made the difference. In Europe, one country stands out in its approach to tackle Covid-19. The Swedes take individual responsibility for social distancing. Their high schools and universities were closed but the primary schools, gyms, restaurants and bars remained open, with social distancing rules enforced, while gatherings were restricted to 50 people. The mortality rate per million of inhabitants is lower than the one of Italy, Spain, and the UK but higher than in neighbouring Norway, Finland, and Denmark. Nevertheless, hospitals have, at the moment, not been overwhelmed as it happened in Italy and Spain. There is no debate over how to re-open society, and whether there will be a second wave, because society has largely remained open and the local consequences of a lockdown have been avoided. As remarked by the local authorities, Sweden opted for a kind of marathon instead of a sprint to close the first Covid-19 wave.\nA recent study from the Kings College London [3] , based on data from a survey of 2250 UK residents aged 18-75, classified the members of the population according to their response to the Covid-19 crisis and lockdown measures. Three groups were identified: accepting (44%), suffering (47%) and resisting (9%). In the resisting cluster, with an average age of 29 of which 64% are male, 58% think that \"too much fuss is being made about the risk of coronavirus\" (around six times higher than in the other two groups), 76% go against official guidance, such as meeting friends or family outside home (41%) or going outside when having coronavirus-like symptoms (35%). The researchers also observed that, differently to what happens for the resisting people, where young people represent the biggest number, the 55 to 75 year old people characterize by far the biggest proportion within the accepting group. Women make up nearly two-thirds of the suffering cluster, while the contrary happens for the resisting one, where men represent almost two-thirds of the group. The study also focuses on the political distribution of the three groups and contains many other detailed information that the reader can freely access in ref. [3] . Worldwide, people spent weeks without seeing friends and/or family, without school or university, holidays, sport or even being able to go to work. So, stress, anxiety, depression, and pandemic fear are a very common response to the lockdown measures during the Covid-19 outbreak [4, 5] .\nTo understand the mathematical reason of the lockdown, let us briefly talk about the basic reproduction number, the so-called R 0 number [6] . It determines the number of infected people caused by one infected person at the beginning of the outbreak, so before widespread immunity starts to develop and/or any attempt has been made to reduce the spreading. The down-script zero thus refers to the zero immunity in the population. The R 0 should not be confused with R t , which is the number of persons infected, at any specific time, by an individual. It decreases as immunized people increase, either by vaccination, natural immunity, or with their death. In case of Covid-19, we still have no vaccination. So, a large percentage of people immune to the infection (providing that the disease will not spread rapidly within the population), the so-called herd immunity [7] , can only be reached through two chains, i.e. natural immunity or death. When the number of susceptible people decreases, as people die or become immune by exposure, the R t number decreases too and the sooner the people recover or die, the smaller becomes the value of R t . The basic reproduction number predicts the ratio of immunization that a population requires to achieve herd immunity. The critical immunity threshold for random vaccination (assuming 100% vaccine effectiveness) is (R 0 −1)/R 0 [7] . For a basic reproduction number of 2.5 (the Covid-19 reproduction number estimated in [8] for Wuhan was 2.2) the threshold is thus given by 3/5 of the population, i.e. 60%. For R 0 = 5 (a recent study calculated a reproduction number of almost 4.9 in the first week of the outbreak in Iran [9] ) the threshold increases to 4/5 of the population, i.e. 80%. At any time, the effective reproduction number, R t , can be expressed in terms of the basic reproduction number, R 0 , and the percentage of immunized people in the population at that time,\nMitigation and isolation strategies are often used to artificially reduce the reproduction number. For example, in Iran the basic reproduction number was 4.9 in the first week. After the closure of schools and universities, the effective reproduction number was 4.5, and, after a reduction in the working time, its value decreased to 4.3 [9] .\nWithout a vaccine, immunization at a much delayed speed, ensuring that health services are not overwhelmed, is the only way to face the pandemic. Isolation (or lockdown when necessary) is surely the main Σ δ Λ medRχiv/2020 medRχiv/2020 3 . CC-BY 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted June 2, 2020. . tool to allow those who suffer the most acute symptoms to receive the medical support they need. Nevertheless, what mitigation measures should be adopted still represents a matter of discussion and, surely, they cannot be taken without using massive testing strategies. Indeed, testing people is not only important because it shows, at a given moment, the real situation of the outbreak and where it is growing, but it is also essential to sensitise and empower people."}, {"section_title": "II. Massive testing strategy II. Massive testing strategy", "text": "Let us now discuss the numbers which appear in Table  1 . The data was collected by the worldwide repositories: WorldoMeters [2] , World Health Organisation [10] , and GitHub [11] . For the numbers of beds of Intensive Care Units, we used for the European countries ref. [12] , updated for Germany by [13] , for the USA ref. [14] reporting 96596 ICU beds (which means 292 beds per Million of inhabitants), with the following distribution Metropolitan, 94%, Micropolitan, 5%\" and Rural, 1%, and, finally, for Brazil the data from [15] reporting 46000 ICU beds (216 BpM) subdivided into the five Brazilian regions, North, North-East, Central West, South-East, and South, with the following percentages 4% (90 beds per Million), 19% (150 BpM), 10% (250 BpM), 52% (270 BpM), and 15% (220 BpM), respectively.\nAt the 30th of May, the Total Deaths per Million (TDpM) for twelve European countries (Austria, Belgium, France, Germany, Ireland, Italy, Netherlands, Portugal, Spain, Sweden, Switzerland, and UK), the USA and for the ten South American countries (Argentina, Bolivia, Brazil, Chile, Colombia, Ecuador, Paraguay, Peru, Uruguay, Venezuela) show the greatest numbers of TDpM for the Italy, the UK, Spain, and Belgium, with TDpM numbers of 551.1, 566.0, 579.6, and 814.9, respectively. In these countries, the number of Tests per Confirmed cases (TpC) is practically the same (14.9 for Belgium and Soain, 15.3 for the UK, and 16.4 for Italy) and their number of Total Confirmed Cases per Million (TCCpM) is between 3845.7 (Italy) and 5111.7 (Spain) leading to a mortality rate of 16.2% for Belgium, 11.3% for Spain, 14.3% for Italy, and 14.1% for the UK. Ireland and Switzerland, which have a ratio of tests over confirmed cases comparable to the one of the previous countries, have a lower mortality rate, 6.6% and 6.2%, respectively. Observe that the UK and Ireland have practically the same low number of ICU beds (the WHO suggests a number between 100 and 300) but a different mortality rate. The same happens for Italy/Spain (BpM: 125/97) and Switzerland (BpM: 110). Belgium, notwithstanding the good number of BpM, (159), has the worst mortality rate. Let us now compare Sweden and the Netherlands, having a TpC of 6.2 and 7.1, respectively, with the USA, TpC of 9.1. For these countries the mortality rate is 11.8% (Sweden), 12.8% (Netherlands), and 5.9% (USA). Here, What has just been discussed shows that when comparing the mortality rate's percentage, we have to take care and consider the number of tests done per confirmed case. To correctly interpret any data, we need to know how much testing for Covid-19 the country actually does. Without complete data, it is complicate to know which countries are doing well and to understand how the pandemic is spreading. When discussing the Total Deaths per Million (TDpM), the number of tests Σ δ Λ medRχiv/2020 medRχiv/2020 4 . CC-BY 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity."}, {"section_title": "(which was not certified by peer review)", "text": "The copyright holder for this preprint this version posted June 2, 2020. .\nis not important. In this case, we have to consider the stage of the outbreak. For example, this is the case of the South American countries that are in a different stage of infection compared to the one of the European countries that are closing their first Covid-19 wave. Looking at the TDpM number, a particular case is called to our attention. In Tab. 1, amongst the first four countries, Italy has the highest TpC number (16.4) , and Germany, below in the table, has a TpC of 21.6. Remembering that the two countries are both closing their first wave of pandemic, how can their large difference in the TDpM, 551.1 (Italy) and 101.8 (Germany), be justified?\nTo answer to this question, let us discuss the data reported in Tab. 2 and collected for Austria, Germany, and the four countries having the greatest numbers of TDpM in Tab. 1 (Belgium Spain, Italy, and UK) by the repository of Our World in Data [16] . At March 8, Belgium, Austria, and Germany have a similar number of TCCpM (between 10 and 20) but a different number of TpC: 20.3, 43.3, and 120.1 respectively. This means that when the pandemic was in its initial stage reaching the value of 10/20 TCCpM the Austrian testing strategy was twice more effective than the Belgian one and Germany showed a massive testing strategy six times more effective than Belgium and twice than Austria. At March 8, the pandemic in Italy was at an advanced stage counting 121.9 of TCCpM. So, to compare the testing strategy of Italy with the one of Germany, we have to go back to February 27 when Italy counted 10.83 of TCCpM. The number of TpC in Italy, when the disease reached 10/20 TCCpM, was similar to Belgium. An easy way to compare the testing strategy is normalising the TcP to one of the compared countries. This allows to introduce the Effectiveness Factor (EF) with respect to that country. For example, by choosing Italy as the normalising country, the Belgian, Austrian, and German EF is given by 1.1, 2.3, and 6.5 respectively. Repeating this for other intervals of TCCpM, we find: Testing far more people means to catch more inhabitants with few or no symptoms. Increasing the number of known cases, but not the number of fatalities, we obviously decrease the fatality rate and obtain a more reliable number for the mortality rate of the pandemic. Nevertheless, this is not the main goal of massive testing strategy. The strategy of early and widespread testing allows to slow down the pandemic spreading by isolating known cases while they are infectious and to enable medical treatment in a more timely way, saving lives. The possibility of an early diagnosis, avoiding that a patient goes into a steep decline, clearly increases the chance of survival. Long before recording its first case of Covid-19 in February, Germany, in mid-January, developed a test and posted the formula online and laboratories across the country had built up a stock of test kits [17] . This allowed a massive testing strategy with respect to the other European countries, as previously shown a factor six in the beginning of the outbreak. The German and Austrian massive testing strategy, in facing the pandemic in its early stage, made the great difference. In the final stage, massive testing is only useful to reduce the mortality rate on the paper but not to save many lives.\nAt the beginning of its outbreak, Germany conducted 120 tests per confirmed case, far more than any other European country. Medical staff, at particular risk of contracting and spreading the virus, was regularly tested. Physicians, nurses, and laboratory technicians, adequately protected, drove in German streets to test people, what they called corona taxi, suggesting hospitalization even for patients with mild symptoms, for more detail see ref. [17] . This was done at absolutely zero cost for the population (differently, for example, of what happened during the first several weeks of the outbreak in the United States of America) and this guaranteed a broad-based testing. In most countries, including the United States and Brazil, testing was largely limited to the sickest patients. Testing and tracking was the successful strategy of South Korea in Asia and Germany in Europe.\nSocial distancing measures are surely important to flatten the pandemic curve, avoiding the collapse of the national health care systems, a clear, detailed, and, scientifically correct information is fundamental to reassure and calm the people, but, as already said before, massive testing strategies make the great difference in facing the Covid-19 outbreak.\nLet us now make an important consideration about absolute numbers, often used in the media: They cannot be used when comparing different countries. For example, looking at the absolute numbers of tests, on May, 30, for Germany and Italy we find 3824621 and 3952971, respectively. At first glance, the small difference seems not to deserve a deep analysis of their strategy. However, as shown in this section, the massive testing strategy adopted by German, in the early stage of the disease, led to different results in terms of mortality rates, in favour of the German people.\nOther absolute numbers often used to compare countries are Total Confirmed Cases (TCC) and Total Deaths (TD). For example, in the Covid-19 world ranking of Worldometer [2] (which lists 215 countries), the TCC and TD absolute numbers of Brazil, at the 30th of May, puts Brazil on position 2 for TCC (after the USA) and on position 4 for TD (after the USA, the Σ δ Λ medRχiv/2020 medRχiv/2020 5 . CC-BY 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted June 2, 2020. . Fig. 1 and 2 , are periodically updated on the webpage [19] .\nThe copyright holder for this preprint this version posted June 2, 2020. Data on the testing strategy adopted by the different countries are often unevenly available. So the plots given in Fig. 3(a) and 4(a) , when they are used to compare countries amongst each other, have to be appropriately normalised by the relative ratio of TpM.\nWe recall one more time, that the success of a country in facing the pandemic is not to reduce the TCCpM but to reduce its TDpM. Immunization also plays a fundamental role in the battle against the disease. Obviously, reducing infections also has an effect on decreasing the rate of mortality. But, it is possible to find many examples in which a great number of TCCpM does not necessarily implies a great number of TDpM, see for example the Ireland curves in Fig. 3 . Now, let's analyse the weekly spreading rate of the daily deaths per million, the so called β factor. It will be done in perfect analogy with what has been done for the daily confirmed cases per million. Taking as illustrative example the previous countries, we obtain In this case, the comparison can be done directly without any testing normalisation. Obviously, subnotification of deaths has also to be taken into account but, at the moment, we have not reliable information on this. Between 10 and 20 TDpM, the tables show the worst β factors for Italy and the best ones for Brazil. Nevertheless, the increasing rate for Italy, Germany, the USA, and Brazil, show the following factor 1.6, 1.4, 1.6, and 2.1, respectively. In Fig. 3(b) , we see that Ireland, despite its high values of TCCpM and peak in DCCpM, will close the first wave of pandemic with a number of TDpM between 300 and 400, well below Belgium around 800 and Italy, Switzerland and Spain with values between 550 and 650. The plots also show the good result of Austria (<100), Germany (around 100), and Portugal (≤ 150). In Fig. 4(b) , which is an amplification of Fig. 3(b) , Brazil overtakes the curves of Austria, Germany, and Portugal (meaning that its final TDpM will be obviously greater that 200) but is still under the ones of the other European countries and of the USA. We shall come back to this in section V.\nThe copyright holder for this preprint this version posted June 2, 2020. and of the USA, is given by\nwhere a = c for the confirmed cases, a = d for the deaths, and Erfc is the complementary error function,\nThe skewness of the distribution, defined by\nis limited to ( − 1 , 1 ) . The mean value is given by\nand the mode (maximum) has not an analytic expression but, as shown in [26] , an accurate closed form is given by\nThe three fitting parameters, µ, σ, and s, were obtained, both for the TCCpM and for the TDpM data, by modelling theirs curves by the respective cumulative skew-normal distributions,\nThe cumulative skew-normal distribution can be expressed in terms of the complementary error function and of the T-function, introduced by Donald Bruce Owen in 1956 [27] ,\nThe TCCpM and TDpM curves were modelled by using the NonlinearModelFit calculation of the computational program Wolfram Mathematica [28] . The three fitting parameters, with the respective 95% Confidence Intervals, appear in Table 3 . The CDF and PDF for ten European countries, which are closing their first pandemic wave, appear in Fig. 5 and 6 . The DCCpM plots in Fig. 6 clearly show their asymmetric nature. This explains why the forecasts based on normal distributions, due to the lack of profile asymmetry, led to misleading results, in most cases anticipating the prediction of the end of the first epidemic wave.\nThe greatest asymmetries are found, for the confirmed cases, for the skew-normal distributions of Portugal (γ c = 0.94), and, for deaths, for Spain (γ d = 0.92). The most symmetric distributions belong to Ireland, γ c = 0.33 and γ d = 0.20, and France, γ c = 0.08, with a profile very similar to Gaussian distributions.\nBy using the fitting parameters of the skew-normal distributions, we can also obtain information about the mean values of the DCCpM and DDpM curves. For example, for Germany, Spain, Italy, and Belgium, we find µ c = 75.9, 75.4, 76.1, and 83.9, respectively, showing that the epidemic began in the same period in the first three countries and a week later in Belgium. It is also interesting, to calculate the shift between the mean values of deaths and confirmed cases,\nFor Germany, we find the value 13.4. For Spain, Italy and Belgium this shift is well lower: 5.0, 4.7, and 2.5, Σ δ Λ medRχiv/2020 medRχiv/2020 8 . CC-BY 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted June 2, 2020. . respectively. This shows that in Spain, Italy, and Belgium only people with moderate or severe symptoms were being tested. One more evidence of the different testing strategy adopted in the early stage of the outbreak by Spain/Italy/Belgium and Austria/Germany. Before concluding this section, we observe that, among the distributions plotted in Fig. 6 , the Dutch one shows a smooth growth and a peak (comparable to the German one) lower than all the other distributions. The Netherlands tried to adopt a different lockdown. In contrast to most other European countries, where people were virtually housebound, the Dutch authorities opted for what they called an \"intelligent\" lockdown. The Dutch position, in many aspects similar to the Swedish one, reflects the idea that immunization also plays a fundamental role in facing the pandemic. Despite their different approach with respect to the strict lockdown of Belgium (TDpM: 814.9), Spain (579. Table 4 \nThis result confirms what we discussed in the Introduction, i.e. when talking of the Covid-19 numbers, it is fundamental to look at the deaths per million. Predictions of the critical peak region for the DDpM curves are clearly more important than the ones for the DCCpM curves. When the DDpM curves cannot be modelled, because one of the three parameters oscillates, we can resort to what we call dynamical prediction. This happens for example, for Brazil where the peak still shows an oscillating behaviour, we shall come back to this point later.\nThe skew-normal predictions can be complemented by the graphical analysis of the α and β factors, given in Figs. 3. For example, Fig. 3(a) shows a closing curve for the UK (black line) between 4000 and 5000 TCCpM and this is in agreement with the skew-normal prediction (4753 ± 78). For the UK, with a population of 68 million people, a TCCpM of 5000 means 340 thousand confirmed people at the end of the first pandemic wave. For Sweden (yellow line), the α factor does not yet show a decreasing behaviour. This means that the skew-normal forecast giving, for the TCCpM, a value greater that 7000 (7253 ± 675) corresponding to 70 thousand confirmed cases (remembering that the Swedish population is 10 million of inhabitants) could represent a lower limit. As observed before, the number of total infected people is only one of the analyses that needs to be done to assess how a country tackled the epidemic. When looking at the skew-normal predictions for the total deaths in the UK and Sweden, we find values around 600 (595 ± 4) and 500 (524 ± 18), respectively. Forecasts compatible with the ones of their β factors, see Fig. 3(b) , with the Swedish value still representing a lower limit. This means approximatively 40 and 5 thousand deaths for the UK and Sweden, respectively.\nFor the USA, the skew-normal prediction for the TCCpM leads to a value around 7500 (7618 ± 90), this means, for a population of 330 million of people, 2.5 million of confirmed cases at the end of the first pandemic wave. What could call the attention is the similar number of TCCpM of the USA and Sweden (where the mitigation measures were quite different). However, as early observed in this work, when we compare the total confirmed cases between two countries, we have to normalise with their TpC ratio, in this Σ δ Λ medRχiv/2020 medRχiv/2020 9 . CC-BY 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted June 2, 2020. . case 2/3 (see Tab. 1). Let us analyse the USA and the UK data, where the local authorities adopted similar strict lockdowns. The β factor of the USA (white line), see Fig. 3(b) , predicts, at the end of the first wave, a TDpM of 400 (in terms of absolute numbers this means 130 thousand deaths) compatible with the skewnormal prediction (377 ± 4). The UK should close its first wave with a TDpM of 600. This difference could be explained by the different number of BpM of the two countries (66 for the UK and 292 for the USA). Sweden, if the prediction is confirmed, should close with a number of TDpM 500 without resorting to a strict lockdown and despite its very low number of BpM (58). Surely a good results for the Swedish authorities. Remember that most of the European countries are beginning the second phase of Covid-19 and, now, relaxing their mitigation measures, are getting closer to the Swedish approach.\n• Brazil. For Brazil, it is not yet possible to model the DCCpM and DDpM curves because the skew-normal parameters are still in their oscillating phase. However, the α and β factors can be used to compare the epidemic curves of Brazil with the ones of the European countries when they were in the same stage of the outbreak. In particular, the Brazilian DDpM weekly spreading curve, see Fig. 4(b) , overtakes the Austrian, German, and Portuguese ones, but it is clearly lower that the ones of the other European countries, like Spain, Italy, and UK.\nTo make some reliable predictions on Brazil, let us examine the dynamical peak, see Fig. 9 . Before reaching the peak it clearly does not make sense to speak of asymmetric distributions, so we have to use the standard normal distribution to get dynamical predictions. What do we mean with dynamical predictions? The idea is simple: In the initial stage of the disease, the daily updated data lead to forecasts that change drastically from one day to the next. For example, at day 65 (the 26th of Match), the prediction for the peak of the DDpM curves for the UK, Sweden, and the USA was at day 103 (May, 3), 109 (May, 9) , and 116 (May, 116), respectively (see Fig. 9 ). Five days later at day 92 (the UK and the USA) and 127 (Sweden). In Fig. 9 , the dashed red line (day of the prediction coinciding with the prediction of the peak) represents the critical line. When the prediction curve crosses such a line it tends to stabilize, see the UK, Sweden, and the USA cases. For Brazil, the oscillating peak is getting closer to the critical line. For a symmetric distribution, after the crossing point, we should, theoretically, have a horizontal line. So, the inclination of the dynamical curve, after the crossing point with the critical line, is an indication of the breaking of symmetry in the distribution. For example, the DDpM skew-normal curves of the USA and Sweden should have a greater asymmetry with respect to the one of the UK. This is confirmed by the standard deviations given in Tab. 4(b) .\nThe dynamical analysis of the Brazil peak shows that the country is approaching the peak of the DDpM. To see when this will happen, let us consider the number of deaths at the 30th of May (day 130), i.e. 28834. If, we go back at the day 80 (April, 10), we find 1057 deaths. Let Solving to find the x d getting to y d = 1, we find\nThis means a peak of the DDpM curve around the 10th of June. Looking at the increase of the last 10 days, this implies reaching the peak around 200 TDpM, a number comparable to the one of the most critical European countries (see Fig. 3b ) but with a number of DDpM at the peak lower than the one of these countries (see Fig. 4b is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted June 2, 2020. . heterogeneity, clearly, suggests the implementation of locally different mitigation measures when facing the long epidemic wave.\nThe copyright holder for this preprint this version posted June 2, 2020. . https://doi.org/10.1101/2020.06.01.20119461 doi: medRxiv preprint 41.7) have a very low immunization rate and this should be taken into account when facing an eventual second wave of the pandemic. The best ρ factor, combining mortality and immunization rate, belongs to Piemonte. The Italian Table also shows that a smart lockdown and an appropriate testing strategy should give better results that an indiscriminate full lockdown.\nThe Brazilian mitigation measures are similar to the Dutch approach, more strict than the Swedish one but surely less severe than the Italian lockdown. At the 30th of May, Brazil reached 2347 TCCpM with a very low TpC number (1.9) suggesting a great number of hidden infected people. Nevertheless, the numbers of deaths (TDpM: 126) still remain under control and, as shown in section V, the peak could probably happen around June, 10. For Brazil, the ρ factor is of 0.10. This means that, at the end of the first pandemic wave, Brazil reaches a great number of confirmed cases per million (with a consequently good immunization of the population) and a relatively low number of deaths. As shown for Italy, it is clear that a national strict mitigation approach is not the correct way to face the pandemic. A smart local lockdown has always to be preferred to a national one, as in medieval times. In contrast to most other European countries where people were virtually housebound, the Brazilian, Dutch, and Swedish authorities adopted a different mitigation approach: conservative (but not medieval), medium, and liberal, respectively. Italy and Netherlands are closing their first pandemic wave with a (TDpM,TCCpM) number around (550,3800) and (350, 2800) and Sweden, if the predictions are correct, should close around (550,7500). The Dutch and Swedish approaches have given positive results, in terms of deaths and confirmed cases per million compared to the critical European countries that adopted a strict lockdown (Belgium, Spain, the UK, and Italy), even though they have been heavily criticised in the beginning for their mitigation measures, and despite their less effective testing strategies.\nScary predictions on the exponential growth rate of the pandemic led the local authorities of many countries to use a strict lockdown to get this exponential growth rate down to a safe level. Nevertheless, the Swedish DCCpM curve does not confirm this fear and it has a smooth increase with respect to the curves of the UK and the USA (see Fig 7) . Recently the Norwegian authorities have concluded that the virus was never spreading as fast as predicted and that the effective reproduction rate already dropped to a value around 1.1 before the implementation of most rigid mitigation measures [31] . This is also happening for Brazil, see Fig. 4a , where starting from day 80 (April, 10) and reaching day 130 (May,30), we have, each five days, an increase between 1.30 and 1.45 of total confirmed cases.\nWe conclude by observing that the study presented in this paper only represents one of the many different ways to look at the numbers of the Covid-19 outbreak. Any scientific analysis has always to be complemented by the authorities looking at the local situation in terms of ICU beds, hospital capacities and equipments. Researchers work with numbers and surely could shed a light on what is really happening, but nurses and physicians struggle on a daily basis to help the population and save lives and certainly deserve protection and all the necessary support. 30) . Almost all the European countries are reaching a stabilisation point. This has not yet happened for the South America where the outbreak is delayed with respect to Europe. Amongst the twelve European countries analysed, the higher TCCpM numbers belong to Spain, Ireland, and Belgium, followed by Italy and Switzerland. The USA overtakes the European countries with the highest TCCpM numbers, the UK overtakes Italy, and the Sweden is found between Switzerland and Italy.\nΣ δ Λ medRχiv/2020 medRχiv/2020 13 . CC-BY 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted June 2, 2020. . https://doi.org/10.1101/2020.06.01.20119461 doi: medRxiv preprint 30) . Amongst the twelve European countries analysed, the higher TDpM numbers belong to Belgium, Spain, the UK and Italy. The Spain anomaly is due to the lower number of deaths at the day 125 (26837) with respect to the deaths at the day 124 (28752). These data are reported in all the web repositories [2, 11] . Amongst the South American countries, Ecuador shows the more critical situation followed by Peru and Brazil with practically the same number of deaths per million and very similar curves. for DDpM (β factor) calculated for twelve European countries and the USA when the countries reach a same TCCpM and TDpM. For the α factor, the number of Tests per Million should be considered as normalisation, but this number is not always available. The curves show a clear asymmetry. They allow to predict a final TCCpM greater than 5000 for Ireland, Spain, and Belgium, around 4000 for Italy, and UK, and around 2000 for Austria and Germany. For total deaths, the worst result is for Belgium (around 800), followed by Spain, UK, and Italy (around 600). The lower mortality rate belong to Austria and Germany.\nΣ δ Λ medRχiv/2020 medRχiv/2020 14 . CC-BY 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted June 2, 2020. CC-BY 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted June 2, 2020. . https://doi.org/10.1101/2020.06.01.20119461 doi: medRxiv preprint"}, {"section_title": "UK, and Italy", "text": "Before concluding this section, we would like to say a few words on the Venezuelan numbers, see the last row in Tab. 1. Its TDpM is of 0.5, the TCCpM of 51.4, and the TpC number is surprisingly of 669. Due to its crisis, Venezuela was isolated from the world even before the Covid-19 outbreak and was the first nation in South America to apply a strict lockdown. These facts could explain why the virus did not widely spread in Venezuela. With respect to the high number of tests, it is important to observe that they used a massive number of a rapid blood antibody test (coming from China and checking for proteins developing after someone is infected). Few nasal swab exams have been used by the local authorities. It is important to recall that only swab-test positives are added in the official statistics of confirmed cases. Including or not the antibodies tests also explains why, for example, the numbers of TCC for Spain in [2] , where the antibody tests are considered, and in [11] , where they are not, differ."}, {"section_title": "III. Weekly spreading rate III. Weekly spreading rate", "text": "In this section, we discuss the weekly spreading rate for DCCpM and DDpM. Before introducing what, for simplicity, we shall call α [20] and β factors, we first examine the comparison of the outbreak in different countries. We shall analyse, as illustrative example, two European countries, Germany and Italy, the USA, and the Brazil. In these countries, the outbreak did not start at the same time. So, we compare them with each other, when they reached the same number of TCCpM. Let us consider the moment in which they reached 10 TCCpM. This happened for Italy at the 27th of February (TCCpM of 10 In Fig. 3(a) , we plot the α factor for the twelve European countries and the USA. The weekly spreading rate of DCCpM shows its greatest values for Ireland and Spain (around 200 and 180, respectively), followed by Belgium and Switzerland (both around 130), with the first three countries closing their first wave of pandemic with a TCCpM around 5000. Italy and Germany show a maximum rate around 100 and 70, and a final TCCpM around 4000 and 2000, respectively. Looking at Fig. 4(a) all the European countries, with the exception of the Swedish case, present the same curves for their initial weekly spreading rate. In particular, the α factor of the USA followed, up to 1000 TCCpM, the same curve of Italy. So, why do the European countries show a different behaviour in the successive stages of the outbreak?\nThe answer once again comes from the testing strategy adopted by the local authorities. This can be seen by observing the previous tables. At the 27th of February, Italy, and, at the 15th of March, the USA reached 10.83 and 10.69 TCCpM, respectively, with an α factor of 3.63 for Italy and 2.81 for the USA. Due to the fact that at that moment Italy and the USA tested 200 and 120 inhabitants per million, we can say that they had in their initial stage a comparable behaviour. The plots in Fig. 3(a) as well the amplification done in Fig. 4(a) , do not contain the testing normalisation. So, the German curve is similar to the Italian and American ones. Nevertheless, looking at the last column, we immediately seen a great difference in the testing strategy of Germany (1490 TpM) with respect to Italy (200) and the USA (120) leading to a German \"relative\" α factor of CC-BY 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity."}, {"section_title": "IV. Skew-normal distributions IV. Skew-normal distributions", "text": "The normal distribution [21] is one of the most important probability distributions in Statistics because it fits many natural phenomena. It describes how the values of a variable are symmetrically distributed around its centre, µ, and shows how the probabilities for extreme values further away from the mean go rapidly to zero in both directions. It is also known as the Gaussian distribution and/or the bell curve. Normal distributions are often used to fit data because, in many cases, the average of data of a random variable with finite mean and variance, is itself a random variable whose distribution, as the number of data increases, converges to a normal distribution. Normal distributions have also been used to fit the Covid-19 pandemic curves. Nevertheless, their use led to misleading predictions regarding the end of the outbreak in many countries.\nTalking about forecasts, we always expect uncertainties but, clearly, we must try to minimize them so that our predictions can be as close as possible to reality. It is well known that the curves of the epidemiological models are asymmetric. So, why not use asymmetric distributions to fit the data? In particular, why do not use skew-normal distributions instead of the normal ones?\nIt is clear that before reaching the peak, normal distributions can be used to estimate the pandemic curves of DCCpM and DDpM. Indeed, eventual asymmetries can only be seen after a country reached its peak. But, to estimate the end of the outbreak, skew-normal distributions, as we shall see later, are fundamental to get the right answer. Skew-normal distributions contain an additional parameter (with respect to the normal ones) which measures the asymmetry of the curves, for a detailed review see [22] [23] [24] [25] [26] . A negative value of this parameter indicates that the left tail is longer (the peak is found at the left of µ) and a positive one indicates that the right tail is longer (the peak moves to the right of µ). In the figure, the blue line represents a Gaussian centred at µ = 0 and with standard deviation σ = 3. The red line is a skew normal distribution with a negative parameter, s = −2, and the green line represents a skew normal distribution with a positive parameter, s = 3. The explicit analytical formula of the skew probabilities density functions, used in this paper to fit the DCCpM and DDpM curves of the twelve European countries Σ δ Λ medRχiv/2020 medRχiv/2020 7 . CC-BY 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity."}, {"section_title": "VI. Conclusions VI. Conclusions", "text": "In this final section, after studying the Covid-19 outbreak, we begin by listing the steps we suggest to be followed:\nStep 1) The weekly spreading rate of the DCCpM (DDpM) as the countries reached the same number of TCCpM (TDpM) can be used to compare countries which are in a different stage of the outbreak, what we called α (β) factor;\nStep 2) Before reaching the peak, the dynamical (oscillatory) curve of the parameters to be fitted can be used to understand when such a curve crosses the critical line and tends to stabilise;\nStep 3) After reaching stabilisation, asymmetrical distributions have to be introduced to model the DCCpM and DDpM curves (we used the skew-normal ones).\nRemembering that herd immunity and low mortality are both fundamental keys in tackling the outbreak, we introduce a factor that could be used to easily compare countries. Observing that if two countries have the same number of TCCpM, the one with an higher number of TpC should have a lower number of infected people in its population with respect to the other, we introduce the following factor As shown in section II, the timely massive testing strategy of the German authorities make the great difference between Germany and Italy. Indeed, mitigation measures (such as physical distancing, contact tracing, restricting public gatherings, closing schools, and university) surely become more effective when a country adopts a timely and massive testing strategy, avoiding that asymptomatic people contribute to transmission and helping sick people to be treated in time before the disease gets worse. The quantitative impact of a massive testing strategy has been studied in [29] . Clearly, if a country has not enough tests, a random smart-testing strategy is required. By testing a much smaller number of randomly selected people per day, it is possible to obtain information on the local spreading rate [30] .\nLet us now calculate the ρ factor for some countries worldwide that have adopted a smart testing strategy and reduced the number of deaths per million of inhabitants. At the end of May [2] , we find It is important to recall that the ρ factor considers not only the mortality rate but also the immunization rate. It is clear that with an indiscriminate and strict lockdown, one will avoid deaths, but at the same time one will have a very low immunization when facing the second wave of pandemic.\nThe previous table is also useful to understand why the factor TpC is important. Considering South Africa and South Korea, we immediately see that they have practically the same mortality rate: 12/552 and 5/224, respectively. But the testing strategy of South Korea led to a number of tests 4 times the one of South Africa. Consequently, the number of infected people in South Africa is expected to be greater that one of South Korea by probably the same factor. This explains the final ratio of the ρ factor between South Africa and South Korea.\nIn the case of Italy, where a full national lockdown was applied on the beginning of March, we find for its regions the following numbers . CC-BY 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity."}]