[{"section_title": "Abstract", "text": "In December 2008, the World Health Organization (WHO) convened a consultation to discuss cut-points for waist circumference (WC). As part of that effort, this paper examines the impact of gender and age on WC. As WC is influenced by body weight, body composition and fat distribution, their associations with gender and age were reviewed. We also noted the relationships with sex hormones, parity and menopause. We then summarized data on gender, age and WC. This presentation is not intended to be comprehensive, but to provide an overview of the available research. There are large differences in body composition in men and women, with women having more body fat. Fat distribution also differs with gender, with men having a relatively more central distribution of fat. These differences begin early in life and become more apparent in puberty due to changes in sex hormone levels. In both, men and women, waist and waist-to-hip ratio increase with age. A large portion of this increase is driven by gains in body weight, but the increases observed are larger than those that would be predicted from increases in the body mass index alone, and increases in WC are seen with aging in the absence of weight gain. The current practice of using seperate waist cut-points by gender is appropriate. Although WC increases with age, so does the risk of many chronic diseases. An evaluation of the need for age-specific waist cut-points in adults would need to consider disease risk."}, {"section_title": "Introduction", "text": "In 1956, a French physician at the University of Marseille, Dr John Vague, published his observation on body shapes (Vague, 1956) . He observed greater upper body (android) fat among men and greater lower body fat (gynoid) among women; the obese were more android than the non-obese and older individuals were more android than younger persons. Since then, numerous researchers have confirmed and expanded on these early results and now the importance of fat distribution as a predictor of morbidity is well recognized.\nCurrently there is no universal agreement on the cut points to define a healthy waist circumference, and none of the common guidelines are age-specific. Waist circumference is one of the components of the Adult Treatment Panel III (ATP III) and the International Diabetes Federation (IDF) definitions of metabolic syndrome. These are the two most widely used definitions for metabolic syndrome, and waist circumference is the only component of the syndrome definitions with different cut points. The ATP III cut points are 88 cm in women and 102 cm in men, a 14-cm difference (Grundy et al., 2004) . This definition is most often used in the United States. The IDF metabolic syndrome definition uses both gender and ethnic group-specific cut points for waist circumference (International Diabetes Federation, 2006) . This definition takes into account research showing Asian populations have a lower mean BMI compared with European or American populations (Seidell et al., 2001) . In the IDF guidelines the waist circumference cut points are 80 cm for women (regardless of ethnic group), 90 cm for Asian men and 94 cm for European men. The IDF guidelines are most widely used outside the United States.\nIn December 2008, WHO convened a consultation to discuss cut-points for WC. One basic issue that needed to be addressed as part of this effort was the impact of gender and age. As WC is influenced by body weight, body composition and fat depot distribution, we first summarize the associations between these factors, and gender and age. Remarks are generally restricted to adults, and efforts were made to include information from geographically and ethnically diverse cohorts. We also note the relationships between sex hormones, parity and menopause, and characteristics of body composition. With that background, we then summarize data on gender and age and WC."}, {"section_title": "Body mass index (BMI)", "text": "BMI (weight (kg)/height (m) 2 ) is one of the most popular measures used to assess overweight and obesity. BMI does not separate fat mass from muscle mass, but nevertheless, is highly correlated with both adipose and muscle mass. The extent to which changes in BMI over time represent a physiological effect of aging versus a secular rise in overweight and obesity is unclear, and it is important to separate birth cohort effects from aging effects (Juhaeri et al., 2003) .\nData from multi-ethnic longitudinal studies support the association of fat gains with age. Mentioned below are present findings from three bi-ethnic cohorts, each of which includes a different age range. Results are presented beginning with the youngest cohort, followed by the middle-aged and oldest cohorts.\nIn the Coronary Artery Risk Development in Young Adults (CARDIA) study, a multi-center cohort of over 5000 individuals aged 18-30 years, participants gained an average of 2-4 kg/m 2 in BMI over 10 years of follow-up (Gunderson et al., 2004) . (Gunderson et al., 2004) .\nThe Atherosclerosis in Communities (ARIC) study provides comparable information but in an older cohort of 14 500 middle-aged adults aged 45-64 years (Juhaeri et al., 2003) . At 9 years, follow-up participants had gained an average of almost one BMI unit. As in the CARDIA study, gains in BMI were larger in the younger compared with the older members of the cohort and results differed by ethnic group (African American males: 0.5 kg/m 2 ; African American females: 0.9 kg/m 2 ; White males: 1.0 kg/m 2 and White females: Figure 1 (Kahn and Cheng, 2008) shows the relationship between age and BMI in the three studies combined (CARDIA, ARIC and CHS). To minimize the birth cohort effect, the authors selected data such that a similar range of calendar years was represented, with baseline data from 1990-1992. BMI change per year was estimated during follow-up periods that averaged between 2.9 and 5.0 years. BMI increased with age up until the seventh and eighth decades of life, but the average gains were largest in the younger individuals. The patterns were similar in White and African American males but varied in females, with younger African American women (mean age 29 years) having larger weight gains than White women in the same age category. This trend tended to be reversed in women at older ages (54-71 years). The authors caution that estimates of BMI change in African Americans in the category with a mean age of 79 years may be unstable because the number of participants in that category was p58.\nFew studies have examined longitudinal changes in weight and height in Asian cohorts. However, data are available from the Japan Public Health Center Study (JPHC) which included 65 095 men and women aged 40-69 years at baseline residing throughout Japan (Matsushita et al., 2008) . Weight and height were self-reported at baseline and after 5 and 10 years of follow-up. Over the 10-year follow-up, BMI increased less than 1 unit among 40-49-year olds and decreased by a similar amount among those 55 and older at baseline (Figure 2) (Matsushita et al., 2008 ). In summary, BMI tends to increase with age in young adults. This increasing trend extinguishes or is reversed at older ages. The age at which this change in trend is observed is dependent on the cohort studied. In a Japanese cohort, weight loss was observed after 60 years of age, whereas in biethnic American cohorts weight gains were observed up to 70 years of age. Trends differ in different ethnicities and in different nations and the impact of secular effects represented by calendar years are profound."}, {"section_title": "Muscle and fat mass", "text": "In a recent review by Wells (2007) , the author noted that gender differences in body composition are evident very early in life, and even in the fetal stage, but become much more pronounced during puberty. Girls enter puberty earlier and undergo a more rapid pubertal transition, whereas boys have a substantially longer growth period. Adult males have greater total lean and mineral mass, and a lower fat mass, than females, after adjusting for differences in height. 'Typical' levels of adipose tissue are 20-30% in women compared with 12-20% in men (Lohman, 1981) . These whole-body differences are accompanied by major differences in tissue distribution. Adult males have greater muscle mass, larger and stronger bones, and reduced limb fat. Females have a more peripheral distribution of fat in early adulthood. Sex differences in body composition are primarily attributable to the action of sex steroid hormones, which drive the dimorphisms during pubertal development. These sex differences continue throughout life, and most of the results are presented by gender.\nChanges in body weight are strongly related to changes in fat-free mass, and explain 54% of the variance in those changes (Forbes, 1999) . However, for more precise quantification of changes in adipose and lean mass, other measures must be used. As discussed previously, BMI tends to increase throughout the majority of adult life, and this is associated with increases in both fat mass and muscle mass. The association between BMI and body fat is linear, whereas the association with percent body fat is curvilinear, with the slope steeper at lower BMI values compared with higher BMI values (Welch and Sowers, 2000) . Therefore, BMI is a better proxy for kg of body fat than percent body fat. Studies that use more sensitive measures of body composition, such as dual energy X-ray absorptiometry (DEXA), magnetic resonance imaging and computed tomography, better quantify lean and fat depots, and subsequent changes that occur with weight change and aging.\nAlthough both men and women experience age-related declines in muscle mass, men typically experience greater declines than women. Gallagher et al. (1997) , conducted a cross-sectional study of skeletal muscle mass in 148 women (80 African American and 68 Caucasian) and 136 men (72 African American and 64 Caucasian) ages 19-85 years. Muscle mass was evaluated using DEXA and total body potassium. After controlling for body weight and stature, the investigators found a negative linear association between muscle mass and age in all the ethnic-gender groups. The decline in total appendicular skeletal muscle mass over five decades of age was 10.8% in women and 14.7% in men.\nAt older ages, although muscle mass is decreasing, fat mass is often increasing (Hughes et al., 2004) . Age-related changes in body composition may result in sarcopenia, a progressive process that occurs with normal aging (Figure 3 ) (Doherty, 2003) . It is characterized as a decline in muscle mass and muscle strength, resulting in a decline in physical function, disability as well as increased morbidity and mortality (Janssen et al., 2002) . Sacropenia has been defined as having an adjusted appendicular skeletal muscle mass (mass divided by height squared) that is more than two s.d. values below Age effect on BMI for each birth cohort was tested using a random effects model (*denotes Po0.05). Cohort effect on BMI for each age category was tested using the linear regression analysis ( w denotes Po0.05). Values for s.d. for BMI ranged between 2.6 and 3.3 for men and 2.9 and 3.7 for women. Reprinted by permission from Macmillan Publishers Ltd: Matsushita et al. (2008) .\nAssociations between gender, age and WC J Stevens et al the mean for a young healthy reference population. It is associated with atrophy of muscle fibers, which may occur due to a decline in a-motor neurons, growth hormone production, sex steroid levels and physical activity (Thomas, 2007) . By the seventh and eighth decade of life, it has been estimated that maximal voluntary contractile strength decreases by 20-40% in proximal and distal muscles in both sexes (Doherty, 2003) . The majority of strength loss can be attributed to a decrease in muscle mass, however, the age-associated decreases in strength per unit muscle mass, or muscle quality, may have a function (Doherty, 2003) . A variant of sarcopenia that has recently gained attention is sarcopenic obesity, which is a particular type of obesity found among older adults with excess fat mass but reduced muscle mass (Zamboni et al., 2005) . Individuals with this form of obesity have been defined as being in the upper two quintiles of body fat and in the lower three quintiles of muscle mass. An alternate definition is that of having a relative skeletal muscle index (muscle mass adjusted by height 2 ) that is less than two s.d. values below the sexspecific mean of a young group, combined with a percent body fat greater than the median value for each sex group. Sarcopenic obesity is an area of recent research, and more study needs to be done to determine the most appropriate defining characteristic, and the mechanism and consequences of the condition. It has been proposed that peptides (including leptin and tumor necrosis factor-a) produced by adipose tissue may be instrumental in the pathophysiology of this form of obesity (Zamboni et al., 2008) ."}, {"section_title": "Fat depots", "text": "In addition to changes in total body fat, the process of aging is associated with substantial redistribution of fat tissue among depots (Cartwright et al., 2007) . In a sample of 483 Caucasian adults from the United States and Canada total, at a given WC, visceral and subcutaneous fat differed by age and gender (Kuk et al., 2005) . Women (18-84 years) had 1.8 kg more abdominal subcutaneous adipose tissue for a given WC than men (Po0.05) (Kuk et al., 2005) . However, some gender differences decreased with increasing WC.\nRedistribution of fat from subcutaneous to visceral depots has been observed from late middle age until the ninth decade of life (Figure 4) (Cartwright et al., 2007) . Cartwright et al. (2007) noted that age-associated declines in sizes of adipose depots were accompanied by the accumulation of fat outside adipose tissue and loss of lean body mass. Owing to this, the proportion of body mass that is in fat depots may remain constant. However, fat accumulation occurs in bone marrow, muscle, liver and other sites, potentially contributing to an age-dependent dysfunction of these tissues. This accumulation may be related to the reduced capacity of pre-adipocytes to become fully functional mature adipocytes with age. (Enzi et al. (1986) studied subcutaneous and visceral fat depots in 130 subjects in Italy using computed tomography. Both men and women were studied in a wide range of ages from 20 to over 60 years. They found that the subcutaneousto-visceral-fat ratio in the abdominal area was lowest in the oldest age category of subjects (over 60 years Figure 3 Factors contributing to sarcopenia. This figure summarizes the influence of multiple factors that lead to age-associated declines in muscle mass and strength, and the subsequent impact on disability and loss of independence. This figure has been reproduced from Doherty (2003) and is used with permission from The American Physiological Society.\nAssociations between gender, age and WC J Stevens et al\nOn comparing the oldest with the youngest subjects, there was a greater amount of visceral fat in the older age groups. Compared with Caucasian populations, both Chinese and South Asians have more visceral and total adipose tissue at a specific WC (Lear et al., 2007) . Data from a multi-ethnic Canadian population suggested that visceral adipose tissue was underestimated in Asians when compared with a European population (Lear et al., 2007) . A WC of 90 cm in males and 80 cm in females, underestimated visceral adipose tissue by 12-24% in Chinese and 14-19% in South Asians."}, {"section_title": "Hormones, parity and menopause", "text": "Hormonal changes associated with aging include decreases in growth hormone secretion (Corpas et al., 1993; Harman and Blackman, 2004) , menopausal estrogen deficiency in women and diminished levels of total and bioavailable testosterone (Harman et al., 2001) in males. Longitudinal studies indicate that the reductions in free testosterone levels are associated with increases in fat mass and a reduction in muscle mass. The Massachusetts Male Ageing Study of 942 men aged 40-70 years reported an inverse association of total and free testosterone with BMI, WC and waist-to-hip ratio (Derby et al., 2006) . In addition, obesity was associated with greater age-related declines in testosterone and sex hormone binding globulin over 8-9 years of follow-up. Central adiposity (WC 4100 cm), but not BMI, was associated with greater declines in levels of dehydroepiandrosterone sulfate-a precursor for sex steroids.\nIn addition, studies in which androgenic males were given testosterone treatment showed gains in muscle mass and reduction of fat mass (Snyder et al., 1999; Vermeulen et al., 1999; Emmelot-Vonk et al., 2008) . The extent to which body composition improves may be influenced by a number of factors, including type of hormone administered, dosage, duration of treatment, and baseline hormone levels and body composition. In a recent trial, 60 non-obese Australian males aged 55 years or older were randomized to either transdermal testosterone patches or placebo for 52 weeks (Allan et al., 2008) . These males had total testosterone (TT) levels o15 nm and experienced symptoms of androgen deficiency, but were otherwise healthy. Results from magnetic resonance imaging and DEXA suggested testosterone therapy was associated with significantly (Po0.05) greater total body fat-free mass and skeletal muscle as well as reductions in visceral fat, relative to the placebo group.\nAmong women, parity and menopause present hormonal changes that have been associated with changes in body composition (Bjorkelund et al., 1996) . Cross-sectional analysis of data from the Third National Health and Nutrition Examination Survey (NHANES) III showed that after controlling for age and BMI, increasing parity was associated with lower hip and thigh circumferences and increased WC (Lassek and Gaulin, 2006) . Longitudinal data from the CARDIA study of 18-30 year old US Black and White women over 10 years of follow-up support these findings (Gunderson et al., 2004) . After adjustment for confounders, including physical activity, height and weight, normal weight and overweight women who had given birth (single or higher order) had a 1.9-6.2 cm greater (Po0.001) increase in WC compared with nulliparous women.\nIn a subsample of 122 women from CARDIA, further quantification of the amount and distribution of adipose associated with parity was explored through five years of follow-up (Gunderson et al., 2008) . Results from DEXA and computed tomography scans showed that pregnancy was associated with gains in visceral and central adiposity postpartum. Women who were non-gravid throughout the five-year follow-up period gained 9.2 cm 2 (4.8, 13.6), or 14%, visceral adipose tissue, whereas women who gave one birth experienced 27.1 cm 2 (14.5, 39.7), or 40%, gains in visceral adipose tissue. These estimates were adjusted for baseline characteristics, total body fat, age and race. Although women did not differ in mean weight gain, change in BMI or change in subcutaneous adipose tissue, single parity was associated with statistically significant 2.3 cm (0, 4.5), (P ¼ 0.05) greater increases in WC and 18.0 cm 2 (4.8, 31.2) greater increases in visceral adipose tissue. The authors concluded that postpregnancy, adipose tissue may preferentially accumulate in the visceral compartment (Gunderson et al., 2008) . Menopause, the life phase in which estrogenic declines occur in women, is associated with an increase in fat mass and a redistribution of fat to the abdominal area (Kotani et al., 1994; Hunter et al., 1996; Tchernof and Poehlman, 1998; Toth et al., 2000) . Yet controversy remains over whether these changes are a function of menopause or part of the aging process. The Study of Women's Health across the Nation (SWAN), an ethnically diverse cohort of 3064 women with an average age of 46 years, did not observe independent effects of menopause on fat distribution (Sternfeld et al., 2004) . In an initial study, the investigators used self-reported bleeding patterns to assess menopausal status and anthropometric measures to assess adiposity. Over the three-year follow-up, there was a mean weight gain of 2 kg and an increase in WC of 2 cm, which could be attributed to changes in age and physical activity level.\nA subset of 800 women from the SWAN cohort participated in a more intense study of body composition. Over six years during the menopausal transition, body composition was assessed using bioelectrical impedance. The mean increase in WC was 5.7 cm, and the mean increase in fat mass was 3.4 kg (10%). These changes in body composition were not associated with menopausal stage but were associated with ovarian aging (Sowers et al., 2007) . These findings are similar to those observed by other studies including the Healthy Women's Study, which suggested that, on average, women gain 0.7 kg per year during the fifth and sixth decades of life irrespective of menopausal status (Wing et al., 1991) .\nOne possible explanation for the discrepancy between studies of the impact of menopause on fat distribution may Associations between gender, age and WC J Stevens et al be the method of measurement (Toth et al., 2000) . Given that age-related changes in body fat are likely to be small, Toth et al. (2000) suggest that differences in the methods used to measure body fat may explain the lack of agreement between studies. They report that studies that used anthropometric measures (WC or waist-to-hip ratio) to define body fat did not observe an association between menopause and changes in body composition, whereas, studies that used DEXA generally observed an increased deposition of trunk fat in the post-menopause period (Ley et al., 1992; Snead et al., 1993; Svendsen et al., 1995; Panotopoulos et al., 1996; Tremollieres et al., 1996) . Studies that used even more sophisticated methods to distinguish localization of adiposity, such as computed tomography or magnetic resonance imaging, reported greater levels of intra-abdominal fat postmenopause (Zamboni et al., 1992; Kotani et al., 1994; Hunter et al., 1996; Toth et al., 2000) . The reviewers concluded that increases in intra-abdominal fat accumulation with menopause were independent of changes associated with age and total adiposity, and scanning methods are required to detect the changes (Toth et al., 2000) . In postmenopausal women, hormone replacement therapy has been shown to attenuate the accumulation of central fat and preserve lean body mass (Tchernof and Poehlman, 1998) . A two-year randomized control trial of 62 early postmenopausal Danish women, suggested estrogen-progestogen therapy was associated with significantly lesser accumulation of abdominal fat (subcutaneous and visceral fat) and a tendency towards greater maintenance of lean body mass (Haarbo et al., 1991) . Results using DEXA support an approximate 5.5% (Po0.05) greater increase in the percent abdominal fat among the placebo group compared with the estrogen-progestogen group (Haarbo et al., 1991) . Studies using other forms of hormone replacement in women have found similar results (Tchernof and Poehlman, 1998; Sorensen et al., 2001 ). In conclusion, fluctuations in lean and fat mass, and changes in body shape that occur with aging may be driven in part by hormones. Whether hormones determine body composition or whether changes in body composition result in hormonal flux is not always clear, as the interplay between hormone levels and body composition is complex and not fully understood. It is also important to note that effects of diet and exercise on body composition and shape may be mediated by hormones. Longitudinal studies have helped clarify some relationships, but more research is needed."}, {"section_title": "Gender, age and WC", "text": "The main purpose of this review is to examine associations between gender, age and WC to provide a greater understanding of these basic relations as background for determining recommendations for cut-points for WC. As we have noted, BMI and WC are highly correlated, and gender and age associations with BMI, body composition and fat depot distribution are all pertinent to WC. Although associated with other anthropometric measures, WC remains a simple and valid marker of abdominal and visceral fat. Waist circumference provides a highly feasible and inexpensive method to monitor body fat distribution and identify individuals at greater risk of disease in a variety of settings.\nBelow we review data that contrast WC among age and gender groups. Selected studies are presented to provide an overview of the available research and are not comprehensive. We first show cross-sectional studies. As previously noted cross sectional study designs mix aging and secular effects, and therefore must be interpreted with caution. In addition, some studies are adjusted for smoking and alcohol consumption, whereas others are not. Both smoking and alcohol consumption have been found to be independently associated with larger WCs in longitudinal study (Shimokata et al., 1989a; Balkau et al., 2007) . The cross-sectional studies are followed by results from longitudinal work. Values are reported by age group and gender; and for longitudinal data we include estimated annual change in WC. Annual change estimates assume a constant change in waist per year.\nThe cross-sectional data that arguably best represent WC in US adults is from the NHANES. These data have shown that WC is larger in males compared with females and larger in older adults compared with younger adults up to the age of 70 (Ford et al., 2003) . Findings from the 1999-2000 NHANES, showed mean WC in males, increased from 92 cm, among 20-29-year olds, to 105.4 cm among 60-69-year olds, a 13.4-cm difference. After 70 years of age, mean WC was slightly (À3 cm) lower at 102.4 cm. Within the same age range, estimates in women were 5.9-8.1 cm smaller compared with men. Mean female WC was 86.1, 97.4 and 94.3 cm in the 20-29, 60-69 and 70 years and above age groups, respectively. Although the trends in men and women were similar in respect to age, women had a smaller mean WC than men in every age category.\nTo facilitate gender comparisons across national groups, we examined results from diverse studies after matching the Ko et al. (1997) ; Wells et al. (2008) .\nAssociations between gender, age and WC J Stevens et al age ranges to approximately 30-40 years. National cross sectional studies in the US and UK showed that within the same weight categories (normal-weight, overweight and obese), 30-40-year-old men tend to have an approximate 6-cm larger mean WC than women of the same age ( Figure 5 ) (Ford et al., 2003; Wells et al., 2008) . Similar differences in WC between genders were observed in non-Caucasian populations. Data representative of the Hong Kong Chinese working population showed a 5.9-cm larger waist among men (mean age of 36.7 ± 0.3 years) compared with women (mean age of 38.6±0.4 years) (Ko et al., 1997) , and data from a Mexican population showed males (mean age 38.99 ± 7.1 years) had a 5.4-cm greater mean WC than females (mean age 39.1±14.3 years) (Berber et al., 2001) .\nEffects of aging on WC are best examined using longitudinal data, however, repeated measures that allow this type of analysis are not as common as cross-sectional studies. Below we summarize results from six longitudinal studies that examined changes in WC over time. We show changes in WC per year of aging in both men and women. The last three of these studies (Shimokata et al., 1989c; Stevens et al., 1991; Lahti-Koski et al., 2007) examined age-related changes in the context of weight changes by studying a cohort that had only small mean changes in weight (Lahti-Koski et al., 2007) , by estimating the changes in waist and weight change over time (Shimokata et al., 1989c) , or by statistically adjusting for changes in weight (Stevens et al., 1991) .\nThe West of Scotland Twenty-07 Study: Health in the Community included approximately 1000 people in each of two adult age cohorts, age 39 or age 59 (EbrahimiMameghani et al., 2008) . Subjects were interviewed in the baseline surveys in 1987-1988. The sample was representative of the target population in terms of sex, social class and car ownership. For both males and females, mean weight and WC change was positive and greater among the younger compared with the older age group (Po0.001). The mean change in WC was 5.46 cm per 9 years or 0.61 cm per year, and 3.74 cm per 9 years or 0.42 cm per year, for younger versus older men, respectively (Po0.001) and 6.78 cm per 9 years or 0.75 cm per year, and 4.39 cm per 9 years or 0.49 cm per year for younger versus older women, respectively (Po0.001) (Figure 6 ). Weight gain among the older cohort slowed down after 63 years of age. Although non-significant, the difference between baseline and the 9-year follow-up visit was larger in females for waist circumference but larger in males for weight.\nThe Insulin Resistance Atherosclerosis Study (IRAS) was a multicenter study on the relation of insulin and insulin resistance to atherosclerosis and its risk factors among Hispanic, non-Hispanic White and African American men and women (Mayer-Davis et al., 2003) . Participants, aged 40-69 years at baseline, were enrolled from four US clinical centers. This multicenter study included 1313 men and women aged 40-69 during the 1992-94 baseline data collection. Among subjects who were normo-glycemic, the mean (s.d.) 5-year increase in WC when controlling for BMI and weight was 2.9 cm (5.0) and 2.0 kg (6.0), respectively. This translates to a 0.58-cm increase in WC per year.\nThe Data from an Epidemiological Study on the Insulin Resistance Syndrome (DESIR) study of 1868 men and 1939 women aged 30-64 years at baseline show median increase in waist of 3 cm per 9 years or 0.33 cm per year in males, and 4 cm per 9 years or 0.44 cm per year in females (Balkau et al., 2007) . A gain in WC greater than or equal to 7 cm was observed in 25% of males and 34% of females. Reductions in WC (X3 cm) occurred in 14% of the sample. Waist decline in men was associated with a decrease in alcohol intake, older age and larger waist at baseline.\nA large Finnish study examined WC in a population in which BMI remained relatively stable between 1987 (Lahti-Koski et al., 2007 . Data were from 9025 men and 9950 women aged 25-64 years who participated in three cross-sectional surveys. Mean WC increased by 2.7 cm over 15 years or 0.18 cm per year in men and 4.3 cm over 15 years or 0.29 cm per year in women. BMI did increase over the study period, but changes were relatively small (1.2% or less per 5-year period) in all but the youngest age category (25-34 years). Waist circumference increased in every age group.\nThe Baltimore Longitudinal Study of Aging examined associations between waist and hip circumferences, and gender, age and BMI over time. Waist-to-hip ratio was larger with increasing BMI and age in both men and women (Shimokata et al., 1989b) . However, changes in waist and hip with changes in weight differed by gender (Shimokata et al., 1989b) . In three age groups of men and women followed over 5 years waist changes were larger than hip changes in men, whereas in women they were similar. On average, with a 4.54-kg weight gain, men had a 4.1-cm increase in waist and 2.5-cm increase in hip. Comparable values for women were 3.3 cm and 3.6 cm. These changes resulted in weight change in men having a larger effect on waist-to-hip ratio than in women, and waist-to-hip ratio increased by 0. Associations between gender, age and WC J Stevens et al in men (Po0.05), whereas the smaller increase of 0.0021 in women was not statistically significant. We used data from the Charleston Heart Study to conduct what was, to our knowledge, the first study to separate the effects of aging on waist changes from those of BMI (Stevens et al., 1991) . Baseline data for the Charleston Heart Study were collected in 1960 in White and Black men and women with a mean age of 48 years. Weight and abdominal circumference were measured over a 25-year interval. The younger subjects (37-46 years) gained weight, whereas the older subjects (55-74 years) lost weight over the long follow-up period. Nevertheless, subjects of all ages increased in mean abdominal girth. Statistical modeling showed that with no change in BMI, estimated increases in abdominal circumferences ranged from 2.8 to 7.5 cm over 25 years or 0.11 to 0.3 cm per year in the four ethnic-gender groups examined."}, {"section_title": "Conclusions", "text": "There are large differences in body composition in men and women, with women having higher levels of percent body fat. Fat distribution also differs by gender, with men having a relatively more central distribution of fat. These differences strongly manifest in puberty and are related to sex hormones. In both men and women, waist and waistto-hip ratio increase with aging. A large portion of this increase is driven by gains in body weight, but the increases observed are larger than those would be predicted from increases in BMI alone, and increases in WC are seen with aging in the absence of weight gain. Younger adults tend to experience greater gains in waist than older adults, probably due to greater weight gains during young adulthood. With weight gain, WC and waist-to-hip ratio increase, but men have larger increases in WC with weight gain than women.\nDifferences in waist between adult men and women are seen at all ages and levels of fatness. The current practice of using different waist cut-points for men and women seems justified. Age-related differences in the association of WC with body composition may support the establishment of cut-points that vary by age; however, to fully address this need, examination of the risk associated with specific WC values by age will be required. Without this type of analysis, the need for age-specific cutoff for WC cannot be known, as both WC and risk of several chronic diseases increase with age. In addition, the use of different cut-points for different age groups would impair one of the major strengths that WCs offer as an indicator of disease risk: simplicity."}]