[{"section_title": "Abstract", "text": "for the Alzheimer's Disease Neuroimaging Initiative IMPORTANCE The use of anticholinergic (AC) medication is linked to cognitive impairment and an increased risk of dementia. To our knowledge, this is the first study to investigate the association between AC medication use and neuroimaging biomarkers of brain metabolism and atrophy as a proxy for understanding the underlying biology of the clinical effects of AC medications.\nOBJECTIVE To assess the association between AC medication use and cognition, glucose metabolism, and brain atrophy in cognitively normal older adults from the Alzheimer's Disease Neuroimaging Initiative (ADNI) and the Indiana Memory and Aging Study (IMAS).\nThe ADNI and IMAS are longitudinal studies with cognitive, neuroimaging, and other data collected at regular intervals in clinical and academic research settings. For the participants in the ADNI, visits are repeated 3, 6, and 12 months after the baseline visit and then annually. For the participants in the IMAS, visits are repeated every 18 months after the baseline visit (402 cognitively normal older adults in the ADNI and 49 cognitively normal older adults in the IMAS were included in the present analysis). Participants were either taking (hereafter referred to as the AC + participants [52 from the ADNI and 8 from the IMAS]) or not taking (hereafter referred to as the AC − participants [350 from the ADNI and 41 from the IMAS]) at least 1 medication with medium or high AC activity. Data analysis for this study was performed in November 2015.\nMAIN OUTCOMES AND MEASURES Cognitive scores, mean fludeoxyglucose F 18 standardized uptake value ratio (participants from the ADNI only), and brain atrophy measures from structural magnetic resonance imaging were compared between AC + participants and AC − participants after adjusting for potential confounders. The total AC burden score was calculated and was related to target measures. The association of AC use and longitudinal clinical decline (mean [SD] follow-up period, 32.1 [24.7] months [range, 6-108 months]) was examined using Cox regression.\nThe 52 AC + participants (mean [SD] age, 73.3 [6.6] years) from the ADNI showed lower mean scores on Weschler Memory Scale-Revised Logical Memory Immediate Recall (raw mean scores: 13.27 for AC + participants and 14.16 for AC − participants; P = .04) and the Trail Making Test Part B (raw mean scores: 97.85 seconds for AC + participants and 82.61 seconds for AC − participants; P = .04) and a lower executive function composite score (raw mean scores: 0.58 for AC + participants and 0.78 for AC − participants; P = .04) than the 350 AC − participants (mean [SD] age, 73.3 [5.8] years) from the ADNI. Reduced total cortical volume and temporal lobe cortical thickness and greater lateral ventricle and inferior lateral ventricle volumes were seen in the AC + participants relative to the AC − participants.\nCONCLUSIONS AND RELEVANCE The use of AC medication was associated with increased brain atrophy and dysfunction and clinical decline. Thus, use of AC medication among older adults should likely be discouraged if alternative therapies are available.\nQuestion Is use of anticholinergic medication associated with poorer cognition, brain hypometabolism, brain atrophy, and/or increased risk of clinical decline in cognitively normal older adults?\nFindings In this longitudinal study of 2 cohorts of cognitively normal older adults, use of medications with medium or high anticholinergic activity was associated with poorer memory and executive function, brain hypometabolism, brain atrophy, and increased risk of clinical conversion to cognitive impairment. This finding was greatest for those taking drugs with the most anticholinergic activity.\nMeaning Use of medication with significant anticholinergic activity should likely be discouraged in older adults if alternative therapies are available. E11 48. Carroll JC, Iba M, Bangasser DA, et al. Chronic stress exacerbates tau pathology, neurodegeneration, and cognitive performance through a corticotropin-releasing factor receptor-dependent mechanism in a transgenic mouse model of tauopathy."}, {"section_title": "", "text": "A nticholinergic (AC) medications have been linked to impaired cognition 1-16 primarily in nondemented older adults 10, 17 and an increased risk for cognitive impairment and dementia in older adults. 1, 3, 4, [18] [19] [20] The biological basis for the cognitive effects of AC medications is unknown. However, given the importance of the cholinergic system in cognition, researchers speculate that direct impairment of cholinergic neurons may underlie these effects. In fact, previous studies 21, 22 using scopolamine hydrobromide, a cholinergic antagonist, have shown transient cognitive impairment in young and older adults. A recent study 23 suggested that administration of AC medications modulates the association between brain volume and cognition. However, to our knowledge, no studies have examined the effects of regular AC medication use on neuroimaging measures of brain structure and function in cognitively normal (CN) older adults.\nThe goal of the present study was to assess AC medication use in CN older adults from the Alzheimer's Disease Neuroimaging Initiative (ADNI). In particular, we sought to evaluate whether cognitive performance, brain glucose hypometabolism, structural brain atrophy, and clinical progression to mild cognitive impairment (MCI) and/or Alzheimer disease (AD) were associated with the use of AC medication. We also completed a similar analysis in an independent cohort of CN older adults from the Indiana Memory and Aging Study (IMAS). We hypothesized that participants taking AC medications (hereafter referred to as AC + participants) would show poorer cognition, reduced glucose metabolism, brain atrophy, and increased clinical decline relative to those not taking AC medications (hereafter referred to as AC − participants) and that these effects would be greatest in those with the highest total AC burden score."}, {"section_title": "Methods", "text": ""}, {"section_title": "Alzheimer's Disease Neuroimaging Initiative", "text": "Data used in the preparation of this article were obtained from the ADNI (http://adni.loni.usc.edu; for more information, see the eAppendix in the Supplement, http://www.adni-info.org, and previous reports [24] [25] [26] [27] [28] [29] ). Written informed consent was obtained according to the Declaration of Helsinki. 30"}, {"section_title": "Indiana Memory and Aging Study", "text": "The IMAS includes CN participants, participants with subjective cognitive decline, participants with MCI, and participants with AD, but only data from CN participants and participants with subjective cognitive decline were used for this analysis. Participants provided written informed consent according to the Declaration of Helsinki, 30 and the procedures were approved by the Indiana University Committee for the Protection of Human Subjects."}, {"section_title": "AC Medications", "text": "Medication logs from the ADNI and the IMAS were manually curated to identify medications with low, medium, or high AC effects as defined by the Anticholinergic Cognitive Burden (ACB) scale and other reports. 18, [31] [32] [33] See eTable 1 in the Supplement for all medications identified. To be defined as an AC + participant, participants had to have been taking the medication at the baseline visit for a minimum of 1 month. The total AC burden score was also calculated using the ACB scale, which uses the literature to guide an expert-based determination of the adverse cognitive AC activities (low effect = 1, medium effect = 2, and high effect = 3). The total AC burden score was the sum of ACB scores of all applicable medications taken by a participant. 4, 6, 8 See eTable 2 in the Supplement for medications included in calculating the total AC burden score."}, {"section_title": "Participants", "text": "A total of 402 CN participants from ADNI 1, ADNI Grand Opportunity, and ADNI 2, including 301 CN participants without significant memory concerns and 101 CN participants with significant memory concerns, were included in the present analysis. A diagnosis was made as previously described 34, 35 and as in the ADNI 2 manual (http://www.adni-info.org/Scientists /doc/ADNI2_Procedures_Manual_20130624.pdf). Participants were divided by AC medication use into those taking 1 or more medications with medium or high AC activity (AC + participants) and those not taking any such medications (AC − participants), resulting in 52 AC + participants and 350 AC − participants. There was no significant difference in the rates of AC use between CN participants with significant memory concerns and those without, nor was there a significant effect of diagnosis (with or without significant memory concerns) or of the interaction between diagnosis and AC use on clinical progression.\nThe CN participants with or without subjective cognitive decline from the IMAS were also evaluated as an independent replication sample. Participants were CN if they had normal cognition relative to demographically adjusted norms and no significant self-or informant-based cognitive complaints. Participants had subjective cognitive decline if they had normal cognition and self-and/or informant-based complaints. From the IMAS, there were 8 AC + participants and 41 AC − participants."}, {"section_title": "Cognitive Testing", "text": "The ADNI participants underwent a comprehensive cognitive and clinical battery. We assessed the effect of AC use on executive function (Trail Making Test Part B [TMT-B], a composite executive function score 36 ) and memory (Weschler Memory Scale-Revised Logical Memory Immediate and Delayed, a composite memory score 37 ) .\nParticipants from the IMAS received a battery of neuropsychological tests and cognitive concern questionnaires, most of which have been previously described. 38 After preadjusting for age, sex, and education, combined z scores (relative to the complete IMAS CN group) were generated for 3 domains: executive function, memory, and general cognition. We then assessed the effect of AC use on the z scores of these 3 domains."}, {"section_title": "Fluorodeoxyglucose F 18 Positron Emission Tomography", "text": "Preprocessed fluorodeoxyglucose F 18-positron emission tomographic (FDG-PET) scans (coregistered, averaged, standardized image and voxel size, and uniform resolution) were downloaded from the ADNI Laboratory of Neuroimaging (LONI) site (http://adni.loni.usc.edu) and processed as previously described. 25, 34 Mean standardized uptake value ratios (SUVRs) were extracted from 2 regions of interest, including a bilateral hippocampal region of interest 39 and an overall cortical region of interest representing regions where CN participants show greater glucose metabolism than participants with AD from the full ADNI 1 cohort. Seventythree participants were excluded from FDG-PET analyses for missing data. The IMAS participants did not undergo FDG PET."}, {"section_title": "Structural Magnetic Resonance Imaging", "text": "Baseline structural 3-T magnetic resonance imaging (MRI) scans were downloaded from LONI for ADNI 2 participants; ADNI 1 participants were excluded because their scans were collected on 1.5-T scanners using a different protocol. Scans were corrected prior to downloading as previously described. 24 After downloading, we processed the scans using FreeSurfer version 5.1 34, 35 to extract target measures of atrophy selected for known relevance in cognitive function and AD (temporal lobe, ventricle volume, and total cortex). If 2 MRI scans were available, the values from both scans were averaged. A total of 116 ADNI participants were excluded from this analysis owing to missing data. The IMAS participants underwent structural magnetization-prepared rapid acquisition gradient-echo scans on a Siemens 3T Tim Trio using the ADNI sequence. Similar to ADNI, scans were processed using FreeSurfer version 5.1 to extract the same atrophy measures. Two participants were excluded owing to missing data."}, {"section_title": "Confounding Effects of Medical History and Medication Use", "text": "Because the observed effects may potentially be caused by overall morbidity in AC + participants, we evaluated the effect of the total number of medications, the total number of common comorbid conditions, and the presence or absence of each comorbid condition. The comorbid conditions tested included transient ischemic attack, myocardial infarction, cardiac surgery, hypertension, hyperlipidemia, diabetes, sleep apnea, other vascular disorders, insomnia, depression, anxiety, attention-deficit/hyperactivity disorder, and other psychiatric disorders. First, we determined whether there was a difference between AC + participants and AC − participants regarding medical history and medication use (Table) . Next, we determined whether these variables were associated with the outcome variables. Finally, we included those variables that were either different between AC + participants and AC − participants or associated with an outcome in the general linear model assessing the effect of AC medication use on cognitive and imaging measures. Only those that were significant within the final general linear model were included (covariates reported in the Results). Furthermore, we randomly selected samples matched on medical history variables (52 AC − participants and 52 AC + participants) and ran similar analyses."}, {"section_title": "Statistical Analysis", "text": "In the ADNI, cross-sectional measures of cognitive performance, glucose metabolism, and brain atrophy were compared between AC + participants and AC − participants using a general linear model preadjusted for age, sex, and Aβ positivity (yes/no; defined using previously established cutoffs on either cerebrospinal fluid sample [Aβ1-42 < 192 mg/mL] 40 or cortical florbetapir F-18 SUVR [SUVR≥1.1], 41 years of education [included in analyses of cognitive variables only], and total intracranial volume [included in analyses of MRI variables only] using the residuals of a linear regression model). After checking normality, we determined that the TMT-B score, the FDG SUVR in the cortical region of interest, and the inferior lateral ventricle and lateral ventricle volumes were skewed. Using log transformations, we normalized the TMT-B scores and FDG SUVR in the overall cortical region-of-interest variables, while the ventricular volumes were normalized using a square root transformation. These transformed variables were used in the statistical analyses to test the effect of AC medication use. All other variables were normally distributed, so untransformed values are reported. The statistical threshold for significance was set at P < .05.\nAssociations between the total AC burden score and cognitive performance, glucose metabolism, and brain atrophy measures were evaluated using Spearman correlation models. Target cognitive and imaging variables were preadjusted for age, sex, Aβ positivity, education, medical history variables (see Results), and total intracranial volume as appropriate.\nFinally, a Cox regression model was used to determine whether AC medication use was associated with clinical progression from CN to MCI and/or AD in the ADNI cohort (mean [SD] follow-up period, 32.1 [24.7] months [range, 6-108 months]), covaried for age, sex, medical history variables (see Results), and Aβ positivity. We also looked at the interaction of AC medication use and Aβ positivity on clinical progression.\nCognitive performance and brain atrophy measures were compared between AC + participants and AC − participants in the IMAS to replicate the results observed in the ADNI. All measures showed a normal distribution. A general linear model was used to assess the effect of AC medication use in the IMAS, covaried for age, sex, education, and total intracranial volume as appropriate. Associations between the total AC burden score and cognitive performance and brain atrophy measures were also evaluated using Spearman correlation models. No medical history variables were found to be significant covariates in the IMAS."}, {"section_title": "Results", "text": ""}, {"section_title": "Cognitive Performance", "text": "No significant differences in age, sex, education, ethnicity/ race, or APOE ε4 genotype were observed between AC + partici-pants and AC − participants in either sample (Table; see eTable  3 in the Supplement for the demographic characteristics of the IMAS participants). Of the medical variables examined, only the total number of medications, the total number of comorbid conditions, anxiety, and depression were different between AC + participants and AC − participants (P < .05). Significant effects of AC Figure 1A ]), the mean TMT-B score (raw mean scores: 97.85 seconds for AC + participants and 82.61 seconds for AC − participants; P = .04 [ Figure 1B ], with transient ischemic attack as an additional covariate), and the mean composite executive function score (raw mean scores: 0.58 for AC + participants and 0.78 for AC − participants; P = .04 [ Figure 1C ], with transient ischemic attack, myocardial infarction, and diabetes as additional covariates) were found, with AC + participants showing lower scores than AC − participants. The mean Logical Memory-Delayed Memory score (raw mean scores: 12.40 for AC + participants and 13.24 for AC − participants; P = .07) and the mean memory composite score (raw mean scores: 0.85 for AC + participants and 0.93 for AC − participants; P = .11 [data not shown]) trended toward significance, with AC + participants showing lower scores than AC − participants. In the IMAS, the general mean cognition z score was significantly reduced for the AC + participants relative to the AC − participants (raw mean scores: −1.27 for AC + participants and −0.34 for AC − participants; P = .03 [eFigure 1 in the Supplement])."}, {"section_title": "FDG Positron Emission Tomography", "text": "Differences in glucose metabolism between AC + participants and AC − participants were observed, with the AC + participants showing reduced glucose metabolism in the hippocampus (raw mean values: 1.06 for the AC + participants and 1.08 for AC − participants; P = .02 [ Figure 1D ], with anxiety as an additional covariate) and the global FDG-PET region of interest (raw mean values: 1.48 for AC + participants and 1.52 for AC − participants; P = .03 [ Figure 1E ], with concussion and other vascular diseases as additional covariates) relative to AC − participants."}, {"section_title": "Structural MRI", "text": "A significant effect of AC medication use on brain structure was also observed. The AC + participants demonstrated reduced total cortical volume (raw mean values: 406134.21 mm 3 for AC + participants and 423107.01 mm 3 for AC − participants; P = .02 [ Figure 2A] ) and larger lateral ventricle (raw mean values: 17880.19 mm 3 for AC + participants and 15620.22 mm 3 for AC − participants; P = .01 [ Figure 2B ]) and inferior lateral ventricle volumes (raw mean values: 757.25 mm 3 for AC + participants and 571.49 mm 3 for AC − participants; P < .001 [ Figure 2C ]) relative to the AC − participants. Regional effects were also observed in the temporal lobe, with AC + participants showing a reduced temporal lobe cortical thickness (raw mean values: 2.80 mm for AC + participants and 2.84 mm for AC − participants; P = .02 [ Figure 2D ], with concussion as an additional covariate) and a reduced medial temporal lobe (MTL) cortical thickness (raw mean values: 3.10 mm for AC + participants and 3.15 mm for AC − participants; P = .02 [ Figure 2E ], with concussion and cardiac surgery as additional covariates) relative to AC − participants. "}, {"section_title": "Association of Total AC Burden Score With Cognition and Brain Atrophy", "text": "Significant associations of the total AC burden score with cognition and brain atrophy were observed. Specifically, a higher total AC burden score was associated with a poorer TMT-B per- ). Glucose hypometabolism, as measured by the fluorodeoxyglucose F 18-positron emission tomographic (FDG-PET) standardized uptake value ratio (SUVR), was also observed in the bilateral hippocampus (P = .02, with anxiety as an additional covariate [D] ) and in a global cortical region of interest of AC + participants (n = 43) relative to AC − participants (n = 286), generated from an analysis of cognitively normal participants who show greater glucose metabolism than participants with AD from the full ADNI 1 cohort (P = .03, with other vascular conditions and concussion as additional covariates [E]). Error bars indicate SD.\nformance (r = 0.137; P = .01 [ Figure 3A] , with transient ischemic attack and total number of medications additional as covariates) and greater inferior lateral ventricle (r = 0.126; P = .03 [ Figure 3B ]) and lateral ventricle volumes (r = 0.154; P = .01 [ Figure 3C ]). The inferior lateral ventricle volume remained significantly associated with the total AC burden score after excluding participants with a total AC burden score of 0 (r = 0.331; P < .001 [ Figure 3E ]). The TMT-B score (r = 0.146; P = .06 [ Figure 3D ]) and the lateral ventricle volume (r = 0.152; P = .10 [ Figure 3F ]) showed nonsignificant trend associations with the total AC burden score after excluding those participants with a total AC burden score of 0. In the IMAS, the pattern of results was similar, although mostly nonsignificant trends were observed owing to attenuated power. Specifically, a higher total AC burden score was associated with reduced general cognition and atrophy (eFigure 3 in the Supplement). A trend for a negative association between the total AC burden score and general cognition across all participants (r = −0.239; P = .10 [eFigure 3A in the Supplement]) was observed, which was significant after excluding those with a total AC burden score of 0 (r = −0.625; P = .004 [eFigure 3C in the Supplement]). A negative association was observed between the total AC burden score and MTL cortical thickness (r = −0.313; P = .03 [eFigure 3B in the Supplement]), which only trended toward significant after excluding those with a total AC burden score of 0 (r = −0.428; P = .07 [eFigure 3D in the Supplement])."}, {"section_title": "Association of AC Use With Future Progression", "text": "A significant association between AC medication use and future progression of ADNI participants to MCI and/or AD was observed (P = .01; hazard ratio, 2.47 [ Figure 4A ]; with total number of medications, cardiac surgery, total number of comorbid conditions, and other psychiatric conditions as additional covariates). After evaluating the interaction between AC medication use and Aβ positivity, we observed that AC + participants who are Aβ positive showed the highest risk of conversion relative to AC − participants who are Aβ negative (P < .001; hazard ratio, 7.73 [ Figure 4B ]; with cardiac surgery and other psychiatric conditions as additional covariates) or those who are positive for either AC medication use or Aβ (P = .001; hazard ratio, 4.24 [ Figure 4B] )."}, {"section_title": "Matched Sample", "text": "In the matched sample, the AC + participants showed reduced total cortex volumes (raw mean values: 406134.21 mm 3 for AC + participants and 417770.60 mm 3 for AC − participants; P = .01), increased inferior lateral ventricle volumes (raw mean values: 757.25 mm 3 for AC + participants and 583.62 mm 3 for AC − participants; P = .02), and an increased likelihood for clinical conversion (P = .01; hazard ratio, 3.87 [data not shown]) compared with the AC − participants. The AC + participants also showed a trend toward poorer Logical Memory-Immediate performance (raw mean values: 13.27 for AC + participants and 14.42 for AC − participants; P = .08) and increased lateral ventricle volumes (raw mean values: 17880.19 mm 3 for AC + participants and 15164.28 mm 3 for AC − participants; P = .10 [data not shown]) compared with the AC − participants."}, {"section_title": "Discussion", "text": "Use of medications with medium or high AC effects in the ADNI cohort was associated with poorer cognition (particularly in immediate memory recall and executive function), reduced glucose metabolism, whole-brain and temporal lobe atrophy, and clinical decline. The effect appeared additive because an increased burden of AC medications was associated with poorer executive function and increased brain atrophy. Similar effects were seen in an independent cohort of older adults. These results suggest that medications with AC properties may be detrimental to brain structure and function, as well as cognition. The observed findings support previous reports 1- 16 regarding the association between AC medication use and cognitive impairments, with a significant effect of AC medication use on executive and immediate, rather than delayed, memory. We also found that the increased clinical progression from CN to MCI and/or AD was associated with AC medication use.\nThis study is one of the first, to our knowledge, to examine in vivo brain structural and functional differences between CN participants taking medications with medium or high AC activity and CN participants not taking these medications. We observed that AC + participants had reduced brain glucose metabolism and increased brain atrophy compared with AC − participants. Furthermore, those with the highest total AC burden scores showed the most atrophy.\nThe increased brain atrophy and decreased brain function that we observed may be linked to the central effects of AC medications on cholinergic pathways within the brain. Cholinergic pathways, especially those extending from the basal fore-brain, are important for cognition. 42 Studies have suggested that AC medications may affect cognition by altering cholinergic inputs, with a study 23 showing that AC medication administration leads to an uncoupling between brain structure and cognition in older adults. The process by which AC medications might lead to neurodegeneration is less clear. Cholinergic receptor antagonists have been shown to induce cell death, 43 while increased cholinergic neurotransmission reduces neurodegeneration in an AD mouse model. 44 Decreased cholinergic activity due to AC medications may induce synaptic loss and neurodegeneration in regions with significant cholinergic innervation, namely the MTL and cortex. 45 In mice, lesioning or damaging cholinergic neurons in the basal forebrain has been shown to cause degeneration of the septal-hippocampal and basalo-cortical projections and neurons in the hippocampus and cortex. 46 Another possibility is that participants taking AC medications may be more sensitive to neuronal damage in response to stress. This hypothesis centers around the interaction of cholinergic systems and stress because MTL cholinergic neurons have been shown to regulate the hypothalamic-pituitary-adrenal axis. 47 Reduced cholinergic ac- The total AC burden score was significantly associated with both cognition and brain atrophy. Specifically, a higher total AC burden score was associated with poorer performance on the Trail Making Test was still significantly associated with the total AC burden score after excluding participants with a total AC burden score of 0 (r = 0.331; P < .001 [E] ). The TMT-B score (r = 0.146; P = .06 [D] ) and lateral ventricle volume showed nonsignificant trend associations with the total AC burden score after excluding those with a total AC burden score of 0 (r = 0.152; P = .10 [F]).\ntivity has been linked to increased plasma corticosterone levels, which in turn are linked to increased hippocampal cell death. 47 Furthermore, chronic stress has been associated with increased Aβ levels, tau hyperphosphorylation and aggregation, and neurodegeneration in mouse models through dysregulation of the hypothalamic-pituitary-adrenal axis. 48 Overall, the findings in this study provide a potential biological basis for the reduced cognition associated with the use AC medications through the functional and structural changes in the brain. However, future longitudinal studies with imaging and other brain biomarkers, as well as in animal models, are needed to more fully understand the mechanism underlying the effect of AC medications on the brain.\nThere are a few notable limitations to this study. First, the information on medication use was based on self-report rather than directly ascertained through medical/prescription records. Self-report could be inaccurate because participants may forget to report specific medication use. However, given the normal cognitive status of the participants at baseline, it is unlikely that they would have reported taking medications that they were, in fact, not taking. Thus, the observed effect is potentially underestimated because some AC − participants may in fact have been taking an AC medication. Future studies using medical/ pharmacy records, along with imaging and biomarker measures, would help to confirm the findings of the present study.\nA second limitation is the relatively small sample size of AC + participants. Future studies using larger samples are warranted. A third limitation is the inability to determine the cau-sality of the findings because the results may be due to poor health rather than AC medication use. 49 We did include common comorbid health conditions (eg, vascular and psychiatric conditions), total number of medications, and total number of comorbid conditions as covariates. However, the only way to determine true causality would be by use of a wellcontrolled prospective longitudinal study.\nAnother limitation may be the variability in the duration of AC medication use among participants. Furthermore, a participant who had taken an AC medication for many years but ceased shortly before the baseline visit would not be captured as an AC + participant. Future studies with a better-controlled medication history assessment (ie, using medical/pharmacy records and patient self-report) are warranted, as well as studies on the effect of the duration of AC medication use on the target outcomes. Finally, only structural MRI and FDG PET were assessed in the present report. Future studies examining changes on more advanced imaging measures (ie, diffusion tensor imaging and resting-state or task-based functional MRI) would provide additional evidence about the selective effect of AC medications on the brain structure and function in specific circuits."}, {"section_title": "Conclusions", "text": "In summary, we observed that CN older adults taking medications with medium or high AC activity showed poorer cognition, reduced cerebral glucose metabolism, increased A, A significant association between AC use and future progression of Alzheimer's Disease Neuroimaging Initiative participants to mild cognitive impairment and/or Alzheimer disease was observed (P = .01; hazard ratio [HR], 2.47; with total number of medications, cardiac surgery, total number of comorbid conditions, and other psychiatric conditions as additional covariates). B, When evaluating the interaction between AC use and Aβ positivity, we found that participants taking 1 or more medications with medium or high AC activity who are positive for Aβ on florbetapir F-18-positron emission tomographic (PET) scans or cerebrospinal fluid (CSF) samples (referred to as AC + and Aβ + participants) showed a higher risk of conversion relative to participants not taking these medications who are negative for Aβ on florbetapir F-18-PET scans or CSF samples (referred to as AC − and Aβ − participants) (P < .001; HR, 7.73; with cardiac surgery and other psychiatric conditions as additional covariates) and participants who are positive for either AC use or Aβ (P = .001; HR, 4.24).\nbrain atrophy, and increased clinical decline compared with those not taking these medications and that these symptoms were greatest in CN older adults with the highest total AC burden scores. These findings highlight the importance of considering the cognitive adverse effects of AC medications before using them to treat older adults at risk for cognitive decline in a clinical setting, as well as in therapeutic trials. Role of the Funder/Sponsor: The funding sources had no role in the design and conduct of the study; collection, management, analysis, and interpretation of the data; preparation, review, or approval of the manuscript; and decision to submit the manuscript for publication."}]