[{"section_title": "", "text": ""}, {"section_title": "Foreword", "text": "To ensure the success of President Bush's education initiative \"No Child Left Behind,\" highquality postsecondary educational opportunities must be available to all students. In keeping with this goal, the Federal TRIO Programs provide outreach and support programs to assist low-income, fi rst-generation college students in progressing through the academic pipeline from middle school to postbaccalaureate programs. On behalf of the Federal TRIO Programs, I am pleased to present this report, A Profi le of the Ronald E. McNair Postbaccalaureate Achievement Program: 1997-98 Through 2001. The TRIO Program prepares low-income, fi rst-generation college students and individuals from groups that are underrepresented in graduate education for doctoral studies through involvement in research and other scholarly activities. In addition, this report compares McNair participants with a national sample of students with similar characteristics from the Baccalaureate and Beyond Longitudinal Study conducted by the National Center for Education Statistics. This report is the third in a series of reports that present a national profi le of the McNair Program. The previous reports, A Profi le of the Ronald E. McNair Postbaccalaureate Achievement Program: 1998-99 and A Profi le of the Ronald E. McNair Postbaccalaureate Achievement Program: 1999-2000 are available from the Department. Individual project reports, published separately, summarize specifi c information submitted by each McNair project and provide aggregate information on other McNair projects in the same federal region, and the nation. The performance reports, submitted annually by McNair projects, served as the primary data source for both the individual project reports and the national profi le. We are proud to continue our process for sharing national statistical information on the McNair Program. It is our hope that the collection and dissemination of this information will foster communication aimed at furthering our mission and implementing measures to see how well we are doing. We look forward to continuing to work together to improve program services and increase the number of students who earn doctoral degrees."}, {"section_title": "Larry Oxendine Director Federal TRIO Programs", "text": "• Nine out of ten institutions (92 percent) were doctoral or master's degree-granting and almost two-thirds (65 percent) had full-time equivalent enrollments of 10,000 or more. • On average, each grantee served 26 students in 2001-02."}, {"section_title": "Participants", "text": "• In 2000-01 and 2001-02, 3,877 and 4,012 students received program services, respectively. • In both years, more participants were female (69 percent) than male. • African American students made up 47 percent of the active participants in 2001-02, followed by 24 percent Hispanic/Latino, 18 percent white, and fewer than 5 percent each Asian, American Indian/Alaska Native, Hawaiian/other Pacifi c Islander. • In 2001-02, most participants were juniors or seniors in college (25 and 53 percent, respectively)."}, {"section_title": "Services", "text": "• In 2001-02, grantees received an average award of approximately $9,500 per participant. • However, because projects served more students than they were initially funded to serve (26 vs. 24), the average award per actual participant served was approximately $8,900. • The most common services provided by grantees included academic counseling, seminars, summer internships, and assistance with admissions and fi nancial aid. • The most popular services for participants were academic counseling, seminars, admission assistance, and fi nancial aid assistance."}, {"section_title": "Outcomes", "text": "• Approximately 40 percent of McNair participants who completed their bachelor's degrees in 2000-01 were accepted into graduate school, 98 percent of those accepted enrolled. • The percentage of graduates entering graduate school increased each year, from 13 percent in 1998-99 to 39 percent in 2000-01. • A higher percentage of underrepresented students enrolled in graduate school than did low-income and fi rst-generation students, and a higher percentage of whites and American Indian/Alaska Natives enrolled than did members of other ethnic groups. • The number of participants who entered graduate programs not only increased each year but also increased with each year after graduation, suggesting that many participants do not enroll in graduate school immediately after graduation. • In 2000-01, 93 percent of those who enrolled in graduate school immediately after graduation were still enrolled after one year. Of those who graduated in 1999-2000 and enrolled immediately in graduate school, 85 percent were still enrolled after one year, and 60 percent were still enrolled after two years. • Compared with a nationally representative sample and a demographically similar sample, a slightly higher percentage of McNair participants enrolled in graduate school (10 percent compared with 6.4 and 5.8 percent). However, compared with the same samples, McNair participants persisted less once enrolled in graduate school. • Although nearly all participants earned bachelor's degrees (95 percent, four years after program participation), whites and Asians were more likely to earn advanced degrees. • Overall, 16 percent of all participants had earned a master's degree; 4 percent had earned a doctoral or other terminal degree. • By 2001-02, nearly 500 participants had earned doctorates. Compared to the ethnicity makeup of all participants, slightly higher proportions of whites and Asians earned doctorates."}, {"section_title": "Introduction", "text": "This report describes the Ronald E. McNair Postbaccalaureate Achievement Program for the fi ve program years 1997-98 through 2001-02. Grantees are required to submit Annual Performance Reports (APRs) to the U.S. Department of Education detailing project-level activities and goals and participant demographics and academic progress. This report, the third in a series of reports describing the McNair Program, presents grantee data from program years 2000-01 and 2001-02 for the fi rst time and includes data from earlier years for comparison purposes. In addition, this report compares McNair participants with a national sample of students with similar characteristics from the Baccalaureate and Beyond Longitudinal Study conducted by the National Center for Education Statistics. Appendix A lists reference information for other publications describing the McNair Program and its participants."}, {"section_title": "Background and purpose", "text": "Funded by the U.S. Department of Education, the McNair Program is one of eight federal TRIO programs that provide educational support and opportunities to students from economically disadvantaged backgrounds. The three original federal programs, from which \"TRIO\" derived its name, began in the 1960s: Upward Bound (1964), Talent Search (1965), and Student Support Services (1968. The fourth TRIO program, Educational Opportunity Centers, was added in 1972. The Ronald E. McNair Postbaccalaureate Achievement Program, the subject of this report, resulted from the 1986 amendments to the Higher Education Act of 1965. In 1990, the Department of Education created the Upward Bound Math-Science Program to help Upward Bound students recognize and develop their potential to excel in the fi elds of mathematics and science. TRIO also includes a training program for TRIO directors and staff, authorized in 1976, and the newest program, TRIO Dissemination Partnership, authorized in 1998 to facilitate the replication of successful program practices at institutions and agencies that do not have a federally funded TRIO project. The goal of the McNair Program is to increase the number of doctoral degrees earned by students from underrepresented populations. The program awards grants to undergraduate institutions for projects to motivate and prepare students from disadvantaged backgrounds with strong academic potential. Grantees work with students through the completion of the undergraduate degree, assisting with graduate school preparation, application, and entrance. Grantees also track students' academic progress through the successful completion of the doctoral degree."}, {"section_title": "Services provided to McNair participants include the following:", "text": "• Research opportunities for college juniors and seniors"}, {"section_title": "• Mentoring", "text": "• Seminars and other activities to prepare students for doctoral studies • Internships for participants who have completed their sophomore year in postsecondary education (with a research stipend of up to $2,800) • Tutoring • Academic counseling • Assistance in securing admission and fi nancial aid for graduate school Eligible students must be enrolled in an undergraduate degree program at a participating institution. At least two-thirds of all participants must be low-income and fi rst-generation college students. 1 The remaining one-third may consist of members of groups that are underrepresented in graduate education2; currently, this includes those of Hispanic, African American, or American Indian/Alaska Native descent."}, {"section_title": "Annual award and authorization", "text": "As previously noted, the McNair Program is authorized under a 1986 amendment to the Higher Education Act of 1965. The fi rst projects were funded in 1989, with grant competitions currently held every four years. All grants are awarded on a four-year cycle, except for the institutions that score in the top 10 percent of each competition. These grants are awarded for fi ve years. Table 1.01 describes the annual award to the McNair Program along with information about the number of participants the program was expecting to serve. In program year 1989-90, the McNair Program funded 14 projects that expected to serve 415 students. By program year 2001-02, 156 projects were expected to provide services to 3,774 students. The funding level of the McNair Program increased from a little less than $1.5 million in program year 1989-90 to $35.8 million in program year 2001-02. Even when converted to 2002 dollars (values not displayed in table), the amount expected to be available per participant almost doubled over this time period because the average number of students that each project was funded to serve did not fl uctuate widely, ranging between 23 and 30 students. Because the actual number of participants served increased faster than the number of students the projects were funded to serve over the last three program years, the average amount actually available per participant has decreased slightly (Table 1.02). In program year 1996-97, just more than 2,000 students received services from 99 projects with a total appropriation of $19.8 million for an average of $9,772 available per student. By program year 2001-02, the program served more than 4,000 students at a  Chapter 1: Introduction 3 Grantees reported serving more students than we describe in this report. According to the numbers reported in the APRs alone, projects actually reported serving 150 percent of the students they were funded to serve. Through conversations with grantee staff and consultation with the TRIO offi ce, we concluded that this over-reporting was likely due to a misunderstanding of the defi nition of \"students served.\" As such, we include only the participants selected as new or continuing based on participant status in conjunction with prior year participant and enrollment status (resulting in 106 percent instead of 150 percent). See \"Future Directions\" chapter for further discussion. funding level of $36 million, averaging approximately $8,900 per student. In program year 2001-02, the actual number served was 106 percent of the number of students the program was funded to serve. 3 The $36 million appropriation for the McNair Program in program year 2001-02 represents about 5 percent of the total appropriation to all TRIO programs in that year. The McNair Program is one of the smaller TRIO programs, but it is the only one that aims to increase the representation of disadvantaged students in graduate school. Table 1.03 describes the characteristics of the 156 grantee institutions for 2001-02. The majority of grantees were public, doctoral degree-granting universities with total full-time equivalent (FTE) enrollments of more than 10,000 students. Twenty-eight grantees were minority-serving institutions, either Historically Black Colleges and Universities or Hispanic-Serving Institutions. Appendix B describes the geographic dispersion of grantee institutions throughout the United States."}, {"section_title": "Project activities, 1999-2000 and 2001-02", "text": "Grantees report student participation in seven authorized activities central to the goals of the McNair Program. To simplify the analysis of the activities, we compared the earliest year for which enough data were available (program year 1999-2000) with the most recent year (program year 2001-02). Although the two years comprise the same 156 grantees, not all grantees provided APR data in 1999-2000. As such, the comparison is between the 148 grantees (of 156) providing APR data in 1999-2000 and all 156 grantees in 2001-02. (Table 1.04) In 2001-02, most projects provided the following activities: academic counseling, seminars, summer internships (99 percent), admission assistance (98 percent), fi nancial aid assistance (96 percent), tutorial assistance (87 percent), and other research (81 percent). In addition, grantees offered several other activities, including workshops, test preparation, visits to graduate schools, and opportunities to attend and present at conferences. "}, {"section_title": "Percent of institutions providing activity", "text": "Average number of participants in activity a More students participated in academic counseling than in any other activity, with an average of 28 participants per grantee; the fewest students participated in other research activities, with an average of nine participants per grantee. Changes between 1999-2000 and 2001-02 were minimal, but this is expected, given that the 156 grantees are the same in both years. The most notable change in program offerings was the increase in the percentage of institutions offering other research activities; in 1999-2000, 65 percent of grantees provided nonfunded research activities, but in 2001-02, 81 percent provided such activities. There were more student participants in 2001-02 than in 1999-2000, so the average number of students per activity was higher. Except for this increase, student participation in the listed activities was relatively constant across both years."}, {"section_title": "Data described in this report", "text": "The data used in this report are provided annually by individual grantees. Over the years, the quality of these data has greatly improved. Response rates for the annual reports increased from 63.6 percent in 1996-97 to 100 percent in 2000-01 and 2001-02. The number of invalid and missing fi elds decreased from 40 percent for some fi elds to fewer than 5 percent for the same fi elds in recent years. Because the 1996-97 data were reported by only 63 of the 99 grantees and contained a high percentage of missing, invalid, and out-of-range values, we use only data reported after 1996-97. This report describes valid data only and therefore the totals reported in the tables may vary. For this report we have excluded missing and invalid data from tables and charts. Appendix C provides detailed information about response rates, missing data, and other data issues."}, {"section_title": "Chapter 2", "text": "Student Participants in the McNair Program, 1997-98 Through 2001 This chapter switches the focus from project-level activities to the student participants themselves. McNair participants are examined in three ways. The fi rst approach includes only active McNair participants, describing students who actually received services in each reporting year. The second approach includes new participants only, describing students receiving program services for the fi rst time in each reporting year. Describing participants in these two ways highlights any changes in new participants or patterns in new participant selection over time. The third approach describes all individuals reported by projects in a given year, including new, continuing, and all former participants. 4 This approach, although consistent with previous McNair reports, is somewhat less meaningful in that the majority of students who are included are not receiving any direct services from the grantee. This is particularly the case in the more recent years as the number of former participants accumulates. By program year 2001-02, active and new participants made up only 24 and 14 percent, respectively, of all participants reported. (Table 2.01) NOTE: The sum of the number of active and new participants differs from the numbers presented in Table 1 in Appendix C, which displays participant status for each year as reported by grantees. The active and new participants in Table 2.01 (and described in this chapter) do not include all participants reported to be new (or continuing) but include only those who were selected as new or continuing on the basis of reported status in conjunction with prior year participant status and enrollment status. "}, {"section_title": "New participants Active participants", "text": ""}, {"section_title": "All participants", "text": "4 Projects are required to follow all students who ever received services at any time from the McNair Program until the time they receive a doctoral degree. The program does not currently allow projects to identify participants who have completed their educations with lesser degrees than the Ph.D. In many cases, this means that a student is reported as being \"not enrolled\" year after year. Because many of these participants are no longer receiving services from the McNair Program or even making academic progress, the inclusion of all prior participants in the analysis distorts, to some degree, the actual services that projects provide. Just more than half (53 percent) of the student records reported in 1997-98 were for active participants. By 2001-02, only 24 percent of the participant records describe active participants. The percentage of active participants who are new to the McNair Program decreases over time. In 1997-98, 72 percent of active participants were receiving program services for the fi rst time. By 2001-02, only 57 percent of active students receiving McNair services were in their fi rst year of participation in the program."}, {"section_title": "Active participants", "text": "Active participants are those students that received project services during that year; participants receiving project services for more than one year are included in each year that services are received. 5 In 2001-02, active participants made up approximately 24 percent of all participants described in the APRs. This section describes active participants only. The number of active participants described in each table varies slightly due to either nonreported data or invalid data. Table 2.01 provides the total number of active participants."}, {"section_title": "Eligibility status", "text": "At least two-thirds of the participants served by each project must be low-income and fi rst-generation college students. The remaining one-third may belong to certain groups that are underrepresented in graduate education, presently defi ned as African American, Hispanic or Latino, and American Indian/ Alaska Native. Table 2.02 shows that during the fi ve years for which data are reported, the percentage of low-income and fi rst-generation students participating in McNair was slightly more than 70 percent.\n\nApproximately 70 percent of new participants were low-income and fi rst-generation students. This percentage remained constant across reporting years and is consistent with program eligibility requirements, ranging from 70 to 74 percent (Table 2.08).\n\nMore than 70 percent of all participants were low-income and fi rst-generation students. This surpassed the requirement that at least two-thirds of participants be low-income and fi rst-generation.   "}, {"section_title": "Race/ethnicity", "text": "For all years, nearly half of the active participants were African American, approximately 25 percent were Hispanic or Latino, and nearly 20 percent were white. (Table 2.03) The race/ethnicity composition of McNair participants did not change over the fi ve reporting years. 5 Active participants include those students whom grantees classify as \"new\" participants and who (a) are not reported in previous years or (b) have a project entry date in the academic year in which they are reported as \"new.\" Active participants also include students classifi ed as \"continuing\" who are currently enrolled as an undergraduate.  Original category was \"Other\"; in 1999-2000, this option was changed to \"More than one race reported.\" NOTE: The number of participants reported here excludes those with missing or invalid data; thus, the totals may differ from totals presented in other tables. Percents in each column may not sum to 100% due to rounding. According to eligibility status alone, just fewer than 30 percent of the active participants were reported as belonging to underrepresented groups. However, as can be seen by the distribution of race/ethnicity in Table 2.03 and Figure 2.01, approximately 75 percent of the active participants each year belonged to the three groups underrepresented in graduate education (African American, Hispanic, and American Indian/Alaska Native). For the purpose of determining eligibility for program services, McNair projects report participants as low-income and fi rst-generation or as underrepresented. However, many participants are clearly both underrepresented and low-income and fi rst-generation. Indeed, Hispanic and African American students are both underrepresented in graduate education and are less likely than Asian or white students to have parents with college degrees (Nettles & Millett, 1999). Table 2.04 presents the distribution of race/ ethnicity by eligibility status for the most recent year's data. This table shows that many underrepresented participants were also low-income and fi rst-generation. At least 62 percent of African Americans, 68 percent of Latinos, and 53 percent of American Indian/Alaska Natives both belonged to ethnic groups underrepresented in graduate education and were low-income and fi rst-generation.  \nIn 2000-01, the most recent reporting year, slightly fewer than half of new participants were black or African American, a little more than one-fi fth were Hispanic or Latino, and slightly fewer than onefi fth were white (Figure 2.03). These proportions were relatively similar across the years, although some fl uctuations occurred (Table 2.09).     Table 2.10 describes the race/ethnicity and eligibility status for new participants. The proportions of low-income and fi rst-generation and underrepresented new participants were nearly identical to the active participants (Table 2.04). Of the new participants in 2001-02, 62 percent of African Americans, 66 percent of Latinos, and 51 percent of American Indian/Alaska Natives were also low-income and fi rst-generation in addition to being underrepresented in graduate education."}, {"section_title": "Year of active participation", "text": "\n"}, {"section_title": "Gender", "text": "Approximately two-thirds of the active participants in each year are women, and this proportion increases slightly over time, from 65 percent in 1997-98 to 69 percent in 2001-02 (Table 2.05).\nAs Table 2.11 shows, about two-thirds of new participants were female. This number increased slightly over time, from 65 percent in 1997-98 to 69 percent in 2001-02.\nThe majority of McNair participants were female, and their percent share increased slightly over time. In 1997-98, 65 percent of all participants were female. In 2001-02, 67 percent were female.   "}, {"section_title": "Age at project entry", "text": "About a third of active participants each year were between the ages of 17 and 20 at project entry. Slightly fewer than 40 percent were between the ages of 21 and 22. More than 10 percent in each year were older than 30. Although there were slight fl uctuations from year to year, the overall age distribution was similar across the fi ve years reported (Figure 2.02). The average age of active participants at project entry decreased slightly each year, from 24.2 years in 1997-98 to 23.5 years in 2001-02.  \nThe percentage of new participants in 2001-02 falling into the youngest age category was similar to that reported in earlier years. At the time they began participating in a McNair project, less than one-third of the participants, 28 percent, were between the ages of 17 and 20. In 1997-98, 27 percent were in this age range at project entry (Figure 2.04). The average age at project entry for new participants varied little each year, ranging from 23.7 in 2001-02 to 24.1 in 1997-98 and 1998-99.\nIn 2001-02, a quarter of all participants were between the ages of 17 and 20; nearly 40 percent were between the ages of 21 and 22. For all participants, the population did not change much from year to year (because each year differed from the previous year only by the addition of the relatively few new participants). As a result, the average age at project entry for all participants varied little across years (from 24.1 years of age in 2001-02 to 24.4 in 1997-98)."}, {"section_title": "Current year in college", "text": "The McNair Program targets doctoral degree-seeking juniors and seniors, and the distribution of grade levels for the active participants refl ects this. Approximately 50 percent of active participants in each year were seniors, and approximately 25 percent were juniors. Nearly 15 percent were fi fth year/seniors, and just fewer than 5 percent were sophomores (see Table 2.06). Two McNair projects were funded at graduate-level institutions, accounting for the small proportion of active graduate-level participants. A small percentage of active participants each year were not currently enrolled. This group likely included students who stopped out (are taking a temporary break in otherwise continuous enrollment) or dropped out (have quit with no plans to return) during the year in which they were participating in the McNair Program.\nOf the students receiving McNair services for the fi rst time, slightly fewer than one-half were fourth year/seniors, and approximately one-third were third year/juniors (Table 2.12). A few participated in graduate-level projects, but these accounted for a small proportion of all new participants. A small percentage of new participants in each year were not currently enrolled at the end of the academic year in which they began participating in the McNair Program.\nIn 2001-02, slightly fewer than 30 percent of all McNair participants were enrolled in a graduate program, and another third were not currently enrolled in an undergraduate or graduate program (Table  2.16). In any year only about 1 percent of all students tracked had an earned doctorate, and approximately 3 percent had earned other terminal degrees."}, {"section_title": "New participants", "text": "This section describes new participants only. New participants are those students who received project services for the fi rst time during a reporting year. 6 In 2001-02, new students accounted for about 57 percent of the active program participants and approximately 14 percent of all reported student records (Table 2.01). The number of new participants described in each table varies slightly due to either nonreported or invalid data (Table 2.01 also provides the total number of new participants). While approximately 40 percent of the new participants each year participated in the program for a single year, nearly 60 percent received project services for multiple years (Table 2.07). For program years 1997-98 through 1999-2000, approximately 30 percent of new participants remained in the program for two years, and another 15-25 percent remained involved with the program and received services for three years or longer.   \n"}, {"section_title": "Project entry date", "text": "Students begin participation in McNair projects at three peak times: at the beginning of both semesters (January and October) and in the spring. Of the new participants in 2000-01 and 2001-02, 43 and 41 percent, respectively, entered each spring (March through June) just prior to the onset of summer research activities; 12 and 13 percent entered at the beginning of second term in January; and 21 percent each year entered in the early fall term (October).  The following description of all project participants includes all cases on which grantees report. These include active (new and continuing) and all prior-year participants tracked by each project. Because grantees must track every participant until he or she obtains a doctoral degree, the data described here include all students served by all funded projects over the past fi ve years, except for those who have earned a doctoral degree. Every participant is reported every year, beginning with the fi rst year of participation and ending with receipt of a doctoral degree. Once students earn a doctorate, they are no longer tracked or included in the annual performance reports. Previous program reporting described all participants, and we provide this section here for comparison to previous reports. This section describes all participants reported in each year. The number of active participants described in each table varies slightly due to either nonreported data or invalid data. Table 2.01 provides the total number of active participants."}, {"section_title": "All records in reporting year", "text": "Race/ethnicity Slightly fewer than 50 percent of all participants were black or African American, nearly 25 percent were Hispanic or Latino, and approximately 20 percent were white (Table 2.14).\n\nChapter 3 Program Outcomes and Impact The ultimate measure of McNair Program success is a doctoral degree. However, obtaining a doctorate can take, on average, from 6.3 years for the physical sciences to 19.2 years for education (Kerlin, 1995). Although not enough time has elapsed for many McNair participants to obtain this degree, a number of interim indicators provide measures of project success in moving participants toward this goal. Specifi cally, measures of student progression toward the doctoral degree, or persistence, can be a reasonable proxy measure. This chapter describes McNair Program outcomes through students' enrollment and degree status and is organized in chronological order, describing outcomes as participants obtain baccalaureate degrees, gain acceptance into graduate programs, and progress through those programs in pursuit of doctoral degrees. For additional context, we compare the graduate school persistence of McNair participants with that of a national sample."}, {"section_title": "Summary", "text": "In 2001-02, the McNair Program had 4,012 active participants. Of those participants, 2,302 were new to the program and received services for the fi rst time. Fifty-seven percent of the active participants and 14 percent of all participants were new in 2001-02. Twenty-four percent of all students reported in the APRs were active and currently receiving program services. For 1997-98 through 2001-02, approximately 40-47 percent of new participants each year were involved with the McNair Program for a single year, approximately 30-58 percent received services for two years, and approximately 25 percent received services for three or more years. There was little difference among the types of participants, although the percentage of new and active participants who were white decreased slightly over time. In general, just under half of McNair participants were African American, approximately one-quarter were Hispanic or Latino, and nearly one-fi fth were white. Approximately 5 percent of participants were Asian; slightly less were American Indian/Alaska Native; and only 1 percent were Hawaiian or Pacifi c Islander. New participants were most often juniors and seniors in college, whereas active participants followed a similar pattern but with a smaller portion of juniors and a higher proportion of fi fth-year undergraduates. Consistently, more than 70 percent of participants were low-income and fi rst-generation. Approximately one-third of McNair participants were male; this percentage decreased slightly over time. Although the average ages at project entry were similar, slightly more of the new and active participants were 17 to 20 years old at project entry than were all participants. More than half of the students from ethnic groups underrepresented in graduate education were also low-income and fi rst-generation. For all participants, the population did not change much from year to year (because each year differed from the previous year only by the addition of the relatively few new participants). As a result, overall recruiting patterns showed little change over time. Although projects may be recruiting younger students and fewer whites and males, these differences are small.  \nApproximately 40 percent of McNair graduates gain acceptance to graduate school, and in 2000-01, 98 percent of those accepted enrolled. The percentage of bachelor's degree recipients enrolling in graduate school increases with each program year, from 13 percent in 1998-99 to 39 percent in 2000-01. A higher percentage of underrepresented students enrolled in graduate school than did low-income and fi rst-generation students, and a higher percentage of whites and American Indian/Alaska Natives enrolled than did members of other ethnic groups. The number of participants enrolled in graduate programs not only increases with each program year but also increases with each year following college graduation (by 15 to 47 percent, depending on the year), suggesting that many participants do not enroll in graduate school immediately after graduation. Of the participants who enrolled in graduate school, between 79 and 96 percent (depending on the cohort) persisted after one year, approximately 60 percent persisted after two years, just fewer than half persisted through three years, and 43 percent persisted to four years. Compared with other groups (a national sample and a demographically similar sample), a slightly higher percentage of McNair participants enrolled in graduate school (10.2 percent, compared with 6.4 and 5.8 percent). However, compared with the same samples, McNair participants persist less once in graduate school, (60 percent after three years compared with 85 and 83 percent, respectively). Although nearly all participants earn bachelor's degrees (95 percent after four years), whites and Asians are more likely to earn advanced degrees. Overall, 15 percent of all participants have a master's degree; 4 percent have earned a doctoral or other advanced degree. In the past fi ve years, nearly 500 participants have earned doctorates, and of those who did, slightly higher percentages were Asian and white."}, {"section_title": "A note concerning data quality", "text": "The analyses in this chapter include participants from program years 1997-98 through 2001-02, even though there is some incompatibility between the way certain questions were asked before and after the 1999-2000 data collection. (Table C-3 describes these data fi eld changes.) Because some response options were not available in all years, these years have higher proportions of missing and invalid data. This is shown in some tables in this chapter, where occasionally data from earlier years are not available and appear to be inconsistent with trends evident in later years. Another source of error in the data arises from the practice of updating missing and erroneous information in current and subsequent year data fi les only. Errors and omissions are not fi xed retroactively (see Table  C-2 for the proportion of missing and invalid data for each year). Because this has been the practice for updating and correcting student data fi les, the more recent data will always be more accurate and complete than the less recent data. As such, confl icts should be resolved by giving precedence to newer data. A fi nal note concerns response rates. For all years except 1997-98, at least 95 percent of funded projects provided APR data; in 1997-98, only 77 percent did so. See Table C-1 for response rates. We include data here from all available years to allow the description of project outcomes to encompass as many years as possible. However, because of these issues, the interpretation of the fi ndings presented in this chapter should take into account that the newer data are more reliable, complete, and accurate than the older data."}, {"section_title": "Baccalaureate degrees earned", "text": "Individuals wanting to pursue a doctorate must fi rst earn a bachelor's degree. Table 3.01 shows the percentage of the active participants in each year who earn a bachelor's degree in the years following participation in the McNair Program. By 2000-01, nearly one-fourth of active students earned a bachelor's degree in the same year they participated in McNair, and approximately two-thirds earned a bachelor's degree one year later.  "}, {"section_title": "Undergraduate graduation year", "text": "Chapter 3: Program Outcomes and Impact Nationally, approximately 25 to 30 percent of undergraduates enroll in graduate school at any time following college graduation (McCormick, Nuñez, Shah, & Choy, 1999;Nettles & Millett, 1999;Golde & Dore, 2001;Choy & Geis, 2002). Of the McNair graduates in 2000-01, 36 percent enrolled in graduate school immediately after graduation and more will enroll in subsequent years after graduation. Unlike graduate students in general, McNair graduate students are made up of 72 percent low-income/fi rstgeneration and 28 percent from groups underrepresented in graduate education. Nationally, 41 percent of graduate students are fi rst-generation and 14.9 percent are from groups underrepresented in graduate education (U.S. Department of Education, 2000). The number of McNair participants enrolling in graduate school also increases in subsequent years after graduation. As can be seen in Table 3.04, the number of participants enrolled in graduate school increased each year as time from the undergraduate degree increased. Of the McNair participants graduating in 1998-99, 166 were enrolled in graduate school the year following graduation, 247 were enrolled the following year, and 310 were enrolled three years after graduation (an increase of 49 percent from the fi rst to second year, and 26 percent from the second to third year). One explanation for the increase in numbers of McNair participants enrolling in graduate school each year is that many participants do not enroll immediately after graduation from college. Therefore, the number of students enrolled in graduate school increases with each year following college graduation. Research indicates that only 25 to 30 percent of graduate students enroll immediately after college graduation and that another 17 to 29 percent enroll within two years. However, immediate enrollment is more common for those enrolled in doctoral programs than for those enrolled in master's or fi rst professional degree programs (McCormick, Nuñez, Shah, & Choy, 1999;Nettles & Millett, 1999;Golde & Dore, 2001;Choy & Geis, 2002). Although it is likely that delayed enrollments account for much of the increase in graduate degree enrollments with each subsequent year after college graduation, another explanation is that the quality of the data continues to improve greatly with each year. As the data quality and response rate improve each year, grantees include more participants in the annual reports and correctly report them as enrolled. Those who may have enrolled in graduate school but were not consistently tracked would be considered missing or would have incorrect enrollment status reported until the program corrected or updated the data; at that time, that individual would be included in that year as a graduate student. Therefore, in addition to those who delayed graduate school enrollment, the increase in graduate enrollments likely also refl ects those who may have immediately enrolled in graduate school but were not previously reported as such until their records were updated in subsequent years.\npersistence for just those students who enrolled in graduate programs the year after college graduation. This approach likely underestimates persistence because students who took time off between graduating from college and enrolling in graduate school are not included, nor are the students who may have enrolled immediately following graduation but whose records were missing or invalid in the report for that year. After the fi rst year of graduate school, between 79 and 96 percent of these students were persisting (still enrolled at the end of the year). At the end of the second year of graduate school, approximately 60 percent were still persisting, and after three years, between 44 and 53 percent were still enrolled. Forty-three percent persisted through the fourth year. We note that on average, nearly half of all students who begin doctoral study never obtain the Ph.D. (Golde, 2001;Kerlin, 1995). Underrepresented and low-income students have less fi nancial and social support in graduate school, making an ambitious goal even more diffi cult for McNair participants, who are more likely to be underrepresented and low-income than are graduate students in general (see Future Directions for further discussion). This research suggests that doctoral students from lower-income backgrounds tend to be less successful in graduate education, and many McNair participants are both low-income and underrepresented. Thus, the 43 percent persistence rate after four years (compared with a 50 percent completion rate on average for all doctoral students) for McNair participants needs to be interpreted with the fact that McNair participants are likely to have less fi nancial and social support throughout graduate school than are others who are not low-income and fi rst-generation or underrepresented."}, {"section_title": "Graduate school persistence", "text": "Because it is diffi cult to accurately determine persistence when the number of enrollees increases every year (because every subsequent year after the fi rst has more students enrolled in graduate school, the persistence rate will be greater than 100 percent each year), Table 3.05 describes graduate school  "}, {"section_title": "A comparison of graduate school persistence", "text": "To provide additional context for the persistence of McNair participants through graduate school, we compare the academic progress of McNair participants with the academic progress of other students. In addition to providing context, the comparison is also a measure of the impact of the program on participants' pursuit of graduate degrees. As mentioned earlier, the desired outcome for participants is the doctoral degree. However, because not enough time has elapsed for most participants to have completed graduate school, graduate school persistence is our proxy outcome measure. This section compares the persistence rates of McNair participants with the rates of both a nationally representative sample and a sample of similar students. The Baccalaureate and Beyond Longitudinal Study (B&B), funded by the National Center for Education Statistics, is a longitudinal study of the employment and graduate school experiences of bachelor's degree recipients. Approximately 11,000 students who completed their undergraduate degrees in 1992-93 make up the 1993 cohort of the B&B. The study tracks participants for 10 years, collecting data on employment, family education background, and graduate school enrollment at each of three follow-up periods (1, 4, and 10 years following graduation). 7 Although a second B&B cohort of students obtaining their bachelor's degree in 2000-01 has begun, not enough time has passed for this cohort to provide the graduate degree persistence information needed here. The B&B study provided two groups for comparing graduate school enrollment and persistence with that of McNair participants. The fi rst was a nationally representative sample. This included everyone in the 1993 cohort who participated in both the initial and follow-up surveys and provided information on postbaccalaureate enrollment (representing approximately 1.18 million individuals).8 Applying defi nitions similar to those used by McNair projects, we selected only the underrepresented, low-income, and fi rstgeneration students (representing approximately 700,000). This is the demographically similar sample. 9 The McNair group consists of all participants who received bachelor's degrees in 1998-99 (n=1,282). Table 3.06 presents the results of these analyses, which must be interpreted with the following note of caution: Because the data quality has improved greatly in recent years (see earlier in this chapter and Appendix C for details), the persistence comparison based on these data, although promising, likely underrepresents the true persistence of McNair students. We used the 1998-99 participant data because we wanted data from the earliest year possible to allow enough time to measure persistence while still allowing the use of a prior year's data to confi rm the year of bachelor's degree obtainment. The prior year's data were necessary because many projects repeatedly report the highest degree earned each year, making it diffi cult, even combined with end-of-year enrollment status, to otherwise determine when a participant actually earned a degree.  Table 3.05. These enrollment rates differ from the persistence rates presented there in that here the percentages are of all graduates and not just of those enrolling in graduate school. The number of graduates reported in the three years following graduation is not removed from the denominator for any of the persistence rates described in this "}, {"section_title": "1992-1993 B&B bachelor's degree recipients, 1993-97", "text": "Ten percent of the McNair participants who obtained a bachelor's degree in 1998-99 enrolled in graduate school during the 1999-2000 academic year. In comparison data from the 1992-93 B&B Study of bachelor's degree recipients, 6.4 percent of this population and 5.8 percent of a demographically similar population enrolled in graduate school. A similar pattern is evident for the second and third years (Table 3."}, {"section_title": "06).", "text": "This comparison suggests that the McNair program has a positive impact on applying to and enrolling in graduate study for participants immediately after graduation. In the year following graduation, a higher percentage of the McNair students entered graduate school than did the national and similar comparison sample students. However, after three years, the gain narrows and the proportion of McNair students that persists is similar to the proportion of the other samples (5.7 vs. 5.4 and 4.9 percent). This suggests that although the McNair Program helps participants enroll in graduate school, they may have more diffi culty staying enrolled once there. Examining just those completing the fi rst year of graduate school reveals differences in graduate school persistence. Of the 131 McNair students who completed the fi rst year of graduate school, 76 percent persisted through the second year, compared with 95 percent of the national and 94 percent of the similar sample. By the end of the third year, 60 percent persisted, compared with 85 and 84 percent of the national and similar samples, respectively. This indicates that although McNair participants gain acceptance into graduate school at higher rates than do non-McNair participants, a smaller percentage persists once enrolled. Table 3.07 displays the degrees reported by all McNair projects in each reporting year between 1997-98 and 2001-02. Although just more than half of all participants have earned a bachelor's degree, this number will continue to increase as those currently enrolled in undergraduate programs complete their degrees. Approximately 15 percent of all participants in each year have earned a master's degree, and approximately 4 percent of all participants have earned a doctoral or other terminal degree. However, the average time to complete doctoral studies is approximately 10 years, and the participants described -Not available; this was not an available response option in these years. a Percentages are higher because there was no category for other advanced degrees, which were likely included here as doctoral degrees. NOTE: The number of participants reported here excludes those with missing or invalid data; thus, the totals may differ from totals presented in other tables. Percents in each column may not sum to 100% due to rounding. "}, {"section_title": "Doctoral and other advanced degrees earned", "text": ""}, {"section_title": "Year degree was earned", "text": "here have had time to complete only four years of graduate school. As such, the interpretation of these results is constrained by the abbreviated timeframe. Obtaining a doctorate in four years or less is relatively uncommon. The number of earned doctorates will increase in the future as time allows students to progress through graduate programs. Research suggests that although women and men are equally likely to enroll in graduate school, women are more likely to enroll in master's degree programs and thus earn master's degrees, whereas men are more likely to enroll in and earn degrees from fi rst-professional and graduate degree programs (Bradburn, Berger, Li, Peter, & Rooney, 2003;Kerlin, 1995). Other sources also report a higher percentage of males than females earning doctorates (23 vs. 13 percent;Clune, Nuñez, & Choy, 2001). For McNair participants, men and women were equally likely to enroll in graduate school (see Table  3.03). Table 3.08 describes participants' earned degrees by gender and suggests that McNair participants do not show any large gender difference in their obtaining either the bachelor's or the doctoral degree. However, the percentage of males earning other terminal degrees is slightly higher than that of females, and the percentage of females earning master's degrees is slightly higher than that of males. These "}, {"section_title": "Highest degree earned as of 2001-02", "text": "Chapter 3: Program Outcomes and Impact results suggest that for McNair participants, men may be more likely to earn other terminal degrees, and women may be more likely to earn master's degrees, but there are no gender differences in who earns doctoral degrees. However, these differences are quite small and are the result of relatively small numbers of advanced-degree holders. Future reports will continue to explore any gender differences as more participants obtain degrees. There were little differences in highest degree obtained for low-income and fi rst-generation and underrepresented students. Higher proportions of white and Asian participants earned advanced degrees, including master's, doctoral, and other terminal degrees, whereas smaller proportions of African American, Hispanic, and American Indian/Alaska Native participants earned advanced degrees.  Table 3.09 describes the participants who have earned doctoral degrees. Compared with all McNair participants, the group of doctoral degree recipients comprised more whites and Asians and fewer Hispanics and American Indians than were expected. There were no differences by gender or eligibility status. Refl ecting the target population served, the McNair Program is producing higher proportions of doctorates among low-income and fi rst-generation and underrepresented groups. Nationally, women earn 35 percent of doctorates; fi rst-generation college students earn exactly half, and members of underrepresented ethnic groups earn only 8 percent (Nettles & Millett, 1999;Kerlin, 1995). Compared with these national proportions, higher percentages of McNair doctorate recipients were female, fi rstgeneration and low-income, and underrepresented. McNair doctorate recipients were 65 percent female and 69 percent low-income and fi rst-generation. Sixty-three percent of McNair doctorates were earned by students from groups underrepresented in graduate education. 10"}, {"section_title": "Chapter 4 Future Directions", "text": "Participation in the McNair Program is associated with increased graduate school entrance rates. McNair participants, who benefi t from a higher entrance rate into graduate school than nonparticipants, persist through graduate school at similar rates as nonparticipants. On average, nearly half of all students who begin doctoral study obtain the Ph.D. (Golde, 2001;Kerlin, 1995). Of McNair participants who enroll in graduate school, slightly less than half are still enrolled four years later. Research suggests that fi nancial diffi culty is the most frequent reason for graduate school withdrawal, and students from low-income backgrounds (the target population of the McNair Program) are particularly vulnerable to fi nancial diffi culties (Nettles & Millett, 1999;Kerlin, 1995;Lovitts, 2001). Further, most graduate support comes in the form of research or teaching assistantships, and the amount and availability of this support vary by fi eld of study. Assistantships in science and engineering programs are more readily available and tend to provide more money than assistantships in other fi elds (Choy & Geis, 2002). However, the majority of doctoral students are not enrolled in science or engineering fi elds. In addition, the underrepresentation of African American and Hispanic students is particularly pronounced in science and engineering, the fi elds that provide more assistantships (National Association of Graduate-Professional Students, 2000;Nettles & Millett, 1999). Because McNair participants may be more likely than traditional graduate students to face fi nancial diffi culty, exploring the relationship between fi nancial assistance, pursued majors, and persistence in graduate school could be of great relevance and warrants future exploration. After fi nancial diffi culties, a lack of social support is the most frequent reason for leaving doctoral programs (National Academy of Sciences, 1997). Even though most graduate programs actively recruit members of groups underrepresented in graduate school, the environment is not always supportive of them once they enroll. Fewer women reported satisfaction with the graduate school environment than did men (69 vs. 80 percent), and smaller proportions of African Americans, Latinos, and Alaska Natives reported satisfaction than did whites and Asians (60 vs. 74 percent; National Association of Graduate-Professional Students, 2000). Indeed, more Hispanic and African American doctoral students stopped out of their programs because of a \"lack of social fi t\" than did whites and Asians (8 and 6 percent vs. 4 and 5 percent; Nettles & Millett, 1999). We suspect that students who continue their graduate studies in the same institution from which they received McNair Program services would receive a higher level of social support than those who continued their graduate work in a different institution. As a result, a plausible research question is determining whether participants who pursue their graduate work in the same institution have a higher retention rate than those who transfer to a different institution. In addition to determining persistence from the APRs, we also recommend conducting a small intensive survey on former McNair students who have dropped out of graduate school. The purpose of this survey is to gain understanding about the circumstances under which the student decided to terminate his or her graduate work, thus providing insights into how existing services and activities should be modifi ed and what new activities should be developed. However, querying students about the reasons they stopped pursuing a doctoral degree requires identifying who, among the McNair participants, has actually dropped out and will not continue. Presently, there is no defi nition of dropout for McNair participants-the assumption applied is that ultimately all McNair participants will earn their doctoral degrees so there is no defi nition for failure. Defi ning dropouts among the McNair participants would be a useful fi rst step in exploring the factors related to graduate school attrition among McNair participants. The Baccalaureate and Beyond Longitudinal Study began following a new cohort consisting of 2000-01 bachelor's recipients. In future years, we will compare McNair participants with this newer cohort for graduate persistence and degree obtainment rates. Including graduate fi nancial aid and graduate fi eld of study in future data collections will highlight how these factors relate to graduate school success for McNair participants. As briefl y described in Chapter 1, our analysis also revealed that some grantees report serving many more students than they were funded to serve. Further investigation based on conversations with project staff and analysis of the project objective portion of the APRs suggests that overreporting may be the result of lacking a common understanding of how \"students served\" should be defi ned-some grantees defi ne students served more liberally than others. For example, some grantees defi ne the number of participants a program is funded to serve as the number of new participants they are expected to recruit each year instead of the total number they are expected to serve including new and continuing participants. Another reason for the overreporting is a misconception that grantee performance is determined, in part, by how far the grantee exceeds the targeted number of students to be served. Future correspondence to the grantees should clarify the defi nition of students served and the importance of defi ning and reporting this number correctly in the evaluation of grantee performance."}, {"section_title": "Glossary", "text": "This glossary lists the terms used in the report. Some of them are specifi c to the TRIO program and do not necessarily apply to other Department of Education programs or grants. Annual Performance Report (APR) is a program report submitted to TRIO by each grantee. APRs include information describing the participants, activities and outcomes for every funded program. The Baccalaureate and Beyond Longitudinal Study (B&B), sponsored by the U.S. Department of Education's National Center for Education Statistics, is a longitudinal study providing information concerning education and work experiences after completion of bachelor's degrees. B&B provides both cross-sectional information one year after bachelor's degree completion, comparable to the Recent College Graduate (RCG) Survey, and longitudinal data concerning entry into and progress through graduate-level education and the workforce. B&B provides information on entry into, persistence and progress through, and completion of graduate-level education. This information has not been available through follow-ups involving high school cohorts or even college-entry cohorts, both of which are restricted in the number who actually complete the bachelor's degrees and continue their education. In the fi rst B&B study, about 11,000 students were identifi ed in the National Postsecondary Student Aid Study (NPSAS):93 who completed their degree in the 1992-93 academic year. These students made up the fi rst B&B cohort and were followed up in 1994 (B&B:93/94) and 1997 (B&B:93/97), with a third follow-up scheduled for 2003 (B&B:93/2003). A new B&B cohort began with NPSAS:2000 and involved only a one-year follow-up in 2001 (B&B:2000/01). Future B&B cohorts will alternate with Beginning Postsecondary Students (BPS) in using NPSAS surveys as their base. See http://nces. ed.gov/surveys/b&b/. Carnegie classifi cation system is a systematic classifi cation of institutions of higher education in the United States according to such variables as degrees offered, size, and commitment to research. The Carnegie Foundation for the Advancement of Teaching in Menlo Park, California, offers a free online version of A Classifi cation of Institutions of Higher Education (2000) (www.carnegiefoundation. org/Classifi cation/). The Carnegie Classifi cation, originally published in 1973, was subsequently updated in 1976, 1987, 1994, and 2000. Participant status was then verifi ed using prior-year data for all students as described below, and all students reported in each year were then reclassifi ed into one of the following participant groups for that year: active participant, new participant, and all participants. It is according to the following defi nitions of participant status that we describe participants in Chapters 2 and 3. (1) Active participants as described in Chapters 2 and 3 include those students whom grantees classify as \"new\" participants and who (a) are not reported in previous years or (b) have a project entry date in the academic year in which they are reported as \"new.\" Active participants also include students classifi ed as \"continuing\" who are currently enrolled as an undergraduate. (2) New participants as described in Chapters 2 and 3 include those who (a) were not present in previous year's data and whose participant status was \"new\" or (b) whose project entry dates indicated they were new to the McNair Program in the year they were fi rst included in the APR. (3) All participants as described in Chapter 2 include active (new and continuing) and all prior-year participants reported by each project, except for those who have earned a doctoral degree (once a student earns a doctorate, they are no longer tracked or included in the annual performance reports). A fi rst-generation college student is the following: (1) an individual neither of whose natural or adoptive parents received a baccalaureate degree; or (2) a student who, prior to the age of 18, regularly resided with and received support from only one natural or adoptive parent and whose supporting parent did not received a baccalaureate degree. Services. Defi nitions applicable to \"services\" include the following: • Academic counseling means assisting students in making educational plans, selecting appropriate courses, developing career plans, meeting academic requirements, and planning for graduation education. • Admissions assistance means workshops or individualized assistance to help participants successfully complete graduate school applications. • Campus visitations mean project-sponsored trips to postsecondary institutions for the purpose of acquainting students with institutions that the project participants may wish to attend. • Career awareness means project-sponsored activities, such as fi eld trips, special lectures, and workshops, to increase students' knowledge of the various career opportunities available. • College entrance exam preparation means workshops, tutoring, or individualized assistance specifi cally designed to help students meet scoring requirements on national or state standardized tests given to students for admission into a postsecondary educational institution. • Financial aid assistance means workshops or individualized assistance to help participants complete various fi nancial aid applications, including scholarship applications, U.S. Department of Education federal student fi nancial aid applications, and state applications for fi nancial aid. • Other research means research activities for which students did not receive any payment from the McNair program. • Seminars mean any seminar intended to prepare students for graduate school.\n• Summer internships mean only those research activities for which students who have completed their sophomore year received the legislated stipend of up to $2,800. • Tutorial assistance means individual or small-group informal academic assistance provided by professional staff or students who are either part-time paid, volunteer, or internship-for-credit students. An underrepresented student is one belonging to a group that is underrepresented in graduate education, including those of Hispanic, African American or American Indian/Alaska Natives descent. The quality of the data provided by McNair grantees is steadily improving. Table C-2 describes the percentage of all cases reported each year by all projects that are missing, invalid, or out of range. Most data fi elds have fewer than 5 percent of cases that are invalid, and the percentage of these cases decreases each year. Because McNair Programs are required to track participants until the Ph.D. is awarded, each participant is included in every year's Annual Performance Report until the Ph.D. (or other terminal degree) is granted. After a participant graduates, projects must track and report on his or her academic progress through graduate school. Because not all participants enroll in graduate school or obtain a Ph.D., the APRs include many prior-year participants not currently enrolled in any academic program. The diffi culty associated with tracking and reporting on participants every year who are no longer making academic progress accounts for the relatively higher percentage of invalid data for the \"current grade level,\" \"enrollment status,\" and \"degree\" variables. "}, {"section_title": "Reporting year", "text": "The analyses in this report include participants from 1997-98 through 2001-02, although there is some incompatibility between the way certain questions were asked before and after the 1999-2000 data collection. The \"degrees earned\" and \"enrollment status\" items for the two earlier years, for example, did not allow projects to identify pre-baccalaureate participants (enrolled undergraduates with no degree yet) or students who were no longer enrolled in any academic program. Because these options were not available, these years have higher proportions of missing and invalid data (i.e., projects not reporting students for which there was no appropriate option or including them in other, less appropriate categories). This incompatibility is evidenced in the tables presented in Chapter 4, where occasionally data from the earlier years exaggerate or diminish trends evident in later years. Data for these years are"}]