[{"section_title": "Abstract", "text": "Stakeholders at institutions across the United States are continuously looking for ways to improve the academic success and retention of students. We used logistical regression in an examination of noncognitive, cognitive, and demographic factors as predictors of academic success and retention of Division I first-year student-athletes. The results indicated that high school GPA is the best predictor for academic success. The Transition to College Inventory index, self-confidence, institutional commitment, and independent activity focus can be used in the prediction of academic success. Retention was most accurately predicted by students' first-year cumulative GPA. University advisors can use the results of this study to enhance the resources designed to improve the academic performance and persistence of student-athletes."}, {"section_title": "", "text": "The brands of many institutions are closely connected to the success of the athletic teams associated with them (Lawlor, 1998; Roy, Graeff, & Harmon, 2008) and consequently to the recruitment, enrollment, retention, and graduation of student-athletes (Joseph, Mullen, & Spake, 2012; Sperber, 2000; Zimbalist, 1999) . Successful athletic programs support student-athletes with effective academic support because the academic success and graduation of collegiate studentathletes constitutes a primary component of the success at every level of National Collegiate Athletic Association (NCAA) sport participation.\nIn October 2016, the NCAA announced that, starting in 2019, it would distribute millions of dollars to institutions with student-athletes who meet or exceed benchmarks established for graduation rates and academic progress (Hosick, 2016) . For many years, student-athletes were required to meet criteria that defined eligibility to compete in college athletics. In 1986, the NCAA enacted Proposition 48, which required prospective stu-dent-athletes to have attained a minimum 2.00 high school GPA in a core curriculum of at least 11 defined academic courses and to have obtained a minimum ACT composite score of 15 or a minimum SAT total score of 700 to practice, play, and receive athletics-related financial aid as college freshmen. Then in 1992, the NCAA updated the guidelines, in Proposition 16, for assessing the academic progress of admitted student-athletes. These new directives meant that student-athletes took 13 core courses and met minimum thresholds, which are based on a combination of high school GPA and SAT or ACT. Once enrolled, studentathletes were required to complete 25% of the credit requirements for their declared degrees by the end of their second years, 50% by the end of their third years, and 75% by the end of their fourth years. These percentages were increased to 40, 60, and 80%, respectively, in 2003 (Crowley, 2006; Petr & McArdle, 2012) .\nIn 2009, the NCAA published the Graduation Risk Overview (GRO), a set of risk factors, any of which might signal that a student-athlete may not persist to graduation. The five emperical factors were based on academic background and achievement, the role of academics (in the student-athlete's life), transfer status, personal history, and sportrelated issues (NCAA, 2009) . For example, the GRO suggested that a student-athlete who transfers to an institution faces a greater risk of not graduating than a student-athlete who enrolled directly from high school.\nStudent-athletes at all levels of competition must meet academic requirements while also balancing their athletic and academic responsibilities (Hendricks & Johnson, 2016) . In addition to attending classes, completing homework assignments, and attending scheduled tutoring and study hall sessions, student-athletes participate in a maximum of 20 hours of athletics-related responsibilities each week (Holsendolph, 2006) . Although designed to enhance their athletic and academic success, these scheduld activities consume much of a student-athlete's daily life, leaving little time for personal or extracurricular activities. In a national survey of student-athletes enrolled at 18 Division IA institutions, Potuto and O'Hanlon (2006) found that student-athletes are more likely to identify as athletes than as students. Hence, these students may default to spending more time focusing on their athletic performance than on their academic success. However, student-athletes must maintain the academic requirements mandated by the NCAA to continue playing their sports.\nConsiderable evidence suggests that studentathletes who participate in academic support programs benefit academically. Using focus group data obtained from African American studentathletes enrolled at 11 U.S. institutions, Person and LeNoir (1997) found that African American male student-athletes were ''more inclined to persist when advising, research experiences, and career seminars are viewed as effective,'' regardless of the student's entering qualifications (p. 86). Butler (1995) discovered that institutions with major football and strong academic support programs retained student-athletes.\nThe question remains: How can providers of academic support programs identify those studentathletes most in need of the intervention(s) crucial to academic success and persistence? In addition to using traditional cognitive markers, advisors seeking to target students for support can assess noncognitive student factors. Several researchers (e.g., Himelstein, 1992; Kalna, 1986; Pritchard & Wilson, 2003) have identified the noncognitive factors, such as student motivation, study skill proficiency, time management skills, and selfconfidence, that prove crucial to retention, academic progress, and ultimately, graduation."}, {"section_title": "Cognitive Predictive Assessment College GPA", "text": "In some studies, high school GPA and standardized tests correlated with the academic success of the student-athlete population. Morgan (2005) and Scogin (2007) reported that both high school GPA and ACT composite score predicted with statistical significance the cumulative college GPA of a student-athlete. However, Maggard (2007) found that the ACT did not significantly correlate with first-semester GPA for at-risk football players admitted on scholarship under a special admissions program at the University of Missouri; however, high school GPA aligned with college GPA for these student-athletes."}, {"section_title": "Retention", "text": "Lotkowski, Robbins, and Noeth (2004) conducted a review of the research involving postsecondary retention and determined that both high school GPA and ACT scores positively correlated with retention. High school GPA showed the strongest relationship with retention, and ACT scores ranked of third importance, behind socioeconomic status (SES). Crouse and Trusheim (1998) researched the origins and uses of the SAT by U.S. colleges and reported that high school GPA proved the better predictor, with a 73.4% accuracy rate, of students earning a bachelor's degree. This finding also was supported by Boudreaux (2004) , who added high school GPA as a variable in a predictive model of student-athlete retention.\nWe reviewed the research that illustrates the importance of cognitive variables in predicting the academic success and retention of students. We present an analysis of additional noncognitive factors as predictors of academic success and retention, not to replace cognitive factors as indicators, but as supplemental information to improve the predictability of student-athlete academic performance. Tinto (1993) utilized self-report instruments to study retention. He stated that noncognitive assessments need to be student centered and can be used to ''collect information on the attributes, intentions, and activities of each student who enters the institution,'' including both precollege characteristics and experiences (academic and social) while enrolled (p. 214). Following Tinto's advice, stakeholders should begin collecting information prior to a student's first year in college to obtain the most accurate data of precollege characteristics and continue harvesting data at various intervals throughout the student's college career."}, {"section_title": "Noncognitive Predictive Assessment", "text": "Noncognitive variables are frequently used when assessing special populations of students, such as student-athletes (Comeaux & Harrison, 2011; Sedlacek, 2004) . According to Cunningham (1993), use of noncognitive variables predicts academic success and retention better than use of cognitive variables; therefore, noncognitive variables can be used to enhance the predictive ability of cognitive variables.\nAfter more than 30 years of research related to noncognitive-based assessment of student success variables, Sedlacek (2004) concluded that the currently available instruments for gathering student data used to predict academic success, typically high school GPA and SAT or ACT performance, were not providing adequate results for diverse racial and cultural groups. The results of the assessments did not typically correlate to student outcomes (grades or retention) and were not easily utilized by college administrators. As a result, Sedlacek developed the Noncognitive Questionnaire (NCQ) on the basis of Sternberg's (1986) experiential and contextual domains.\nOther researchers found that self-concept and self-appraisal predict academic success for collegiate students. Lounsbury, Huffstetler, Leong, and Gibson (2005) studied a first-year student's sense of identity and the extent to which this perception influences academic success. The authors found that sense of identity and emotional stability were positively correlated with collegiate GPA, with identity showing a stronger relationship with academic performance for African American students than for other groups studied by ethnicity. Tracey and Sedlacek (1985) also looked at predictors of academic success using the NCQ. They reported positive self-concept and realistic self-appraisal as predictors of a student's academic performance throughout his or her collegiate career. An example of a recent study that seems to reveal problematic self-appraisals, the research of Beron and Piquero (2016) , who examined the GPAs of more than 19,000 student-athletes across all NCAA divisions, revealed that student-athlete participants with the lowest GPAs viewed themselves as primarily athletes and considered their roles as students less salient.\nResearchers also have reported motivation as a predictor of academic success. Dunham (1973) found that achievement motivation increased the ability to predict college GPA when combined with high school GPA and gender. Dennis, Phinney, and Chuateco (2005) conducted a longitudinal study of students with minority status to examine the relationship between motivation and college GPA. They found career or personal motivation as a strong predictor of GPA and adjustment in college.\nSeveral scholars have analyzed the persistence and time management of students. Schmelzer, Schmelzer, Figler, and Brozo (1987) surveyed 117 students about the factors that affected success and failure in college. They reported that successful students identified persistence and active study as reasons for student success and cited poor time management as a reason for failure. In a study of first-semester students, McCausland and Stewart (1974) identified delayed avoidance (procrastinating on study tasks) and work methods as factors that contributed to college success. Multiple researchers have ascertained that more conscien-tious students earn higher college GPAs (Bauer & Liang, 2003; Lounsbury et al., 2005) . In addition, Farruggia, Han, Watson, Moss, and Bottoms (2016) , after talking to participants enrolled as first-year students at a large, ethnically diverse, urban university, established a correlation of the noncognitive variables of academic mindsets, academic perseverance, learning strategies, social skills, and academic behaviors with academic success. They also found that academic performance was most strongly related to an academic mindset followed by the will to persevere (grit). They found few differences when analyzing the results by the ethnicity of the participants."}, {"section_title": "The Transition to College Inventory (TCI)", "text": "After extensive research, Pickering, Calliotte, and McAuliffe (1992) developed the TCI, which was influenced by the works of Astin, Tinto, and Sedlacek (as cited in Pickering, Calliotte, Macera, & Zerwas, 2005; Pickering et al., 1992) . The noncognitive data from entering students obtained by the TCI is used to supplement and improve the predictive ability of cognitive and demographic variables. Through the TCI, students self-report their precollege characteristics and make predictions about their performance and involvement in college. The nine-factor model includes college involvement, influences on college choice, student role commitment, athletic orientation, personal and academic concerns, self-confidence, institutional commitment, socializing orientation, and independent activity focus. The TCI has been used to assess students at 4-year institutions and at community colleges (Freeze, 2000) . It also has been modified to study both transfer students and student-athletes (Cunningham, 1993; Duggan, 2002) . Richardson and Sullivan (1994) examined the noncognitive factors that influenced the success of 62 academically underprepared college freshmen who were among 199 college freshman at a small, private, liberal arts college. Using the College Student Inventory, they found that noncognitive variables predicted freshman GPA and influenced persistence more, in a statistically significant way, than cognitive variables did. The TCI was normalized as a predictor of student success and utilized for both entering first-year students and those transferring to 4-year institutions (Banta, Lund, Black, & Oblander, 1996) . The TCI can be used to predict which students are most at risk for attrition and to guide advisors in the use of appropriate interventions for these students early in the students' collegiate careers (Pickering & Calliotte, 1996) ."}, {"section_title": "Factors Affecting the Academic Success of", "text": "Student-Athletes Sedlacek and Adams- Gaston (1992) found that the NCQ was correlated with first-semester grades of first-semester student-athletes; the SAT was not so correlated. Three noncognitive variables combined to predict first-semester grades: a strong support person, community involvement, and positive self-concept. These factors relate to confidence and support, which seem to be important for a student-athlete's academic success. However, Cunningham (1993) also found that too much self-confidence (top 10%) could exert a negative influence on the academic success of a student-athlete.\nA student-athlete's perceived academic ability, as well as long-range goals, remains a valid predictor of academic success (Garrett, 2000) . Student-athletes with ''inadequate academic backgrounds, poor study habits, tight schedules, peer distractions, and waning motivation'' often become frustrated, which contributes to low grades in college (Adler & Adler, 1985, p. 247) . In a study using the Student Adaptation to College Questionnaire, Melendez (2006) found that student-athletes reported higher academic adjustment scores than their nonathletic peers did. Melendez concluded that this finding may have resulted from enhanced educational support programs, psychological support systems, mentor programs, and the increased admissions requirements mandated by the NCAA.\nAs an important noncognitive predictor of student persistence or nonpersistence, the motivation of student-athletes for both academics and athletics should be assessed. Gaston (2002) discovered that male athletes were more motivated toward athletics than their female peers were. In an interesting finding, low-profile male athletes earned the highest ACT scores but showed the lowest motivation scores toward academics. In general, Gaston found no significant difference between high-profile and low-profile athletes and that female athletes showed higher academic motivation then their male peers. Johnson (2013) found the NCAA GRO model effective in predicting academic risk as measured by semester GPA. As a critical determinant of athletic eligibility, GPA as a marker of the GRO can help advisors seeking to determine athletes at risk for nonpersistence to graduation.\nFactors Affecting Retention of Student-Athletes Rivera (2004) studied the key factors studentathletes believe are important in their decisions to remain in college by analyzing the results from the Understanding College Student-Athlete Retention questionnaire data from 330 student-athletes at the Division I level. Rivera reported the following factors as most important: timing of courses, a variety of course offerings, institutional fit, academic performance, and ease of declaring a major. The least important factors emerged as involvement in special interest groups and extracurricular activities, academic support from teammates, informal student-faculty member interactions, and individual athletic achievement. Regarding intent to persist, the student-athletes who had noted a prior intent to leave the institution rated their athletic experience as most important, whereas student-athletes without a prior intent to leave rated the quality of their academic experience as most important.\nUsing data derived from the 1990 survey of Beginning Postsecondary Students, Leppel (2005) determined that female athletes were more likely than male athletes to persist at the institution where they first enrolled. Both male and female studentathletes, irrespective of the division or institutional athletic membership, were more likely to be retained from the first year to the second year. However, males were more likely to change institutions than females because of their athletic participation. Gaston-Gayles (2003) interviewed seven directors of academic support services for studentathletes with relatively high graduation rates in an attempt to identify those institutional factors that might account for the higher-than-average success rate of student-athletes. Themes that emerged included reporting lines of athletic support services to academic affairs, a relatively small institutional size that provides ease of communication between students and faculty members, nonadmittance of students deemed unlikely to be successful, institutional support and culture, athletic department support, and intentional advising.\nThe research reviewed for this article revealed that traditional variables typically utilized in admissions decisions, such as high school GPA and SAT or ACT scores, along with other nontraditional variables (race, gender, SES, and sport revenue status), can be used collectively to predict the academic success of college students. We examined the feasibility of enhancing this predictive ability by utilizing data from a noncognitive assessment tool, the TCI, to establish a model for the most accurate predictors of academic success for the student-athlete population."}, {"section_title": "Methods", "text": "We examined the factors that might effectively predict the academic success of student-athletes at the end of their first year of enrollment and their retention into the second year. We analyzed cognitive factors including high school GPA, standardized test scores (SAT or ACT), and college GPA. Demographic variables included gender, race, SES, and status in a revenue sport. We analyzed data from the TCI, used to assess precollege characteristics, skills, and attitudes, to determine the predictive ability of the instrument for both academic success and retention. For this study, we considered a cumulative GPA of 2.0 or greater representative of academic success and a GPA of less than 2.0 as a sign of academic difficulty. Retention was defined as a studentathlete's reenrollment after the first year.\nWe sought to answer the following questions:\nRQ1. Which noncognitive variables, as measured by the nine factors of the TCI, predict academic success for student-athletes at a large, public, moderately selective, research-extensive, Division I university? RQ2. What combination of demographic, cognitive, and noncognitive variables (nine factors of the TCI) predicts academic success for student-athletes at a large, public, moderately selective, research-extensive, Division I university? RQ3. Which noncognitive variables, as measured by the nine factors of the TCI, predict retention for student-athletes at a large, public, moderately selective, research-extensive, Division I university? RQ4. What combination of demographic, cognitive, and noncognitive variables (nine factors of the TCI) predicts retention for student-athletes at a large, public, moderately selective, research-extensive Division I university?"}, {"section_title": "Sample", "text": "We looked at data for all student-athletes from 16 Division I athletic teams with first-semester enrollment at a large, public, moderately selective, research extensive, NCAA Division I university between 2006 and 2011. We defined moderately selective as a college with an admissions rate at or near the national average and coded sports teams as revenue or nonrevenue. We excluded data from international students because they had not been required to complete the TCI and data from student records with missing data deemed necessary for this study."}, {"section_title": "Instrumentation", "text": "TCI. The TCI is a survey instrument designed to identify noncognitive factors that improve the predictive ability of cognitive and demographic factors for academic performance and retention (Pickering et al., 1992; Pickering et al., 2005) . In addition to including predictions of college performance and involvement, the instrument features a self-report of students' precollege characteristics, attitudes, and behaviors. The TCI is administered to students immediately before or at the start of their first year in college. The inventory is divided into seven sections: Reasons for Attending College, Reasons for Choosing This College, Experiences During the Senior Year of High School, Self-Ratings of Abilities and Traits, Attitudes About Being a College Student, Predictions About Academic Success, and Predictions About Involvement in College.\nThe TCI Index is a compilation of 47 of the 115 survey items, comparing the responses of students who had completed the first semester in academic difficulty (GPA , 2.00) with those of students who had met with academic success (GPA 2.00). A student response to one of the 47 index items correlated with a 1 point change in the index score for that student; therefore, the TCI Index can, in principle, range from 0 to 47. We used this index to identify students who may be academically at risk, that is, those possessing nine or more risk factors (Pickering et al., 2005) . Pickering et al. (2005) tested the validity of the instrument and found a significant difference between the responses of those students in academic difficulty and those not struggling of a minimum of 5 to 7 percentage points (M ¼ 3.8, SD ¼ 3.43). In addition, they conducted a factor analysis on the correlations of all 115 items on the survey, and nine factors were identified as associated. The TCI Index indicates a student's risk level (see Appendix).\nIn 2003, Pickering et al. (2005) conducted a factor analysis to identify the factors derived from the survey items that contributed to academic performance. Items were loaded on the factors (eigenvalues of 0.40 and greater), and those that did not successfully load on one of the factors, and thus were not part of the TCI Index, were deleted. An exploratory factor analysis with the principal axis method and varimax rotation identified a nine-factor model. Pickering et al. (2005) described the nine factors as follows:\nCollege involvement-Describes the extent to which students intend to actively participate in a variety of in-and out-ofclass activities during college. Influences on college choice-Describes how important a variety of external factors, people, and college characteristics were in making the decision to enter this particular college. Student role commitment-Describes the extent to which the student ascribes to behaviors and attitudes associated with being successful in college. Athletic orientation-Describes the student's intention to devote a significant amount of time to organized sports and/or a personal exercise program while in college. Personal/academic concerns-Describes the extent to which the student expresses a variety of personal and academic concerns that can interfere with their success in college. Self-confidence-Describes the student's level of confidence in a variety of academic and personal skills and abilities. Institutional commitment-Describes the extent to which the student is committed to attending and graduating from this particular institution. Socializing orientation-Describes the student's inclination to participate in social activities of the type and to the extent that they could negatively affect his/her academic performance. Independent activity focus-Describes the student's inclination to participate in activities and pastimes that do not involve active interaction with others. (p. 6) Pickering et al. (2005) also conducted a stepwise logistic regression to determine the factors significantly correlated to a student's academic performance at the end of the first semester. They determined five factors as significant predictors of academic difficulty: student role commitment (negatively correlated), athletic orientation (positively correlated), self-confidence (negatively correlated), socializing orientation (positively correlated), and independent activity focus (positively correlated) (p. 7).\nFirst-Year Biographical Questionnaire (BioQ). The BioQ is used at institutions to gather background information about first-year students. All students entering the institution are required to complete the 19-question survey during their first semesters. We used the BioQ to collect data on SES by looking at responses to the question, ''What is your best estimate of the combined total income of the adult or adults with whom you lived during the past year for the most recent tax year?'' We examined only parental income for this study."}, {"section_title": "Data Analysis", "text": "Data for this study were collected from 428 student-athletes from 16 varsity intercollegiate sports, and after removal of incomplete records or those from international students, we analyzed 275 cases. Data came from students in the following sports: men's baseball, men's basketball, men's golf, men's sailing, men's soccer, men's swimming, men's tennis, men's wrestling, women's basketball, women's field hockey, women's golf, women's lacrosse, women's sailing, women's soccer, women's swimming, and women's tennis. Both men's and women's basketball programs are considered revenue sports, and all others are categorized as nonrevenue programs. Of the 275 participants, 45.5% were male, and 54.5% were female. Most (81.1%) participants were Caucasian; 18.9% identified as a minority.\nThe criterion variables for this study were student-athlete academic performance and retention into the second college year, which were obtained from the institution's student information system. Academic performance data were based on the student-athletes' fall and spring semester GPAs.\nWe utilized logistic regression to analyze the predictive ability of multiple independent variables. This method is used when only two categories of dependent variables are included, in this case, either good academic standing or academic difficulty and retained or not retained. We added each predictor to the equation to find the best-fit model, and we report chi-square to indicate the goodness of fit. We also report Nagelkerke R 2 , which is a reliable pseudo R 2 and signifies the strength of the relationship between the predictors and prediction. EXP(B), the odds ratio, stipulates predictive ability when a predictor measure increases by one unit."}, {"section_title": "Findings and Summary", "text": "We examined the use of noncognitive, cognitive, and demographic variables as predictors of college success and retention of Division I firstyear student-athletes. We used stepwise logistic regression in the analyses.\nAccording to the analysis of the academic success of student-athletes, both null hypotheses were rejected, and both the TCI and BioQ models were found to predict the outcome at a level of statistical significance. When the nine factors of the TCI were entered, we found three factors were significant predictors of academic success: selfconfidence, institutional commitment, and independent activity focus. When demographic and cognitive predictors were added to the model, we found high school GPA was a significant predictor.\nIn the analysis of the models for retention of student-athletes from their first years to their second years, only one variable was deemed a significant predictor. The nine factors of the TCI did not provide any predictive ability of first-to second-year retention. When the demographic and cognitive variables were added to the models, we discovered only cumulative GPA after the students' first years as predictive of retention at a level of significance."}, {"section_title": "Discussion", "text": ""}, {"section_title": "Academic Performance and Retention", "text": "This study supports the findings of Morgan (2005) and Scogin (2007) ; both studies revealed that high school GPA correlated with the academic success of student-athletes. In the analyses of cognitive, noncognitive, and demographic variables, the prior researchers determined high school GPA was a significant predictor. By contrast, our findings did not support the inclusion of standardized aptitude test scores as predictors of academic performance, an outcome that aligns with the findings of Maggard (2007) and Sedlacek and Adams-Gaston (1992) . If these results are confirmed by future, comprehensive studies, the NCAA should reevaluate the emphasis currently placed on the SAT or ACT as a factor in determining admissions and initial athletic eligibility.\nA variety of demographic variables, including race, gender, and socioeconomic status, have been cited as predictors of academic success (Noble, 2003; Walpole, 2003) . Participation in revenue-producing sports has been linked with low academic performance (Maloney & Mc-Cormick, 1993) . The results of our study did not support the use of race, gender, SES, or status of a sport as revenue generating as predictors of academic success for student-athletes.\nOther studies indicated that noncognitive factors, such as self-concept and institutional commitment, play an important role in the prediction of academic success (Cunningham, 1993; Garrett, 2000) . We found that three of the nine factors of the TCI were significant predictors of academic success: self-confidence, institutional commitment, and independent activity focus. Athletic academic advisors can use the TCI as a tool to focus additional academic support on a student-athlete population most at risk for dropping out according to the specified noncognitive factors.\nThe results of this study indicate that a combination of cognitive and noncognitive factors best predict academic performance for student-athletes. We found the most predictive variable was high school GPA alone. To measure self-confidence, institutional commitment, and a focus on independent activity, the TCI can be used separately from grades and standardized test scores. In general, the independent activity focus scores are inversely related to success, meaning that a higher score on this factor indicates that a student is more likely to experience academic difficulty. In addition, the findings of our study show that the higher the level of institutional commitment and self-confidence, the more likely the student would succeed in academics. We found that only first-year cumulative GPA significantly correlated with student-athlete retention."}, {"section_title": "Implications for Advisors", "text": "In a recent study focused on the profession of athletic advisors, Rubin (2017) surveyed 277 members of the National Association of Academic and Student-Athlete Development Professionals. Rubin's findings revealed a lack of consistency in the educational background and training for the profession. The results of this study can provide guidance for those entering the field and help advisors focus on important factors in determining the academic success and retention of student-athletes.\nAccording to the results of our study, high school GPA proved the most important cognitive factor that athletic advisors should review when analyzing an advisee's record to find potential impediments to academic success. Advisors should insist on access to high school transcripts for incoming students so that they can provide academic assistance (study hall, tutors, and study skill workshops) on the basis of students' prior academic performance. Likewise, for continuing students, lack of success during the first academic year should be viewed as a red flag needing significant attention.\nThe use of noncognitive inventories can enhance the predictive ability of high school GPA. Students are not one-dimensional; therefore, the use of multiple factors can provide a useful profile and evidence for deciding appropriate advising strategies. In the most effective way to use the TCI, the advisors review the individualized TCI Advising Profile, which is created for each student who completes the assessment and includes the TCI Index along with the specific responses to the items that make up the index for that student. This profile informs advisors about the individual areas of potential concern and can be reviewed with the student.\nStudents who earn low scores on the institutional commitment rating may benefit from sessions on setting goals that focus on aspiration and strategies for degree attainment. Because of their athletic commitments, student-athletes may not engage in campus life (e.g., student organizations, academic cocurricular activities, and research opportunities), but advisors should encourage those for whom time permits. These opportunities get students involved on the campus, which may increase their intention to graduate (Gaston-Gayles & Hu, 2009 ).\nIndividual and group sessions that provide students with academic and life skill development can help improve the self-confidence of some students who are lacking in these areas when they enter college. Because it is an indication of students' past performances, high school GPA may affect student self-confidence moving forward in academia. Giving students opportunities to learn the necessary skills to improve classroom performance may likewise increase their selfconfidence, which in turn positively affects their academic performance. Ultimately, assisting students to succeed in the classroom can exert a positive influence on retention."}, {"section_title": "Limitations", "text": "We examined only first-year student-athletes who entered one large research institution between 2006 and 2011. Only participants who completed the TCI and who had an SAT or ACT score recorded in the student information system were included. The inventory used provides responses based on self-reports, which can lead to answers given from a social-desirability bias. A disproportionate distribution of race and sport revenue status characterized the study sample."}, {"section_title": "Future Research", "text": "Research on the ability of noncognitive factors to predict academic success and retention for student-athletes remains limited. Cunningham (1993) found the TCI to be an effective tool for identifying at-risk student-athletes; however, the TCI was revised in 2003 (Pickering et al., 2005) . We used the current version of the TCI.\nMany studies have been conducted to analyze the predictive ability of demographic, cognitive, and noncognitive variables. A smaller number of studies has been conducted to examine all these variables in combination, and only a few were based on investigations into these variables in relation to the student-athlete population. Our study assessed the predictive ability of demographic, cognitive, and noncognitive variables for the persistence and academic success of studentathletes at a large, public, moderately selective, research-extensive, Division I university.\nThe study presented should be replicated at a more diverse group of institutions with a larger number of participants, including those who play football, because that population was missing from this study. Also of benefit, a longitudinal, mixed-methods, cohort-based study could be designed to analyze the cognitive, noncognitive, and demographic factors that predict graduation. The resulting data could be compared to our research to see if the same variables that predict academic success and retention also predict the ultimate goal of graduation."}]