[{"section_title": "Background", "text": "The global emergence of human coronavirus disease, namely COVID-19, with severe bronchopneumonia and respiratory symptoms raised concerns about public health at the beginning of 2020 [1] [2] [3] . According to released statistics, SARS-CoV-2 is easily spread from person-to-person with deep socioeconomic influences on healthcare systems [4, 5] . The rapid worldwide spread of COVID-19 between human societies has led to enormous pressure on the health care system and changed the auspices toward therapeutic priorities [6] . Transplant patients are a certain population that needs unique and special health care systems [7] . Considering the urgent need for potent regenerating cells and biological products, this raises the question of whether stem cells within different tissues, especially bone marrow stem cells, could transmit the SARS-CoV-2 virus from person-to-person. In other words, are there any differences or similarities in the susceptibility of differentiated and undifferentiated cells to viral infections such as COVID-19? Of course, here is assumed all hygienic principles are toughly respected during cell transplantation to minimize the transmission of COVI-19 among individuals.\nIn this regard, the present review article aimed to address the possible differences in antiviral defense system between differentiated and undifferentiated cells. The logical answer to this question can acknowledge us to exploit policies against this COVID-19 in healthy donors and transplant recipients."}, {"section_title": "COVID-19 Pathophysiology and Mechanism of Action", "text": "genomic pool of SARS-CoV-2 consists of + ssRNA in association with nucleoprotein inside a capsid shell [9] . At the external surface of the envelope, numerous projections (Spike proteins) and glycoproteins (hemagglutinin) are seen. Using spike proteins, the SARS-CoV-2 could attach to surface receptor ACE2 on the target cells (Figs. 1 and 2) [10] . In general, infection with SARS-CoV-2 contributes to the onset of inflammation in the human upper and lower respiratory tract [3] . Nearly a few months after the onset of COVID-19 disease, people with acute atypical respiratory disease and pneumonia refer to the hospitals and clinical settings. According to clinical observations and the susceptibility of patients, mild, moderate, severe, and critical forms of the COVID-19 disease have been recorded [8] . In the mild form, minor respiratory and gastrointestinal symptoms are common. The patients with moderate form are diagnosed with a lack of prominent hypoxemia while CT imaging exhibits some lesion inside the pulmonary tissue. In the severe forms of COVID-19 disease, patients suffer from severe hypoxemia and acute pneumonitis. With the progression of symptoms and the occurrence of critical form, an acute respiratory distress syndrome was initiated followed by renal and myocardial injury, encephalopathy, and coagulation disorders [8] . The surface ACE2 receptors account for the cellular entry of SARS-CoV-2. This virus uses the serine protease termed TMPRSS2 for priming S protein [11] . Like other cells, the ACE2 receptor is present on the surface of respiratory epithelial cells which makes these cells more susceptible to SARS-CoV-2 infection rather than cells with low levels of ACE2 receptor [12] . This coronavirus harbors a nucleocapsid with 30 kb + ssRNA [13, 14] . The whole-genome sequence of SARS-CoV-2 is greatly identical and unique [15, 16] . It has been thought that the main pathological effects of the coronaviruses correlate with + ssRNA with a 5′-cap structure and 3′poly-A tail [17] [18] [19] . After entry into the target cells, RNA plays as a template sequence to translate the non-structural Fig. 1 SARS-CoV-2 is encased within a fatty membrane (envelop) and has a very large genomic pool with nucleotides around 3 × 10 4 . The viral structure is composed of membrane protein, nucleoprotein, envelope small membrane protein, hemagglutinin, single-strand positive sensel RNA, and spike glycoprotein (a). Two types of cup-shaped spike glycoproteins subunits S1 and S2 are present on the viral surface which attach the viral body to the host cellular receptor ACE-2 (b). Membrane protein = M; Nucleoprotein = N; Envelope small membrane protein = E; and Hemagglutinin = HE. The illustration was created with BioRender.com polyproteins like replicase polyprotein 1a and 1ab [20] . The complex of polyprotein 1a/1ab and sgRNAs sequences acts as a replicon-transcription machinery system that is surrounded by a primary double-membrane vesicle [21] . The transcription regulatory sequence, namely ORF, controls the production of subgenomic mRNAs [22, 23] . Among different ORFs identified in the whole genome segments, the sequence located between the ORF1a and ORF1b plays a critical role in the transcription and translation of polypeptides 1a and 1ab. These proteins are further modified by viral chymotrypsin-like protease, Mpro, and two papain-like proteases [10, 14] . Along with ORF1a and 1b, other ORFs participate in the synthesis of different structural polypeptides such as envelope, external spike, viral membrane peptides, and nucleocapsid [24] . The previous experiments have shown that the variety of protein products is closely associated with the activity of sgRNAs [25] [26] [27] . Once a cell is infected with coronaviruses, the cytopathic effects are detectable in the host cells due to the activity of both viral structural and functional proteins. In support of this notion, detailed investigations of viral pathogenesis revealed that the non-structural proteins could prohibit the innate immune system activity [28] . It has been established that the activity of spike glycoproteins is essential to make a physical connection between virions and the host cell receptor. Spike proteins are classified into main subunits namely S1 and S2 [29] . The subunit S2 possesses a transmembrane domain and a cytoplasmic Fig. 2 The proliferation of SARS-CoV-2 within the host cells initiates soon after attachment of S protein (S1 and S2) to the cell membrane-bound ACE-2 receptor. Allosteric changes in S protein promote viral envelope fusion with the cell membrane through endosomal signaling. Inside the cells, the genomic pool is released, transcribed, and translated to synthesize various components of viral structure. Finally, viral proteins and genome RNA are assembled into virions in the endoplasmic reticulum and Golgi apparatuses and transported into microvacuoles. In the next, step, the microvesicles containing virions are released. After infection of host cells with COVID-19 nanoparticles, the release of virions promotes pyroptosis and massive cellular damage. The neighboring cells such as endothelial cells, dust cells (alveolar macrophages) start to release an array of cytokines and chemokines. With the progression of cellular damage, blood lymphocytes (either T and B), as well as macrophages, are recruited to the site of infection. Accumulation of immune cells exacerbates the inflammatory responses by the continuous production of inflammatory cytokines. Interleukine 10: IL-10; Interleukine 6: IL-6; granulocyte colony-stimulating factor: G-CSF; Macrophage inflammatory protein 1α: MIP1α; Interferongamma: IFNγ; Interleukine 2: IL-2; Tumour necrosis factor-α: TNF-α. The illustration was created with BioRender.com tail with a fusion-like activity and is highly conserved among all members of the family Coronaviridae [30] . On this basis, many pharmaceutical interventions target S2 as the main anti-viral therapeutic medication [31] . The estimated mutation rate is high within the genomic pool of SARS-CoV-2 and other RNA viruses which supports rapid expansion and transmission to human and other species [32] . The proliferation and site-direct activity of SARS-CoV2 in the host cells are set actually by absolute mutations. In most COVID-19 confirmed cases, severe pulmonary inflammation has been reported to coincide with excessive activity of immune cells [33] . Polyclonal recruitment of immune cells with disturbed activation thresholds and cytokine release contribute to irreversible tissue injury (Fig. 2 ) [34, 35] . Cytokine array analysis has revealed that IL-6 is the ringmaster of this story. B lymphocytes and numerous cells within the tissues are capable of IL-6 production and release. This cytokine accelerates the differentiation of B lymphocytes into inflammatory cells and increases a fraction of cell populations required for acute phase reactions [36, 37] . Elevated local levels of IL-6 in the target tissues after infection with SARS-CoV-2, mainly lungs, trigger the synthesis and release of acutephase proteins and intensify pathological changes [38] ."}, {"section_title": "Antiviral Mechanisms of Stem Cells", "text": "As a common belief, stem cells are undifferentiated multipotential cells with the potential to commit toward multiple cell types. This capacity is referred to as trans-differentiation [39] . These cells commonly enter the asymmetrical division to produce a large number of the same cell phenotype to selfrenew and maintain tissue homeostasis [40, 41] . The main question is whether the sensitivity of stem cells and other cell types varies against certain viral infections and there are distinct sets of antiviral responses and innate immunity in stem cells enabling them to reduce the risk of viral infection. If we hypothesize an equal probability between differentiated and undifferentiated cells of being infected by a certain virus, thus stem cell sources will be eliminated in the not too distant future The potential reasons why the prominent antiviral responses are integral to stem cells supported by evidence has been gathered from previously published studies [42] . Given the inability of viruses like myxoma virus, West Nile virus, and cytomegalovirus, to infect stem cells, one could propose that these cells are armed with rapid anti-viral clearance systems [42, 43] . Such defense shields allow stem cells to be in a constant state of health after exposure to different external stimuli ( Fig. 3 ; Table 1 ) [44] [45] [46] . This notion also derives from the fact that stem cells can produce functional cells and are capable of repopulating injured cells under pathological conditions [47] . Of course, stem cells are variably permissive and susceptible to different viruses and favor diverse responses after infection. For instance, it has been shown that human hematopoietic stem cells could be infected with retroviruses and herpesviruses [48] . This process could lead to the selective loss of certain stem cell types in a distinct niche, showing relative resistance of different stem cells to certain viral infections. Preliminary evidence of human NSCs infected with cytomegalovirus was presented previously. Although NSCs were permissive for cytomegalovirus, the replication of the virus was prohibited at the levels of the immediate-early Inoculation site viral load↓, Viremia ↓, and lymphoid tissues tropism↑ [112, 113] gene expression [43] . Monitoring the number of viral genomes in the infected NSCs using sensitive gene-analysis methods showed that the average viral genome copy number was diminished over time but was not eliminate, suggesting viral genome integration with the DNA [43] . Regarding the existence of a complete machinery system for viral replication in mature cells, this phenomenon can lead to the propagation of the virus from stem cells to the neighbor mature cells, showing that these cells might act as a reservoir for the cytomegalovirus. If we propose the lack of highly resistant mechanisms in stem cells to the viral infections, the reduction of stem cell pool per se decreases the regeneration potential of tissues and triggers subsequent aging and functional defects [49] . In this line, several intricate resistance mechanisms with prompt activity are mandatory to support host stem cells at the time of viral infections thus favors the stem cell resistance hypothesis [50, 51] . Yet, this capacity, which without a doubt is of interest in regenerative medicine should be determined by further investigations. Perhaps it should be noted that the existence of a unique genomic profile and proteomic machinery in stem cells potentiates these cells to maintain and restore normal physiological activity after viral infections [52] . In particular, it confirmed that the stem cells do not express specific receptors or limited areas of the cell membrane are coved with target receptors. These features limit direct contact and crosstalk between the viruses and stem cells [53, 54] . Mutual crosstalk between the different cellular constituents of tissues (stem cells and differentiated cells) has been shown in the local microenvironment namely niche [55] . Stem cells are in close contact, either paracrine or juxtacrine manner, with the neighboring cells to sense the external clues, exchange the biological information, and respond appropriately to the injuries [56, 57] . Even though, if we consider the existence of unique anti-viral resistance responses in stem cells, the infection of differentiated neighboring cells can, to a lesser extent, affect the normal function of stem cells [58] . Yet, the detrimental effects of viral infections on differentiated cells and the dynamic interaction of these cells with stem cells have not been elucidated completely. Commensurate with these descriptions, it would not be nonsense to say that antiviral resistance is vital to each cell type and is distinctively regulated between stem cells and differentiated cells [42, 59, 60] . Progress in our data about stem cell biology has highlighted the crucial impact of several anti-viral defense mechanisms in these cells once exposed to the viruses. In the below sections, we highlighted the putative anti-viral mechanisms used by the stem cells."}, {"section_title": "Interferon Associated Signaling Pathways and Antiviral Activity in Stem Cells", "text": "Most of the cells use different mechanisms to prohibit the infection with various intracellular agents. IFN signaling cascade is the cellular defense in the frontline which is commonly engaged by most cell types [129, 130] . IFN signaling is activated against the dsRNA of different viral masses except for retroviruses. Immediately after attachment of the virions to cell membrane-bound receptors, such as TLR-3, MDA5, and RIG-I, the expression of downstream effectors, mainly IRF-3, -7, and NF-κB increased, leading to bulk production of IFNs [84] . In the next step, IFN is released from the target cells and alert cells in autocrine and paracrine manners [131] . Upon IFN binding to receptors, activation of the JAK/STAT pathway can lead to the expression of multiple genes commonly termed ISGs [78] . ISGs initiate diverse intracellular anti-viral mechanisms inhibiting the cellular machinery that regulate virus proliferation. Importantly, the stimulation of target cells with IFN activates specific proteins which in turn limit horizontal transmission of viruses through the cell membrane [132] . For instance, the IFITM protein, as innate effector proteins, restrict cell entry of enveloped viruses. Along with IFITM activity, another peptide so-called BST2 prohibits the evasion of virions from infected host cells to other cells [133] . At the genetic levels, IFN ignites the production of non-coding RNAs consisted of long non-coding RNAs, microRNAs, and circular RNAs [134] . Despite the occurrence of these molecular pathways inside most mature cells, it is thought that stem cells are exceptional to some extent concerning viral infection. Evidence points out the intensity and durability of IFN-related responses are different in stem cells than that of most mature cells. The data suggested the absence of IFN synthesis in stem cells after the exposure to active viral particles or incubation with poly I: C (a mimic of dsRNA) [135] . This apparent discrepancy could be explained by different factors. It should be suggested that strong tolerance and higher thresholds are seen in stem cells for viral infections and these cells could lower the concentration of cellular effectors which are critical for viral replication [43] .\nBased on a recent study, it has been shown that the absence of effective IFN-related responses in multipotent cells is linked to a lack of diverse signaling effectors [86, 136] . Unlike immortalized cells such as HeLa cells, human ESCs harbor lower contents of dsRNA biological sensors such as TLR3, MDA5, OAS1, and PKR [86] . Attempts to show the potential importance of stemness in restricting viral infection did reveal that stem cell commitment toward hepatic and neural lineages induces the production of dsRNA sensors such as MDA5 and OAS1, which provides essential elements for viral replication [115] . Of course, the potency of negative regulators in viral replication in different stem cells should not be neglected [115] . As described by Hong et al., the basal level of SOCS1, an inhibitor of the JAK/STAT pathway, is more in ESCs compared to most of the differentiated cells [115] ."}, {"section_title": "Unlike most cells, canonical IFN-associated responses have been determined in stem cells against viral infections.", "text": "Although some controversial studies showed that ESCs and embryonic carcinoma cells could not produce type I IFN following exposure to viruses and displayed a very faint reaction against exogenous IFN [115, 135, 137] . These data show that the antiviral activity of stem cells is not completely dependent on canonical IFN signaling [115, 135, 137] . This apparent discrepancy may relate to the fact that tissue-dependent activity and the activation of quiescent stem cells could affect IFNbased anti-viral mechanisms [115, 135, 137] . Further investigations are highly demanded to address the ambiguity. Lin and co-workers confirmed the potency of human NSCs to synthesize IFN-β and -λ1 after incubation with dsRNA mimic and activation of ISGs [83] . All effectors like RIG-I, MDA5, and TLR3 are induced in human NSCs in the presence of dsRNA mimic and exogenous IFN-β [83] . In NSCs cocultured with Zika, Japanese encephalitis viruses, RIG-Iassociated IFN-β expression has been detected [83] . Hong and co-workers declared mouse and human ESCs, and human iPSCs exhibit interferon stimulation resistance [115] . However, the critical role of ISGs and their association with the cellular innate immune system remains unidentified [138, 139] . Calling attention, a limited subset of ISGs is produced in human, chimpanzee, and mouse ESCs, iPSCs, and adult stem cells [46, 140] . The expression profiling of ISGs varies between the different stem cell types. However, the basal levels of the ISCs are diminished during commitment toward mature cells and maintain at the minimum levels. It was postulated that some ISG products have a close association with stem cell fate [141, 142] . Hence, the mature and differentiated cells respond differently to the IFN [143] . Similar to other stem cells, MSCs could respond to viral infections by the alteration of ISGs in two ways. Upon exposure of MSCs to virions, the levels of ISGs increase which can lead to exogenous IFN in other cells. Therefore, MSCs display both intrinsic and inducible ISG-associated antiviral activities [144] . These data likely demonstrate that local and systemic application of MSCs contributes to therapeutic outcomes in COVID-19 patients through the alteration of anti-viral mechanisms in other cells. Compared to mature cells, IFITM family members are abundantly seen on the stem cell surface [145, 146] . Of note, the suppression of IFITM1, 2, and 3 in ESCs sensitizes these cells to viral infection, suggesting the anti-viral activity of IFITMs [145, 146] . The activation of ISGs could provoke other antiviral mechanisms, such as BST2, MOV10, and IDO1, in the human and mouse stem cells. These elements bind directly to retroviruses. Similarly, enhanced ISGs activity with the increase of BST2, MOV10, and IDO1 factors could suppress the activity of endogenous retroviruses [122, 123] ."}, {"section_title": "Antiviral Activity of RNA Interference in Stem Cells", "text": "RNAi is a biological phenomenon by which specific genes are silenced by using nucleic acids consisted of 20-30 nucleotides [62, 127, 147] . It has been shown that RNAi has a unique antiviral activity [127] . Upon viral infection, a cytoplasmic RNase, namely Dicer, hydrolyzes dsRNA, and produce a large set of siRNAs [127] . These siRNAs are not free inside the cytosol thus captured by Ago. The combination of siRNAs-Ago with other proteins forms a multi-protein complex namely RISC. After maturation of the RISC structure, siRNAs are degraded according to their sequences [74] . It was postulated that Ago and RNAi need each other for maximum activities. For example, Schuster and colleagues discovered a less potent anti-viral activity of RNAi against + sRNA viruses like yellow fever virus, and encephalomyocarditis virus in Argonaute-2 −/− human cells [62] . Certain viruses circumvent these innate antiviral responses in different ways. For instance, Coxsackievirus B3 harbors a viral 3A protein complex with a virus-encoded suppressor of RNAi to inhibit the activity of eukaryotes RNAi [148] . Even, transfection of cells with mature siRNAs to stimulate RNAi does not contribute to the synthesis of long dsRNA [149] . Compared to differentiated cells, progenitors and ESCs have the potential to produce long dsRNAs [150, 151] . On this basis, ESCs have distinct siRNAs reservoirs that are not detectable in most cells. It is thought that these siRNAs are originated from dsRNAs produced by endogenous retrotransposons activity [42, 152, 153] . This capacity enables stem cells to acquire unique antiviral defense mechanisms which are largely due to the modulation of RNAi. Transfection of murine ESCs with EMCV produced intracellular EMCV-derived siRNAs with a certain size and 3' overhangs nucleotides [66, 95] . It seems that the simultaneous degradation of RNAi and the promotion of IFNrelated responses could overlap once anti-viral immunity is initiated [154, 155] . The suppression of MAVS in mouse embryonic fibroblasts aborted the functionality and collaboration of dsRNA sensors with IFN products [96] . Unlike mature cells, stem cells commonly use different anti-viral pathways once infected with viruses to alert other cells and to regulate their activity. For instance, the initiation of IFN response in HepSCs, activates cytotoxic T cells, NK cells, and dendritic cells and prevents viral infections in most cells [156] . The existence of endogenous retroviral infection in stem cells is another mechanism by which these cells could decrease the viral entry [140] . This pattern suggests that stem cells limit the integration of exogenous viral genome with DNA by the occupation of common integration sites [140] . Studies have shown that the activation of HERVK endogenous retroviruses in ESCs produce Rec, an RNA transport factor, and activates IFITM1, leading to restricted viral replication [140] . This strategy will work when common integration sites are preoccupied by the endogenous viral genome or the same replication machinery systems exploited."}, {"section_title": "TLRs Have Antiviral Activity in Stem Cells", "text": "The TLR signaling pathway plays a fundamental role in most cells during inflammation. TLRs belong to the type 1 integral proteins and are stimulated by different PAMPs, for example, proteins, lipids, nucleic acids, lipoproteins, etc. [157] . Different subsets of TLRs including TLR1, 2, 4, 5, 6, and 11 are located at cell membranes while other family members such as TLR3, 7, 8, 9 are associated with organelles like lysosomes, endosomes, and reticular endothelium (Fig. 4 ) [158] . Like mature cells, stem cells could express different classes of TLRs [159] . The activation of TLRs could increase Fig. 4 Cross-talk between TLRs and NrF2 signaling pathways in the viral infection. Endosomal TLRs including TLR 3,4,7,8,9 recognize the viral ssRNA and dsRNA. Stimulation of TLR7 by viral RNAs causes the production of NADPH oxidase which is an imperative factor in the connection of two signaling pathways and in results activation of NrF2 downstream pathways. Additionally, activation of TLR3 leads to the production of other anti-oxidant elements related to NrF2 pathways such as HO-1, which participates in the activation process of stress response transcription factors including NrF2, NF-KB, and AP-1. TLR 3 and 7 also appreciate the initiation of autophagy which can deliver the nucleic acid fragments of viruses to the endosomal TLRs and leads them to degradation by recruiting autolysosomes. On the other hand, NrF2 signaling pathways are in a relationship with the stemness of stem cells by inhibiting the activation of OCT4 and NANOG proteins by using ubiquitin/proteasome. The illustration was created with BioRender.com the synthesis of different pro-inflammatory cytokines and regulate paracrine activity in stem cells via the modulation of the NF-B/IKB/TRIF/MYD88 pathway, leading to the inhibition of apoptotic changes [160, 161] . Among TLRs, endosomal TRLs such as TLR3, 7, and 8 are recognized with the potential to detect and bind to viral ssRNA and dsRNA (Fig. 4) [162] . Control of inflammatory responses is an efficient strategy that allows the stem cells to escape from apoptosis [163] . As described previously, the apoptosis signaling pathway is commonly induced in the host cells to limit the spread of the virus to juxtaposed cells [164] . Concerning certain antiviral properties and crucial importance for stem cell survival, it appears that apoptosis is differently regulated in these cells [165] . Unlike differentiated cells, stem cells are highly resistant to apoptosis [165] . In other words, a greater degree of resistance to apoptotic changes makes stem cells efficiently eliminate viral particles by using inflammatory mechanisms that are not well-tolerated by differentiated cells. Whether apoptosis is involved in viral clearance in stem cells has been the subject of debate.\nAmong different factors triggered after stimulation of TLRs, the Nrf2 signaling pathway plays a pivotal role in the regulation of inflammatory [166] . Upon activation of TLRs in stem cells, both NF-B and Nrf2 factors are recruited [167, 168] . When activated, Nrf2 regulates the activity of antioxidant enzymes, cytoprotective properties against endogenous and exogenous stresses, and autophagolysosome formation (Fig. 4) [169, 170] . In normal conditions, Nrf2 is bounded to actin-associated Keap1 protein inside the cytosol to keep Nrf2 away from proteasomal degradation following ubiquitination [171] . Under conditions like oxidative stress, the NrF2-keap1 complex is degraded coincides with markedly decreased E3 ligase activity of Keap1. Downstream signaling events lead to NrF2 phosphorylation by protein kinase C activity and translocation into the nucleus [172, 173] .\nPluripotency factors such as OCT4 and NANOG are highly ubiquitinated in stem cells and co-localized with Nrf2 to maintain stemness feature [172, 173] . The heterodimerization of NrF2 with Maf proteins in the nucleus produces anti-oxidant elements [174] . Besides, the activation of endosomal TLRs such as TLR3, 7, 8, and 9 promotes the formation of Nrf2-keap1 and prominent anti-oxidant capacity in stem cells [174, 175] . It has been shown that the stimulation of TLR7 by Resiquimod leads to NADPH oxidase activation and promotion of the Nrf2 signaling pathway [176] . Similar to these changes, the up-regulation of TLR3 could also promote Nrf2 anti-oxidant activity via the regulation of HO-1 [177] . HO-1 is touted as key transcriptional factors of stress responses including Nrf2, NF-B, and plasminogen activator inhibitor-1 [178] .\nOwing to the distinct activity of the Nrf2 in stem cells and its association with TLRs [179] , it seems that the promotion of inflammatory response and Nrf2 activity is integral to antiviral defense in these cells.\nLike a close association of the Nrf2 signaling pathway with diverse cellular activities, Nrf2 could also activate autophagy and proteasomal activity during pathological conditions [179, 180] . To this end, Nrf2 controls the biogenesis of the 20S proteasome via the modulation of chaperones activity [179, 180] . The was recently shown that Nrf2 regulates proteasome activity in ESCs via the action of the proteasome maturation protein [172] . Upon viral entry, the close crosstalk between autophagy and TLR signaling pathway potentiates the cells to deliver the genomic fragments of viruses to endosomal TLRs and activates antiviral innate immune response (Fig. 4) [181] . Interestingly, the inhibition of MYD88 and TRIF, belonging to the TLR signaling pathway, prevents autophagic response in stem cells [182] . Besides, autophagy machinery digest several viral components by the formation of autolysosomes [183] . The activation of TLR3 and 7 promotes autophagic responses once ssRNA and dsRNA are released inside the host cells [182] . Upon activation of TLR3 and 7, the formation of the Beclin-1-Vsp34 complex initiates consecutive autophagic reactions [182] . The recruitment of selective autophagy receptors such as NBR, NDP52, p62 helps cells to kill intracellular virions [184] . These autophagy receptors possess capture domains like LC3-interacting regions which direct viral components to autophagosomes [185] . For example, the capsid of Sindbis, as RNA positive virus, is captured by a p62dependent manner without using the ubiquitin system [185] . The exact mechanisms of the autophagy machinery system have been remained unclear. Overall, TLRs could have an axis role in the antiviral mechanisms of stem cells. These properties of stem cells might be a shed of light to use them in the field of stem cell therapy for the rest of human life especially for COVID-19 which has been spread globally."}, {"section_title": "The Antiviral Activity of Stem Cell Via EVs", "text": "The shedding of viral particles using EVs such as exosomes is an alternative defensive strategy in stem cells to eliminate virions [186] . Exosomes are nanosize vesicles ranging from 40 to 200 nm with the ability to carry the arrays of genomic and proteomic elements out of the cells. These particles maintain reciprocal paracrine crosstalk between the different cells [187] . It has been shown that the activation of exocytosis mechanisms is a compensatory mechanism in virus-infected cells [186] . EVs have some structural similarities to viruses. Due to the existence of inherent similarities between the EVs and viruses, in particular, small size dimensions, it is logical to propose that viruses and EVs use common mechanisms for intracellular trafficking, cell entry, and exocytosis (Fig. 5 ) [188, 189] . Upon the replication of viral particles inside the host cells, EVs act as delivery vectors. EVs collaborate with virus assembly machinery to pack viral-derived nucleic acids, lipids, proteins, and lipids, and take them to out of the cells [190] . Concerning similarities in the mechanism of EVs and viruses biogenesis, sophisticated manipulations could lead to the control of virus replication or vice versa. Notably, exosomes isolated from virus-infected cells harbor genetic elements which further inhibit the propagation of the virus in neighboring cells. For instance, studies have shown that up-regulation of let-7f, miR-145, miR-199a, and miR-221 in exosomes from umbilical MSCs can inhibit the replication of the Hepatitis C virus in the other cells. These genetic tools enter the acceptor cells and inhibit the propagation of virions after direct binding to viral genomes via targeting host factor insulin-like growth factor 2 mRNA-binding protein 1 [191, 192] . Of course, the shedding of viral particles from stem cells could decrease the intracellular accumulation of viral bodies meanwhile increases the risk of viral infection in neighboring cells. Based on recent studies, it has been shown that some exosomal microRNAs could regulate the specific genes correlated with SARS-CoV-2 RNA replication [193, 194] . The existence of miR-23b in bone marrow MSCs exosomes could inhibit ORF8 protein and limit the interspecies transmission of the SARS-CoV-2 virus [193, 194] . Besides, exosomal miR-1246 has the potential to regulates angiogenesis by the activation of the Smad 1/5/8 signaling cascade. This miRNA also controls ORF3a, a sodium or calcium ion channel protein, and thus the replication of the virus is diminished [195, 196] .\nThe hemagglutinin-esterase, a glycoprotein, is located on a viral envelope that facilitates reversible attachment to Oacetylated sialic acids via lectin-like activity [197] . This enzyme exists in both Influenza and coronaviruses like the SARS-CoV-2 virus. It was suggested that MSCs exosomes could inhibit the hemagglutination activity of influenza viruses and decrease viral entry to most cells [198] . Taken together, the existence of exocytosis in stem cells helps these cells to decrease the load of virions inside cytosol and to use exocytosis-related mechanisms in neighboring cells to inhibit the transfection rate."}, {"section_title": "Conclusions", "text": "Commensurate with the above-mentioned comments, it is logical to mention that stem cells are less sensitive to coronaviruses such as SARS-CoV-2, unlike differentiated cells. This concept is not absolute and caution must be considered when we talk about the SARS-CoV-2 resistance of stem cells. There is close crosstalk between the stem cells and different cells within different organs to maintain basal stem cell function. Therefore, it seems that the occurrence and duration of COVID-19 and injury of mature cells could interrupt reciprocal crosstalk between undifferentiated and Fig. 5 The similarity in exosome biogenesis and virus assembly system makes virus to use exosome biogenesis pathways for delivery and cell exit. The illustration was created with BioRender.com differentiated cells which further affects the supportive role of other cells on stem cells. Concerning the existence of various escaping ways in stem cells to adopt a virus-resistant state, it is less likely these cells become infected with the coronaviruses in the early stages. If we hypothesize that they are eventually will be infected, they are not a front-line cell target.\nAcknowledgements All authors would thank the Stem Cell Research Center staff for guidance and help. This study was supported by a grant from Tabriz University of Medical Sciences.\nAuthor Contributions H.S.B., M.K., M.H. and H. R. collected data, prepared draft and wrote the manuscript. E.S., and R.R. edited and supervised the study.\nData Availability Not applicable."}, {"section_title": "Compliance with Ethical Standards", "text": "Ethical Approval Not applicable."}, {"section_title": "Consent to Participate Not applicable.", "text": "Consent to Publish Not applicable.\nCompeting Interests All authors declare there is no conflict of interest.\nAbbreviations OAS1, 2'-5'-oligoadenylate synthetase 1; ACE2, angiotensin-converting enzyme 2; Ago, Argonaute; BST2, Bone marrow strom a l ant i g e n 2 ; d sR N A , D ou bl e -s t r a n de d R N A ; E M CV , Encephalomyocarditis virus; EVs, Extracellular vesicles; HepSCs, Hepatic stem cells; HO-1, Heme oxygenase-1; ESCs, Human embryonic stem cells; iPSCs, Induced pluripotent stem cells; IFN, Interferon; IRF-3, -7, interferon regulatory transcription factor-3, 7; IFITM, Interferon-induced transmembrane; ISGs, Interferon-stimulated genes; IL-6, Interleukin-6; Mpro, Main protease; MDA5, Melanoma differentiationassociated protein 5; MAVS, Mitochondrial antiviral-signaling components; NK cells, Natural killer cells; NBR, NBR Neighbor of BRCA1; NDP52, Nuclear dot protein; NSCs, Neural stem cells; Nrf2, Nuclear factor erythroid 2-related factor 2; MSCs, Mesenchymal stem cells; NF-κB, Nuclear factor kappa B; ORF, Open reading frame; PAMP, Pathogen-associated molecular patterns; PKR, Protein kinase R; RIG-I, Retinoic acid-inducible gene I; RNAi, RNA interference; RISC, RNAinduced silencing complex; SARS-CoV-2, Severe Acute Respiratory Syndrome Coronavirus-2; +ssRNA, Single-strand positive-sense RNA; siRNAs, Small interfering RNAs; sgRNAs, Subgenomic RNAs; SOCS1, Suppressor of cytokine signaling 1; TLR, Toll-like receptor"}]