[{"section_title": "Abstract", "text": "Using a national farm survey, this study estimates a logit model to identify factors affecting U.S. farmers' participation in agritourism. Of the dummy variables, public access to the farm for recreation has the greatest positive impact, followed by farms near central cities, farms in Rocky Mountain and Southern Plains regions, farmers with college education, farmers paying for farm advice, farms organized as partnerships/corporations, farms enrolled in conservation programs, and farmers with access to the internet. Continuous variables affecting participation include acres of owned land, percent of land unsuitable for crops, operator age, and distance to cities. Targeting farms and farmers with these traits can increase the success of agritourism promotion efforts."}, {"section_title": "", "text": "The purpose of this research is to identify farm and farm operator characteristics associated with farmer participation in agritourism, a niche agricultural activity that has been connected with several societal goals in recent years, including wildlife conservation, obesity reduction, and survival of small farms in the global economy. The goal is to provide information that can be used to fashion and target assistance to farmers considering entering into agritourism as well as those already participating in this activity. If successful, such efforts might benefi t the agricultural economy while at the same time making headway on some of the aforementioned environmental and healthrelated objectives. Among those who might benefi t most are low-income, undereducated, and older farmers, as well as small family farms. This research also suggests that agritourism farmers in some regions may have comparative advantages over those in other regions.\nAgritourism includes a wide variety of activities. According to the University of California (UC) Small Farm Program (2011), agritourism refers to \"a commercial enterprise at a working farm, ranch, or agricultural plant conducted for the enjoyment of visitors that generates supplemental income for the owner.\" McGehee and Kim (2004) , in a study of small family farms in Virginia, found that the most popular agritourism activities there included pick-your-own operations, Christmas tree sales, hayrides, children's educational programs, petting zoos, and on-farm festivals. Weaver and Fennell (1997) , which examined vacation farms in Saskatchewan, Canada, found that wildlife viewing, hunting, and casual photography were the most popular activities. According to Che (2007) , day-trip activities, which include picking fruits and vegetables, corn mazes, and petting zoos, characterize U.S. agritourism farms near urban areas. A survey question about agritourism and recreational services in the U.S. Department of Agriculture's (USDA's) 2007 Census of Agriculture (National Agricultural Statistics Service) included activities \"such as hunting, fi shing, farm or wine tours, hay rides, etc.\" Although not explicitly listed in these defi nitions, agritourism may also include horseback riding, harvest festivals, onfarm rodeos, hospitality services (such as hosting weddings and other events), and overnight stays on farms and ranches.\nAlso known as farm-based recreation, agritourism has long been used by farmers as a source of income. In recent years, outdoor recreation-a main form of agritourism-has come to the attention of federal policymakers as well. This is refl ected in the 2008 Farm Act (The Food, Conservation, and Energy Act of 2008, U.S. Congress, , which authorized $50 million in funding to establish the Voluntary Public Access and Habitat Incentive Program, which issues federal grants to state and tribal public access programs that \"provide rental payments and other incentives, such as technical or conservation services to landowners who allow the public to hunt, fi sh, or otherwise appropriately recreate on their land\" (Farm Service Agency 2010). The program was featured in the Obama Administration's recently announced America's Great Outdoors Initiative, which brings together \"farmers and ranchers, land trusts, recreation and conservation groups, sportsmen, community park groups, governments and industry, and people from all over the country to develop new partnerships and innovative programs to protect and restore our outdoors legacy\" (White House 2010) .\nThis growing interest in agritourism, at least in terms of national policy, likely stems from several sources. As indicated by the new federal initiative, there is a growing interest in nature-based outdoor recreation and in the natural environment on which it is based. Surveys by the U.S. Wildlife Service (1996, 2006) showed that the number of wildlife-based recreation participants in the United States grew by 1.5 million between 1996 and 2006 despite some reductions in fi shing and hunting. The increase occurred primarily in wildlife viewing and photography (Cordell, Betz, and Green 2008) .\nAgritourism can not only help meet growing demand for nature-based activities but can provide economic incentives to farmers to preserve agricultural land and related natural amenities such as forests, streams, and wildlife. For example, farmers can profi t by putting some of their land under a conservation reserve as habitat for wildlife and can raise money by hosting bird watching, photography, hunting, and fi shing activities.\nAgritourism may also be attracting more interest due to growing consumer demand for fresh local foods, which are often featured by agritourism operators who specialize in pick-your-own operations and roadside stands (Martinez 2010 Agritourism has long been an attractive option for farm operators who wish to supplement their incomes and increase returns on their farm assets (Bernardo, Valentine, and Leatherman 2004, UC Small Farm Center 2011) . Agritourism creates employment opportunities for the operator and for family members (Carter 1998) , though some agritourism activities, such as fees for hunting and fi shing, may require little time and effort from the operator. Agritourism can promote diversifi cation of farm activities and sources of income and can reduce the farm household's dependence on factors beyond their control, such as weather (Carter 1998 , Fuller 1990 , Veeck, Che, and Veeck 2006 . Many agritourism activities make use of land unsuitable for crop and livestock production. Consequently, adding agritourism to a farm's operations does not necessarily displace crop and livestock production. In addition, agritourism mainly involves domestic suppliers and consumers; it suffers less than other agricultural commodities from global competition (Veeck, Che, and Veeck 2006) .\nThe local focus of agritourism can benefi t surrounding communities. Farm visitors who purchase local goods and services (including farm products) stimulate the community's economy 1 In our analysis explaining farmers' involvement in agritourism, we ran variations of the model that included individual dummy variables to represent farms specializing in grain, vegetables, fruits, cattle and calves, and dairy production. None of the resulting coeffi cients (shown with t-values in parentheses) was signifi cant: grains, 0.0047 (0.0114); cattle and calves, -0.047 (-0.192); dairy, -0.127 (-0.187); vegetables, -0.121 (-0.156); fruits, 0.183 (0.332) . These results suggest that agritourism does not signifi cantly displace these crop and livestock operations. (Saxena et al. 2007 ). As agritourism attracts urban dwellers to rural areas, urban tourists, especially teens and young adults, have an opportunity to develop an appreciation for rural people and places through their interactions with rural residents. In addition, agritourism can enhance a \"sense of place\" for local residents, giving them more reasons to stay and invest in their communities.\nThe magnitude of the local economic impacts of agritourism farms can be gauged by examining data from the 2007 Agricultural Resource Management Survey (ARMS) by USDA's Economic Research Service (ERS) and National Agricultural Statistics Service (NASS) (USDA 2007) . Though agritourism farms are not particularly numerous in the United States, they covered 84 million acres (nearly 10 percent of U.S. farm land) and employed 17 million full-time-equivalent days of family labor in their farming and agritourism activities. Average gross income from agritourism for these farms was slightly more than $16,000. National total income from agritourism activities in 2007 was $554 million; another $258 million was generated through sales of farm products directly to consumers. 2 These farms on the whole spent $5.3 billion on purchases of cash farm production inputs for all their farm activities, not just agritourism activity. This means that agritourism farms provided an economic stimulus of $5.3 billion to the suppliers of agricultural production inputs in 2007. On average, cash production costs were 66 percent higher for agritourism farms than for all other farms. Despite these higher costs, these farms earned net income of $635 million from all farm activities, not just from agritourism. Agritourism farms earned $2.4 billion of total household income, which consists of the farm household's net farm income, off-farm wage income, off-farm business income, and other nonfarm income. These farmers buy most farm inputs and consumer goods and do most of their banking in local markets, so they have a signifi cant impact on both the local and the national economy.\nAgritourism, therefore, can offer many benefi ts to farmers, their communities, and the public. It follows that educators and policymakers may be interested in knowing the factors that encourage 2 The statistics presented in this paper using ARMS data refer only to the 48 contiguous states, which may in part explain why the total agritourism income computed from the 2007 ARMS data ($554 million) was slightly less than the total agritourism income reported in the 2007 Census of Agriculture ($566 million). farmers to engage in, or help them to remain engaged in, agritourism operations. With this goal in mind, we present an empirical analysis of data from the 2007 ARMS that identifi es such factors and conclude with a discussion of some of the policy implications of these empirical fi ndings."}, {"section_title": "Empirical Analysis", "text": ""}, {"section_title": "Data", "text": "The ARMS contains data collected annually from a sample of U.S. farm and ranch operators.\n3 This study is based on data from the 2007 ARMS Phase III survey, which used a probability-based, stratifi ed, multiframe sample to provide detailed information on farm businesses and their operators from 18,907 usable questionnaires (Banker 2007) ."}, {"section_title": "Theoretical Model", "text": "A farmer's decision to participate in agritourism can be viewed as similar to a choice between a new and a traditional technology (activity). Choice models in consumer theory provide guidance for such decision models (Fernandez-Cornejo 1996) . In our framework, the farmer chooses whether to adopt agritourism based on the maximum utility she expects to derive from net income from the agritourism operation. Following Mishra and Goodwin (2003) , we express the utility maximization equation as\nwhere U(π i ) is the ith farmer's expected or perceived utility from adoption or nonadoption and f () is a function of X i = x i1, . . ., x ik , which is a (1 × k) vector of observable characteristics or factors specifi c to the ith farmer, his farm, and his farm business. The random term ε i represents errors in farmers' perceptions and measurement of expected utility; unobserved characteristics, attributes, and preferences; and instrumental variables (Ben-Akiva and Lerman 1985, Fernandez-Cornejo 1996) .\nLet y i = 1 if the ith farmer adopts and y i = 0 if the ith farmer does not adopt. As the probability of a given farmer adopting or not adopting an innovative activity is bounded by zero and one, a limited dependent variable model like logit or probit is relevant. If ε i is a random variable, is independently and identically distributed, and has a Weibull density function (which is similar to the normal density function but with greater kurtosis-thicker tails), then a logit structure is an appropriate choice model (McFadden 1974 , Maddala 1983 . In the logit model, the probability of the ith farmer adopting an innovative activity is given by\nwhere P i is the probability of adoption given the explanatory variable (X i ) (Amemiya 1981) . Since the exact functional form of f (X i ) is not known a priori, we follow Mishra and Goodwin and assume a linear form ( f(X i ) = X i β) where β is a vector of (1 × k) coeffi cients. However, since β has a nonlinear relationship with probability (P i ), these coefficients are diffi cult to interpret. The coeffi cients can be estimated and interpreted easily by taking the logarithm of the ratio of probability of adoption to probability of nonadoption:\nwhere X i ΄ β is the nonstochastic part of the model and is given by\nThis form of the empirical model was used to estimate the effects of various factors on probability of adoption of agritourism. The data on farm and farm operator characteristics and on farmers' decisions about whether to participate in agritourism were taken from the 2007 ARMS."}, {"section_title": "Empirical Model", "text": "Much progress has been made in recent years toward understanding the factors that affect agritourism. Researchers have identifi ed four broad categories that affect farmer participation in various agritourism activities: (i) characteristics of the farm's land and operation, (ii) the farm household's wealth or net worth, (iii) characteristics of the farm operator, and (iv) the location of the farm (geographic region and rural/urban continuum). 4 A number of studies have evaluated how a specifi c characteristic infl uences agritourism. Important factors related to the farm itself include farm size (Evans and Ilbery 1992 , Bernardo, Valentine, and Leatherman 2004 , Sonnino 2004 , number of acres owned (McGehee and Kim 2004) , a farm's aesthetics (Hilchey 1993) , a farm's attractive characteristics (Rilla 1999 , and the farm household's wealth or net worth (Sonnino 2004) . In terms of the operator of the farm, both internal and external characteristics can be infl uential: age and education (Barbieri and Mshenga 2008) , degree of social skill (Hilchey 1993) , how outgoing the operator's personality is (Rilla 1999) , and the degree to which the operator can seize a profi table opportunity and exploit it (Carter 1998) . Geographic factors include the farm's proximity to urban centers (Hilchey 1993 , Che 2007 , Che, Veeck, and Veeck 2005 , Veeck, Che, and Veeck 2006 , Bernardo, Valentine, and Leatherman 2004 , the farm's distance from urban agritourists (OECD 2009), and regional geographic characteristics such as a region's particular form of natural and farm assets, climate, infrastructure, tastes and preferences, cultural values, socioeconomic conditions, and policy considerations (Che 2007 , Sonnino 2004 . Some researchers have identifi ed both operator and farm characteristics as infl uencing a decision to adopt an innovative activity such as agritourism (Carter 1998 , Nickerson, Black, and McCool 2001 , Mace 2005 .\nThe farm and land characteristics included in this study are number of acres of owned land (X 1 ), percent of land unsuitable for crop production (X 2 ), access allowed to public for recreation on at least part of the farm (X 3 ), forest product sales (X 4 ), and land under a conservation program (X 5 ).\nAgritourism participation should increase with the amount of land owned (not leased). As acreage of land owned grows, the long-term stake the farmer has in the owned land is likely to increase as well, making costly long-term investments related to agritourism more feasible. As the percentage of land that is not suitable for crop production rises, so should the odds of the farmer participating in agritourism because it would provide a means of earning income from those acres. A farm that offers the public access for recreation might also be expected to increase the probability of participation in agritourism. Public access could take various forms, such as allowing people to walk or bike through the property on trails or providing free or paid access for hunting, fi shing or some other recreation activity on some portion of the farm. 5 Regardless of the form of public access, the mere presence of visitors on the farm could provide an opportunity to raise agritourism revenue from these visitors. The sale of forest products implies the presence of woodland on the farm, which might be viewed as a natural feature attractive to visitors, and woodland might support wildlife; both should have a positive effect. Maintaining land in a conservation program also can add to the scenic quality of the farm and provide recreational opportunities for visitors by supporting wildlife for visitors to watch and/or hunt. 6 5 According to the 2007 ARMS data, about 4 percent of all farms provided access to the public for recreational uses, but only 11 percent of these were involved in agritourism. This implies that most or all of the farms that provided access to the public were providing free access to visitors; otherwise, they would have qualifi ed as agritourism farms. Although most (70 percent) agritourism farms did not provide access to the public for recreation, agritourism farms were more likely than other farms to provide such access. 6 A reviewer noted that there may be multicollinearity between two of the explanatory variables: selling forest products and practicing soil conservation. We took three steps to test for multicollinearity between any of the fi fteen explanatory variables. First, we dropped the variable for selling forest products from the model; overall, the results remained unchanged, and the coeffi cient of conservation and the associated standard error remained basically unchanged. With the dummy variable for the amount received from sales of forest products in the model, the conservation variable's coeffi cient and jackknife standard error were 0.5644 and 0.2785, respectively. When we dropped the dummy variable for the amount received from sales of forest products from the model, conservation's coeffi cient and jackknife standard error were 0.5684 and 0.2677, respectively. Second, we conducted the variance infl ation factor (VIF) test. The resulting VIF values (ratio of actual variance to the variance that would occur in the absence of multicollinearity) for the explanatory variables (excluding the intercept) ranged from 1.0078 for selling forest products to 1.1591 for internet, indicating no multicollinearity among the explanatory variables included in our model. Third, we conducted the Belsley-Kuh-Welsch test, which verifi ed that there was no collinearity problem among the explanatory variables used.\nTwo variables in this study are associated with the farm's wealth and organizational structure. Farm household net worth (X 6 ) is a measure of family wealth and a proxy for the farmer's ability to borrow and invest in starting and expanding an agritourism operation. Greater household net worth should positively affect the farmer's probability of participating in agritourism. Structuring a farm as a corporation or partnership (X 7 ) may infl uence the likelihood of agritourism. Carter (1998) found that diversifi ed farms were more likely to be organized as partnerships and to have more complex forms of ownership than undiversifi ed farms. Thus, a corporate or partnership farm organization could have a positive relationship with participation in agritourism.\nThe estimated model includes four variables related to characteristics of the farm operator: age (X 8 ), education (X 9 ), access to the internet (X 10 ), and use of paid farm management advice (X 11 ). Internet access expands a farmer's sources of information on input prices, weather forecasts, actual and predicted output prices, and potential marketing channels, including agritourism. The age of the farm operator can be viewed as both a plus and a minus for agritourism participation. Older farmers may have more experience and practical knowledge, enabling them to better manage a complicated new task such as starting up an agritourism operation. A relatively younger farmer, on the other hand, may have more robust health, optimism, and openness to new ideas and opportunities, as well as a longer planning horizon and pay-off period for an investment in agritourism. Hence, the expected effect is not obvious a priori.\nFormal education, training, and experience are widely believed to increase a person's ability to search for relevant information and to interpret, comprehend, critically analyze, modify, and adapt that information for practical economic decisionmaking (Schultz 1975 , Becker 1993 . In theory, these characteristics would aid a farmer in entering a new activity like agritourism. Similarly, the availability and use of professional advice would be expected to aid farmers engaging in a new activity. However, greater education, training, and professional advice could also lead some farmers to opt out of agritourism because the anticipated costs and benefi ts do not work in their favor. Carter (1998) found that producers who were involved in diversifying their farms (including those who added recreational activities) were more likely to have received training in agriculture and management than producers who did not diversify. Similarly, a recent OECD study (2009) of farm diversifi cation cited research showing that education increased a farmer's likelihood to engage in value-added production, a similar diversifi cation activity. However, agritourism could be different from other diversifi cation approaches in terms of the effects of education and training. So, while there is an expectation of some positive effect for education, a fi nding of no effect would not be surprising.\nStudy factors related to a farm's location are the geographic region it occupies (X 12 and X 13 ), the presence of a central city in the county (X 14 ), and the distance of the farm from the nearest city of at least 10,000 residents (X 15 ).\nGeographic regions can vary widely in terrain, scenic and recreational qualities, climate, and availability of nearby attractions. Those variations affect the type of agritourism activities that are feasible and/or popular and tourists' preferences for particular destinations. Regions also vary in transportation access and availability of hotels. Consequently, it is not obvious, a priori, how a farm's geographic location will affect agritourism. However, the data contained in the 2007 Census of Agriculture are available at the county level and reveal that the percentage of U.S. farms that involve agritourism tends to be highest in highamenity locations such as the Rocky Mountains and in sparsely populated, warmer areas such as the Southern Plains. Some parts of the Northeast, the Black Belt in the Southeast, and the northern Great Lakes also have a higher than average incidence of farmers involved in agritourism (Bagi and Reeder 2011) . Furthermore, data from the 2007 ARMS show that 47 percent of all U.S. agritourism farms are located in just two regions: the Southern Plains (X 12 ) and the Rocky Mountains (X 13 ). The Southern Plains region consists of Texas and Oklahoma, while the Rocky Mountain region refers to the Rocky Mountain states of Arizona, Colorado, Idaho, Montana, Nevada, New Mexico, Utah, and Wyoming. Hence, we hypothesize that farmers in these regions are more likely to adopt agritourism.\nThe urban quality of the farm's community could have several different effects. Proximity to a central city (X 14 ) is expected to have a positive effect on agritourism because of the large number of potential visitors nearby. We anticipate that a longer distance to the nearest city of 10,000 or more residents (X 15 ) will have a negative effect on agritourism because it is likely to decrease the number of urban visitors."}, {"section_title": "Specifi cations of the Estimating Model and Variables", "text": "The empirical logit model and defi nitions of farm-specifi c factors (vector X i ) that affect the ith farmer's utility maximization-and hence the log e of the odds of participation in an agritourism activity-as given in equation (4) can be rewritten as (5) Log e (P i / (1 -\nwhere μ i is a vector of random errors and the X i variables are the explanatory variables. These explanatory variables (X 1 through X 15 ) are described and their means (expressed in percentage terms for dummy variables) and coeffi cients of variation are presented for both agritourism farms and all other farms in Table 1 . Jackknife-based t-values for testing the signifi cance of difference in means for two types of farms (Dubman 2000) are also presented in Table 1 . The logit probability model specifi ed in equation (5) is estimated using maximumlikelihood, and it generates consistent parameter estimates and correct large-sample statistics, including the standard errors. However, the ARMS is based on a complex, stratifi ed-sample survey design. Consequently, the model is fi rst estimated using the maximum-likelihood estimator. Standard errors (and related t-statistics) are then estimated using the delete-a-group jackknife variance method, which is similar to bootstrapping (Dubman 2000) . Included in the output of a logit model is the likelihood-ratio test statistic (chi-squared) and a measure of the goodness of fi t, the likelihoodratio index, which is also known as the McFadden R-square (Pindyck and Rubinfeld 1991) ."}, {"section_title": "Results and Discussion", "text": "The maximum-likelihood estimates, associated standard errors based on the jackknife variance method, odds ratios, and test statistics for the goodness-of-fi t measures generated by the model are presented in Table 2 . The chi-squared statistic (for the log-likelihood test) for the estimation that includes all explanatory variables relative to the estimation with only the constant term (in which the coeffi cients of all explanatory variables are restricted to zero) is 64,610 and signifi cant at a level of less than 0.0001. The F-statistic is 131.52 and is signifi cant at the 10 percent level. All coeffi cients have expected signs and 13 of the 15 coeffi cients for the explanatory variables are signifi cant at the 10 percent or lower level. The model produces a McFadden R-square of 0.182 and 72.3 percent of its predictions are correct ( Table 2) ."}, {"section_title": "Interpretation of Estimated Odds Ratios", "text": "The coeffi cient estimates ( s) presented in Table 2 are natural logarithms (log e ) of the odds of the farmer participating in agritourism activities.\nTo make these easier to interpret and compare from one variable to another, we transform the coeffi cients so that they refer to the effect of a variable on the actual odds of participating rather than on the natural logarithm of the odds. This is achieved by calculating the odds ratio for each explanatory variable as: [the odds ratio for X k = = the odds after X k is increased by one unit] divided by [the odds before a unit increase in X k ] (Long and Freese 2006) . Odds ratios are presented in Table 2 .\nThe odds ratio for a continuous explanatory variable represents the amount of change in the odds caused by a unit change in that explanatory variable with all other explanatory variables held at their means. For example, the odds ratio for X 1 (land owned) is 1.008 (Table 2) . This means that a one-unit increase (100 acres) in land increases the odds of participation in agritourism by 0.008 or 0.8 percent. Similarly, a 1-percentage-point increase in land that is not suitable for crop production increases the odds of agritourism activity by 0.013 or 1.3 percent. The odds ratios for the other continuous variables are interpreted in the same manner.\nInterpretation of the odds ratios related to the dummy variables in the model is straightforward and reveals important information. The odds ratio for the categorical variable of providing access to the public for recreational uses (X 3 ) is 11.311 ( Table 2 ), demonstrating that a farmer who provides public access to the farm for recreational use is, ceteris paribus, 11.311 times more likely to engage in agritourism than a farmer who does not provide such public access. Among the dummy variables included in our analysis, public access had the greatest effect on odds of a farmer participating in agritourism, followed by a farm located in a county with a central city, a farm located in the Rocky Mountain region, a farm located in the Southern Plains, a farm operator with at least a college degree, a farmer who paid for farm-related advice, a farm organized as a partnership or corporation, and a farmer with access to the internet."}, {"section_title": "Conclusions", "text": "Using a national survey of farms, this study has shown that the probability of a farmer's participation in agritourism in the United States is significantly affected by a number of variables related to characteristics of the farm, the farm operator, and the area in which the farm is located. These variables include the amount of land owned, the percent of land that is not suitable for crop production, the allowing of public access for recreational uses to some part of the farm, and whether the land is enrolled in a conservation program. Farm operator characteristics of age, education, access to the internet, use of farm management advice, and the farm's organization as a partnership or corporation had positive and signifi cant effects. In terms of a farm's location, positive effects were found for farms in the Southern Plains and the Rocky Mountain regions and in counties that contained central cities. The distance from the farm to the nearest city of at least 10,000 residents had a negative effect, indicating that proximity to such a city and its urban population is an advantage.\nWith the exception of variables for household net worth and forest sales, which lacked statistical signifi cance, the estimates were consistent with our hypotheses. These results confi rm conventional wisdom about which factors are important for participation in agritourism and thus provide additional justifi cation and guidance to County Extension experts and others at the state and local level in their efforts to promote agritourism on farms that are well-suited to such activities.\nThese fi ndings are particularly useful for individuals who design policies or programs such as education and training, technical assistance, and advertising and promotion and who aim to carefully target limited resources. For example, the importance of public access and a good location can help experts and lenders select where best to focus assistance in efforts to promote agritourism. Similarly, farm owners and managers can use the results to assess a farm's strengths and weaknesses as a potential agritourism venue. The results of our estimations suggest that investment in agritourism operations is not signifi cantly limited by a farmer's wealth. However, limited education, a common characteristic of low-income farmers, points to diffi culties for such farmers in establishing agritourism and staying in business. A lack of education can be offset somewhat by a willingness to solicit management advice from County Extension agents or other experts. Thus it may be possible for a limitedresource, undereducated farmer to overcome educational defi ciencies and succeed in this activity with proper advice.\nMoreover, calculations from the ARMS data show that the net income from all farming activities of the average agritourism farm (or ranch) was small relative to all other farms in 2007. Given that agritourism ventures are associated with a high percentage of land unsuitable for crop production, agritourism-related income may be particularly important for farms and ranches that are struggling to survive economically. Although our logit analysis did not examine variations in agritourism income (which were beyond the scope of this study), the ARMS data reveal that even relatively small family farms (farms with total sales of less than $250,000) where the operator was listed as occupied principally in farming had gross income of more than $20,000 on average in 2007 from agritourism. We were not able to net out the costs associated with agritourism operations since such data were not available from the ARMS. Nevertheless, the magnitude of the gross income numbers suggests that agritourism can provide a signifi cant additional income for small farms. Consequently, even though our logit analysis implies that the likelihood of a farmer's involvement in agritourism rises with the number of farm land acres owned, many small-scale farmers would still fi nd it advantageous to operate agritourism businesses.\nThe 2007 Census of Agriculture data indicate that the areas where farmers are most likely to participate in agritourism (in the Southern Plains and Rocky Mountain regions) are not necessarily places where agritourism generates the most income. The top three states in per-farm agritourism income in 2007 were Hawaii, Connecticut, and New Jersey, and seven of the top twenty states in the nation were in the Northeast. It seems likely that signifi cant variations in per-farm income from agritourism are related to the type of agritourism activities undertaken, which in turn varies from region to region. The nationwide data sets that are currently available are not adequate for such an analysis. If such data were to become available, this research could be extended to identify factors that contribute to a farmer's involvement in more profi table agritourism activities as well as in activities that offer the greatest public benefi ts (e.g., environmental or health benefi ts). Without such data, agritourism advisors will have to rely on other types of research, such as case studies and state-level studies."}]