[{"section_title": "Introduction", "text": "Advances in the field of biomarkers have pushed forward a redefinition of Alzheimer's disease (AD) as a biological construct. 1 Under this definition, the ATN classification system recognizes three general groups of biomarkers for AD: biomarkers of b-amyloid plaques (A), biomarkers of fibrillar tau (T) and biomarkers of neurodegeneration or neuronal injury (N). 1 These categories can be assessed by using different modalities, but those that are more widely implemented are cerebrospinal fluid (CSF) biomarkers and imaging techniques. Amyloid positron emission tomography (PET), CSF Ab1-42 and the ratio Ab1-42/ Ab1-40 correspond to the \"A\" category, Tau PET and CSF pTau to the \"T\" category, whereas 18 F-Fluorodeoxyglucose-PET, anatomical MRI and tTau are considered markers of the \"N\" category. 1 Within the \"A\" category, the concordance between CSF Ab1-42 and amyloid PET imaging is high, but not perfect. [2] [3] [4] [5] [6] In fact, the Ab1-42/Ab1-40 ratio has shown to have better agreement with amyloid PET imaging compared to levels of Ab1-42 alone. 4, [7] [8] [9] In recent years, fully automated platforms have been developed for the analysis of CSF biomarkers. Recently, four CSF analytes (Ab1-42, Ab1-40, tTau and pTau) have been implemented on the fully automated Lumipulse G System, but there are no validated cutoffs for these four AD CSF biomarkers using this platform. Our aims were to determine for the first time the cutoffs that optimized the agreement between 18 F-Florbetapir PET and Ab1-42, Ab1-40, tTau, pTau and their ratios measured in CSF on the LUMIPULSE G600II instrument, and to evaluate the concordance between markers of the amyloid category."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study participants", "text": "We included 94 participants from the Sant Pau Initiative on Neurodegeneration (SPIN cohort) recruited between November 2013 and September 2017 who had available CSF samples and 18 F-Florbetapir PET imaging ( Table 1 ). The SPIN cohort is a multimodal research cohort for biomarker discovery and validation that includes participants with different neurodegenerative dementias, mild cognitive impairment and cognitively normal controls. All participants receive an extensive neurological and neuropsychological evaluation and undergo structural 3T brain MRI, blood extraction, and lumbar puncture for CSF biomarkers. A subset of participants also receives molecular imaging such as 18 F-Fluorodeoxyglucose-PET, amyloid and/or Tau PET. More information on the SPIN cohort can be found at https://santpaumemoryunit.com/ \nWe included 94 participants in the study. Table 1 summarizes demographic characteristics and biomarker results. There were no differences in age or sex between both groups. As expected, the amyloid-positive group had a higher proportion of APOEe4 carriers compared to the amyloid-negative group (52% and 20%, respectively; P = 0.004)."}, {"section_title": "CSF samples acquisition and analysis", "text": "CSF samples were collected in 10 mL polypropylene tubes (Sarstedt, Ref#62.610.018) and transferred to the Sant Pau Memory Unit's laboratory where they were processed within the first 2 h after acquisition. After centrifugation (2000g 9 10 min, 4°C), volumes of 0.5 mL of CSF were aliquoted into polypropylene tubes (Sarstedt, Ref#72.694.007) and stored at À80°C until analysis.\nOn the day of the analysis, samples were thawed at room temperature and the tubes were vortexed for 5-10 sec. To avoid the effect of multiple freeze-thaw cycles, aliquots used in this study had not been thawed before. Ab1-42, Ab1-40, tTau and pTau were quantified directly from the storage tubes containing 0.5 mL of CSF using the Lumipulse G b-Amyloid 1-42, b-Amyloid 1-40, Total Tau and pTau 181 assays on LUMIPULSE G600II automated platform (Fujirebio) and following the manufacturer's instructions. We used an adapter to fit the tubes in the equipment. We used the same batch of reagents for each biomarker throughout the study, and for each sample, we measured all four analytes from the same aliquot and in the same run. The platform was configured to start the analysis with Ab1-42, followed by Ab1-40, tTau and pTau. Buffer-based quality control testing was performed at the beginning of each test day to ensure that all measured values of each control level (low, medium and high) were within the target ranges.\nThe results of the Lumipulse G b-Amyloid 1-42 presented in this study have been standardized according to certified reference material developed by the International Federation of Clinical Chemistry and Laboratory Medicine as recommended by their working group for CSF proteins. 10 Briefly, values of the calibration standards of the LUMIPULSE G600II were adapted to the certified reference material resulting in an adjustment of concentrations that was linearly proportional throughout the range. The aim of standardization to certified reference material is to harmonize immunoassays of Ab1-42 to make results comparable across different platforms.\nAb1-42, Ab1-40, tTau and pTau levels in CSF from participants of this study had been measured previously using other immunoassays (INNOTEST b-AMYLOID , INNOTEST hTAU Ag, and INNOTEST PHOSPHO-TAU (181P) , Fujirebio Europe; and High Sensitivity Human Amyloid b40, Merck-Millipore), and these results were available in our database for their comparison with the LUMIPULSE analyses. [11] [12] [13] [14] [15] The personnel involved in the CSF analyses for this study were blinded to the clinical diagnosis and to previous biomarker determinations."}, {"section_title": "Amyloid-PET imaging acquisition, visual assessment and quantitative analysis", "text": "All participants underwent amyloid PET imaging with 18 F-Florbetapir as described elsewhere. 13 PET data were acquired using a Philips Gemini TF scan 50 min after injection of 370mBq of 18 F-Florbetapir. After obtaining the transmission data, brain PET dynamic acquisition was performed (2 9 5 min frames). The reconstruction method was iterative (LOR RAMBLA, three iterations and 33 subsets) with a 128 9 128 image size, 2 mm pixel size and slice thickness.\nThree expert readers (V.C., D.L-M. and A.F-L.) blind to clinical diagnosis and to CSF biomarkers visually rated all PET scans. Following manufacturer's protocol, scans were classified as \"positive\" when one or more areas showed increased cortical gray matter signal resulting in reduced or absent contrast between gray matter and white matter. Scans were classified as \"negative\" when the contrast between gray matter and white matter was clear. Final classification as \"positive\" or \"negative\" was decided upon agreement of at least two of three readers. Mean inter-reader overall agreement was 88.4% (Min = 87.0%, Max = 90.2%).\nWe also quantified amyloid deposition. Each participant's PET scan was spatially normalized to a MNI152 18 F-Florbetapir template using a linear and nonlinear transformation. 16 Mean 18 F-Florbetapir uptake was measured across frontal, lateral parietal, lateral temporal and anterior/posterior cingulate. Then, the 18 F-Florbetapir standardized uptake value ratio (SUVR) map was extracted using the whole cerebellum as reference. 17 The PET scans of five participants were not suitable for 18 F-Florbetapir quantification and excluded of quantitative analyses."}, {"section_title": "Statistical analysis", "text": "We performed receiver operating characteristic (ROC) analysis for Ab1-42, Ab1-40, tTau, pTau and the ratios Ab1-42/Ab1-40, tTau/Ab1-42 and pTau/Ab1-42 to calculate areas under the curve (AUC) with 95% confidence intervals (DeLong). We compared ROC curves by twosided bootstrapping with 2000 replications. For biomarkers and ratios that showed AUC higher than 0.70, we determined positive percent agreement (PPA or sensitivity) and negative percent agreement (NPA or specificity) and calculated optimal cutoffs maximizing their Youden J index (PPA + NPA À 1). We calculated overall percent agreement (OPA) between CSF biomarker cutoffs and amyloid PET visual interpretation as the sum of participants classified as \"positive\" or as \"negative\" by both modalities over the total number of participants. We also analyzed the correlation of CSF biomarkers with global amyloid accumulation by fitting quadratic models and calculated the agreement of CSF biomarkers cutoffs with the PET scans quantification status applying a previously described SUVR cutoff of 1.11. 17 Level of significance was set at a = 0.05. We used Analyse-it â statistical software for the selection of optimal cutoffs and packages \"car\" "}, {"section_title": "Results", "text": ""}, {"section_title": "Quantification of Ab1-42, Ab1-40, tTau and pTau concentrations on the LUMIPULSE G600II", "text": "We measured Ab1-42, Ab1-40, tTau and pTau levels simultaneously on the Lumipulse G System. Their levels in the overall study population ranged from 315 to 2280 pg/ mL for Ab1-42, 4585 to 25925 pg/mL for Ab1-40, 141 to 1902 pg/mL for tTau, and 18 to 340 pg/mL for pTau.\nThe analyses were divided over three calibration runs on the LUMIPULSE G600II, and the calibration status was valid for all samples. Mean interassay coefficients of variation are displayed in Figure S1 .\nMost CSF samples included in this study had previously been analyzed using other immunoassays, and their results were available in our database. Although these historic results were obtained in the context of routine clinical assessment by using different batches, and therefore a side-to-side precision analysis could not be performed, we explored their correlation with the Lumipulse G quantifications. The Lumipulse G assays for Ab1-42, tTau and pTau showed very high correlation with values previously measured with Fujirebio's INNOTEST ELISA (Pearson's r of 0.94, 0.95 and 0.95, respectively, all P < 0.001). The Lumipulse G assay for Ab1-40 showed moderate correlation with values measured with Merck-Millipore's ELISA (Pearson's r of 0.76, P < 0.001). On the Lumipulse G system, tTau and pTau were highly correlated (Pearson's r of 0.98, P < 0.001)."}, {"section_title": "Agreement between 18 F-Florbetapir visual status and CSF biomarkers", "text": "As displayed in Figure 1A , of individual biomarkers, tTau and pTau had the highest accuracy and showed AUC of 0.80 (95%CI 0.70-0.89, P < 0.001) and 0.84 (95%CI 0.75-0.93, P < 0.001), respectively. Ab1-42 had fair accuracy with an AUC of 0.76 (95%CI 0.65-0.86, P < 0.001) and Ab1-40 alone was not useful for the detection of the visual status of amyloid scans (AUC 0.59; 95%CI 0.47-0.71, P = 0.134). Figure 1B shows that the combination of Ab1-42 with a second analyte resulted in significant increases of accuracy. The AUC of Ab1-42/Ab1-40 was 0.86 (95%CI 0.77-0.96, P < 0.001), higher than that of Ab1-42 alone (D = À2.5; P = 0.01) or Ab1-40 alone (D = À4.0; P < 0.001). tTau/Ab1-42 had an AUC of 0.87 (95%CI 0.78-0.95, P < 0.001), higher than that of tTau (D = À2.2; P = 0.03), and pTau/Ab1-42 had an AUC of 0.88 (95%CI 0.79-0.97, P < 0.001), higher than that of pTau alone (D = À1.9; P = 0.05). There were no significant differences in the AUC of the three ratios, and combining a third biomarker in the ratios did not improve their accuracy (data not shown)."}, {"section_title": "CSF biomarker cutoffs based on visual interpretation of amyloid status", "text": "For those biomarkers and ratios that showed AUC higher than 0.70, we used ROC analysis to obtain PPA, NPA and OPA for all possible cutoffs. As displayed in Figure 2 , in the case of single biomarkers, Ab1-42, tTau and pTau, the selection was based on clear Youden peaks at 916, 456 and 63 pg/mL, respectively. For the ratios Ab1-42/Ab1-40, tTau/Ab1-42 and pTau/Ab1-42, plots showed plateau stages indicating that a wide range of cutoffs yielded similar Youden indices. Best cutoffs for ratios were 0.062 for Ab1-42/ Ab1-40, 0.62 for tTau/Ab1-42, and 0.068 for pTau/Ab1-42. Figure 3 displays the agreement between visual status of 18 F-Florbetapir and CSF biomarker cutoffs. For Ab1-42, tTau and pTau, the OPA values between visual status and CSF biomarkers status were 79%, 78% and 81%, respectively. The ratio of Ab1-42 with Ab1-40, tTau and pTau increased the OPA to 84%, 82% and 88%, respectively."}, {"section_title": "Markers of amyloid and importance of assessing a second biomarker", "text": "Within each CSF biomarker status, the proportion of positive amyloid scans varied when a second biomarker or ratio was taken into account. Figure S2 shows the proportion of positive amyloid scans within each combination of two CSF biomarkers or ratios, and illustrates the importance of considering a second biomarker. Of all participants with low CSF levels of Ab1-42, regardless of the Ab1-42/Ab1-40 ratio status, 77% (56 out of 73) had a positive amyloid scan. This proportion increased to 87% (52 out of 60) within this group when the Ab1-42/Ab1-40 ratio was also low but decreased to 31% (four out of 13) when the Ab1-42/Ab1-40 ratio was high. In the group of participants with high CSF levels of Ab1-42, the impact of considering the Ab1-42/Ab1-40 status had no effect, as in all participants within this group the Ab1-42/Ab1-40 ratio was also high. These results highlight the importance of using the Ab1-42/Ab1-40 ratio over Ab1-42 alone in the assessment of brain amyloidosis, especially in patients with low CSF levels of Ab1-42."}, {"section_title": "Agreement of CSF cutoffs with amyloid quantification", "text": "We next processed amyloid PET scans to obtain quantification values of amyloid deposition. In our study, the previously validated SUVR value of 1.11, 17 showed 83% PPA, 76% NPA, and 81% OPA with visual classification. As displayed in Figure 4 , scans that were divergently classified as \"negative\" or \"positive\" by one of the three raters showed intermediate SUVR values compared to scans that were unanimously classified.\nAs seen in Figure 5 , the agreement of CSF cutoffs with amyloid PET quantification was similar to that with visual classification for all biomarkers. We studied the correlation between each CSF biomarker and global amyloid accumulation by fitting quadratic models. In these models, the adjusted coefficients of determination (R 2 ) were higher for all ratios compared to individual biomarkers. The combination of Ab1-42 with Ab1-40 increased the R 2 value to 0.44 (P < 0.001), indicating that this ratio reflects the amyloid deposition better than Ab1-42 alone. Stratified analysis by 18 F-Florbetapir visual status showed lower R 2 values for all biomarkers, which suggests that the correlation observed between CSF biomarkers and amyloid PET quantification is partially mediated by an amyloid-status effect. In this stratified analysis, the highest correlation of SUVR values was found with the Ab1-42/Ab1-40 ratio in the amyloid-negative group (R 2 = 0.42; P < 0.001)."}, {"section_title": "Discussion", "text": "In our study, we determined cutoffs for four CSF biomarkers for AD (Ab1-42, Ab1-40, tTau and pTau) and their ratios measured on the fully automated LUMI-PULSE G600II platform to optimize their concordance with 18 F-Florbetapir PET. We calibrated Ab1-42 levels to certified reference material, recently developed to harmonize immunoassays across different platforms, and found that the ratios Ab1-42/Ab1-40, tTau/Ab1-42 and pTau/ Ab1-42 had better diagnostic agreement with visual assessment of amyloid scans than single biomarkers. As a marker of amyloid pathology, the Ab1-42/Ab1-40 ratio had higher agreement with amyloid PET visual status and showed better correlation with amyloid load quantification compared to Ab1-42 alone. The agreement between amyloid imaging and AD CSF biomarkers has previously been studied by using other automated immunoassays. 3, 4, 8 Our results are in line with previous studies showing a good overall agreement between amyloid imaging and AD CSF biomarkers, higher for ratios than for single analytes. 3, 4 However, specific cutoff points for CSF biomarkers differ between these studies, and several methodological differences can explain these discrepancies. First, preanalytical conditions, such as the type of collection and storage tubes, are different between studies, and these factors are known to have a great impact on the absolute values of CSF biomarkers, especially for Ab1-42. 18, 19 Second, some analytical particularities for each immunoassay and platform used in these studies (specificity of the antibodies, time of incubation) result in diverse CSF biomarker measures. Calibration of all automated platforms to certified reference material, currently underway, will minimize this issue in the future. Likewise, differences in the affinity of PET radiotracers ( 11 C-Pittsburg compound B, 18 8 Hansson et al. studied CSF of participants from ADNI and Bio-FINDER cohorts, that included cognitively normal volunteers, patients with mild cognitive impairment and patients with AD dementia. 3 In our study, we additionally included patients with other dementias or neurodegenerative diseases, which might reflect more realistically the application of biomarkers in daily clinical practice.\nAs in a number of other studies, the cutoffs in our study were selected by maximization of Youden J index. This approach balances sensitivity and specificity and is equivalent to maximize accuracy for a pre-test disease prevalence of 50%. 20 However, other strategies might be useful in certain clinical scenarios. 21 For instance, for screening purposes, it might be helpful to apply cutoffs with high sensitivity, even when their specificity is lower. For patients with clinically challenging diagnoses or in clinical trials, however, high specificity might be preferable. Other possible approaches include the sequential application of biomarker cutoffs.\nThe LUMIPULSE G600II has incorporated the possibility of measuring CSF levels of Ab1-40. In previous studies, and ours, this biomarker alone was not useful for the detection of brain amyloid. 4, 7, 9 Both Ab1-42 and the Ab1-42/Ab1-40 ratio are included in the \"A\" category of the ATN classification system together with amyloid PET, but in line with other studies, 7, 9, 22, 23 we found that the Ab1-42/Ab1-40 ratio had better agreement with visual amyloid status and higher correlation with brain amyloid quantification. Our results are in line with previous literature that suggests that the use of the Ab1-42/Ab1-40 ratio could compensate individual differences in amyloid precursor protein processing that otherwise might lead to false positive or false negative Ab1-42 CSF levels. 24 information adds to the fact that using the Ab1-42/Ab1-40 ratio has proven to partially mitigate the effect of some preanalytical confounders that have been described to alter the results of amyloid levels. [26] [27] [28] Altogether, our data suggest that the use of the Ab1-42/Ab1-40 ratio would be more reliable in clinical practice than Ab1-42 alone as a marker of amyloidosis and that this combination should be used in routine.\nThe main strength of our study is that four AD CSF biomarkers (Ab1-42, Ab1-40, tTau and pTau) measured simultaneously with the automated Lumipulse G System were compared for the first time to 18 F-Florbetapir PET to calculate amyloid-based cutoffs. In addition, this is, to our knowledge, the first study to present Ab1-42 levels that have been standardized to certified reference material, recently developed to harmonize immunoassays across different platforms. Standardized values will make our study more easily comparable to future studies. Moreover, to avoid possible sources of variability, we followed homogeneous CSF preanalytical and analytical procedures and used the same batch of reagents for all measurements. Also, the inclusion of participants with neurodegenerative diseases outside the AD spectrum provides a more realistic application of biomarkers in daily clinical practice.\nHowever, we are aware of some limitations. We did not test the effect that deviations from our preanalytical protocol would have on the final cutoffs, and therefore, the cutoffs that we report should be taken cautiously under other operating procedures. Some of the clinical categories in our study included a small number of participants. Although we used amyloid positivity/negativity as the gold standard in our study, the composition of the sample in terms of clinical diagnosis might be relevant for the interpretation and applicability of our results. Additionally, only very few participants had additional Tau imaging and/or 18 F-Fluorodeoxyglucose-PET, and we could not compare the agreement of CSF pTau and tTau with molecular imaging markers of the \"T\" and the \"N\" categories of the ATN classification. Likewise, as participants in this study are part of a living cohort, neuropathological confirmation is not available at this moment.\nIn this study, we found that the Ab1-42 ratios to Ab1-40, tTau and pTau in CSF show a good agreement with amyloid visual status and that the Ab1-42/Ab1-40 ratio had better correlation with the amount of amyloid burden compared to Ab1-42 alone. The understanding of the agreement between CSF biomarkers and amyloid imaging is crucial to identify situations in which these two modalities might not be interchangeable. This information has to be taken into consideration both in the diagnostic assessment in clinical practice and in the selection of participants in clinical trials."}, {"section_title": "Supporting Information", "text": "Additional supporting information may be found online in the Supporting Information section at the end of the article. Figure S1 . Interassay coefficients of Ab1-42 (A), Ab1-40 (B), tTau (C) and pTau (D). Figure S2 . Agreement of visual amyloid PET with the combination of two CSF biomarkers or ratios."}]