[{"section_title": "Abstract", "text": "This paper examines the impact of schools on crime in urban neighborhoods\nDo schools cause crime in neighborhoods? The location of schools often involves publiclyspirited debates about their influence on surrounding neighborhoods. Crime is among many concerns the public may raise in deciding where a school should locate. This isn't unreasonable.\nMiddle and high schools congregate youths during the peak of their crime-prone years.\n2 Victimization rates appear to be similar for youth on school grounds and away from school (Cook et al. 2010) . It is reasonable to suspect that a share of away-from-school crime occurs while youth are traveling to or from schools. On the other hand, schools also represent important neighborhood institutions. Families often choose specific housing because of both the quality and proximity to local schools (Black 1999). Schools are an important part of the social fabric of neighborhoods. Schools provide both the education amenity for children and a gathering place for neighborhood civic groups (Schneider et al. 1997; Warren 2005) . Despite the importance of the question of whether schools cause crime in neighborhoods, the empirical literature examining this topic suffers from generally weak identification strategies. Cross-sectional research has dominated this literature, despite clear problems that selection imposes in trying to unpack the relationship between where schools locate and crime patterns. School locations in many urban cities were made decades before address-level data on crime were readily available, making longitudinal studies hard to come by. Moreover, the lack of any exogenous source of variation in school locations in most cities has made identifying causal connections between schools and crime difficult."}, {"section_title": "Introduction", "text": "Do schools cause crime in neighborhoods? The location of schools often involves publiclyspirited debates about their influence on surrounding neighborhoods. Crime is among many concerns the public may raise in deciding where a school should locate. This isn't unreasonable.\nMiddle and high schools congregate youths during the peak of their crime-prone years.\n2 Victimization rates appear to be similar for youth on school grounds and away from school (Cook et al. 2010) . It is reasonable to suspect that a share of away-from-school crime occurs while youth are traveling to or from schools. On the other hand, schools also represent important neighborhood institutions. Families often choose specific housing because of both the quality and proximity to local schools (Black 1999) . Schools are an important part of the social fabric of neighborhoods. Schools provide both the education amenity for children and a gathering place for neighborhood civic groups (Schneider et al. 1997; Warren 2005) . Despite the importance of the question of whether schools cause crime in neighborhoods, the empirical literature examining this topic suffers from generally weak identification strategies. Cross-sectional research has dominated this literature, despite clear problems that selection imposes in trying to unpack the relationship between where schools locate and crime patterns. School locations in many urban cities were made decades before address-level data on crime were readily available, making longitudinal studies hard to come by. Moreover, the lack of any exogenous source of variation in school locations in most cities has made identifying causal connections between schools and crime difficult.\nUnderstanding the connection between school locations and crime has become ever more important as public school options have expanded to the private market, and increasingly cities are allowing students to attend privately run publicly-subsidized charter schools in urban cities (Hanushek et al. 2007; Zimmer et al. 2009 ). Local residents may resist the opening of charter schools and other publicly subsidized school options if schools cause crime levels to rise in neighborhoods. On the other hand, if schools have no causal connection to crime, this undermines the concerns that may be raised about public safety when a school proposes opening in an area. This paper uses a quasi-experimental design to examine crime changes around schools after they open relative to areas where schools are always present.\nThe Pennsylvania Charter School Law of 1997 allowed the creation and expansion of charter schools in Philadelphia.\n1 The city allowed four charter schools to open that first academic year (1997) (1998) , but has expanded its charter schools to reach a total 63 by 2009. Research on Philadelphia charter schools suggests that the students were similar those in the traditional public schools they left in terms of race, socioeconomic indicators, and prior education achievement 3 (Zimmer et al. 2009 ). Many charter school students in Philadelphia come from economicallydisadvantaged families and neighborhoods. Between 2000-01 and 2007-08 57% of the students attending charter schools in Philadelphia switched out of a traditional public school (Zimmer et al. 2009 ). By 2009, almost 1 out of 5 public students enrolled in charter schools. Charter schools are often located in disadvantaged neighborhoods, such that if schools themselves generate crime one might expect crime to increase in an area after they opened. We capitalize on this large shift in the location of schools in Philadelphia to estimate the link between school locations and crime.\nWe improve on previous efforts to examine this issue by relying on a difference-in-differences design. Our design is similar to other recent research in economics of education (Billing, Deming, and Rockoff 2012) in that we seek to capitalize on exogenous sources of variation in school locations to examine the consequences on crime in areas surrounding schools."}, {"section_title": "Background", "text": "In criminology, the type of land use has long been recognized as a correlate of differences in neighborhood crime rates (see Anderson et al. 2013) . Among land use types, public schools have been considered a source of variation in neighborhood crime (Roncek and Lobosco 1983) . These studies generally find that middle schools and high schools are correlated with higher crime rates in neighborhoods (Gouvis-Roman 2004; Roncek and Faggiani 1985; Roncek and Lobosco 1983; Murray and Swatt 2010; Wilcox et al. 2005; Willits et al. 2013) . A classic example in this literature are two studies by Roncek and colleagues that find residential areas on the adjacent blocks of public high schools have higher crime rates than residential areas further away, even after controlling for other forms of land use, housing characteristics, and the population composition of residents (Roncek and Lobosco 1983; Roncek and Faggiani 1985) . There is a less clear correlation between elementary school locations and crime (Murray and Swatt 2010; Kautt and Roncek 2007) . Research suggesting that elementary schools are correlated with less crime (Murray and Swatt 2010) may be simply describing crime as a function of population composition, as elementary school aged-children rarely commit crimes and are rarely arrested (Farrington 1986) . Previous cross-sectional research has also found that crime is lower around private compared to public schools (Roncek and Lobosco 1983) . The substantial body of research examining the connection between school locations and neighborhood crime provides correlational evidence of a link between schools and crime, but an important concern is that 4 much of this literature has relied almost exclusively on cross-sectional designs that cannot address substantial the selection concerns likely to undermine causal inference.\nThere are only a few studies with longitudinal designs that have examined the effects of school closings on neighborhood crime rates. For example, a series of studies examine the consequences of Catholic elementary school closings on crime rates in Chicago neighborhoods (Brinig and Garnett 2010; 2011; . These studies suggest that crime declines more slowly (i.e. relative increase) in neighborhoods when Catholic schools close compared to other neighborhoods in Chicago. The authors argue that the selection of Catholic schools to be closed is driven largely by the preference of parish priests and is not related to observable neighborhood differences in demographics, suggesting that school closings may be part of the causal process in neighborhood crime changes. The presence of a charter school replacing a closed Catholic school also appears to have no material effect on crime rates, suggesting that the Catholic school institution itself may have crime prevention benefits . However, it is not possible to determine from these studies whether crime shift is due to school closing in general or some specific aspect of Catholic school closings signals declining neighborhood institutions.\nWithout an exogenous source of variation in school locations, identifying the causal effect of school locations on crime remains difficult. We don't know if schools are more likely to open or close in high-crime areas, or if the simple shift of school-age youth into an area causes more crime. The selection of school settings also undermines the standard regression approach seen in this literature, even for studies that employ more sophisticated spatial regression models (Willits et al. 2013) . Communities with more resources, for example, may have greater voice in determining school locations. Similarly, residential sorting may also affect the type of school that opens in an area, as wealthy areas may welcome elementary schools more than middle or high schools. The decisions to close schools may also be related to differences in neighborhood social conditions. Even with longitudinal designs, standard fixed effects models may also be insufficient if \"changes\" over time are endogenous to these sorting mechanisms.\nSchools sort more children into a location which creates more opportunities for crime by shifting the number of kids in a given neighborhood. Basic criminal opportunity theory would expect crime to increase by increasing the supply of would-be perpetrators and victims in a given area (Cook 1986 ). Quasi-experimental research in economics confirms that the presence of students in schools impacts crime. Jacob and Lefgren (2003) , for example, use teacher in-service 5 days as a source of exogenous variation in the days when students do not attend school. They find that property crimes decrease by 14% on days when students are not in school, but violent crimes increase by 28% on days when student are in school. Relying on the variation in student attendance due to teacher strikes, Luallen (2006) also finds that violence increases and property crimes decrease during days when students are attending school compared to days when they are not due to teacher strikes. These studies suggest that schools may be a source of violent crime (largely due to student-on-student assaults), but that property crimes also decline as students are taken off the streets (i.e. incapacitated) to attend school.\nWhile these studies are instructive to the crime suppressing and generating effects of schools, they rely on variation in attendance given school location and so do not directly address whether school locations cause crimes in neighborhoods. It is possible that schools may reduce crime overall in a city by providing social control of children during the day, but the location of schools still has an impact on crime in an area by congregating more crime-prone individuals in an area.\nThe location of schools, for example, may generate thefts and burglaries in adjacent neighborhoods as students travel to and from school locations, as theories of criminal opportunities suggests (Cohen and Felson 1979; Cook 1986 ). In the current study, we seek to identify the connection between school locations and crime by capitalizing on the changes in school locations ushered in by legislation that enabled the establishment of charter schools in Philadelphia."}, {"section_title": "Philadelphia Charter Schools", "text": "Legislative reforms in Pennsylvania in 1997 allowed for publicly-funded charter schools to open. The legislation was passed with underperforming school districts like Philadelphia in mind. In an effort to promote access to private school markets for economically-disadvantaged students this legislation allowed for the creation of charter schools. The number of children affected by charter schools is no longer marginal. The School District of Philadelphia (SDP) is the 5th largest school district in the United States. In 1999, only 7,508 students were enrolled in charter schools compared to 179,388 in public schools. By 2009, charter schools in Philadelphia enrolled nearly 1 in every 5 students: 31,704 students compared to 139,598 in public schools (NCES Common Core Data). The expanded locations across Philadelphia permitted increased 6 access to charter schools in many disadvantaged areas (Zimmer et al. 2009 ). Figure 1 show that the growth of charter schools was concentrated among middle and high schools students, the age groups that are most crime prone. "}, {"section_title": "Design and Empirical Methods", "text": "In this study, we leverage charter school openings in Philadelphia between 1998 and 2010 to examine the effect of schools on neighborhood crime rates. To estimate the impact of school openings on neighborhood crime patterns, we employ a differences-in-differences design. This approach compares changes in crime before-and-after schools open to changes in areas where schools are always present. We estimate changes in overall reported crime, violent, property, and by individual types that are most prevalent (assault, theft, and burglary) 4 around schools 4 Crime overall is measured by the sum of the count of the following eight offenses: assault, theft, burglary, disorder (arrests), public drinking, illegal dumping, homicide, and robbery. Violence is measured by the sum of the count of assault, homicide, and robbery. Property is measured by the sum of the count of theft and burglary. 8 before and after they open. We construct counts of crimes overall and by type a distances 5 of one-tenth and one-quarter of a mile around each school location. Our basic specification is a model of the count of crime in a given quarter around a location with a school, controlling for the year.\n(1) Crime q,y = µ+ ϕ s + φ q + θ y + β 1 Open*Public q,y + β 2 Open*Charter q,y +ε s,q,y\nThis model identifies off of the changes in crime before and after openings adjusting for quarter and year trends. We separately estimate the effects of charter versus public school "}, {"section_title": "Data", "text": "We construct counts of crimes that occurred around each of 365 school locations in Philadelphia as indicated in the National Center for Education Statistics Common Core of Data for school years 1998 to 2010. 6 We first create a list of all school locations in Philadelphia from these data. We then match de-identified crime data provided to the University of Pennsylvania Cartography Lab by the Philadelphia Police Department for the years 1998 to 2010. These data had the exact geographic (x-y) coordinates of each crime and the date that the crime event occurred. We then calculated the count of crimes that occurred each date within a 1/10 and 1/4 of a mile buffer (Euclidean distance) around the location of each school that existed any time 5 We use the Euclidean distance given the short distances around schools from which we are calculated changes in crime. We could have used network distance based on roadways, but such a calculation would require one to assume that distances on the road only matter, when in fact students can easily walk through alleys and vacant lots. We also attempted greater distances but found that there was significant overlap between schools when we did so. As a result, our analyses focus on 1/10 and 1/4 mile 6 http://nces.ed.gov/ccd/ 9 between 1998 and 2010. This strategy allowed us to count crimes before and after schools opened as well as around schools that always were open for each day that a crime occurred. "}, {"section_title": "Results", "text": "The results from the estimated Model 1 are displayed in Table 2 . Contrary to expectations from the schools as places of crime literature, we find that school openings are associated with fewer crimes at the 1/10 of a mile radius. The point estimates for all crimes, property, and violence provide a consistent picture. Schools opening in an area appear to reduce its crime rate relative to that which existed before. And, it is important to underscore that these results are in comparison to other areas that schools are always present. The estimates for the most common crimes of assault, theft, and burglary are also consistently negatively associated with the opening of schools. The relationship for violent crimes appears stronger for charter school openings while that for property crimes appears stronger for public school openings. For crime overall, a public school opening is associated with roughly a 18% decrease in the predicted count of crime ([exp(-.20) =0.819]). For charter school openings, overall crime is predicted to drop by 12%, but this relationship is not statistically significant. Due to the large sample sizes, these estimates are fairly precise. Given that the average count of crime on any given block around a school in a day 11 or quarter is relatively low, these point estimates should be considered in their proper context.\nThe findings in general suggest that within a block of a public school, its opening is associated with a significant reduction in crime over and above the general secular trends in crime and compared to areas where schools are always open. An important limitation of the analysis with such a small radius is that we are only examining counts of crime at very small geographic area of approximately 528 feet (or equivalent to a city block). As a result we have many areas with zero crimes that don't contribute to our estimates.\nWe end up with estimates for only 60 schools that have crime within 1/10 of at some time point\nin Philadelphia between 1998 and 2010. Our estimates, therefore, provide only evidence for those areas that have crimes occurring at some point and also have a school present for more than one year of data. Additionally, it is possible that the presence of a school opening simply replaces abandoned or neglected property on a block and that its opening reduces crime simply 12 by providing a secured facility. If this is a true explanation, we would expect to see crime patterns change as the spatial aggregation gets larger. both public and charter school openings are associated with reductions in crime compared to areas that always have schools, but the point estimate is no longer statistically significant. The point estimate is also substantially smaller. For example, crime is roughly 5.3% lower after the opening of a public school and 8.5% lower after the opening of a charter school. This suggests that the effect of a school opening is either very localized or that the estimates are less precise to each school as the geographic boundaries start to overlap for different schools. As Figure 2 above shows, the locations are for both public and charter schools are often within close proximity. In general the estimates indicate no relationship between school openings and crime. Figure 4 shows the trends in average total crime counts at ¼ of a mile after data for each opened school is re-centered around its opening date. Limiting the graph to the five year before and after each opening produces the most balanced panel of schools. What is apparent from this graph is that there is a downward trend in the average total count of crime in the years leading up to and after the opening of either public or privately run charter schools. The yearly slope is 6 fewer crimes around charter schools (b=-6.09) and 10 fewer around public schools (b=-10.11).\nThese slopes are equivalent in magnitude of reduction (3.5% to 3%) when one takes into account public schools have on average more crime around ¼ of a mile. It is also worth noting that there is a general downward trend in crime across school areas over this period (Figure 3 "}, {"section_title": "Alternative Specifications", "text": "It is possible that some of the effects we have observed for reduced crime around areas after schools open may be a result of common trends to specific areas that schools are opening. To assess this possibility, we estimated the quarterly count model to include interactions terms for years with each school of the 17 Philadelphia Planning Districts that represent larger geographic areas surrounding each of the schools. The results are displayed in Table 3 . While the point estimates are slightly smaller than our primary specification, the story remains qualitatively similar. Crime is lower at the 1/10 mile distance around public schools after they open compared to areas that always have schools, and there is no association at the 1/4 mile distance. The findings continue to suggest that schools either reduce crime on blocks or have no impact.\nBecause this specification controls for planning district and year interactions, it suggests that the findings are not driven by specific region of the city of Philadelphia effects. We further extend the model to include controls for the three years prior to and after the opening of a school by introducing 7 dummy variables (T=-3, -2, -1, 0, +1, +2, +3) which indicate when a school will open. If the timing of school openings is influenced by short-term yearly movements in crime, then the pre-year trends should control for this form of endogeneity.\nThe results are presented in In any event, the results suggest that school openings either reduce crime relative to areas where schools always are open or, they have no impact on crime at all. Either conclusion is at substantial odds with the conventional literature that schools cause crime."}, {"section_title": "Limitations", "text": "This study has the advantage of estimating relationships based on the changes around schools before and after they open and then comparing to schools that are always open, rather than the traditional approach of assessing cross-sectional variation. The opening of charter schools offers an advantage because the openings were made possible by state legislation that is outside of the individual differences in the students, families, and neighborhoods selecting schools. Also, charter schools are located in commercial buildings, but have few restrictions on where they can locate. The ability of charter schools to offer smaller size enrollments also means that they are less restricted in locations compared to large public schools. The fact that they provide access to all students is important, as we are not comparing changes in crime around very selective private 16 schools to that of open-access public schools. However, this design also has several limitations.\nFirst, the location of charter schools is clearly not random. Charter schools locate strategically in commercial property areas near where students can access them. They also tend to locate within proximity to public school settings. As a result, we can only estimate crime effects at very small geographic levels. Beyond a quarter of a mile, the crime rates will crossover with those of existing public schools. As a result, we cannot say much about the effects of school openings on larger neighborhood areas. This study also cannot identify anything specific about the management of these schools that might matter in influencing crime (i.e. mechanisms). Charter schools often have very strict disciplinary standards and can expel students more easily than public schools. As a result, it is conceivable that the opening of charter schools is qualitatively different for the environment of crime on a block than a public school that has less choice in who attends school. The effects that we observe for the opening of public schools may suggest a land-use effect. For example, these schools may be likely open in formerly neglected or abandoned property areas, such that their opening provides a more permanent and guarded structure that is less prone to crime generating activities. In essence we may be observing a vacancy effect. The majority of our specifications, however, suggest largely null effects of opening schools on crime patterns. Null effects are nevertheless a startling contrast to the large literature citing a positive relationship between crime and school location."}, {"section_title": "Robustness Check", "text": "We conducted several robustness tests to examine whether the estimates we report are sensitive to the school openings and their timing. During the time period in which schools were opening crime was largely declining in Philadelphia. To address whether the estimates are at least partially attributable to autocorrelation in the timing of when schools opened, we used a permutation test that randomly reassigned the opening year of schools 1,000 times and reestimated our primary specifications. If we use the estimates for the effect of public school openings shown for our basic difference in difference model for all crime at the 1/10 mile level in Table 2 , we find that our test statistic of -2.06 is only exceeded 2.2% of the time when the opening of public schools is randomly assigned. This provides confidence that the effects we observed were not be driven by autocorrelation in the timing of school openings. Finally, although the results appear to be robust to different modeling specifications, our estimates do hinge on the trends around schools not being unique to some existing pattern in crime in Philadelphia. To check if the trends in crime around schools are in some material way different than another arbitrary location, we use data on the location of firehouses in Philadelphia. In figure 6 we plot the average amount of total crime reported within 1/4 a mile of schools over this time period and that reported around firehouses. The graph clearly indicates that crime is going down in both locations and there is nothing unique about school locations. "}, {"section_title": "18", "text": ""}, {"section_title": "CONCLUSIONS", "text": "We set out to study whether, in fact, schools cause crime in neighborhoods. The prior literature on this topic has generally found that schools are correlated with more crime. But this literature is built largely on cross-sectional designs that have fundamental problems with identification. We are able to address this limitation by relying on a panel design in which we compare changes in crime in areas around schools before and after they open compared to areas where schools are always open. Our findings paint a different picture. We see that public school openings are associated with less crime in the adjacent block and no change in crime within a quarter of a mile. Charter school openings also appear to have no material impact on crime in the nearby area. These are important findings, but with our data, we cannot explain the mechanisms for the relatively larger drop in crime on the adjacent block of where a public school"}]