[{"section_title": "EXECUTIVE SUMMARY", "text": "Graduate students, and thus graduate education, are an essential part of postsecondary education in the United States. With 2.9 million students enrolled and $40.1 billion in federal student aid invested in graduate education, trends in graduate student data are not only of interest to institutions of higher education and researchers but also to policymakers and the general public. The National Center for Education Statistics (NCES) collects some data on graduate-level students through the Integrated Postsecondary Education Data System (IPEDS), but it is not as in-depth as the data for undergraduate-level students. As commissioned by the National Postsecondary Education Cooperative, a compilation of higher education stakeholders who advise on the R&D of IPEDS, the purpose of this report is to provide a general overview of the current landscape of graduate student data collections and recommendations for future IPEDS efforts in this area. The report makes five recommendations to improve upon the Department's graduate student data through the IPEDS survey component(s) that would be affected by the recommendation: two for further review of existing IPEDS data measures, one for expanding current IPEDS data, and two for the collection of new data. Recommendation #1 -Review: Number of graduate programs and distance education programs offered, distance education enrollment, and distance education courses/programs offered (IPEDS Survey Components: Completion, Fall Enrollment, Institutional Characteristics) Recommendation #2 -Review: Student charges (IPEDS Survey Component: Student Financial Aid) Recommendation #3 -Add: Degree completion rates (Potential IPEDS Survey Components: Completions, Graduation Rates, Graduation Rates 200%, Outcome Measures) Recommendation #4 -Expand: Enrollment by degree level/field of study Fall Enrollment) Recommendation #5 -Add: Application counts and admission practices (Potential IPEDS Survey Component: Admissions) The report discusses several areas of consideration, including the types of graduate student data suited for IPEDS data collection, the strengths of IPEDS, and the granularity of data needed to report graduate student trends and technical feasibility of achieving such detail. The report concludes by encouraging NPEC to weigh higher education policy, research, and programmatic issues so that further expansion of IPEDS' collection of graduate student data trends may be grounded in clear objectives."}, {"section_title": "INTRODUCTION", "text": "Graduate students, and thus graduate education, are an essential part of postsecondary education in the United States. According to the National Center for Education Statistics (NCES), approximately 2.9 million students are enrolled at the post-baccalaureate level, accounting for 15 percent of the overall postsecondary enrollment in the U.S. and 22 percent of the student population at four-year institutions (NCES, 2017). Of the Title IV-participating, degree-granting institutions that are part of the NCES Integrated Postsecondary Education Data System universe, 2,092 institutions conferred graduate degrees as of 2015-16. Furthermore, the federal government makes sizeable investments in graduate education. In 2016-17, the federal government provided about $40.1 billion in various forms of student financial aid to graduate students, compared to $113.8 billion for undergraduate students (Baum, Ma, Pender, & Welch, 2017). In addition, colleges and universities receive federal support for research and development activities that also provide financial support for some graduate students. Graduate education plays an integral role in developing a strong workforce for the United States and in affording upward mobility. According to the U.S. Bureau of Labor Statistics (2018), jobs that require a master's degree at entry level are expected to grow by 17 percent, and doctoral-and professional-level jobs by 13 percent, between 2016 and 2026. There are differences across sectors and types of employment; generally, however, those with graduate and professional degrees are more likely to be employed and earn higher salaries than those without advanced degrees. Graduate degrees open opportunities for individuals to move up the social ladder, and yet traditionally underrepresented students are still underrepresented in graduate programs despite years of effort (Okahana & Zhou, 2017). There are compelling reasons for policymakers and other stakeholders of postsecondary education to be able to monitor and analyze data on graduate student trends and address pressing questions that inform public policy and practice for graduate education. However, compared to undergraduate-level data, fewer data points in the Integrated Postsecondary Education Data System (IPEDS) currently speak to graduate students. As commissioned by the National Postsecondary Education Cooperative (NPEC), a compilation of higher education stakeholders who advise on the research and development (R&D) of IPEDS, the purpose of this report is to provide a general overview of the current landscape of graduate student data collections, identify strengths and gaps in the currently available data points, and offer recommendations on future efforts to address these gaps in IPEDS. to consumers, policymakers, institutions, and data users? How endemic are the trends in these topical areas? Are they isolated in a sector of higher education or in broader areas of higher education? Research Question #2: What graduate student data are currently available through IPEDS? Are there other reliable sources for collecting these data? If so, what are the limitations in those other sources (e.g., measurements collected, robustness and representativeness of collected data, linkage to IPEDS data, availability of and access to data and data products, etc.)? Research Question #3: Could IPEDS address questions on graduate student data and trends in topical areas of importance? If not, what is needed? What are the limitations of the current IPEDS data collection with respect to addressing these topics? Research Question #4: How can the current IPEDS data collection be improved through definitions or instructions to answer research questions better and reflect the postsecondary landscape trends? Research Question #5: What additional data should IPEDS collect about this topic to enhance the higher education field? Research Question #6: What is missing from the IPEDS data collection with respect to this topic that prevents the IPEDS data from being useful or used more?"}, {"section_title": "Organization of this report", "text": "At the outset, the report discusses the data points on graduate student trends that are currently available in IPEDS and continues with a discussion of some of the limitations of IPEDS graduate student data. Illustrative examples of other national graduate student data collected by entities outside of NCES are presented. Then the report offers recommendations for consideration by NPEC and NCES and discussion of the recommendations, followed by concluding remarks."}, {"section_title": "Methods", "text": "To address the research questions and the main objective of this report, the author 1 first reviewed the current IPEDS data files. He then searched on the internet for the key data collection efforts for graduate student trends. Recent and current discussion about graduate student data and trends were reviewed to document topical areas that are of particular importance to consumers, policymakers, institutions, and data users. The author focused on the 1 The author currently works as Associate Vice President, Research & Policy Analysis for the Council of Graduate Schools (CGS), which is a Washington, D.C.-based national member organization for graduate schools. In this capacity, the author oversees the collection of aggregated institutional-level application, enrollment, and degrees data, as well as other data trends. Though this report was prepared independently of the author's work with CGS, inevitability knowledge and expertise the author has gained and shaped over the course of his work with CGS may be reflected in this report. All parts of this report, however, are solely based on the author's views and do not reflect those of CGS. current discussion on graduate admissions, enrollment, cost of education, and outcomes. A review of opinion surveys, reports, conference proceedings, and other sources that offer insights into topical issues of importance to stakeholders was also conducted."}, {"section_title": "Definition of key terms", "text": "The author acknowledges that there are different definitions used for the term \"graduate student,\" but for the purposes of this report, the term \"graduate student\" refers to all postbaccalaureate students, including but not limited to those students seeking master's degrees, doctor's degrees-research/scholarship, doctor's degrees-professional practice, doctor's degrees-other, post-baccalaureate certificates, and post-master certificates. This is based on degree and certificate definitions in the IPEDS 2018-19 Survey Materials: Glossary (NCES, n.d.)."}, {"section_title": "Stakeholder interviews", "text": "In the preparation of this report, the author engaged several stakeholders to gain their insights into current data collection efforts around graduate student trends, as well as about potential areas for augmentation. More specifically, eleven federal and non-federal stakeholders were contacted to explore: 1) How they use current IPEDS graduate student data; 2) How they collect and use additional non-IPEDS data sources for trends; 3) What measures are important and reliable in capturing trends; and 4) What other topical areas of graduate students and trends are of particular importance. A sample protocol for the informational interviews is included in Appendix A, and general profiles of the interviewees are summarized in Table B-1 in Appendix B."}, {"section_title": "FINDINGS", "text": "NCES collects several graduate student data points through IPEDS, an administrative data collection of postsecondary institutions. The sample survey division's postsecondary branch of NCES also collects graduate student data through its student surveys. Aside from NCES, data on graduate degree holders are collected by other federal statistical agencies as a way to capture the educational attainment of the U.S. workforce. There are also efforts by higher education associations, disciplinary associations, scientific societies, and other organizations that gather graduate student data at the national level. This section summarizes the author's findings of existing data points and some of the research questions that can be addressed by these data, as well as some of the limitations of these collections and critical gaps in the existing graduate student data. Added for the Fall 2012 collection as a special case of the Fall enrollment statistics, IPEDS also offers the number of graduate students enrolled in distance education courses. This data point is for the aggregate of all degree levels and fields of study; however, it offers interesting insights into trends related to the prevalence of online graduate education programs. A limitation of the survey is that only aggregated data for all degree objectives are available. Unlike undergraduate enrollment, where institutional type (i.e., 2-year versus 4-year institutions) can be a proxy for degree level, the post-baccalaureate level encompasses a handful of degree objectives that are not evident from looking at institutional type alone. Also, except for a few selected Classification of Instructional Programs (CIP) codes, enrollment data at the post-baccalaureate level are not captured by CIP code. This limitation prevents any meaningful comparisons of graduate student enrollment trends, which tend to involve degreeand field-level analyses. Thus, it is difficult for the enrollment file to be used as a point of reference for enrollment trends captured by other entities, such as the National Center for Science Engineering Statistics (NCSES) and Council of Graduate Schools (CGS). In interviews with non-federal stakeholders, the enrollment file did not come up as one of IPEDS graduate student data points that the interviewees frequently use in their work. However, the 12-month Enrollment file in IPEDS is one of the data sources for the sampling frame for the National Postsecondary Student Aid Study (NPSAS), a national representative sample survey conducted by NCES that captures financial support for postsecondary students, including graduate students (Wine, Siegel, & Stollberg, 2018). Thus, the data point serves a critical purpose for the higher education community. Number of degrees conferred: Unlike the enrollment data discussed above, the number of graduate degrees conferred by U.S. institutions of higher education is collected by degree level and CIP code. At the graduate level, four types of degrees are defined: master's degrees, doctor's degrees-research, doctor's degrees-professional practice, and doctor's degrees-other. The data are also collected for post-baccalaureate and post-master's certificates awarded by these institutions. The degrees-conferred data are also collected by gender and race/ethnicity. Like the enrollment data, this is the most comprehensive account of graduate degrees conferred at U.S. institutions of higher education. Also, since the data are collected by CIP code and by race/ethnicity and gender, it allows a more nuanced analysis of these trends. Almost all stakeholders interviewed identified the completion file as containing the most frequently used graduate student data points in IPEDS. Number of graduate programs: Since 2011-12, the Completions survey component of IPEDS includes the numbers of programs and distance education programs offered, which can be disaggregated by CIP code and degree level. Although this data point is not explicitly focused on graduate students, it offers insights into trends in the prevalence of online graduate education programs and warrants highlighting. The number of graduate courses and programs offered as distance education is also collected in the Institutional Characteristics section. However, it is not disaggregated by field of study. These data points were unfamiliar to the stakeholders who were interviewed for this paper. Upon learning of the availability of program counts, one interviewee, a higher education association staff member, noted potential uses of this data point, such as estimating the sample frame for departmental surveys or contextualizing enrollment and degree trends. However, another higher education association staff member noted that the current definition might not result in the accurate reporting of the number of programs. Nevertheless, this interviewee also noted that knowing the number of programs in conjunction with enrollment and degree trends can be helpful in estimating relative program sizes, which could potentially be useful. Student charges: Currently, IPEDS collects data on tuition and fees charged to graduate students. Tuition and fees data for selected doctor's degree-professional practice programs (and formerly first-professional degrees) are also collected as a separate data point. While there are distinctions between full-time and part-time student charges, as well as in-district, instate, and out-of-state charges, there is no further disaggregation of this data point. In other words, if differential tuition and fees are charged in some programs, such as master's programs with professional practice focuses (e.g., some master of business administration, master of public policy, master of public health programs, etc.), trends in these differential charges might not be detected. A higher education association staff member interviewed noted having used this data point to gain a general sense of tuition charges among graduate students. However, the interviewee also corroborated the limitations mentioned above. Furthermore, the stakeholder noted that student charges data would be better contextualized if net price and total student aid award amount data were also available. Number of graduate students with military servicemembers and veterans benefits: Since 2014-15, IPEDS has captured the number of students receiving, and average amounts of, post-9/11 GI Bill benefits and Department of Defense Tuition Assistance Program benefits. While these data points only offer aggregated numbers for graduate students in all degree programs and fields, they provide interesting trends and insights into the participation of military service members and veterans in graduate education. The stakeholders interviewed for the report did not make any references to these data points. Number of graduate assistants: Currently, the IPEDS Human Resources file includes the number of graduate students employed at U.S. institutions of higher education. The number of graduate assistants is reported by type of graduate assistantship, as well. Graduate assistants are reported as teaching or non-instructional graduate assistants. Non-instructional graduate assistants are further disaggregated into six Bureau of Labor and Statistics categories: management; business and financial operations; computer, engineering, and science; community, social service, legal, arts, design, entertainment, sports, and media; library and student and academic affairs and other education services; and healthcare practitioners and technical. A higher education association staff member interviewed noted that this data point is used to highlight the contributions of graduate students at colleges and universities. This data point, however, does not offer compensation or funding source information for these graduate assistant positions. Also, while the data point can be disaggregated by type of graduate assistant position, information on the field of study and home department for these positions is not available."}, {"section_title": "Limitations of current IPEDS data", "text": "While IPEDS currently offers some foundational trend data about graduate students in the U.S., there are some limitations that have emerged from this review. Table 1, below, summarizes some key graduate student trends that can be addressed by current IPEDS data and other trends that cannot be addressed adequately. In particular, two areas: 1) the granularity of the currently available data; and 2) the lack of data that inform graduate school pipelines-stood out as areas with limitations. Disaggregation by degree level: The terms \"graduate students\" and \"graduate education\" encompass a diverse body of students who pursue different types of degrees in a wide range of disciplines. As noted earlier, the degree categories that are currently used by IPEDS alone include five different categories of degrees and two categories of certificates at the postbaccalaureate level: master's degree, doctor's degree-research (e.g., Ph.D.), doctor's degreeprofessional practice (e.g., J.D., M.D.), and doctor's degree-other, as well as post-baccalaureate and post-master's certificates. Different forces and factors shape trends at each degree level, compounded by forces and factors that shape disciplinary trends. This appears to make the Fall and 12-month Enrollment files difficult to use for some stakeholders. Disciplinary data: Graduate enrollment trends vary widely by degree level and field of study (Okahana & Zhou, 2017). Furthermore, the actual and projected growth in the number of jobs that require graduate degrees also varies by field and degree level (U.S. Bureau of Labor Statistics, 2018). In other words, aggregated data for all degree types and disciplines do not necessarily offer the insights needed to answer key questions that stakeholders may be asking. This sentiment also emerged in the informational interviews with stakeholders. For meaningful analyses and comparisons of graduate student trends, stakeholders tend to find utility in looking at more discipline-and degree-specific information, for example at the 4-or 6-digit CIP code level, rather than a broad picture that captures the entirety of the post-baccalaureate landscape. This contributes to the difficulty that some stakeholders reported in using the Fall and 12-month Enrollment files and that has led them to utilize data collected by other entities for enrollment trends. Yes -by degree level and by CIP code. 5. Year-to-year retention rates of graduate students. No. 6. Degree completion rates of graduate students. No. 7. Graduate and professional degrees earned by women and underserved students of color. Yes -by degree level and by CIP code. 8. Tuition and fees for graduate students. Yes -but only in aggregates of all degree levels and fields, except for certain doctor's degree-professional practice programs. 9. Graduate students with military service members and veterans benefits. Yes -but only in aggregates of all degree levels and fields."}, {"section_title": "Number of graduate assistants.", "text": "Yes -by type of graduate assistantship, but only in aggregates of all degree levels and fields. Application and enrollment trends data: The current data on graduate degrees conferred offer insights into trends in graduate degree attainment by traditionally underserved students in postsecondary education. This data point in IPEDS is robust and detailed, allowing for examination of this topic by degree level and by field of study. However, the current collection does not offer comparable data throughout the educational pipeline, such as application counts and acceptance rates or degree completion rates by student characteristics, degree level, or field of study. As representation of traditionally underserved students of color remains relatively small (Okahana & Zhou, 2017), there is a compelling interest in capturing trends throughout the educational pipeline so that the \"leaks\" may be detected."}, {"section_title": "Graduate student data collected by other entities", "text": "There are efforts outside of IPEDS that aim to capture graduate student data trends at the national level. A summary of these efforts is presented in Table B-2 in Appendix B. Some of these efforts, while focusing variously on particular degree types, fields of study, or topical areas of interests, provide complementary data points to those in IPEDS. Broadly, these efforts can be categorized into two groups: aggregated institutional-level data collections and student/individual-level data collections. Illustrative examples are discussed in this section. Aggregated institutional-level data on graduate students: Other national-level efforts collect aggregated, institutional-level data on graduate students in addition to IPEDS. Some of these efforts complement the graduate student data currently offered collected by IPEDS.  (NSF, 2018). While limited to SEH fields, the GSS enrollment data are more granular than the graduate enrollment data than IPEDS offers. The Institute of International Education (IIE), with support from the U.S. Department of State, collects data on international graduate students in the U.S. IIE's Open Doors report annually tallies the number of international graduate students in the U.S. by country of origin, field of study at the 2-digit CIP code-level, and degree level. The dataset has comprehensive coverage of U.S. institutions, as well as by countries of origin for international graduate students. Although the field of study information is not as granular as might be desired, the dataset offers unique insights into trends in international graduate students studying in the U.S. Outside of the U.S. federal government, the Council of Graduate Schools (CGS) conducts two institutional-level enrollment surveys. The CGS/GRE Survey of Graduate Enrollment and Degrees, a joint project of CGS and the Graduate Record Examinations (GRE) Board, collects information about the number of applications received by graduate schools, offers of admission, first-time enrollment, total enrollment, and degrees conferred by its member institutions, as well as members of its regional affiliated associations. The survey report, which is released annually by CGS, offers data by degree level (i.e., master's/certificates versus doctorates) and by field of study. The report is the only national survey that captures graduate applications and enrollment data by degree level for all fields of study in master's and doctoral education. CGS also collects application counts, offers of admission, first-time enrollments, and total enrollments of international graduate students through its annual International Graduate Admissions Survey. This survey also gathers data by degree level (i.e., master's/certificates versus doctorates). Limitations of both surveys are that only institutions that are a part of the CGS membership and its regional affiliate associations take part in these studies and that participation is voluntary. For example, 619 institutions of higher education responded to the Fall 2017 Graduate Enrollment and Degrees survey. This represents a response rate of 80% among CGS-affiliated institutions, which includes about 8 out of 10 Doctoral Universities, as defined by the Carnegie Classification. However, participation in the survey is still less than the number of institutions of higher education that conferred some type of graduate degree, which was 2,092 in 2015-16. There are other similar efforts that collect application and enrollment information for particular disciplines. These efforts, which are typically organized by disciplinary societies, include but are not limited to those conducted by: the American Association of Medical Colleges (AAMC), the Network of Schools of Public Policy, Affairs, and Administration (NASPAA), the American Society for Engineering Education (ASEE), and the Association of Schools and Programs of Public Health (ASPPH). All these efforts, including the one by CGS, have some public-facing elements; typically, however, they are designed to be more internal, member-facing data resources for benchmarking and comparisons. In other words, unlike IPEDS, full data sets might not be readily available to the general public, qualified researchers, practitioners, and policymakers. Similar arrangements are found among graduate student trends collection efforts by consortia of institutions of higher education. The Association of American Universities Data Exchange (AAUDE) is a platform for data sharing among member institutions of the Association of American Universities (AAU). AAUDE collects key graduate student data such as doctoral timeto-degree and doctoral completion rates. These data collection efforts are done on a voluntary basis, and benchmarking resources are available only for consortium members, except for the data points that are publicly reported in efforts like IPEDS or GSS (AAUDE, 2018). There are also some paid services gathering graduate student data. The Oklahoma State Universityadministered Graduate Student Stipend Survey collects comparative stipend data, and institutions pay to participate in this consortium. Although not a continuous collection, the National Research Council's (NRC) effort, A Data-Based Assessment of Research-Doctorate Programs in the United States created another data set that offers insights into a part of graduate education. This effort resulted in program-level data that captured among other variables: degree completion rates, time-to-degree, aggregated student demographics, and student support services offered for doctoral research programs (National Research Council, 2011). Although the data have not been updated since, data for individual doctoral research programs within institutions are available for public use. Sample surveys about graduate students and degree holders: Aside from the aggregated, institutional-level data on graduate students collected by IPEDS and others, there are also sample surveys about graduate students and degree holders. These efforts are aimed at collecting individual unit-level data through representative sampling or other methodologies. NCES's National Postsecondary Student Aid Study (NPSAS) is a nationally representative sample survey of postsecondary students, including graduate students. The survey, which is conducted every three to four years, captures how individual students are supported financially to pursue their postsecondary educations. The most recent dataset offered insights into how graduate students are financially supported in their pursuit of graduate degrees by collecting information about fellowships and other support offered, as well as amounts borrowed by graduate students. The Survey of Earned Doctorates is an annual census administered by NSF's NCSES to those who earned research doctorates from U.S. institutions. This effort captures demographic data for those who earned doctorates, as well as time-to-degree, immediate job commitments, and other insights into earned doctorates from U.S. institutions. NCSES also administers the National Survey of College Graduates and the Survey of Doctoral Recipients, both nationally representative sample surveys. Neither of these surveys focuses on graduate students, but they capture the career outcomes of graduate degree holders. Finally, there are some other efforts that are not representative surveys but collect individual unit-level information. The Student Experience in the Research University (SERU) consortium administered the SERU Graduate Student Survey (gradSERU), and CGS administers student and alumni surveys for the Understanding Ph.D. Career Pathways for Program Improvement project. These surveys fall under the category of student unit-level information and are meant to capture insights from graduate students and alumni to gain information to inform program improvement. These are primarily institution-based efforts with national components."}, {"section_title": "RECOMMENDATIONS AND DISCUSSION", "text": "Based on the review of currently available data points for graduate student trends both in IPEDS and in other data sources, as well as conversations with stakeholders, several recommendations and key considerations emerged for further discussion about augmenting IPEDS data collection efforts for graduate student trends. This section presents specific recommendations for IPEDS data collection items, following a discussion of the findings described above and potential technical considerations."}, {"section_title": "Recommendations for IPEDS data collection items", "text": "The report makes five recommendations: two items for further review of existing IPEDS data points, one recommendation for expanding an existing IPEDS data point, and two recommendations for the collection of new data points, which aim to fill some of the gaps that currently exist in graduate student data trends. While similar data points may already be collected by entities other than IPEDS, none of them has the access and reach within the postsecondary education universe that IPEDS does. Thus, IPEDS undertaking these data collection efforts would add value to the community. Recommendation #1 -Review: Number of graduate programs counts and distance education programs offered, distance education enrollment, and distance education courses/programs offered: These items appear to be relatively less well-known data points among the current IPEDS graduate student data. They have the potential to offer important insights into graduate education that can help contextualize student headcounts and degrees conferred data, including insights into trends in distance graduate education. However, utilization of these data points seems to be low. It appears that these data points are difficult to find because similar data points are collected in three different IPEDS survey components. The usage and value propositions of these data points warrant further review. (IPEDS Survey Components: Completion, Fall Enrollment, Institutional Characteristics.) Recommendation #2 -Review: Student charges: This item offers insight into trends in graduate school prices; however, without degree-level and field-level insights, the potential utility of the data appears to be low. The item may offer more value to data users if degree-level and fieldlevel data are provided. The availability of net price and total student aid awarded data to accompany the student charges appears to add to the potential utility. The usage and value proposition of this data point warrant further review. (IPEDS Survey Component: Student Financial Aid.) Recommendation #3 -Add: Degree completion rates: As an outcome measure, several stakeholders interviewed noted that collection of degree completion rates by IPEDS would be useful. The author has also anecdotally observed interest in degree completion rates data from a broader group of stakeholders beyond those who were interviewed for this report. Despite the interest in this particular type of outcome measure, there is also no on-going national effort that captures graduate degree completion rates more widely. Thus, the recommendation to add the collection of graduate degree completion rates to IPEDS is offered. (Potential IPEDS Survey Components: Completions, Graduation Rates, Graduation Rates 200%, Outcome Measures.) Recommendation #4 -Expand: Enrollment by degree level/field of study: While the current Fall and 12-month Enrollment files offer the most comprehensive counts of graduate enrollment in the U.S., these data points do not appear to be widely used by stakeholders. In part, this appears to be because there are other sources that offer limited insights into graduate enrollment trends for subsets of the postsecondary universe. Nevertheless, the collection of graduate enrollment data by degree level and field of study by IPEDS will offer a complete picture of data trends of interest. Thus, the recommendation to add the collection of enrollment data by degree level and field of study. (Potential IPEDS Survey Components: 12month Enrollment, Fall Enrollment.) Recommendation #5 -Add: Application counts and admission practices: While enrollment and degree conferred data are available in IPEDS, no application count or application acceptance rate data for prospective graduate students are currently available. The admission process is an important part of the student life cycle and educational pipeline, particularly for traditionally underrepresented minorities in graduate education. Admission data trends can shed light into the potential \"leaks\" in the pipeline. Thus, the recommendation to add application counts and application acceptance rates, as well as other data on admission practices such as standardized test score requirements, to IPEDS. (Potential IPEDS Survey Component: Admissions.)"}, {"section_title": "Discussion and considerations", "text": "The current IPEDS data collection efforts offer some key baseline data related to graduate student trends. Data collected by other entities, including NSF and higher education associations, complement IPEDS data. The following discussion focuses on the strengths and nature of IPEDS data collection efforts and consideration of the technical feasibility of expanding those efforts. Types of graduate student data suited for IPEDS: A number of graduate student data trends can be captured by data collection efforts of some type. However, the nature of the data collection of IPEDS, that is a data collection at an aggregated, institutional level, should be considered in thinking about data points that fit best IPEDS-like efforts. Graduate students, and thus graduate education, do not form a homogenous community. Often, trends are discussed within disciplinary and degree specific contexts (e.g., enrollment trends in master of business administration programs, career outcomes of humanities Ph.D. holders, etc.), as opposed to making comparisons in a broader, institutional-level context. The stakeholders interviewed also indicated that it is important for data on graduate students to enable researchers to untangle the nuances and differences among degree levels and fields of study. Thus, some trends may be more informative and more suited to collection at the institutional level, while others are more appropriately captured at the individual unit level. For example, although the topic did not emerge in the author's conversations with stakeholders interviewed for this paper, there is emerging interest in the topic of graduate student borrowing (e.g., Delisle & Holt, 2015;Denecke, Feaster, Okahana, Allum, & Stone, 2016;Lee & Looney, 2018). However, amounts borrowed by graduate students are highly personalized and often further nested within departmental and institutional contexts. Thus, data aggregated at the institutional level might not be best suited for offering insights that can inform policy and practice, or worse, may present incomplete pictures. The same is true for financial support patterns and graduate student experiences. Furthermore, outcomes data that are beyond the control of institutions, such as career outcomes and career pathways, are better suited to collection in sample survey projects. Careful consideration should be given to identifying what policy and programmatic questions could arise if such IPEDS items were added to its collection. In addition, consideration should be given to whether such items are more suited to NCES postsecondary sample surveys. On the other hand, some data points can offer sufficient context at the institutional level. For example, aggregated application acceptance rates, degree completion rates, and time-todegree are well suited for aggregated, institutional-level data collections. The first two data points are currently captured in IPEDS at the undergraduate level."}, {"section_title": "Strengths of IPEDS:", "text": "The unique advantages of IPEDS over other data collection efforts are that IPEDS is mandatory for Title IV-receiving institutions of higher education and that its resulting data become publicly available. Virtually all graduate degree-granting institutions must report data in IPEDS, and the data submitted can be used for benchmarking by institutions of higher education themselves, as well as a resource for other stakeholders, including the general public, education researchers, and policymakers. While some graduate student data are collected by higher education associations, it appears that the data points collected by these efforts tend to be released as member-facing resources. Thus, these data might not be readily available for external users. If IPEDS collects similar data (e.g., application data for admissions, enrollment data by field and race/ethnicity, etc.), the data at the individual institution level will be available for public consumption. In other words, even for the data points that are currently collected by other entities (e.g., the application data by degree level and field of study collected by the Council of Graduate Schools, etc.), IPEDS electing to capture these data points has the potential to add significant value to the availability of graduate student data trends. Granularity of data: One key limitation of the current IPEDS data is the limited granularity for the available data points. Availability of graduate student trends by degree level and field of study emerged as an important consideration for the potential utility of data. Given the scarcity of graduate student data, one stakeholder interviewed noted that some data are always better than no data. However, the general sense from stakeholders interviewed was that fairly granular data are needed for meaningful comparisons. For example, three stakeholders noted that two-digit-level CIP codes would not be adequate for untangling some nuances associated with differences among disciplines. One stakeholder further noted that, while the granularity of the four-or six-digit-level CIP codes may not be required for all fields, some of the two-digit CIP codes, such as \"engineering\" and \"education,\" include distinctive subfields that warrant separate benchmarks. As IPEDS considers the recommendations in this paper, particularly Recommendation #3 -Add: Degree Completion Rates and Recommendation #5 -Add: Application Counts and Admission Practices, the granularity of the data will be a key point. While similar data points are currently collected at the undergraduate level, they are not disaggregated by degree level or field of study. At the graduate level, several interviewees noted that for meaningful comparisons and analyses, availability of data by degree level and field of study is crucial. Data on diversity and inclusiveness: Broadening participation and fostering more diversity and inclusivity in graduate education continue to be priorities in the graduate education community. There have also been federal investments in broadening the participation of underrepresented minorities (URMs) in graduate and professional education. Efforts such as the McNair Scholars Program and Louis Stokes Alliances for Minority Participation, as well as the NSF's Alliances for Graduate Education and the Professoriate and other programs, have been targeted investments in increasing the participation in graduate education of traditionally URM students. IPEDS currently does not offer indicators that allow examination of URM student enrollment in graduate education at the degree or field of study levels. Having more granular data on applications, offers of admission, and matriculations, as well as retention and degree completion data, may help shed more light into this area of inquiry. In other words, for all of the recommendations in this paper, expanding data collection by race/ethnicity would significantly improve the ability of IPEDS to offer insights into diversity and inclusiveness in graduate education. Technical feasibility: While the idea of capturing graduate student data, such as enrollment data, seems daunting, it is not impossible and can be done. For example, a number of efforts, including the GSS by NCSES and the CGS/GRE Survey of Graduate Enrollment and Degrees collect enrollment data by degree level and by detailed field of study. The latter also collects data on applications received and students accepted for admission at the same level of detail. Similarly, when NCES contacts institutions participating in postsecondary sample surveys, the agency also receives degree-level information to establish its sampling frames. The data items that NPSAS requests from each sampled institution to establish the student sample frame include, but are not limited to: student level, CIP or major, race, ethnicity, and gender (Wine, Siegel, & Stollberg, 2018). Thus, it is entirely possible for institutions of higher education to provide graduate applications and enrollment data by degree level and field of study to IPEDS, should IPEDS choose to collect information in this detail. The collection of these data points by IPEDS would be more comprehensive than the efforts by NCSES, which focuses on enrollment trends in STEM fields, or CGS, which focuses on application and enrollment trends at its affiliated institutions. Collection of degree completion rates and time-to-degree information is also possible, as demonstrated by various cohort degree completion rates projects by CGS (n.d.), as well as AAUDE. NRC's A Data-Based Assessment of Research-Doctorate Programs in the United States also demonstrated that cohort degree completion rates by program can be captured using a single set of definitions and that the resulting data can be made available for public consumption. The NRC effort captured 6-year cohort completion rates (8-year for humanities) (NRC, 2011), while past CGS efforts 2 reported 7-and 10-year doctoral completion rates (Sowell, Allum, & Okahana, 2015;Sowell, Zhang, Bell, & Redd, 2008) and 2-, 3-, and 4-year completion rates for STEM master's degrees (CGS, 2013). The author acknowledges that a process of reaching a consensus for metrics of degree completion rates can be difficult, considering disciplinary differences, as well as differences by full-and part-time students. However, it is also not impossible, as past efforts have demonstrated. It is a matter of what NCES would like to capture in IPEDS regarding important trends for graduate student data and for NCES to decide on a course of action for augmenting the current data availability in this topical area. Several stakeholders interviewed noted degree completion rates and times-to-degree information as useful outcome measurements. The Survey of Earned Doctorates collects times-to-degree information for research doctorates nationally, but IPEDS collecting degree completion rates for graduate degrees has the potential to add significant value to the community. Offsetting the burden: Some of the recommendations, particularly Recommendation #2 -Review: Student Charges and Recommendation #4 -Add: Enrollment by Degree Level/Field of Study, may be implemented in a manner that is complementary to other federal data collection efforts, thus offsetting some of the potential burdens to IPEDS. For example, net prices and student financial support for graduate students may be better suited for a sample survey. As IPEDS considers the recommendation to expand the enrollment survey by collecting data by degree level and field of study, an approach to offset some of the reporting burden may be to collect only the data not currently captured in the GSS. Though the preference may be to have a single, uniform data collection effort that covers the full spectrum of graduate education programs, disciplines that are not studied by other federal statistical agencies might present a reasonable starting point. During an interview, a higher education association staff member noted that IPEDS complementing GSS would still be greatly beneficial. This change may also create opportunities for cross-agency collaboration, as well as for further alignment of the definitions of the various data points collected by IPEDS, NSF, and other entities. Moving beyond graduate \"student\" data: Although it is not strictly graduate student data, it is worthwhile to explore the addition of program characteristics data for graduate programs. Because trends in graduate student data often nest within the contexts of individual fields of study and institutions, collecting data by graduate programs has great potential for offering unique insights that only IPEDS, as the census of all Title IV-participating institutions, can provide. Program characteristics data can add context to the current completion data, as well as other granular, program-level data points recommended in this report. Program-level characteristics data points, one stakeholder interviewee pointed out, might offer insights that are not otherwise available in individual-level sample surveys, particularly characteristics that have potential links to graduate student outcomes. For example, departmental academic support services are associated with the success of doctoral students (Gardner, 2008;Greene, 2015;Valero, 2001). Furthermore, program size (Goenner & Snaith, 2004;Stricker, 1994), program-level student demographics (Ampaw & Jarger, 2012;Bostwick & Weinberg, 2018;Maher, Ford, & Thompson, 2004;Seagram, Gould, & Pyke, 1998;Stricker, 1994), and program-level availability of financial support  are linked to student outcomes such as time-to-degree and degree completion. This line of data collection may be a worthwhile direction for IPEDS to pursue in order to shed more light on student success in graduate education. Program-level characteristics of doctoral programs have also been collected nationally in the past. The aforementioned NRC project may serve as a proof of concept for capturing some program or departmental characteristics should IPEDS choose to pursue collecting data beyond graduate students. Although the process may have been difficult for the parties involved, nevertheless it was possible for doctoral programs to report comparable, program-level characteristic information. In particular, some of the measurements on admission requirements, program diversity, and student support services offered have the potential to be linked with student outcome measurements to offer greater insights into graduate education. Additionally, the author has anecdotally observed that some stakeholders may find it useful to have comparative data points on policies and practices relating to providing tuition and fee remissions, health insurance, parental leaves, and other benefits to graduate assistants, as well as on setting minimum and maximum stipend amounts for graduate assistants."}, {"section_title": "CONCLUSION", "text": "This report provided a general overview of the current landscape of graduate student data collections by IPEDS and other organizations, considered the strengths and scope of IPEDS, and offered recommendations for future efforts by IPEDS in this area. It documented the current IPEDS graduate student data collection, as well as illustrative examples of data collection efforts by entities outside of IPEDS, and discussed the strengths, limitations, and complementarity of these data collection efforts. In so doing, the report generated a frame for future discussions about IPEDS and graduate student data. IPEDS currently captures, among a few other items, aggregated graduate student enrollment trends, graduate degrees conferred by degree level and by CIP code, and the number of graduate-level programs by mode of instruction, degree level, and CIP code. These data points offer institutions of higher education, researchers, policymakers, and other stakeholders of graduate education, as well as the general public, useful insights about graduate student data trends. There is some desire among different stakeholders of graduate education to have more data, but their reasons and the scopes of data they desire vary. Higher education researchers may be interested in graduate student data for advancing their research agendas, whereas graduate education administrators might be looking for benchmarking data. In an era in which data and data collection efforts inundate the higher education community, it is important to demonstrate that any efforts to collect more and improved data points are undertaken for more than the sake of data collection. Some stakeholders noted that, should IPEDS choose to expand its effort in collecting graduate student data trends, such an expansion should be grounded in clear objectives and collect data that help achieve those stated objectives. In other words, NPEC should weigh policy, research, and programmatic issues that might arise from new insights in considering further expanding the IPEDS collection of graduate student data and trends."}]