[{"section_title": "Abstract", "text": "Abstract-Dementia, a chronic and progressive cognitive declination of brain function caused by disease or impairment, is becoming more prevalent due to the aging population. A major challenge in dementia is achieving accurate and timely diagnosis. In recent years, neuroimaging with computer-aided algorithms have made remarkable advances in addressing this challenge. The success of these approaches is mostly attributed to the application of machine learning techniques for neuroimaging. In this review paper, we present a comprehensive survey of automated diagnostic approaches for dementia using medical image analysis and machine learning algorithms published in the recent years. Based on the rigorous review of the existing works, we have found that, while most of the studies focused on Alzheimer's disease, recent research has demonstrated reasonable performance in the identification of other types of dementia remains a major challenge. Multimodal imaging analysis deep learning approaches have shown promising results in the diagnosis of these other types of dementia. The main contributions of this review paper are as follows. 1) Based on the detailed analysis of the existing literature, this paper discusses neuroimaging procedures for dementia diagnosis. 2) It systematically explains the most"}, {"section_title": "I. INTRODUCTION", "text": ""}, {"section_title": "I", "text": "N THE recent years, the prevalence of infectious diseases and chronic conditions has raised due to the demographic shifts in developed nations. One severe chronic condition in particular that has attracted significant interest in the mental health research community is dementia, due to (1) its high prevalence among older adults, and (2) its deleterious effects on cognitive skills and abilities required for daily activities [1] . Dementia is a neurocognitive mental disorder that is a general term covering several diseases causing dependency and disability among older adults worldwide [2] . According to the World Health Organization (WHO), approximately 47 million people are living with dementia worldwide, and this number is expected to increase to 82 million in 2030 and 150 million by 2050. The underlying causes of dementia can either involve neurodegeneration, the weakening of brain interconnects resulting in impaired decision making and memory, and non-neurodegenerative mechanisms such as vascular dementia. The most prevalent types of dementia are depicted in Fig. 1 , grouped based on whether they can be characterized as neurodegenerative or non-neurodegenerative [3] .\nAt the beginning of Alzheimer's disease (AD) discovery, different types of psychological, pathological assessment such as cerebrovascular amyloid protein and tau protein to find the brain plaques, tangles and nerve cell degeneration; cognitive measurement scales for evaluating cognitive and functional decline in older adults; drug such as tacrine for leveling symptoms, and genetics evaluation to identify Down syndrome, was available to diagnose AD [7] . After that a brain imaging agent, called Pittsburgh Compound B (PIB), which based on positron emission tomography (PET), was first introduced at the Alzheimer's Association International Conference on Alzheimer's Disease (AAICAD) in 2004. This was considered as a major potential breakthrough in AD monitoring and early detection [7] , [8] . The Alzheimer's Disease Neuroimaging Initiative (ADNI), was then established to standardize image formats combining with psychological and laboratory tests for early detection and monitor treatment effects.\nDue to the increasing population with dementia, the associated mortality rate has continued to raise. Therefore, a biomarker is essential to detect degenerative histological changes, containing the amyloid plaques, hypo-metabolism, and neurological disorders (atrophy) for early clinical diagnosis of dementia. Trustworthy biomarkers can help us to differentiate and predict the dementia progression. Over the last few decades, researchers have introduced biomarkers in the form of neuroimaging techniques which has been widely used for clinical diagnosis. Neuroimaging techniques such as Magnetic Resonance Imaging (MRI), Positron Emission Tomography (PET) and single-photon emission computed tomography (SPECT) are proficient to diagnose the functional and anatomical information about the neurodegeneration. Based on these technologies, the medical imaging techniques have been widely used and led to a new direction in diagnosis and prediction of dementia [9] , [10] .\nIn the past few years, several review papers have detailed the technological advancements in biomedical image processing for dementia diagnosis. In [11] , structural, functional and molecular imaging techniques are discussed for only four types of dementia in the early stages in 2014. Most recently, authors reviewed MRI and PET brain image analysis techniques focused on assessing synaptic dysfunction and identification of diverse phenotypes [12] - [14] . Since then, many new technological tools for integrated analysis of distinct neuroimaging data have been proposed, and these approaches also include methods beyond MRI / PET; with these more recent approaches, the ability to automatically quantify brain morphology, function, connectivity, and pathology has improved considerably. This review paper provides a detailed overview of the most recent years' research in dementia diagnosis using biomedical image processing with machine learning techniques. Thus, the state of the art in neuroimaging, brain anatomy assessment and neurodegenerative condition diagnosis is presented.\nWe thoroughly researched leading databases, namely, IEEE Xplore, ScienceDirect, PubMed, ACM Digital Library, Springer and Nature for dementia diagnosis with medical image processing in recent years. Searching the databases based on keywords, such as, \"image processing for dementia diagnosis,\" myriad of research articles were found, from which approximately 300 were selected after carefully assessing the relevance of the article based on their abstracts. Then, this effort was followed by a detailed assessment on the full text of these 300 papers and the total number of papers analyzed in depth was narrowed down to 90 papers, from which 40 papers were selected for discussion in the following sections. The main contributions of this paper are as follows: 1. discuss the most recent neuroimaging procedures in the field of dementia diagnosis for clinical applications and 2. systematically evaluate the machine learning techniques and, in particular, deep learning approaches in early detection of dementia.\nThis review is organized as follows: Section II discusses the medical imaging analysis in dementia care based on clinical and statistical approaches. In Section III, conventional and recent machine learning approaches to classify dementia are described. Performance measurement is discussed based on the criteria defined in Section IV. Challenges and future prospects of the present research on dementia are outlined in Section V. In Section VI, the paper is concluded and future research directions are proposed."}, {"section_title": "II. CLINICAL/STATISTICAL ANALYSIS OF NEUROIMAGING FOR DEMENTIA DIAGNOSIS", "text": "Early diagnosis, subsequent treatment and support are essential for patients in presymptomatic / predementia stages to slow the deterioration and preserve quality of life as long as possible. Biomedical imaging is a means of visualizing degenerative histological changes, which include hypo-metabolism, amyloid plaques, and atrophy. Specifically, imaging can yield quantitative biomarkers suggesting a particular pathology and prognosis for dementia [11] , [15] . Fig. 2 depicts different imaging modalities available for such biomarker in the form of MRI/PET/SPECT images (datasets are discussed in below) which has advantages to capture the brain anomalies and neural vulnerability factors related to dementia. [18] and CADDementia, structural brain MRI scans [19] . These databases have been extensively used in many studies and greatly supported the research in dementia.\nIn this section, we discuss the most salient imaging modalities and analysis algorithms to evaluate the early development, aging and pathological stages of the brain to assist dementia diagnosis based on clinical and statistical approaches."}, {"section_title": "A. MRI Modalities", "text": "A non-invasive procedure, Magnetic Resonance Imaging (MRI) uses powerful magnets to generate magnetic waves to form two-or three-dimensional images of the brain anatomy without radioactive tracers. It enables researchers to study both the functional and structural brain abnormalities including dementia. Patients with neurodegenerative diseases can quickly be assessed safely with this neuroimaging methodology, which enables evaluation of functional neural activities and imaging of cortical regions [20] . The functional connectivity between the right hippocampus and the set of regions, such as the medial prefrontal cortex (MPFC), ventral anterior cingulate cortex (vACC), right inferior temporal, precuneus cortex, right superior, left cuneus and middle temporal gyrus and posterior cingulate cortex (PCC), were found to be interrupted in patients with AD [21] . Fig. 3 shows some representative examples of MRI scans for dementia diagnosis. Arterial spin labeling (ASL) -MRI is a noninvasive emerging technique to measure brain perfusion, and augment routine diagnoses as well as differential diagnoses. ASL can reliably assess the cerebral blood flow (CBF) of a given brain area in patients with dementia [29] . In [28] , early diagnosis and differentiation between AD and FTD were assessed by investigating ASL-MRI. CBF and Gray matter (GM) volume with corrected partial volume effects were quantified using 3D pseudo-continuous ASL-MRI data and tissue segmentation methods of SPM8 in the entire supratentorial cortex and ten GM regions. Chi-square test and ANOVA were used to group the patients and their age respectively. MMSE (Mini-Mental State Examination) was used to distinguish between AD and FTD patients and control subjects. Receiver operating characteristic (ROC) analysis was considered to evaluate sensitivity and specificity showing significant CBF differences. The region of interest (ROI) was different compared with the functional definition of ROIs which affect hypoperfusion examination.\nIn [27] , the authors proposed an ASL-fMRI immersive tool based on pairwise ranking and learning techniques for dementia disease diagnosis. Standard regression methods were used for Partial Volume Effects (PVE) correction, including fractional Gray Matter (GM), White Matter (WM), and Cerebro-Spinal Fluid (CSF) tissue volume. Tissue segmentation was performed via the SPM toolbox on the brain regions to calculate mean ASL signal. To validate the immersive tool they used continuous and differentiable surrogated Kendall-Tau rank correlation coefficient. The extensive experiments and comprehensive statistical analysis show that the proposed method outperform conventional methods.\nWhite matter hyperintensities (WMH) indicate the presence of cerebrovascular changes: specifically, the loss of vascular integrity of the brain in asymptomatic elderly subjects. The underlying pathology of the WMH signal is heterogeneous and may vary depending on the image intensity [30] . In [25] , AD-related pathology was examined among patients with DLB, PDD, and non-demented PD by associating the WMH severity and medial temporal lobe atrophy. Each subject underwent one or more cognitive evaluations, such as the revised Hasegawa's dementia scale (HDS-R) and MMSE. Group comparisons were performed through Student's t-test and the χ 2 test. Fazekas methods were used to semi-quantify the images, and medial temporal lobe atrophy (MTA) score was applied to visualize the MTA. The WMH evaluation shows that DLB and AD have more severe WMH than PDD.\nIn [23] , the differential diagnosis of bvFTD from AD, DLB and subjective memory complaints (SMC) is evaluated using six MRI quantification methods, namely VOL, TBM, VBM, Manifold, Grading and WMH. Image quantification was examined based on the utility of the T1-weighted and FLAIR MRI sequences and DSI (Disease State Index) score. The authors also studied the role of the related genetic status in the distinction of the carriers and noncarriers sensitivity. The demographic and the clinical statistical utility were analyzed by applying Student t-tests and Pearson χ 2 tests for measuring sensitivity using IBM-SPSS. Only VBM and VOL were found to be convenient in the differentiation of bvFTD from other diseases.\nADC (Apparent Diffusion Coefficient), a measure of tissue water diffusivity, depends on the interactions between water molecules and the chemical environment. The ROI (Region of Interest) is a method to measure the ADC value using the following sequences diffusion-weighted imaging, axial T2-weighted image (WI) FLAIR, 3D Inversion recovery T1-WI. A total of sixteen ROIs per subject were drawn per side to check the white matter of corona radiate hemispheres: frontal, caudate nuclei and parietal, and lenticular nuclei in [24] , to discriminate in periventricular and deep white matter diffusion patterns in patients with AD, sVD, normal aging (NA) and possible iNPH.\nAdditionally, ventricle enlargement is an essential structural biomarker for the diagnosis of dementia using MRI scans to visualize the brain structures. In [22] , modified distance regularized level set methods are used to segment ventricles, and extract geometric features to identify the clinical significance of AD diagnosis based on the OASIS database. Pixel counting approach is another way to analysis the brain tissue. In [26] , used MRI head scans to determine caudate and putamen for identifying the existence of brain tissue of Creutzfeldt-Jakob Disease (CJD) with the help of pixel counting approach through analyzing the image block by block, and three stages image segmentation."}, {"section_title": "B. PET Modalities", "text": "By injecting radio-tracers into the bloodstream, Positron Emission Tomography (PET) measures emissions to produce two-or three-dimensional images of the chemical distribution throughout the brain. The primary benefit of PET imaging is that blood flow, oxygen and glucose metabolism in the working brain tissues are easily visible, thus reflecting brain activity and providing insight into its function. For diagnosing progressive neurodegenerative disease, biomarkers may be able to provide the pathophysiological objective measurement based on the metabolism images obtained from PET scans. In addition, the combination of PET with structural MRI can improve the accuracy of dementia identification [31] . Fig. 4 shows some representative scanning patterns of dementia using PET imaging.\nA summary of the typical development of dementia diagnosis using PET scans is presented in Table II . It illustrates that brain metabolism using PET imaging is useful for early diagnosis of dementia by fusing different types of clinical and statistical approaches.\nFDG-PET determines the hypometabolic region which can be used to differentiate between various types of primary dementia. In [32] , authors explored FDG-PET abnormalities to differentiate iNPH from common neurodegenerative disorders. Partial volume corrected, and uncorrected, images were reviewed separately using unified segmentation and normalization procedures in SPM12. The FDG-PET pattern of hypometabolism in idiopathic normal pressure hydrocephalus (iNPH) involving the caudate and putamen was reported to understand the pathophysiology clinical features. In [33] , the FDG-PET image was optimized using the SPM software to identify typical AD hypometabolism pattern of each subject. ADNI FDG-PET scans were preprocessed using MMSE, ANOVA, and Chi-square test score. SPM statistical comparisons performed with the two different healthy control databases showed a high degree of concordance.\nIn [38] , the ROI-based topological pattern of the metabolic brain network was examined in subjects with MCI, AD, and NC using FDG-PET data and graph theory. Data were analyzed using CDR and MMSE score to evaluate dementia severity and cognitive functions of all patients involved. A three-step statistical analysis was performed to remove the effects of age, gender and the average value of the brain metabolic activity, and the Pearson correlation coefficient was computed to identify the correlation matrix. The leave-one-out (LOO) approach was used to explore the individual contribution to the group-level metabolic network showing that the topological patterns of the metabolic networks were aberrant in patients with MCI and AD.\nThe performance comparison between FDG-PET and ASL MRI diagnostic value in identifying the pathological abnormalities of frontotemporal dementia (FTD) is studied in [35] . Twenty subjects are considered to determine the qualitative and quantitative diagnostic utility of ASL and FDG-PET for analyzing the ROI and subjective visual ratings. Across all regions, ASL performed lower than FDG-PET in discriminating patients from controls (areas under the receiver operating curve: ASL: 0.75 and FDG-PET: 0.87).\nAmyloid imaging, for the detection of plaques has a higher specificity and sensitivity compared with histopathology and in [40] , demonstrated that amyloid-PET tracer can be used to distinguish AD, DLB, FTLD, VD and non-degenerative pseudodementia. According to [34] , the particular and hierarchical implementation of amyloid PET scans is addressed in relation to cerebrospinal fluid analysis in a naturalistic setting at French tertiary memory clinics in patients presenting with mixed dementia symptoms. A total of 205 patients were recruited for high-level diagnosis. Statistical analysis was applied to investigate patient categories according to clinical status based on mean, standard deviation, and frequency distributions values while the Wilcoxon sign rank test was reported for comparison of initial and final confidence levels. To test variables of different groups, Kruskal-Wallis ANOVA with Dunn's multiple comparisons and Mann-Whitney tests were performed. Frequency comparison was made by Fisher exact test and the CochranArmitage test was applied for distinguishing proportion trends. PET findings resulted in enhancing self-confidence in patients diagnosis.\nIn [37] , the amyloid PET imaging was assessed using flutetamol tracer for early diagnosis of dementia based on atypical clinical symptoms, regarding the diagnosis and patient management plan. Data was analyzed using the MMSE score after a routine diagnosis which was interpreted as amyloid-negative or amyloid-positive based on visual rating. KruskalWallis tests, and Pearson χ 2 tests were assessed among groups and for the patient management plan. Their clinical diagnosis increased the overall diagnostic confidence and led to alteration of patient management plans.\nIn [41] , both FDG-PET and amyloid PET were assessed in a clinical setting to predict AD from MCI using a database of the Karolinska Institutet Stockholm, Sweden. Data were classified according to the diagnosis criteria. Image analysis accuracy was carried out with SPM5 software and Matlab. ROC analysis and AUC were applied to calculate the sensitivity, accuracy, and specificity for both PET biomarkers with SPSS software. The results have shown that the brain glucose metabolism and amyloid load yield a high accuracy for predicting MCI to AD conversion.\nTau pathology with the comparison of an amyloid PET is another method to investigate the cerebrospinal fluid (CSF), lumbar puncture and preclinical spectrum of dementia. A pattern determination was studied in [39] using tau tracer AV-1451, with probable dementia with Lewy bodies, compared to AD, and its relationship to β-amyloid deposition on PET. Multimodal neuroimaging data were collected at the Mayo Clinic Alzheimer's Disease Research Center (ADRC). MMSE, DRS and CDR score was used to quantify dementia severity. Subjective characteristics were compared among the clinical groups with the Fisher's exact test, student's t-test, or variance analysis followed by Tukey Honest Significant Differences test. The AUC was calculated to distinguish DLB and CN, and DLB and AD groups using median SUVr of each atlas ROI after combining the left and right hemispheric ROIs. FDG-PET brain metabolism and CSF (tau) classification were used to predict AD and non-AD, in [42] . Data was collected based on neurological and neuropsychological assessments, and clinical follow-up. FDG-PET data were analyzed with a validated voxel-based SPM method.\nAdvancements of tau-specific positron emission tomography (PET) tracers allows in vivo regional imaging of tau pathology in AD and other taupathies. The relationship between tau pathology and glucose metabolism is assessed in [36] to determine the propagation among prodromal and Alzheimer's disease dementia using PET scans with tau deposition, FDG (glucose metabolism) and amyloid-β deposition."}, {"section_title": "C. SPECT Modalities", "text": "Single-Photon Emission Computed Tomography (SPECT) imaging is a functional nuclear imaging technique to evaluate the regional cerebral perfusion of the brain depending on the radioactive tracer or SPECT agent and, two-or three-dimensional images are captured. Fig. 5 shows the scanning patterns of SPECT modalities of DLB vs. NC. Table III represents the recent technological advancements of SPECT imaging in dementia diagnosis. It indicates that it is possible to differentiate among various types of dementia by analyzing brain blood flow or perfusion based on SPECT images using clinical approaches as well as statistical methods.\nSPECT by using ligands of the presynaptic dopamine transporter (DAT) is a suitable tool for investigating the functional integrity of dopaminergic nigrostriatal, which can be a pathway for dementia diagnosis [51] . In [45] , the specific binding ratio (SBR) is an index to measure DAT density from Dopamine transporter single photon emission CT (DAT-SPECT), and distanceweighted histogram (DWH) is used to improve SBR for dementia with Lewy bodies (DLB). Two weeks evaluation of patients was performed enduring brain MRI, DAT-SPECT, and cerebral blood flow SPECT with I-123 IMP. Using scatter correction with a Butterworth filter and a standard filtered back-projection algorithm without attenuation, the cerebral blood flow SPECT data were reconstructed. SBR of the striatum was calculated using conventional and DWH SBR methods. Also, the validation of inter-observer reproducibility, conventional and DWH SBRs were independently evaluated by two experienced nuclear medicine physicians. McNemar's test examines the VOI definition changing by DWH through visual evaluation. To improve inter-and intra-observer reproducibility of SBR, DWH may be useful. In [44] , the limited prodromal stage of dementia with Lewy bodies (DLB) has been addressed by measuring the dopamine transporter binding, and clinical relevance of I-FP-CIT SPECT resulting with the long-term olfactory dysfunction and RBD may indicate more severe degeneration of the nigrostriatal dopaminergic pathway.\nMIBG myocardial scintigraphy may be a comprehensive diagnostic tool comparing the differential diagnosis of dementia based on brain perfusion SPECT. In [47] , the combination of I-MIBG myocardial scintigraphy and I-IMP brain perfusion SPECT was assessed to discriminate DLB. The relationship between estimation group variables and presence or absence of DLB in the groups was analyzed by using univariate analysis while multivariate analysis was performed to obtain a combined index value that forecasts the possibility of DLB. ROC curve with a cutoff value was assessed to calculate the diagnostic value of the index. However, in [46] , [50] , the use of the combination of DAT-SPECT and MIBG myocardial scintigraphy was assessed for differentiating DLB only from the AD. The sensitivity, specificity, and accuracy of both methods, as well as their combined use, were assessed for differentiating DLB.\nIn addition, in [48] , the mechanism of cognitive dysfunction of subcortical ischemic vascular dementia (SIVaD) was investigated and compared with the distribution of regional cerebral perfusion (CP) changes in the mild forms of SIVaD, using technetium-99 m hexamethylproplyeneamineoxime (Tc-99 m HMPAO) SPECT analyzed by SPM. Using the SPSS software, all statistical analyses for demographic factors were performed, and independent t-test was used for the comparison of continuous variables. Whereas in [49] , semi-quantitative circumferential-profile was analyzed between Alzheimer's disease (AD) and white matter vascular dementia (WM-VaD). Regional cerebral blood flow (rCBF) patterns comparison was estimated by underwent MRI, and Tc-99m HMPAO SPECT.\nMoreover, a case study on Semantic Dementia (SD) is done in [43] , which is a type of primary progressive aphasia with language dysfunction. They present a finding based on SPECT by showing the involvement of the right inferior parietal area, the posterior cingulate cortex and adjacent precuneus compatible with new hypo-perfused areas have seen in AD."}, {"section_title": "III. MACHINE LEARNING APPROACHES FOR DEMENTIA DIAGNOSIS", "text": "Neuroimaging diagnosis for dementia identification is a very complicated process and involves a myriad of factors depending on the imaging modalities. Machine Learning can assist clinical diagnostic decision by automatically classifying and predicting dementia using computer-aided diagnosis (CAD) techniques and neuroimaging modalities. The fundamental step by step computer-aided diagnosis of dementia using Machine Learning approaches is shown in Fig. 6 . Images were preprocessed using Fig. 6 . The fundamental step by step computer-aided diagnosis of dementia using machine-learning approaches [52] - [55] .\nsoftware like SPM or SeeCAT [52] depends on the parameters selection. For feature extractor and relevant feature selection, different statistical methods [53] were used, and cross-validation [54] optimization was used to ensure the generation of the methods. Finally, machine learning approaches, such as SVM, [55] has been applied to classify, predict or distinguish dementia. In this section, the state-of-the-art machine learning methods used in dementia research has been systematically discussed."}, {"section_title": "A. Conventional Machine Learning Approaches for Dementia Diagnosis", "text": "In the previous year before 2013, several works have been completed using Machine Learning methods and neuroimaging modalities. For example, the SVM-based whole-brain classification was studied by [56] , [57] to automatically discriminate between patients with an AD or MCI using MRI and leaveone-out cross-validation strategy. In [58] , [59] , they analyzed different classifiers including SVM with the linear kernel to classify the AD, MCI and NC using ADNI 18F-FDG PET images. Another study was performed to diagnose Parkinson's disease using SVM-based classification and DaTSCAN SPECT images in [60] showed good performance. However, predicting brain phenotypes and morphology (e.g., white and grey matter tractography) from neuroimaging is still challenging.\nDifferent types of machine learning approaches with their purposes and accuracy is listed in Table IV , with different imaging modalities. It shows that most of the recent literature used SVM, PCA, ensemble classifier approaches with MRI scans to detect or classify AD type's dementia.\nSupervised learning technique SVM perform classification by drawing a hyperplane or a set of hyperplanes in a high dimensional space [73] . It is one of the most commonly used classifiers which can perform well with limited training samples and yield low generalization error. In multivariate classification and to enable early diagnosis of dementia, SVM is the most frequently used classifier. In [71] , SVM based classification of the AD in early-stage diagnosis using three sections of the brain based on the OASIS MRI database. The proposed system yields a 90.66% accuracy in the early diagnosis of the AD. In [54] , SVMs were trained to classify AD-CN, FTD-CN, AD-FTD, and AD-FTD-CN, using voxelwise feature maps derived from structural MRI, ASL, and DTI. AUC and SVM significance maps were analyzed for performance validation and regional brain contributions respectively. In [55] , using either linear or an RBF kernel selection method to ensemble SVM for multi-class classification of NC, MCI, cMCI and AD based on ADNI MRI features. The ensemble SVM outperformed single SVM with accuracy up to 59.1%. Early detection of the AD in a fully automatic computer-aided diagnosis (CAD) based on SPECT image classification using RBF SVM was assessed in [52] . They found that coronal standard deviation and sagittal correlation parameters are the most effective among all the features using ROIs and improving the accuracy of the system as of 90.38% comparing voxel-as-features (VAF) approach. A personalized diagnostic approach has been proposed using SVM and MRI brain data in [61] , where, bvFTD is classified and predicted in a group comparison as well as each subject using brain atrophy from MRI scans across the whole brain and frontotemporal, insular and basal ganglia most affected regions with the whole brain accuracy as of 86.5%. Combination of SVM, GPC, and AdaBoost to classify AD using MLNeCh MRI data feature vectors of high dimensionality was evaluated in [62] . Different techniques of feature selection/reduction are associated to evade the curse-of-dimensionality problem. In [53] , comparative study on feature selection method based on SVM weights as a significance map (p-map), SVM weight vector directly, t-statistics and expert knowledge were evaluated using ADNI MRI data for classifying MCI who converted to AD (MCIc), MCI patients who did not convert to AD (MCInc), AD, and cognitively normal controls (CN). In [64] , T1 MRI images has been considered to discriminate the AD and MCI from normal control (NC) using extreme learning machine (ELM) classifier in combination with linear kernel support vector machine (SVM). SVM-based recursive feature elimination (RFE-SVM) algorithm also employed to find the optimal subset of features and the result shows that RFE-SVM with ELM has the superior classification accuracy to that of linear kernel SVM. In [69] , six MRI visual rating scales were applied to collect T1-weighted images of confirmed dementia with the AD, DLB, and FTD. Voxel-based morphometry feature was used for performance measurement using a support vector classifier (SVC). In [70] , two classification problems: AD vs. NC and MCI vs. NC using MRI voxel-based feature was classified by SVM, with or without filter-based feature selection.\nPrincipal component analysis (PCA) having key advantages such as low noise sensitivity, low capacity and memory, and increased efficiency, is a meaningful way to identify dementia brain dysfunction. In [68] , FDG-PET metabolic patterns were retrospectively analyzed to identify probable bvFTD. ROIs based cluster analysis was performed and validated by PCA. They found distinct patterns of brain dysfunction. In [74] , MRI of multi-type dementia is used to reduce the dimensionality of an extract key features using sparse autoencoder (SAE), and PCA approach used to train a LDA and LR classifiers to compare their prediction accuracy. On the other hand, partial least squares (PLS) has been used in [65] to identify a network of subcortical and cortical regions encompassing motor and non-motor features of a neurodegenerative disorder named Parkinson's disease (PD) using deformation-based morphometry (DBM) of T1 weighted MR images. In [66] , a system based on partial least squares (PLS) feature dimension reduction, feature standardization, ANOVA feature selection and an ensemble of One vs. Rest random forest classifiers has been developed to discriminate healthy control (HC) from MCI. They used ADNI datasets that compromise T1-weighted MRI morphological measurements from HC, stable MCI, converted MCI and AD subjects. However, both PCA and PLS has been studied using SPECT and PET images in [75] , where an extensive and comparative evaluation was performed by three classification methods comprising elastic-net logistic regression (ENLR), multiple discriminant analysis (MDA), and SVM to classify AD, asymptomatic controls (CTR) and FTD participants.\nThe combination of structural (cortical thickness [76] and white matter microstructure) with functional MRI has been explored to distinguish AD and bvFTD using random forest and receiver operator characteristic curve for classifying the two clinical syndromes in [67] . In [72] , to detect AD and MCI from ADNI MRI scans using a multiple instance learning (MIL) method is proposed based on leave-one-out cross-validation. OASIS MRI dementia data is used to classify three dementia classes: non-dementia, very mild dementia and mild dementia using particle swarm optimization (PSO) providing automated clinical decisions to diagnose dementia with an accuracy 77.4%, in [63] ."}, {"section_title": "B. Deep Learning Approaches for Dementia Diagnosis", "text": "Another class of machine learning techniques which have been widely used in medical imaging is deep learning which uses multilayer of nonlinear information processing to recognize feature quantities from data like text, image, etc. The main advantage of deep learning is that highly accurate mathematical model can be learnt from a large dataset without knowing the detailed internal process. Deep learning algorithms have become an emerging methodology for analyzing medical images due to its predictive power and ability to generate automatically optimized high-level features and semantic interpretation from the input data [77] . Fig. 7 shows a deep learning based biomarker using Softmax as a classifier for early diagnosis of dementia.\nBiomedical imaging modalities with deep learning methods in early prediction and detection of dementia are summarized Fig. 7 . Deep learning CNN based hierarchical feature learning and classification to prognosis dementia using Softmax classifier [74] , [78] .\nin Table V , showing that deep neural network depends on the layers, has better accuracy than conventional machine learning methods.\nAn artificial neural network (ANN) is basis of deep learning and has been applied for a diversity of tasks comprising medical image processing. In [79] , a two-layered feed-forward neural network designed with sigmoid function is trained using the Levenberg-Marquardt supervised algorithm to classify the images as normal or demented. The Two-Threshold Binary Decomposition algorithm breaks down the input grayscale image into binary images. Segmentation based Fractal Texture Analysis (SFTA) technique was used for the extraction of features. In [84] , proposed a novel ensemble learning framework to identify neuroimaging abnormalities of brain MRI, PET and PET-MRI scan based on four layered ANN for classifying AD and MCI which solved the feature fusion learning problem as well as the prediction problem simultaneously. Comparing the Baseline methods LR, SVM, LGR and NB they have higher accuracy.\nIn [85] , presented a multi-modal imaging marker using a new deep learning algorithm named randomized denoising autoencoder marker (rDAM) and ADNI MCI data to predict future cognitive and neural decline from FDG-PET, amyloid florbetapir PET, and structural MRI scans. While [80] used only stacked auto-encoder (SAE) deep neural networks (DNN) to classify AD from cognitive normal (CN) and mild cognitive impairment (MCI) in dementia patients.\nThe prognosis and diagnosis of AD and MCI for clinical decision making using a Deep Ensemble Sparse Regression Network are proposed in [82] , where two conceptually different methods of sparse regression and deep learning are combined. They experimented the proposed model in an ADNI cohort and obtained high diagnostic accuracies in three classification tasks. However, in [81] , Deep Belief Network was analyzed to detect Alzheimer's disease from Structural MRI Classification. They considered a voxel-based morphometric approach for image preprocessing and feature extraction. Their DBN was consisted of 3-hidden layers with fine-tuned parameters including epoch, momentum and the number of nodes in each layer.\nWith the comparison of SVM (67.01%), Logistics regression(67.04%) and CNN with softmax layer (61%), the proposed method in [74] , [78] , combined convolutional neural networks and logistic regression showed better performance (74.93%) by training them on MRI scans of the AD. They used six convolutional layers, six max-pooling layers, six local normalization layers, three fully connection layers, and two dropout layers in CNN learning. On the other hand, in [83] , a very deep convolutional network and the Open Access Series of Imaging Studies (OASIS) database was analyzed for multi-Class Alzheimer's disease detection where a stem layer includes several 3 * 3 convolution layers, 1 * 1 convolution layer, and max-pooling layer and seven 3 * 3 convolution layer connected in different stages and two filter expansion layers. The current accuracy of this proposed method is 73.75%."}, {"section_title": "IV. PERFORMANCE MEASUREMENT", "text": "Computer-aided diagnosis of dementia depends on different algorithms using neuroimaging modalities that have shown high performance in the previous literature. Unfortunately, it is difficult to directly compare the performance of different approaches since the datasets and evaluation methodology are not standardized, but rather vary across the board for different studies. Thus, it is not straightforward to assess generalizability and, most importantly, ultimate clinical applicability and potential for adoption. Performance is being assessed by various work based on sensitivity, specificity, predictive value, accuracy, precision, confusion matrices, and sometimes missing value assumptions. Most of the existing literature provides accuracy, sensitivity, and specificity numbers; however, for a successful dementia diagnosis technique to be adopted one would need more information beyond these three values, as discussed below.\n1) Classification Accuracy: For differentiating between patients with dementia and normal controls, the accuracy of the image interpretation is one of the key performance measures for computer-aided diagnosis. The percentage of predictions in identifying patients with onset dementia syndromes to the total number of the dataset is given by the equation below.\nWhere a + b + c + d denotes the total number of subjects. 2) Confusion Matrix: The two-dimensional matrix where each column presents a predicted class while each row represents an actual class. In performance measurement of a CAD algorithm to diagnose dementia with known ground truth diagnosis against a test dataset, each matrix cell represents either predict class or actual class in a row-column way.\n3) Precision: To get the high-performance computer-aided diagnosis of neuroimaging, the proportion of predict subjects to the total actual subjects is being considered, which is called precision."}, {"section_title": "4) Sensitivity:", "text": "The probability of diagnostic assessments to recognize the subjects who have dementia. The CAD sensitivity can be defined by,\nWhere a is the total number of patients having dementia as a positive test and c refers to the total number of dementia people with a negative test. Thus, a + c represents the total number of subjects with dementia."}, {"section_title": "5) Specificity:", "text": "The probability of negative test identification among the subjects without dementia. The CAD specificity is given by,\nindicates the patients as not having dementia, b refers the subjects without dementia by negative test and d + b represents the total number of subjects without dementia."}, {"section_title": "6) Predictive Values (PV):", "text": "It is defined as the added value of correctly identified as people having dementia, i.e., true positive (T rP ) and not having dementia, i.e., true negatives (T rN). PV is given by,\nThe performance of a model can be different due to the missing value of the training data, it may affect the performance like it is wrong or imprecise predictions. Various methods have been suggested based on clinical dementia rating (CDR), to improve the classification accuracy as well as ignore the performance issue.\nThe validation of each model proposed in early diagnosis of dementia is signified by investigating the capability of these biomarkers to distinguish between HC and patients with dementia as well as types of dementia. Therefore, in the future research, researchers need to consider these validation criteria for the better diagnosis of dementia patients."}, {"section_title": "V. MAJOR CHALLENGES AND FUTURE PROSPECTS", "text": "The concept of assisting radiologists in neuroimaging analysis based on computer-aided diagnosis (CAD) has been widely accepted in clinical community in recent years, and showed merit for the prediction and early detection of dementia.\nSince the main focus of the research thus far has been on discriminating the Alzheimer's disease states, the ability to diagnose various other types of dementia has lagged behind and needs substantial advances. Several technical challenges that must be addressed to make progress in this area are as follows: 1) Radio-tracers used in image collection may have some side effects, 2) Large neuroimaging datasets need a sufficient amount of labeling time to train a machine learning system, 3) Noise in the images reduces algorithm accuracy, 4) Data heterogeneity, and 5) Clinical features in medical imaging may sometimes be subjective and thus the ground truth is not perfect.\nWe envisage that there will be a routine clinical practice of neuroimaging to diagnose dementia in the future. Broader use of neuroimaging for this purpose will lead to the accumulation of large datasets that can then improve deep learning algorithms and the overall diagnostic capabilities. Recent research as demonstrated the use of deep learning architecture to visualize and quantify blood flow, and image interpretation such as for classification tasks [86] . For example, in [87] , [88] , the authors discriminated AD from MCI using a deep learning based unsupervised stacked-autoencoder method to learn the hidden patterns using the segmentation of the gray-matter of MRI and FDG-PET scans. This resulted in higher accuracy compared to SVM and PCA+SVM approaches. In [89] , stacked-autoencoder and softmax classifier were used to classify AD using R-fMRI data, and compared to LDA, LR, and SVM the accuracy increased by a maximum of 18.75% improvement in classification performance. If such approaches can be generalized beyond AD with sufficiently large and robust datasets, deep learning technologies can have a tremendous impact on enabling neuroimaging modalities to diagnose dementia for early detection and prediction.\nAnother key area of technological advancement that can pave the way for computer assisted dementia diagnosis capability is multi-modal molecular imaging, such as with PET/MRI, SPECT/MRI, PET/CT, or SPECT/CT. These modalities have the advantages of superior spatial and temporal resolution, functional anatomical basis, and disease biomarker targeting capability. The temporal and spatial registration of simultaneous PET/MRI is assessed in [35] , where Arterial Spin Labeling (ASL) is shown to be an alternative to FDG-PET for clinical diagnosis of bvFTD. On the other hand, in [90] , multimodal stacked deep polynomial networks (MM-SDPN) has been proposed to fuse and learn feature representation from multimodal neuroimaging (ADNI MRI-PET data) for AD diagnosis. The result shows that MM-SDPN achieves the state-of-the-art performance by classifying both two stages and four stages of AD progression. Advancements in such imaging technologies coupled with analysis techniques is leading to noticeable improvement in the performance of computer assisted dementia diagnosis.\nWhile these imaging modalities provide high spatial and temporal resolution for assessing the brain functions, they are limited to the hospital / clinic setting. For the earliest possible diagnosis of dementia, physiological measurements such as electroencephalography (EEG) may play an important role as these measurements can potentially be acquired even in patients' homes. EEG analysis using computerized methods has revealed cognitive dysfunction towards dementia diagnosis in some studies [91] . According to [92] , a deep learning CNN was exploited to classify AD from MCI and HC using EEG patterns. EEG data were collected from 119 patients with dementia, along with ground truth clinical data. A two layered CNN was trained where a second convolutional layer was generated as of an auto-encoder MLP. The performance result (80%) was better than other conventional methods. These results suggest that EEG based analyses should also be pursued in addition to the multi-modal imaging approaches described above, as they may provide early diagnostic capability for a greater number of patients.\nEarly detection and treatment of dementia is paramount for reducing the likelihood of long-term sequelae such as stroke or even death. Thus, augmenting EEG-based early diagnostics with other wearable sensor based approaches is being widely investigated for continuous and ubiquitous sensing of key physiological parameters. Behavioral and environmental sensing and intervention (BESI), which can sense behavioral activities using wearable devices and monitor ambient parameters within the home, is one important approach. Moreover, beyond diagnostics, with this behavioral data it is possible to give real-time notifications to patients or caregivers to assess early treatment efficacy and possibly modify treatments to better suit patients' needs [93] . Recently in [94] , a deep learning recurrent neural network (RNN) based on long short-term memory (LSTM), examined the patterns of the PWD inertial motion data to build a sequential behavior model for inferring physical agitation in dementia."}, {"section_title": "VI. CONCLUSION", "text": "This review paper provides a comprehensive survey of relevant neuroimaging modalities and associated analysis techniques presented in the recent years for diagnosing dementia. Previous review papers have focused only on a particular imaging modality such as MRI or PET, or on one specific type of dementia only such as AD. We aimed to cover a broader space of imaging and machine learning / deep learning technologies for dementia diagnostics such that researchers in the field could readily identify the state of the art in the domain. Moreover, we emphasize the importance of early detection and prediction of dementia, such that treatment and support can be provided to patients as soon as possible-this would, in turn, slow the degenerative processes and support the patient to maintain the quality of life for as long as possible. Our review can be divided into two categories: (1) a discussion of the most recent neuroimaging procedures in the field of dementia diagnosis for critical clinical applications, and (2) a systematic description of the machine learning techniques and, in particular, deep learning approaches for early detection of dementia. We summarized the most recent neuroimaging modalities-MRI, PET, and SPECT-and machine learning and deep learning technologies for feature extraction and classification methods in diagnosing various forms of dementia. We concluded based on the performance measures among algorithms in the existing literature that the ability to diagnose AD using MRI scans is promising but substantial progress is needed for diagnosing other types of dementia such as FTD, VD, and PD. We further found that the deep learning approaches for analyzing brain images obtained with state-of-the-art imaging techniques perform better than conventional machine learning and imaging methods-the field is thus progressing rapidly in the direction of delivering accurate and early diagnosis of dementia in its various forms. However, more research is needed to improve classification for diagnosing dementia and, in particular, for providing earlier detection for enabling early onset treatment."}]