[{"section_title": "Abstract", "text": "To compare the patterns of gray matter loss in subjects with amnestic mild cognitive impairment (aMCI) who progress to Alzheimer disease (AD) within a fixed clinical follow-up time vs those who remain stable.\nMethods: Twenty-one subjects with aMCI were identified from the Mayo Clinic Alzheimer's research program who remained clinically stable for their entire observed clinical course (aMCI-S), where the minimum required follow-up time from MRI to last follow-up assessment was 3 years. These subjects were age-and gender-matched to 42 aMCI subjects who progressed to AD within 18 months of the MRI (aMCI-P). Each subject was then age-and gender-matched to a control subject. Voxel-based morphometry (VBM) was used to assess patterns of gray matter atrophy in the aMCI-P and aMCI-S groups compared to the control group, and compared to each other.\nThe aMCI-P group showed bilateral loss affecting the medial and inferior temporal lobe, temporoparietal association neocortex, and frontal lobes, compared to controls. The aMCI-S group showed no regions of gray matter loss when compared to controls. When the aMCI-P and aMCI-S groups were compared directly, the aMCI-P group showed greater loss in the medial and inferior temporal lobes, the temporoparietal neocortex, posterior cingulate, precuneus, anterior cingulate, and frontal lobes than the aMCI-S group."}, {"section_title": "", "text": "temporal lobe and rates of brain loss can predict which subjects with aMCI will progress to AD. [5] [6] [7] [8] [9] [10] [11] [12] [13] However, these studies employed techniques that only assessed a limited number of brain structures. Voxelbased morphometry (VBM) 14 is an automated technique that assesses patterns of regional atrophy throughout the whole brain. Previous studies that have applied VBM to assess patterns of atrophy in aMCI progressors vs stables have failed to find many differences between the two groups, 15, 16 most likely because of the small number of subjects and short clinical follow-up time.\nThis study used VBM as well as hippocampal measurements to assess differences in the patterns of gray matter atrophy in a large number of subjects with aMCI who progress to AD vs those who remain stable. In order to select subjects who are truly clinically stable, and avoid the problem whereby subjects progress shortly after the follow-up cut-off point, subjects labeled stable were required to retain the clinical diagnosis of aMCI throughout their entire available clinical history, with a minimum follow-up of 3 years.\nMETHODS Subjects. All subjects were identified from the Mayo Clinic Alzheimer's Disease Research Center (ADRC) and Alzheimer's Disease Patient Registry (ADPR) database. Informed consent was obtained for participation in the studies, which were approved by the Mayo Institutional Review Board. All subjects recruited into the ADRC and ADPR were followed prospectively and underwent annual neurologic, neuropsychological, and neuroimaging assessments. Patients were diagnosed with aMCI if they fulfilled the following criteria: 1) memory complaint, preferably corroborated by an informant; 2) memory impairment for age; 3) essentially normal general cognitive function; 4) generally preserved activities of daily living; 5) not demented. 1, 2 Typically memory measures in subjects diagnosed with aMCI fall in the Ϫ1.0 to Ϫ1.5 SD below the means for age and education appropriate individuals in our community. 17 The memory measures used for assessment include the Wechsler Memory Scale Revised Logical Memory and Visual Reproductions subtests, 18 the Auditory Verbal Learning Test (AVLT), 19 and the Free and Cued Selective Reminding Test. 20 The most salient measures are those involving delayed recall. For the other domains, subtests from the Wechsler Adult Intelligence Scale Revised are used such as Digit Span, Digit Symbol Substitution, Block Design, Picture Completion, Object Assembly, as well as other measures including the Boston Naming Test, 21 22 and Mini-Mental State Examination (MMSE). 23 Typically, aMCI subjects fall less than Ϫ1 SD below the appropriate means on these non-memory measures. 1 These well established criteria have been used by our institution for many years and are essentially the same as those adopted by the National Institute on Aging (NIA) Alzheimer's Disease Centers Program and the Alzheimer's Disease Neuroimaging Initiative (ADNI) (http://www.adni-info.org/images/stories/ Documentation/adni_protocol_03.02.2005_ss.pdf). In all cases the diagnosis was made on clinical grounds without reference to MRI. Patients were reevaluated annually and the decision of whether subjects had progressed to clinically probable AD was made at a consensus committee meeting as previously described. 24 The diagnosis of probable AD was made according to National Institute of Neurological and Communicative Disorders and Stroke-Alzheimer's Disease and Related Disorders Association criteria. 25 All subjects who had retained the clinical diagnosis of aMCI throughout not only a minimum required 3 years follow-up from the time of MRI but throughout their entire clinical course were classified as aMCI-stables (aMCI-S). These requirements help to ensure that the aMCI-S subjects were truly stable and did not simply progress shortly after the required 3-year follow-up. The aMCI-S subjects were then 2:1 matched by age and gender to aMCI subjects who had progressed to a clinical diagnosis of AD within 18 months of the baseline MRI (aMCI-P). Selecting progressors who had progressed to a diagnosis of AD within 18 months ensures separation between the groups on clinically evident grounds. The clinical history and MRI scans were reviewed in all cases. Subjects with structural abnormalities that could produce cognitive impairment, or who had treatments or concurrent illnesses interfering with cognitive function either at baseline or during follow-up, were not included in this study. MRI scans were rejected for poor quality. A flow chart depicting the selection process is shown in figure 1 .\nEach aMCI subject included in the analysis was age-and gender-matched to a control subject. Control subjects were defined as subjects who were cognitively normal at the time of scan, had at least 3 years of observation as cognitively normal, and had no subsequent history of progression to MCI or any other neurodegenerative disease throughout Flow chart: Subject selection process their entire available follow-up. The date/year that the scans were performed were also matched in an attempt to control for any temporal fluctuations associated with different scanner platform versions. All the control subjects were prospectively recruited via the same mechanism as the aMCI subjects into the Mayo Clinic ADRC, or the ADPR, and were identified from the ADRC/ADPR database. Control subjects were cognitively normal individuals who had been seen in internal medicine for routine physical examinations and asked to enroll in the ADRC and ADPR. All subjects were then evaluated by a neurologist to verify the normal diagnosis. Controls were identified as individuals who 1) were independently functioning community dwellers, 2) did not have active neurologic or psychiatric conditions, 3) had no cognitive complaints, 4) had a normal neurologic and neurocognitive examination, and 5) were not taking any psychoactive medications in doses that would affect cognition."}, {"section_title": "Image analysis. Imaging parameters. All MRI studies", "text": "were performed with a standardized imaging protocol. T1weighted three-dimensional coronal volumetric SPGR images with 124 contiguous partitions, and 1.6 mm slice thickness (22 ϫ 16.5 or 24 ϫ 18.5 cm FOV, 25°flip angle) were used for the VBM analysis and hippocampal tracings, and a T1-weighted sagittal sequence with 5 mm contiguous sections was used for the measurement of total intracranial volume (TIV). An axial fluid attenuated inversion recovery (FLAIR) scan (TR ϭ 11,000 msec; TE ϭ 147 msec; TI ϭ 2,250 msec; 3 mm interleaved images of the whole head) was also acquired and was used to perform visual assessments of vascular burden. Voxel-based morphometry. An optimized method of VBM was applied, implemented using SPM2 (http://www. fil.ion.ucl.ac.uk/spm). In order to reduce any potential normalization bias across the disease groups, customized templates and prior probability maps were created from all aMCI subjects and controls in the study. To create the customized template and priors all images were registered to the Montreal Neurological Institute (MNI) template using a 12 degrees of freedom affine transformation and segmented into gray matter (GM), white matter (WM), and CSF using MNI prior probability maps. GM images were normalized to the MNI GM template using a nonlinear discrete cosine transformation (DCT). The normalization parameters were applied to the original whole head and the images were segmented using the MNI prior probability maps. Average images were created of whole head, GM, WM, and CSF, and smoothed using 8 mm full-width at halfmaximum (FWHM) smoothing kernel. All images were then registered to the customized whole brain template using a 12 degrees of freedom affine transformation and segmented using the customized prior probability maps. The GM images were normalized to the custom GM template using a nonlinear DCT. The normalization parameters were then applied to the original whole head and the images were segmented once again using the customized prior probility maps. All images were modulated and smoothed with an 8 mm FWHM smoothing kernel. In addition, a re-initialization routine was implemented as previously described. 26 Gray matter differences between aMCI-P and controls, aMCI-S and controls, and between aMCI-P and aMCI-S, were assessed using two-sided t tests after correction for multiple comparisons using the false discovery rate (FDR) (p Ͻ 0.05). Age and gender were included in the model as nuisance variables.\nRegion of interest measurements. Hippocampal measurements were performed after several imagepreprocessing steps had been performed. 27 The borders of the left and right hippocampi were traced sequentially from posterior to anterior. In-plane hippocampal anatomic boundaries were defined to include the CA1 through CA4 sectors of the hippocampus proper, the dentate gyrus, and subiculum. The posterior boundary was determined by the oblique coronal anatomic section on which the crura of the fornices were identified in full profile. The inferior boundary of the hippocampus is determined by the gray-white interface formed by the subiculum and underlying parahippocampal gyrus. Test retest reproducibility expressed as coefficient of variation (CV) for hippocampal volume measurements has been previously measured as 0.28%. 28 Total intracranial volume was determined by tracing the margins of the inner table of the skull on contiguous images of the T1-weighted spin echo sagittal MR scan.\nVisual rating of vascular burden. The presence of cerebrovascular disease was assessed semiquantitatively on FLAIR scans by an experienced research technician who was blinded to pathologic and clinical diagnosis using a synthesis of published criteria. [29] [30] [31] The number of lacunar infarcts was counted in each subject and white matter hyperintensity (WMH) load was graded with a visual analog scale. Each incoming FLAIR study was registered to a common template and compared against a bank of example scans to assign it a WMH load in units of cm 3 . WMH burden in units of cm 3 had been determined quantitatively for each example case using an algorithm developed in our laboratory. 32 The technician assigned each new incoming scan a WMH burden on a continuous scale (i.e., visual analog scale) using an electronic slider bar. The intraclass correlation coefficient for inter-rater reliability of this visual analog WMH grading scale was 0.96. The concordance correlation coefficient between quantitative measures and visual WMH grading is 0.93."}, {"section_title": "Statistics.", "text": "Kruskal-Wallis tests were used to compare the aMCI-P, aMCI-S, and the control groups on age and years of education. A 2 test was used to compare groups on gender and the proportion of apolipoprotein epsilon 4 (APOE e4) carriers. Two-sided two-sample Wilcoxon rank sum tests were used to compare the aMCI-P to the aMCI-S groups on the cognitive test scores, including the MMSE, CDR-SB, and AVLT sum of trials 1 through 5. The cognitively healthy subjects were excluded from tests of differences on cognitive scores since by definition they are cognitively intact. We report medians and use nonparametric methods due to skewness in the numeric clinical variables.\nPrior to analysis, hippocampal volumes were converted to age, sex, and TIV-adjusted W-scores 33 which can be interpreted as the number of standard deviations the subject's hippocampal volume is from the mean volume among cognitively healthy individuals on a zero mean scale. Hippocampal W-scores and WMH load were compared across groups using the Wilcoxon rank sum test. Categorical vascular measures were compared between groups using 2 tests or Fisher exact test when cell counts were small. Because the pairwise tests described above each address a clinical question of a priori interest, we do not adjust reported p values for multiple comparisons. 34 To graphically characterize longitudinal change in cognitive scores, we used linear mixed-effects models specifying a random subject-specific intercept. 35 In these models the time component is expressed as years from the MRI and modeled as a quadratic slope. Age, sex, and education are included as covariates.\nRESULTS Subjects. Twenty-one aMCI-S and 42 aMCI-P subjects were studied. Figure 2 shows the time intervals from the baseline MRI to either progression to AD in the aMCI-P subjects, or to the last clinical assessment in the aMCI-S subjects. The median time from the MRI to the diagnosis of AD in the aMCI-P group was 1.0 year (range 0.7 to 1.5) and the median time of total follow-up in the aMCI-S group was 3.7 years (3.2 to 7.8) and in the controls was 4.7 years (3.0 to 12.7). The demographics of the aMCI subjects and the 63 matched controls are shown in table 1. There was no significant difference across the groups in age at scan, education, or gender ratio. The frequency of APOE e4 carriers was significantly different across groups, with the highest frequency reported in the aMCI-P group. There were also significant differences between the aMCI-P and aMCI-S groups in MMSE, CDR-SB, and AVLT score with the aMCI-P group showing a lower MMSE, and AVLT score and a higher CDR-SB score. Figure 3 shows the change in the cognitive scores over 3 years from the time of the MRI. The aMCI-P group performed progressively worse over time in the MMSE and CDR-SB, although performed at a relatively constant level on the AVLT. The control and aMCI-S groups showed a stable performance on all tests over time.\nImage analysis. The aMCI-P group showed regions of gray matter loss bilaterally throughout the temporal lobes, including the anterior temporal lobe, hippocampus, amygdala, entorhinal cortex, parahippocampal gyrus, fusiform gyrus, and the inferior and middle temporal gyri, compared to controls (figure 4). The superior temporal gyrus was only involved in the posterior portions of the temporal lobe. The left temporal lobe showed greater involvement than the right. The parietal lobes were also involved, predominantly in the left hemisphere. Additional gray matter losses were identified in the frontal lobes, basal forebrain, and in the anterior insula. Regions of apparent gray matter loss were also identified around the lateral ventricles. In comparison, no significant regions of gray matter loss were identified in the aMCI-S group when compared to the control group. Reverse comparisons were also performed to assess whether the control group showed greater gray matter loss than the aMCI groups. No regions of greater gray matter loss were identified in the control group compared to either of the aMCI groups. A direct comparison was performed between the two aMCI groups in order to highlight the regions that showed greater gray matter loss in the aMCI-P group compared to the aMCI-S group. The aMCI-P group showed a widespread distribution of greater gray matter loss ( figure 5 ). The temporal lobe showed slightly greater involvement in the left hemisphere, compared to the right hemisphere, and included the amygdala, hippocampus, entorhinal cortex, parahippocampal gyrus, inferior and middle temporal gyri, and the fusiform gyri. The superior temporal gyrus was only involved in the posterior portions of the temporal lobe. Widespread loss was observed in the frontal lobes, including the orbitofrontal cortex, the inferior and middle temporal gyri, and the medial frontal lobes. Greater gray matter loss was also observed in the basal forebrain, anterior insula, the parietal lobes, the anterior and posterior cingulate, and the precuneus (figure 5). Only a small amount of gray matter loss was observed around the lateral ventricles. Table 2 shows the hippocampal volumes and vascular burden scores. The aMCI-P and aMCI-S groups both had significantly smaller hippocampal volumes than the control group (p ϭ 0.001 for both). The aMCI-P group had a greater WMH and lacunar infarct burden than the control group (p ϭ 0.001 and p ϭ 0.03), although there were no significant differences between the aMCI-S group and controls, or between the aMCI-S and the aMCI-P group, in either measure. DISCUSSION This study shows that subjects with aMCI who progress to a diagnosis of AD within 18 months have a greater degree of gray matter loss at baseline than subjects with aMCI who do not progress to AD within 3 years. In fact, the subjects with aMCI-S showed no significant regions of gray matter loss on VBM when compared to a group of controls. These results suggest that patterns of atrophy on MRI could be useful to predict subsequent progression to AD in subjects with aMCI if an image analysis method that provided single-subject classification were employed. 36, 37 The patterns of atrophy identified in the aMCI-P vs control comparison were typical of those observed in AD. 33, [38] [39] [40] Gray matter loss was observed throughout the medial and inferior temporal lobes, the temporoparietal association neocortex, and the frontal lobes on VBM, and hippocampal atrophy was observed using volumetric measurements. These structures have been previously identified in subjects with MCI using both VBM 15, 16, [41] [42] [43] [44] and ROI techniques, 5, 45, 46 and are involved pathologically in AD. 47 The superior temporal gyrus was relatively spared, however, suggesting that atrophy of this structure would not help predict progression to AD in subjects with MCI and also perhaps that atrophy of this structure may occur later in the disease course than the other temporal regions. Previous studies have similarly shown less severe involvement of the superior temporal gyrus compared to the medial and inferior temporal lobes in subjects with MCI and AD. 48, 49 In addition, a previous longitudinal study has shown that atrophy of the superior temporal gyrus does not occur until moderate stages of AD. 50 The patterns of loss were more widespread than those observed in some previous VBM studies 51 of aMCI, most likely because the subjects in this study were all within 18 months of progression to AD. The aMCI-P group also had a greater WMH burden and had a larger proportion of subjects with lacunar infarcts on MRI than the control group. This is consistent with previous studies that have shown that subjects are more likely to be demented if they have a combination of vascular and AD pathology at autopsy. 52 White matter hyperintensity burden has also been shown to be higher in subjects with AD than those with MCI, and higher in subjects with MCI than controls. 53 Interestingly, no significant regions of gray matter loss were identified on VBM in the subjects with aMCI-S when compared to controls. These subjects were selected based on the fact that they did not progress to AD during a minimum required follow-up of 3 years, but also that they did not progress to AD during their subsequent clinical follow-up if this was longer than 3 years. The median follow-up time was actually 3 years and 8 months. The aim of these inclusion criteria were to try to select subjects who are truly clinically stable, and exclude subjects who progress shortly after the follow-up cut-off point. Indeed, the subjects with aMCI-S did not decline cognitively over the 3 years from the MRI scan. The fact that we observed no significant gray matter loss in this group on VBM raises the possibility that a number of these subjects indeed do not have a progressive neurodegenerative disorder. These subjects may instead be presenting with nonprogressive memory impairment. In line with this theory is the fact that the frequency of the AD risk factor APOE e4 was slightly lower (44%) than in the aMCI-P group (65%) and the frequency typically observed in AD. 54 However, the frequency in the aMCI-S group was higher than that observed in the control group (18%), which suggests that a number of these subjects may still have prodromal AD, but of a less rapidly progressive nature. The fact that the volumetric measurements demonstrated hippocampal atrophy in the subjects with aMCI-S also fits with this suggestion and reflects the fact that these subjects did have memory impairments. The curious observation that no hippocampal atrophy was observed in the aMCI-S to control VBM comparison may be due to the fact that the subjects with aMCI-S were anatomically heterogeneous with some having hippocampal atrophy and others not. It is possible that subjects who have shown memory impairment for so long but still show normal activities of daily living, and therefore do not fulfill criteria for AD, are in some way protected against cognitive decline. Recent studies have shown that high levels of education and occupational attainment help retain cognitive function in old age. 55 Indeed the aMCI-S subjects had slightly more years of education than the aMCI-P group and performed better on the CDR-SB and MMSE. Only one previous VBM study has reported patterns of gray matter loss in subjects with aMCI-S compared to controls. 16 In contrast to our study they identified widespread regions of gray matter loss in the frontal lobes, fusiform gyrus, and inferior temporal gyri, suggesting that a high proportion of their subjects would ultimately progress to AD. The average clinical follow-up time in that study, however, was only 28 months compared to the 44 months of follow-up in our study.\nA direct VBM comparison was performed between the two aMCI groups and we found significantly greater gray matter loss in the aMCI-P group compared to the aMCI-S group. Regions that showed greater loss were found in the medial and inferior temporal lobes, the temporoparietal association neocortex, frontal lobes, and in the posterior cingulate and precuneus. A number of studies have similarly shown greater atrophy of Patterns of gray matter loss identified in the amnestic mild cognitive impairment (aMCI)-P group compared to controls (corrected for multiple comparisons, p Ͻ 0.05)\nThe patterns of cortical atrophy are shown on a three-dimensional surface render (top 56, 57 and parahippocampal gyrus, 6 in MCI-P compared to aMCI-S, but no previous studies have shown greater involvement of the temporoparietal cortex and the posterior cingulate. It is notable however that less medial and inferior temporal loss was observed in the aMCI-P group when compared to aMCI-S, than when they were compared to the control group. This fits with the fact that the subjects with aMCI-S did show hippocampal atrophy on volumetric measurements, and again supports the earlier suggestion that some of the subjects with aMCI-S may ultimately progress to AD. Previous VBM studies that have compared aMCI progressors to stables found very few gray matter differences between the groups. 15, 16 One previous study identified differences in the hippocampus, parahippocampal gyrus, and lingual and fusiform gyri, 15 whereas another found differences in the frontal lobes, left supramarginal gyrus, and the right hippocampus. 16 The reason these studies found fewer differences between the groups was likely because they had smaller numbers of subjects and the clinical follow-up was less than in our study. Therefore a proportion of their \"stables\" may actually have progressed relatively soon after the follow-up cut-off, but this event was not detected because of short follow-up times.\nThere was however an unusual finding in the patterns of loss across the different groupwise comparisons performed. Greater gray matter loss was observed in the frontal lobes, parietal lobes, posterior cingulate, and precuneus, in the comparison between aMCI-P and aMCI-S than in the comparison between aMCI-P and controls. This is counterintuitive since one would expect the control group to show less atrophy and be more homogeneous than the subjects with aMCI-S. These results suggest the opposite, that the subjects with aMCI-S had greater gray matter volumes at baseline than the control subjects. The direct VBM comparison did not show any regions of greater gray matter loss in controls than subjects with aMCI-S but this may have been due to the harsh statistical threshold applied. It is possible therefore that subjects with aMCI who remain stable may have started with a greater gray matter reserve than those who progress to AD; however, we cannot prove this.\nThe strengths of this study were the fact that that we had a relatively large number of well matched subjects with aMCI-P and aMCI-S with a long period of clinical follow-up. In addition, we had longitudinal cognitive data that showed that the subjects with aMCI-S remained stable on tests of cognitive function for at least 3 years after the MRI, whereas the subjects with aMCI-P showed increasing CDR-SB and decreasing MMSE over time. The fact that the subjects with Regions that show greater gray matter loss in the amnestic mild cognitive impairment (aMCI)-P group compared to the aMCI-S group (corrected for multiple comparisons, p Ͻ 0.05) aMCI-P showed a stable performance on the AVLT suggests that this test may not be a good marker of disease progression, although it appears to provide good discrimination between the groups at baseline. However, a limitation to the clinical utility of this study is that although VBM is a useful tool to identify patterns of loss in groups of subjects it does not provide valuable information on a single subject basis. In order for these patterns to be prognostic they will need to be identified in individual subjects. 36, 37 "}]