[{"section_title": "", "text": "T h e primary objective of education policy in the ample, on average, additional spending on instrucUnited States is to increase the amount of student tional items will presumably generate more student learning that results from the 4% of gross domeslearning than increased spending on administration. tic product allocated to public schools each year\nThe productivity of additional instructional expen-(U.S. General Accounting Office, 1995 ). Yet, reliditures will in turn depend on a school's organizaable information about how to consistently improve tion, internal incentives, and response to the higher student learning on a large scale remains elusive resource environment (e.g., Murnane & Levy, (e.g., Barnett, 1996) . As a result, policymakers and 1996) . Because of the emphasis on local control advocates regularly turn to the one policy lever that over education in the United States and the diffiis (relatively) straightforward to manipulate: the culty of closely monitoring school practices at the education budget. Some policy proposals seek to micro level, state and national policymakers have achieve across-the-board increases in school budtypically been able to affect overall education budgets and leave decisions about how to allocate these gets or expenditures on specific items, but have had resources to local administrators. Other proposals relatively modest influence over how schools and seek to ensure that additional funds are spent on teachers respond to these changes. As a result, specific instructional items, such as the Clinton policymakers and researchers alike remain interadministration's initiative to devote $1 1 billion over ested in the question of how additional resources 7 years to hiring 100,000 additional elementary affect overall student learning given the current school teachers (Alvarez, 1999) . distribution of school practices. The obvious question for education policy is\nDespite an enormous body of empirical research, whether across-the-board or targeted increases in there is currently little consensus about whether adeducation spending will translate into improved ditional education spending will, on average, imstudent learning. The effects of across-the-board prove student test scores, the most commonly used increases in school budgets will obviously depend measure of student learning. The literature on in large part on how these funds are spent; for exwhether increases in overall spending or specific expenditure items improve student test scores is surprisingly mixed. Hanushek's (1996) review of the education production function literature noted that \"7 1percent of the estimated effects [of school spending on student test scores] are statistically insignificant or negative\" and concluded that there is \"no strong or systematic relationship ...between spending and student performance\" (p. 56). Others believe that the same research literature provides support for the idea that additional spending will, on average, increase student test scores (Hedges & Greenwald, 1996; Hedges, Laine, & Greenwald, 1994 ). This article explores one possible explanation for the mixed results shown in previous studies, namely, that these earlier investigations did not adequately control for omitted variables that are correlated with how students learn and are assigned to different schools and classrooms. Many researchers assume that omitted variables will produce an upward bias in the estimated effects of school resources on student outcomes because more affluent families are likely to choose higher spending districts (Tiebout, 1956) and family socioeconomic status is positively correlated with student learning (Mayer, 1997) . If this were the only source of potential bias, then available studies could be interpreted as upper bound estimates for the effects of school resources on student achievement.Yet, it is also possible that administrators or parents target poorly performing schools or students for compensatory resources. In this case, unobserved variables that affect student learning may lead to underestimates of school resource effects (Heckman, Layne-Farrar, & Todd, 1996a , 1996b .\nIn this article, we use data from the National Education Longitudinal Study of 1988 (NELS) to test whether the estimation approaches used in previous studies can identify the causal effects of school resources on student test scores. We focus on \"value-added\" models that use a previous period's test score as a control variable to address the problem of omitted variables bias. Value-added models have long been viewed as the \"gold standard\" in the education production function literature; however, these models will produce unbiased estimates only under certain conditions that can be empirically tested. We find evidence that valueadded models estimated with data from the NELS are likely to be biased. Although NELS has several important limitations, the data set provides detailed information on family background and school characteristics for a large, nationally representative sample of students and is arguably one of the best available data sources for estimating education production functions. Evidence that value-added models are not unbiased when applied to the NELS raises questions about the validity of previous valueadded studies that rely on less detailed data sets, and perhaps suggests that less weight should be given to the value-added literature in future debates about education policy. At a minimum, it would be useful for future value-added studies to report basic diagnostic information that might illuminate whether investigators' assumptions for unbiased estimation are met.\nWe also review a more recent empirical literature that may be less familiar to education analysts, one that improves upon previous research by using instrumental variables (N)methods to control for omitted variables problems. Most of these studies have shown that IV methods produce larger positive effects of school resources on student leaming than do value-added or other estimation approaches, which suggests that the biases identified by our NELS empirical work are large enough to be of substantive importance. We conclude by noting that because most of the IV estimates are fairly modest in size, it is not obvious that increased school spending is the most cost-effective way to improve the skills of students. Education production function studies might usefully be combined with cost-effectiveness or cost-benefit analyses to identify the most promising approaches for improving academic and other outcomes among U.S. students.\nThe article is organized as follows. In the next section, we review the conditions under which value-added models will produce consistent estimates of the effects of school spending on student test scores, after which we review the NELS data set. We then apply various value-added models to the NELS data and use several consistent model misspecification tests to show that the conditions for unbiased estimation have not been met. Finally, we review recent IV studies and discuss implications for research and policy."}, {"section_title": "The Value-Added Approach", "text": "Value-added models that use test scores from previous periods as control variables are typically viewed as the gold standard in studying the effects of school inputs on student achievement. Yet, studies that use this evaluation strategy rely on several assumptions to produce unbiased estimates of the effects of school resources on student learning, as discussed in this section. Later we describe empirical tests of whether these assumptions are met with the NELS data.\nTo understand the assumptions behind the valueadded approach, consider the model of student achievement in Equation 1 from Boardman and Murnane (1979) and Hanushek and Taylor (1990) . The achievement test score of student i in period T, Yir, is a function of the set of school inputs the child receives in period T, Sir, and the set of family characteristics in period T that affects how much the child learns at home, F,T. In this model, the child's learning in period Tis cumulative and is related to school and family inputs in previous years (t = 1,2,...,T -1). Because no education data set can hope to capture all of the factors that affect learning, the student's test score in period Twill also be a function of omitted variables. These omitted variables may be student specific (~i ) , such as innate ability or other omitted student or parent characteristics, or specific to the student and year (&it), such as unmeasured characteristics of the child's home or school environment that might change over time (e.g., the mental or emotional health of parents or students, student motivation, or the quality of the parents' relationship).\nEarly attempts to estimate the education production function in Equation 1 relied on cross-sectional data, which provided information on test scores, family background, and school inputs for a sample of students at only one point in time. For example, the so-called Coleman Report of 1966 estimated the achievement equation described in Equation 2 (Coleman et al., 1966) . If the lagged school and family resources captured by the error term eir (Equation 3) are uncorrelated with current school inputs, then estimating Equation 2 via ordinary least squares will provide unbiased estimates of the effects of increases in contemporaneous school resources on student achievement. Conversely, if current school resources are perfectly correlated with lagged school inputs (and uncorrelated with lagged family variables and the other individual effects in Equation 3), then the coefficients in alr reveal the effects of a cumulative increase in school resources in periods (1, ...,T) on student achievement in period T."}, {"section_title": "School Resources and Student Achievement", "text": "In practice, unmeasured and lagged family variables (Fit) and unobserved student characteristics (E) are likely to be correlated with the student's current school resources, and, as a result, ordinary least squares estimates for the parameters (alr) in Equation 2 will be biased.' Of primary concern is the possibility that the decisions that families make about their children's schools or classroom assignments are related in part to unobserved family or student variables. Similarly, school administrators may also assign children to schools or classrooms in part on the basis of prior achievement2 (which in turn is a function of lagged and unmeasured family and student effects) or other unmeasured student characteristics. In this case, estimates of the effects of school resources from Equation 2 will reflect both the direct effects of school resources and the indirect effects of those family and student aspects that have an impact on achievement and how students are sorted across schools and classrooms.\nAs noted earlier, the direction of bias from unobserved variables could, in principle, be either positive or negative. Poorly measured or unrneasured aspects of family socioeconomic status may lead to an upward bias in the estimated effects of school resources because more affluent parents may be more likely to place their children in resourceintensive environments. Similarly, unmeasured student ability may lead to upward bias in estimates of alr if schools or parents select more able students into higher resource settings (such as magnet schools or gifted programs). On the other hand, schools or parents may seek additional educational resources for students who are performing below expectations. If unobserved variables that are negatively correlated with student achievement cause students to be placed in higher resource settings, then estimates of air will be biased downward.\nBecause our understanding of how students are assigned to schools and classrooms is quite limited, the direction and magnitude of bias caused by omitted variables are quite difficult to predict. Moreover, the magnitude and direction of bias could, in principle, vary across different measures of school inputs. For example, if affluent parents focus on moving their children into areas with high teacher salaries, but school administrators compensate for poor student performance by moving chil-dren into small classes, the effects of teacher salaries may be overstated and the effects of class size understated.\nThe availability of panel data has enabled researchers to address omitted variables problems by estimating value-added models, as in Equation 4. These models use a previous period's test scores as a covariate to control for unmeasured school, family, and student characteristics (Ctalt Sit + Ctazt F,t+ &! + Z,&#,).\nThe value-added model described in Equation 4 will be unbiased only if whatever remains in the error term (vir) after controlling for a previous period's test score is uncorrelated with current school resources. This condition requires that several strong assumptions be met.\nFirst, the previous period's test score must be a good proxy for the student's prior achievement. To the degree to which previous achievement is measured with error, the lagged test score will be an imperfect proxy for omitted factors that affect both achievement and current school resources, and the estimates from Equation 4 will converge to those in Equation 3 (Meyer, 1992) .3\nSecond, all unmeasured and lagged family and student characteristics that affect Yir and current school or classroom assignments must exhibit their full effects in the pretest score KT-I. If, for example, these unobserved background variables have delayed effects, then Y,T-I will be an imperfect proxy for these factors, and the estimates for blrin Equation 4 may be biased. Similarly, if unobserved student attributes affect the rate at which students learn, including a previous period's test score may not fully control for the effects of these unmeasured variables on Y~T.\nThird, the time interval between testing periods must be sufficiently short that there will be no changes in student or family characteristics between testing periods that affect achievement and school resource assignments. This condition may not be met in practice. Many studies use test scores measured 4 years or more in the past (e.g., see Pallas & Alexander, 1983) , and even many of the best education data sets, such as NELS and High School and Beyond, test students only at Zyear intervals. As an example of the bias that might be induced by these testing lags, suppose there is some change in a child's household from period T-1 to period T, such as increased conflict between parents, that negatively affects the child's achievement and causes parents or school administrators to move the child to a higher resource educational environment. This difficult-to-measure family effect will not be captured by the previous period's test score and will result in downward bias in estimates of blr.\nFinally, whatever random events affect the student's test score in one period (v~T) must be uncorrelated with previous \"shocks\" (vir-1) if the value-added model is to be unbiased. For instance, reconsider our example of increased conflict between a child's parents. If this conflict negatively affects student achievement and increases over time, leading to divorce, the unobserved shock to the child's education production function in period T -1 will be correlated with the shock in period T. If the errors are serially correlated, then the error term Vi r in Equation 4 will be correlated with the lagged test score Yir-1. As a result, the coefficient estimates for both the lagged test score and the other variables will be biased in a way that will depend on how the previous test score is correlated with the current school resource variables (Hausman, 1983) .\nWhile previous studies have typically assumed that the conditions necessary for unbiased estimation with value-added models are met, very little research has been conducted to determine whether this is actually the case. In the empirical work described subsequently, we applied several empirical tests developed in the economics literature to different value-added models fitted to the NELS data. We found evidence to suggest that the conditions for unbiased estimation are violated.\nto have a positive effect on student reading scores but a negative effect on math scores. Reductions in class sizes when classrooms are large (more than 30 students) improve test scores in reading but have a very modest negative effect on math scores. Standard Ftests suggested that the class size variables, and all of the classroom-input variables taken together, are jointly statistically significant. The results for school-level resource effects on math and reading scores revealed the same pattern, as seen in Table 3 . Reductions in student-teacher ratios in schools with high ratios (more than 25 pupils per teacher) appeared to have negative effects on math but positive effects on reading. Teacher salaries had no clear effect on math scores but appeared to have a modest negative effect on reading scores.\nWhether these results provide useful information on the actual effects of school or classroom resources depends on whether the conditions for unbiased estimation with these value-added models were met. From our empirical work, using several different statistical specification tests, we concluded that these conditions were not met. The first two specification tests that we used focus on whether the covariates in the value-added model are uncorrelated with the regression error term (as required by the first two conditions for unbiased estimation with the value-added model), while our final test examined whether the error terms are serially uncorrelated.\nWe first used the test described by Ramsey (1969) , which compares the null hypothesis that explanatory variables are uncorrelated with the error term and the alternative hypothesis that the model suffers from omitted variables or misspecified functional form. The intuition behind the test is that model misspecification occurs when the expected value of the regression error term varies according to the value of the explanatory variables. Ramsey hypothesized that the expected value of the error term conditional on the value of the explanatory variables is some nonlinear function of the explanatory variables. We implemented the test by first estimating the value-added regression described in Equation 4 and calculating the predicted value of each student's test scores implied by the regression coefficients. Then we reestimated the value-added model with the square, cube, and quartic of the student's predicted test score included as explanatory variables to examine whether the error term in the value-added regression was re- lated to these nonlinear functions of the school and family variables. The null hypothesis of no model misspecification would be rejected if an F statistic suggested that the squared, cubed, and quartic terms of the predicted test score were jointly significant (Ramsey & Schmidt, 1976) . As seen in the bottom rows of Tables 2 and 3, the Ramsey test rejected the null hypothesis of no misspecification at the 1% level for each of the models, regardless of whether inputs were measured at the classroom or school level. While the Ramsey test is not informative about the exact nature of the misspecification, the results nonetheless caution against taking the school effect estimates literally.\nA second test for correlation between the explanatory variables in Equation 4 and the model's error term was derived from Johnson and McClelland (1997) . Their test is based on the observation that if two random variables are independent, then the joint probability distribution will equal the product of the marginal densities; that is, P(AB) = P(A) X P(B). In terms of our value-added models, we defined the two probabilities as (a) the probability that the regression error is small and (b)the probability that the test score value predicted from the regression coefficients (which is a linear function of the explanatory variables) is small. Johnson and McClelland outlined a formal way of testing the proposition that these two events are independent; if the events are not independent, then the explanatory variables and the regression error term are correlated, and the underlying value-added model does not produce unbiased estimates for the effects of school resources on student test scores. As seen in the bottom rows of Tables 2 and 3, the Johnson-McClelland test rejected three of the four models at the 5% significance level. 6 We also examined, using the test described in MacKimon (1992), the necessary condition that the error terms in Equation 4 are serially uncorrelated. (We used the MacKimon test because the usual Durban-Watson statistic is not accurate when a lagged dependent variable is included as an explanatory variable, as is the case with our value-added model.) We calculated the test using all three waves of the NELS data, estimating valueadded models for achievement gains from 1988-1990 and 1990-1992 for every member of the sample, and retaining the regression residuals from the 1988-1990 achievement equation. We then reestimated the 1990-1992 value-added model with the 1988-1990 regression residual included as an explanatory variable. The null hypothesis of no serial correlation in the value-added error terms is rejected if the coefficient estimate for the lagged regression residual is statistically significant.\nAs seen in the last rows of Tables 2 and 3, the null hypothesis of no serial correlation was rejected at the 1 % level in every equation. It is interesting to note that the serial correlation term was negative in each case, which implies that students who \"underperform\" in terms of what the regression model predicts in one period tend, on average, to \"overperform\" in the next period. This pattern could be explained by measurement error involving the NELS test scores, or by the efforts of parents or school administrators to provide compensatory resources or attention in response to a student's poor previous performance (or, alternatively, by parents or administrators becoming complacent as a result of previous success).\nSince there is some variability in how previous studies specified Equation 4, we reestimated the value-added model in a variety of different ways. For example, we reestimated the model in log-log form to allow for additional nonlinearities and interaction terms between family and school variables. We also reestimated the model without peer group characteristics and without the NELS sampling weights. In each case, the coefficients for the classroom-or school-level input measures exhibited the same mixed pattern observed in Tables 2  and 3 . More important, our specification tests consistently rejected the null hypothesis of no model misspecification for each of these alternative models.\nThe ultimate questions of interest are whether the biases detected by our model specification tests are large enough to matter for the purposes of education policy evaluation and whether unbiased estimates show that school resources affect student test scores. We address these points in the next section by reviewing several recent studies that used IV methods to address the problem of correlation between school or classroom resources and omitted variables. In most cases, the IV estimates revealed statistically significant, positive effects of school resources on student achievement. Most of the studies also showed larger IV estimates than those derived by applying ordinary least squares to the same data sources, which provides additional support for our concern that the biases found with value-added models in the NELS data may afflict other value-added studies as well. Moreover, the and then discuss each of the IV studies described study findings suggest that these biases are large in Table 4 in some detail. enough to substantially distort value-added estimates of school resource effects."}, {"section_title": "Data", "text": "The Department of Education's National Education Longitudinal Study of 1988 surveyed a nationally representative sample of eighth-grade students; follow-up interviews were conducted in 1990 and 1992. The original sample involved a two-stage sampling design, with 1,052 schools selected in the first stage and 26 students per school selected in the second stageG4 Base-year respondents were selected to participate in follow-up surveys in part on the basis of the number of other base-year NELS participants in the student's school at the time, and dropouts were surveyed as well (US. Department of Education, 1994) . Since NELS participants were clustered in schools and classrooms, and all of the educational input measures used in this study were measured at the group level (school or classroom), ordinary least squares may underestimate standard as well as school administrator and student survey errors for regression coefficients (Moulton, 1986) . nonresponse rates (U.S.Department of Education, To correct for this problem, we calculated standard 1994). Our preferred estimates were calculated with errors using the delta method (Kish & Frankel, these weights, although we also developed 1974; Moulton, 1986) . unweighted estimates to examine the robustness of The Department of Education provides weightour findings. ing variables that account for probabilities of parDescriptive statistics for key variables are preticipation in the base-year and follow-up surveys, sented in Table 1 . The outcome measures of inter- (Goldberger & Cain, 1982) . In contrast, students in NELS were administered different versions of the tests in follow-up years according to base-year performance to minimize these \"ceiling\" and \"floor\" effects (U.S. Department of Education, 1994) . The Department of Education presents scores on these tests in a way that is scaled to allow for valid across-wave comparisons. Educational input measures included the school's student-teacher ratio, the proportion of teachers with advanced degrees, and the lowest (and, in some waves, the highest) salary paid to a full-time teacher, all taken from the school administrator suwey. Since teacher salaries typically increase with both educational credentials and experience, we used the lowest full-time teacher salary as a proxy for the starting salary within a school. This proxy could potentially confound the effects of teacher experience and pay; for example, a school with a low pay scale whose most junior teacher had 4 years of experience might report a higher minimum salary than a school with a high pay scale and a first-year teacher on staff.5 This did not appear to be a serious concern, since the average minimum salary for a full-time teacher in the 1990 NELS survey was almost identical to the national mean starting teacher salary for 1990 ($17,750 and $17,900, respectively, in 1987 dollars) (Smith, 1996) . Teacher salaries and teacher-student ratios together should capture most of the variation in the instructional resources that students receive.\nNELS does not include certain other school-input measures that have been shown to be correlated with student test scores, such as the test scores of the teachers themselves (Ferguson, 199 1; Ferguson & Ladd, 1996) . NELS also does not include measures of overall per pupil school spending, although estimates of the effects of specific expenditure items may be more useful in highlighting how additional resources should be allocated (Murnane, 1991) .\nIn the base year and first follow-up, NELS randomly selected two teachers to be surveyed from among each participating student's English, mathematics, science, and history instructors. In the second follow-up, either a mathematics or science teacher was surveyed for students enrolled in at least one math or science course. These teacher surveys provided an opportunity to use information on the student's classroom in a particular subject area, including the teacher's experience and education and overall class size, as it relates to the student's performance on a standardized test for that subject. These classroom-level variables provide more direct measures of the resources that each student receives relative to school-level variables. On the other hand, the student's test score in a particular subject area may be affected by inputs in her or his other classes (for example, reading scores may be affected by the quality of the student's history class). The NELS classroom-level variables will miss these spillover effects because the data set provides classroom information for, at most, two of the four subject areas just described for each student.\nOther relevant explanatory variables in the NELS include sociodemographic characteristics of the other students attending each respondent's school (percentage African American students, percentage Hispanic students, percentage eligible for free or reduced-price lunch). The characteristics of a school's student body may influence achievement through \"peer effects\" (Duncan, 1994; Jencks & Mayer, 1990; Ludwig, Duncan, & Hirschfield, 1999) , or by acting as proxies for job characteristics that make the school more or less attractive to talented teachers. Whether such peer or reference group variables should be included in achievement models is controversial, since such groups may be endogenous and thus may introduce new biases (Evans, Oates, & Schwab, 1992) . All of the results presented here were estimated both with and without these variables.\nThe NELS has several important limitations, including the fact that students were tested only at 2-year intervals and classroom-level information is available only for a subset of each student's classes. Nevertheless, NELS has several advantages over data used in previous studies: a large, nationally representative sample of students; detailed information about the family backgrounds and personal characteristics of students available at the student level, with many of these variables taken from parent and school reports (rather than simply from student surveys); a longitudinal survey structure including data on students before they enrolled in high school and on students who dropped out; and numerous measures of educational resources at both the school and classroom levels."}, {"section_title": "Empirical Results for Value-Added Models", "text": "The results of estimating the value-added model in Equation 4 for math and reading scores are shown in Tables 2 and 3 . We focus on student test scores from the second wave of the NELS (1990), when most students were in 10th grade. Our focus on 1990 test scores allowed us to estimate a valueadded model that controlled for 1988 achievement scores, and very few students in NELS (less than 4%) had dropped out of school by 1990. The set of controls for family background in the model is at least as rich as what is found in other value-added studies, and includes whether the student was living with her or his father or another adult man, family income taken from parent reports (coded as a sequence of dummy variables to allow for nonlinear income effects), and mother's and father's educational attainment (also taken from parent reports and also coded as a sequence of dummy variables to allow for nonlinear effects). Table 2 presents the estimated effects of classroom-level inputs on student performance in mathematics and reading. The key input measures included the size of the student's math or reading classroom in 1990, teacher experience (in years), teacher experience squared (to allow for nonlinear experience effects, as reported by Murnane, 1975) , and whether the teacher had more or less education than a college degree. The model followed Ferguson and Ladd (1996) and allowed for nonlinear class size effects by including spline terms, defined as class size minus 15 if the class size was larger than 15 and zero otherwise, and similarly for a spline cutoff of 30. The effect of a marginal change in classroom size when size exceeded 15 is given by adding the coefficients for class size and spline 15; for changes in classrooms larger than 30 students, we added the coefficients for class size and both splines. (As noted earlier, one drawback of this classroom-input model is that we could not control for the quality of the classroom environments in all of the student's other classes, even though inputs in these classes may also have affected math and reading scores.)\nAs can be seen in Table 2 , the results show the same puzzling pattern of estimated school resource effects as that reported in the previous literature. For example, college education for teachers appears"}, {"section_title": "Instrumental Variables Estimation", "text": ""}, {"section_title": "IV methods seek to idenhfy sources of variation", "text": "InstrumentalVariables Studies in school resources that are unrelated to unobserved In this section, we review the results of studies characteristics of students or their families and do using IV methods to address the omitted variables not affect student learning other than by influencing problems that appear to plague many value-added measurable resources. The most common method studies. As outlined in Table 4 , most of these IV of estimating IV models is through two-stage least studies suggest that increases in school resources squares analyses. For simplicity, assume that S~T, the lead, on average, to increased student learning. The intuition behind the IV model is straightforward. The key empirical concern with the valueadded model in Equation 4 stems from possible correlation between the regression error term (v~T) and the school resource variables (Sir). The twostage least squares procedure isolates the variation in school resources (ST) that is due to variation in the instruments (Zir). If the instruments are uncorrelated with the error term in the achievement equation, the predicted value of jlr will be uncorrelated with the error term, and the coefficient estimate for the effects of school resources on student achievement (dl) will be unbiased.\nThus, the three necessary conditions for unbiased IV estimation are as follows. First, variation in the instruments (217) must be related to variation in the school inputs of interest (Sir). Put differently, the instruments must be correlated with school resources even after we control for the other family and student variables in Equation 5. Second, the instruments cannot have a direct causal effect on student achievement other than by affecting the level of school inputs for the student. Third, the instruments cannot be correlated with whatever unobserved factors affect student achievement (see Angrist, Irnbens, & Rubin, 1996 , for an excellent discussion). If the instrumental variables are only weakly correlated with school resources, even a slight violation of the second or third conditions can lead to substantial bias in the resulting estimates (Bound, Jaeger, & Baker, 1995) .\nThe second and third conditions are similar in a statistical sense, in that both require the instrument (Z,r) to be uncorrelated with the error term for student achievement (uir). Yet distinguishing between the two conditions may be useful for researchers because many candidate instruments will arguably not have direct effects on achievement, but may be correlated with unobserved factors that affect student test scores. Consider, for example, the idea of using a student's region of residence (South, West, Midwest, or Northeast) as an instrument. There has traditionally been variation in school spending across regions of the United States, with spending in the South, in particular, lagging behind that of other regions (Armor, 1972) .Moreover, the physical location of a child's family in a specific quadrant of the country is unlikely to have a direct causal effect on academic achievement. Thus, region seems to satisfy the first two conditions for valid instruments just described.\nHowever, region is unlikely to meet the third condition for valid IV estimation, since there appear to be systematic population differences across regions of the country that are not well measured in most education data sets. For example, adults (including teachers) in the South have historically had lower test scores on average than those in other regions of the country (Armor, 1972) , and most education data sets do not include test scores for teachers or parents, even though the cognitive skills of both groups are related to student achievement (Ferguson, 199 1 ; Ferguson & Ladd, 1996; Phillips, Brooks-Gunn, Duncan, Klebanov, & Crane, 1998) . Similarly, whatever cultural factors cause the South to have higher rates of violence than other regions (Butterfield, 1995) might plausibly be related to academic outcomes as well.\nIn sum, N estimation requires that the analyst identify a variable that is correlated with the schoolor classroom-level inputs a student receives but otherwise does not affect the student's achievement. One advantage of the IV method is that researchers are forced to identify the source of variation in school resources that is being related to variation in student test scores, and to argue why this source of variation meets the conditions just described. The validity of the instruments can then be judged according to basic statistical diagnostics: social science theory, and common sense."}, {"section_title": "Instrumental Variables Studies of School", "text": "Resources and Student Achievement\nThls section reviews the current IV literature on the effects of school resources on student achievement. Our review focuses on those IV studies in which the instruments are most likely to be valid.I0 Some readers may take exception with the instruments used in any individual N study; taken together, however, these studies provide stronger evidence for a positive relationship between school inputs and student test scores than the previous value-added literature. Angrist and Lavy (1997) estimated the effects of class size on the test scores of Israeli fourth and fifth graders in 199 1 and third graders in 1992. As instruments, they used variation in school enrollments combined with a religious rule, dating back to the 12th century, that governs class sizes. When a school's classroom size is close to the cutoff specified by the rule, modest changes in school enrollment can trigger sharp reductions in average class sizes as schools add teachers to keep classrooms below the limit. Angrist and Lavy found that reductions in class size of approximately 35% (about 10.5 students per class) imply statistically significant increases in student test scores of 0.10 to 0.20 standard deviations for fifth graders, gains about half that size for fourth graders, and little gain for third graders. The authors attributed the lack of effect for third graders to across-the-board changes in instruction and testing conditions that occurred in Israel in 1992 in response to public dissatisfaction with the 1991 test results, which in turn served to reduce the variance in student test scores. Angrist and Lavy also found that ordinary least squares estimates either understated the effects of class size on test scores relative to IV models or produced estimated effects that were of the opposite sign.\nAngrist and Lavy's estimates will be valid so long as parents and school administrators do not behave strategically to affect whether a given child's school is just over or under the class size cutoff. In practice, such strategic behavior is probably difficult for both parents and teachers, given the uncertainty about both the school's enrollment in a given year and how other parents will react to particular enrollment or class size patterns. ] '\nThe magnitudes of the Angrist and Lavy class size estimates are roughly the same as those of the estimates from the Tennessee STAR experiment (Finn &Achilles, 1990; Krueger, 1997) . The wellknown STAR experiment overcame the evaluation problem stemming from correlation between student characteristics and educational resources by randomly assigning 11,600 students in kindergarten through third grade to small classes, regular classes, or regular classes with a teacher aide. While it may be surprising to some readers to think of the STAR results as IV estimates, social science experiments such as Tennessee STAR in fact provide the ideal opportunity for IV estimation. The reason is that the variable indicating the treatment group to which the student is randomly assigned is by construction a valid instrument, one that is correlated with student class sizes (given the nature of the experiment) but uncorrelated with unobserved student variables that affect achievement (since assignment to classroom size treatment groups is random).\nAnalysis of the Tennessee STAR experiment reveals sizable effects on achievement during the first year that students were assigned to smaller classrooms, but the effects of each additional year in a small classroom were, at most, one quarter as large (Krueger, 1997) . One implication of this finding is that estimates from value-added models, which focus on changes in test scores from one year to the next, will miss the initial gain from small classes if students are observed during subsequent years spent in such classrooms. At first glance, the Angrist and Lavy findings that the effects of smaller classes are larger for fourth and fifth graders than for third graders seem inconsistent with the STAR results showing that achievement gains are largest for kindergarten students and first graders (when most students were assigned to smaller classes). However, the Angrist and Lavy study relied on cross-sectional data for Israeli students, which did not allow determination of how long students had been in a classroom of a given size. As a result, it is not clear whether the Angrist and Lavy achievement estimates represent one-time or cumulative effects.I2\nIn contrast to the Angrist and Lavy study and the Tennessee STAR experiment, Hoxby (1998) examined the effects of class sizes on fourth-, sixth-, and eighth-grade test scores in Connecticut school districts and found little evidence for class size effects on student leaming. Her instrument was derived from departures from general population trends in Connecticut towns (which correspond to individual school districts in that state). Departures from population trends, in turn, affect class sizes through fluctuations in school enrollments. Angrist and Lavy (1997) hypothesized that the statistically insignificant effects of class size found in Hoxby's study may have been due in part to the already-low average class size in Connecticut (19 students, as compared with an average of more than 23 students per class in the nation as a whole [see Table 11 ). Ludwig (1999) examined the effects of studentteacher ratios and teacher salaries on test scores using the nationally representative NELS data set (described earlier). As instruments, he used changes in U.S. federal and state education spending over the 1988 to 1992 period. The share of total education spending covered by federal and state sources varies across states and, because such aid tends to target schools serving poor students, within states as well. Ludwig found that reductions in studentteacher ratios and increases in teacher salaries produce statistically significant increases in math scores but have less clear effects on reading. The estimated effects of student-teacher ratios on math scores were similar in magnitude to those from Angrist and Lavy and the STAR experiment.\nChanges in the federal education assistance provided to a state will be a valid instrument if patterns of federal school spending are not motivated by the performance of students in the state. Some evidence to support this assumption comes from Mayer's (1991) study of f e d d defense appropriations, which suggests a very indirect relationship between local citizen preferences and congressional legislation, as well as substantial time lags associated with both the process through which Congress approves funds and the actual obligation of funds once approval is granted. Changes in state aid may be a valid instrument because the reductions in aid in many states during the 1988-1992 period were driven in part by court-mandated state spending on prisons (partly in response to prison overcrowding) and federally mandated expenditures on Medicaid (U.S. General Accounting Office,1995) rather than by factors related to the outcomes of the state's students.\nCullen (1 997) used school-level data from Texas for 1993-1995 and found that increases in school spending improve student achievement. Her instrument was derived from natural variations across areas in the number of students with physical disabilities. Since additional school spending on physically disabled students tends to \"crowd out\" spending on other students, the number of physically disabled students will be negatively correlated with regular education spending. Cullen's study differed from the IV studies described earlier in that the latter tested the hypothesis that increases in specific instructional spending items translate into additional student learning; in contrast, Cullen examined the joint hypothesis that schools spend additional hnds on expenditure items that are relevant for student learning and are then, in turn, able to translate additional spending on these items into increased student learning. She found that IV estimates of the effects of school spending on student test scores were up to five times as large as ordinary least squares estimates.\nCullen's IV procedure assumed that parents of physically disabled students do not choose their residential location on the basis of the quality of local school services for disabled students.13 If parents of disabled students move to school districts with higher quality services for disabled students, the nature of the bias will depend on why some schools have better programs for disabled students than other schools. Suppose, for example, that local voters who are unusually concerned about education choose to support programs for disabled children. If local voter concern about education translates into a school system of parents who are unusually involved in their children's schooling, then areas with high-quality programs for disabled students will have more students with disabilities (because of self-selection) and lower regular education spending (because of crowd out). Cullen's estimates would then understate the effects of spending on test scores (because regular education spending in this case is negatively correlated with unobserved measures of parents' involvement in their children's education).\nFinally, Figlio (1997) used NELS data to present what can be thought of as indirect IV estimates. He f h t showed that state property tax limitations serve to limit school spending. He then regressed student test scores against indicators of whether a student's state has a property tax limitation (rather than against direct measures of the student's school resources). Figlio found that tax limits are associated with lower student test scores. Similarly, Card and Payne (1998) examined the relationship between school finance reforms and inequality in school spending and student SAT scores. They found evidence for a positive but weak effect of additional school spending on student test scores. Both studies provide useful information on school resource effects if state tax limits and school finance reforms are unrelated to other changes in state policies or population characteristics that may affect educational achievement.\nTheseIVstudies reveal the variety of approaches that can be used to identify the effects of school resources. The instruments in any IV study are always open to question, with the exception of those used in the Tennessee STAR study, which are valid by virtue of the program's randomized experimental design. The studies described here all used instruments that are plausibly valid and, taken together, provide some evidence that additional resources may improve student achievement. The findings also suggest that the biases revealed with value-added models applied to the NELS data are apparently large enough to matter, since ordinary least squares analysis typically produces smaller (or even negative) estimates than IVestimates obtained from the same data."}, {"section_title": "Discussion", "text": "To date, the question of how additional resources affect student learning has largely been answered by meta-analyses of the conflicting value-added literature. The results presented here are consistent with the idea that the mixed results shown in previous studies may be due to omitted variables problems.\nWe have shown that value-added models cannot produce unbiased estimates in the NELS data set, which is true across a wide range of choices about model specification, functional form, and sample weighting decisions. Given the large number of data sets and model specifications that have been used to estimate value-added models in the literature, even an exhaustive application of different models to a single data set such as NELS cannot conclusively prove that all previous studies were biased. Moreover, the NELS has several important limitations; for example, classroom-level information is available for only a subset of each student's classes and teachers, and students were tested only at 2-year intervals. Nevertheless, the NELS is arguably among the best micro data sets available for this application, with rich student, family, school, and even classroom information provided at the student level, taken from surveys of parents and school administrators as well as students. Our findings cannot demonstrate that every previous value-added study was biased, but they do suggest that perhaps less weight should be given to the value-added literature in future debates over education policy. At the very least, future value-added research should provide the results of the basic diagnostic tests used here, which might reveal whether the conditions for unbiased estimation are met in the particular data set being used.\nWe have also shown that more recent studies using IV methods provide somewhat stronger support than the value-added literature for the idea that additional resources translate, on average, to improved student learning. While the instruments used in IV studies are always open to question, the similarity between estimates from the Tennessee STAR experiment and several of the IV studies provides School Resources and Student Achievement some support for the idea that many of these instruments are valid. On the other hand, several of the IV studies suggest weak or no effects of school resources on certain educational outcomes. Taking the full set of IV results together with our NELS results, we conclude that the biases we have identified with the value-added studies are large enough to be of substantive significance and typically lead to understated school resource effects. While the recent IV literature on the effects of school spending is far from definitive, the IVtechnique may be a useful tool to overcome the omitted variables problems that may plague value-added methods. The IV method relies on identifying variables that are correlated with the educational resources that students receive but are otherwise uncorrelated with student achievement. Creative application of IV estimation may help researchers identify the average effects of school resources on achievement and the conditions under which resources can be used most effectively. We end by noting that even definitive evidence showing that additional school expenditures raise student test scores is not sufficient to conclude that increasing education budgets or expenditures on specific instructional items is good public policy. If the objective of government policy is to obtain the highest level of student learning for a given level of expenditure, cost-effectiveness analysis should be used to determine which instructional expenditures (such as reductions in class sizes versus increases in teacher salaries) are able to achieve a given increase in student test scores at the lowest possible cost. Moreover, other government interventions that compete with public schools for resources may affect test scores as well as other socially desirable outcomes such as increased future earnings, decreased criminal involvement, and improved health. Determining which programs produce the largest gains to society for a given expenditure will require that all outcomes be measured in a common metric that can be compared with costs (e.g., dollars). Combining unbiased estimates of school resource effects with cost-benefit analysis could help guide policy decisions about allocating resources across competing uses such as school funding, expansions in the coverage or intensity of early childhood interventions, parenting classes or other efforts to enhance the cognitive stimulation that children receive within the home, and dropout prevention programs (Donohue & Siegelman, 1998; Jencks & Phillips, 1998; Levin, 1989) ."}, {"section_title": "Notes", "text": "We thank Duncan Chaplin, Charles Clotfelter, Jeffrey Conte, Paul Harrison, Christopher Jencks, Richard Mumane, Steve Pischke, Eric Ralph, Leslie Whittington, and seminar participants at the Bureau of Labor Statistics, the University of Chicago, Georgetown University, Northern Illinois University, and the 1997 Association for Public Policy Analysis and Management meetings for valuable comments. We also thank Heath Einstein, Brian Komar, Marisa De La Cruz, and Theresa Luhm for valuable assistance. This paper was written in part while the first author was visiting scholar at the Northwestern University/University of Chicago Joint Center for Poverty Research and National Academy of Education1Spencer Foundation postdoctoral fellow in education research. Any errors in fact or interpretation are our own. 'Goldhaber and Brewer (1997) showed that correlation between any school-specific unobserved variables and school resource measures (ST) is unlikely to produce substantial bias in estimates of the effects of school resources. This finding does not mean that unobserved family-or student-level variables are unimportant sources of bias in estimating school resource effects.\n2For example, schools frequently assign students to remedial or advanced classes on the basis of prior achievement, and both classroom size and teacher attributes may systematically vary across classes by academic level.\n3Meyer (1992) discussed two strategies for addressing measurement error in previous test scores. The first method adjusts the results using a measure of the variance of the measurement error. The second method is two-stage least squares; in Meyer's application examining the effects of math courses on math achievement, he used previous math courses as instrumental variables to predict the previous period's test scores.\n4Excluded from the NELS sample in 1988 were students with mental handicaps, physical or emotional problems, and inadequate command of the English language. In most cases, 24 of the 26 students per school included in NELS were randomly sampled, while the other 2 students were selected from among Hispanic and Asian Islander students (U.S. Department of Education, 1994) .\n'Thanks to Richard Mumane for pointing out this potential problem. 6As a minor technical point, the Johnson-McClelland test assumes that the regression error terms are identically and independently distributed. This assumption is technically not met with the NELS data because the cluster sample design may have introduced some correlation in the error terms of students within the same school. In practice, this nonindependence has little effect. We examined the sensitivity of our calculations to violations of the error-independence assumption by randomly selecting only one student per NELS school. We found that the Johnson-McClelland test statistics differed from those reported in Tables 2 and 3 only because of the  reduction in sample size. 'Also of interest is the case in which there are multiple school input variables of interest that may be correlated with the unobserved variables that affect achievement. In this case, the procedure is the same as described here, but predicted values are calculated separately for each of the school input variables in first-stage regressions. The key requirement for the two-stage least squares analysis is that the number of instrumental variables in 2 7 must at least equal the number of school input variables for which predicted values are calculated.\n8As a minor technical point, the standard errors obtained from estimating the second regression must be adjusted to account for the inclusion of the predicted value as a covariate. The adjustment consists of dividing the standard errors obtained from estimating Equation 6 using the actual rather than predicted school resource variable by the standard errors obtained from estimating Equation 6 with the predicted rather than actual school resources (e.g., see Gujarati, 1988 , or Greene, 1993 .\n9Bound, Jaeger, and Baker (1995) suggested that readers report the partial R2and F statistics to describe how much explanatory power the instrumental variables have in the first-stage regression. As for the second and third conditions for valid IV estimation, if we assume that the effects of additional resources are equal for all students (i.e., a \"constant treatment effect\") and if the analyst has more instrumental variables than potentially confounded school input variables that must be measured, then these conditions can be tested by essentially regressing the residuals from the second-stage regression against the instruments (see Hausman, 1983 , or Newey, 1985 . If the treatment effect is assumed to vary across students, interpretation of the IV estimate and the HausmanNewey diagnostic tests becomes complicated (see Angrist, Imbens, & Rubin, 1996) .\n'Three other N studies providing evidence that additional resources improve student test scores are not included in our review because of concerns with the instruments. Akerhielm (1995) used NELS data and total school enrollment as an instrument, although school enrollment does not appear to be a valid instrument (as noted by Angrist & Lavy, 1997). Boozer and Rouse (1995) also used the NELS to estimate IV models with state special education policies as instruments, although overidentification tests reject the null hypothesis that these instruments are valid. Ferguson and Ladd (1996) applied IV models to district-level data from Alabama and found evidence to suggest that increases in spending produce substantial gains in achievement. However, their district-level instruments (per capita income and property value per student) may have affected student achievement both directly (since they reflected the average family background of the students) and indirectly (through possible peer or neighborhood effects).\n\"For example, consider a family whose child is in a school with an enrollment level such that class sizes are just below the cutoff that triggers reductions to much smaller classes. If the parents believe that other parents will respond to this situation by moving to other schools with smaller classes, our hypothetical family will stay in place since the departure of other families will reduce classes in the current school. On the other hand, if the parents believe that other families will stay despite the current enrollment situation, our family may be more likely to leave in search of a school with smaller classes.\n''For example, consider a case in which each student's class size is identical during every year she or he is in school. In this case, students who were in small classes during fifth grade were also in small K-4 classes. The observed test score differences in fifth grade in our example would be equally consistent with a one-time smallclass gain, as in STAR, or more modest cumulative gains. Since the class sizes of students are unlikely to be perfectly correlated across years of schooling, many other combinations of one-time and cumulative effects are also possible.\n'3Thanks to an anonymous referee for this observation."}]