[{"section_title": "Abstract", "text": "Context Docosahexaenoic acid (DHA) is the most abundant long-chain polyunsaturated fatty acid in the brain. Epidemiological studies suggest that consumption of DHA is associated with a reduced incidence of Alzheimer disease. Animal studies demonstrate that oral intake of DHA reduces Alzheimer-like brain pathology.\nTo determine if supplementation with DHA slows cognitive and functional decline in individuals with Alzheimer disease.\nA randomized, double-blind, placebo-controlled trial of DHA supplementation in individuals with mild to moderate Alzheimer disease (Mini-Mental State Examination scores, 14-26) was conducted between November 2007 and May 2009 at 51 US clinical research sites of the Alzheimer's Disease Cooperative Study.\nIntervention Participants were randomly assigned to algal DHA at a dose of 2 g/d or to identical placebo (60% were assigned to DHA and 40% were assigned to placebo). Duration of treatment was 18 months.\nChange in the cognitive subscale of the Alzheimer's Disease Assessment Scale (ADAS-cog) and change in the Clinical Dementia Rating (CDR) sum of boxes. Rate of brain atrophy was also determined by volumetric magnetic resonance imaging in a subsample of participants (n=102).\nResults A total of 402 individuals were randomized and a total of 295 participants completed the trial while taking study medication (DHA: 171; placebo: 124). Supplementation with DHA had no beneficial effect on rate of change on ADAS-cog score, which increased by a mean of 7.98 points (95% confidence interval [CI], 6.51-9.45 points) for the DHA group during 18 months vs 8.27 points (95% CI, 6.72-9.82 points) for the placebo group (linear mixed-effects model: P=.41). The CDR sum of boxes score increased by 2.87 points (95% CI, 2.44-3.30 points) for the DHA group during 18 months compared with 2.93 points (95% CI, 2.44-3.42 points) for the placebo group (linear mixed-effects model: P=.68). In the subpopulation of participants (DHA: 53; placebo: 49), the rate of brain atrophy was not affected by treatment with DHA. Individuals in the DHA group had a mean decline in total brain volume of 24.7 cm 3 (95% CI, 21.4-28.0 cm 3 ) during 18 months and a 1.32% (95% CI, 1.14%-1.50%) volume decline per year compared with 24.0 cm 3 (95% CI, 20-28 cm 3 ) for the placebo group during 18 months and a 1.29% (95% CI, 1.07%-1.51%) volume decline per year (P=.79).\nSupplementation with DHA compared with placebo did not slow the rate of cognitive and functional decline in patients with mild to moderate Alzheimer disease.\nTrial Registration clinicaltrials.gov Identifier: NCT00440050"}, {"section_title": "D O C O S A H E X A E N O I C A C I D", "text": "(DHA) is an omega-3 fatty acid identified as a potential treatment for Alzheimer disease. Epidemiological studies have shown that omega-3 fatty acid consumption reduces Alzheimer disease risk and DHA modifies the expression of Alzheimer-like brain pathology in mouse models.\nSeveral studies have found that consumption of fish, the primary dietary source of omega-3 fatty acids, is associated with a reduced risk of cognitive decline or dementia. [1] [2] [3] [4] [5] [6] Some studies have found that consumption of DHA, but not other omega-3 fatty acids, is associated with a reduced risk of Alzheimer disease. 3 Studies of plasma fatty acids have confirmed the dietary studies, finding that plasma levels of omega-3 fatty acids, and especially DHA, are associated with a reduced risk of Alzheimer disease. 7, 8 The most abundant long-chain polyunsaturated fatty acid in the brain, DHA is enriched in synaptic fractions and is reduced in the brains of patients with Alzheimer disease. 9, 10 The other major omega-3 fatty acid found in fish, eicosapentaenoic acid, is virtually absent from the brain.\nThese findings motivated researchers to conduct animal studies that used DHA, rather than mixed omega-3 fatty acids, for intervention studies aimed at reducing Alzheimer disease brain pathology in transgenic mouse models. In mutant amyloid precursor protein (APP) Tg2576 mice, DHA supplementation reduced amyloid ␤ pathology 11 as well as the neuritic damage associated with amyloid ␤ plaques. 12 In mice carrying 3 mutant transgenes (App, Ps1, Tau) associated with Alzheimer disease pathology, DHA supplementation reduced both amyloid ␤ and tau pathology. 13 The plausibility of effective intervention with DHA in humans is further supported by evidence that brain levels of DHA vary with dietary intake, and that the average daily intake of DHA in the US diet is approximately 70 mg, 14 which is considerably below the levels noted to be protective in epidemiological studies. Based on all of these considerations, we hypothesized that DHA supplementation would slow the rate of cognitive and functional decline in individuals with Alzheimer disease."}, {"section_title": "METHODS", "text": "This randomized, double-blind, placebo-controlled trial was conducted by the Alzheimer's Disease Cooperative Study (ADCS), a consortium of academic medical centers and private Alzheimer disease clinics funded by the National Institute on Aging to conduct clinical trials on Alzheimer disease. Fifty-one US centers participated in this trial after obtaining approval from their local institutional review boards. Written informed consent was obtained from study participants, legally authorized representatives, or both, according to local guidelines. Individuals with probable Alzheimer disease, recruited from the sites' clinic populations, were eligible if (1) their Mini-Mental State Examination (MMSE) score was between 14 and 26, (2) they were medically stable, (3) they consumed on average no more than 200 mg/d of DHA (as assessed by a brief 7-item food frequency questionnaire), and (4) they were not taking DHA or omega-3 fatty acid supplements. Individuals were excluded if they were taking drugs with central anticholinergic effects or sedatives or were receiving any investigational treatment for Alzheimer disease. Stable use (Ն3 months) of cholinesterase inhibitors or memantine was permitted.\nRandomization was achieved with a centralized interactive voice response system, using a block design with a block size of 5 (3 in the DHA group and 2 in the placebo group). The disproportionate enrollment in the treatment group was intended to enhance recruitment. The treatment period was 18 months. Visits were scheduled every 3 months, with adverse event assessments and pill counts to assess adherence at every visit."}, {"section_title": "Study Medication, Assignments, and Masking", "text": "The study drug was an algal-derived DHA (Martek Biosciences, Columbia, Maryland) administered as capsules, dosed as 1 g twice per day for a total daily dose of 2 g. Algal DHA contains approximately 45% to 55% of DHA by weight and does not contain eicosapentaenoic acid. The DHA dose was selected based on evidence that plasma levels increase in a dosedependent manner up to approximately 2 g/d, while at higher doses no further increase in plasma DHA is seen. 15 Placebo capsules (made up of corn or soy oil) were identical in appearance. The adequacy of blinding was assessed by questionnaires completed by caregivers, study coordinators, and site physicians."}, {"section_title": "Outcome Measures", "text": "The2co-primaryoutcomemeasureswere the rate of change over 18 months on the cognitive subscale of the Alzheimer's Disease Assessment Scale (ADAS-cog) 16 and on the Clinical Dementia Rating (CDR) sum of boxes. 17 The ADAS-cog is a 70-point scale that evaluates memory, attention, language, orientation, and praxis, with higher scores indicating greater impairment.TheCDRsumofboxesisaglobalmeasureassessingmemory,orientation, judgment and problem solving, community affairs, home and hobbies, and personal care.\nSecondary outcome measures included change in scores on the MMSE, 18 the ADCS's activities of daily living (ADCS-ADL) scale, 19 the Neuropsychiatric Inventory (NPI), 20 and the Quality of Life Alzheimer's Disease scale. 21 All outcome measures were obtained at baseline, 6 months, 12 months, and 18 months with the exception of the MMSE, which was obtained at baseline and at 18 months.\nSubpopulations participated in studies of brain imaging (DHA: 53; placebo: 49) and cerebrospinal fluid (DHA: 29; placebo: 15) markers. In those participants, brain magnetic resonance imaging (MRI) or cerebrospinal fluid collection occurred at baseline and at the 18-month visit. The subpopulation was selected as follows: all participants without contraindication to MRI (eg, pacemaker) who were enrolled at trial sites that were also certified Alzheimer's Disease Neuroimaging Initiative (ADNI) sites were invited (but not required) to participate in the MRI substudy. The MRI sequence, as well as methods for across-site standardization and quality control, were those used in the ADNI study. 22 The methods of the ADNI study were used to generate brain volumes at baseline and 18 months, which were then used to generate rates of total brain atrophy, hippocampal atrophy, and ventricular enlargement. All participants without contraindication to cerebrospinal fluid examination (eg, anticoagulation) were invited to participate in the cerebrospinal fluid study. In these individuals, lumbar puncture was performed in the morning after an overnight fast.\nIn the fatty acid analysis for plasma and cerebrospinal fluid, plasma phospholipid fatty acid levels were determined using established methods, 23, 24 with modifications for cerebrospinal fluid analysis. The fatty acid profiles were expressed as a percentage of the total micrograms of fatty acid (weight percentage)."}, {"section_title": "Statistical Analysis", "text": "The primary aim of the statistical analysis was to determine if the rate of cognitive and functional decline differed between participants treated with DHA and participants randomized to placebo. The primary analysis was conducted using linear mixed-effects regression models to assess group differences in rate of change on ADAS-cog and CDR sum of boxes over 18 months. In addition, generalized estimating equations and analysis of covariance (ANCOVA) models were used in sensitivity analyses.\nPower calculations were based in part on analysis of ADAS-cog total score data from the ADCS nonsteroidal anti-inflammatory drugs trial (ADCS-NSAID). 25 An estimated decline of 3.8 ADAS-cog points per year in the placebo group (ie, 66% of the observed rate in the ADCS-NSAID) was used for the power analysis. Assuming a 20% annual attrition rate and a 10% annual drop-in rate evenly dispersed along an 18-month treatment period, and an ␣ level of .05, a sample size of 240 for active treatment and 160 for placebo provides 80% power to detect a 33% reduction in the rate of ADAS-cog decline. Power analysis was also performed for the co-primary outcome measure, the CDR sum of boxes, and was also based on the rates of change seen in the ADCS-NSAID trial. Assuming an annual rate of change of 1.47 points per year on the CDR sum of boxes (66% of that seen in the ADCS-NSAID), a sample size of 240 for active treatment and 160 for the placebo group provides 80% power to detect a 32% or larger reduction in the rate of decline in the CDR sum of boxes.\nThe primary analysis was an intentto-treat analysis including all randomized participants. That is, participants were analyzed in the group to which they were randomized, regardless of medication adherence. All available assessments for ADAS-cog and CDR sum of boxes were used in the analysis for individuals who discontinued medication. A secondary per-protocol analysis was also performed on all randomized individuals who completed the study (18 months) and ingested at least 80% of the protocol-prescribed study medication as measured by pill count. The linear mixed-effects and generalized estimating equation models do not require imputation of missing data. Multiple imputation 26 was used to impute 18-month values for the ANCOVA analyses.\nA list of covariates anticipated to be associated with rate of decline on ADAS-cog score, CDR sum of boxes, or both was compiled before study initiation. This list consisted of baseline age, baseline MMSE score, baseline plasma phospholipid DHA level, duration of Alzheimer disease, education level, and apolipoprotein E (APOE) genotype. Each variable was to be included as a covariate in the linear mixed-effects model if both a univariate 2-sample test showed a significant difference in the variable between treatment groups at the ␣ level of .10, and a bivariate measure of association showed a significant association between the variable and the rate of change on the outcome measure at the ␣ level of .15. For the primary analysis, baseline MMSE score was found to be unbalanced between groups and associated with the rates of change in scores on the ADAS-cog and CDR sum of boxes, and was therefore included in the model as a covariate in the analysis of these co-primary outcome measures. Although it was not prespecified as a candidate covariate, Study partner issue is included as a reason for discontinuation because of the requirement for a study partner to participate in several of the key outcome measures in this trial (eg, Clinical Dementia Rating sum of boxes, ADCS activities of daily living, and Neuropsychiatric Inventory). There were no significant differences in incidence of dropout, adverse events, or serious adverse events (Table 2) . a There could be more than 1 reason for exclusion or study discontinuation.\nsex was also found to be both unbalanced between groups and associated with rate of change on the primary outcome measures, prompting an ad hoc analysis including both sex and MMSE score as covariates. Several exploratory analyses were specified in the analysis plan prior to study initiation. One was an analysis of the effect of DHA on rate of progression in participants with higher and lower baseline MMSE scores, with the groups divided at the median MMSE score. The second was an analysis of the effect of DHA supplementation on rate of progression among APOE ε4 allele carriers and noncarriers. These exploratory analyses also used linear mixedeffects modeling in both intent-totreat and per-protocol populations, with the same rules for including covariates.\nStatistical software R version 2.7.0 27 was used for all statistical analyses. For the primary hypothesis, the analysis was duplicated by using SAS version 9 (SAS Institute Inc, Cary, North Carolina) for verification purposes. The significance level was set at a P value of less than .05. All statistical testing was 2-sided."}, {"section_title": "RESULTS", "text": "Participants were recruited between February and November 2007. Clinical activity was completed in May 2009 and the database was locked in June 2009. The flow of study participants is shown in FIGURE 1. Of 555 individuals screened, 402 met the study criteria and were randomized, 238 to DHA and 164 to placebo. Only sex and baseline MMSE differed between the DHA and placebo-treated populations at a P value of less than .10 (TABLE 1). Over the course of 18 months, 67 participants in the DHA group (28%) and 40 participants in the placebo group (24%) discontinued taking the study drug, with the minority discontinuing due to adverse events (Figure 1 )."}, {"section_title": "Plasma and Cerebrospinal Fluid Fatty Acid Levels", "text": "As expected, plasma phospholipid DHA increased in the DHA treatment group from 3.18 weight percentage at baseline to 9.80 weight percentage at 6 months, 10.20 weight percentage at 12 months, and 9.82 weight percentage at 18 months (207% increase, P Ͻ .001) with no significant change in plasma phospholipid DHA in the placebo group (3.13 weight percentage at baseline and 3.12 weight percentage at 18 months). In a subgroup of 44 participants volunteering for cerebrospinal fluid collection at baseline and 18 months (DHA group: 29; placebo group: 15), a significant 38% increase in cerebrospinal fluid DHA was observed in the DHA group (2.53 weight percentage at baseline and 3.46 weight percentage at 18 months; P Ͻ.001) but not in the placebo group (2.50 weight percentage at baseline and 2.17 weight percentage at 18 months; P=.79). Seventy-three participants provided cerebrospinal fluid at baseline but 24 declined or had dropped out by 18 months."}, {"section_title": "Co-primary Outcome Measures", "text": "The effect of DHA treatment on the primary and secondary clinical outcome measures is shown in FIGURE 2. For the primary linear mixed-effects analysis of the rate of change of ADAS-cog and CDR sum of boxes, baseline MMSE score was the only covariate qualifying for inclusion in the model. The rate of mean change in ADAS-cog score over 18 months was 8.27 points (95% con- Figure 2B ). The ad hoc linear mixed-effects analyses including both sex and baseline MMSE score as covariates also did not show a benefit of treatment with DHA on the ADAS-cog (P=.61), CDR sum of boxes (P=.69), or ADCS-ADL (P=.38). Confirmatory generalized estimating equations and ANCOVA analyses did not show a benefit of treatment with DHA."}, {"section_title": "Secondary Outcome Measures", "text": "The linear mixed-effects analysis revealed a rate of decline on the ADCS-ADL of 11.51 (95% CI, 9.57 to 13.45) points change over 18 months for the DHA group compared with the points change of 10.43 (95% CI, 8.41 to 12.45) for the placebo group (linear mixedeffects model: P=.38; Figure 2C ). The NPI changed by 2.93 points (95% CI, 0.92 to 4.94 points) over 18 months for the DHA group compared with 5.09 points (95% CI, 2.49 to 7.69 points) for the placebo group (linear mixedeffects model: P = .11; Figure 2D ). An ANCOVA analysis showed no change in MMSE score from baseline to In a per-protocol analysis, an identical analysis was performed on only randomized participants who completed the study and ingested at least 80% of study medication. Perprotocol results did not significantly differ from the intent-to-treat results (eTable 1 at http://www.jama.com)."}, {"section_title": "Adverse Events", "text": "The proportion of individuals with at least 1 adverse event, serious adverse event, hospitalization, and death were similar in the active and placebo groups (TABLE 2) . During the blinded phase of the trial, the data and safety monitoring board noted that 3 individuals taking warfarin (of a total of 32 participants taking warfarin at the time of randomization) reported subtherapeutic international normalized ratio (INR) after initiating study drug, and the protocol was revised to require monthly INR testing, which was reported to the medical monitor for all participants taking warfarin for the duration of the trial. No further cases of study drugassociated INR instability were noted. After unblinding, all 3 participants with an adverse event of decreased INR were found to be receiving active DHA. There was also a single adverse event of increased INR in the placebo group.\nThe data and safety monitoring board also noted during the blinded phase of the trial that thrombotic events were occurring at a rate higher than expected overall, and such events were monitored closely during the trial. After unblinding, there was no significant difference between treatment and placebo in the incidence of thrombotic events ( Table 2) ."}, {"section_title": "Blinding Analysis", "text": "When asked to guess treatment assignment for each participant at the final study visit, the majority of study partners (48.5%), study coordinators (50%), and site physicians (59.2%) responded \"do not know.\" The proportion correctly guessing the active DHA group was not significantly different for the study partner (22.3% for DHA and 26.4% for placebo; P=.49) or study coordinator (27. 1% for DHA and 18.4% for placebo; P=.13), but site physicians were more likely to guess that participants in the DHA group were receiving treatment (21.9% for DHA and 11.3% for placebo; P=.02). The reasons for the ratings (adverse events, perceived efficacy, etc) were not captured."}, {"section_title": "Subgroup Analyses", "text": "The planned subgroup analyses were intent-to-treat analyses. Based on a hypothesis that the individuals with the mildest dementia severity at baseline would benefit the most from DHA supplementation, a prespecified analysis of 2 subgroups divided by baseline dementia severity, using the median MMSE score of 21 as the cut point, found no effect of DHA treatment on rate of progression in either the high score (Ͼ21) or low score (Յ21) MMSE group. Analysis of subgroups of participants divided by global CDR also failed to show evidence of DHA treatment effects in the most mildly impaired participants (eTable 2 at http://www.jama.com).\nThe statistical analysis plan also called for subgroup analyses of populations with and without the APOE ε4 allele. While there was no DHA treatment effect on any outcome measure in the APOE ε4-positive group (eTable 2 at http://www.jama.com), those receiving DHA in the APOE ε4-negative group had a significantly lower decline in mean change in ADAS-cog score over 18 months (6.23 points [95% CI, 4.08 to 8.38 points] for 61 participants in the DHA group vs 10.11 points [95% CI, 7.12 to 13.10 points] for 48 participants in the placebo group; linear mixed-effects model: P = .03) (FIGURE 3) . This differential DHA effect Error bars indicate 95% confidence intervals. The linear mixed-effects analysis finds no effect of docosahexaenoic acid (DHA) on the rate of ADAS-cog change in APOE ε4-positive participants but when the analysis is confined to APOE ε4-negative participants, the rate of change in ADAS-cog is slower in participants treated with DHA than in participants treated with placebo (linear mixed-effects model: P=.03 "}, {"section_title": "COMMENT", "text": "This study was designed to determine if supplementation with DHA would slow the rate of cognitive and functional decline in patients with mild to moderate Alzheimer disease. Despite enrollment of the target population of individuals with low baseline DHA, increase of plasma phospholipid and cerebrospinal fluid DHA in the group treated with DHA, and ample progression of randomized participants on the primary outcome measures, there was no evidence of benefit of DHA supplementation in this population. In the subgroup of participants with paired MRI scans, DHA had no effect on change in volume of hippocampus, whole brain, or ventricles. The hypothesis that DHA slows the progression of mild to moderate Alzheimer disease was not supported, so there is no basis for recommending DHA supplementation for patients with Alzheimer disease. A large proportion of randomized participants (28% of the DHA group and 24% of the placebo group) did not complete the study. This attrition rate is within the spectrum seen in recent 18-month trials for Alzheimer disease, higher than seen in a study of homocysteine-lowering B vitamins, 28 but lower than reported with tarenflurbil. 29 Because a minority of participants cited adverse events as the reason for dropping out, we hypothesize that the dropout rate was driven by the perception of lack of efficacy. For future studies of similar therapies intended to slow the rate of decline rather than result in perceptible symptomatic effects, it may be important to temper the expectations of participants or run the risk of a dropout rate that may limit the ability to generalize study results.\nHowever, because the dropout rate was only modestly greater than anticipated in the statistical analysis plan, and because the rate was not significantly different between the 2 groups in this study, the findings in the overall study population appear to be reliable. Some caution must be exercised, however, in interpreting the parallel results from the MRI substudy. This subpopulation represents a convenience sample, relying on participant volunteerism and site expertise rather than random selection to guide enrollment. A previous analysis has shown that this MRI subpopulation at baseline did not significantly differ from the total study population, 30 and the MRI outcomes are consistent with the clinical outcomes of the trial, but it is still important to note that the MRI study population is not a statistical sample of the overall study population.\nBecause part of the rationale for the trial was epidemiological evidence that DHA use before disease onset modifies the risk of Alzheimer disease, it remains possible that an intervention with DHA might be more effective if initiated earlier in the course of the disease in patients who do not have overt dementia. Although the analysis in this study of the subpopulation of participants with baseline MMSE scores of greater than 20 failed to provide support for this hypothesis, other studies have reported post hoc analyses showing positive omega-3 fatty acid treatment effects in less impaired individuals, with MMSE scores of 27 through 30. 31 However, clinical trials of omega-3 fatty acids in healthy elderly individuals have failed to show cognitive benefits within 6 months (Mental Health in Elderly Maintained with Omega-3 [MEMO] study, n = 302) 32 to 2 years (Older People and n-3 Long-Chain Polyunsaturated Fatty Acids [OPAL] study, n =867) 33 of treatment. Because these healthy elderly individuals do not experience significant cognitive de-cline in this time frame, however, the absence of a cognitive effect does not exclude the possibility of a neuroprotective effect of DHA in individuals at risk of decline. Individuals intermediate between healthy aging and dementia, such as those with mild cognitive impairment, might derive benefit from DHA supplementation, although further study will be necessary to test this hypothesis.\nThe propensity of DHA to be oxidized may also be considered in interpreting these results. Some have suggested that increased oxidative burden is a risk in DHA supplementation studies 34 but most studies have not supported this theoretical risk, 35, 36 and there is no evidence that DHA treatment had an adverse effect in this trial. However, in one small study of DHA with and without a co-administered antioxidant (lutein), unimpaired elderly participants randomized to combined DHA plus antioxidant derived greater benefit on selected cognitive outcome measures than participants receiving DHA alone or placebo, 37 providing support for the hypothesis that the clinical benefit of DHA supplementation may depend on the availability of circulating antioxidants to protect the DHA from oxidation after ingestion.\nIn an exploratory analysis, we found that APOE ε4-negative participants who received DHA supplementation showed a benefit on the ADAS-cog and MMSE. However, the significance testing was not adjusted for multiple comparisons. Furthermore, the apparent treatment effect in APOE ε4-negative participants was not seen on the CDR sum of boxes, ADCS-ADL, NPI, or brain atrophy, weakening the interpretation that this effect is clinically meaningful. On the other hand, several epidemiological studies indicate that a protective effect of omega-3 fatty acids with respect to dementia may be confined to APOE ε4-negative individuals, [38] [39] [40] so an APOE genotype-specific effect is plausible. Confirmation of our exploratory findings in an independent randomized controlled study would be necessary to infer a beneficial effect of DOCOSAHEXAENOIC ACID SUPPLEMENTATION FOR ALZHEIMER DISEASE ©2010 American Medical Association. All rights reserved. In summary, these results indicate that DHA supplementation is not useful for the population of individuals with mild to moderate Alzheimer disease."}]