[{"section_title": "Abstract", "text": "Local and regional food marketed through direct and intermediated channels has been increasing in the U.S., with studies of producers and consumers conducted at different places and times illuminating the trend. Oregon producers and consumers have shown long-running interest in local agriculture, with direct markets providing a wellestablished connection between fresh and local food. To examine motivations and barriers for the continued development of the Oregon regional food network (RFN), we conducted in-depth surveys of Oregon producers and consumers across economic, social, and environmental variables. We identify some salient characteristics of farm enterprises that contribute to the RFN through different types of marketing channels, and consumer perceptions and utilization of RFN marketing channels. By analyzing producer and consumer surveys side by side, we identify opportunities for greater integration of food system actors within the RFN if producers, supply-chain partners, and consumers come together to realize the potential in regional marketing channels, particularly sales to retail, institutions, and regional distributors with differentiated products based on place of origin. Using Oregon as an example, we find overall trends and nuanced distinctions by looking across the diverse agricultural and marketing landscapes, giving some insight into local and regional food Advance online publication system motivations that may also be useful to farmers, policy makers, and researchers in this and other regions."}, {"section_title": "", "text": "ultimately must involve a \"meeting of the minds\" between producers and consumers in the marketplace. Producers benefit from consumer data to direct their farm production and certification investments more effectively, while public and private RFN actors must better understand opportunities and constraints so they can make appropriate investments in education and infrastructure. Although Oregon has a unique and well-developed culture of RFN marketing, emerging RFNs in other parts of the world may learn from successful RFNs such as Oregon.\nWhile many researchers have interviewed subsets of agricultural producers, and others have sought to understand consumer interest in local or regional foods, fewer have simultaneously surveyed both producers and consumers in a region, as we did in 2016. We identified salient characteristics, motivations, and barriers for producers contributing to the Oregon RFN, while gauging consumer perceptions and utilization of RFN marketing channels. By analyzing producer and consumer surveys side by side, we explore opportunities for greater integration of food system actors within the RFN. We perceive some overall trends and nuanced distinctions by examining the diverse agricultural landscapes of Oregon, thus gaining insight into local and regional food system motivations that may be useful to farmers, policy makers, and researchers in this and other regions."}, {"section_title": "Surveys of Agricultural Producers", "text": "In the U.S., producer participation in local and regional food systems has grown in recent decades, both direct-to-consumer sales and intermediated sales to institutions, restaurants, distributors, and retailers (Low et al., 2015) . Research into producer motivation shows that small and midsized producers utilize multiple marketing channels (Liang & Dunn, 2014; Low & Vogel, 2011) . Many studies have focused on one region and one type of alternative marketing channel, such as agritourism, community supported agriculture (CSA), farmers markets, or intermediated sales. In one survey, smaller operations were more motivated by consumer and community connections and enhancing sustainability; while facing more barriers, a significant number felt that participation in alternative marketing channels improved their financial viability (Liang & Dunn, 2014; . In California, CSA producers were motivated by an obligation toward CSA members, while farm income ranked relatively low (Galt, 2013) . Research on alternative food supply chains that sell into regional or national markets is a rich and growing field, but most involve case studies of the supply-chain business partners rather than focusing on the producers (e.g., Ostrom, 2013; Stevenson, 2013; Stevenson & Lev, 2009; 2010; ."}, {"section_title": "Surveys of Local and Regional Food Buyers", "text": "A comprehensive USDA review of local food systems reports the ample work on consumer perceptions and willingness to pay for local or regional food (Martinez et al., 2010) . Some studies find that local food purchasers resemble all grocery shoppers demographically, while others show a stronger interest in local foods from shoppers who are female, have higher income and education, cook at home more, have more interest in personal health, and have preferences for the type of foods available locally (Chang, Xu, Warmann, Lone, Munzimi, & Opoku, 2013; Maples, Morgan, Interis, & Harri, 2013; Wilson, Di Salvo, Quinn, Englot, & Mitchell, 2014; Wolf, Spittler, & Ahern, 2005) .\nConsumer surveys have shown that social and environmental concerns have become increasingly important over time (Knudson, 2010) . In a national survey, the most important reason for buying local food was \"proven health benefits,\" while public attributes dominated the next three reasons: \"supporting local economy,\" \"farmers receiving fair share of economic returns,\" and \"maintaining local farmland\" (Onozaka, Nurse, & McFadden, 2010) . Other studies have found salient motivations such as animal welfare, environmentally sensitive production practices, and improved public health (Knudsen, 2010; Thilmany, Bond, C. A., & Bond, J. K., 2008) .\nStudies in various states of the willingness to pay for different types of locally labelled products shows 9 percent to 50 percent price premiums depending on perishability, base price, and attitudes toward local foods (Burnett, Kuethe, & Price, 2011; Martinez et al., 2010, Figure 9) . One study of willingness to pay concluded that consumer demand for local food is independent of typical attributes of local foods, such as freshness (Darby, Batte, Ernst, & Roe, 2008) .\nInstitutions, restaurants, and retailers are also responding to consumer demand for local foods (Martinez et al., 2010) . Nelligan, Cameron, Mackinnon, & Vance (2016) found institutional buyers in Canada motivated by getting fresher food from local producers and supporting the local economy, although they reported little demand from customers and did not perceive a price premium. However, different clientele can provide other motivations: collegiate food service managers were willing to pay a price premium for sustainable production practices, reflecting that college students wanted their campus food to be produced sustainably and humanely, with workers receiving a fair wage (Feenstra, Allen, Hardesty, Ohmart, & Perez, 2011) ."}, {"section_title": "Surveys of Both Producers and Buyers", "text": "Looking at consumer and producer preferences separately-by time, place, and demographic groups-limits our ability to understand the relationships and networks formed in an RFN. Studies of both producers and consumers are limited to certain marketing channels; for example, one study found that both CSA farmers and members were motivated by moral obligation and concern for the environment, more than by the price of the farm share (Cone & Myrhe, 2000) . A study of intermediated sales found that distributors and grocery stores had uneven support for environmental and social values, while growers shared core values of economic, environmental, and social sustainability (Lerman, 2013) . Peterson, Selfa, and Janke (2010) found that the only value statement shared by producers and institutional buyers was a \"sense of belonging\" to the Kansas local community. These studies conclude that a mismatch in values inhibits producer gains from intermediated RFN sales, because information about farm practices may not be adequately transmitted to consumers and consumers may not perceive benefits from their purchases to local and regional producers.\nThe broadest research on both consumers and producers was conducted by Ostrom and Jussaume (2007) in Washington state in 2002 on direct marketing. Farms of all sizes used direct marketing to diversify their marketing mix to reduce risk associated with wholesale markets. However, direct markets were used primarily for fresh produce and had not developed for livestock and grains, particularly in the arid eastern part of the state. Practical considerations such as proximity to urban markets made direct marketing an opportunistic rather than intentional approach for many producers. Consumers also expressed practical goals, motivated by quality, taste, nutrition, and convenience rather than by environmental or community goals; as a result, they were mostly interested in obtaining local fresh produce. From these practical considerations, public benefits may develop in the future, such as articulating the ability of direct marketing to keep local farmers on the land. This research provides a historical baseline for understanding producer and consumer interests in direct marketing in Washington and the Pacific Northwest. It can help us to understand some of the institutional and market shifts in recent years, such as government support for direct marketing strategies and the increase in farmers markets and other alternative food marketing (Ostrom & Jussaume, 2012) ."}, {"section_title": "Applied Research Methods", "text": "Two separate surveys were distributed in 2016 using mixed-mode convenience sampling, one to Oregon producers and one to consumers (Bernard, 2011) . The producer survey was intended to gather responses from producers active in the Oregon RFN. As there is no definitive list of RFN producers, we distributed the survey via avenues where RFN producers congregate: the Oregon State University Small Farms Conference in Corvallis, Oregon, and farmers market vendors in different parts of the state (postage-paid return envelopes and the online version were provided simultaneously). A broader distribution occurred online via email and social media through several different farm organizations, including the Oregon Department of Agriculture. Because the consumer survey was intended to reach consumers from all parts of the state, it was distributed via email listservs and newsletters of several county economic development offices throughout the state (to reach a large geographic area) and on social media through food and farm organizations, and paper copies were distributed in-person and through county economic development offices in eastern Oregon to ensure coverage of rural areas.\nA total of 193 producer survey responses and 614 consumer survey responses were recorded; however, when respondents were not from Oregon or did not answer every question their data was dropped from analysis where appropriate. Data from both surveys were analyzed using correlation analysis and Pearson's chi-squared test for independence. Because many of our survey questions allowed multiple responses (\"check all that apply\"), we applied the Pearson's chi-squared test pairwise for all possible responses to multiple-by-multiple response questions and for each multiple-response option in single-by-multiple response analysis, to avoid problems of within-subject dependence among responses (Agresti & Liu, 1999; Bilder & Loughin, 2004) ."}, {"section_title": "Results", "text": ""}, {"section_title": "Producer Survey", "text": "Because this was a convenience sample, intended to obtain information from Oregon RFN producers, the respondents differ from the general Oregon farm population in some ways, which provides a window into the RFN sector. It is important to keep in mind that the data reflects only producers that were motivated to participate in an RFN study. Demographically, respondent age distribution was more even than the population of Oregon operators: 19 percent under the age of 35 (compared to 4 percent of all operators), 34 percent between 35 and 54, 30 percent from 55 to 64, and 16 percent 65 or older (the average age of all Oregon operators is 60) (USDA NASS, 2014a). Most respondents held college degrees (61%) or had at least some college education (12%). Gender was roughly equal (46% female), which is more like direct farm marketers than the general farm operator population (20 percent of principal operators are female), and 97% identified as White, close to the state farm operator population (Oregon Department of Agriculture, 2016; USDA NASS, 2014a) . Most respondents were new and beginning farmers, with 60 percent operating for less than 10 years, which differs significantly from the general farm population, with only 24 percent on their farm for less than 10 years (USDA NASS, 2014a , 2014b . Therefore, our sample was younger, had less farming experience, were more likely to be female, and had a high level of educational attainment.\nMost farms (51%) were in the central Willamette Valley and north-central coast, 23 percent in the Portland area, 7 percent in the southwest, 10 percent in the central region, and 6 percent in the eastern region (Figure 1 ). For our analysis we aggregate the Willamette Valley and Portland areas, which have a similar growing season and where the concentrated urban areas are located. We also aggregate the more rural regions in southwestern, central, and eastern Oregon, which are more sparsely populated with smaller population centers and are dominated by forest or the more arid climate east of the Cascades mountain range. The differences in growing region and population in the Willamette Valley (WV) versus the rest of the state (NWV) may provide a significantly different environment for the operation of the Oregon RFN."}, {"section_title": "Farm Characteristics", "text": "Measuring farm size by gross farm income, respondents had a more even distribution over income categories than the overall farm population (Table  1) . Our respondents skew to higher income categories, possibly due to the number of active small commercial farms responding to our survey, whereas the Census of Agriculture gathers data from all farms, including \"point farms\" that are not farming but that are capable of generating at least US$1,000 in farm income per year (Hoppe, 2014) .\nMany of our respondents reported negative farm net income, while some netted over US$100,000 in 2015. On average, 39.6 percent of respondent household income came from the farm or ranch, with a median of 25 percent, ranging from none to 100 percent. The number of acres (owned and leased) in respondent operations ranged from 0.02 acres to 60,000 acres. Approximately 61 percent of our respondents operated under 50 acres; about half of those were under 10 acres (Table 2) . Our survey population is fairly similar to the population of Oregon farms and ranches in terms of acres, although we captured a slightly higher proportion of the larger acreage farms. Combining the farm size data, our respondent farm acreage is very similar to the total farm acreage of Oregon, while respondent gross farm income skews higher. Considering differences between the Willamette Valley and other parts of the state, the non-Willamette Valley producers reported higher acreage and average farm income than the Willamette Valley producers. "}, {"section_title": "Farm and Ranch Production Practices", "text": "Survey respondents indicated products raised on their farm from among 18 categories. There was diversity in production among and within farms, with an average of 3.2 products per farm. Only 26 percent of farms chose just one category, and 16 percent produce six or more categories with a maximum of nine product categories. Of those that raised animals, 70 percent produced both plant and animal products. Of those that produced animal products, 45.5 percent produced two or more different animal products, and 15 percent produced four or more animal products. Regarding production practices, 28.2 percent used conventional methods, 13.4 percent reported certified organic production and 59 percent used organic practices but were not certified. Beyond the conventional/organic categories, 52.3 percent used other alternative methods: conservation tillage or no-till, cover crops, integrated pest management (IPM), and nutrient management plans. Of those that raise animals, 93.2 percent reported free-range methods, 61.4 percent used antibiotic-and hormone-free production, and 71.6 percent used grass-or organic-fed.\nWhen asked about the reasons for choosing their production practices, 80 percent selected \"alignment with my environmental values.\"\n1 Throughout, we report statistical significance at p<0.1*, p<0.05**, p<0.01***, p<0.001****.\nEighteen percent took the opportunity to write in other motivations, many of which offered specific ethical, religious, and political values, or specific environmental concerns. In addition to values, 32 percent chose \"more profitable,\" 29 percent chose \"local or regional support and infrastructure,\" and 25 percent chose \"access to established markets.\"\nWhile certified organic production and other conservation practices were not correlated with any motivation, those using organic practices without certification were positively correlated with the \"alignment with my environmental values\" motivation (r=0.37****). 1 Those identifying their practices as \"conventional\" were negatively correlated (r=0.5****) with the \"alignment with my environmental values\" motivation and were positively correlated (r=0.25***) with the \"more profitable\" motivation.\nWe grouped the various production practices into two general categories, conventional and alternative (those that chose any additional environmental or animal husbandry practice). While there were no significant differences in conventional and alternative practices by region of Oregon or age, we found that those who have been farming less than 10 years were significantly more likely to choose alternative production practices (chi 2 = 17.9****). Furthermore, farmers of all production practices most often rely on other farmers for advice, training, education, and technical support (>96% in all categories), indicating that farmer information-sharing networks could be contributing to the spread of practices among different types of farmers."}, {"section_title": "Marketing Practices", "text": "Farmers indicated their marketing practices by reporting the percent of 2015 gross farm income derived from the following channels: agritourism (e.g., U-pick, farm stay), direct sales to consumers (e.g., farmers markets, CSAs), sales to local retailers or restaurants, sales to local or regional institutions (e.g., hospitals, schools), sales to local or regional distributors who brand the products as locally and regionally produced, and sales to national and international distributors (commodity markets). Marketing channels both among and within farms were highly diverse. While the average farm used two marketing channels, 35 percent used only one marketing channel and two farms used five marketing channels. As Table 3 illustrates, those that used either direct-to-consumer or national/ international distributors derived most of their gross farm income from those channels, showing some specialization with those categories. Of the direct-to-consumer farms, 30 percent used only direct marketing, and of those that used national and international distributors, 36 percent used only that marketing channel. The other categories of local and regional sales to retail, restaurants, and institutions account for less than 30 percent of gross farm income, with few relying on those channels for their full farm income. Local and regional distributors seem to be a more robust channel, although fewer farms used them. Agritourism seems to be a supplemental income source, with only 19 percent of average gross farm income coming from agritourism and no one reporting 100 percent reliance on that channel.\nIt is also evident that different products fit different marketing channels (Appendix A, Table  A1 ). Grain production was significantly correlated with national and international distribution (r=0.54****), but negatively correlated with directto-consumer (r=-0.40****). Vegetable production shows the reverse, with a significant positive correlation with direct-to-consumer (r=0.17*) and local retail and restaurant distribution (r=0.40****), and a negative correlation with national and international distribution (r=-0.17*).\nProduction practices also have strong relationships to marketing channels (Appendix A, Table A1 ). Direct-to-consumer sales are negatively correlated with conventional practices (r=-0.37****), but positively correlated with noncertified organic practices (r=0.26***), grazing/free range (r=0.27**), and antibiotic and hormone-free practices (r=0.25*). Certified organic production is positively correlated with sales to local retail or restaurants (r=0.27**) and local/ regional distributors (r=0.20**), probably because they require the certification label for marketing and a price premium. Conversely, sales to national and/or international distributors are positively correlated with conventional practices (r=0.47****), but negatively correlated with organic practices (r=-0.26***), grazing/free range (r=-0.21*), and antibiotic/hormone-free practices (r=0.29**).\nConsidering farm size, the farms with very small acreage and low income engage in direct channels, with significant positive correlations for less than ten acres for direct-to-consumer (r=0.22**), while 80 percent of the farms that use direct sales are in the bottom two income categories (up to US$250,000, half of which gross less than US$25,000), and have a significant negative correlation with national and/or international distribution channels. The highest income category, over US$500,000 gross farm income, was significantly correlated with both local and regional distributors (r=0.34***) and national distributors (r=0.47****). The highest income category was negatively correlated with direct-to-consumer marketing (r=-0.36****), consistent with findings that smaller farms are taking advantage of direct markets (Martinez et al., 2010) . Local and regional retail and restaurant sales are associated with small to midsize farms, positively correlated with farms grossing US$25,000 to US$249,000 per year (r=0.19*) and 50 to 219 acres (r=0.20**). We found no significant differences between the Willamette Valley and other parts of the state in marketing channel use. Just as farmers who have been operating for less than 10 years are using more alternative farming practices, they also have higher rates of local and regional marketing channel use, with a significant positive correlation with direct marketing (r=0.28***), and a negative correlation with national and international distributors (r=-0.30***). Established farmers operating more than 10 years have a positive correlation with use of distributors, which is statistically significant for national and international markets (r=0.30***). However, farmer age does not show significant differences in use of marketing channels. The fact that older farmers are using direct marketing could reflect the rise in \"retirement\" farms on small acreage with low farm sales, which can also be beginning farms (Brekken, Gwin, Horst, McAdams, Martin, & Stephenson, 2016) ."}, {"section_title": "Marketing Motivations and Barriers", "text": "The producer survey asked respondents to indicate their motivations and barriers for each local and regional marketing channel (agritourism, direct to consumer, local retailers and restaurants, local/ regional institutions, and local/regional distributors). We analyzed the results with respect to reported gross farm income as a measure of farm size.\nWe specified nine motivations for local and regional marketing: \"increase farm revenue,\" \"promote farm's connections with customers/ community,\" \"promote locally made products,\" \"diversify farm operation/revenue sources,\" \"provide employment opportunities,\" \"enhance local economy,\" \"support local/regional health and food security,\" \"provide educational channel for others,\" \"lifestyle choice for me and my family.\" All motivations had some statistically significant correlation between marketing channel and gross farm income. We also asked about 12 barriers to using each RFN marketing channel; eight had some significant correlation to an income category and marketing channel: \"family or operation does not fit market,\" \"not profitable,\" \"handling or food safety costs,\" \"labor costs,\" \"lack of demand,\" \"lack of market supply-chain partners,\" \"lack of training,\" and \"lack of networks and support systems.\" Four other categories were not significantly correlated with any marketing channel or income category: \"time constraints,\" \"lack of capital,\" \"transportation costs,\" \"poor coordination,\" and \"inconsistent payment.\" Appendix A, Table A2 condenses results for each motivation and barrier, omitting barriers with no significant correlations.\nOverall, \"increase farm revenue\" was the highest motivator, followed closely by motivations that were public in nature, \"connecting to community\" and \"promoting locally made products,\" with similar motivations in all parts of the state (see Appendix A, Table A2 ). The NWV producers were more motivated by \"support local health/food security,\" which is consistent with the fact that food security is a prominent issue in rural Oregon, with loss of rural grocery stores and lack of access to fresh foods (Oregon Food Bank, 2016) .\nAlthough no one barrier was selected by more than 50 percent of the respondents, \"family or operation doesn't fit market\" was ranked first and \"time constraints\" second; both rankings are understandable, as no one marketing channel will fit all types of farms (see Appendix A, Table A2 ). The \"not profitable\" barrier was rated significantly higher in the Willamette Valley than elsewhere, the only barrier that was significantly different by location. Willamette Valley RFN producers may struggle with profitability due to the barriers that they indicated in food safety and labor costs, which were ranked higher there than in other parts of the state. For rank order by location, RFN producers outside of the Willamette Valley were more focused on finding consumers, ranking \"lack of demand\" fourth, while in the Willamette Valley it was ranked seventh. Outside of the Willamette Valley, \"not profitable\" was ranked fifth, tied with transportation costs and labor costs. Although the differences were not statistically significant, their differences in relative importance could provide insight into the barriers that producers face in different parts of the state.\nWe also analyzed each motivation with respect to marketing channel and farm size as measured by gross farm income, to gain more detailed insights into the motivations and barriers of farms based on scale. For the smallest farms (<US$25,000), \"lifestyle choice\" for direct-to-consumer marketing was the only motivation with a significant positive correlation (r=0.20*). They identified \"family or operation doesn't fit market\" as a barrier for local/ regional institutions and distributors (r=0.24*, r=0.21*), and \"lack of training\" as a barrier to agritourism (r=0.30**).\nFor small to midsize farms (US$25,000-US$250,000), agritourism was motivated by increasing farm revenue (r=0.26*), promoting connection to community (r=0.25*), and diversifying the farm operation (r=0.27*). Direct-toconsumer marketing was motivated by supporting local/regional health and food security (r=0.30***) and providing educational opportunities (r=0.21*). This group also engages in sales to local retail and restaurants to diversify farm marketing (r=0.22*). The only positive significant barrier for sales to local and/or regional distributors was handling or food safety costs (r=0.24*).\nFor midsize farms (US$250,000-US$500,000), agritourism and direct sales were motivated by providing employment (agritourism r=0.27*, direct r=0.19*) and supporting local health and food security (agritourism r=0.31**, direct r=0.21*), while direct sales were also motived by enhancing the local economy (r=0.24**). Promoting connection to community (r=0.23*) and supporting health and food security (r=0.22*) were motivations for selling to local retail and/or restaurants. Highervolume sales to local and/or regional retail and restaurants (r=0.24*), institutions (r=0.28**), and distributors (r=0.23*) were inhibited by the \"not profitable\" barrier, and lack of market supply-chain partners was a barrier to direct sales (r=0.30**) and sales to local retail and restaurants (r=0.37***). These channels do not require supply-chain partners per se, but may be an indicator that a farmers market, food hub, or other intermediary is not available, or that retailers and restaurants are not receptive to local products.\nThe largest farms (>US$500,000) had the most statistically significant motivators for local and regional sales. Providing employment motivated agritourism (r=0.30**) and direct sales (r=0.22**), while agritourism was also motivated by providing educational opportunities (r=0.24*). Sales to local and regional institutions and distributors were motivated by diversifying farm revenue (institutions r=0.31**, distributors r=0.39***), providing employment (institutions r=0.41***, distributors r=0.31**), and as a lifestyle choice (institutions r=0.38***, distributors r=0.43***); additionally, sales to institutions were motivated by increased farm revenue (r=0.28**), promoting locally made products (r=0.33**), and enhancing the local economy (r=0.33**). As we would expect, for both the direct marketing and local retail or restaurant channels their barriers were related to the smallervolume marketing channels, \"the family or operation doesn't fit the market\" (direct r=0.42****, retail/restaurant r=0.36***) and \"lack of demand\" (direct r=0.22*, retail/restaurant r=0.24*), while handling or food safety costs were a barrier to direct sales (r=0.25**) and high labor costs were a significant barrier to local retail or restaurants (r=0.21*)."}, {"section_title": "Consumer Survey", "text": "A total of 617 responses were recorded from consumers living in 20 Oregon counties (out of 36) as well as some outside of Oregon. The convenience sampling method limits the general applicability of our results; although we attempted to sample a broad geographic range in Oregon and did not target consumers with a specific interest in RFN foods, the consumers who chose to complete the survey may be motivated by an intrinsic interest in local foods. Even so, it is valuable to understand the motivations of those consumers who are seeking out local foods to connect them more effectively to producers in the Oregon RFN.\nThe sample was 70 percent female, and most respondents had completed some college or held a college degree (63%), followed by those who held a post-college/graduate degree (30%). Annual income was rather evenly distributed, with 25 percent earning less than $25,000 per year, 23 percent earning between $25,000 and $50,000, 32 percent between $50,000 and $100,000, and 20 percent earning more than $100,000 per year. The age of respondents ranged from 18 to 81."}, {"section_title": "Attitudes Toward Local and Regional Food", "text": "For the definition of \"local\" food, 32 percent considered food from within the state to be \"local,\" 20 percent said within 100 miles (161 km) of the consumer, 27 percent said within 50 miles (80 km), and 14 percent said within 25 miles (40 km). There was no statistically significant difference between consumers in the Willamette Valley region and other parts of the state in their definition of local.\nMost respondents typically buy groceries from a supermarket chain (83.9%) or a locally owned grocery store (60.2%), shopping weekly to once per month. The third most frequent venue was a farmers market (35.1%) and fourth was food co-ops (33.4%), each varying by location and season. When shopping for groceries, 52.2 percent of respondents always or usually check where the product was made or grown. When buying fresh foods, \"locally produced\" was considered \"important\" or \"somewhat important\" (81.3%), essentially equal to price (81.8%) and convenience (79.5%), two main food choice drivers, while regional brands were considered important for 42 percent of respondents, and national brand important for only 12.3 percent (Table 4) .\nMost respondents (74%) were willing to pay a premium of either 10 or 25 percent above typical price to obtain local foods. People with higher education levels (chi 2 p=0.00****), who had visited a farm in the previous year (chi 2 p=0.00****), females (chi 2 p=0.01**), those who had higher annual income (chi 2 p=0.03**), those who cook more at home (chi 2 p=0.04**), and those who spend more on groceries (chi 2 p=0.05**) were willing to pay more for local or regional food. Those aged 30-49 were more likely to be willing to pay 25 percent above typical price (41.4%), while every other age group preferred a 10 percent price premium (~40% for each age group) (chi 2 p=0.10*) (Appendix B, Table B2 ).\nWhen asked their motivations for purchasing local food, 81 percent indicated \"support local farmers\" (Table 5 ). The next top response was \"tastes better,\" at 48 percent. Public motivations were next, with \"environmental concerns\" at 45 percent, \"promote local food\" at 42 percent, and \"preserve agricultural landscapes\" at 39 percent. Twenty-six percent felt that local or regional food is \"safer to buy.\" Given the opportunity to write in other motivations, nine percent noted reasons such as fresher, riper, longer lasting, and (sometimes) cheaper; personal knowledge of production practices (non-GMO and others); transportation costs; supporting the local economy; and access issues, such as lack of nearby grocery stores. Examining more closely perceptions of food purchased at farmers markets as a specific example of local food, most said that farmers market food is higher in quality (76%) and environmentally sustainable (65%), but noted that the price was also higher (56%). Thirty-four percent said that food from a farmers market was safer, while 35 percent said it was equal in safety to food bought at a supermarket."}, {"section_title": "Environmental Concerns", "text": "Concern about environmental impacts was the third-ranked reason for buying local foods, expressed by 45 percent of respondents. However, consumers showed significant variation in this motivation. Women, those with college education, those over the age of 30, middle-income categories (US$25,000-US$50,000 per year), and those who cook more at home were also more likely to be motived by environmental concerns (Appendix B, Table B1 ). The environmental motivation was more strongly felt in the Willamette Valley, where 51 percent indicated environmental motivations versus 28 percent of NWV respondents (Table 5) . Of those that were willing to pay at least 50 percent over typical prices for local foods, 78 percent were motivated by environmental concerns, ranked third behind \"support local farmers\" and \"promote local food.\" A majority of the respondents (55%) willing to pay a 25 percent price premium was also motivated by environmental concerns, indicating that a belief that local foods have environmentally sensitive production may contribute to greater willingness to pay for local foods."}, {"section_title": "Regional Differences", "text": "Some interesting differences emerged between consumers in the Willamette Valley and those in more rural areas of Oregon. Demographically, our survey respondents from the Willamette Valley were younger and more evenly distributed over income categories. Outside the Willamette Valley, the respondents were older (chi 2 p=0.00****) and fell into middle-income categories between US$25,000 to US$100,000 per year (chi 2 p=0.02**). (See Appendix B, Table B3.) While there was no statistical difference between the regions in their definition of local (the highest choice in each region was \"within my state\"), those in the Willamette Valley were willing to pay more for local and regional food (Appendix B, Table B3 ). While a 10-25 percent price premium was the most popular answer for both regions, 33.7 percent of the non-Willamette Valley group was willing to pay equal to or less than the typical price, compared to 18.3 percent in the Willamette Valley.\nThe places where the respondents frequently shop (\"at least once a week\" and \"every few weeks to a month\") for groceries varied by region. Willamette Valley shoppers were statistically more likely to shop at supermarket chain stores (chi 2 p=0.03**) and food coops (chi 2 p=0.00****) while non-Willamette Valley residents shopped at locally owned grocery stores (chi 2 p=0.01***). Other food outlets such as convenience stores, farmers markets, farm stands, and CSAs did not differ significantly between the regions. When shopping for nonprocessed food, regardless of venue, more Willamette Valley respondents rated as important locally produced food (chi 2 p=0.03**), regional brands (chi 2 p=0.00***), and organic (chi 2 p=0.00****) ( Table 4) .\nThe motivations for buying local and/or regional food also varied significantly by region, except for \"safer to buy\" (Table 5 ). Of note, \"promote local food\" was the one motivation that was significantly higher outside of the Willamette Valley. As expected from the \"organic\" importance in shopping for nonprocessed foods, environmental concerns were the most significant difference between the two regions, with the Willamette Valley residents having much higher environmental motivations."}, {"section_title": "Discussion", "text": "Producers and consumers must meet in the marketplace to create opportunities to enhance and expand Oregon's RFN. USDA's \"Know Your Farmer, Know Your Food\" initiative (Low et al., 2015) can be interpreted as a personal endeavor by consumers to seek out their local producers. Likewise, producers can \"know their customer\" through direct marketing channels, but to understand how to connect to more consumers and access other types of markets, producers need to understand the community of shoppers and potential supply-chain partners. To further develop the RFN, supply-chain partners and policymakers need to understand the characteristics and the motivations and barriers of various RFN markets to facilitate producer and consumer participation in the regional food system.\nThe \"who, what, how, and why\" of local food marketing can be discovered by analyzing producer and consumer surveys side by side. Digging more deeply into the \"why,\" we find economic, social, and environmental motivations that could contribute to greater integration of food system actors within the RFN. If producer and consumer motivations are aligned, this could suggest more places to meet in the marketplace and in other public realms that influence the food system. Understanding motivations and opportunities could, in turn, indicate long-term economic, social, and environmental outcomes for the communities in which local and regional food networks are embedded."}, {"section_title": "Who Is Using Local and Regional Marketing Channels?", "text": "Although both our producer and consumer surveys were gathered with convenience sampling, we saw significant variation in the data for subsets of respondents, with our results resembling other producer and consumer surveys conducted in other parts of the country. Producers diversify their product types and marketing channels, and a majority were motivated to participate in the RFN to \"diversify farm operation\" (64%). Small operations tend to use direct marketing channels, while large operations use distributors, and there is specialization in those channels, with over 30 percent of those producers who use each of the channels using it exclusively.\nWe found some strong differences between beginning farmers and established farmers. Beginning farmers were significantly more likely to use direct marketing, while established producers used national and international distributors. Beginning farmers were also more likely to use environmentally sensitive production practices, which is also correlated with direct marketing channels. Of note, this distinction is with length of time farming, but is not correlated with age; people come into farming at all ages and make their own choices when beginning an operation. Our survey captured a far greater proportion of new and beginning farmers than is present in the Oregon farm population, giving an interesting window into that demographic. As Oregon farm operations transition to new owners, beginning farmers could benefit from networks and supports that target their production and marketing interests.\nThe consumer demographics also resemble those of some other studies, showing that people with higher income and education, who spend more on groceries, are over 30, females, those who cook more at home, and those in the Willamette Valley are willing to pay more for local and regional food, most strongly 10-25 percent above typical prices. "}, {"section_title": "Which Products and How Are They Moving in Local and Regional Markets?", "text": "As in the Ostrom and Jussaume (2007) study of Washington state producers in 2002, grain producers tend to sell into national or international distribution channels, and fresh produce is popular in direct markets. In addition, we found significant sales of fresh produce to local retail and restaurant outlets, and positive but insignificant correlations with sales to local and regional institutions. No strong results were found for animal products; there could be barriers in the processing and distribution for animal products that we did not probe. Production practices are another characteristic of food that moves through the market. We found strong correlations between direct sales and organic practices (but not certified), grazing/free range, and antibiotic-and hormone-free. Certified organic produce is correlated with RFN retail and wholesale channels, while sales to national and/or international distributors are correlated with conventional practices. The motivation for choosing specific practices is certainly related to the experience of the farmer, scale of operations, types of products, and requirements of supply-chain partners. But with the strong connection between noncertified organic practices and direct marketing, the strongest motivation seems to be personal environmental values. It is likely that the production practices are chosen, and then the direct marketing channel provides the opportunity to use organic practices while receiving a price premium for noncertified organically-grown products.\nThe connection between fresh and local is well established in Oregon: 81 percent of consumers rated \"locally produced\" as important when buying fresh food, rated essentially equal to price and convenience, two main food choice drivers. When shopping for groceries in general, most respondents always or usually check where the product was made or grown, and 42% look for regional brands, although that preference was stronger in the Willamette Valley. Thus, there could be unmet demand for local or regional food in grocery stores, presenting an opportunity for producers and their supply-chain partners.\nOver half of our respondents already sell to local retail or restaurant outlets, although on average they get only 24 percent of their gross farm income from those channels, indicating that barriers may keep them from fully utilizing this market. Midsized farms (farm income of US$250,000-US$500,000 in our sample) would likely have enough volume to move through the midsized RFN marketing channels: retail, restaurants, institutions, and distributors that retain place of origin labeling. However, those farms indicated that those marketing channels are \"not profitable,\" and for local retail and restaurant sales in particular they found barriers in handling or food safety costs, lacking market supply-chain partners, and lacking networks and support. The fact that these barriers to local retail and restaurant sales were significant for midsize farms could indicate the desire to use those channels, but difficulty in matching motivations and price premiums with the wholesale supply-chain partners, as previous research has indicated. This is an area of opportunity that could be explored to satisfy consumer desire for local and regional food and to bolster Oregon's midsized farms. Addressing the barriers by finding willing supply-chain partners, networks, and support-or establishing them where they do not exist-could assist with food safety requirements, enhance marketing to capture the price premium, equitably distribute the price premium among producers and supply-chain partners, and ultimately make those market channels profitable if consumer willingness to pay is realized. Consumer respondents overall did not indicate strong environmental motivations for purchasing local or regional food, but some types of consumers were much more motivated than others, such as middle-income and middle-age categories, women, those with higher education, and those who cook more at home. Consumers in the Willamette Valley were most motivated by environmental concerns and also placed a significantly higher value on organic certification when shopping for nonprocessed food than consumers in other parts of the state. Producers who can communicate the environmental attributes of their practices may benefit from catching the eye of this type of consumer, even though it may not be motivating for everyone. Some producers also indicated strong internal motivation for using environmental practices, so it may be a matter of communicating those values and actions, rather than investing in organic certification.\nCommunicating environmental and other values is easier in a direct marketing setting, and we see a strong relationship between environmental practices and direct marketing. The challenge is to take it to other types of marketing settings; we found that 79 percent of consumers are doing most of their shopping at supermarket chains, particularly in the Willamette Valley, and 59 percent are shopping at locally owned grocery stores, especially in rural parts of the state. Selling to locally owned retailers could be a new frontier for some producers, if they can overcome some of the barriers to retail sales. Outside the Willamette Valley, producers are particularly motivated by enhancing health and food security in their communities where food security is a problem that has unique and urgent characteristics in rural areas. If retailers understand that the consumers in their area are motivated to buy local foods and will pay a premium for them, they too may be motivated to make them available. The food system will take the shape of the motivations expressed by producers and consumers if supply-chain partners are willing to work with the producers and communicate with consumers."}, {"section_title": "Why Engage in Local and Regional Food Markets? Motivations and Barriers", "text": "Looking at producer motivations for local and regional marketing, we see a mix of personal and/or business motivations and public motivations. Overall, \"increase farm revenue\" was the highest motivator; then the next two personal or business motivators were \"lifestyle choice\" (rank 4) and \"diversify farm operation\" (rank 5), chosen equally by producers within and beyond the Willamette Valley. Public motivators came in second and third, with \"promoting connection to community\" and \"promoting locally made,\" at nearly 80 percent agreement in all areas of Oregon.\nConsumer motivations for buying local were highly public and altruistic, with \"support local farmers\" on top, followed by a personal motivator, \"tastes better.\" The strong motivations were corroborated by the importance of \"locally produced\" when buying fresh food, on par with price and convenience. Consumers were generally willing to pay 10-25 percent more for local and regional food. There is evidence to support that there is good alignment in understanding the purported benefits of local food and motivations on each side of the market transaction, with support for farmers given the highest priority.\nEnvironmentally related motivations and production practices are a more nuanced case, with most producers (80%) indicating \"aligns with my environmental values\" as the top motivator for production practices, highly correlated with their choice of environmentally sensitive methods, local and regional marketing, and with farmers having less than 10 years of experience. This suggests that farmers choose their environmental practices and then find marketing channels that will fit their operation personally and economically. The \"access to established markets\" motivation was significantly positive for conventional production and weakly positive for certified organic, but negative for noncertified organic practices, indicating that there may be difficulty in finding supply-chain partners for noncertified organic producers, which may lead them to turn to direct marketing to communicate their values. Farmers may also choose their marketing for personal reasons, as we found that \"lifestyle choice\" was the fourth-ranked motivator for choice of marketing channels, equally chosen in different regions of Oregon and across different farm sizes.\nProducers did not signal that barriers to local and regional marketing are uniform or insurmountable, as no one barrier was chosen by more than 50 percent of all respondents. But some subcategories of barriers are felt more strongly based on the location or the size of the operation. \"Doesn't fit my operation\" is the highest barrier, as there is no \"one size fits all\" ideal marketing channel. The goal in an RFN is to have a range of marketing channels to fit the range of producers and consumers, depending on location, income, and other salient factors.\nFor producers, the \"not profitable\" barrier was rated significantly higher in the Willamette Valley than elsewhere, the only barrier that was significantly different by location. This is somewhat surprising, given that Willamette Valley consumers are in closer proximity to local and regional food and are also willing to pay more for it by a significant margin. The price of land or other inputs could be higher in the Willamette Valley due to local conditions, types of cropping practices, and labor costs. As discussed previously, missing connections and other barriers in the supply chain could be the bottleneck for some RFN marketing channels, particularly for midsized farms. More research on specific barriers in different regions would be helpful in analyzing the reasons that RFN marketing channels are perceived as unprofitable in the Willamette Valley.\nRFN producers outside the Willamette Valley were more focused on finding consumers, ranking \"lack of demand\" fourth, while in the Willamette Valley it was ranked seventh. However, 71 percent of consumers in NWV areas rated \"locally produced\" as \"most important or important\" when buying fresh foods, while \"support local farmers\" (71.9%) and \"promote local food\" (53.1%) were their top two reasons for buying local, and 63.1 percent were willing to pay 10-25 percent higher prices for local food, which over half defined as \"within 100 miles\" or \"within my state.\" Because this is a convenience, nonrepresentative sample, we cannot estimate the total demand for Oregonproduced food. But the robust motivations expressed by our respondents is evidence that there is a segment of the population motivated to participate in the Oregon RFN in urban and rural parts of Oregon, if barriers can be overcome to make it available."}, {"section_title": "Conclusions", "text": "Oregon producers and consumers have a strong interest in local agriculture as reflected in the culture of local foods in Oregon, and which is also reflected in our survey results. We see opportunities to move more food in the RFN through wholesale channels, such as retail, institutions, and distributors that differentiate products based on place of origin. The consumer interest in Oregonproduced food indicates possibilities for producers to engage with more value-added processing to expand product lines, generating more economic in-state benefits from the RFN (Sorte & Rahe, 2015) .\nFor those working with beginning farmers or small to midsize producers looking to enhance their participation in the RFN, it is important to recognize that those producers are motivated by their personal values, mediated by the characteristics of their farm. Knowing the consumer demand for their products throughout the state and exploring all opportunities could reveal some market opportunities to connect with consumers that are hungry for their products, rather than changing practices to follow consumer demands.\nHowever, consumer demand is also mediated by supply-chain partners. Organic certification seems important for local restaurant and retail outlets and for distributors, particularly if the products are going to Willamette Valley markets. While we found that many direct-market farms are using organic practices while forgoing certification, farmers who want to scale up into RFN wholesale channels will have to become certified, but may need assistance with the costs of certification and transition, which could come from their supplychain partners or public policy.\nAlternatively, the Oregon consumers who responded to the survey are interested in local and regional food, while environmental concerns are strong for only a subset of consumers. While the organic certification is accepted by consumers, wholesale supply-chain partners could shift from certified organic products to Oregon or Pacific Northwest sourcing and invest in \"telling the story\" of the food to appeal to a broader customer base. Remaining questions are whether consumers will exercise their willingness to pay, if the price premiums will be enough to cover additional costs, and whether price premiums will be equitably distributed to the producers to realize the economic benefits of their efforts at RFN marketing.\nFurther research illuminating some unanswered questions from this general survey could be targeted at specific types of production, such as RFN marketing of animal products and/or grains. Given that eastern Oregon is suited to grain and animal production, there could be opportunities for moving more of those products through RFN channels, but there are special considerations given the complexities of those supply chains. More research into variation by location could also be fruitful, understanding the cost differences between different parts of the state and targeting assistance as necessary.\nFood systems literature today theorizes improved economic, social, and environmental outcomes created by RFNs for the communities in which they are embedded. However, economic, social, and environmental impacts are inextricably intertwined, and communities are made up of producers, consumers, and a myriad of other food system forces, which illustrate the difficulty in making empirical measurements of economic, social, and environmental statuses of functioning food systems. Ostrom and Jussaume (2012) concluded from their 2002 survey that even personal or utilitarian considerations could lead to public benefits in the future. In our surveys 14 years later in neighboring Oregon, we found that both producers and consumers are strongly motivated by public benefits, with RFN producers seeking to \"promote connection to community\" and consumers seeking to \"support local farmers,\" both social and economic goals of the Oregon RFN. We also see some producers that are highly motivated by their environmental values choosing environmentally sensitive practices and connecting to consumers through direct channels. Putting these motivations together, we can understand how Oregon producers and consumers have found common ground to create new opportunities to generate farm income and acquire food, create social connections in local direct markets, and support environmentally sensitive farming practices in the Oregon RFN. Further development through fostering the connections between producers and consumers has the potential to further develop the RFN through appropriate investments in RFN supply chains. Although Oregon may have a distinctive culture of RFN marketing, a deeper understanding of its RFN may provide inspiration to developing RFNs in both rural and urban areas in other parts of the world. "}]