[{"section_title": "Abstract", "text": "We propose an innovative machine learning paradigm enabling precision medicine for prioritizing cognitive assessments according to their relevance to Alzheimer's disease at the individual patient level. The paradigm tailors the cognitive biomarker discovery and cognitive assessment selection process to the brain morphometric characteristics of each individual patient. We implement this paradigm using a newly developed learning-to-rank method PLTR. Our empirical study on the ADNI data yields promising results to identify and prioritize individual-specific cognitive biomarkers as well as cognitive assessment tasks based on the individual's structural MRI data. The resulting top ranked cognitive biomarkers and assessment tasks have the potential to aid personalized diagnosis and disease subtyping."}, {"section_title": "INTRODUCTION", "text": "Identifying structural brain changes related to cognitive impairments is an important research topic in the study of Alzheimer's Disease (AD). Regression models have been widely investigated to predict cognitive outcomes using morphometric measures extracted from structural magnetic resonance imaging (MRI) scans (e.g., [27] ). Such studies can improve the understanding of the neuroanatomical basis of cognitive impairments, but are not designed to directly impact clinical practice. To bridge this gap, here we propose a new learning paradigm which ranks cognitive assessments according to their relevance to AD using brain MRI data.\nCognitive assessments provide the most common clinical routine for the diagnosis of AD. Given a large number of cognitive assessment tools and a time-limited office visit, determining a proper set of cognitive tests is a widely studied topic. Most existing studies aim to create selection guidelines for a targeted population [21] . In this work, we propose a novel learning paradigm that embraces the concept of precision medicine and tailors the cognitive test selection process to the individual characteristics of a given patient. Specifically, we perform an innovative application of a newly developed learning-to-rank method, denoted as PLTR [9] , to the structural MRI and cognitive assessment data of the Alzheimer's Disease Neuroimaging Initiative (ADNI) cohort [25] . Using structural MRI measures as the individual characteristics, we aim to not only identify individual-specific cognitive biomarkers but also prioritize them and their corresponding assessment tasks according to AD-specific abnormality.\nThe uniqueness of our study is twofold. First, traditional regression-based studies for prediction of cognitive performances from MRI data focus on identifying relevant imaging biomarkers at the population level. The proposed new model aims to identify AD-relevant cognitive biomarkers tailored to each individual patient. Second, the identified cognitive biomarkers and assessments are prioritized based on the individual's brain characteristics, which can be used to guide the determination of cognitive assessments in a personalized fashion in clinical practice. It has the potential to enable personalized diagnosis and disease subtyping."}, {"section_title": "LITERATURE REVIEW 2.1 Learning to Rank", "text": "Learning to Rank (LETOR) [16] is a popular technique used in recommender systems [10] , web search [2] and information retrieval [12] . Existing LETOR methods can be roughly classified into three categories [17] . The first category is pointwise methods [6] , in which a score function is learned to score individual instance, and then instances are sorted/ranked based on their scores. The second category is pairwise methods [5] , which maximize the number of correctly ordered pairs to learn the ranking structure among instances. The last category is listwise methods [11] , in which a ranking function is learned to explicitly model the entire ranking. Generally, pairwise and listwise methods have superior performance over pointwise methods due to their ability to leverage order structure among instances in learning [17] . Recently, LETOR has also been used in drug discovery and drug selection [13] [14] [15] 28] . For example, Agarwal et al. [1] developed a bipartite ranking method to prioritize compounds. He et al. [9] developed a joint push and learning to rank method to select cancer drugs to patients. These studies demonstrate the great potential of LETOR in computational biology and computational medicine."}, {"section_title": "Machine Learning for AD Biomarker Discovery", "text": "The importance of big data to enhance AD biomarker study has been widely recognized [25] , resulting in numerous data-driven machine learning models developed for early detection of AD and identification of relevant biomarkers including cognitive measures. These models are often designed to accomplish tasks such as classification (e.g., [24] ), regression (e.g., [22, 26, 27] ) or both (e.g., [4, 23] ), where imaging and other biomarker data are used to predict diagnostic, cognitive and/or other outcome(s) of interest. Although outcome-relevant biomarkers can be identified here, they are selected at the population level and not specific to any individual subject. To bridge this gap, we propose the PLTR method here for biomarker prioritization at the individual level, which has the potential to impact personalized diagnosis."}, {"section_title": "MATERIALS", "text": "The imaging and cognitive data used here were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database [25] . The ADNI was launched in 2003 as a public-private partnership, led by Principal Investigator Michael W. Weiner, MD. The primary goal of ADNI has been to test whether serial MRI, PET, other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of mild cognitive impairment (MCI, a prodromal stage of AD) and early AD. For up-to-date information, see www.adni-info.org.\nParticipants include 819 ADNI-1 subjects, including 229 healthy control (HC), 397 MCI and 193 AD participants. Combining MCI and AD subjects as patients, we have 590 cases and 229 controls. Baseline 1.5T MRI scans and cognitive assessment data were downloaded from the ADNI website (adni.loni.usc.edu). MRI scans were processed using Freesurfer version 5.1 as described in [19] , where volumetric and cortical thickness measures of 101 regions relevant to AD were extracted to characterize brain morphometry.\nOur analysis focuses on 151 scores assessed in 15 neuropsychological tests. For convenience, we call these measures as cognitive features and these tests as cognitive tasks. "}, {"section_title": "METHODS 4.1 Joint Push and Learning-To-Rank -PLTR", "text": "We use the joint push and learning-to-rank method as developed in He et al. [9] , denoted as PLTR, for personalized cognitive feature prioritization. Our goal is to prioritize cognitive features for each patient that are most relevant to his/her disease diagnosis using patients' brain morphometric measures extracted from their MRI scans. In specific, the cognitive features are in the form of scores or answers from cognitive tasks that the patients take. The prioritization result can potentially be used in clinical practice to recommend the most relevant cognitive features or tasks that can most effectively help diagnosis of an individual.\nIn the context of MCI/AD cognitive feature prioritization, PLTR learns and uses latent vectors of patients and their imaging features to score each cognitive feature for each patient, and ranks the cognitive features based on their scores; patients with similar imaging feature profiles will have similar latent vectors. During the learning process, PLTR explicitly pushes the most relevant cognitive features on top of the less relevant ones for each patient, and therefore optimizes the latent patient and cognitive feature vectors so they will reproduce the pushed ranking structures. In PLTR, such latent vectors are learned by solving the following optimization problem:\nwhere U = [u 1 , u 2 , · · · , u m ] and V = [v 1 , v 2 , · · · , v n ] are the latent vector matrices for patients and features, respectively; L s is the overall loss function; and P ↑ s measures the average number of relevant cognitive features that are ranked below an irrelevant cognitive feature, defined as follows,\nwhere m is the number of patients, f + j and f − i are the relevant and irrelevant features of patient Pp , n + p and n − p are their respective numbers, and I(x) is the indicator function (I(x) = 1 if x is true, otherwise 0). In Problem (2), s p (f i ) is a scoring function defined as follows,\nthat is, it calculates the score of feature f i on patient Pp using their respective latent vectors u p and v i . In Problem (1), O + s measures the ratio of mis-ordered feature pairs over the relevant features among all the patients, defined as follows,\nwhere f i ≻ R f j represents that f i is ranked higher than f j under the relation R. In Problem (1), R u is a regularizer on U and V to prevent overfitting, defined as\nwhere w pq is the similarity between Pp and Pq that is calculated using the imaging features of the patients."}, {"section_title": "Joint Push and Learning-To-Rank with Hinge loss -PLTR h", "text": "The objective of PLTR is to score relevant features higher than less relevant features as shown in Equation 2 and Equation 4. However, in some cases, the score of relevant features is expected to be higher than that of less relevant features by a large margin. For example, patients can be very sensitive to a few cognitive tasks but less sensitive to many others. In order to incorporate such information, we propose a hinge loss based PLTR, denoted as PLTR h . In PLTR h , the overall loss function is very similar to Equation 1, defined as follows,\nwhere L h is the overall loss function; U , V , R u and R csim are identical as those in Equation 1. In PLTR h , P ↑ h measures the average loss between the relevant features and irrelevant features using hinge loss as follows,\nwhere\nis the hinge loss between the relevant feature f + j and the irrelevant feature f − i , and t p is the pre-defined margin. Similarly, O + h measures the average loss among the relevant features also using hinge loss as follows,\nwhere t o is also the pre-defined margin."}, {"section_title": "DATA PROCESSING 5.1 Data Normalization", "text": "We selected all the MCI/AD patients from the dataset and did the following data normalization for the patients. We first conducted a t-test on each of the cognitive features between patients and controls, and selected cognitive features if there is a significant difference between patients and controls on these features. Then we converted each of the selected features into [0, 1] by shifting and scaling the feature values. We also converted all the normalized feature values based on the Cohen's d of the features between patients and controls, so that smaller values always indicate more AD possibility. After that, we filtered out features whose values are 0, 1 or 0.5 for more than 95% patients, in order to remove features that are either extremely dominated by patients or controls, or not discriminative. We conducted the same process as above on the imaging features."}, {"section_title": "Patient Similarities from Imaging Features", "text": "After the above normalization and filtering steps, we have 86 normalized imaging features remaining in the study. We represent each patient as a vector of these features, denoted as r p = [r p1 , r p2 , · · · , r p86 ], where r pi (i = 1, · · · , 86) is an imaging feature for patient p. We calculate the patient similarity from imaging features using the radial basis function (RBF) kernel, that is,"}, {"section_title": "EXPERIMENTAL PROTOCOL 6.1 Baseline Methods", "text": "We compare PLTR and PLTR h with two baseline methods: the Bayesian Multi-Task Multi-Kernel Learning (BMTMKL) method [7] and the Kernelized Rank Learning (KRL) method [8] .\n6.1.1 Bayesian Multi-Task Multi-Kernel Learning (BMTMKL). BMTMKL is a strong baseline for biomarker prioritization. It was originally proposed to rank cell lines for drugs and won the DREAM 7 challenge 1 . In our study, BMTMKL uses the multi-task and multi-kernel learning within kernelized regression to predict amyloid feature values and learns parameters by conducting Bayesian inference. We use the patient similarity matrix calculated from FreeSurfer features as the kernels in BMTMKL.\n6.1.2 Kernelized Rank Learning (KRL). KRL represents another strong baseline for biomarker prioritization. In our study, KRL uses kernelized regression with a ranking loss to learn the ranking structure of patients and to predict the amyloid feature values. The objective of KRL is to maximize the hits among the top k of the ranking list. We use the patient similarity matrix calculated from FreeSurfer features as the kernels in KRL."}, {"section_title": "Training-Testing Data Splits", "text": "We test our methods in two settings: cross validation and leave-out validation. In the cross validation (CV), we split the cognitive tasks for each patient into 5 folds. That is, all the features in a cognitive task will be either split into training or testing set. We use 4 folds for training and the rest fold for testing, and do such experiments 5 times, each with one of the 5 folds as the testing set. The overall performance of the methods is averaged out over the 5 testing sets. This setting corresponds to the goal to prioritize additional cognitive tasks that a patient should complete. In the leave-out validation (LOV), we split patients into training and testing sets, such that a certain patient and all his/her cognitive features will be either in the training set or in the testing set. This corresponds to the use scenario to identify the most relevant cognitive tasks that a new patient needs to take, training patients testing patients based on the existing imaging information of the patient, when the patient has not completed any cognitive tasks. Figure 1 and Figure 2 demonstrate the CV and LOV data split processes, respectively."}, {"section_title": "Parameters", "text": "We conduct grid search to identify the best parameters for each model. We use 0.3 and 0.1 as the value of t p and t o , respectively. In the experimental results, we report the combinations of parameters that achieve the best performance on evaluation metrics."}, {"section_title": "Evaluation Metrics", "text": "6.4.1 Metrics on Cognitive Feature Level. We define average feature hit at k (QH@k) to evaluate the ranking performance as follows,\nwhere τ q is the ground-truth ranking list of all the features in all the tasks, τ q (1 : k) is the top k features in the list,τ q is the predicted ranking list of all the features, andτ q i is the i-th ranked features inτ q . That is, QH@k calculates the number of features among top k in the predicted feature lists that are also in the ground truth (i.e., hits). Higher QH@k values indicate better prioritization performance.\nWe define a second evaluation metric weighted average feature hit at k (WQH@k) as follows: The column \"d \" corresponds to the latent dimension. The best performance of each method is in bold. The best performance under each evaluation metric is underlined that is, WQH@k is a weighted version of QH@k that calculates the average of QH@j (j = 1, · · · , k) over top k.\nHigher WQH@k indicates more feature hits and those hits are ranked on top in the ranking list."}, {"section_title": "Metrics on Cognitive Task Level.", "text": "We use the mean of the top-normalized ground-truth scores/predicted scores on the features of each cognitive task for a patient as the score of that task for that patient. For each patient, we rank the tasks using their ground-truth scores and use the ranking as the ground-truth ranking of these tasks. Thus, these scores measure how much relevant to AD the task indicates for the patients. We use the predicted scores to rank cognitive tasks into the predicted ranking of the tasks. We define a third evaluation metric task hit at k (NH @k) as follows to evaluate the ranking performance in terms of tasks,\nwhere τ n /τ n is the ground-truth/predicted ranking list of all the tasks using top-question scores. Table 1 presents the performance of PLTR, PLTR h and two baseline methods in the CV setting."}, {"section_title": "EXPERIMENTAL RESULTS", "text": ""}, {"section_title": "Overall Performance on CV", "text": ""}, {"section_title": "Comparison on cognitive feature level.", "text": "For cognitive features from all tasks, PLTR is able to identify on average 2.665 out of the top-5 most relevant ground-truth cognitive features among its top-5 predictions (i.e., QH@5=2.665). PLTR h achieves similar performance as PLTR, and identifies on average 2.599 most relevant groundtruth cognitive features on its top-5 predictions (i.e., QH@5=2.599). PLTR and PLTR h significantly outperform the baseline methods in terms of all the evaluation metrics on cognitive feature level (i.e., QH@5 and WQH@5). Specifically, PLTR outperforms the best baseline method BMTMKL at 9.1% and 22.1% on QH@5 and WQH@5, respectively. PLTR h also outperforms BMTMKL at 6.4% and 19.2% on QH@5 and WQH@5, respectively. These experimental results demonstrate that among the top 5 features in the ranking list, PLTR and PLTR h are able to rank more relevant features on top than the two strong baseline methods and the positions of those hits are also higher than those in the baseline methods.\n7.1.2 Comparison on cognitive task level. For the scenario to prioritize cognitive tasks that each patient should take, PLTR and PLTR h are able to identify the top-1 most relevant task for 72.5% and 74.3% of all the patients when using 3 features to score cognitive tasks, respectively (i.e., NH 3 =0.725 for PLTR and NH 3 =0.743 for PLTR h ). This indicates the strong power of PLTR and PLTR h in prioritizing cognitive features and in recommending relevant cognition tasks for real clinical applications. We also find that PLTR and PLTR h are able to outperform baseline methods on most of the metrics on cognitive task level (i.e., NH @1). PLTR outperforms the best of baseline methods BMTMKL at 11.6%, 16.7% and 14.2% on NH 1 @1, NH 2 @1 and NH 3 @1, respectively. PLTR h performs even better than PLTR on NH 1 @1 and NH 3 @1, in addition to that it outperforms the best performance of baseline methods at 13.7%, 14.7% and 17.0% on NH 1 @1, NH 2 @1 and NH 3 @1, respectively. PLTR and PLTR h perform slightly worse than baseline methods on NH 5 @1 and NH all @1 (0.760 vs 0.784 on NH 5 @1 and 0.707 vs 0.760 on NH all @1). These experimental results indicate that PLTR and PLTR h are able to push the most relevant task to the top of the ranking list than baseline methods when using a small number of features to score cognitive tasks. Note that in CV, each patient has only a few cognitive tasks in the testing set. Therefore, we only consider the evaluation at the top task in the predicted task rankings (i.e., only NH @1 in Table 1 ). Table 1 also shows that PLTR h outperforms PLTR on most of the metrics on cognitive task level (i.e., NH @1). PLTR h outperforms PLTR at 1.9%, 2.5%, 1.5% and 2.6% on NH 1 @1, NH 3 @1, NH 5 @1 and NH all @1, respectively. This indicates that generally PLTR h is better than PLTR on ranking cognitive tasks in CV setting. The reason could be that the hinge-based loss functions with pre-defined margins can enable significant difference between the scores of relevant features and irrelevant features, and thus effectively push relevant features upon irrelevant features. Table 2 and Table 3 presents the performance of PLTR, PLTR h and two baseline methods in the LOV setting. We first hold out 26 ( Table 2 ) and 52 (Table 3) AD patients as testing patients, respectively. We determine these holdout AD patients as the ones that have more than 10 similar AD patients in the training set with corresponding patient similarities higher than 0.67 and 0.62, respectively. Table 2 and Table 3 show that PLTR and PLTR h significantly outperform the baseline methods in terms of all the evaluation metrics on cognitive feature level (i.e., QH@5 and WQH@5), which is consistent with the experimental results in CV setting. When 26 patients are hold out for testing, with parameters α = 0.5, β = 1.5, γ = 1.0 and d = 30, PLTR outperforms the best baseline method KRL at 13.4% and 1.3% on QH@5 and WQH@5, respectively. The performance of PLTR h is very comparable with that of PLTR \" PLTR h outperforms KRL at 13.4% and 0.5% on QH@5 and WQH@5, respectively. When 52 patients are hold out for testing, with parameters α = 0.5, β = 0.5, γ = 1.0 and d = 50, PLTR outperforms the best baseline method KRL at 18.1% and 7.8% on QH@5 and WQH@5, respectively. PLTR h even performs better than PLTR in this setting. In addition, PLTR h outperforms KRL at 19.7% and 9.5% on QH@5 and WQH@5, respectively. These experimental results demonstrate that for new patients, PLTR and PLTR h are able to rank more relevant features to the top of the ranking list than the two baseline methods. They also indicate that for new patients, ranking based methods (e.g., PLTR and PLTR h ) are more effective than regression based methods (e.g., KRL and BMTMKL) for biomarker prioritization. Table 2 also shows that when 26 patients are hold out for testing, PLTR and PLTR h are both able to identify the top most relevant questionnaire for 84.6% of the testing patients (i.e., Table 2 . Overall Performance in LOV on 26 testing patients method feature level task level QH@5 WQH@5 NH 1 @1 NH 1 @5 NH 2 @1 NH 2 @5 NH 3 @1 NH 3 @5 NH 5 @1 NH 5 @5 NH all @1 NH all @5 PLTR The column \"n\" corresponds to the number of hold-out testing patients. The bset performance of each method is in bold. The best performance under each evaluation metric is underlined.\n"}, {"section_title": "Overall Performance on LOV", "text": ""}, {"section_title": "Comparison on cognitive task level.", "text": "22 patients) under NH 1 @1. Table 3 shows that when 52 patients are hold out for testing, PLTR and PLTR h are both able to identify for 80.8% of the testing patients (i.e., 42 patients) under NH 1 @1. Note that the hold-out testing patients in LOV do not have any cognitive features. Therefore, the performance of PLTR and PLTR h as above demonstrates their strong capability in identifying most AD related cognitive features based on imaging features only. We also find that PLTR and PLTR h are able to achieve similar or even better results compared to baseline methods in terms of the evaluation metrics on cognitive task level (i.e., NH @1 and NH @5). When 26 patients are hold out for testing, PLTR and PLTR h outperform the baseline methods in terms of NH @1 (i.e., = 1, 2 . . . 5). They are only slightly worse than KRL on ranking relevant tasks on their top-5 of predictions when = 1 or = 5 (3.308 vs 3.423 on NH 1 @5 and 3.808 vs 3.962 on NH 5 @5). When 52 patients are hold out for testing, PLTR and PLTR h also achieve the best performance on most of the evaluation metrics. They are only slightly worse than KRL on NH 2 @1, NH 5 @5 (0.423 vs 0.481 on NH 2 @1 and 3.712 vs 3.808 on NH 5 @5). These experimental results demonstrate that among top 5 tasks in the ranking list, PLTR and PLTR h rank more relevant task on top than KRL.\nIt's notable that in Table 2 and Table 3 , as the number of features used to score cognitive tasks (i.e., in NH @k) increases, the performance of all the methods in NH @1 first declines and then increases. This may indicate that as increases, irrelevant features which happen to have relatively high scores will be included in scoring tasks, and thus degrade the model performance on NH @1. However, generally, the scores of irrelevant features are considerably lower than those of relevant ones. Thus, as more features are included, the scores for tasks are more dominated by the scores of relevant features and thus the performance increases.\nWe also find that BMTMKL performs poorly on NH 3 @1 in both Table 2 and Table 3 . This indicates that BMTMKL, a regression-based method, could not well rank relevant features and irrelevant features. It's also notable that generally the best performance for the 26 testing patients is better than that for 52 testing patients. This may be due to that the similarities between the 26 testing patients and their top 10 similar training patients are higher than those for the 52 testing patients. The high similarities enable accurate latent vectors for testing patients. The column \"n\" corresponds to the number of hold-out testing patients. The best performance of each model is in bold. The best performance under each evaluation metric is upon underline. Table 2 and Table 3 also show that PLTR h is better than PLTR on ranking cognitive tasks in LOV setting. When 26 patients are hold out for testing, PLTR h outperforms PLTR on NH 1 @5, NH 5 @5 and NH all @5 and achieves very comparable performance on the rest metrics. When 52 patients are hold out for testing, PLTR h is able to achieve better performance than PLTR on QH@5, WQH@5, NH 3 @1, NH 5 @1, NH 5 @5 and NH all @5 and also achieves very comparable performance on the rest metrics. Generally, PLTR h outperforms PLTR in terms of metrics on cognitive task level. This demonstrates the effectiveness of loss-based methods in separating relevant and irrelevant features during modeling."}, {"section_title": "Case Study", "text": "When NH 1 @1 achieves its optimal performance 0.846 for the 26 testing patients in LOV (i.e., the first row block in Table 2 ), the corresponding most common task that is prioritized for the testing patients is Rey Auditory Verbal Learning Test (RAVLT), including the following cognitive features: 1) trial 1 total number of words recalled; 2) trial 2 total number of words recalled; 3) trial 3 total number of words recalled; 4) trial 4 total number of words recalled; 5) trial 5 total number of words recalled; 6) total Score; 7) trial 6 total number of words recalled; 8) list B total number of words recalled; 9) 30 minute delay total; and 10) 30 minute delay recognition score. This task is also the most relevant task in the ground truth if tasks are scored correspondingly. RAVLT is a well-known cognitive test that assesses learning and memory, and has shown promising performance in early detection of AD [18] . A number of studies have reported high correlations between various RAVLT scores with different brain regions [3] . For example, RAVLT recall is associated with medial prefrontal cortex and hippocampus; RAVLT recognition is highly correlated with thalamic and caudate nuclei. Genetic analysis of APOE ε4 allele, the most common variant of AD, reported its association with RAVLT score in an early-MCI (EMCI) study [19] . The fact that RAVLT is prioritized demonstrates the strong power of PLTR in prioritizing cognitive features to assist AD diagnosis.\nSimilarly, we find the top-5 most frequent cognitive tasks corresponding to the performance at NH 3 @5=3.731 for the 26 hold-out testing patients. They are: Functional Assessment Questionnaire (FAQ), Clock Drawing Test (CDT), Weschler's Logical Memory Scale (LOGMEM), Rey Auditory Verbal Learning Test (RAVLT), and Neuropsychiatric Inventory Questionnaire (NPIQ). In addition to RAVLT discussed above, other top prioritized cognitive tasks have also been reported to be associated with AD or its progression. In an MCI to AD conversion study, FAQ, NPIQ and RAVLT showed significant difference between MCI-converter and MCI-stable groups [20] . These evidences further demonstrate the diagnostic power of our method."}, {"section_title": "CONCLUSIONS", "text": "We have proposed an innovative machine learning paradigm for prioritizing cognitive assessments according to their relevance to AD at the individual patient level. The paradigm tailors the cognitive biomarker discovery and cognitive assessment selection process to the brain morphometric characteristics of each individual patient. It has been implemented using newly developed learning-to-rank method PLTR and PLTR h . Our empirical study on the ADNI data has yielded promising results to identify and prioritize individual-specific cognitive biomarkers as well as cognitive assessment tasks based on the individual's structural MRI data. In addition, PLTR h shows better performance than PLTR on ranking cognitive assessment tasks. The resulting top ranked cognitive biomarkers and assessment tasks have the potential to aid personalized diagnosis and disease subtyping, and to make progress towards enabling precision medicine in AD."}]