[{"section_title": "Introduction", "text": "A key policy concern in US higher education is increasing the number of college graduates in STEM (Science, Technology, Engineering, and Mathematics). In 2012, the President's Council of Advisors on Science and Technology projected \"a need for approximately 1 million more STEM professionals\" than produced at US rates at the time, necessitating a 34% annual increase in the number of STEM graduates. This shortage of STEM majors exists despite the large wage premium for STEM graduates over non-STEM graduates. For example, the median salary shortly after graduation (4-5 years) in 2012 for a bachelor's in STEM was $60, 000, compared to $44, 000 for a bachelor's in non-STEM (NCES 2014). One major contributor to this shortage is the significant attrition from STEM majors by college students. Griffith (2010) finds in the National Longitudinal Survey of Freshman that while 33% of women and 43% of men in college initially express interest in STEM, less than half of both groups persist in STEM through their sophomore year, with roughly 40% of those with initial interest finally persisting to graduation. 1 Conversely, switching into STEM from non-STEM is rare: only 10% of women and 15% of men that initially planned to major in non-STEM switch into STEM. Related to the concern about the shortage of STEM majors is the significant rate of dropout from college in general: only 60% of students that started a bachelor's in 2008 completed a degree by 2014 (NCES 2016). This is despite the even larger premium for college graduates over dropouts: the median college graduate has lifetime earnings of roughly $1.19 million, compared to $0.72 million for those with some college but no degree (Hamilton Project 2014). Since dropping out of college is possibly the most severe form of attrition, any policy addressing STEM attrition will likely have to confront attrition from college in general. The key question is what causes these high rates of college dropout, as well as the asymmetric attrition from STEM to non-STEM majors? The main mechanism put forth in the economics of education literature for attrition from college (and majors) is that students learn about their own ability while in school and re-evaluate their decision to stay in school, switching majors or dropping out if the information is unfavorable. Information about ability primarily arives through grades: grades are reflective of the student's academic ability, as well as their labor market productivity (to the extent that these two are correlated). However, existing models primarily treat grades as 'pure signals' to the student, rather than things that may directly affect the value of a degree. Grades might force a student to dropout (e.g. GPA requirements for graduation), or to the extent that employers observe them (e.g. on a resume) they can directly affect the wage offers available to the student after graduation. I believe this treatment of grades as more than just signal, combined with course-switching frictions and some stylized facts about differential grading standards between majors, can better explain the asymmetric attrition from STEM versus non-STEM majors than existing models. I will first discuss the literature on the decisions of college students to drop out of college or switch majors and the general conclusions about why this occurs. I will also present some suggestive evidence of the importance of grades to students outside of merely being a signal of ability, as well as some stylized facts about grading standards across majors. Finally I will present a structural model of student's college major choice that embeds learning about ability but also the impact of grades on a student's graduation outcomes, as well as occupational choice. I will then discuss estimating this model using data from the National Longitudinal Survey of Youth 1997 (NLSY97). Manski and Wise (1983) offered one of the first treatments of college as an experiment on the part of the student. Students enter college unsure about many things, such as their ability to perform well in college. As they progress through their careers in college, they resolve this uncertainty; one of the most direct signals would be their performance in courses as measured by grades. As this uncertainty is resolved, students re-evaluate the value of staying in college, and it may then be optimal to drop out."}, {"section_title": "Background and Literature Review 2.1 Models of College and Uncertainty", "text": "Uncertainty thus generates option value for the student. It may be ex-ante optimal for a student to attend college, even if it is later ex-post optimal for them to not complete their degree. It is the option to continue in college that is the source of this option value. Stange (2012) estimates this option value accounts for 14% of the total value (in wages) of the opportunity to attend college. Likewise, Trachter (2012) finds that in the case of 2-year colleges, the option value of eventually transferring to a 4-year college accounts for nearly all of the value of attending a 2-year college. There exist multiple forms of uncertainty for the student. Central to most models of college is uncertainty about ability (see e.g. Arcidiacono et al. 2016, Stinebrickner andStinebrickner 2014). Ability in this case refers to a student's performance in college, and possibly also in the labor force, to the extent that these two are correlated. There is also uncertainty in the rate of human capital accumulation while in college (Altonji 1993), as well as the wages that a student will receive upon graduating in a particular major (Wiswall and Zafar 2015). And, to the extent that grades are unpredictable (i.e. tests do not perfectly measure ability), there is innate uncertainty in the final grades that students would receive, even if they knew their ability perfectly. While I will not go over the specific results of the papers cited, I will discuss the general conclusions from these papers. Not surprisingly, many of the papers find that learning about ability is a major contributor to college drop out; this is primarily driven by the stylized observation in the data that dropouts have lower grades than those that persist through college. 2 Furthermore, in Wiswall and Zafar's 2015 paper, they present students with 'information shocks' on the true wage distributions available to graduates, and ask students their revised probabilities of choosing and graduating in certain majors in light of the new information. They find that major choice is relatively inelastic to major-specific earnings. 3 That means that in these models, whatever dropout/switching is not explained by learning about ability must be captured by significant individual preferences for major or for college. Regardless, in order to explain the high dropout rate, there must be significant resolution of uncertainty while in college, implying that students are either very uncertain or misinformed about their ability. While I do believe that these mechanisms are in play, I argue that there are two other important mechanisms that can explain dropout, and in particular the asymmetric attrition from STEM: differential grading standards between STEM and non-STEM courses, coupled with structural differences in switching costs between STEM and non-STEM. To motivate this asymmetry between STEM and non-STEM, I must first discuss some stylized facts about the differences between majoring in STEM and non-STEM while in college."}, {"section_title": "Differential Grading Standards in STEM and non-STEM", "text": "I must clarify the definition of STEM that I will use when discussing my model. 'STEM' is a definition by the National Science Foundation, that considers as 'sciences' the social sciences such as sociology and political science (along with the engineering, mathematics, and the natural sciences). However, when discussing grading standards as well as the wages offered graduates of various majors, it makes more sense to define STEM to exclude the social sciences, but include economics. This is because when it comes to grading standards as well as lifetime earnings, social sciences tend to have more in common with the humanities and other non-STEM majors than with the rest of STEM/economics (Johnson 2003, Hamilton Project 2014. In this paper, I will take STEM to refer to the 'natural sciences, engineering, mathematics/statistics, and economics', and broadly classify all other majors as non-STEM (including business and pre-medicine). This categorization is also used in the literature (e.g. , Griffith 2010). Using this categorization, STEM courses are generally found to be both harder and graded more strictly than courses in non-STEM. For example, Arcidiacono et al. (2012) find that for freshmen at Duke University, they spend 50% more time studying in STEM vs. non-STEM courses, and are 50% more likely to list a STEM course as their most challenging course vs. random assignment. Likewise, there exist grading differences between the two broad major types: Johnson (2003) estimates a difference of around 0.60 GPA points between courses in STEM and non-STEM. He arrives at this estimate and accounts for selection on major-specific ability by comparing the grades received by non-majors in department X to those of majors in department X. The idea is that while it is possible that students in a leniently graded department have higher grades due to posessing higher major-specific ability, it is far less plausible that students in other majors taking courses in the leniently graded department also posess the same major-specific ability; any discrepancy here is likely due to different grading standards."}, {"section_title": "The Importance of Grades in Student Welfare", "text": "This discrepancy in grading between majors should not affect student welfare or student schooling decisions, if grades were purely a signal of ability to the student: students would simply normalize their grades and respond accordingly. 4 However, students seem to care very much about the notional value of grades. Butcher et al. (2014) study a grade deflation policy at Wellesley College, which required large introductory and intermediate courses to have an average grade not exceeding a B+ (3.3 GPA points). STEM courses were not in violation of this constraint, but multiple non-STEM courses were. Consequently, the average grade in those courses directly affected by the policy dropped by 0.17 GPA points, or 1/6 of a letter grade; this reduction in average grades occurred almost entirely through decreasing the number of A's awarded and increasing the number of B's. Enrollment in courses in the affected majors fell by 19%, and the number of students that declared majors in those fields fell by 30%, implying a very high elasticity for major choice with respect to notional grades. 5 Similarly, Arcidiacono et al. (2012) finds that that one of the major reasons for the increase in grades of minority students at Duke over their college tenure is due to their switching out of STEM into non-STEM, where the grading standards are presumably easier. The prevailing view in the literature about grades purely as signals suggests that grade deflation should in fact be welfare-enhancing to the student, because deflating grades improves the quality of the signal a student receives about their ability by reducing the amount of right-censoring due to excessive A's. However, the results of the Butcher et al. (2014) study as well as the general unpopularity of grade deflation among students (e.g. Princeton University's implementation and reversal of a grade-deflation policy between 2004 and 2014) suggests that grades are more than just signals of ability. Grades can affect the value of a college education if they affect the chances of successfully graduating from college, or if they are relevant in the job search process for a graduate. Regarding the former, using the example of UNC-Chapel Hill, the cumulative GPA of a student (not weighted by major) must be at least 2.0 out of 4.0 in order for the student to be awarded a diploma; this is in addition to the other requirements for graduation such as accumulation of credits and course distribution requirements. To the extent that the student is uncertain about their grades, they must factor in the possibility that they will fail out of college; given the presence of sheepskin effects, this failout has significant implications for labor market payoffs. 6 However, Stinebrickner and Stinebrickner (2014) find that this 'failout margin' only explains a small proportion of dropout (removing the failout condition only decreased their modeled student dropout rate at Berea College from 48.3% to 46.3%). For context, the average graduating GPA of a student in 2013 was slightly above 3.1 in a large sample of American universities (Rojstaczer 2016), so the margin of students at risk of failing out might be small, and the risk of failing out most likely cannot explain the large elasticity in the Wellesley College context, since that grade deflation policy mostly affects students near the top of the grade distribution, which are unlikely to be those on the margin of failing out. However, I believe there is also a second margin, which occurs when a college graduate starts searching for a job. If firms filter recent graduates based off of GPA, in addition to whether or not a student actually graduated with a degree, there can be additional margins at which students might change their behavior due to grading concerns. There has been work done in the literature that treats earnings as a function of grades in college, although with less focus on the dynamics of course selection while taking into account differential grading standards. Jones and Jackson (1990) estimate a log-wage regression with grades as a regressor, and estimate that a 1.0 increase in GPA (one letter grade) yields an increase in log-wages by 0.085. More similar to my work is Arcidiacono (2004), which estimates a structural model of major choice that incorporates grades as mechanism for learning about ability, as well as a component of earnings. He obtains estimates of the coefficient of GPA on log-wages ranging from -0.08 to 0.107 for science and humanities courses (there are larger sensitivities for business and education, on the order of 0.20, but these are very specific majors). Both of these papers conclude that grades affect the post-graduation earnings of an individual. However, for reasons I will explain in the following subsection on modeling graduation from college, I believe models such as Arcidiacono (2004) or even Arcidiacono et al. (2016) make strong abstractions from the actual process of completing a college degree (course requirements), that may be important in inducing major switching. A major concern with any estimate of coefficients in the wage equation is whether they are causal. If unobserved work ability (that shows up in wages) is correlated with unobserved schooling ability (that shows up in grades), we can get positive grade coefficients without causality. For example, a permanent character trait such as 'initiative' or 'adaptability' might positively affect both grades and labor outcomes. However,  estimate a model of education and labor decisions where they estimate precisely this correlation by assuming work and school ability are drawn from a multivariate normal distribution, and jointly estimating grade and wage equations. While they conclude that there is strong correlation between ability in STEM and non-STEM courses-they get a correlation coefficient of 0.902-they estimate correlation coefficients of 0.057 and 0.053 for labor ability with STEM academic ability and non-STEM academic ability, respectively. This suggests that while there is some endogeneity in grades, it is minor. However, this still begs the question of why grades should affect the value of a degree. I will go into more detail in the following section."}, {"section_title": "Models of College Completion and Major Switching", "text": "A model's specification of the mapping between college enrollment decisions and graduation has strong implications for the dynamics of dropout or major switching. In reality, the requirements for obtaining a bachelor's degree typically involve passing a certain set of courses in the major, as well as accumulating sufficient overall course credits, possibly subject to a grade constraint. For example, at UNC-Chapel Hill, obtaining a bachelor's degree in economics requires a final cumulative GPA of 2.0 over all courses taken (not just in the major declared), 45 course credits over all courses, and a grade of at least a C over each of the required major-specific courses (UNC Registrar). Fully modeling the individual's choices over all course combinations (and even the number of courses to take each semester) as they work towards their degree is infeasible, so researchers are forced to make simplifications. For example, Arcidiacono (2004) assumes students make choices over majors over 2 periods, and has deterministic graduation if the student is enrolled; Arcidiacono et al. (2016) instead has stochastic graduation that occurs after spending at least 3 years in college, and which depends on observable and unobservable characteristics, but importantly not the course credits accumulated. Both of these models assume the existence of a 'switching cost' in the flow utility for changing majors, and Arcidiacono (2004) even has a switching penalty in the grade generating process (switchers have lower grades, which might affect wages). Switching costs are a reduced form way of capturing the frictions that prevent major switching, which are presumably founded in course requirement frictions: some courses taken in one major may not be able to satisfy the graduation requirement for another major. In particular, if certain majors, such as engineering, have more stringent course requirements, this could very well generate 'STEM dropout' simply because students can easily switch out of engineering majors, but not vice versa. Hendricks and Leukhina (2017) use course transcript data from the Postsecondary Education Transcript Study (PETS), a part of the High School & Beyond dataset provided by the US Department of Eduction, to explicitly model the accumulation of credits towards graduation, and can be seen as a step in the direction of structurally modeling the graduation process. In that paper, student ability affects the rate of course credit accumulation (although there is still randomness in the rate of credit accumulation), and students can learn about their ability through their academic results. Students graduate if they accumulate enough credits, and dropout either voluntarily or if they fail to graduate within 6 years. However, two limitations of this paper are that it does not contain any information about college major, and that it calibrates its lifetime earnings using the NLSY79, assuming that high school GPA is a direct (albeit noisy) measure of ability. It would be more desirable to follow the same individual throughout their college as well as occupational career. Related to explicitly modeling course credits and graduation is Hsu (2017 JMP), which also focuses on the accumulation of course credits by major. While this paper is still preliminary, the main modeling framework of students choosing amongst different accumulations of credits towards different majors in each period, and receiving grade signals in those courses, represents a serious attempt at incorporating the microfoundations of switching costs between majors. Hsu considers major-specific grades as affecting the payoff to graduation, although he does not use the mechanism of grades affecting wages, instead opting to estimate the major-specific payoffs from the individual's decisions . The model that I present also seeks to explicitly model two structural aspects of the college graduation process: course credit accumulation as potentially restricting the majors a student can take while in college (instead of major switching costs), and course major declaration as further restricting switching majors in the later years of college. These factors all restrict the choices individuals can make by directly altering the feasible choice set for an individual, and may provide a key explanation for STEM attrition."}, {"section_title": "Occupational Choice and Sorting", "text": "Students are incentivized to pursue a college eduation because it affects their occupational outcomes, both through their wages as well as the types of occupations they are able to pursue with their degree. Keane and Wolpin (1997) propose a dynamic model of schooling and occupational choice. Individuals choose between going to school, college, or graduate school, as well as working in various occupational sectors, with the goal of maximizing lifetime utility. Lifetime utility is the discounted sum of per-period flow utilities, where flow utilities are a function of wages earned in each period, as well as additive nonpecuniary flow payoffs. Wages follow the standard Mincerian form, namely log-wages are quadratic in experience and linear in years of schooling, with unobserved heterogeneity occuring through individuals having unobserved initial endowments of experience that affect their wages. Importantly, this model does not have unobserved taste heterogeneity which might cause individuals to pick jobs that are not lifetime income maximizing (the nonpecuniary payoffs for occupational sectors are common for all individuals). Kinsler and Pavan (2015) demonstrate the importance of relevance of college major to occupation, using different datasets: the former the National Survey of College Graduates and the latter the Baccalaureate and Beyond Longitudinal Study. Both surveys ask graduates about the relevance of their college major to their current occupation. Robst (2007) offers suggestive evidence that majors that provide general skills such as English, social sciences, and liberal arts ('non-STEM' majors by my definition) tend to have higher occupational skill mismatch; they also find that higher self-reported mismatch is associated with lower wages, although the author acknowledges that there could be selection on ability (e.g. low ability leads to higher likelihood of mismatch and also lower wages). Kinsler and Pavan (2015) develop a structural model of college major choice, using SAT scores and college GPA as measures of ability. They not only find that science and business majors are more likely to have a job in a related field, but also that there is a huge premium for relatedness: science majors working in jobs unrelated to their field of study earn 30% lower wages than those that work in related fields."}, {"section_title": "Robst (2007) and", "text": "These results suggest that it is important to provide some sort of model of labor market conditions and the process that matches college graduates of particular majors to their jobs. In practice, this can be done by adding occupational sector controls in the wage process, to account for varying rents by occupational sector, as well as the fact that certain occupations will be more related to certain majors."}, {"section_title": "My Contribution to the Literature", "text": "To conclude the background section, I outline the key characteristics of my model and how it differs from those existing in literature. While I do not explicitly model the accumulation of course credits as in Hendricks et al. (2017) or Hsu (2017), I place structural restrictions on their choice set of majors each year, rather than imposing a reduced-form switching cost as in much of the literature of college major choice, such as Arcidiacono (2004) or . These restrictions on choices are meant to be reflective of the course credit constraints that students aiming to graduate in 4 years will face. I believe the particular structure of college major requirements, particularly between STEM and non-STEM majors, can go a long way in explaining the asymmetric attrition from STEM majors. Furthermore, a key mechanism of my model is the importance of unweighted GPA rather than major-specific GPA in affecting student graduation as well as post-graduation labor market outcomes. 7 While the first option has been considered in Stinebrickner and Stinebrickner (2014) through forced failout, the second has not been given as much consideration in the literature. The relevance of unweighted GPA along a much more relevant margin (firms filtering based off of GPA) rationalizes the student elasticities with respect to grades across majors (as shown in Butcher et al. 2014) in a way that differs from much of the literature, which lets grades enter in preferences only as a proxy of effort or the 'psychic cost' of taking courses in a particular major (see . Finally, my model embeds core elements of existing models of major choice in the literature, such as learning about ability. Using the specification of Arcidiacono et al. (2016) for grades allows me to decompose the error term of realized college grades with respect to observable high school characteristics such as SAT scores into permanent unobserved ability (which the student actually 'learns' about) and noise. Unlike Arcidiacono et al. (2016), since I allow grades directly affect a student's payoffs through failout or wage offers, the presence of noise (and hence randomness) in grades may induce students to switch majors independent of learning about ability. I will discuss these mechanisms in detail in the following section."}, {"section_title": "The Option Value of Initially Majoring in STEM", "text": "There are three main conditions that I will use to motivate my model of switching out of STEM. Note that these are sufficient, but not necessary conditions for switching behavior to occur for an expected lifetime-earnings maximizing agent. I believe these conditions are satisfied in reality, and will generate switching behavior independent of any learning about ability, which has already been established in the literature as a mechanism for switching. 1. Switching into STEM majors is significantly harder than switching out of STEM majors, for example due to more stringent course requirements for STEM majors. 2. There are differential grading standards between the two major types. Furthermore, grades are uncertain, even after controlling for student ability. 3. There are discontinuities in the wage equation with respect to cumulative GPA. The major a student graduates in, not necessarily the one that they started out in, has an effect on earnings. 8 That differential course switching costs generates an option value to initially declaring STEM should be apparent. If a student is unsure of whether they wish to continue to graduate in STEM or non-STEM (e.g. due to taste uncertainty or ability uncertainty), then they should, all else equal, start in the major that is more difficult to switch into, in order to minimize the switching cost should they decide to switch (Altonji et al. 2016). Switching into STEM is generally more costly since STEM majors are typically tracked and have more course requirements than a non-STEM major (for example, engineering typically requires advanced mathematics and science courses). Likewise, while many STEM courses can be used to satisfy the general education/distributional requirements of a non-STEM major, the reverse is generally not true. Thus, in the presence of resolution of uncertainty by the student, we should expect there to be more switching out of STEM rather than non-STEM. The second and third conditions place restrictions on the functional form of the wage equation. These conditions are satisfied in the particular case of minimum GPA requirements to graduate (as well as uncertainty over grades): the payoff of a college education in terms of wages undergoes a discontinuity at the failout threshold. These are also satisfied if firms filter applicants based off of GPA cutoffs. To make this clear, consider a student that is currently majoring in STEM with a cumulative GPA of 2.0 at the start of their junior year, that needs an final GPA of 2.0 at the end of their senior year to graduate. They must now choose between declaring and committing to a major in STEM or non-STEM (assume both are feasible options). Assume that there is no uncertainty over their ability and expected grade in each major, but that there is still uncertainty over their final grade (e.g. due to measurement error in tests with respect to true knowledge of the material, or simply luck). For simplicity, let the average of their grades received in their junior and senior years be distributed where µ N > µ S reflects the easier grading standards in non-STEM (N) vs. STEM (S), with the same magnitude of grading noise σ 2 . Furthermore, assume a student receives lifetime earnings that only depend on their graduating major (and not on their grades directly), given by w S , w N , and normalized to 0 if they fail out. Then, even if there is a premium for graduating in STEM vs. non-STEM, it may be expected lifetime income maximizing for the student to switch out if the STEM wage premium is counterbalanced by the lower probability of graduation. In this case, a student switches to non-STEM if where Φ(x) is the standard normal cdf. There can be welfare changes with respect to grades outside of failing out of college. When firms consider hiring someone out of college, one piece of information they can use is the student's GPA, whether it is directly reported by the student or imputed by the firm from an omission in a form of 'information unraveling'. In particular, I suggest that in evaluating an applicant, firms consider the quality of the school/program, the major that the student graduated with, and the unweighted GPA, along with other researcher-unobservable measures of worker quality revealed during the hiring process, such as interview performance. The school's identity (and hence quality), as well as major should be readily observed when considering a generic resume submitted by a college student. I claim further that firms roughly do not know the full course history of the student (specifically, whether they initially majored in a different field), and in particular, their only signal of academic performance is an unweighted GPA. This focus on unweighted GPA as compared to major-specific GPA once again relies on the Wellesley policy's effects for suggestive evidence: if firms were well-informed on Wellesley's grading policies (or just compared grades within majors from Wellesley), they would presumably incorporate the major-heterogeneous deflation when evaluating applicant's grades in non-STEM courses, which would not affect the overall welfare of a prospective non-STEM major. In any case, if firms filter based off of unweighted GPA, there are now potentially a multitude of GPA cutoffs that generate discontinuities in the returns to a college degree, outside of the failout condition. In short, the second and third conditions force a student to consider \"whether it is better to get an A in a less-rigorous major, or a B in a more rigorous major?\", in addition to the question of \"will my grades be high enough so that I can successfully graduate?\" Given that the average GPA of a college graduate in 2013 is around 3.1 GPA points (Rojstaczer 2016), the fraction of a letter grade difference in average grades in STEM and non-STEM might be enough to motivate students to switch majors, especially if firms filter applicants by GPA using 3.0 as a cutoff. 9 "}, {"section_title": "Data", "text": "Before I go into the full model, I will briefly discuss the datasets I've used. I've already conducted a preliminary analysis of the structural model using the National Longitudinal Survey of Freshmen (NLSF). 10 The NLSF consists of in the fall of 1999 across a number of selective institutions, with a comparative oversampling of under-represented minorities, so that the racial composition of the sample is split roughly into a quarter of each of African American, white, Asian, and Latino. This dataset is effectively transcript data, containing information about dropout, major selection, and grades. One major advantage of this dataset is its ease of use and the richness of its transcript information. The major shortcoming of this dataset is the lack of post-graduation wage outcomes. In my first attempt at this model, I merged the NLSF with wage data from the Hamilton Project, an initiative of the Brookings Institution that compiles data from the American Community Survey which provides lifetime earnings information for individuals as a function of their college major. While this merging of separate datasets does not allow for individual heterogeneity in outcomes or the endogeneity of college major choice and wages, it does provide some useful context on the magnitudes of the structural coefficients. I am currently using the National Longitudinal Survey of Youth 1997 (NLSY97), a na- 9 A related question to that of choosing between a 'rigorous B' or an 'easy A' in terms of majors is the one of college choice: a student may need to choose between expected worse performance at a more selective institution, or expected better performance at a less selective one. Despite its common themes, the college choice question is significantly harder to answer than the one for major choice, since major switchers are easily observed in most data on college students, whereas switchers between two colleges are much rarer (see Arcidiacono et al. 2012 for an example using the University of California system). 10 See the NLSF website at http://nlsf.princeton.edu for more information about the dataset. tionally representative sample of approximately 9,000 youths between 12-16 years old as of December 31, 1996. This dataset is useful in that it contains both schooling outcomes as well as labor market outcomes (typically data only contains one or the other), so I can jointly estimate both the wage equation as well as the college decision-making process. In particular, in 2012-2013, post-secondary transcript data was requested for every indivdiual that reported attending a post-secondary institution (both 2 and 4-year colleges); in the end transcripts were received for 5,855 students, of which there are 1,398 students that report obtaining a bachelor's degree. Of these individuals, only 476 graduate in 4 consecutive years, so I will need to supplement my dataset with individuals that leave and return, but still graduate over 4 years in school. While there is evidence that students that interrupt their education are less likely to graduate, even conditional on return (DesJardins et al. 2006), it is necessary to include these returning students for sample size reasons. Doing so allows me to increase my sample size to 722 individuals, although only 322 of them are males."}, {"section_title": "Model", "text": ""}, {"section_title": "Overview", "text": "I present a dynamic discrete choice model of college major choice and occupational choice over an agent's lifetime. An agent is a lifetime utility maximizer, and I assume lifetime utility can be decomposed into an additive sum of discounted flow utilities, where these flow utilities depend on income earned in the period (or tuition paid), as well as the student's choice of major (if they are in college) or their choice of occupational sector. Some of these flow components will vary depending on the agent's unobserved (to the econometrician, but not the agent) preferences. I will describe an agent's decisions separately in college and the work force, as they are roughly separable in my model."}, {"section_title": "Agent Characteristics", "text": "Agents are endowed with two permanent characteristics: an ability vector ) over non-STEM and STEM majors as well as various occupational sectors L j ; and a vector of preferences θ i over the same majors and occupational sectors. Agents know their preferences perfectly at the start of the model, but they must learn about their ability in various majors and occupational sectors over time. Assume students know their preferences over majors and occupational sectors perfectly at the time of matriculation into college; this is unobservable to the researcher so I model students as coming in three discrete types θ 1 , θ 2 , θ 3 (with corresponding population proportions π 1 , π 2 , π 3 ) a la Heckman and Singer (1984). These discrete types will have different flow utilities for each major and occupational sector. Roughly, I want to see these types represent students that prefer STEM majors, non-STEM majors, or no education whatsoever. What would be nice is to see that the types of agents that prefer certain majors also prefer the occupations that are typically associated with graduates of those majors. Students are uncertain over their innate ability endowment. I will use the same model of unobserved ability as . Assume student ability endowments are jointly distributed multivariate normal in the student population: N (0, Σ). Importantly, Σ need not be diagonal: the off-diagonal terms are positive if there is correlation between grades (e.g. studiousness) or occupational sector ability (e.g. diligence). Students enter their first year with initial beliefs corresponding to the population distribution of ability. As they receive grades, they update their beliefs about their distribution of ability through Bayes' Rule. Insofar as off-diagonal terms are non-negative, students will also learn about the other components of ability. Furthermore, while in the labor force, agents receive signals about their abilities in various occupational sectors through their realized wages: under a competitive markets assumption that agents are paid according to their realized productivity in that time period, wage shocks will provide signals of ability in the respective occupational sector. Agents must make choices in each time period, where each period is yearly. These decisions are made over college major if the student is in college, or occupational sector. I now discuss both environments."}, {"section_title": "College Environment", "text": "Students can choose to attend college, or directly enter the labor force out of high school. I assume that students can only attend college for 4 years, and cannot re-enter college if they have dropped out. The restriction to 4 years allows me to add specific structural restrictions on student's college major choice, while the inability to re-enter college greatly simplifies my modeling of student decision-making after graduating from college. Furthermore, I do not give students the option for further education or pursuing an advanced degree after undergraduate college, as this complicates the calculation of a student's value functions while in college, since graduating from a four-year college is a typical requirement for an advanced degree. While in college, students have the option of choosing between two types of majors: STEM and non-STEM, and of dropping out. They make this decision 4 times, corresponding to the start of each year of college. After making their decision, the student receives a grade in the major they chose, assuming they did not drop out. After college, students enter the work force and choose between occupational sectors. Students are uncertain over their grades in each major and must take expectations over their grade realizations (as well as idiosyncratic utility shocks). I do not allow for human capital accumulation in college: a college dropout earns the same as a high school graduate. While this is somewhat unrealistic, given that the median college dropout (no associate's degree) makes about 25% more than a high school graduate (Hamilton Project 2014), I do not think this is a major contribution to the dynamics of my model, and I believe it will be straightforward to adjust the wage payoffs to allow for college dropouts to make more than high school graduates in a later version of the model. There are income returns to graduating from college in various majors with certain grades. A student must balance the tuition costs and flow utilities of attending college with the change in occupational opportunities and wages available after graduation."}, {"section_title": "Course/Major Restrictions", "text": "Recall that students make decisions over enrolling in majors or dropping out, then they receive a grade in their chosen major if they did not drop out. Dropping out is a terminal state: students cannot re-enroll and must enter the labor force afterwards. While students always have the option to drop out, there are various restrictions on their choices or payoffs during their time in college. Label time from t = 1 to t = 4 corresponding to the start of each of the four years of college for an undergraduate. First is the fail out condition: in order to receive a diploma at the end of time period 4 (or just prior to t = 5), a student must have a cumulative GPA of at least 2.0. 11 To the extent that having a diploma in a certain major confers a wage premium in the labor market, students that fail out will effectively be equivalent to college dropouts or students that only have a high school diploma. At t = 3, students must declare a major {S, N }. Whichever major they declare at t = 3 is the only major available to them at t = 4. However, in order to declare STEM at t = 3, a student must have taken STEM courses in at least one of t = 1 or t = 2. This is essentially a STEM course requirement and a structural representation of asymmetric major-switching costs. There is no such friction for non-STEM at t = 3: any student can declare non-STEM at t = 3 so long as they have not dropped out already. This course requirement friction highlights the fact that while many upper level STEM courses such as engineering have very specific requirements such as calculus or physics, non-STEM courses are less demanding. There is no restriction on major choices at t = 1, 2. Students may decide to drop out or switch majors depending on the information revealed by their grades."}, {"section_title": "Grades", "text": "Students receive a grade each year. Grades are a function of the major m, year of college t, and student i's observable and unobservable ability. I assume the following form of the grade production function: is a set of high school characteristics of the student, such as SAT scores, parent's education, and high school GPA. These are observed to the econometrician as well as the individual, so I am assuming that there is no private information relating to academic performance that is known to the individual but not the econometrician. Major-specific ability (or match quality) is given by the latent ability endowment A m i and is permanent. τ m t (with normalization τ m 1 = 0 for both m) captures the general tendency for grades to increase as students progress (whether this is student's becoming more effective, grade inflation across years, or selection/composition effects is not stated). Finally, m it ∼ N (0, σ 2 m ) is a majorspecific variability in grades. Note that since a student picks between one of two mutually students must have a minimum GPA of 1.67 at the end of their sophomore year, and 2.0 in the following years (Stinebrickner and Stinebrickner 2014). In Stinebrickner and Stinebrickner, grades would be modeled using a 'barrier option' rather than as a 'binary option' at graduation as in my model. exclusive majors each year, we will only observe grades for one of the two options; this selection must be accounted for in our estimation strategy. 12 The relevant term in the wage equation is the average of the grades received by the individual, regardless of the major. So if an individual's major choice at time t is denoted by d it , we have their cumulative GPA G i as Note that here I assume that students take the same number of courses each year, since otherwise their cumulative GPA would not be a simple average of their yearly grades. This is not an innocuous assumption, but it is consistent with how the literature treats grades (see e.g. Arcidiacono (2004) or Arcidiacono et al. (2016))."}, {"section_title": "Labor Market and Wages", "text": "While in the labor market, a student can choose amongst j = 1, 2..., J occupations in each year, including home production. In each period, they receive a wage payoff, an occupationalsector specific flow utility, and accumulate human capital in the occupational sector they chose. The wage process for individual i in sector j at time t is as follows: where e j it is the number of years of experience an individual has in the specific occupational sector j, β j represents the log-rental price of skills in sector j, f (•) models the secular returns to experience, G i and M i refer to an individual's cumulative GPA and dummy for major (STEM/non-STEM), A j i is the individual's occupational-sector specific ability, and j it is a technology shock. Students that drop out of college receive wages from an analogous wage equation, but missing the G i and M i terms. A few features of this model should be highlighted. There is no depreciation in human capital over time, since e j it accumulates but does not depend on which time periods t the experience accumulated. Individuals have a permanent occupation-specific match term in A j i , which cannot change over time to reflect shifting proficiency in various occupations. Finally, as will be discussed in the learning section, I will assume the technology shocks j it are i.i.d. normal, allowing for individuals to learn about their occupation-specific match A j i over time via their wages. This necessarily assumes a competitive labor market environment where individual wages equal the individual's productivity in each year."}, {"section_title": "Learning", "text": "I assume that agents know the true coefficients in the grade-generating equation 2as well as the wage-generating equation (4). Then while in school as well as on the work force, they receive information about their ability endowments over time. When in school, their signal S m it for their unobserved ability A m i is given by the difference in their grades and the other controls: Similarly, while in the workforce, their signal is given by: By the normality of idiosyncratic errors as well as the population distribution of ability, the agent's posterior beliefs of ability are also normal. Explicitly, define V it to be a (J + 2) × (J + 2) matrix that is 0 everywhere except for the diagonal entry corresponding to the major/occupational sector chosen in period t; at that entry, the value is 1/σ 2 m (or 1/σ 2 j in the labor market), the reciprocal of the variance of the major's grade noise (or yearly technology shock). Define the signal vector S it to be a (J + 2) × 1 vector where the entry corresponding to the major or sector chosen is given by the signal as defined in equation (5) or (6), and the other entries are 0. Then the posterior beliefs on ability for individual i after their choice at time t and receiving their grade or wage is multivariate normal, with mean and covariance"}, {"section_title": "Preferences and Flow Utilities", "text": "While in college, students receive flow utilities that depend on their preferences for major, ability, tuition, and an idiosyncratic Type I extreme-value noise term. The flow utility of either of the two college major options m for a student of type θ is where c T it is the cost of tuition and lost wages from going to school, c m (θ) is the 'preference' cost of going to a major that varies by the individual's unobserved type, and imt is a majortime-specific preference shock. In my case, I define c T it to be equal to the student's reported tuition/expenses from going to college, minus all fellowships/grants from the university or government, plus $15, 000 for lost wages (the average yearly salary of a high school graduate). The leading α p is necessary since I will normalize the variance of the Type I idiosyncratic preference shocks. While working, the flow utilities are an additive function of the expected wages and the individual's preferences over occupational sector. The agent can work until the age of 65; since in my sample individuals may enter college at different ages, this means the terminal time period may vary by individual."}, {"section_title": "Identification", "text": "I now discuss identification of the grade and wage equations, as well as the flow utility parameters. Given that grades are only observed for one of the two majors that students can be in at any given year (and not the other), there could arise a selection issue since the student's choice of major depends on their ability (through both the flow utilities as well as the expected grade, which influences the terminal payoff wage). However, key to identification is the modeling assumption that the flow utilities only depend on expected ability at the start of the period (when making a decision over major/dropout), and the assumption that students use Bayes' Rule as they accumulate grade signals. Thus, controlling for the student's expected ability, a known function of the observed grades, at the time of the decision identifies all of the grade equation coefficients. Indeed, for individual i, their exante belief of their grade at time t in major m (conditional on their past signals up to their t − 1 grade, suppressed below for clarity): where ν m it ∼ N (0, σ 2 m + Σ t−1 (A m i )), with σ 2 m the idiosyncratic variance in grades for major m, and µ t−1 (A m i ) and Σ t−1 (A m i ) are the posterior expected value and variance in their beliefs of ability A m after receiving grades in t − 1. Thus, OLS gives consistent estimates of all of the grade parameters, once I control for posterior expected ability as well. Similarly, the wage equation parameters are identified in a 'fixed-effect' manner for the same individual. If we compare two individuals in the same occupational sector over time, the sum of the yearly sector-specific dummy and sector rent are identified (year t + β j ), assuming we net out f (e j it ) the wage returns to experience; this can be done in practice by assigning a fixed functional form to f (•), such as a quadratic with intercept of 0, as in Keane and Wolpin (1997). Then by differencing the individual's wage trajectory over time, and hence netting out permanent ability A j i , we can estimate β 1 and β 2 . The covariance matrix of unobserved ability is identified through the history of grades and sector-specific wages for each individual. In particular, the off-diagonal elements are identified through correlations in grades for individuals that switch majors. The unobserved individual types θ are identified through individuals that make decisions that are not lifetime earnings maximizing: students that decide to dropout despite having good grades are likely to be of the type that obtains low flow utilities from attending school, and students that pick certain majors despite having higher predicted ability in the other one (net of wage outcomes) likely have high flow utilities associated with that major. Finally, the flow utility parameters are then identified through the different probabilities of individuals choosing particular majors or dropping out. There is the usual normalization that is required, which is by setting the dropout option to have flow utilities of 0 in each period, and fixing the variance of the Type I extreme value error (Gumbel with β=1)."}, {"section_title": "Estimation", "text": "I estimate the model by maximum likelihood. Likelihood contributions come from the agent's decisions, as well as their grades. I will show that due to the structural form of the model, I can separately estimate the grade equation in a first-step, then use those parameters directly in the dynamic discrete choice model."}, {"section_title": "Additive Separability over Wages, Grades, and Decisions", "text": "I will now show that the likelihood expression is additively separable over wages, grades, and decisions, allowing me to solve the grade and wage equations in a first step, and then plugging in those values into a finite horizon dynamic program (the student's college decisions). Key to additive separability to the model is the assumption that all of the idiosyncratic shocks are mutually and serially uncorrelated. These shocks include the normally distributed major-specific grade shocks m it as well as the Type I extreme value shocks to the individual's flow utilities. From here, I will show that the parameters governing the wages and grades can be separately estimated from the flow utility parameters and unobserved preference types. We will need to consider how to jointly maximize the likelihood for a given student i over their grades and decisions while in college. The overall likelihood contribution of an individual i is given by a three-dimensional integral over their unobserved ability endowment A i and their unobserved type θ r (all of this is conditional on their fixed characteristics X HS i ): where f (A i , θ r ) = f (A i )π r is the joint pdf of the unobserved ability distribution (pdf M V N (0, Σ)) and unobserved permanent type (pmf (π r ) r ). I've dropped the major-specific superscript m on grades; it is implicit that the grades received are the realized grades, rather than the counterfactual grades if the student dropped out of college or took a different major. Furthermore, we can split the joint pdf into the product of the respective density/mass functions over ability and type since I assume ability and preference type are independent. A student's grades do not depend on unobserved type θ r except through the student's decisions. Conversely, a student's schooling decisions only depend on ability through their history of grades, although they are directly affected by the type and its corresponding flow utilities. Thus we can split the likelihood contributions over decisions d it as well as grades G it in the following manner: (15) where I use the fact that decisions only depend on unobserved ability through the signals in the form of grades, as well as the independence of grades with respect to unobserved type. The likelihood of each decision conditioned on grades can be broken down further into a set of sequential likelihoods given past decisions and grades, i.e. the choice probabilities from a dynamic discrete choice model: The contribution from grades conditional on ability A i is given by normal pdfs of the grades conditional on student i's true ability and the major choice, from the grade generating equation 2: Finally, taking the logarithms of these expressions generates additive separability over grades and decisions, meaning that I can estimate the grade equation parameters and the dynamic decision model separately. Of course, I do not have additive separability of the decision likelihoods and the unobserved type probabilities π r , so I will need to estimate them using the EM algorithm. The estimation proceeds as follows: 1. Estimate the wage parameters β directly by OLS (or take them as given). 2. Estimate the grade parameters γ as well as the unobserved ability covariance Σ using the EM algorithm in lieu of direct integration over unobserved ability. We now know all of the relevant parameters in the dynamic discrete choice model, except for the unobserved type and flow parameters. 3. Estimate the flow utility parameters α m , α p , and c P (θ) and unobserved type probabilities π r using the EM algorithm to iterate over unobserved types."}, {"section_title": "Estimating the Grade and Wage Parameters", "text": "To estimate the grade parameters γ, wage parameters β, as well as the population distribution of unobserved ability Σ, I will use the EM algorithm in lieu of integrating out over the distribution of abilities and maximizing that likelihood directly. In what follows, I just show the case for grades; since wages also have a similar signal structure to grades, the extension to include wages is straightforward. I start with an assumed distribution of A i , i.e. an assumed covariance matrix Σ, and an initial estimate of β, which I set using OLS of grades on observables without any corrections for unobserved ability. Then, I will iterate between the E and M steps as follows: 1. E-step: For iteration k of the EM algorithm, consider individual i. For this individual, obtain the 'final' posterior distribution of ability, which is N (µ k i , Σ k i ) after all of their grade signals (up to 4) are taken into account, using Bayes' rule (Eqns. 7, 8). These grade signals will clearly depend on the grade parameters γ k used to estimate them, as well as the current iteration's assumed population distribution of ability Σ k . Then, update the population distribution's covariance according to the following rule: 2. M-step: Maximize the expected log-likelihood of the grades over the set of potential grade parameters, conditional on the individual's posterior distribution after observing all of their grade signals µ k+1 i , Σ k+1 i (i.e. applying Bayes' rule using the population Σ k+1 just estimated in the E-step, for each inividual i's ability signals). In the below expression, assume we have a full set of 4 grades, i.e. the student did not drop out; otherwise, we just shorten the likelihood product to be over the observed grades. . This is clearly additively separable over each of the grades. Now, consider the integral over one particular grade and simplify: where Σ k+1 i,mm , µ k+1 i,mm are the elements corresponding to the major m diagonal element of the posterior covariance, and major m posterior mean, respectively. To maximize this likelihood over the grade parameters (γ, τ ) involves minimizing (G m it − X HS m γ m − γ 0 m − τ m t −µ k+1 i,mm ) 2 , i.e. OLS with the posterior expected ability as the correction term. These are the new (γ k+1 , τ k+1 ). From here, taking the first-order condition with respect to σ 2 m yields our likelihood maximizing estimate of the major-specific idiosyncratic variance: Since this idiosyncratic variance is the same for all individuals that ever major in m, we will obtain σ 2,k+1 m for m ∈ {ST EM, nonST EM } by averaging the above expression over all observations of grades m, over all individuals i: (22) I then repeat the algorithm by using these new parameter estimates on the grade equation to update my population covariance estimate, and so forth until the parameters converge."}, {"section_title": "Estimating the Flow Utilities", "text": "Now that the grade and wage coefficients are specified, we estimate the flow utility values by maximizing the likelihood of the observed choices by the individual. I first describe the case with just one type of individual (i.e. no unobserved heterogeneity over flow utilities), then the EM algorithm variant in the presence of permanent unobserved heterogeneity."}, {"section_title": "No Unobserved Heterogeneity", "text": "Since the individual's goal is to maximize their flow utilities, and the preference shocks over the individual's decision at any point in time t is given by a Type I extreme value random variable, the likelihood contribution of a (feasible) decision d * by inividual i is given by the standard logistic form: where D(Ω it ) refers to the available choices to individual i at time t given their history of decisions Ω it (taking into account the STEM major restriction at t = 3 as well as major commitment restriction at t = 4), u it refers to the conditional value function, i.e. the flow utility net of the Type I preference shock at the time of the decision. Finally, the expected future value E[V id,t+1 |Ω it , d] is the expectation taken over idiosyncratic grade shocks (and the resulting Bayesian updating of ability), as well as the preference shocks, conditional on the decision d and the preceding history Ω it . In particular, because we assume Type I extreme value preference shocks, we can simplify the expectation to be only over the grade G it to be realized that year: where γ is the Euler-Mascheroni constant, approximately 0.57721, and the state at t + 1 includes the decision at t as well as the realized grade Ω i,t+1 = (Ω i,t+1 , d, G it ). I've subscripted the expectation operator with t to highlight that it also includes the individual's posterior ability, conditional on their grade signals, which affects their flow utilities while in college as well as the terminal payoff. In practice, to estimate the expectation over future grades, I generate multiple quantiles from a normal distribution over the individual's normal uncertainty over grades, as outlined in Eqn. 12. As can be seen here, calculating the conditional value function for an individual prior to retirement requires calculating the conditional value functions for every period afterwards; given the computational difficulty I had with a 4-period model of just college major choice, including occupational sector choices makes the problem practically impossible using fullsolution methods. I will have to lean on conditional-choice probability (CCP) methods to feasibly estimate this model, and am working on reformulating my estimation strategy in a 2-step process using CCPs."}, {"section_title": "Unobserved Heterogeneity Over Preferences and the EM Algorithm", "text": "I reapply the EM algorithm over the three types of individuals θ 1 , θ 2 , θ 3 , using the method outlined in Arcidiacono and Jones (2003), but explicitly discussed in Arcidiacono and Miller (2011) (although the latter paper outlines a different estimation strategy of these mixture models). Recall that the corresponding population probabilities of being types θ r are given by π r ., and that we are trying to estimate the flow parameters α = (α p , α N , α S ) as well as three type-specific cost parameters c P r = c P (θ r ), r = 1, 2, 3. Then, the maximum likelihood estimator over these parameters (α, c P r , π r ) is given by the maximizers of the sum of logs of weighted likelihoods: It is clear in this case that we do not have additive separability over π r and the decision likelihoods L idt (α, c P r ), so we instead use the EM algorithm as follows: 1. E-step: For iteration k, and individual i, their posterior probability of being type r is given by Bayes' rule, using the prior iteration's estimates of π k r as well as the parameters: Then, update the population type distribution parameters by the average over all N individual posterior probabilities of being that type: 2. M-step: Now, re-solve for the flow parameters by maximizing: (α k+1 , c P,k+1 r ) = argmax (α,c P r ) i r t q k+1 ir log(L idt (α, c P r )) Note that the M-step essentially takes the posterior probability parameters as given, separating the population proportions π r from the flow parameters. I then repeat the EM algorithm until convergence of the parameters."}, {"section_title": "Further Work", "text": "My immediate concerns are finishing the formulation of my model using a CCP framework and applying it to the NLSY97 dataset. As stated in the estimation section, this model is not practically solvable using a naive full-solution method due to computational costs, so I will need to use CCP methods. While conceptually this is not too much extra work (the value functions, flow utilities, and any other 'structural' components of the model are left untouched), this will require work on 1) actually implementing CCP estimation, 2) interpretation of results, since full-solution methods have a straightforward interpretation of results and counterfactuals, whereas the interpretation of CCP results are a bit murkier. I welcome any feedback and suggestions on implementing and interpreting CCP results. Finally, I am also considering a second dataset, the Ohio Longitudinal Data Archive (OLDA), available at http://oerc.osu.edu/longitudinal-data. This dataset contains state administrative data on Ohio residents that attended public education and worked in Ohio. Functionally, this is equivalent to the NLSY97 in that it contains transcript data as well as wage data. However, since it is geographically restricted to one state, it is likely that there is significantly less nuisance variation than in the NLSY97 due to school quality as well as local labor conditions, both of which weaken the identification of parameters in the wage equation (and possibly the grade equation as well, to the extent that different schools have different grading standards). I will submit a request to use the data, although in the meantime I will continue using the NLSY97."}]