[{"section_title": "Abstract", "text": "Most studies evaluating Alzheimer's disease (AD) biomarkers longitudinally have studied patients with mild cognitive impairment (MCI) who progress to AD; data on normal subjects are scarce. We studied which biomarkers best predict cognitive decline on the Alzheimer's Disease Assessment Scale-Cognitive Subscale (ADAS-Cog) among those with normal cognition at baseline, and derived cut points to predict decline. We studied 191 subjects in the Alzheimer's Disease Neuroimaging Initiative (ADNI) who had normal cognition at baseline, 2 + visits (mean follow-up 3.1 years), and data on neuropsychological tests, cerebrospinal fluid (CSF) biomarkers, and structural MRI. We used repeated measures linear regression of log ADAS-Cog on age, race, gender, education, APOE4 status, baseline biomarker values, and follow-up time; an interaction between biomarker and time assessed predictive power. Neuropsychological tests did not significantly predict ADAS-Cog decline, while both MRI variables and CSF biomarkers did; CSF markers were the strongest predictors. Optimal cut points for baseline CSF markers to distinguish decliners were < 220 pg/ml (A␤ 42 ), ≥61 pg/ml (t-tau), ≥21 pg/ml (p-tau), ≥0.31 (t-tau/A␤ 42 ), and ≥0.10 (ptau/A␤ 42 ). For progression to MCI/AD (n = 28), the best markers were t-tau, t-tau/A␤ 42 , and p-tau/A␤ 42 , with optimal cut points of 58, 0.31, and 0.08, respectively. The optimal cut points across all markers and cut points predicted decline in ADAS-Cog, as well as transition to MCI, with a 65% accuracy. Our findings support current models of AD progression and suggest it is feasible to establish biomarker criteria to predict cognitive decline in individuals with normal cognition. Larger studies will be needed to more accurately characterize optimal cut points."}, {"section_title": "INTRODUCTION", "text": "There is increasing consensus among Alzheimer's disease (AD) investigators that clinical dementia represents a late stage of illness emerging many years after the first development of pathological changes. Based on a growing body of biomarker evidence, Jack et al. [1] proposed a model for the temporal sequence of pathological and clinical changes, and a recent revision of this model incorporates additional new evidence [2] . The model establishes a hypothetical framework for biomarker changes in the course of disease, relying on results from several studies including the Alzheimer's Disease Neuroimaging Initiative (ADNI). These longitudinal studies have established the utility of cerebrospinal fluid (CSF) and neuroimaging measures for identifying the presence of AD pathology and for predicting the progression from mild cognitive impairment (MCI) to AD dementia [3, 4] .\nImproving the diagnostic accuracy for AD and establishing the etiological diagnosis for MCI represent important advances, but there is an increasingly urgent need to develop predictors of AD during presymptomatic stages. Failures of recent latestage trials of disease-modifying drugs targeting the amyloid-␤ peptide (A␤ 42 ) may have been due to their application too late in the course of disease. Neuroimaging [4] [5] [6] , CSF [7, 8] , and pathological studies [9] [10] [11] [12] suggest that changes in A␤ 42 occur very early in the evolution of AD, and anti-A␤ 42 therapeutics may not be effective in symptomatic stages of disease when A␤ 42 accumulation has already plateaued.\nUnfortunately, there is a paucity of data regarding biomarker changes in older adults with normal cognition at baseline. Gustafson et al. [13] and Stomrud et al. [14] studied small numbers of non-demented subjects (n = 55 and n = 57, respectively), and found that A␤ 42 and tau predicted decline in the Mini-Mental Status Exam (MMSE) and clinically significant memory impairment over a 10-year and 3-year period, respectively. Jack et al. [15] studied 116 ADNI subjects with normal cognition at baseline over a one-year follow-up period and found an increase in t-tau among cognitively normal individuals but no changes in CSF A␤ 42 or hippocampal volume. Lo et al. [16] also studied cognitively normal ADNI participants at baseline, but data on CSF biomarkers was limited to 36 normal subjects with a 3-year maximum follow-up. These studies support the concept of stage-specific biomarker changes, but models have not been developed to predict future decline among cognitively normal individuals in relation to biomarker values.\nIn the current study, we examined the potential for baseline values of neuropsychological tests, CSF biomarkers, and brain volumes to predict decline among individuals with normal cognition at baseline. We studied 191 ADNI subjects who were followed for a mean of 3.1 years, and had complete data on cognitive tests, neuroimaging, and CSF biomarkers. We determined which of these indices individually predicted decline on the Alzheimer's Disease Assessment Scale-Cognitive Subscale (ADAS-Cog), and estimated cut points for the biomarkers that best predicted cognitive decline."}, {"section_title": "METHODS", "text": "Data used in the preparation of this article were obtained from the ADNI database (http://adni.loni. usc.edu/). The ADNI was launched in 2003 by the National Institute on Aging (NIA), the National Institute of Biomedical Imaging and Bioengineering (NIBIB), the Food and Drug Administration (FDA), private pharmaceutical companies and non-profit organizations, as a $60 million, 5-year public-private partnership. The primary goal of ADNI has been to test whether serial magnetic resonance imaging (MRI), positron emission tomography, other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of MCI and early AD. Determination of sensitive and specific markers of very early AD progression is intended to aid researchers and clinicians to develop new treatments and monitor their effectiveness, as well as lessen the time and cost of clinical trials.\nThe Principal Investigator of this initiative is Michael W. Weiner, MD, VA Medical Center and University of California-San Francisco. ADNI is the result of efforts of many co-investigators from a broad range of academic institutions and private corporations, and subjects have been recruited from over 50 sites across the U.S. and Canada. The initial goal of ADNI was to recruit 800 subjects but ADNI has been followed by ADNI-GO and ADNI-2. To date these three protocols have recruited over 1,500 adults, ages 55 to 90, to participate in the research, consisting of cognitively normal older individuals, people with early or late MCI, and people with early AD. The follow up duration of each group is specified in the protocols for ADNI-1, ADNI-2, and ADNI-GO. Subjects originally recruited for ADNI-1 and ADNI-GO had the option to be followed in ADNI-2. For up-to-date information, see http://www.adni-info.org/.\nAll ADNI CSF samples are collected according to a standard protocol (http://www.adni-info.org/ Scientists/Pdfs/CSF Biomarker Test Instr.pdf) and are then sent to a central location for analysis (ADNI Biomarker Core, University of Pennsylvania Medical School) for analysis, using methods described in the literature [17] . Test-retest R-squares have been high at the ADNI Biomarker Core, typically on the order of 90% or higher, depending on the marker (http://www. alz.org/research/funding/partnerships/2013 meeting/ 5-biomarkers-core-adni.pdf)\nIn the ADNI database, there were 391 subjects who were cognitively normal at baseline, and had two or more follow-up visits. Of these, 191 had complete data on cognitive tests, APOE status, CSF biomarker concentrations, and brain volumetric measurements at baseline, as well as ADAS-Cog scores over time. These subjects were included in the study ( Table 1) .\nThe cognitive tests for which there were complete data were the MMSE [18] , Trails A and B [19] , Animal Fluency [20] , American National Adult Reading Test [21] , Rey Auditory Verbal Learning Test [22] , Boston Naming Test [23] , and Weschsler Logical Memory [24] . We also included the Functional Activities Questionnaire [25] as a measure of the ability to perform instrumental activities of daily living. Complete or nearly complete data were also available for the CSF markers (A␤ 42 , t-tau, p-tau, t-tau/A␤ 42 , and p-tau/A␤ 42 ). Three persons were missing data on ttau, and these individuals were omitted in analyses of t-tau and the t-tau/A␤ 42 ratio. For brain structure, data were available for total brain volume, ventricular volume, and right and left hippocampal volume. Five persons were missing data on hippocampal volume, and these individuals were omitted in the analyses for that biomarker.\nADAS-Cog is an integer ranging from 0 to 70 [26] ; here we treated it as continuous. The mean score in our sample at baseline was 6.3 (s.d. 3.0). Figure 1 shows the distribution of ADAS-Cog scores at baseline (n = 191). Log[ADAS-Cog] was distributed more normally than ADAS-Cog itself, and this was used as the outcome for regression models. Conversion to MCI was relatively rare during follow-up (28/191, 15%), and we thus preferred a continuous variable as a more sensitive measure of decline than conversion to MCI. However, we also ran supplementary analyses using conversion to MCI as the outcome. We used repeated measures linear regression (PROC MIXED, SAS) of log[ADAS-Cog] on age, race, gender, years of education, APOE4 status, and baseline values of biomarkers (each separately), as well as a continuous variable for time in months (visits were every 6 months until 12 months, and yearly thereafter). The ability of a biomarker to predict decline was assessed by an interaction term between the baseline value of the biomarker and time. We used an exchangeable correlation matrix to account for the association between data points for the same subject. Subjects had a minimum of 2 visits and a maximum of 9 visits (median = 5). Follow-up continued until the last visit in these analyses.\nTo determine optimal cut points for variables which predicted an increase (worsening) of log[ADAS-Cog] over time, we iteratively separated the subjects into two groups using different cut points for the baseline values of each predictor, and ran separate models for each group. We did this until we found the cut point for each biomarker separately which best divided subjects into two groups: an affected group which showed the maximum possible decline during follow-up (always > 12%), while at the same time defining an unaffected group which showed no appreciable (always ≤ 3%) change over follow-up. These cut points were model-based and hence 'adjusted for' or 'averaged over' demographic variables such as gender, age, race, and education, as well as APOE status. An additional search for model-free cut points, that might incorporate more than one predictor, was conducted using a classification tree algorithm, Classification and Regression Trees (CART) [27] , implemented in R [28] . The CART algorithm selects optimal cut points by recursively partitioning the observations to achieve the maximum reduction in the Gini index, a measure of disparity between the predicted and observed values. The CART cut points were not adjusted for demographic covariates; however, we also tried adding dichotomous demographic variables for age, gender, race, and education to the CART trees.\nWe conducted supplementary analyses, using survival analysis (SAS PHREG), in which the outcome was defined as a transition to MCI (n = 25) or AD (n = 3) during follow-up (dichotomous outcome). The same set of predictor variables was used as in the ADAS-Cog analysis. Time in this analysis was followup time. Follow-up in these analyses stopped at last visit, or at time of transition. The predictive value of the baseline biomarker was assessed by its p-value in the model. Optimal cut points for predicting progression to MCI or AD were determined by simple trial and error using cut points suggested by the survival analysis (after dichotomizing biomarkers to maximize the odds ratio for transition to MCI or AD), and also by the use of the same CART algorithm described above. Table 1 provides descriptive variables for the data set. The 191 individuals averaged 3.1 years of follow- Dividing the group into decliners and non-decliners (ADAS-Cog change >0 versus ≤0), 88 (46%) subjects declined over time, while 103 (54%) did not. Based on the model, the predicted increase in ADAS-Cog over three years was 24% (<0.0001) for the decliners, and the predicted decrease among non-decliners was 10% (p = 0.0007). Through follow-up, 163 patients remained classified as cognitively normal while 25 and 3 patients converted to MCI and AD, respectively. Table 2 illustrates results for the basic model with demographic variables at baseline, APOE status, and the variable for time of follow-up. Greater age at baseline, male gender, lower education, and presence of the APOE4 variant predicted higher (worse) ADAS-Cog scores over all follow-up times. Race was not a significant predictor of ADAS-Cog (partly due to the small number of non-whites), but was nevertheless retained in all models. The variable for time reflects change in ADAS-Cog over follow-up. There was a significant worsening over time, reflected in a positive coefficient for the time variable, which was highly significant. Table 3 summarizes those predictors which interacted significantly (at p ≤ 0.05) with the time variable, indicating a significant difference in change over time between those with different baseline levels of these variables. In all cases, the direction of the interaction conformed to what would be expected, i.e., those with lower values of A␤ 42 worsened on ADAS-Cog over time more than those with higher values of A␤ 42 . In general the cognitive tests at baseline did not predict cognitive decline, with the exception of category fluency, which had borderline significance (p = 0.05). Three of four variables for brain structure at baseline all predicted decline, with p-values of about 0.01. The strongest predictors of decline, with the lowest "}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Cognitive test", "text": "Animal Fluency*visit 0.05"}, {"section_title": "Brain volumetric measures", "text": "Whole-brain volume*visit 0.02 L hippocampal volume*visit (n = 186) 0.02 R hippocampal volume*visit (n = 186) 0.008\nCerebrospinal fluid tau*visit (n = 188) 0.04 p-tau*visit 0.006 A␤ 42 *visit 0.0007 tau/A␤ 42 *visit (n = 188) 0.01 p-tau/A␤ 42 *visit 0.003 # These models included an interaction term between the marker and the variable for time. The p value is the p-value of the interaction term. A significant interaction means that the decline over time depends on the level of the baseline value of the biomarker.\np-values for the interaction term, were the CSF biomarkers A␤ 42 , p-tau, and p-tau/A␤ 42 (p = 0.0007, 0.006 and 0.003, respectively). CSF t-tau and t-tau/ A␤ 42 also predicted decline (p = 0.04 and 0.01, respectively) but less robustly than other CSF measures. Table 4 shows the optimal cut points and the predicted change in ADAS-Cog scores over 3 years for different biomarkers, each considered separately. The cut points were chosen to divide subjects into two groups: those whose cognition got worse over followup and those who did not. We defined these two groups as 1) those whose ADAS-Cog scores worsened >10% over time, and 2) those without appreciable change in ADAS-Cog scores over time. An additional search for cut points without using the regression model, and potentially incorporating more than one predictor, was conducted using CART. The search led to the cut points using t-tau and right hippocampal volume, which best predicted decline versus non-decline with 65% accuracy, 74% sensitivity, and 57% specificity. Those with t-tau ≥85 and those with 52 ≤ t-tau <85 and right hippocampal volume <3900 mm 3 were predicted to decline, while those with the converse were predicted to not decline. Adding demographic variables to the cut points did not improve prediction.\nIn supplementary analyses, we modeled the transition to MCI or AD among those normal at baseline. We found that t-tau (p = 0.03), t-tau/A␤ 42 (p = 0.06), and p-tau/A␤ 42 (p = 0.04), were the only significant (or borderline significant) predictors of transition to MCI/AD. We then searched for optimal cut points using the model. The model-based optimal cut points were reasonably similar to the optimal cut points associated with worsening on ADAS-Cog, i.e., ttau ≥ 58, t-tau/A␤ 42 ≥ 0.31, and p-tau/A␤ 42 ≥ 0.08. The rate ratios for those with levels higher than the cut points vs. those below the cut points were 2.88 (p = 0.04), 3.72 (p = 0.007), and 1.57 (p = 0.36), respectively, suggesting that the t-tau/A␤ 42 ratio was the marker for which the most discriminatory cut point could be derived to differentiate persons with greatest risk of transition to MCI or AD. The above results did not change when we omitted the 3 cases in which normal subjects progressed directly to AD. Trying various cut points of t-tau/A␤ 42 (not model-based, without adjusting for demographics), we found that a cut point of t-tau/A␤ 42 ≥ 0.34 was best, predicting transition to MCI with 65% accuracy, 68% sensitivity, and 64% specificity. Using additional biomarker predictors or demographics did not improve this prediction."}, {"section_title": "DISCUSSION", "text": "Development of tools to predict AD represents an essential step in therapeutic strategies to ameliorate, delay, or prevent disease. Recent advances in the application of biomarkers have changed our conceptualization of early cognitive decline, and MCI due to AD has emerged as a specific etiological diagnosis [29] . We also recognize, however, that even the earliest symptomatic stages likely emerge only after AD pathology has advanced over the course of many years [1, 2] . Changes in CSF markers, in vivo amyloid imaging, and functional imaging studies have been demonstrated in groups at high risk for AD [1, 2] , but to date we cannot accurately predict development of cognitive decline in asymptomatic individuals. While longer follow-up in larger cohorts will be needed to establish reliable criteria, our findings suggest that predicting decline in cognitively normal individuals may be possible using currently available biomarkers.\nIn this study, we emphasize ADAS-Cog as our main outcome measure rather than transition from normal to MCI or AD. The latter, while arguably preferable because of the clearly defined clinical endpoint, was less powerful and less sensitive than analyses of ADAS-Cog because transitions were relatively rare (15%) and because transition is a dichotomous rather than a continuous measure. Among those who were judged to be cognitively normal at baseline, the strongest predictors of decline on the ADAS-Cog were CSF biomarkers, but volumetric MRI measures were also predictive. Among cognitive tests, only category fluency reached borderline significance.\nOur data suggest it may be possible to define cut points for baseline values of predictive biomarkers which separate cognitively normal individuals into those predicted and not predicted to decline cognitively over time. The cutpoints suggested here are based on results from the single centralized ADNI laboratory [17] . An inter-laboratory comparison, including the ADNI central laboratory, using uniform methods, suggested reasonably low intra and inter-lab variability [30] . However our suggested cutpoints may not be applicable to other labs using different collection and analysis procedures.\nFew such cut points have been published in the literature, and most focus on differentiating AD patients versus either MCI or normal subjects. Shaw et al. [31] published cut points for differentiating normal subjects from AD patients, based on the same central ADNI lab used here. These cut points for A␤ 42 , t-tau, p-tau, t-tau/A␤ 42 , and p-tau/A␤ 42 were < 192 pg/ml, > 93 pg/ml, > 23 pg/ml, > 0.39, and 0.10, respectively. Our cut points for predicting decline in ADAS-Cog among cognitively normal individuals were in most cases less extreme (A␤ 42 < 220 pg/ml, t-tau ≥ 61 pg/ml, t-tau/A␤ 42 > 0.30, ptau/A␤ 42 ≥ 0.10). In general, these cut points tended to divide the group approximately in half, which is logical given that ADAS-Cog scores worsened in about half over time, while the other half remained unchanged or improved. Our best cut points based on transition to MCI or AD were also less extreme (t-tau > 58 pg/ml, p-tau ≥ 21 pg/ml, t-tau/A␤ 42 > 0.31, and p-tau/A␤ 42 > 0.08) than those that discriminate individuals with AD from those with normal cognition or MCI. This finding might be expected in that those who have already transitioned to MCI as a group are expected to have worse values of biomarkers than normal individuals, and cut points for further transition to AD might be expected to be more extreme. It is interesting to note that baseline CSF measures incorporating A␤ 42 (i.e., A␤ 42 level and p-tau/A␤ 42 ratio) most strongly predicted decline on the ADAS-Cog while CSF tau levels played a greater role in predicting transitions from normal cognition to MCI or AD. This suggests that A␤ 42 may serve as an early marker of initial cognitive decline, but tau may be a better predictor of later clinical progression. This analysis was based on very small numbers of transitions (25 MCI, 3 AD) and warrants further examination. Nevertheless, our findings are consistent with hypothetical models in which changes in tau reflect a later stage of AD progression than A␤ 42 .\nFuture studies over longer periods in larger cohorts should be able to more accurately determine optimal cut points to predict initial cognitive decline as well as transition of cognitively normal individuals to MCI and AD. It is encouraging to note that reasonably accurate predictions appear feasible using commonly available biomarkers. Refinement of these studies as well as incorporation of additional biomarkers will support the design of trials that push interventions to asymptomatic stages of AD during which they may be more effective in modifying the course of disease."}]