[{"section_title": "", "text": "analyses of mean level personality change in adulthood suggested that personality changed little, and Costa and McCrae (1988) concluded that \"personality is stable after age 30\" (p. 853).\nMany researchers (Helson, Jones, & Kwan, 2002; Mroczek & Spiro, 2003; Piedmont, 2001; Srivastava, John, Gosling, & Potter, 2003) have questioned that position, and, based on subsequent research, McCrae and Costa (2003) extended and qualified their position. There are notable normative changes between late adolescence and age 30: Neuroticism (N) and Extraversion (E) decline, Agreeableness (A) and Conscientiousness (C) increase, and Openness (O) first increases, then declines. After age 30, both longitudinal and cross-sectional analyses suggest that there are continuing normative declines in N, E, and O, albeit at a modest rate of 1 to 2 T-score points (0.1 to 0.2 SD) per decade.\nDespite decades of research, many uncertainties remain in the description of age changes. Developmental trends for A and C are unclear, because these factors appear to increase with age in cross-sectional analyses, but did not increase in a large-scale longitudinal analysis . Even less is known about longitudinal trends for the specific traits or facets of the five factors; facets of A and C have been studied longitudinally only over a six-year period in middle-aged men and women . Little is known about age trends in extreme old age: The few studies that focus on this segment of the lifespan have found inconsistent results (see, Weiss et al., 2005) .\nThe present study analyzes new longitudinal data to refine the description of age changes in the broad dimensions and specific facets of the Five-Factor Model (FFM; McCrae & John, 1992) of personality. By using a comprehensive model of personality and employing a multilevel modeling approach on a large sample with over 5000 assessments, this study attempts to clarify and refine the description of the longitudinal course of personality trait development in adulthood."}, {"section_title": "Mean Level Changes and Developmental Curves", "text": "Cross-sectional studies are a convenient way to estimate age changes, provided that birth cohort and sampling biases can be ruled out. Longitudinal studies, which use subjects as their own controls, are the most effective way of ruling out such biases, and are thus a natural complement to cross-sectional studies (although they are themselves susceptible to time-of-measurement and attrition biases). Since 1989, Baltimore Longitudinal Study of Aging (BLSA) participants have completed the Revised NEO Personality Inventory (NEO-PI-R; Costa & McCrae, 1992) by computer administration. 1 Older participants have been tested repeatedly, and new participants have joined the study continuously. As a result, considerable data have been collected, but they vary in retest interval and number of administrations per individual. To maximize information from this dataset, we will use Hierarchical Linear Modeling (HLM; Raudenbush & Bryk, 2002) analyses to supplement cross-sectional analyses and describe developmental curves for personality traits in adulthood.\nHLM and other multilevel modeling approaches are increasingly being used to examine intraindividual age trajectories, to define normative trends, and to investigate individual variations around those normative trends (Hertzog & Nesselroade, 2003) . Mroczek and Spiro (2003) , in a sample of 1600 men from the Normative Aging Study, found curvilinear slopes for N, which declined up to age 80, and for E, which increased in the younger cohort and declined in the older cohort. They also found significant individual variation around these normative trends.\n1 About 5% of these administrations were actually collected by paper-and-pencil during participants' visits. The computer administration was preferred by most participants, including the very old.\nUsing HLM analysis on data spanning over 40 years of adulthood from two relatively small samples, Helson et al. (2002) found small to moderate increases with age on some measures of norm-adherence, a curvilinear trend on measures of social assurance, and declines on social vitality (see also Jones, Livson, & Peskin, 2003) . They found evidence of individual differences around normative trends and argued that life events and cultural climate shape the growth curves of personality traits. Steunenberg, Twisk, Beekman, Deeg, and Kerkhof (2005) in a sample of 2,117 respondents aged 55-85 from the Longitudinal Aging Study Amsterdam found a U-shaped curve for N. We will use HLM analyses to describe normative age changes and to investigate two variables (birth cohort and sex) that may moderate them. This is the first study that uses HLM to analyze trends for the five broad dimensions and the 30 lower-order facets of the NEO-PI-R.\nAlthough measures related to N and E have been included in most studies of aging and personality, there is reason to continue research on these dimensions. Meta-analyses of birth cohort (or time-of-measurement) effects in children and college students suggest that Americans have shifted toward substantially higher levels of N and E during recent decades (Twenge, 2000 (Twenge, , 2001 . Successive generations of college students have shown an increase in N scores of nearly one full SD over the interval from 1952 to 1993, and a similar increase in E from 1966 to 1993. Most of those students were born between 1932 and 1973, as were members of the BLSA who were 20 to 60 at the time of their first computer-administered NEO-PI-R (Costa & McCrae, 1992) . If Twenge's findings represent enduring birth cohort effects, cross-sectional studies should show lower scores for older generations in N and E, because older participants were born in an earlier era of lower N and E. If Twenge's findings represent transient time-of-measurement effects (as if high N and E had become more \"fashionable\" over the years), and if that trend has continued since 1993, longitudinal studies should show increases in N and E. We test both these hypotheses.\nDevelopmental changes in adult personality may differ for men and women. Some theorists have hypothesized that gender differences in personality traits are most pronounced in young adulthood and tend to diminish or even reverse during later life, towards a \"normal androgyny\" (Gutmann, 1987) . Although such changes could be biologically based, they are usually seen as the consequence of an age-related shift in sex-role demands. Wink and Helson (1993) found women were less competent, more emotionally dependent, and higher in succorance than men in young adulthood, but those differences were attenuated or reversed in middle adulthood. Srivastava, John, Gosling, and Potter (2003) also reported Age × Gender interactions but chiefly on N, with men stable and women declining cross-sectionally (see also, Small, Hertzog, Hultsch, & Dixon, 2003; Viken, Rose, Kaprio, & Koskenvuo, 1994) . By contrast, most other studies have found similar age curves for men and women (e.g., McCrae & Costa, in press ). We examine Age × Gender interactions in BLSA data."}, {"section_title": "Method Participants and Procedure", "text": "The sample consisted of 1,944 community-dwelling volunteers from the BLSA, an ongoing multidisciplinary study of normal aging administered by the National Institute on Aging. The BLSA begun in 1958 with a convenience sample of men, mostly college educated and predominantly white individuals. Later recruitment has helped balance the sample by including minorities and, since 1978, women. Participants are generally healthy and highly educated (M = 16.2 years of education, SD = 2.6); the present sample is 70.3% Caucasian, 22.3% African American, and 7.4% other or unknown. There were 977 men and 967 women. Data were collected between September, 1989, and July, 2004 , during regularly scheduled visits. Mean age at first NEO-PI-R administration was 58.8 years (SD = 16.8) for men, and 54.5 years (SD = 16.9) for women. Mean age at most recent NEO-PI-R administration was 63.7 years (SD = 18.1) for men, and 58.5 years (SD = 18.4) for women. Across the span of the study, age ranged from 20 to 96 years (M = 65.5, SD = 15.8), but most data were from participants aged over 60 (see Figure 1) . Older individuals were assessed more frequently than younger; the mean interval between administrations was 2.8 years (SD = 2.2). Participants completed from 1 to 11 administrations (M = 2.6; SD = 1.9); the 1,944 participants provided a total of 5,027 assessments (Appendix Table A shows the frequency of administrations). Individuals with only one administration were younger [t(1,942) = 16.5; p < .01, d = .72], more likely to be women (56%, χ 2 (1) = 18.47, p < .01), and slightly less educated [t(1,688) = 2.4; p < .05, d = . 13] than individuals with multiple administrations. After correcting for age and sex, there were no significant differences between these two groups on any of the five factors.\nThe BLSA attempts to maintain maximum participation from each individual with a lifelong commitment. Most participants with at least one NEO-PI-R administration are still in the study (72%); some are deceased (11%). Drop-outs consist of 4% who have formally withdrawn (although they are willing to participate by phone, mail, and/or home visits), 1% lost to followup, and 12% at least one year past their due date. At their first NEO-PI-R administration, individuals that later dropped out of the study (17%) were slightly older [t(1,1718) = −2.4; p < .05, d = .15], less educated [t(1,1467) = 2.8; p < .01, d = .17], and higher on N [t(1,1718) = −3.4; p < .01, d = .20] than active participants (72%). There were no differences on the other factors."}, {"section_title": "Measure", "text": "The Revised NEO Personality Inventory (NEO-PI-R; Costa & McCrae, 1992) , designed to measure the Five-Factor Model of personality, was used to assess self-reported personality traits. The NEO-PI-R consists of 240 items answered on a five-point Likert format ranging from strongly disagree to strongly agree. The NEO-PI-R assesses 30 facets, six for each dimension of the FFM (see Table 1 for a listing of the 30 facet scales). Raw scores were standardized as T-scores (M = 50, SD = 10) using combined-sex norms reported in the Manual; factor scores combining information from each of the 30 facets are also expressed as T-scores (Costa & McCrae, 1992, Table 2 ). In the current sample (on the first assessment for each participant) the internal consistencies for the five domains were .91, .87, .87, .88, and . 92 respectively for N, E, O, A, and C. Factor structure in this sample shows high congruence with the normative structure (Tucker's phis = .97 to .99). The NEO-PI-R has been translated into several languages and used in more than 50 cultures . Additional evidence on convergent and discriminant validity is presented in the Manual (Costa & McCrae, 1992) , including cross-observer agreement and prediction of external criteria such as psychological well-being, needs and motivation, creativity, educational and occupational achievements, and coping mechanisms. Some of the data on which the present study is based have been used for other purposes, including correlations at one time point with other variables (see Author Note) and two-year retest correlations (N = 338) reported in McCrae, Yik, Trapnell, Bond, & Paulhus (1998) as an estimate of retest reliability (r tt s = .83 to .91 for domains, .64 to .86 for facets). However, none of these data have been used to investigate longitudinal trends in mean trait levels."}, {"section_title": "Hierarchical Linear Modeling Analyses", "text": "HLM is a flexible approach that can be applied to evaluate individuals' growth trajectories. In HLM analyses the number and spacing of measurement observations may vary across persons, given that the time-series observations in each individual are viewed as nested within a person. Even data from individuals who were tested only on a single occasion can be used to stabilize estimates of mean and variance. In this way, all available data can be included in analyses. This is a major advantage of conducting analysis within the HLM framework; by contrast, missing data and varying timing pose major problems in conventional repeated measures analysis of variance.\nOur data fit a so-called accelerated longitudinal design, in which longitudinal data are collected on members of different birth cohorts. With this design we can estimate age-trajectories over a broad age span using data collected in a shorter time interval. Conceptually, HLM describes the growth curve of each individual and pieces these curves together to estimate an overall age trajectory. Statistically, it uses sophisticated methods to reduce error of measurement and to make fullest possible use of the information in the data (Brant & Verbeke, 1997; Verbeke & Molenberghs, 2000) .\nHLM is hierarchical because it allows modeling both within-and between-individual variations. At level-1, each individual's data are fitted to a regression line (linear, quadratic, or other higher-order models). Level-1 coefficients are empirical Bayesian estimates, which are optimal estimates based on data from the individual and the entire population. Individual data are weighted by the number of data points and the reliability of the regression. This approach tends to shrink the individuals' coefficients toward the population means; the degree of shrinkage is inversely proportional to the reliability of the individual data. Variance and covariance components are estimated through maximum likelihood procedures (Raudenbush & Bryk, 2002 ).\nIn the level-2 equations, the outcome/dependent variables are the level-1 regression coefficients and the independent variables are the characteristics of level-2 units, the individuals. At level-2, individual difference variables, such as cohort and sex, are used to explain between-subjects variation in the intercept and the linear slope.\nTo evaluate the longitudinal trajectories, we first defined the level-1 model, and then tested possible level-2 predictors. At level-1 linear and then quadratic models were tested. The quadratic model was chosen when it provided better fit according to the chi-square test of deviance at p < .01. After the level-1 model was determined, year of birth in decades (as a continuous variable) and sex were entered in the model as level-2 variables. Level-2 variables were retained if they improved the fit of the model, or in other words, explained a significant amount of the variance in mean intercept or slope. Age was centered on the grand mean (M = 64.5 years) to minimize the correlation between the linear and quadratic terms. At level-2, year of birth was centered on its grand mean (1938)."}, {"section_title": "Results", "text": ""}, {"section_title": "Cross-Sectional Analyses of Age Differences in Mean Levels", "text": "Cross-sectional analyses were performed on the first administration available for each subject. Descriptive statistics for six age groups (20 to 39.9, 40 to 49.9, 50 to 59.9, 60 to 69.9, 70 to 79.9, and 80 to 100) are shown in Appendix Table B . The results of linear regressions for the five factors are reported in Table 1 , and results of significant linear (for O and A) or curvilinear effects (for N, E, and C) are depicted with dashed lines in Figures 2a, 3a , 4a, 5a, and 6a. The linear slopes suggest that age differences amount to about one T-score point per decade. The Figures show that the N curve was concave, whereas the E curve was convex, with older individuals scoring increasingly lower. Older individuals were lower on O and higher on A. The C curve was convex. Age and age-squared together accounted for from 1.3% of the variance in C to 5.3% in E.\nThese cross-sectional results do not support the hypothesis that Twenge's (2000; findings reflect enduring birth cohort effects. Her college student samples were born in the same years as BLSA participants aged 20-60. As Figure 2a shows, within that portion of the curve, later-born cohorts do have higher scores on N, but the effect is only about one-third as large as the effect Twenge reported. Furthermore, later-born cohorts are younger at time of testing, so their higher N score is probably due to their younger age. Figure 3a shows that there is an even smaller difference in E across these cohorts. (Srivastava et al., 2003 , also failed to find large cross-sectional age differences in these factors.)\nLinear regression results for the 30 facet scales are reported in Table 1 . The slopes of the facets generally correspond to the trajectory of the factors they define. However, the strength of association with age varied across facets, and some showed a distinct trajectory. The largest effects were found for for E4: Activity, E5: Excitement Seeking, E6: Positive Emotions, O1: Fantasy, and O3: Feelings, which all are lower in older individuals. The largest positive slopes are found for A1: Trust, A2: Straightforwardness, and A4: Compliance. The pattern of age differences resembles that found in other cultures: The rank-order correlation of the slopes in Table 1 with the cross-sectional age trends found in 12 other cultures (see McCrae & Costa, in press) across the 30 facets is .73 (p < .001).\nIn this large sample, quadratic terms were significant for 20 of the 30 facets. But most accounted for less than 1% of additional variance: Curvilinear effects accounting for an additional 1% to 3% of the variance were found only for N3: Depression and N6: Vulnerability, which showed a nadir around age 50-60, and for C1: Competence and C5: Self-Discipline, which peaked at age 40-50.\nFinally, we conducted regression analyses to determine whether there were Age × Gender interactions. Significant effects were found for overall N, N2: Angry Hostility, and O3: Feelings. In all three, the cross-sectional decline was more marked for women than for men. The effects, however, accounted for less than one-quarter of 1% of the variance in personality scores."}, {"section_title": "HLM Analyses of Change in Mean Levels", "text": "We used between-and within-individual variance estimates from the basic one-way ANOVA with random effects model (Raudenbush & Bryk, 2002, p. 24) to estimate the proportion of the stable variance in personality traits. The proportion of stable variance can be computed as the ratio of between-subjects variance (u 0 : intercept variance) to the total variance (u 0 : intercept variance + σ 2 : within-subject variance). Of the total variability across persons and occasions, 84%, 88%, 88%, 85%, and 87% for N, E, O, A, and C respectively, was between-persons (individual differences), and the remaining portion was within-persons (intra-individual variability).\nFor the five factors and the 30 facets, Table 2 provides HLM estimates for the final model. Fixed and random effects for the intercept, linear, and quadratic terms are reported, along with standard errors. Cohort (date of birth) was a significant predictor of the intercept of N and C, with later-born cohorts having lower N and higher C. Note that these effects are net of the estimated effects of age (the level-1 predictor). Gender was a significant predictor of the intercept for all factors except C, with women scoring higher than men (Costa, Terracciano, & McCrae, 2001 ). The random effects (u 0 : variance) associated with the intercepts of the five factors, which reflect individual differences in personality traits, were all statistically significant. These between-individuals' variances are substantially higher than residual withinindividuals' variances (σ 2 ). The proportions of between-subjects variance for the five factors are also higher than comparable proportions found in other multilevel modeling studies of personality (Mroczek and Spiro, 2003; Steunberg et al., 2005) , which suggests that personality traits appear to be more stable when assessed with the longer and more reliable NEO-PI-R factors.\nThe quadratic terms are presented only when the quadratic model fit the data better than the linear model. In those cases, the linear terms are the coefficients from the quadratic equations. With the exception of O, a quadratic model fit the data significantly better than a linear model for all factors. At level 2, neither birth cohort nor gender was a significant predictor of variability in the slopes, so the curves of the five factors were unrelated to cohort and do not depend on gender. 2 Solid lines in Figure 2a to Figure 6a depict the estimated slopes of the five factors, setting cohort as equal to the sample's mean date of birth of 1938, and sex as intermediate between men and women (1.5). N appears to decline at decelerating rate up to age 80, and then is stable or increases slightly in the very old. E is stable in young adulthood and then declines at an accelerating rate in the very old. O has a substantial linear decline; A has a substantial increase. C follows a convex curve, with an increase up to age 70 and then a small decline. The changes in adulthood on the five factors amount to about one T-score point, or .1 SD, per decade. 3 With the exception of the quadratic coefficient of E, all variances associated with the slopes were significant, indicating that there are individual differences in the slopes. These might be attributed to life events, genetic variability, or the onset of a dementing disorder. A more methodological explanation of the slope variability is attrition. Using a dummy variable that contrasted dropouts and active subjects, we tested whether the trajectories of subjects lost to follow-up differ (cf. Sliwinski, Hofer, Hall, Buschke, & Lipton, 2003) . HLM analyses indicated that attrition was not a significant predictor of the slope variability, or in other words, the linear and quadratic coefficients were not significantly different for dropouts and active participants on any of the five factors. As would be expected from attrition analyses reported in the Method section, the only significant effect was found on the intercept of N, with dropouts on average scoring 1.6 T-scores higher than active participants (p < .01).\nHLM slopes for the facets are depicted in Figure 2b to Figure 6b . Five N facets share the trajectory of the factor they define, which declined and then was stable or increased between ages 70 and 90. N5: Impulsiveness has a linear decline of about one T-score point per decade, without the upturn in old age seen in the other facets. Among the facets of E, E4: Activity has a convex curve with the most rapid decline in old age, whereas E5: Excitement-Seeking has a concave curve with the largest decline in early adulthood. E1: Warmth, E2: Gregariousness, E3: Assertiveness, and E6: Positive Emotions have curvilinear slopes with peaks around age 60. The facet of O showing the largest effect was O6: Values, which declined by two T-score points per decade. Openness to Feelings and Actions declined at an accelerating rate in old age. Other facets of O were substantially stable. The facets of A with the largest increase were A4: Compliance and A2: Straightforwardness. A1: Trust increased up to age 60 and then declined. The other facets of A were substantially stable or increased slightly with linear or curvilinear slopes. C6: Deliberation was the facet of C with the largest increase. The other C facets increased up to age 60-70 but then declined.\nThe effects of gender on facets' intercepts were predictable and consistent with cross-cultural gender-differences (Costa et al., 2001 ). Cohort effects on facets' intercepts indicate that laterborn cohorts are lower on most facets of N, particularly N3: Depression and N6: Vulnerability, lower on O6: Values and A1: Trust, and higher on other facets, including E3: Assertiveness, E6: Positive Emotions, C6: Deliberation, and particularly C1: Competence. Gender had a significant effect on slope only for two of the 30 facet scales: O3: Feelings, for which gender differences become smaller with age, and A5: Modesty, for which the differences become larger. These gender effects explained 1% and 4% of the slopes' variances, respectively. Significant cohort effects on the linear slopes were found only for N1: Anxiety and C3: Dutifulness, accounting for less than 1% of the variance.\nWithin-subjects variability (σ 2 ) is larger for the 30 facets than for the five factors. This is in part explained by the fact that the facets are less reliable, which in turn suggests that most of the within-subjects variability is due to measurement error. The estimated stable components of variance for the 30 facets range from 69% to 83% (M = 76%). Across facets, these stability values are highly correlated with two-year test-retest stability coefficients (r = .86; p < .001; ."}, {"section_title": "Discussion", "text": "In this article we have presented longitudinal personality data from a large sample of adults. The strengths of the study include the analysis of multiple data points for most participants, the use of a well-validated instrument that provides a comprehensive assessment of personality traits, and sophisticated statistical analyses. Among the limitations are the use of a single, selfreport method of measurement; the under-representation of young adults; and attrition: It is possible that individuals who dropped out of the study would show different developmental paths. But analyses conducted in the present study and in a large meta-analysis of longitudinal studies (Roberts, Walton, & Viechtbauer, in press) showed that attrition had no effect on meanlevel changes in any domain of personality. Another limitation is the fact that the BLSA is not representative of the U.S. population in terms of education and socio-economic status. In general, however, findings appear to be consistent with a much broader body of literature. For example, similar trajectories for N are found in the Normative Aging Study (Mroczek & Spiro, 2003) and in a large Dutch random sample (Steunenberg et al., 2005) .\nHow does one describe personality changes in adulthood? HLM analyses indicated that about 85% of the variance in personality trait scores over the course of this study was due to stable individual differences. This estimate is comparable to the rank-order correlations found in the literature (e.g., Costa & McCrae, 1988) , and it is reassuring that results from these sophisticated HLM analyses are consistent with conclusions from decades of research using less optimal statistical methods. About 15% of the variance is due to intraindividual variability, and this includes measurement error as well as normative and non-normative changes. However, those relatively small changes are of both theoretical and practical interest.\nData on normative changes from the BLSA are summarized in Figure 2a -b through Figure 6a b, and merit several comments. First, the curves fall almost entirely within the average range, and changes from age 30 to age 90 are modest in magnitude, even for those few individuals who live to that exceptional age.\nSecond, the direction of the observed changes is, in general, consistent with previous longitudinal and cross-sectional studies showing declines in N, E, and O, and increases in A and C during adulthood (McCrae & Costa, 2003) . However, McCrae and Costa (2003) did not anticipate curvilinear trends in later adulthood, in part because so little research has been conducted on participants over age 70. The upturn of N toward the end of the lifespan seen in the present study was also reported in a cross-sectional analysis by Costa and McCrae (1988) and in more recent longitudinal analyses (Mroczek & Spiro, 2003; Small et al., 2003; Steunenberg et al., 2005) . Among those studies there are no consistent curvilinear effects for E, which might be due to the weight that different E scales give to the factors' facets: As Figure  3b shows, the developmental course of E varies considerably by facet. Roberts et al. (in press) found continuing longitudinal increases in A and C after age 30, but there is little information on the developmental curves of A and C in very old samples. A cross-sectional study of patients aged 65 to 100 found evidence for higher levels of A among older individuals, but Small et al. found that neither initial level of A or C nor change across six years was related to age. Further studies are needed to evaluate the decline in C in late life reported here.\nA third feature of Figure 2a through Figure 6a is the general similarity of results from different analytic designs. Cross-sectional curves mirror HLM results. At the level of the facets, the rank-order correlation across the 30 facets between the cross-sectional linear slopes in Table  1 and the longitudinal linear slopes from HLM analyses was r = .72, p < .001. Substantively, when cross-sectional and longitudinal results agree, the most parsimonious interpretation is that effects are due to aging itself, rather than to some combination of practice, birth cohort, and time-of-measurement effects (Costa & McCrae, 1982) .\nThere are some differences between cross-sectional and HLM results for N and C that suggest cohort or sampling bias effects. HLM analyses indicate that later-born cohorts have lower levels of N (e.g., individuals born in 1940 are predicted to score about one T-score point lower on N than individuals born in 1930), a finding opposite to the trend reported by Twenge (2000) . The dramatic effects that Twenge (2000; observed in college-age samples do not seem to apply to these adults, who appear to have been fortunate enough to escape the \"Age of Anxiety\" (Twenge, 2000) . Perhaps culture has stronger effects on personality in childhood and adolescence, but in adulthood such influences appear to be diminished.\nSome studies (e.g., Wink & Helson, 1993) have reported significant Age × Gender interactions, especially for N, and interpreted this as evidence of differential development in men and women. In the present study we replicated this finding in cross-sectional analyses (although the effect accounted for less than 1% of the variance), but not in HLM analyses. A general absence of interactions is also found in cross-cultural studies (McCrae & Costa, in press) , in other longitudinal studies (e.g., Helson et al., 2002) , and in a recent meta-analysis of age changes (Roberts et al., in press )."}, {"section_title": "Facet-level Findings", "text": "Most of the facets showed age trends that resemble that of the factor they define, but the variations within domain are worth noting. N5: Impulsiveness shows a linear decline across the lifespan, whereas the other N facets show curvilinear effects. N6: Vulnerability has the largest increase after age 70, which might be related to the fact that Vulnerability and Conscientiousness are the traits most affected by the onset of Alzheimer's disease (Siegler et al., 1991) .\nThe facets of E have distinct patterns. E3: Assertiveness increases from age 30 to age 60. E4: Activity is stable in young adulthood and then declines at an accelerating rate in older age. Given the physiological changes that occur in the later half of life, it is not surprising that older individuals have a slower pace and feel less energetic and vigorous than young adults. Also notable in the E domain is the decline in E5: Excitement Seeking, which by age 30 has already declined substantially from its peak in adolescence (Costa & McCrae, 1992) . The trajectory of E6: Positive Emotions is similar to the curve in life satisfaction found in a recent study by Mroczek and Spiro (2005) .\nIt is perhaps not surprising that Openness to Values declines with age, because it is widely believed that older individuals are less willing to re-examine social, political and religious values (Krosnick & Alwin, 1989) . A similar decline in Openness to Feelings is consistent with the hypothesis of affective blunting in old age (Lane, Sechrest, & Riedel, 1998) . More remarkable is the fact that Openness to Aesthetics and Ideas show almost no decline from age 30 to 90.\nThe steepest increase among A facets is for A4: Compliance; the least change is found for A5: Modesty. The convex curve of C1: Competence echoes recent findings (Trzesniewski, Robins, Roberts, & Caspi, 2004) of a peak at age 70 for self-esteem, a variable closely related to Competence (Costa, McCrae, & Dye, 1991) ; whereas the monotonic increase in C6: Deliberation is consistent with other indicators of a lifelong drop in variables related to impulsiveness.\nThe longitudinal trends of the 30 facets depicted in this study provide a detailed picture of changes in personality. The differences among facets may explain some of the disagreements in the literature about the longitudinal course of personality traits. There is a large body of research on some of the broad dimensions of personality; the results of this study indicate that it will be informative to extend the analysis to a more fine-grained level to better understand changes in personality."}, {"section_title": "Interpreting Normative Age Changes", "text": "On the one hand, personality changes seen in adulthood are rather modest. Considering that most traits change at a rate of less than one T-score point per decade, it is perhaps not surprising that the clear majority of adults report that they have \"stayed pretty much the same in personality\" over the past few years (Herbst, McCrae, Costa, Feaganes, & Siegler, 2000, p. 381) . On the other hand, analyses reported in this study and in the broader literature consistently show that there are mean level changes that can be detected with large samples and long time intervals. What remains is to understand the origins of these maturational changes. The present data are merely descriptive; here we can mention possible explanations and some supporting evidence.\nThere are two basic classes of explanations, environmental and biological, and psychologists have usually preferred the former. Srivastava et al. (2003) argued that Age × Gender interactions on N might reflect gender-based social experiences. Helson et al. (2002) predicted that period of life and social climate influence personality change. Roberts, Caspi, and Moffitt (2001) linked personality change to work experience. Zucker, Ostrove, and Stewart (2002) discussed \"ways in which women's adult development may have been shaped by experiences particular to both gender and birth cohort\" (p. 236). Roberts, Wood, and Smith (2005) held that a driving mechanism of personality development is psychological investment in agegraded social roles. The social pressures associated with getting married, creating a family, entering the workforce or advancing in one's career are thought to promote changes in the direction of greater maturity. Roberts et al. (2005) argued that those social roles tend to be shared across cultures and cohorts, and these universal tasks of social living are portrayed as a plausible explanation of the similarity of personality changes across cultures and cohorts.\nFive-Factor Theory (FFT; postulates that the traits encompassed by the FFM \"are endogenous dispositions that follow intrinsic paths of development essentially independent of environmental influences\" (McCrae et al., 2000, p. 173) . That would explain why cross-sectional and longitudinal results converge; why the differing social experiences of men and women do not result in reliable differences in developmental curves for personality traits; and why cultures with dramatically different recent histories do not show marked divergences in the pattern of age differences across the lifespan (Yang, McCrae, & Costa, 1998) . According to FFT, birth cohort, gender experience, culture, and history have little impact on trait development because traits are governed by biological processes common to the human species.\nIndirect evidence supporting FFT comes from cross-cultural and cross-cohort studies that call into question environmental explanations, but there are also more direct sources of evidence, including comparative studies (e.g., King, Weiss, & Farmer, 2005) showing similar age trends in non-human primates and twin studies (Viken et al., 1994) showing strong genetic effects on the stability of personality traits.\nFFT attributes personality change to intrinsic maturation, but it does not attempt to predict what changes will be observed. It is possible that the pattern of changes seen in Figure 2 - Figure  6 are results of evolution; for example, higher levels of C and A may be important for parenting and other adult responsibilities, and responsible adults may have successfully raised more offspring. Less clear from an evolutionary (as well as social role) perspective are the increases in N and declines in C in very old age; they may be due to losses of function in the aging brain (Resnick, Pham, Kraut, Zonderman, & Davatzikos, 2003) or to diminishing social support (Jackson, Antonucci, & Brown, 2004) ."}, {"section_title": "Sources of Non-Normative Change", "text": "HLM analyses showed that significant variance in individual trajectories remained unaccounted for by age and age-squared. This finding is consistent with previous multilevel modeling studies Mroczek & Spiro, 2003; Small et al., 2003) and indicates that personality change itself is an individual difference variable. There is a growing interest in relating these non-normative changes to biological and environmental factors, and multilevel modeling analyses of large longitudinal datasets can be a powerful method to address these issues.\nPersonality changes that deviate from the normative trajectories shown in Figure 2 - Figure 6 might be due to genetic factors (McGue, Bacon, & Lykken, 1993) , and genetically-informative research designs would greatly benefit this inquiry. Genetic association studies could examine whether polymorphisms in candidate genes are associated with non-normative changes in personality traits. FFT also suggests other biological influences on traits, such as addictions (Terracciano & Costa, 2004) , pharmacological interventions (Maki, Resnick, & McCrae, 2004, July) , and clinical depression (Costa, Bagby, & McCrae, 2004 ).\nOf particular interest are studies that have examined change in personality traits among Alzheimer's patients using ratings from caregivers and other well-informed observers (e.g., Dawson, Welsh-Bohmer, & Siegler, 2000; Siegler, Dawson, & Welsh, 1994; Siegler et al., 1991; Strauss, Pasupathi, & Chaterjee, 1993) . These studies, which compared concurrent with retrospective premorbid ratings, consistently found that after diagnosis of Alzheimer's disease, patients were rated as lower on C and E, and higher on N, particularly N6: Vulnerability. Although they provide a very consistent and plausible picture, these studies are retrospective and are not informative as to whether there are changes years before the diagnosis that could be used as early signs of the onset of the disorder. A study by Balsis, Carpenter, and Storandt (2005) on personality changes indicated that \"observable personality changes may occur in the very earliest stages of the disease and precede measurable cognitive loss\" (p. 100). Future studies should attempt to detect these possible early changes in personality using long-term prospective designs.\nResearchers have examined the role of relationships and gender-related and work experience in shaping the developmental course of personality traits. For example, Roberts Helson, and Klohnen (2002) found that Dominance was correlated positively with the number of years in the labor force and negatively with the experience of divorce in women aged 27-43, but not in women 21-27 or 43-52. Changes in motherhood status and the impact of women's movement were found to be unrelated to changes in Dominance. Costa et al. (2000) tested whether events like marriage, divorce, widowhood, death of parent or child, and retirement had an effect on personality traits. From among the 30 events assessed, they found effects of divorce and job change on personality traits, though it was not clear how enduring the effects might be.\nAcute events thus appear to have limited effects on personality traits, but chronic stressors may. In particular, caregiver burden in known to have effects on well-being and depressive mood (Jang, Clay, Roth, Haley, & Mittelman, 2004; Russo Vitaliano, Brewer, Katon, & Becker, 1995) . Whether these stressful situations would have an impact on general personality traits remains to be seen.\nAlthough there are a number of findings suggesting that life events can affect personality traits, none has been clearly replicated, and future research should explicitly address this. Further explorations of the possible effects of life events Roberts, Caspi, & Moffitt, 2003; Roberts et al., 2002) , psychotherapy (Piedmont, 2001) , and acculturation experiences (Leininger, 2002) should continue, along with a vigorous program of research on possible biological causes of personality change. Perhaps normative trait development is biologicallybased, whereas deviations from the normal developmental trajectory are due to life experiences. Note. N refers to the number of individuals having exactly the specified number of administrations. Age range is from youngest age at first administration to oldest age at last administration. Number of personality assessment points obtained by age. a-b. Estimated T-scores for Conscientiousness and its facets from 30 to 90 years. "}, {"section_title": "Appendix", "text": "\n"}]