[{"section_title": "Abstract", "text": "A multiregion computable general equilibrium model is used to evaluate the regional, multilateral, and unilateral trade policy options of Mercosur from the perspective of the welfare of all potential partners in several proposed agreements. The focus for Brazil is on poverty impacts. The results show that the poorest households in Brazil experience gains of 1.5-5.5 percent of their consumption, which are about three to four times the average gains for Brazil. Protection in Brazil favors capital-intensive manufacturing relative to unskilled labor-intensive agriculture and manufacturing. So trade liberalization raises the return to unskilled labor relative to capital and disproportionately helps the poor.\nBrazil has several trade policy options. This study evaluates those options from the perspective of the welfare of all potential partners in several proposed trade agreements, looking particularly at the impacts on poor people to determine which trade policy contributes most to poverty reduction in Brazil. The objective is to determine whether there is a tradeoff between aggregate welfare gains to Brazil from trade liberalization and the welfare gains to the poor."}, {"section_title": "", "text": "agreement with the European Union, along with less notable regional arrangements. In addition, Brazil has supported further multilateral negotiations within the World Trade Organization (WTO 2000) .\nBrazil is concerned that these regional integration initiatives will provide much less market access than agreements that do not constrain the exports of partner countries. Notably, significantly improved access to EU agricultural markets will be very difficult to achieve for the usual EU internal political reasons. As a major agricultural exporter, Brazil believes that the WTO is the best negotiating forum for obtaining freer access to agricultural markets. Moreover, antidumping and stringent rules of origin may limit access to the markets of the main industrial country partners in these regional agreements, especially the Free Trade Agreement of the Americas (FTAA) .\nExtending the analysis of Harrison and others (2002) on Chile, this study evaluates the value of trade policy options to Brazil if the key industrial country partner in these regional agreements denies access to specific products. For the EU, that means exclusion of preferred access to Mercosur exporters in the most highly protected agricultural products. For the FTAA, that means denial to Brazil of access to the most highly protected products in the United States because of antidumping measures or restrictive rules of origin.\nA major policy concern is the link between trade policy changes and poverty in Brazil. Although interest in the topic has increased dramatically in recent years, using general equilibrium modeling with multiple households to examine equity issues dates to pioneering studies by Adelman and Robinson (1978) and Piggot and Whalley (1985) . This has typically been done by aggregating households from a household survey into 5-40 households.\n1 Recently modelers have focused attention on the impact of trade policy on poverty, and Harrison and others (2003a) have showed that a concern with equity is not equivalent to a concern with poverty."}, {"section_title": "2", "text": "A second approach is to take price changes from a representative consumer general equilibrium model and feed these into a micro-simulation model of household behavior, such as in Chen and Ravallion (2003) and Bussolo and Lay (2003) . This approach allows examination of the diversity of impacts across households: Even if the aggregated poor households gain, many individual poor households could lose. But the approach ignores feedback effects of the quantity changes on the equilibrium outcome in the general equilibrium model and does not reconcile inconsistent information on household income from the national accounts and the household surveys. 3 The analysis here is in the tradition of the first approach. The model incorporates 20 types of Brazilian households: 10 rural and 10 urban, with 1. For recent applications see the papers for the conference on Poverty and the International Economy (available online at www.worldbank.org/trade).\n2. The trade policy change they evaluated resulted in an increase in aggregate real income and greater equity as measured by the Gini coefficient, but the poorest households were worse off.\n3. See Cockburn (2001) for an attempt to combine the two approaches. households further classified by income level. The results show clear and crucial links among trade policy changes, factor intensities at the industry level, economy-wide factor returns, and poverty-the links suggested by the Hekscher-Ohlin and Stolper-Samuelson models. But only because of the attention to detail in the empirical estimation of factor shares are results obtained that can be sensibly used to analyze the poverty dimension of trade policy changes. The results also show the importance of agricultural liberalization for the poor. The aggregate policy results show that both the FTAA and the EU-Mercosur arrangements are net trade creating for member countries, but excluded countries almost always lose. But multilateral trade liberalization (a 50 percent cut in tariffs and export subsidies) results in estimated gains to the world that are more than four times greater than the returns for either the FTAA or the EUMercosur agreement, demonstrating the continuing importance of multilateral negotiations.\nA fully implemented agreement with the European Union is about 1.5 times more valuable to Brazil than the FTAA because of access to highly protected EU agricultural markets. But if agriculture is excluded from the agreement, it becomes of very little value to Brazil. Application of antidumping and restrictive rules of origin by the United States against Brazil on the most protected products in the U.S. market similarly reduces the value of the FTAA to Brazil. Nonetheless, the FTAA still has significant value to Brazil because other markets in the Americas and the less protected sectors in the United States are assumed to remain open to Brazilian exporters.\nMost of the evaluated trade policy options result in a progressive distribution of the gains, so that the poorest households experience the greatest percentage increase in their incomes. Although Brazil undertook substantial trade liberalization in the 1990s, vestiges of its import-substitution industrialization strategy of the 1960s remain. Trade policy reforms in Brazil tend to shift resources from capital-intensive manufacturing to unskilled labor-intensive agriculture and less capital-intensive manufacturing, increasing the wages of unskilled labor relative to returns to capital and skilled labor. The percentage increase in the incomes of the eight poorest types of households is several times greater than the average percentage increase for the economy as a whole. 4 Previous work has shown that multilateral agricultural trade liberalization will lead to aggregate gains for agricultural exporting nations. The results here suggest that agricultural trade liberalization, whether multilateral or in a regional arrangement with the European Union, is particularly important for the realization of poverty reduction benefits for agricultural exporters, such as Brazil.\n4. These results are consistent with two other analyses of the impact of trade liberalization on the poor in Brazil: Barros and others (2000) and World Bank (2001)."}, {"section_title": "I. A MULTIREGIONAL T R A D E M O D E L", "text": "A comparative static, constant returns to scale, multiregional, and multisectoral quantitative model is developed to evaluate the impact of trade policy on poverty in Brazil. The model is relatively detailed in the Americas, with 13 countries or regions from that area (table 1) . Also included are the European Union 15, Japan, and a residual rest of the world. Of the Mercosur members, Brazil, Argentina, and Uruguay are represented explicitly in the model, whereas Paraguay is represented as part of the rest of South America. The general specification of this model follows the earlier multiregional model of the effects of the Uruguay Round in Harrison and others (1997c) and even more closely their model of trade policy options for Chile (Harrison and others 2002). 5 Because most of the documentation of the data and model and additional simulations are available in Harrison and others (2003b) others (1997c, 2002) . The model is formulated using the GAMS-MPSGE software developed by Rutherford (1999) and solved using the PATH algorithm of Ferris and Munson (2000) . See de Melo and Tarr (1992) for an exposition of the general form of the within-country equations of the model. are summarized here.\n6 Production uses intermediate inputs and primary factors (labor, capital, and land) that are mobile across sectors within a region but immobile internationally. The amount of capital and labor available to any economy is fixed. Output is differentiated between domestic output and exports, but exports are not differentiated by destination country. Except for Brazil, each region has a single representative consumer who maximizes utility, as well as a single government agent. Demand is characterized by a nested Armington structure for each of the 22 sectors (see table 1 ). The Armington aggregate good is a constant elasticity of substitution (CES) composite of domestic production and aggregate imports, and aggregate imports are a CES aggregate of imports from different regions of origin. This structure allows multistage budgeting. So government revenue remains unchanged in any counterfactual scenario, a tax is imposed to compensate for lost tariff revenue. Each country has a balance of trade constraint, so any change in the value of imports is matched by an equal value change in exports. The model is ''real,'' in the sense that it contains no financial assets. Thus there is only a ''real'' exchange rate, defined as the price of a country's tradable goods relative to the price of its nontradable goods.\nThe model does not incorporate increasing returns to scale or endogenous productivity effects of trade policy, despite a number of studies by Brazilian researchers identifying a correlation between the opening of Brazil to external trade in the early 1990s and an increase in productivity in Brazilian manufacturing (Muendler 2001 found a causal relationship). A model that incorporates both of these, such as that developed in Rutherford and Tarr (2002) , would be expected to produce much larger gains than this constant returns to scale model, with a resulting further reduction in Brazilian poverty. But because the productivity advances are not likely to be concentrated in the labor-intensive sectors, the relative share of the gains at the household level for the poor may be less progressive than that found here."}, {"section_title": "7", "text": ""}, {"section_title": "Brazilian Households", "text": "The most important new feature in this model is the extension to multiple households in Brazil: 10 rural households and 10 urban households, distinguished by income levels (as defined in table 2). The structure of demand for each household is a nested Armington structure, based on CES demand functions, similar to representative households in other regions. 6 . These appendixes present details of the model specification, tables with low elasticity results and detailed sectoral results for Brazil, procedures for updating the input-output tables and estimating factor intensities, calculation of the tariff rates in Mercosur, systematic sensitivity analysis, steps for incorporating the household survey information, and some additional references.\n7. Most of the trade policy options were also evaluated in separate simulations in a comparative steady-state model. Because the rental rate on capital falls in most of the scenarios, the new equilibrium capital stock does not rise, and the estimated welfare gains to the economy also do not rise. Because the CES function is homothetic, changes in the income level of individual consumers will not change the proportions in which they consume commodities. Despite the fact that each individual consumer has homothetic utility functions, relative prices will vary with income levels in the model. This is because the CES demand function parameters calibrated for each household necessarily differ across households, because the initial shares of income spent on different commodities vary by household. This implies that the elasticities of demand with respect to prices and income differ across Brazilian households. Hence if income shifts from household A to household B, aggregate demand will shift toward the commodities consumed more intensely by household B. "}, {"section_title": "General Data and Elasticities", "text": "The Global Trade Assistance and Protection 5 (GTAP5) database, described in Dimaranan and McDougall (2002) , is used for countries other than Brazil. It includes key protection data ( In the scenarios using central elasticities, the lower level elasticity of substitution between imports from different regions, s MM , is assumed to be 30 and the higher level elasticity between aggregate imports and domestic production, s DM , to be 15. Although these elasticities are high by the standards of some econometric studies, such as Reinert and Roland-Holst (1992) and Shiells and Reinert (1993) , they are supported by the estimates of Reidel (1988) and Athukorala and Reidel (1994) . Moreover, elasticities would be expected to increase over time, and this model presumes an adjustment of about 10 years, a long period in the context of these econometric estimates. The higher elasticities are needed in the model to produce results for terms of trade changes that are closer to the results of Chang and Winters (2002). 10 8. The model was also executed with the linear expenditure system (LES) demand functions at the top level in place of CES for all Brazilian households. Given that the change in real income is not large in the simulations, the welfare results and returns to factors change only negligibly.\n9. That is, sectors were aggregated that are not important in trade or that have low rates of protection. Although aggregation may significantly change the results in applied trade policy analysis, this type of aggregation creates quite small aggregation bias. It is acknowledged, however, that services are not treated seriously in this model. Readers interested in the role of services in regional agreements of Brazil may consult Mattoo and others (2002) .\n10. Larger elasticities in the model result in larger terms of trade effects. The Chang and Winters (2002) results provide support for the higher choice of elasticities, because even the highest elasticities chosen fall short of the terms of trade effects they find for the United States and Japan. The welfare calculations here, however, are broadly consistent with those of Chang and Winters (2002) . The policy simulations are also performed with lower elasticity values of s MM = 8 and s DM = 4.\n11 Lower elasticities typically lower the welfare gains for the countries that gain from the regional arrangements and reduce the losses for countries excluded from the regional arrangements, but they rarely change the qualitative results in the scenarios examined. 12 Similarly, results at the household level in Brazil are muted with lower elasticities, but the relative gains to the poor in Brazil remain several multiples of the overall gain.\nThe elasticity of transformation between exports and domestic production is assumed to be 5 for each sector. Elasticities of substitution between primary factors of production is unity. Fixed coefficients are assumed between all intermediates and value added."}, {"section_title": "Protection Data", "text": "All distortions are represented as ad valorem price wedges. Border protection estimates combine tariff protection and the tariff equivalents of nontariff barriers into a single measure of protection referred to as the tariff rate.\nTrade in goods within Mercosur was tariff-free by 2000. Members were allowed a list of exceptions to the common external tariff, but the common tariff is being phased in for the exceptions and all members are obligated to fully converge to it by 2006 (WTO 2000, p. 20) . Because changes in protection data are crucial to the results and protection rate data are usually available for a more recent period than input-output tables, the protection data used are typically more recent than the data in the input-output tables.\n13 Similarly, tariffs on imports of goods between Argentina, Brazil, and Uruguay are assumed to be zero. Because the common external tariff was largely in place in 2003 and is scheduled to be fully implemented by 2006, Argentina, Brazil, and Uruguay are all assumed to apply it. 14 The North American Free Trade Association (NAFTA), too, is assumed to operate as an effective free trade area, with zero tariffs between Canada, Mexico, and the United States, but with each country maintaining its own external tariff. The model does not incorporate the preferential tariff rates 11. The results for low elasticites reported in Harrison and others (2003a) were erroneously reported as being based on s MM = 8 and s DM = 4; in fact, they are based on s MM = 16 and s DM = 8.\n12. The impact of unilateral trade liberalization on Argentina is one exception, for reasons explained later.\n13. Several sources of protection data were examined, and the data in the GTAP database were assessed as the best. The trade flow data are also from the GTAP database, which is for 1997. Because the input-output table and estimated factor payments in Brazil were updated, a balanced social accounting matrix (SAM) had to be created. An optimization procedure was employed in creating the new SAM that minimizes the sum of the squares of the difference between all the values in the new SAM and the original GTAP database, subject to the constraints of a SAM. 14. The common external tariff is imposed at the tariff-line level but is applied at the level of aggregation of the model. This involves no loss of generality, because if the common external tariff holds at the tariff-line level, then it must hold for more aggregate levels.\nfound in the many other regional trading arrangements in the Americas that are implemented at various levels of effectiveness. Table 3 shows the (trade-weighted) average protection rates by product category across all countries. The common external tariff of Mercosur is implemented by imposing the external tariff of Brazil as the external tariff of Argentina and Uruguay. Nonetheless, the trade-weighted average tariff is not precisely equal in all cases for the three countries because of product mix differences across sources of imports."}, {"section_title": "Brazilian Data for Poverty Analysis", "text": "Most of the data for Brazil, which are crucial to effective trade and poverty analysis, were independently constructed for this study. In addition to the protection data, the most important steps were to estimate factor shares in Brazilian industries, update the 1996 input-output table of the Brazilian economy from the 1985 base table in the GTAP database and use the household expenditure survey for Brazil to construct information on household expenditure patterns and sources of income.\nThe share of value added attributed to capital in input-output tables is notoriously overestimated in agriculture and services and is poorly represented in many manufacturing sectors. The convention of input-output authorities is to take capital's share as the residual from revenue after payments for intermediates, labor, and taxes. Agriculture's lack of official reported wage payments means that input-output authorities often report these sectors as the most capital-intensive sectors in the economy.\n15 Similar but less severe problems prevail in services. In manufactures, unprofitable sectors (which often do not export) have a low share of capital in the input-output tables, whereas profitable sectors (which more often export) have a high share of capital. In developing economies the result is that labor-intensive sectors, which may be the most profitable and export-oriented, are likely to be reported as capital-intensive sectors. Harrison and others (2003a) show how this problem can lead to perverse results.\nFactor shares in Brazilian industries were thus independently estimated for this study. The reestimation raised labor's share significantly in agriculture and, to a lesser extent, in services. For manufactures there were no significant differences between these estimates and the input-output table. This adjustment is fundamental to the results on the relative impact on the poor.\nHousehold expenditure and income patterns were extracted from the Living Standards Measurement Study (LSMS) survey for Brazil. The survey was designed and conducted by the Brazilian Institute for Geography and 15. Researchers at the International Food Research Institute and the Economic Research Service of the U.S. Department of Agriculture have noted this problem and adjusted for it (see Arndt and others 1998; Thomas and Bautista 1999; Hausner 1999; Burfisher and others 1992) .\nStatistics. The LSMS survey is a stratified sample, with each household representing a share of the total population in the area sampled. The LSMS focused on the eastern part of Brazil, but it is estimated to represent 103.6 million people in the region (about 63 percent of the total population), 22.3 million of them in rural areas and 81.3 million in urban areas. Although much of the country is not sampled in the survey, experts who have worked with the poverty data in Brazil believe that the poor are proportionally represented or at least are not underrepresented. 16 The Gini coefficient for the entire survey sample is estimated at 0.585.\nTo aggregate the approximately 5,000 Brazilian households in the survey into 20 households, all households in the sample were first ranked from poorest to richest based on per capita income. Per capita rather than household income was chosen to enable comparisons with the standard per capita poverty measures of the World Bank (World Bank 1990 and of Ferreira and others (1999) for Brazil. The sample was then divided into deciles, with an equal number of households in each decile (except for the richest decile, which has more households, because they were to receive less emphasis in the analysis). Each decile was then partitioned into two representative households: one rural and one urban. This partition means that the ith representative rural household and the ith representative urban household have about the same per capita income. Although the ith representative rural and the ith representative urban household do not have an equal number of households or individuals, the sum of the households they represent is equal, and the sum of individuals they represent is approximately equal. As a result, there are roughly 1,800 individuals in each household group, apart from the richest household group, which has just over 3,000 individuals (see table 2 ).\nThe shares of income each household spent on each commodity group and the shares of income each household obtained from capital, rent on land, unskilled wages, and skilled wages were extracted from the LSMS survey. Data on factor incomes were also available from national accounts, so the data from the two sources had to be reconciled before implementing the model. 17 For reasons to be explained, the total payments to factors were taken from the national accounts, and the factor shares of each representative household in the model were adjusted accordingly. 18 This reconciliation minimized aggregate deviations between household factor shares and expenditure shares from the 16. The authors thank Francisco Ferreira, Peter Lanjouw, and Marcelo Neri for helpful conversations on several aspects of assessing poverty in Brazil.\n17. A two-stage process in which price changes from a general equilibrium model are fed into a second-stage micro-simulation model can ignore this reconciliation. Of course, inconsistencies then arise if one then wants to allow for feedback from the second stage to the first stage after some policy shock.\n18. This rebalancing also required adjusting expenditure shares of households for broad categories of goods, to ensure consistency with the broad patterns of consumer expenditure in the national accounts.\nvalues obtained from the LSMS survey prior to rebalancing, and the shares were weighted by the value of household income and expenditure. The results are reported in table 4 and explained in Harrison and others (2003b, appendix D) .\nThis reconciliation of the two databases significantly increased the share of capital owned by wealthy households, particularly wealthy urban households. Income estimates from LSMS surveys are known to be lower than income estimates from national accounts (see Ravallion 2003; Deaton 2003) . Although there are biases in collection of both databases, so that neither source is clearly correct, Deaton (2003) believes that the most likely explanation for the difference is that households fail to respond to the survey, with the probability of nonresponse increasing monotonically with income. It also appears to be the case that the LSMS surveys report a lower share of income for capital than the national accounts do. Vanos (2003) mapped income from the LSMS surveys in 14 countries into factor shares and compared these with the GTAP database. Capital's share from the LSMS surveys was 21 percent of household income, but it was 52 percent of household income based on national account information in the GTAP database. The presumed pattern of nonresponse to the household survey would also help explain this difference in capital's share, because the rich are likely to have more capital than the poor."}, {"section_title": "19", "text": "What percentage of the households are poor based on the LSMS data? Poverty lines are defined in several ways. Two well-known measures are $1 a day per person or $2 a day per person at a purchasing power parity exchange rate. From the LSMS data 7.3 percent of the population lives on $1 a day or less and 17.8 percent lives on $2 a day or less. To calculate poverty in Brazil, Ferreira and others (1999) developed a measure of poverty based on a ''minimum food basket'' in the reference region, metropolitan Sã o Paulo, that would generate the Food and Agriculture Organization-defined minimum intake of 2,288 calories a day. They also developed indices that allow them to define ''equivalent'' income levels across individual households in different regions of the LSMS. Using purchasing power parity adjustments for 1996, this measure amounts to a poverty line of $1.50 per person per day. 20 Taking the poverty headcounts for each region in Brazil as reported in Ferreira and others (1999, table 3) and sample weights for the individuals in each of the regions of the LSMS in Brazil, their measure implies a national poverty index of 13.03 percent for Brazil using the LSMS."}, {"section_title": "21", "text": "Based on the Ferreira and others (1999) measure of poverty incidence and the full LSMS database, 82 percent of the households in the poorest two households, urban household 1 and rural household 1, fall below this poverty line. The poorer households are more populous, however, so that this amounts to 13 percent of the individuals in Brazil who are below the poverty line."}, {"section_title": "22", "text": ""}, {"section_title": "II. RESULTS A T T H E", "text": "The model estimates the aggregate change in welfare, measured by Hicksian equivalent variation, in Brazil and the other countries in the model as a result of the trade policy choices hypothetically made by Brazil (tables 5-7). The aggregate estimate of the change in welfare is the weighted sum of the welfare changes for the 20 individual households in the model, reported as a percentage 19. In Brazil, capital's share of factor income from the input-output tables is between 52 percent and 54 percent between 1995 and 1997. Capital's share of factor income is 54 percent in the Brazilian Survey of Industry for 1998 and 76 percent in the Brazilian Census of Agriculture for 1996. Factor shares in production were reestimated to correct for biases in agriculture and services, so that capital's share of income is 50 percent based on the national accounts. But Vanos (2003) estimates capital's share at 22 percent based on the LSMS survey. From our mapping of LSMS data, capital's share is about 10 percent.\n20. Specifically, they report a poverty level of 65.07 reals per month. This is divided by 30.417, the average number of days in a month, and then further divided by 1.44 to get the purchasing power parity equivalent in U.S. dollars. This is $1.48656, rounded to $1.50 for ease of recollection.\n21. They also report comparable numbers from an alternative survey, known as the PPD, which imply a national poverty index of 24.7 percent using comparable income measures.\n22. The average number of people is 5.8 in rural household 1 and 5.0 in urban household 1. This compares with an average of 3.9 for the entire survey. "}, {"section_title": "À1.2", "text": "Rest of the world of consumption and in 1996 U.S. dollars. The central elasticity results are presented explicitly, and important differences with low elasticities are also mentioned. Key macrovariables that are important for the interpretation of the household results are presented in table 7."}, {"section_title": "Regional Arrangements", "text": "As part of Mercosur, Brazil is negotiating participation in the FTAA as well as an EU-Mercosur free trade agreement. Brazil will gain an estimated 0.6 percent of personal consumption from the FTAA (about $3 billion; see tables 5 and 6, column 1). The gains to Brazil from a Mercosur-EU agreement are about 1.5 times greater. Both the FTAA and the EU-Mercosur agreement create very large economic areas, each with one large industrial country partner. These partners have export supply capacities that are large relative to the demand from smaller partners. For a given absolute change in demand resulting from a regional agreement, the larger capacity of these partner countries allows them to supply their smaller partners with relatively elastic supply curves. This prevents the supply price for imports from large partner countries from rising significantly. Finally, large countries offer improved market access, as emphasized in others (1997a, 2002) . Although in several cases preferential arrangements among small countries have been found to be welfare reducing, 23 for the reasons just mentioned the estimates show that Brazil and most countries in the Americas would gain from an FTAA and that Mercosur countries would gain from a free trade agreement with the European Union.\nThe one exception to this pattern in the Americas is Argentina, which is estimated to lose slightly from the FTAA. Without FTAA it enjoys preferential access to the markets of the other Mercosur countries. The FTAA provides equivalent access to the other countries in the Americas to the Mercosur market, eroding Argentina's preferential access. The effects of this loss of preferential access plus the trade diversion effects are larger than the trade creation effects."}, {"section_title": "24", "text": "The combined gains to Argentina, Brazil, and Uruguay are more than 50 percent larger from an EU-Mercosur agreement than from the FTAA (see tables 5 and 6, column 3). The European Union has several agricultural and food products with very high tariffs (see table 2 ). If Argentina, Brazil, and Uruguay obtain tarifffree access to these markets while the European Union continues to apply these tariffs on other countries, the three countries would receive large terms of trade gains in EU markets. The gains for Uruguay, a relatively small economy, would 23 . See Harrison and others (2002) and Bakoup and Tarr (2000) . Uruguay also loses from participation in Mercosur.\n24. Pereira (1999) and Teixera and others (2002) find the same result for Argentina in the FTAA. Although the gains to Brazil from the FTAA are also eroded because of erosion of preferential access in Argentina, Argentina is a smaller market than the Brazilian market. Thus the erosion of preferential access in the partner's market is more important for Argentina. be between 6 percent (with low elasticities) and 44 percent (with the central elasticities)."}, {"section_title": "25", "text": "Countries excluded from the agreements typically lose. The European Union, Japan, and the rest of the world all lose from the FTAA, for a combined loss of $8.4 billion (see table 6, column 1). The excluded countries suffer a decline in demand for their exports to the Americas as importers in the Americas shift demand toward suppliers from the Americas. Hence there is both a terms of trade loss on sales that continue and an efficiency loss from having to shift to alternate markets or products. The European Union is estimated to lose $2.6 billion, slightly more than the $2.3 billion the United States is estimated to gain. One exception is Japan under the EU-Mercosur agreement. Japan obtains a small terms of trade improvement in the markets of the rest of the world as countries included in that agreement shift their trade toward each other's markets. The gains to Japan, however, are very small and round to zero at the nearest 0.1 percent of Japan's consumption.\nThe benefits to Brazil from these two agreements exceed the sum of the benefits for each agreement separately. This is because the combined economic area of the Americas plus the European Union is vast, so Brazil is the less likely to face adverse terms of trade effects as a result of consuming a large share of any exporter's supply. Lost tariff revenues from diverting trade to partner countries that are part of either agreement taken separately are reduced by combining the two agreements. Thus negotiating an agreement with the European Union in addition to the FTAA appears likely to increase the welfare gains to Brazil."}, {"section_title": "26", "text": "Limitations on Market Access: The Impact of Antidumping, Rules of Origin, and EU Agriculture Exclusions\nAlthough preferential trade arrangements with large industrial countries offer developing economies the promise of increased access to large markets, in practice limitations on improved access significantly reduce the benefits. The European Union has steadfastly refused to grant tariff-free access in its highly protected agricultural products in its association agreements with Central and Eastern European countries, its customs union agreement with Turkey, and its free trade area agreements with various Mediterranean countries (Morocco, Tunisia). Hence it is a priori unlikely to offer such concessions to Mercosur 25. The gains to Uruguay come primarily from the meat sector. Attracted by the tariff umbrella of 95 percent tariffs in the large EU market, Uruguay will dramatically expand meat output and exports to the European Union in the long run. Meat exports are a much more significant share of gross domestic product in Uruguay than they are in Argentina or Brazil. Thus the welfare gain from an improvement in the export price in the European Union in this sector can be expected to result in a larger welfare gain than in Brazil or Argentina. It is likely, however, that such a large expansion of the meat sector would be constrained by ''specific factors'' in Uruguay that were not modeled.\n26. These results are similar to those Harrison and others (2002) found for the ''additive regionalism'' strategy of Chile, which yielded significantly larger benefits than the agreements taken separately.\nwhen it has refused to offer them to countries for which it might be viewed as having more to gain geopolitically.\nAs for the FTAA, the United States has strongly resisted efforts to limit the use of antidumping actions as part of the FTAA despite a proposal by Chile to include such a limitation. As the use of tariffs and nontariff barriers has declined, the use of antidumping as a protectionist device has risen significantly in the United States (Finger 1993 ) (and more recently in the European Union as well; see Messerlin and Reed 1995) . Antidumping actions have focused on four sensitive sectors: chemicals, metals, nonelectrical machinery, and electrical equipment. Thus Brazilian authorities have expressed the fear that the benefits of nominally improved access to U.S. markets will be denied by antidumping actions.\nFinally, free trade agreements involve rules of origin, requiring that exporters source a share of inputs from within the preferential area. Evidence is accumulating that these rules of origin significantly limit the improved market access of preferential tariff concessions. The Africa Growth and Opportunity Act provides preferential access for African exports to the U.S. markets. Mattoo and others (2002) found that African nonoil exports to the United States would increase by about 50 percent without the stringent rules of origin but by only 10 percent with them. Estevadeordal (2000) found that restrictive rules of origin limited Mexico's improved access to the U.S. market under NAFTA. Brenton and Manchin (2003) argue that EU preferential trade agreements have been ineffective in delivering improved market access, most likely because of the restrictive rules of origin and the costs of proving compliance.\nTwo simulations illustrate how these limitations of market access by the European Union and the United States can affect the potential gains.\nExcluded Agricultural Products in the EU-Mercosur Agreement. This scenario assumes that the European Union fails to provide improved market access to its most highly protected agricultural products in an EU-Mercosur agreement. The EU tariff rates in the database are 65 percent for paddy rice, 44 percent for cereal grains, 86 percent for processed rice, 28 percent for other food products, 95 percent for bovine meat products, 90 percent for dairy products, 61 percent for other meat products, and 76 percent for sugar. These are products in which the Mercosur countries have a comparative advantage, so if the free trade agreement between the European Union and Mercosur excludes these products, the expected benefits would be significantly reduced.\nUnder the central elasticity results the denial of full market access to these key agricultural products reduces the value of the EU-Mercosur agreement to Brazil from 0.9 percent of consumption to 0.1 percent (see tables 5 and 6, column 4). The estimated gains for Uruguay are also dramatically reduced. The gains to the European Union are also reduced, from 0.5 percent of its consumption to 0.1 percent, reflecting the importance of agriculture liberalization if EU consumers are to reap gains from the agreement.\nAntidumping and Rules of Origin in the FTAA. Limitations on access to the U.S. market are more likely to come from restrictive rules of origin and the use of antidumping actions than from explicit exclusion of certain products. Indeed, Brazilian authorities have expressed the fear that the benefits of improved access to U.S. markets will be denied by antidumping actions, as in the steel sector. This scenario estimates the costs to Brazil of continued U.S. protection of its most protected markets even with the FTAA. Protection is 53 percent on sugar, 42 percent on dairy products, 18 percent on oil seeds, and 14 percent on other crops."}, {"section_title": "27", "text": "For these sectors the United States is assumed to employ antidumping duties or stringent rules of origin to neutralize the impact of the FTAA on Brazil's exports (in other words, the U.S. tariff on exports of these products from Brazil does not change)."}, {"section_title": "28", "text": "The impact is to reduce the benefits to Brazil to about two-thirds of the gains it would receive with full market access in the FTAA (see tables 5 and 6, column 2). The reduction is not as severe as with the excluded products in the EU agreement. The large impacts tend to be driven by the tariff peaks, which are not as high in the U.S. market as in the European Union. If the United States fails to provide preferential access to its highly protected products, Brazil can sell these products in other markets in the Americas that also open up to Brazil on a preferential basis as part of the FTAA. With the EU-Mercosur agreement there are no alternate markets in which Brazil has preferential access.\nFTAA with No Change in Mercosur's External Tariffs. To identify the source of gains, especially at the household level, the impact of the FTAA with no improved access to Mercosur markets is also evaluated. This scenario shows how much of the gains to Brazil come from improved access to the markets of the Americas and how much from lowering Mercosur tariffs, thereby achieving improved resource allocation in Brazil. In this scenario the countries in the Americas outside of Mercosur are assumed to lower their tariffs preferentially to all countries in the Americas (so Brazil obtains improved market access), but the Mercosur countries do not lower their common external tariffs against partner countries in the Americas (so Brazil does not offer any improved market access).\nUnder this scenario the gains to Brazil are reduced to 0.4 percent of consumption. This shows that improved market access is responsible for about twothirds of the gain to Brazil from the FTAA and that the remaining one-third of the gain comes from the preferential lowering of the Mercosur tariff (see tables 5 and 6, column 8).\n27. The category ''other crops'' is an aggregate of the following sectors from the full GTAP data set: wheat, vegetables and fruits, fiber-based plants, wool, forestry, fishing, and other crops. Simulations were also performed with wheat as part of grains rather than other crops. Argentina gains more from the EUMercosur agreement, but otherwise most of the results change by very small amounts.\n28. This is not a full treatment of the potential use of antidumping or rules of origin within the FTAA or of the impact on Brazil. Such treatment would have to account for antidumping duties and stringent rules of origin by the United States against other products and partners in the Americas as well and for the use of antidumping and stringent rules of origin by countries other than the United States."}, {"section_title": "Tariff Cuts and Uniformity in Mercosur or Multilateral Liberalization-or Both", "text": "Simulations were also run for unilateral tariff cuts by Mercosur and for cuts through multilateral trade liberalization under the WTO. Unilateral Trade Liberalization by 50 Percent and Tariff Uniformity. A 50 percent cut in Mercosur tariffs will result in a welfare increase of about 0.4 percent of Brazilian consumption or about $1.9 billion a year (see tables 5 and 6, column 6). Thus the gains from the FTAA with excluded access to the U.S. market on selected products results in about the same gains as a unilateral tariff cut by Mercosur of 50 percent. With low elasticities, however, the gains are only about 0.2 percent of consumption for Brazil, or $0.4 billion, and the impact on Argentina is negative. 29 The larger terms of trade effects with the lower elasticities account for the lower gains from tariff reduction.\nTariff uniformity (with the same collected tariff revenue) in Mercosur will result in slightly larger welfare gains than a 50 percent cut in tariffs. These results are consistent with earlier results on the benefits of tariff uniformity for Turkey and Chile others 1993, 2002) . Similarly, Martinez de Prera (2000) found welfare gains from tariff uniformity in all 13 countries evaluated. Although theory indicates that taxes are more efficient if they are higher on products with relatively low elasticities of demand, evidently tariffs do not typically differ from uniformity in these economies for tax efficiency reasons. 30 On the contrary, the large gains from trade liberalization typically come from reducing tariff peaks, which is effectively accomplished through tariff uniformity. Reducing low tariffs results in proportionately smaller gains and may even result in losses if the importing country possesses monopsony power.\nMultilateral Trade Liberalization. Brazilian authorities have also encouraged multilateral trade negotiations and supported the Doha Development Agendain part because of a belief that it is the most likely way to achieve agricultural liberalization. In this scenario all countries in the world reduce their tariffs and export subsidies and their taxes by 50 percent.\nBrazil gains about 0.9 percent of personal consumption from multilateral trade liberalization in the static model, or about $4.6 billion a year (see tables 5 and 6, column 7). These are larger than the gains from the FTAA and those from an agreement with the European Union that excludes the highly protected 29. Harrison and others (1997c, appendix C) show that the optimal tariff t in any sector of the model is bounded below by t* = {[s MM /(s MM -1)] -1}. Thus even in the central elasticity case with s MM = 30 the optimal tariff is more than 3 percent. But in the low elasticity scenarios, with s MM = 8, the optimal tariff is more than 14 percent. With an average Mercosur tariff of 12 percent, the optimum uniform tariff is lower than the existing average tariff in the central elasticity scenarios. The small gains that remain are due to lowering the tariff peaks.\n30. The set of elasticities that were chosen, however, makes uniformity beneficial in general. That is, the Ramsey optimal taxation rule suggests that higher taxes should be placed on goods with the lower elasticity of demand. With the virtually homogeneous choice of elasticities here, the Ramsey optimal tariffs are close to uniform. agricultural and food products. Because these products are likely to be excluded from a Mercosur agreement with the European Union, the results support the strategy of the Brazilian authorities to pursue multilateral liberalization along with the regional options.\nThe gains to the world from the 50 percent cut in tariffs and export subsidies are estimated at $186 billion with central elasticities (see table 6, column 7) and $87 billion with low elasticities. As Harrison and others (1997b) argue in assessing the Uruguay Round, elasticities play an important role in explaining differences in aggregate gains from multilateral trade liberalization.\nThe household results follow a similar pattern across all of the policy scenarios (table 8 ). The poorest household will typically gain several times the aggregate gains for the economy expressed as a percentage of household consumption."}, {"section_title": "31", "text": "Although the impact on household incomes is not strictly progressive, the four poorest urban households and four poorest rural households are among the biggest gainers from the reforms as a percentage of their own household consumption.\nWhat accounts for this robust and encouraging result? Trade protection in Brazil favors capital-intensive manufactures, so liberalization shifts resources toward more unskilled labor-intensive agriculture. Thus the wage rate of unskilled labor increases significantly more that the rent on capital (see table 7) . 32 The poorest households earn most of their income from unskilled labor (see table 4), so they gain proportionally more than other households.\nAlthough the impact on sectors depends on the specific agreement, there is a general pattern. Oilseeds, other agriculture (excluding grains and wheat), other crops (which includes fruits and vegetables and wheat), processed food, and leather sectors expand production and exports. These sectors, especially the agricultural sectors, 33 are the most intensive users of unskilled labor in the model. Several manufacturing sectors decline, including motor vehicles, other metal products, and other manufacturing. These declining sectors are among the most capital-intensive in Brazil.\nThese outcomes reflect relative protection in Brazil, which favors manufacturing at the expense of agriculture and processed food products. Despite substantial trade liberalization, vestiges of Brazil's import-substitution indus-31. The percentage gains for the poor relative to the aggregate percentage gains are similar for low trade elasticities.\n32. The poor typically have not accumulated large stores of real assets or financial assets, so they do not earn significant capital income or income from the rent of land. Nor have the poor typically accumulated much human capital, so they earn a much smaller share of their income from skilled labor than do the middle classes.\n33. The EU-Mercosur agreement (without exceptions) induces a much larger increase in agricultural output in Brazil than do the other agreements because of the large increase in preferential access for Mercosur countries in the European Union. \nRural 1 trialization protection structure remain. When protection in the economy is reduced, resources shift toward the agriculture and food sectors that had been disadvantaged relative to manufacturing. The expanding sectors tend to be less capital-intensive than the contracting sectors. International trade theory argues that the price of the factor of production used intensively in protected sectors should fall relative to the price of the factor of production in the unprotected sectors following trade liberalization. 34 Thus the wage rate of unskilled labor rises relative to the rent on capital, benefiting the poor. Because the value of land rises even more than the wage rate of unskilled labor, two of the richest rural households are the biggest gainers from the reforms.\nTo document this interpretation of why the poor can be expected to gain proportionally more than wealthier households, the impact of the FTAA on households was decomposed in table 9. Column 1 reproduces the base results from table 8 for the FTAA. Column 2 presents the results of assuming that all households consume the commodities in the same proportions. Although the gains to the poorest households decline slightly, they remain three to four times greater than the percentage gains for all households together. Thus, disparate consumption shares do not explain why poor households gain more from the trade policy changes.\nColumn 3 presents the results of the FTAA scenario in which all households are assumed to earn the same shares of income from the wages of unskilled labor and skilled labor and rent on capital and land. Most of the poorest households would obtain only a slightly greater increase in income than the average for all households of 0.6 percent. This confirms that it is the more than proportionate rise in the price of the factors of production important to the income of poor households that explains why poor households gain more from these trade policy options. The factor most important to the poor is the wage rate of unskilled labor (see table 4), which rises fastest among the important household income factors (see table 7 ).\nAn additional simulation offers further support for this explanation. For reasons explained earlier, the capital intensity in agriculture sectors is estimated to be significantly less than reported in the Brazilian input-output table. There is a dramatic difference in the results for the estimated welfare gains from the FTAA to Brazilian households when the biased factor shares in the GTAP data are used instead of the corrected data. The poorest rural household is estimated to gain 0.5 percent of its consumption and the poorest urban household 0.4 percent, equal or slightly less than the aggregate average percentage gain (see table 9 , column 4). This shows that the corrections to the factor share data are crucial to the results at the household level and supports the interpretation that the shift of 34. This is known as the Stolper-Samuelson theorem. In this model, however, product differentiation mutes strict application of the Stolper-Samuelson results. resources toward agriculture is important in increasing the incomes of the poor and reducing poverty.\nThe results also show that the Mercosur tariff changes are more important to the poor than improved market access (see tables 5 and 8, column 8). In this scenario Mercosur does not change its own tariffs but obtains improved access to the markets of the Americas. The average gains to the economy fall by about one-third compared with the FTAA gains, but the gains to the poorest households fall by two-thirds. This is because Mercosur's tariff changes induce output expansion in the sectors that intensively use unskilled labor, thus increasing unskilled wages relative to other factor prices. Improved market access does not increase the price of unskilled labor relative to capital. With only improved market access, the poor gain, but not progressively as they do with internal liberalization in Mercosur. Although the trade reforms are significantly propoor, the model implicitly assumes a time horizon long enough to reestablish equilibrium after some policy shock. Thus it is possible that during the transition to a new equilibrium some poor households will be hurt. This is especially likely among households that move out of the declining sectors, such as the more highly protected manufacturing sectors. This emphasizes the need for an effective safety net to assist the poor.\nTo test the robustness of the results with respect to parameter specification, 500 simulations were conducted of the impact of the FTAA. Key parameter values were drawn randomly from specified probability distributions (see Harrison and others 2003b , appendix F on systematic sensitivity analysis). As a result of the FTAA, the following results will hold with virtual certainty: Brazil will gain at least 0.3 percent of its consumption, FTAA members will gain at least $12 billion a year, excluded countries will lose at least $6.7 billion a year, and the poorest urban and rural households will gain at least 1 percent of their income. The sensitivity results confirm the conclusions drawn from the point estimates of the gainers and losers at the household level and the aggregate country level."}, {"section_title": "C O N C L U S I O N S", "text": "Both the FTAA and an EU-Mercosur agreement would benefit Brazil, but exceptions to the agreements (rules of origin, antidumping, and agricultural exclusions) would significantly diminish the gains. The estimates presented here indicate that Brazil can optimize its choice of trade policies by combining regional arrangements in both the Americas and Europe with multilateral liberalization. If tariff uniformity is added to the regional and multilateral liberalization, further gains could be realized.\nBoth the FTAA and the EU-Mercosur arrangements are net trade creating for the countries involved, but excluded countries almost always lose. Multilateral trade liberalization results in gains to the world more than four times greater than either of these relatively beneficial regional arrangements, showing the importance of multilateral negotiations.\nMost of the trade policy options evaluated result in a progressive distribution of the gains to Brazilian households, with the poorest households experiencing the greatest percentage increase in their incomes. Trade policy changes tend to shift resources from capital-intensive manufacturing toward unskilled laborintensive agriculture and less capital-intensive manufacturing, inducing an increase in unskilled labor wages relative to the prices of other factors of production. The percentage increase in the incomes of the poorest households is three to four times greater than the average percentage increase in income for the economy as a whole.\nA micro-simulation model would likely find that some poor households could lose, especially in the short run. This emphasizes the need for having effective safety net policies in place. But because the sectors that are important to the poor tend to be disfavored by the structure of protection, the medium-to longrun effects of these trade reforms should be positive for the vast majority of the poorest households."}]