[{"section_title": "", "text": "T he U.S. horticultural industry, grossing $13.8 billion in 2014 [U.S. Department of Agriculture (USDA), 2015], faces numerous challenges to maintaining successful, independently owned retail businesses (Hodges et al., 2011) . Palma et al. (2012) reported that horticultural businesses are facing heightened competition and may be using relatively inefficient marketing channels (e.g., one-way communication through printed material such as phone books, catalogs, newspaper, or mail) to reach today's online consumers, who increasingly use smartphones as portable search tools to gather information before making purchase decisions related to gardening products (Behe et al., 2013) . High-quality online presence is essential for the viability of horticultural businesses; lack of modernization, however, coupled with often limited resources for developing online content, have resulted in slow adoption of new sales technology in small to medium enterprises, such as garden centers, nurseries and other horticultural businesses (Dahnil et al., 2014) .\nOne way that smaller, independently owned horticultural businesses can potentially succeed is by expanding their customer base through ODS, or e-commerce. Rural businesses, in particular, could benefit from adoption of ODS to increase the viability and sustainability of their business across a broader marketplace than what is afforded with a brick-andmortar store only. In this paper, we categorize ODS as online-shopping websites for retail sales directly to consumers or selling through online marketplaces [such as Amazon and eBay (San Jose, CA)]. In ODS, no transactions are conducted face-toface. This is a virtual exchange of information where the customer inputs their contact and payment information in exchange for shipping and delivery of a product. Amazon is the largest ODS provider in the United States and accounted for 60% of online sales growth in 2015, a growth of $23 billion (Garcia, 2016) . Historically, evidence indicates very few horticultural businesses participate in ODS (Avent, 2003; Stanley, 2002) ; however, more empirical evidence of horticultural businesses' ODS sales volumes are needed.\nResearch investigating the adoption of ODS in other industries (Li and Xie, 2012; Li et al., 2011; Ng, 2013) , indicates that ODS adoption is complicated. Many researchers have explored factors important to adoption of ODS from a business perspective (Table 1) . Businesses struggle to understand the required technology for ODS adoption, and the relative advantage over previous technologies is confusing to many entrepreneurs. In a case study of ODS in Australian agribusiness, both internal and external factors were identified as equally influencing the adoption of ODS (Ng, 2013) . Internal factors identified were resources available, target market segment and market scope, nature of products and services, technological infrastructure and knowledge, types of business strategy, organizational structure and culture, understanding of sales models, online and offline marketing strategies and objectives, and market positioning. External factors were strategic partners, competitors, type of industry, consultants, buyers and suppliers, government agencies, market trends, and environmental factors. In a separate study looking at small and mediumsized businesses' adoption of ODS (Li et al., 2011) , results indicated that many aspects of ODS are not clear to businesses until they make the decision to adopt, rendering the perception of ''ease of use'' complicated. Innovation or willingness and propensity for risk were significant factors in whether a business chose to adopt ODS. Researchers recommended making the benefits of ODS clear to small-and medium-sized businesses to encourage ODS adoption (Li et al., 2011) .\nAnother study looked at commonalities across research on the diffusion of ODS, which included work in multiple countries with multiple sizes and scopes of businesses (Li and Xie, 2012) . Common factors among studied businesses were institutional environment, economic environment, sociocultural environment, firm size and structure, corporate strategy, globalization, managerial attitudes, external pressure, macro technology environment, and firms' ability to navigate the technology landscape. Researchers grouped these factors into three categories: environment perspective, firm perspective, and technology perspective. After further analysis, researchers recommended businesses evaluate internal resources and consider whether the internal environment is friendly to ODS before beginning it. Additionally, businesses considering ODS should determine if the external environment is appropriate for ODS, including determining if delivery systems are in place for products, whether customers are ready to purchase online, and if the ODS system is reliable (Li and Xie, 2012) .\nFrom a consumer perspective, multiple factors influence the decision to purchase a product online. Researchers have explored these factors in other industries (Table 2) , and results indicate that return policy, product quality, price strategy (Li et al., 2013) , on-time delivery, terms of sale, pictures, shipping charges, and selection of product options (Dholakia and Zhao, 2010) are important factors for customers when choosing to purchase online. No previous studies have looked at how these characteristics translate to horticultural businesses.\nSelling plants on Amazon can be a challenging venture. While listing items for sale on Amazon is relatively straightforward, having a brand presence is considerably more difficult. Amazon does not allow website copy to direct or link to a seller's own e-commerce site, nor does it allow advertising materials referring to another e-commerce website in packaging materials. In addition, seller requirements are strict, particularly when participating in the Amazon Prime 2-d shipping service, which can be difficult when shipping live plants. Amazon's ''Selling on Amazon'' website indicated their pricing model for professionals included both a monthly fee ($39.99) as well as a per-item fee which varied by category. Additional fees applied when selling through ''Fulfillment by Amazon,'' a service which picks, packs, ships, and provides customer service for third-party sellers (Amazon Services LLC, 2018) .\nIn recent years, Amazon's presence in the live plant marketplace has increased at a rapid pace. A 2015 Business Insider article ''Now Amazon will let you rent goats'' (Ryssdal, 2015) noted Amazon's entrance into the residential marketplace with their ''Home Services'' offerings. Few offerings were available outside of major metropolitan areas; offerings traditionally considered horticultureindustry services, however, were listed on the website: Examples included landscape maintenance, lawn mowing, aeration, over-seeding, snow removal, pruning, fertilization, plant health evaluation, planting, and mulch delivery. Essentially, this part of Amazon's website helped connect consumers with local providers and took a percentage of the price as commission.\nIn 2016, the first industry e-newsletter article citing Amazon's interest in the horticulture industry was published in GrowerTalks Magazine. The author suggested that Amazon could potentially do very well in the horticulture marketplace (Beytes, 2016) . At the time, products available were primarily seeds, with increasing sales in the ''Fresh Flowers & Live Indoor Plants'' category. Perennials, herbs and a few 1-gal woody crops were also available. In 2017, Greenhouse Grower Magazine noted Amazon's entrance into plant retail and suggested strategies growers should consider to navigate the coming marketplace changes (Miller, 2017) . Shortly after that article was published, Relative advantage How much an innovation improves on the previous generation. Ng, 2013; Rogers, 2003 Compatibility How well an innovation fits into a business' operation."}, {"section_title": "Rogers, 2003", "text": "Ease of use The level of difficulty of adopting an innovation. Li et al., 2011; Ng, 2013; Rogers, 2003 Observability The extent that an innovation is visible to others. An innovation that is more visible will drive communication among networks and will create positive and/or negative reactions.\nTrialability How easily an innovation may be experimented with as it is being adopted/how much investment is needed to try the innovation. Li et al., 2011; Rogers, 2003 Internal environment Innovativeness, entrepreneurial culture, businesses strategy and culture, propensity for risk. Li and Xie, 2012; Li et al., 2011; Ng, 2013; Rogers, 2003 External environment Product shipping methods, transportation, other factors outside of the business' control.\nLi and Xie, 2012\n• August 2018 28 (4) Table 2. Online direct selling attributes of interest from a consumer perspective when considering purchasing a product online. Previous work by authors listed below describes factors important to consumers of non-horticultural products in order for them to complete and be satisfied with online product purchases. Attribute"}, {"section_title": "Description Based on work by", "text": "Return policies and terms of sale, money-back guarantee\nConsumers have come to expect return policies and money-back guarantees. Dholakia and Zhao, 2010; Kim and Kim, 2004; Li et al., 2013 Pictures, ability to ''see'' merchandise Quality of photos, quantity of photos, photos and video of people interacting with a product or seen in its ''natural'' state, product details and visual elements. Dholakia and Zhao, 2010; Kim and Kim, 2004 Shipping charges Cost of shipping is considered by consumers and may impact purchasing decisions and/or quantity purchased. Dholakia and Zhao, 2010; Kim and Kim, 2004 Selection of product options Purchasers consider product options related to styles, colors, diversity of options and sizes. Dholakia and Zhao, 2010; Li et al., 2013 Product price Price of product is considered alone and in comparison with other similar products from other retailers."}, {"section_title": "Li et al., 2013", "text": "On-time delivery, quick shipping\nCustomers expect on-time delivery and are accustomed to quick shipping options with reliable estimates of delivery time. Dholakia and Zhao, 2010; Kim and Kim, 2004 Product quality\nProduct quality or degree of excellence is an important factor for consumers when making a purchasing decision. Behe et al., 2013; Chung-Hoon and Young-Gul, 2003; Li et al., 2013; Ng, 2013 Customer reviews Consumers read, trust, and make purchases based on reviews from other consumers. Kim and Kim, 2004; Lee et al., 2011 Service after sale\nContinued customer service after a sale is an important factor in decision to purchase.\nChung-Hoon and Young-Gul, 2003; Dholakia and Zhao, 2010; Kim and Kim, 2004 Awareness of online sales in the specific product area\nCustomers must be aware of the availability of the specific product category being offered through online sales.\nChung-Hoon and Young-Gul, 2003\nSuggested care, information about after-sale\nCustomers value information about suggested care for product and after sale care when making a purchasing decision.\nChung-Hoon and Young-Gul, 2003\nSite security, trust\nCustomers value sites that have tight security for online purchases and feel trustworthy.\nChung-Hoon and Young-Gul, 2003; Kim and Kim, 2004; Lee et al., 2011 Loyalty program, site commitment, trust\nCustomers value loyalty programs and can become exclusive with a specific site because of loyalty and commitment benefits.\nChung-Hoon and Young-Gul, 2003; Kim and Kim, 2004; Lee et al., 2011 Purchasing intent/behavior Customers' intent to purchase and behavior (length of time on page, customer reviews read, etc.) when visiting a site are linked to their decision to purchase.\nChung-Hoon and Young-Gul, 2003; Lee et al., 2011; Li et al., 2013 Product knowledge\nCustomers' knowledge about the product (facts, information) affected their decision to purchase a product. Lee et al., 2011; Rogers, 2003 Greenhouse Grower Magazine profiled Costa Farms' (Miami, FL) expanded customer footprint in the e-commerce market through its purchase of Delray Plants (Delray Beach, FL), an established ODS business (Drotleff, 2017) . In Oct. 2017, Amazon received approval for a patent (no. US 9779442) related to computer-assisted ability to ''provide a recommendation for garden items'' (White, 2017) . As noted in GrowerTalks' Acres Online e-newsletter (Beytes, 2017a) , the online retailer has quickly moved into the live plant marketplace, opening the ''Amazon Plants Store'' (Beytes, 2017b) , which features the Proven Winners brand of plants. The presence of this new online plant store has been rapidly picked up by the popular press in the United States (Price, 2018) .\nWhile Amazon provides an established infrastructure for ODS, selling via an independent e-commerce website allows greater flexibility, the opportunity for cohesive branding, and better opportunities for managing customer expectations and relationships. However, the burden of website platform development and product delivery rest solely on the business. Many factors must be considered when choosing whether to enter the ODS marketplace and it is not appropriate for every horticultural business. Education and resources for businesses considering entering the ODS market will help them be more successful.\nThe purpose of this study was to determine whether horticultural businesses were directly selling live plant products online, either on Amazon or from their' own websites, as a way to benchmark the growth of ODS in the horticulture industry. The study also sought to describe sales characteristics of products available through Amazon from horticultural companies. The following research objectives guided this study: 1) determine if and how ODS is used by horticultural businesses on Amazon; and 2) determine if and how ODS is being used by horticultural businesses through businesses' own websites."}, {"section_title": "Materials and methods", "text": "A quantitative content analysis was used to determine how horticultural businesses were using ODS to sell live plants to customers. This research method allows for objective and systematic quantitative description of content (Berelson, 1952; Krippendorff, 2013) often in an online environment (Ary et al., 2010) .\nThe census sample selected for this study consisted of 498 businesses with current membership in a national association for the horticulture industry, including breeders, greenhouse and nursery growers, retailers, distributors, interior and exterior landscapers, florists, students, educators, researchers, and manufacturers (AmericanHort, 2016) . The mission of AmericanHort (Columbus, OH) is to ''unite, promote and advance our industry through advocacy, collaboration, connectivity, education, market development, and research' ' (AmericanHort, 2014) . This list was selected because of the association's focus on leadership, advocacy, and growth of the entire horticultural industry in the United States. It is common in quantitative content analyses to begin with a predetermined list (Edgar et al., 2017) , particularly in an area where previous work has not been conducted or a specific industry or organization is of interest (Abrams and Meyers, 2012; Baker and King, 2016) . This allows for an initial description of the population.\nA codebook is the major tool used in a quantitative content analysis and consists of variables and measurement for variables within the study (Krippendorff, 2013; Riffe et al., 2005) . The codebook for this study was developed by studying published research papers that examine ODS in other industries (Dholakia and Zhao, 2010; Li et al., 2011; Li et al., 2013; Ng, 2013) and was based on recommendations by Riffe et al. (2005) and Krippendorff (2013) , which are works that set forth the foundation of quantitative content analysis as a method of data collection. The codebook comprised 15 variables including 1) presence on Amazon. If a business was on Amazon, researchers coded for the next variables of 2) number of products available, and details about the first available product including 3) photo quality (categorized on a two-point scale of either good or bad); 4) shipping costs; 5) shipping method; 6) approximate shipping time; 7) richness of product description (measured by the number of sentences in the description); 8) average consumer review; 9) total number of reviews; 10) presence or absence of warranty information; 11) presence of company website; 12) presence or absence of sale/discount/ loyalty or reward program; 13) presence or absence of return policy; and 14) presence or absence of suggested care instructions. The final variable was 15) selling on businesses' own website. This variable included options for selling with a fully functional shopping cart, selling with a downloadable order form emailed to the business or otherwise received electronically, and not selling online directly to the consumer. Researchers did not count selling books, carts, or other hard-good supplies. The only products counted were live plants and cut flowers. After the study was conducted, researchers created a 16th variable of USDA Rural Classifications. Zipcodes of the businesses were used to create the 16th variable using the publicly available index provided on the USDA Economic Research Service (USDA, 2013).\nThe codebook was reviewed by a panel of experts [authors L.M. Baker (agricultural communications specialist), C.R. Boyer (horticulture specialist), and H.H. Peterson (agricultural economics specialist)] for face content and validity (Krippendorff, 2013) before moving forward with establishing interrater reliability. Three coders (undergraduate research students at Kansas State University) were trained to use the codebook. After the training, coders used 20% of the sample to establish interrater reliability using Cohen's kappa (Krippendorff, 2013; Riffe et al., 2005) . Interrater reliability is the standard measure of reliability for a quantitative content analysis (Riffe et al., 2005) . Data were collected within 24 h of one another in Spring 2016 to reduce the chance of changes to products or price. Interrater reliability was achieved on each of the 15 variables with a Cohen's kappa of 0.70 or higher as recommended by Riffe et al. (2005) and Krippendorff (2013) . After interrater reliability was achieved on the first 20% (100) businesses in the study population, the three researchers divided the remaining 398 businesses and coded independently. This is the highest standard of reliability as recommended by Riffe et al. (2005) and Krippendorff (2013) . Data were analyzed for descriptive statistics using This exploratory study includes limitations similar to all research in a new area. When establishing the codebook, there was no previous work with this specific population on which to base the variables. Researchers used variables from previous studies on diffusion and online selling of other products as a guide. However, some variables that would have been valuable to measure with this specific industry were not included in the scope of this research. For example, not included was whether the business was retail, wholesale, or a combination. Additionally, time was a factor, so some variables that would have been interesting to explore were outside the scope of this initial benchmarking study. This research describes this specific population at the time the data were collected."}, {"section_title": "Results and discussion", "text": "Objective 1: Determine if and how ODS is used by horticultural businesses on Amazon.Of the 498 horticulture businesses, only four businesses (0.8%) were selling live plants or flowers on Amazon. Of the four businesses selling plants through Amazon, the number of products ranged from 2 to 24 with 1 to 2 photos of each product (Table 3) . Shipping time ranged from 4 to 22 d with shipping costs ranging from $4.89 to $40.00. Two of the businesses selling on Amazon did not have any customer reviews, one had a 1-star review, and one had a 5-star review. None of the products were available with Prime shipping, which is Amazon's free, guaranteed 2-d shipping method. Two businesses provided warranty information and two did not. None of these businesses had loyalty programs, sales, or discounts. Two businesses offered suggested care instructions for products, and two did not. None of the businesses mentioned a return policy.\nObjective 2: Determine if and how ODS is being used by horticultural businesses through businesses' own websites. A total of 44 (8.8%) were selling on a business website through a fully functional shopping cart system, and 48 (9.6%) had an online order form that could be downloaded and emailed or submitted online in some other way (Table 4) . The remaining 406 (81.5%) businesses were not selling live plants through the businesses' website in any form.\nThe USDA rural-urban commuting area (RUCA) system was applied to the business zip codes, which revealed 435 (87.3%) of the businesses were located in metropolitan areas, 47 (9.4%) were in micropolitan areas, 14 (2.8%) were in small towns, one (0.2%) was in a rural area, and one business was in Puerto Rico where the USDA RUCA system did not apply (Table 5 ). The one rural business in the current sample was not selling online; and of the 14 businesses in small towns, only one was selling online with a fully functioning shopping cart (Table 6 ). Two of the 14 businesses in small towns were selling online with an online order form, and 11 were not selling plants online.\nIt is clear that a majority of horticultural businesses have not adopted ODS and that the industry is in the early stages of using this technology. While the sample of businesses selling on Amazon was too low to draw many useful conclusions, it appears that horticultural businesses are struggling to meet the current expectations of online customers. As online shopping becomes more ubiquitous, customers have high expectations when engaging in ODS, regardless of the type of product purchased. Within the sample, many websites were not user-friendly and lacked cohesive branding and marketing strategy. The 48 businesses selling online with an order form (9.6%) made it difficult for consumers to purchase products online. Some order forms contained language such as ''after submitting the form if someone has not contacted you within seven days, please contact us again,'' or had to be downloaded, printed, completed, and scanned to e-mail back to the business. Moreover, some businesses required consumers to contact the company to obtain a password before viewing available plants or before making pricing available. In a world where consumers expect free 2-d shipping of products and immediate responses, this type of language can turn consumers away from purchasing products from these businesses.\nAs previously mentioned, businesses in this sample were all members of a prominent horticulture industry association, which presumably indicates that the owners have an interest in marketing and potentially the funds to invest in marketing of products, as association dues are not inexpensive. and yet, these businesses were not well represented on Amazon or in ODS through the businesses' websites at the time of the study. If the large businesses with resources for marketing, like the vast majority of the businesses in this study, are struggling to sell online, it stands to reason that small, rural businesses are at a bigger disadvantage for entering the ODS market.\nThere are many likely reasons why horticultural businesses have not entered into the ODS market. Chief among them is a lack of knowledge and skills in online sales infrastructure, coupled with the challenge of educating consumers and keeping plants alive and in good condition upon delivery to the consumer. Shipping a plant is significantly more complex than an inorganic good such as a book. Standard packaging must fit a variety of plant sizes (or the business can specialize in a few sizes) and must be designed to prevent damage regardless of how the box is handled by the shipping carrier. Additionally, phytosanitary regulations and plant quarantines [such as for invasive fire ants (Solenopsis richteri and S. invicta)] apply to individual shipments of plants just as they do to truckloads of nursery stock across interstate shipping lanes. This may require more processing time to appropriately prepare plants for shipping and delivery across state boundaries. Anecdotal evidence suggests that consumers want instant gratification with minimal mess; they desire to go straight from the box into the garden with minimal handling. Customers likely expect a warranty and care instructions, and in this study no warranties were available for the businesses' products and only half offered care instructions.\nManaging customer expectations is a unique challenge when selling plants online. Many industry articles have noted this need: An Acres Online e-newsletter (Beytes, 2017a) quoted Davey Wright of Wright's Nursery and Greenhouse (Plantersville, AL):\n''This is our second year on Amazon, and although sales are strong, the customer base is very disappointing. Most think free shipping is free and doesn't cost me or them a dime; or living plants are as easy to ship as a book and shouldn't have a single broken leaf.\n''We've been shipping mail order since '98 and normally have less than 0.5% Table 5 . Location of horticultural businesses in sample [Spring 2016 membership list of a national horticulture industry association (n = 498)] indicating population demographics using the U.S. Department of Agriculture (USDA) rural-urban continuum codes (RUCA) system based on zip codes (USDA, 2013). The RUCA system forms a classification scheme that distinguishes metropolitan counties by the population size of their metro area, and nonmetropolitan counties by degree of urbanization and adjacency to a metro area."}, {"section_title": "Frequency (no.)", "text": "Proportion (%) Competing with Amazon in the online live plant marketplace requires many tactics currently used by local independent garden centers: knowledgeable customer service, activities, engagement, and a sense of community. Horticulture industry journalists argue that these tactics outweigh the many features of online shopping (Wells, 2018) and recommend strategies for addressing online plant sales (Sparks, 2018a (Sparks, , 2018b . A Fast Company article ''The Future of Retail in the Age of Amazon'' highlighted the challenges of both brick-and-mortar and online sales (Carr, 2017) . The author made the case that as the size and presence of Amazon increases online, the demand for ''warm and individualized service'' will increase and customers will ''crave the insight and personal connection of fellow humans.' ' Carr (2017) suggests that retailers ''figure out what makes them special and use those weapons to compete.'' He further argues that successful retailers in the future will deliver a satisfying in-person experience, will ''challenge the fundamental assumptions of commerce,'' and ''resurrect the art of selling.'' In the future, ODS and in-person retail will both be viable business opportunities, though each require different resources.\nLearning to navigate the challenges of ODS offers the opportunity to capitalize on new-media marketing tools such as websites, social media, and e-newsletters to lessen the distance that rural businesses and customers must traverse (Barkley et al., 2007; Barnes et al., 2014; Barton and Behe, 2017) . For many retailers, the risk associated with ODS (perishable goods, investing in new infrastructure, lack of the ''experience'' of shopping in a brick and mortar store) could be worth the reward as online businesses have the ability to charge premium prices to customers expecting specialized products matching a high-quality photo on the business website (Dholakia and Zhao, 2010; Kim and Kim, 2004) . Higher profit margins, lower start-up costs, expanded customer reach, few geographical limitations, and the ability to sell 24 h daily, 7 d weekly are opportunities ideal for rural horticultural retailers. Providing a service to consumers who prefer to shop on mobile technology such as tablets and smartphones can move the horticulture industry into the modern era."}, {"section_title": "Recommendations", "text": "Since this study was the first of its kind, it provides a benchmark for horticultural businesses selling online and via Amazon at the time of data collection. There are many future avenues for research in this area that should be considered. Specifically, future research should empirically investigate specific barriers for horticultural businesses to enter the ODS market and identify specific customer needs and expectations related to ODS in the horticultural industry. As a part of a study on barriers, it would be interesting to investigate businesses that started selling on Amazon and switched to another online selling strategy, as well as how businesses are addressing phytosanitary and shipping restrictions in rural areas.\nIn addition, future research should investigate the requirement by certain businesses in this sample of passwords or logins to view available products. It is unclear why businesses choose to require this; perhaps it is a form of security to prevent competitors from learning details about inventory and pricing. It may also be the difficulty of managing inventory in multiple systems, or perhaps these businesses do not or are not interested in selling retail directly to consumers. Future research should investigate this phenomena and details surrounding it.\nIn future content analyses in this area, it would be of interest to investigate which types of businesses within horticultural industries are selling online, as this initial work categorized all businesses collectively as horticultural businesses. Moreover, future research should explore what the most common type of product sold online by horticultural businesses is, to provide a better description of current online selling efforts by the industry. Additionally, future research should consider the infrastructure of horticultural businesses for selling online and investigate challenges related to shipping and packaging. Studying ODS practices of businesses currently involved in shipping may also reveal useful information. While using the AmericanHort list for this initial sample provided a benchmark for which businesses were selling online, future research should consider sampling through keyword search terms on Amazon and Google (Mountain View, CA) or other search engines to broaden the scope of this work. "}, {"section_title": "Literature cited", "text": ""}]