[{"section_title": "", "text": "educational institutions, the AP program has also grown and expanded to incorporate increasingly more diverse learning opportunities. In fact, today, the AP program has more than thirty different courses covering various subjects, including but not limited to computer science, Spanish literature, and environmental science. In light of the continued success and development of the AP program (Johnson, 2004;Paige, 2004), the benefits of participating in AP programs on educational outcomes have been examined and reported (Santoli, 2002). For example, Morgan and Ramist (1998), in their study involving 21 colleges, found that students who had placed out of an introductory course because of their AP exam scores earned higher average course grades on the second, third, fourth, and in some cases, fifth course in the college curriculum than did students who took the introductory course. In a follow-up study, based on data from approximately 11 colleges and universities, Morgan and Maneckshana (2000) discovered that students who scored higher on the AP Calculus AB exam were more likely to graduate in four years or less and earn higher overall grade point averages than did students who scored lower on the AP Calculus AB exam. In another comprehensive study exploring educational outcomes, involving nearly 4,000 students spanning approximately 30 years, Bleske-Rechek, Lubinski, and Bendow (2004) found that students who participated in AP programs were more likely than students who did not participate in AP programs to convey higher levels of satisfaction with their high school experiences and earn a master's degree or higher. Overall, Bleske-Rechek et al.'s findings indicated that AP programs positively impact students' perceptions of high school as well as their long-term educational outcomes. Summarizing the primary findings in their study, Bleske-Rechek et al. noted: \"[T]hrough self-selection or something intrinsic to the AP program itself, AP involvement is a positive predictor of educational success and satisfaction for intellectually talented youth\" (p. 219). Research and data have also indicated that racial and ethnic minority students in K-12 school settings were disproportionately represented in AP programs and scored lower on AP exams than their White peers (The College Board, 2004;2006b;Venkateswaran, 2004). For example, Klopfenstein (2004) found that African American and Hispanic students in Texas, who were more likely to come from low-income families, were not as likely to participate in AP programs when compared to White students. Moreover, Ornelas (2002, 2004) conducted state-level analyses of California high schools and found that African American, Hispanic, and Chicana/Latina students were underrepresented in AP programs. Ndura, Robinson, and Ochs (2003), analyzing data from a school district located in the western part of the United States, also concluded that African American and Hispanic students were underrepresented in AP programs and that the most salient variable impacting this trend was their socioeconomic status. According to data from The College Board (2006b), during 2006, African Americans scored an average of 2 on all AP exams, which were the lowest overall average of any racial group; White students scored an average of 3 during the same time period. Despite the wealth of information generated in recent years regarding the benefits for students who participate in AP programs on educational outcomes (Morgan & Maneckshana, 2000;Riley, 2004), limited research exists contrasting and comparing the differential effects of AP program participation on educational and labor market outcomes by race. However, research conducted by Robinson (2003) has revealed that White students and racial and ethnic minority students who took AP science and calculus courses were more likely to choose science-related careers (i.e., engineering, medicine, etc.). Building on the work of Robinson, the present study sought to examine nationally representative data from the National Education Longitudinal Study of 1988(NELS: 88/2000 to further explore racial differences in selected educational and labor outcomes based on AP program participation. Thus, the primary objective of this research was to explore racial differences in the effects of AP program participation on success outcomes in order to determine if students who participated in AP programs in high school obtained greater educational and labor market success after high school."}, {"section_title": "Theoretical Foundation", "text": "In understanding the effects of AP program participation on educational and labor market outcomes, this study was informed by human capital theory (Becker, 1993;Schultz, 1971). Human capital theory suggests that an individual's educational and labor market outcomes are positively influenced by attaining additional academic and social skills (e.g., gaining more knowledge to perform specialized tasks). Broadly defined, human capital refers to information, values, skills, and competencies that an individual has that can be exchanged for privileges and emoluments such as working in a high-status profession and receiving a high salary. As a result, education (e.g., formal and informal) has been viewed as the most significant investment an individual can make to accumulate higher levels of human capital (Becker, 1993). Justification for this theory is abundant in the research literature, which suggests that individuals with a college education are more likely to receive higher salaries than individuals who only earn a high school diploma or equivalent degree (Becker). Based on human capital theory, as well as substantial research on this topic, it was hypothesized that students who had participated in AP programs would obtain higher and more advanced educational and labor market outcomes than students who did not participate in AP programs."}, {"section_title": "Method National Education Longitudinal Study of 1988", "text": "Data for this study was drawn from the National Education Longitudinal Study of 1988 (NELS: 88/2000). NELS: 88/2000 is a nationally representative study designed to measure the impact of a wide-array of individual-level and institutionallevel characteristics on academic achievement, social development, post-secondary education experiences and outcomes and career attainment (Haggerty, Dugoni, Reed, Cederlund, & Taylor, 1996). The base-year data collection, which began in 1988, used a two-stage, stratified sampling design and included approximately 25,000 eighth-grade students. Data were also collected from at least one parent, two teachers, and a school administrator. The first follow-up data collection (1990) resurveyed base-year students to obtain information pertaining to their transition experiences into high school, attitudes about school, academic achievement, and psychosocial development. In 1992, students were resurveyed to obtain additional information regarding their secondary school experiences to determine how those experiences and perceptions influenced academic achievement. The third follow-up data collection took place in 1994 to provide researchers with information to assess how educational and social factors interacted to influence participation in postsecondary education, family formation, and occupational attainment. Approximately 15,000 respondents participated in the fourth follow-up data collection in 2000. In the NELS: 88/2000 sample, approximately 28% of the respondents reported that they had participated in AP programs, 50% reported that they did not participate in AP programs. Of the NELS: 88/2000 sample that participated in AP programs during the period under study, the racial breakdown was as follows: African Americans (13%), Asian or Pacific Islanders (5%), Hispanics (10%), and Whites (72%)."}, {"section_title": "Variables", "text": "This study employed four dependent variables from the NELS: 88/2000. As shown in Table 1, four dependent variables were utilized based on extant research as well as the theoretical foundation of the study. The dependent variables consisted of educational and labor outcomes: (a) college entrance examination score, (b) undergraduate grade point average (GPA), (c) the highest degree attained, and (d) income. Based on the purpose of this research, the independent variable used in this study measured whether the sample respondent participated in an AP program in high school. Composition of all dependent and independent variables used in this study was listed in Table 1."}, {"section_title": "Analytical Procedures", "text": "Employing nationally representative data from a large and comprehensive longitudinal survey, descriptive statistics were analyzed to determine if racial differences existed on the outcome measures by the independent variable (i.e., AP program participation). Consistent with several other studies conducted by the National Center for Education Statistics (NCES) employing similar data (Bradburn & Berger, 2002;Ingels, Curtin, Kaufman, Alt, & Chen, 2002;Knox, Lindsay, & Kolb, 1993), the researcher obtained descriptive statistics (e.g., percentages and averages) from the Data Analysis System maintained by NCES. Within-group analyses were conducted for each racial group by the independent variable. More specifically, independent samples t-tests were utilized to determine if significant differences existed, separately for each racial group, on the dependent variables between NELS:88/2000 respondents who reported AP program participation versus respondents who reported that they did not participate in an AP program. All results were reported significant at p < .05. Because the sampling methods utilized to construct the NELS:88/2000 sample were based on complex sampling procedures (Broene & Rust, 2000), a weighting variable was used to allow appropriate generalization to the NELS:88/2000 sample that completed the second (1992), third (1994), and fourth (2000) follow-up of the survey (Curtin, Ingels, Wu, & Heuer, 2002)."}, {"section_title": "Results", "text": "The results of this study were based on analyses of the descriptive data in Tables 2-4. Each category of results was discussed in light of the racial differences discovered via the data analyses. The results were partitioned using the following categories: (a) college entrance examination score; (b) undergraduate GPA; (c) highest degree attained; and (d) income. Table 2 showed that respondents who participated in AP programs were more likely to score higher on a college entrance examination than students who did not participate in AP programs. More specifically, African American and Hispanic students-who participated in AP programs-scored more than 100 points higher on the college entrance examination than did African American and Hispanic students who did not participate in AP programs. The effects of AP program participation  on college entrance examination scores were even more pronounced for Asian or Pacific Islander and White students. Asian or Pacific Islander and White students who participated in AP programs scored substantially higher on the college entrance examination than students who did not participate in AP programs (approximately 263 points and 174 points, respectively)."}, {"section_title": "College Entrance Examination Score", "text": ""}, {"section_title": "Undergraduate Grade Point Average", "text": "Data from Table 2 also revealed that respondents who participated in an AP program reported significantly higher undergraduate GPAs than did students who did not participate in an AP program. The largest differences in undergraduate GPAs between AP participants and nonparticipants were found for Asian or Pacific Islander students and White students (.28 and .26, respectively). The smallest differences in undergraduate GPAs between AP participants and nonparticipants were found for African American and Hispanic students (.11 and .17, respectively), but their results were not statistically significant."}, {"section_title": "Highest Degree Attained", "text": "The impact of participating in an AP program also extended to postsecondary educational attainment. For example, the effects of AP program participation on degree attainment showed that Asian or Pacific Islander and White non-AP par- Within-group statistical analyses were conducted for each racial group by the independent variable. All differences between respondents who participated in AP programs and those who did not, unless otherwise indicated as not significant (NS), were significant at p<.05. ticipants were less likely to have completed a postsecondary degree. Also, the data revealed that African American students who participated in AP programs were more likely to earn an advanced degree than were African American students who did not participate in AP programs. Moreover, Hispanic students and White students who participated in AP programs were more likely than Hispanic and White non-AP program participants to earn a bachelor's degree and an advanced degree. Additionally, the data revealed that Hispanic and White students who participated in AP programs were significantly less likely to earn an Associate's degree than were Hispanic and White non-AP program participants."}, {"section_title": "Income", "text": "The data also highlighted some differences in income, by AP participation. More specifically, Asian or Pacific Islanders and Whites who participated in AP programs reported earning approximately $10,000 and $3,000 more a year, respectively, than Asian or Pacific Islanders and Whites who did not participate in AP programs. For African Americans and Hispanics, the difference was approximately $2,000 and $1,700, respectively, but these results were not statistically significant. Percentages may not sum to 100 due to rounding. Within-group statistical analyses were conducted for each racial group by the independent variable. All differences between respondents who participated in AP programs and those who did not, unless otherwise indicated as not significant (NS), were significant at p<.05."}, {"section_title": "Discussion", "text": "This study explored racial differences in educational and labor market outcomes derived from participating in AP programs. Based on the data, participating in AP programs had the greatest impact on Asian or Pacific Islander students. For example, Asian or Pacific Islanders who participated in AP programs reported an income of approximately $10,000 higher than Asian or Pacific Islanders who did not participate in AP programs. Also, college entrance examination scores were significantly higher for Asian or Pacific Islander AP participants versus non-AP participants. White students' educational and labor outcomes were also substantially impacted by AP program participation. For example, data revealed marked differences between White AP program participants and non-AP program participants in college entrance examination scores, income, and college participation. African Americans and Hispanics had smaller benefits, when compared with Asians or Pacific Islanders and Whites, as a result of participating in AP programs in terms of college entrance examination scores, undergraduate grade point averages, postsecondary attainment, and incomes. Consistent with the theoretical underpinnings employed in this study (i.e., human capital theory), overall, this study found compelling evidence to conclude that AP program participation was associated with higher college entrance examination scores, undergraduate GPAs, postsecondary attainments, and income. As such, this study was also consistent with previous research on this topic which showed that students who participated in AP programs were more likely to accrue higher Within-group statistical analyses were conducted for each racial group by the independent variable. All differences between respondents who participated in AP programs and those who did not, unless otherwise indicated as not significant (NS), were significant at p<.05. levels of human capital as adults (Bleske-Rechek et al., 2004;Robinson, 2003). Based on the results of this descriptive study, participating in AP programs in high school appears to be another important factor of long-term educational and financial success. While some scholars have acknowledged concerns with AP programs (Klopfenstein, 2003;Santoli, 2002;Van Tassel-Baska, 2001), the primary conclusion drawn from this study resonates with Van Tassel-Baska (2001), who wrote: \"While Advanced Placement coursework may not be for every college-bound student, the program puts those students who choose it on a deliberate path toward the accrual of educational advantage in key areas of learning that can only over time enhance individual and societal educational progress\" (p. 131). Recent data pertaining to the numbers of minority students in AP programs are encouraging and suggests that more minority students are participating in AP programs. For example, data from The College Board (2004) revealed, in 1979, African American and Hispanic students accounted for 5% of the AP exams taken by students in the United States. The percentage of AP exams taken by African American and Hispanic students increased to approximately 14% in 2002. While the overall benefits for African Americans and Hispanic students who participated in AP programs were smaller in this study, compared to Asians or Pacific Islanders and Whites, it should be noted that the data revealed significant benefits for African Americans and Hispanics which suggests that AP programs may be a valuable resource that contributes to the human capital for all students."}, {"section_title": "Implications for Practice", "text": "In light of the research literature and data analyzed for this study as well as the study's statistical findings, it is clear that parents, teachers, and school counselors must continue to explore ways to ensure that all students have the opportunity to participate in AP programs, due to the long-term benefits associated with participating in AP programs. The literature reviewed for this study seemed to suggest that parents need to be more actively involved in exploring how AP programs may assist their child in helping them to be successful in high school, college, and in the workplace. Parents should also work with teachers and school counselors to examine the particular needs of their child in light of his or her family resources, learning style, and educational and occupational goals. While this recommendation is useful for all parents, it may be particularly relevant for parents of underrepresented students in AP programs. Furthermore, this type of focused collaboration may ensure that more underrepresented students participate and excel in AP programs. Toward this end, it should also be noted that parents, teachers, and school counselors must continually focus on improving students' cognitive skills in order for them to be prepared to score higher on the Preliminary SAT/National Merit Scholarship Qualifying Test (PSAT/NMSQT) (The College Board, 2007b), as well as other state-level assessments. This recommendation is promulgated in light of the use of the College Board's AP Potential program, which is based on students' scores on the PSAT/NMSQT (The College Board, 2007a) and consistent with re-search showing an association between PSAT/NMSQT and AP examination scores (Ewing, Camara, & Millsap, 2006). Furthermore, with widespread usage of this type of application, it will be crucial for researchers who are interested in studying access and equity issues in AP to estimate the effects of this system on African American and Hispanic students' likelihood to participate in AP programs in the future. Teacher educators, in collaboration with in-service and pre-service high school teachers, should consider focusing on improving teacher education programs to: (a) recruit more racial and ethnic minority teachers to teach AP courses, and (b) train in-service as well as preservice teachers to better understand underrepresented minority students' concerns (Milner, Flowers, Moore, Moore, & Flowers, 2003). Attracting more minority teachers to teach AP courses might be an important first step in recruiting and retaining more underrepresented minority students in AP programs (Burton, Whitman, Yepes-Baraya, Cline, & Kim, 2002). Additionally, this may also further enhance the impact of AP participation on educational and labor outcomes for underrepresented students by supplying minority students with role models and mentors that not only teach them high-level coursework but who may also be more familiar with other issues impacting their academic and occupational success. Another implication of this study, based on the literature reviewed for this investigation, is that school counselors need to be more proactive in making the parents of African American and Hispanic students aware of the experiences and benefits of AP programs. School counselors may accomplish this task in a number of ways. For example, they could communicate this information at parent-school counselor conferences. They can also make this information available on the school's website or mail information about AP courses to parents. With appropriate and accurate data pertaining to AP programs, parents may be equipped with relevant information to make logical decisions, regarding whether or not to enroll their child in AP. Given the positive effects on educational and labor market outcomes, participation in AP programs should remain a high priority for all educational professionals at the high school level. Additionally, school counselors should also be familiar with the positive benefits of AP program participation on enhancing educational and labor market experiences, particularly for African American, American Indian, and Hispanic students-the students most underrepresented in AP programs."}, {"section_title": "Limitations of the Study", "text": "The present study will add to our understanding of the impact of AP program participation on educational and labor market outcomes; however, additional research is needed to account for some of the limitations in this study. The primary limitation of this study was that only descriptive statistics were utilized to explain the outcomes explored in this study. As a result, it was not possible to determine if the observed differences in educational and labor market outcomes by AP program participation would persist after taking into account other important variables (e.g., demographic variables, institutional variables, and family variables). Future research is needed that utilizes statistical controls for important variables that have been shown to influence student outcomes such as precollege cognitive ability, students' academic experiences in college, and students' nonacademic experiences in college. A second limitation of this study was introduced due to the definition of AP program participation (i.e., the primary independent variable). Given the operational definition of AP program participation used in this study, it was not possible to determine the nature and type of AP program participation (e.g., number of AP courses taken, AP exam scores, etc.). As such, additional research is needed that uses other definitions of AP program participation to better understand the effects of AP program participation on educational and labor market outcomes."}]