[{"section_title": "Introduction", "text": "The shrinking of the world into a global village and the opening of international borders for free trade had combined to engineer the drive for an unprecedented economic and technological competition among nations. Nations have come to realize that economic and political survival will depend largely on competitive advantage a nation commands over others. Sustaining a competitive edge will be dependent on the availability of a skilled and efficient workforce that a nation has at its disposal. The abundance of a skilled and efficient workforce at the disposal of a nation is dependent on the quality of students produced through K-12 pipeline, especially in the core area of mathematics and science. Mathematics is the vehicle for producing a skilled workforce needed to sustain a nation's competitive edge in today's global economy. The value-added of mathematics to the quality of a workforce is obvious. Chubb and Moe (1990) stated that mathematics is crucial to the future of sophisticated technology and international competition. As a result of the importance of mathematics and science in international competition, many countries have turned to international assessments in mathematics and science administered by the International Association for the Evaluation of Educational Achievement (IEA) as a way of measuring their future competitive edge. The IEA is an independent, international cooperative of national research institutions and governmental agencies that is based in Amsterdam, Netherlands. Through its comparative research and assessment projects, the IEA aims to: (1) Provide international benchmarks that may assist policymakers from participating in identifying the comparative strengths and weaknesses of their educational systems, (2) Provide high-quality data that will increase policymakers' understanding of key school-and non-school-based factors that influence teaching and learning in participating countries, (3) Provide high-quality data that will serve as a resource for identifying areas of concern and action, and for preparing and evaluating educational reforms in participating countries, (4) Develop and improve educational systems' capacity to engage in national strategies for educational monitoring and improvement in participating countries, and (5) Contribute to development of the world-wide community of researchers in educational evaluation (IEA, n.d.). The IEA assessed the mathematics and science performance of fourth-and eighth-grade students in 2003 (Gonzales et al., 2004). The assessments are used for cross-national comparison of mathematics and science achievement of students from participating countries. TIMSS was designed to assess students' mathematics and science achievement midway through elementary school, midway through lower secondary school, and at the end of upper secondary school. Because children start and finish K-12 education at different ages, age and grade level were factors in deciding the students that were tested. Three populations of students were tested. Population 1 consisted of students in a pair of adjacent grades that contained most of 9-year-olds. The adjacent grades were grades 3 and 4 in the U. S. and most of the participating countries, grades 2 and 3, and grades 4 and 5 in some countries (NCES, 1997). The students tested in population 2 were in a pair of adjacent grades that contained most of 13-year-olds at the time of testing. The adjacent grades were grades 7 and 8 in the U. S. and most of the participating countries, and grade 6 and 7 in a few countries (NCES, 1996)."}, {"section_title": "TIMSS 2003", "text": "TIMSS 2003 was the third in a series of mathematics and science assessments conducted by the International Association for the Evaluation of Educational Achievement since 1995. The aim of TIMSS is to improve the teaching and learning of mathematics and science by providing data on student achievement in relation to different types of curricula, instructional practices, and school environments. Additionally, it provides opportunity for participating countries to obtain comparative information about their students' achievement in mathematics and science .  Martin et al., 2004;Mullis et al., 2004). The Table that follows shows the average scale scores of fourth-grade students from 25 countries and 3 benchmarking participants in mathematics. Note: International Average is the average of the averages of the countries and the benchmarking participants. The Table that follows shows the average scale scores of eighth-grade students from 45 countries and 4 benchmarking participants in mathematics.  "}, {"section_title": "Discussion", "text": "Student achievement is influenced by many factors, among which are teacher quality, new teacher induction and support, and teacher professional development. A brief survey of education systems in TIMSS participating countries revealed interesting findings in teacher quality, new teacher induction and support programs, and teacher professional development. These findings may be used by policymakers and educators to improve the teaching and learning of mathematics. Teacher Quality Teacher quality may be the most important factor that promotes student achievement. Teacher quality is largely related to the rigors of teacher education admission, curriculum, graduation, and certification requirements. Curriculum, graduation, and certification requirements vary in both high-and lowperforming TIMSS countries. However, curriculum rigor is more challenging in high-performing countries than in low-performing nations. For example, in Korea teacher candidates are required to take more than 40 credits in their subject areas, and Hong Kong requires prospective teachers to have a minor in mathematics or science."}, {"section_title": "Teacher Induction and Support", "text": "The transition from preservice teacher education to actual classroom teaching can be challenging and difficult. The challenging and difficult situation is a contributing factor for new teacher attrition during the first few years of teaching. As a result, teacher induction and support programs are used to provide beginning teachers the support needed during the transition from learning to teach to teachers of learners with the aim of reducing the rate of new teacher attrition. Teacher induction and support programs are more structured in TIMSS high-performing countries. For example, in Japan new teachers spend at least 90 days of their first year of teaching in teacher induction activities. The induction activities include in-school and out-of school training, mentoring by veteran teachers, team teaching and observation, and interaction with peers. In addition, new teachers receive support from principals and other instructional staff. The support from principals includes placing new teachers in less challenging classrooms, to grades that are seen as less critical to educational development, and assignment of lighter teaching leads. All these measures are geared toward helping new teachers succeed (Nohara, 1997). In TIMSS average-and low-performing countries, teacher induction and support programs are less structured, non-mandatory, and less durable unlike in high-performing countries. In average-and low-performing countries, new teachers are placed in classrooms without recourse to how challenging classrooms have become. New teacher assessment may be viewed as fault finding in low-performing countries rather than being an avenue for helping new teachers transition from teacher education to actual classroom teaching."}, {"section_title": "Teacher Professional Development", "text": "New teachers transition from teacher education to classrooms with limited knowledge (Ngwudike, 2001). Therefore, teacher professional development should be seen as part of teacher professional continuum. Wang, Coleman, Coley, and Phelps (2003), found that in TIMSS highperforming countries, beginning teacher induction and professional development are required. "}, {"section_title": "Recommendations", "text": "The contrast between TIMSS high-and low-performing countries informed the following recommendations that follow: 1. Like TIMSS high-performing countries, low-performing nations should make their teacher education admission, curriculum, graduation, and certification requirements more challenging to teacher education candidates. 2. Teacher education programs should be designed with a fifth year post certification internship. During the internship, novice teachers will be gradually introduced to the teaching profession. This is obtained in medical and some other health professions. Teaching is as critical as the medical profession. 3. Teacher education systems should establish new teacher induction and support programs. 4. Teacher salaries should be higher or at least match the pay in other professions of similar training. This will increase the prestige of the teaching profession, thereby attracting more talented individuals to the profession. Moskowitz & Kennedy (1997)  6. TIMSS longitudinal data may be used by participating countries to understand the strengths and weaknesses of their education systems. TIMSS provides an opportunity for countries to learn what works better in other education systems while improving the teaching and learning of mathematics and science in their own countries."}, {"section_title": "Conclusion", "text": "The Trends in International Mathematics and Science Study (TIMSS) is an ambitious international assessment that provides comparative data on student achievement among participating countries and benchmarking jurisdictions. TIMSS conducts studies on a crossnational achievement in mathematics and science every four years. TIMSS collects contextual information on how mathematics and science learning takes place in participating countries. The next cycle of assessments will take place in 2011. TIMSS 2003 provide an array of data that may be analyzed and used to frame policy guidelines in education, especially in the teaching and learning of mathematics and science. The analysis of the contextual information collected by TIMSS may be used to understand the context in which the teaching and learning of mathematics and science take place in high and low achieving countries."}]