[{"section_title": "Introduction and Overview", "text": "Mobility is a vital element in any population and labor force. How willingly families and workers will migrate from one location to another in search of opportunities for advancement or to seek additional training constitute important indicators of economic growth and development. \"Brain drain\" and \"brain gain\" issues are of interest to governmental authorities and have significant implications for support of higher education and other legislative initiatives. This Info Brief examines the extent and pattern of interstate migration of recent science and engineering (S&E) doctorate recipients from birth through initial postgraduate employment. The study focuses on U.S. born individuals who earned a doctorate in an S&E field from U.S. universities.' This is arguably one of the most highly skilled segments of the American labor force, and one for which personal and professional decisions to migrate are of paramount importance. The data analyzed are from the Survey of Earned Doctorates (SED) for the 1999 academic year (July I Allen Sanderson is a senior research scientist at the National Opinion Research Center (NORC) and senior lecturer in economics at the University of Chicago; Bernard Dugoni is senior methodologist at NORC. 2 The movement of foreign-born U.S.-trained doctorate recipients or the immigration of foreign-trained doctoral degree holders into the United States is not considered here. For a recent comprehensive discussion and overview of many international aspects of migration, see National Science Foundation, Division of Science Resources Statistics, Graduate Education Reform in Europe, Asia, and the Americas and International Mobility of Scientists and Engineers: Proceedings of an NSF Workshop, NSF 00-318, Project Officer, Jean M. Johnson (Arlington, VA 2000). 1998-June 1999.3 The 1999 SED collected five chronological \"geographical history\" data points on the migration of all research doctorate recipients in that academic year. Respondents provided information on their birth state and the state in which they last attended high school, first enrolled in college, earned their doctorate, and accepted or planned to pursue initial postdoctorate employment.' Migration among the S&E doctorate population is both extensive and ongoing. From the universe of 41,140 research doctorate recipients in 1999,5 25,413 received their degree in an S&E field. This investigation was confined to U.S. citizens (14,078); from these were selected those who were born, completed high school, enrolled in college, and received a science or engineering doctorate in one 3 The SED is sponsored by the National Science Foundation and five other Federal agencies and is conducted under contract from NSF by NORC at the University of Chicago. A follow-up survey to the SED, the Survey of Doctorate Recipients (SDR), includes employment information on a sample of S&E doctoral-degree recipients after graduation. 4 In some instances, a doctorate recipient could live in one state but work in another. Skip patterns in the survey are such that respondents, depending on employment status, could have provided one or the other location but not both. For purposes of this study, no distinction is made between place of employment and place of residence, and the words \"work\" and \"live\" are used interchangeably throughout. 5 The results of the full SED survey are described in A. Sanderson, B. Dugoni, T. Hoffer, and S. Myers, Doctorate Recipients from United States Universities: Summary Report 1999 (Chicago: National Opinion Research Center, 2000). The Special Section of that report analyzes the migration patterns of all research doctorates. Information and data from SRSthe Division of Science Resources Statisticsare available on the web at: <http: / /www.nsf.gov /sbe /srs/ >. For more information about obtaining reports, contact paperpubs@nsf.gov or call 301-947-2722. For NSF's Telephonic Device for the Deaf, dial 703-292-5090. of the fifty states, the District of Columbia, or Puerto Rico. These further restrictions yielded a subset of 12,763 respondents, which was used to examine both the general pattern of mobility among the new doctorate population and the extent to which migration varied by academic discipline, sex, race/ethnicity, marital status, parental education, and employment sector."}, {"section_title": "Migration from Birth to Employment", "text": "Migration was widespread among native-born S&E doctorate recipients, and this tendency toward educational mobility was exhibited early on. More than a third (35.5 percent) of the subset of 12,763 S&E doctorate recipients finished high school in a state other than the one in which they were born.6 A similar percentage (37.8 percent) of the new recipients first entered college in a state other than the one in which they earned a high school diploma, a figure that is considerably higher than the percentage reported for college freshmen as a whole.' Thus, initially as undergraduates, these doctorate recipients did not resemble other undergraduates with respect to educational migration. (See Table 1.)8 This mobility also characterized the transition from college to graduate school and from graduate school to initial post-doctoral employment. Over two-thirds (71.1 percent) of this population received their doctoral degree from an institution in a state other than the one in which they first entered college. More than 6 This percentage is a lower bound on overall migration because SED data do not capture intrastate moves, which may be more prevalent in geographically large states, nor instances in which families could have moved from one state to another then back again in this 17-or 18-year period.  . This report indicated that students with higher grade point averages for the bachelor's degree were more likely to migrate to another state. half-59.2 percentintended to work, at least initially, in a state other than the one in which they earned their doctorate. (See Table 1.) Relatively few S&E doctorate recipients returned to prior \"roots\" for their first postgraduate employment. About one-quarter (24.3 percent) were returning to (or remaining in) the state in which they started college, 25.2 percent to the state in which they last attended high school, and 20.8 percent to their birth state. (See Table 2.)9 Overall, only 11 percent of the native-born S&E doctorate recipients reported the same state for their birth, graduation from high school, college matriculation, doctorate institution, and planned employment. (See Table 2.) One possible implication of these data is that there may not be a single period for \"brain drain\" (or \"brain gain\"). Migration occurred at various points from birth to employment, although there was a considerably higher level of interstate migration for the doctoral degree than for earlier intervals, indicating that doctoral education may draw from a national market."}, {"section_title": "Migration and Sex", "text": "For large parts of their educational careers, male and female S&E doctorate recipients showed comparable migration patterns. This similarity is observed in migration between birth and the end of high school and continues to hold true for out-of-state college matriculation-37.2 percent of males and 38.7 percent of females entered college in a state other than the one in which they finished high schooland between college matriculation and doctorate-institution choice (70.7 percent versus 71.7, respectively). (See Table 1.) However, males and females diverged with respect to mobility at first postdoctoral employment; 61.3 percent of males, compared to 56.2 percent of females, intended to work in a state different from the one in which they earned the doctorate. (See Table 1.) In addition, male S&E doctorate recipients were less Table 1. Percentages of native-born U.S. citizen S&E 1999 doctorate recipients who migrated interstate between various life events, by demographic background and employment sector likely than females to accept initial employment in the state in which they were born, last attended high school, or first matriculated in college. (See Table 2.)"}, {"section_title": "Migration and Race/Ethnicity", "text": "The educational mobility of S&E doctorate recipients varied by racial and ethnic group. Asian S&E doctorate recipients were more likely to have moved across state lines between birth and high school graduation-42.0 percent of Asians received a diploma in a state other than the one in which they were born, compared with 32.8 percent and 27.9 percent for blacks and Hispanics, respectively (and 35.8 percent for whites and 33.3 percent for American Indians). Between high school and college, blacks exhibited the highest interstate migration rate. 5Marital status is only reported as of the time of completion of the SED. 6Includes those who indicated a \"marriage-like relationship.\" 'Includes those who indicated \"separated.\" 6Includes only those intending to work (56.2 percent) or not study (43.8 percent), immediately following degree conferral. g' Other\" sectors include working for a non-profit organization, teaching in an elementary or secondary school, or employment by the United Nations or another international agency.°S tate of first postdoctoral employment or residence. \"The respondent was born, finished high school, began college, received doctorate, and accepted first postdoctoral employment, all in the same state."}, {"section_title": "SOURCE: National Science Foundation/Division of Science Resources Statistics, Survey of Earned Doctorates 1999", "text": "Whites and blacks were the most likely to move across states between entering college and completion of their doctoral program. (See Table 1.) Concerning geographic location of initial postgraduate employment, the similarities are more striking than the differences. However, Hispanics were the most likely of all the racial/ethnic groups to work after the doctorate in a state in which they were born, last attended high school, or enrolled in college. Hispanics were also generally more likely than doctoral recipients in other racial/ethnic categories to have stayed in the same state from birth through doctoral award and employment. (See Table 2"}, {"section_title": ".)'°I°", "text": "This apparent difference could be due to the disproportionate representation of Hispanic doctorate recipients in states such as California, Texas, Florida, and New York, which have large labor markets for doctorate recipients."}, {"section_title": "Migration and Marital Status", "text": "Marital status also has an apparent impact on the migration patterns of S&E doctorate recipients. Three in five (60.1 percent) of doctorate recipients in the population were married at the time they received the degree; another 5.6 percent were widowed, separated, or divorced. A third (34.3 percent) had never been married; this group exhibited a greater tendency to work in a state other than the one in which they earned the doctorate. (See Table 1.) Within all three marital status categories, males were more likely to migrate across a state border for postdoctoral employment than were their female counterparts; men were also less likely to work after graduate school in the state of their birth, high school graduation, or college entry than were women.\" (This may reflect, in part, a differential effect of the field of doctoral study on migration for employment, and associated sex differences in these fields of concentration.) Migration and Family Background S&E doctorate recipients from family backgrounds of higher educational attainment were more mobile than recipients from more modest educational backgrounds. Almost twice the percentage (41.2 percent versus 21.9 percent) finished high school in a state other than the one in which they were born.'2 A similar pattern occurs at other educational markers in these doctorate recipients' lives: students from more highly educated families were more likely to have attended an out-ofstate college (43.2 percent versus 25.0 percent), enrolled in college and earned doctorate degrees in different states (73.6 percent versus 65.1 percent), and planned to work in a state other than the one in which they earned the doctorate (60.7 percent versus 55.9 percent). As these statistics indicate, though, the differences narrow between college and employment. Concerning employment in a state in which they had earlier \"roots\"birth, high school, or collegedoc-II These tabulations are available from the authors. torate recipients from families with higher levels of formal education exhibited slightly lower tendencies to stay or return \"home.\" (See Table 1.)"}, {"section_title": "Migration and Employment Sector", "text": "The mobility of S&E doctorate recipients varied according to their employment plans. The SED solicited information on the intended employment sectoracademic, government, private industry and business, or \"other\"\"of each new doctorate recipient who had accepted employment or intended to pursue a job (as opposed to those with post-doctoral study plans). Although there was little difference by employment sector with respect to interstate migration between birth and high school, from high school to college, or college to doctoral program, those who intended to work in the academic sector were the most likely to move from the state of their doctorate institution. (See Tables 1 and 2.) Those in the more heterogeneous \"other\" category, where elementary and secondary school teaching is the dominant field, exhibited consistently less interstate migration than the other three employment sectors for virtually all postdoctoral employment comparisons in Tables 1 and 2."}, {"section_title": "Migration and Field of Academic Study", "text": "The migration patterns of S&E doctorate recipients depended in part on the field of academic study. Students whose degrees were in engineering, computer science, biological science, and psychology were the most likely to have initial postdoctoral employment in the same state as their doctoral institution. In contrast, those with degrees in chemistry were the least likely to have employment in the same state as their doctoral institution. Physics/astronomy doctorate recipients were the least likely to have remained in the same state for all of the chronological markers reported on the SED. (See Table 3.)14 With respect to interstate migration of S&E graduates, students whose doctorate was in chemistry or the agricultural sciences were the least likely to leave their state of birth by high school and college matriculation. However, their rate of changing states for their doctoral education and postdoctoral employment was above the average for S&E fields. (See Table 4.) For comparison purposes, tables 3 and 4 also include doctorate recipients from non-S&E disciplines, which include the humanities, education, the health sciences, and professional fields. Overall, the 1999 S&E doctoral recipients were more likely than their non-S&E peers to have experienced an interstate relocation between birth and high school, enter an out-of-state college or university, move to another state for their doctoral program, or secure employment in a state other than the one in which they earned the doctorate. (See Table  4.) However, this is largely because those in the heterogeneous \"other\" category with respect to field of study, almost two-thirds of which was composed of doctorate recipients in education, were the least likely to migrate.° Doctorate recipients,in the humanities generally exhibited more migration than those in S&E fields prior to postdoctoral employment."}, {"section_title": "Summary", "text": "Science and engineering doctorate recipients are highly mobile. Before they reached their mid-thirties (the median age at time of degree conferral for this cohort was less than 33), many of these young scholars had moved across state borders to attend college, and most had done so to select a doctoral program as well 15 Sixty-four percent of the 6,838 students in the \"other\" field grouping are in education; 14 percent are in the health sciences; and 22 percent in professional fields such as business, communications, and theology. as to accept employment. Earlier in life, about a third of them finished high school in a state other than the one in which they had been born, and a similar proportion began their undergraduate studies out of state. About one in nine doctorate recipients grew up, was educated, and planned to be employed professionally after their doctorate in the same state; only about onefourth of them planned to work upon completion of their doctorate in a state in which they had been born, last attended high school, or began college.'6 Marital status and the educational attainment of these recipients' parents appear to influence migration significantly. The analyses of migration presented in this InfoBrief are consistent with those from other researchers, and suggest that migration among the doctorate population is both extensive and ongoing. For further information about this InfoBrief, the Survey of Earned Doctorates, or related reports, contact:  Studies, 1993). Among S&E doctorate recipients from 1986-88, 65 percent earned a bachelor's degree in the same state as they received a high school diploma, 30 percent went to high school and doctoral institution in the same state, 22 percent intended to return to the state where they attended high school after completion of the doctorate, and 38 percent were going to work or continue postgraduate study in the same state as their doctoral institution. For the 1999 S&E cohort, those percentages are 62.2 percent, 25.8 percent, 25.2 percent, and 40.8 percent, respectively. [ "}]