[{"section_title": "Abstract", "text": "This study examines the association between state laws that prohibit firearm ownership for offenders convicted of misdemeanor crimes of domestic violence (MCDV) and firearm ownership in two-parent families with high-conflict male partners with arrest histories. Mixed effects logistic regression models applied to data from the Early Childhood Longitudinal Study-Birth cohort (n = 5350) determined that living in a state with laws that prohibited firearm ownership for convicted MCDVoffenders decreased the likelihood of firearm ownership among families with high-conflict males by 62%. The length of the time limit on firearm prohibition was correlated with incremental decreases in firearm ownership in such families, with the probability of firearm ownership among families with high-conflict males decreasing from 30% in states with no MCDV laws restricting access from firearms to 12% in states with permanent prohibition on firearm ownership. These findings have significance for public health policy aimed at decreasing intimate-partner homicide."}, {"section_title": "", "text": "In a given year, approximately 4-5% of adults living in the United States experienced physical violence within their intimate relationships (Black et al. 2011) , and such relationships have serious consequences for individual health, including mortality (Black and Breiding 2008; Coker et al. 2000a Coker et al. , 2002 . Significantly, the presence of a firearm in the home increases the likelihood that the worst incidences of intimate partner violence will result in a fatality (Campbell et al. 2003; Saltzman et al. 1992) . This serious danger posed by firearms in households with domestic violence provides the rationale for an array of firearm legislation. Despite the presence of federal legislation such as the Domestic Violence Offenders Gun Ban (BThe Lautenberg Amendment^), specific firearm legislation varies widely across states, which is notable given that state-level legislation strongly influences local-level action (Vigdor and Mercy 2003; Zeoli and Frattaroli 2013) . Many states have laws preventing firearm access among individuals who have been convicted of domestic violence or who are under domesticviolence restraining orders, either by removing firearms from the home or by prohibiting firearm ownership or purchases. The length of such prohibitions also vary, spanning from temporary periods to permanent restrictions (Vigdor and Mercy 2006) . This state-level variation provides a natural experiment to assess the efficacy of domestic violence-specific firearm laws in shaping firearm ownership among at-risk families.\nTo address this important issue, this study examines whether state-level laws that prohibit firearm ownership among twoparent families with a history of domestic violence was associated with rates of firearm ownership in this at-risk group. With data from a nationally-representative sample of families with young children (Early Childhood Longitudinal Study-Birth cohort [ECLS-B] , n = 5350), we examine whether the presence of any state-level law that prohibits firearm ownership among families with a history of domestic violence is associated with decreased odds of firearm ownership, and if so, whether the length of the prohibition matters. Importantly, we explore whether these state-level laws are associated with firearm ownership in the population more generally, allowing us to test the efficacy with which these laws target the behaviors of the intended at-risk group.\nDetermining whether state-level laws that prohibit domestic violence abusers' access to firearms actually translates into lower firearm ownership rates among families with histories of domestic violence has implications for public policy. We go beyond prior studies that have focused on the link between these laws and rates of firearm-related domestic violencerelated homicide by examining the health behavior the laws directly target (i.e., firearm ownership), which, importantly, has implications for other measures of women's health and wellbeing, such as depression, victimization, and injuries (Renauer and Henning 2005; Sorenson and Weibe 2004; Vittes et al. 2013) . Despite the seemingly intractable debate around policy makers' role in influencing firearm access, the conversation is shifting to one that recognizes firearm violence as a major public health crisis that demands action (American Medical Association 2016) . Support is rising for firearm legislation that can be agreed upon by individuals from all sides of the firearms issue (Webster and Wintemute 2015) . By leveraging existing theory, this study adds an important sociological perspective to this growing public health concern."}, {"section_title": "Background", "text": ""}, {"section_title": "Ecological Systems Theory, Legal Contingencies, and Firearm Ownership", "text": "Ecological systems provide a strong theoretical rationale for conceptualizing legislation as an influence on firearm ownership among families with a history of domestic violence (Dahlberg and Krug 2002) . In short, this framework suggests that developmental and interpersonal phenomena arise out of the interplay of forces spanning the proximal settings of everyday life to distal social and political systems that structure society (Bronfenbrenner and Morris 2006) . Thus, firearm ownership would need to be understood within this interplay of proximal and distal.\nOn the proximal level, both firearm ownership and intimate partner violence represent behaviors that arise out of family ecologies. For example, family structure, race/ethnicity, parenting practices, parental depression, and type of employment are associated with firearm ownership (Johnson et al. 2004; MartinStorey et al. 2015; Schwebel et al. 2014) , and family stress and parental depression are predictors of parents unsafely storing firearms in the home, more specifically (Martin-Storey et al. 2015; Morrissey 2016) . Similarly, lack of social support and interpersonal and psychological stress are predictors of intimate partner violence (Aizer 2010; Capaldi et al. 2012; Stith et al. 2004) . Consequently, intervention and prevention programs aimed at addressing both firearm safety and intimate partner violence target mechanisms within these proximal ecological systems (Babcock et al. 2004; McGee et al. 2003) .\nDistal ecological systems are also important in shaping intimate partner violence and firearm behavior (Capaldi et al. 2012) , and legislative activity sets the political and legal scaffolding at the state level that shapes behavior at the individual level. For example, evidence suggests that individuals' ownership and use of firearms-as well as firearm ownership's links with homicide and suicide rates-are influenced by the legal contingencies placed on this behavior (Ruddell and Mays 2005; Sumner et al. 2008 ). The same is true for intimate partner violence, which impedes individuals from engaging in such violent behavior or erodes some of the impediments against it (Holtzworth-Munroe and Stuart 1994; Maxwell et al. 2001) .\nConnecting these varied ecological systems at different levels-legislation at the distal legal/political level addressing firearm ownership among individuals with a history of intimate partner violence at the proximal level-is meant to reduce the considerable threat that firearms pose to personal and public safety. This legislative approach could operate in two ways for potential offenders. First, a rational choice logic reflects that increasing consequences of a crime reduces the likelihood of that crime being committed (Becker 1968) . Second, that erecting barriers to engagement in unsafe practices and behaviors more generally can reduce their prevalence (Wright et al. 2004) . Indeed, in line with Clarke and Cornish's model of offender decision making (Clarke and Cornish 1985) , legislation aimed at limiting the likelihood convicted domestic violence offenders can purchase firearms-such as the laws examined in this study-affects not just the decision to attempt to purchase a firearm, but also affects the ease at which an offender might obtain a firearm once the decision to acquire a firearm has been made, subsequently reducing the likelihood of firearm acquisition.\nWhat does extant research tell us about the links among state-level legislation, firearm ownership, and intimate partner violence? To date, research in this area has generally focused on a single extreme correlate of all three: the murder of Americans-most often women-by an intimate partner. This research generally suggests that such homicides are less prevalent in the context of laws preventing people with histories of intimate partner violence from owning guns. For example, intimate partner homicide rates are significantly lower in states with laws that restrict access or remove firearms from homes in which domestic violence occurs, with stronger effects in states with the strictest laws and enforcement, in states with the most severe penalties for violations, when restrictions are tied to the presence of a domestic violence-related restraining order, and when laws target point of purchase behaviors (Bridges et al. 2008; Vigdor and Mercy 2006; Vigdor and Mercy 2003; Zeoli and Webster 2010) . Of note, however, is that these state-level analyses only found significant inverse associations with intimate partner homicides between laws restricting firearms from those under domestic violence restraining orders, but not laws that restricted firearms from convicted domestic violence misdemeanants. One study, however, examining intimate partner homicides rates pre-and post-the 1996 Federal Gun Control Act, found that this federal law expansion that restricted firearm access from those convicted of a domestic violence misdemeanor was associated with a 17% decrease in firearm-related homicides among female intimate partner victims (Raissian 2016) . Moreover, this association did not extend to other types of intimate partner homicide.\nEchoing our ecological framework, these studies of intimate partner violence provide preliminary support for the efficacy of these kinds of legislation targeting the individual behavior within a specific subset of the family population. The most commonly cited mechanism linking such statelevel legislation to intimate partner homicide is that those laws reduce the number of firearms inside certain homes in which potential for homicide is elevated. That mechanism, however, is more often assumed than tested empirically."}, {"section_title": "Aims and Hypotheses", "text": "The overarching goal of this study is to examine the degree to which state-level legislation aimed at reducing firearm ownership among individuals with domestic violence records actually does so as a means of better understanding the efficacy of such laws. Specifically, we examine whether the length of time that domestic violence misdemeanants were automatically restricted from access to firearms was associated with firearm ownership among high-conflict families. As noted earlier, although prior studies have not found an association between these length of restriction laws and firearm-related domestic violence homicides, differences in our analytical sample versus total population studies may produce different results. Our analytical sample consists of stably partnered, two-parent families, for whom a convicted domestic violence incident may have happened in the past (and hence, might not be as susceptible to other, more temporary, legislative approaches to protecting domestic violence victims). We argue that this population is important, given high rates of domestic violence recidivism (Renauer and Henning 2005) , and that the families of interest in our analytical sample more often than not report existing physical conflict.\nIn the process of examining the degree to which state-level restrictions reduce firearm access among domestic violence misdemeanants, we address some of the limitations of this literature in order to strengthen the conclusions that can be drawn from our research. First, research linking the efficacy of these laws to state-level intimate partner outcomes may be confounded by the fact that laws addressing domestic violence may be adopted at the same time as other firearmrelated legislation. Addressing these confounds can support extrapolation about the effects of firearm-related legislation on firearm-specific behaviour (Zeoli et al. 2016) . Second, although some studies do control for state-and city-level demographic and legislative characteristics (Vigdor and Mercy 2006; Zeoli and Webster 2010) , state-and city-level studies are unable to control for the individual-level characteristics associated with variation in firearm ownership, such as race/ ethnicity and socioeconomic status (Prickett et al. 2014 ). Incorporating such individual-level data can advance understanding of how these laws function.\nThe hypotheses of this study are that the presence of statelevel laws prohibiting firearm ownership of offenders convicted of misdemeanor crimes of domestic violence (MCDV) will decrease the likelihood of firearm ownership in high-conflict families, that this association will grow stronger as the strength of such laws increase, and that these associations will not be completely (although potentially partially) explained by other related and measured contextual factors, such as the presence of other state-level laws targeting firearm safety or firearm ownership rates more generally. Testing these hypotheses is significant because elucidating the mechanisms by which state laws affect individual outcomes by changing individual behavior is a key component of understanding why laws work the way that they do. It is made even more significant given high rates of domestic violence recidivism (Renauer and Henning 2005) and because firearms in the homes of domestic violence offenders have consequences-particularly for women-for health and wellbeing other than death, such as mental health and injuries (Vittes et al. 2013) ."}, {"section_title": "Methods", "text": ""}, {"section_title": "Data and Sample", "text": "ECLS-B is a nationally representative sample of more than 10,600 children born in the U.S. in 2001. Parents were interviewed when their child was 9-months, 2-years, and 4-years old and during the kindergarten year to examine how children's early home and educational experiences are associated with their development (Snow et al. 2009 ). ECLS-B caselevel data are restricted per the National Center for Education Statistics' confidentiality legislation, although available to researchers by acquiring a restricted-use data license.\nIn the 2-year interview, parents (typically the mother) were asked about their households' firearm ownership and storage practices. These data were examined in an analytical sample of 5350 families created through several steps. The 850 children who attrited from the study by the second wave were dropped (note: longitudinal sampling weights were employed to reduce the biases associated with differential attrition). The sample was further restricted to two-parent families (excluding 2250 children) in which the father or mother's partner was the same father/partner living in the home at the 9-month interview (excluding 450) and in which the father/partner was interviewed at the baseline interview (excluding a further 1700). These last two restrictions were made because information on criminal arrests-a key component of our focal variable-was only asked of fathers/partners at the baseline interview. A diagram demonstrating the sample selection process can be found in the Appendix (Fig. 3 )."}, {"section_title": "Measures", "text": "The outcome was a binary variable indicating whether the parent reported a firearm in the household.\nA key predictor was a binary variable that identified Bhighconflict^partners that are the intended target population of laws that restrict firearm access from domestic violence offenders. Two pieces of information were combined to identify mothers with such partners based on previous research assessing high-conflict families (Moore et al. 2007) . First, at the 2-year interview both mothers and their partners were asked a series of questions on how they dealt with serious disagreements. We grouped together families in which either the mother or father/partner reported that they Boften^or Bsometimes^dealt with disagreements by hitting or throwing things at each other or by arguing heatedly or shouting, or in which the mother reported that her partner had physically abused her since the 9-month interview. Second, we grouped together families in which the father/partner also reported having been arrested for something other than a DUI. We examine men's arrests primarily because men are more likely than women to own firearms (Horowitz 2017 ) and more likely to commit intimate partner homicide (Durose et al. 2005) . In the absence of data that directly identify parents who have an arrest history specifically related to domestic abuse, combining both arrest history and relationship conflict identifies families most likely to fall within the population targeted by these laws. The binary variable differentiated families with both markers of conflict and arrest from all other families. A figure summarizing this categorization can be found in the Appendix (Fig. 4) .\nA second set of predictors captured the presence and strength of state-level laws automatically restricting access to firearms by offenders with MCDV convictions. Although many states have laws that restrict access to firearms by domestic violence offenders, we chose to focus on states that automatically restrict access given wide variation in implementation of these laws in states where judges have discretion over revoking firearm ownership rights (Frattaroli and Vernick 2006) . Moreover, although there are many factors that could determine the strength of firearm laws (e.g., compulsory firearm surrender, clear accountability of surrender, evidence of aggravating factors in order to prohibit firearm ownership) in this study we focus on time limits on prohibition of firearm ownership.\nThe State Firearm Law Database (McClenathan et al. 2017 ) and the Gun Law Navigator (Everytown for Gun Safety Support Fund 2017) were used to identify state-level laws in 2003 (the year in which the 2-year interview was conducted) that (1) automatically prohibited MCDV offenders from possessing firearms, (2) included a provision concerning the length of time offenders were prohibited from possessing firearms, and, (3) if so, specified the length of prohibition. Three variables were created with this information. First, a binary variable identified whether the state had a law automatically prohibiting MCDV offenders from possessing firearms. Second, an ordinal scale from 0 through 2 indicated the presence and strength of MCDV laws: 0 = states did not have laws that automatically prohibited domestic violence offenders from possessing a firearm; 1 = states had a provision regarding the length of time (all falling between 1 and 5 years); 2 = states had MCDV laws that permanently or indefinitely prohibited offenders from owning a firearm. Third, a binary variable identified states where domestic violence offenders were permanently prohibited from owning firearms (i.e., score of 2 in the ordinal scale); in short, an indicator of states with the strongest laws versus all others. Figure 1 displays the ordinal scale of MCDV law strength for all states. In 2003 most states did not have automatic MCDV firearm restriction laws. Illinois, Indiana, New York, Connecticut, Hawaii, Washington, and West Virginia had the strongest laws, either automatically prohibiting or indefinitely prohibiting MCDVoffenders from possessing firearms permanently. Arizona, Delaware, Minnesota, and Texas had provisions that prohibited firearms for between 1 and 5 years. One exception in this group however, was Arizona, which limits firearm prohibition to the period of probation following conviction (with this period unlikely to be longer than five years). Sensitivity tests were conducted with Arizona included in the 'temporary' time limit group versus belonging in the group without MCDV laws, with the substantive results similar across the multivariate models.\nIn addition to the outcome and predictors, covariates of firearm ownership were included in multivariate analyses. Mother/father characteristics included age (continuous measure in years) (Parker et al. 2017) , education (dummy variables for less than a high school diploma/GED, high school/ GED, some college/associate's degree, college degree or more) (Parker et al. 2017) , race/ethnicity (dummy variables: non-Hispanic white, non-Hispanic black, Hispanic white, other) (Parker et al. 2017; Schwebel et al. 2014) , and drinking behavior (a scale ranging from 0 = does not drink through 6 = 20 or more drinks in the average week) (MartinStorey et al. 2018, forthcoming).\nFamily characteristics included family structure (dummy variables for child's biological parents were married, cohabiting biological parents, mother with nonbiological father/partner) (Johnson et al. 2004; Martin-Storey et al. 2015) , annual family income (broken into income quartiles to reflect higher firearm ownership rates among those in the middle of the income spectrum: $25,000 or less, $25,001-$50,000, $50,001-$100,000, more than $100,000) (Drongowski et al. 1998) , and number of children in the household (continuous measure).\nNeighborhood, state, and region characteristics included perceived neighborhood safety (a scale from 1 = very unsafe through 4 = very safe), urbanicity (three dummy variables: rural, urban cluster, urban area) (Johnson et al. 2004; Parker et al. 2017 , and also shown to be effective legislation for reducing firearm-related mortality and limiting access to firearms to at-risk groups, such as domestic violence offenders (Kalesan et al. 2016; Webster and Wintemute 2015) ."}, {"section_title": "Analytical Plan", "text": "Mixed effects logistic regressions tested whether firearm ownership was predicted by the presence and strength of MCDV laws, a high-conflict male partner, and the interactions between them. To account for state-level clustering of respondents and unmeasured state-level heterogeneity, these models employed second-level random intercepts of state residence. The analyses are represented generally by the following equation:\nWhere the probability of owning a firearm Y ij , is the sum of the individual-level intercept Y 00 , the individual-level covariates Y n0 , the state-level effect U 1j , and an individuallevel error term r ij .\nIf MCDV laws were operating as intended, we would expect no significantly negative main effect of MCDV laws on firearm ownership. We would expect a significant interaction, All analyses were conducted in Stata, with the suite of mi estimate commands used to create 100 multiply imputed datasets to account for the small amount of missing data (approximately 4.0% of the analytic data) and estimate the models (StataCorp 2015) . Sample weights were used to account for the complex survey design. Stata program code is available from the authors upon request. "}, {"section_title": "Results", "text": ""}, {"section_title": "2%).", "text": "As for the focal variables, families with firearms were less likely to include a high-conflict male partner with an arrest history (3.8% vs. 4.1%), although this difference was not significant at conventional levels (p = .06). Families with firearms were less likely to live in states with MCDV laws (24.1% vs. 27.0%), but there was no association between firearm ownership and the strength of state MCDV laws. Table 2 presents the bivariate association between state MCDV laws and families with high-conflict male partners' firearm ownership for three conceptualizations of such laws: any prohibition on convicted domestic violence offenders owning firearms, permanent prohibition, and an ordinal scale of the strength of these prohibitions (none, temporary prohibition, and permanent prohibition). Overall, these associations provide preliminary evidence that MCDV laws were negatively associated with firearm ownership among families with high-conflict male partners but not among families who did not report conflict, or where the male partner had an arrest history but conflict was not reported. For example, in states that have any prohibition on firearm ownership among domestic violence abusers, only 13.8% of families with high-conflict male partners reported owning a firearm compared to 26.7% of other families."}, {"section_title": "Association between MCDV Laws and Firearm Ownership", "text": "Turning to the multivariate analyses, Table 3 displays the odds ratios from mixed effects logistic regressions examining the three conceptualizations of state-level MCDV laws (full model results available in Table 4 in the appendix). Model 1 shows the coefficients of the key focal predictors (high-conflict male partner status and MCDV laws). It revealed no significant associations of high-conflict male partner status or MCDV state laws with firearm ownership. Models 2a-c added the interaction terms among the focal predictors. In Model 2a, having a high-conflict male partner significantly interacted with state-level MCDV laws to predict a 62% decrease in the likelihood of firearm ownership. Model 2b tested whether this finding was driven by families with high-conflict male partners living in states with the strongest MCDV laws (i.e., permanently prohibiting firearm ownership), revealing another significant and negative interaction term between the state law and high levels of family conflict. Finally, Model 2c tested whether the strength of MCDV laws-not just presence-was associated with firearm ownership among families with high-conflict male partners. The scale gauging the strength of the laws significantly interacted with the highconflict male partner variable to predict a decreased likelihood of firearm ownership.\nBecause all three interactions between the state law variables and male partner conflict variable were significantly associated with firearm ownership, we used multiple fit statistics (log likelihood, AIC, BIC) to determine which state law measure provided the best overall model fit. All fit statistics confirmed that the ordinal scale of MCDV law strength (Model 2c) provided the best fit. Table 3 includes the log likelihood fit statistics and log likelihood ratio tests between Models 1 and 2. The log likelihood ratio test is particularly useful for testing whether a nested model produces a significantly better fit of the data. In all three instances, the second model fit the data significantly better. The biggest difference between the first and second models, however, was between Model 1c and 2c (MCDV law strength captured as an ordinal scale), in addition to Model 2c fitting the data best across all models.\nUsing the findings from Model 2c, then, Fig. 2 presents the predicted probability of owning a firearm among families with high-conflict male partners (vs. not) in: states with no statelevel MCDV laws (BNone^), states with MCDV laws but with time-limited provisions (BTemporary^), and states with MCDV laws permanently prohibiting firearm ownership (BPermanent^). In states with no MCDV laws (BNone^), just over 30% of families with high-conflict male partners were predicted to own firearms. This decreased to around 22% of families with high-conflict male partners in states with no provision regarding length of prohibition (BTemporary^), and to 12% in states with MCDV laws permanently prohibiting firearm ownership (BPermanent^). Importantly, these laws were only minimally associated with firearm ownership among families without high-conflict male partners with an arrest history. Indeed, between 21 and 23% of such families owned firearms across all categories of state MCDV law strength.\nSensitivity analyses were conducted to ensure that the combination of high-conflict partner and arrest history were driving the results, not just an arrest history or having a highconflict partner. Results showed only significant associations between those families with high-conflict male partners and an arrest history but not between families where the male partner had an arrest history/no high-conflict behavior or families with high-conflict behavior/male partner had no arrest history, or families where the male partner had an arrest history regardless of high-conflict behavior (results available upon request)."}, {"section_title": "Discussion", "text": "Using a nationally-representative sample of U.S. families with young children, this study found that-in line with our hypotheses-living in states that placed restrictions on firearm ownership among offenders with domestic violence convictions was negatively associated with firearm ownership among families with a high-conflict male partner with an arrest history, and that this association was stronger as the 'strength' of the restrictions increased. For example, living in states that permanently prohibited firearm ownership among offenders with domestic violence convictions decreased the probability of firearm ownership among families with high-conflict partners and arrest histories from 30% to 12%. Importantly, these findings were net of controls for other confounding factors, such as whether the state had private sale background checks and parents' alcohol consumption. These findings are in line with both an ecological systems perspective, which recognizes the interaction between proximal and distal factors in influencing health behaviors, and economic perspectives linking the severity of consequences to declined participation in targeted behaviors.\nBringing the ecological system perspectives into the area of firearm research and policy is important given the increasing scholarly and public recognition that gun safety is a public health concern, as opposed to just a criminal issue (American Medical Association 2016; Benjamin 2015) . With a growing emphasis on this public health frame, this study provides an example of how the theoretical and methodological tools typically employed by social scientists place the field in a prime position to contribute to this broader discussion of firearm ownership and safety as a socially influenced health behavior.\nIn addition to the main findings of this study, two null findings are important. First, our models found that MCDV laws were not associated with firearm ownership among the population more generally. Instead, they were only significantly associated with decreased ownership among the atrisk group they sought to address. That is, these laws appeared to only affect the target population (i.e., individuals at risk for domestic violence) without interfering with the general public's ability to possess firearms-an important point that has not been previously demonstrated in this literature.\nSecond, despite the federal 1996 Lautenberg Amendment that limited access to firearms by domestic violence offenders in the U.S., we did not find a significant association between families with high-conflict male partners and arrest histories and firearm ownership overall. It is important to note that one potential reason for this lack of significant link is the uneven implementation of the Amendment and the age of our study data (see Raissian 2016 for more information). We use data collected in 2003. In 2003, only 32 states had fully implemented the Lautenberg Amendment. In this way, the lack of a significant negative association between high-conflict families and firearm ownership should not be interpreted as evidence that the federal legislation was not effective. Moreover, this null association could also be due to the inability to delineate those with an arrest versus those who may have subsequently been convicted after an arrest in the ECLS-B (where the Lautenberg Amendment mandates a subject must have a conviction). This lack of significant association is in line with previous work (Coker et al. 2000b; Walton-Moss et al. 2005 ) that suggests significant limitations in federal legislation and its implementation (Zeoli et al. 2016) , including the delay in implementation (Raissian 2016) . For example, federal legislation does not ensure that the firearms offenders already own are confiscated, and the loophole allowing sales without background checks by private and unlicensed sellers means registered offenders can still be sold firearms in many states (Price and Payton 2016; Rothman et al. 2006; Wintemute et al. 2010 ).\nOf note is that this sample is nationally representative of U.S. families with young children, not of the total population at risk of intimate partner violence. Moreover, examining families with young children is particularly important as young children introduce high levels of stress to relatively new relationships, and children in high-conflict homes-not just mothers-are at risk of witnessing or being victims of violence, particularly in cases of intimate partner homicidesuicide (Sillito and Salari 2011) .\nIn line with this limitation, and as mentioned earlier, our measure of the targeted population-convicted domestic violence abusers-was not exact. Although we know the male partner in the home had an arrest history for something other than a DUI, we do not know whether it was for a domestic violence incident. Similarly, we do not know when that arrest occurred. If they were in a state with time-limited provisions, for instance, they may have already outlasted the prohibition period. In this way, our constructed measure of families with high-conflict male partners with an arrest history likely picked up many families who would not be impacted by laws limiting firearm ownership among domestic violence abusers (i.e., false positives). On the other hand, there were also likely male partners in our sample who had an arrest history but whose partner did not report they were currently experiencing physical conflict (even if it had occurred in the past; i.e., false negatives). Moreover, as is the case with any study collecting information on sensitive topics-such as firearm ownership, criminal background, and domestic violence-there was likely some level of misreporting. These false positives, false negatives, and misreporting create a significant amount of noise in the analyses, which, depending on which type error was more prevalent, may have biased the findings by increasing selection (i.e., results appear stronger than they really are) or creating significant noise (i.e., results are more conservative).\nFurther limiting the generalizability of these findings is that the sample was-necessarily-limited to two-parent families and the violent behavior and arrest history of the male currently in the home. Approximately 15% of intimate partner homicides are committed by former intimate partners (Petrosky et al. 2017) . In this way, our findings may be biased in that the two-parent families with high-conflict male partners with arrest histories may be more likely to be aware of a firearm violation and report it, or because the mother may be aware of firearm restrictions, may act as a deterrent to the male partner acquiring firearms. Indeed, this is an important distinction in this study's sample versus other studies examining MCDV laws and intimate partner homicide rates, and may explain why prior studies (e.g., Vigdor and Mercy 2006; Zeoli and Webster 2010) have only found associations between intimate partner homicide rates and laws that restrict firearms from those under domestic violence restraining orders, but not laws that restrict firearms from convicted domestic violence misdemeanants.\nImportantly, the findings from this study are not causal. This study uses cross-sectional differences in state laws to examine whether state laws restricting firearm access from those with MCDV convictions. Despite this, the findings are in line with prior studies examining the association between state laws and intimate partner homicide rates which exploit time variation in laws across states (Vigdor and Mercy 2006; Zeoli and Webster 2010) . Moreover, that length of prohibition mattered above and beyond presence of laws restricting firearm access, providing support for a causal argument between MCDV laws and lower rates of firearm ownership among families with high-conflict male partners with arrest histories.\nAn additional 'layer' of noise-but one that points to our findings as being conservative in nature-concerns the implementation of these laws. For example, categorizing Bstrengthô f MCDV laws based on prohibition requirements misses discretion judges might have to enforce the law (due to differences in the interpretation of legislative language) or whether law enforcement needs to remove firearms if a firearm was not used during the particular domestic violence incident to which they are responding (Frattaroli and Vernick 2006) . Research that examines the nuance in the implementation of these laws points to the importance of not only prohibitions that stop convicted abusers from purchasing firearms, but laws that require the surrender of firearms when an arrest or conviction is made (Wintemute et al. 2014) . Due to small cell sizes in our data, we did not have statistical power to test whether these surrender laws provided an additional effect on the likelihood of owning a firearm. Future research should examine whether laws that require the surrender of firearms at the time of the conviction or violent incident is associated with firearm ownership among convicted domestic violence abusers. Also, discrepancies in how these laws are implemented, and the loopholes that exist through private sales and differences in adjacent states' laws, need to be carefully examined when trying to understand the efficacy with which these laws limit firearm access. Indeed, an important area of future research is whether certain legislation increases the efficacy of laws aimed at limiting access to firearms among domestic violence misdemeanants. For example, states that have stronger laws surrounding background checks-such as requiring background checks on private firearms sales in general-might further reduce the likelihood of firearm ownership among high-conflict families. Indeed, previous research suggests that firearm legislation aimed at curbing particular behaviors may function better in contexts where stronger firearm laws are already in place (Prickett et al. 2014) . Although state-level laws requiring background checks on private sales of firearms in the current study was not associated with a lower likelihood of firearm ownership among the general population, it might matter additively for reducing firearm ownership among domestic violence offenders. Finally, domestic violence laws may vary from state to state, and police have different levels of autonomy over when to arrest during domestic disturbances (Hoctor 1997) , which could lead to significant state differences in who is convicted of a misdemeanor crime of domestic violence.\nAlthough firearm safety legislation is a divisive topic in the U.S. (Spitzer 2005) , approximately three-quarters of both firearm owners and non-owners support laws prohibiting people who have been convicted of domestic violence from possessing a firearm for ten years (McGinty et al. 2013) . Moreover, women who are victims of domestic violence where firearms are involved state their desire for firearm removal from the home, even if the violent episodes have stopped (Vittes et al. 2013) . Importantly, preliminary research on laws in California supports the feasibility of laws designed to keep firearms out of high-conflict families (Wintemute et al. 2014) . These points, coupled with our findings on ownership and prior research on intimate partner homicide, suggest that federal legislation that permanently prohibits domestic violence offenders from procuring firearms could play a key role in decreasing intimate partner homicide.\nThe results from this study should be interpreted in the context of past research showing higher fatality rates during incidences of intimate partner violence when firearms are present in the household and high rates of domestic violence recidivism. Since 2003 (the year in which the data for this current study were collected), eleven of 41 states that had no MCDV laws in 2003 passed legislation that restricted access from firearms for domestic violence offenders. Importantly, nine of the ten states with the highest prevalence of rape and physical violence by an intimate partner currently have no MCDV laws restricting access from firearms among domestic violence offenders (Black et al. 2011) . These patterns suggest that those states with the most to gain from these laws are the least likely to have them. "}]