[{"section_title": "Introduction", "text": "As the most common mood disorder category among the elderly population, anxiety diagnoses occur in 17.1% in people aged 65 years and older (Kirmizioglu et al., 2009) . Individuals with anxiety may experience a higher risk of Alzheimer's disease (AD) development (Pietrzak et al., 2015) . Some researchers suggest that the use of anti-anxiety medications further exacerbates the risk of developing AD (Rosenberg, 2015a) . This study explores the link between anxiety, anti-anxiety medication, and AD dementia development, exploring anxiolytic medication as a moderator of AD risk."}, {"section_title": "Risk factors of AD dementia development", "text": "Studies have suggested a possible genetic link to the development of AD dementia, which is often attributed in part to apolipoprotein e (APOE) in sporadic late-onset cases. Although APOE ε3 is the most common gene expression, White APOE ε4 carriers appear to possess the highest risk of developing AD (Alzheimer's Association, 2015; Tang et al., 1998) . This gene has commonly been associated with functional and memory impairments (Farlow et al., 2004) . APOE ε4 carrier status also poses a greater risk of hippocampal atrophy in homozygous elderly carriers (Lemaître et al., 2005) and increases the risk of developing AD Researchers have suggested that the majority of individuals diagnosed with MCI also present with neuropsychiatric symptomology, including depression, apathy, and anxiety (Palmer et al., 2007; Penna, 2013) . Despite the association between neuropsychiatric symptoms, MCI, and development of dementia, it is unclear whether these symptoms are predictors of the transition from MCI to dementia (Devier et al., 2009; Edwards et al., 2009; Mah et al., 2004; Penna, 2013) . Ramakers et al. (2013) suggested that those individuals with MCI and anxiety had abnormal levels of t-tau and Aβ42 in their spinal fluid. Similar results were not observed with those experiencing depression or apathy and MCI (Ramakers et al., 2013) . Palmer et al. (2007) found that the majority (over 84%) of patients diagnosed with MCI and co-occurring anxiety developed AD dementia after study follow-up. With each new symptom of anxiety, such as irritability, sleep disturbance, or uncontrollable worry, the risk of developing AD dementia doubled in individuals with MCI within a 3-year period (Palmer et al., 2007) .\nStudies have investigated the impact of depression on AD development (Burke et al., 2011 , Bunce et al., 2012 Byers and Yaffe, 2011) ; however, the examination of anxiety as a predictor or risk factor associated with AD dementia remains understudied. While some studies suggest that anxiety is not a predictor of AD dementia (Devier et al., 2009) , others support the link between anxiety and AD development risk. Alzheimer's Disease Neuroimaging Initiative (ADNI) data was examined to explore anxiety as a predictor to AD dementia (Mah et al., 2004) , finding an increased rate of progression from amnestic MCI to AD dementia by level of anxiety, when controlling for the effect of cognitive decline and depression. Increased anxiety levels are hypothesized to increase amyloid beta, thereby increasing the rate of cognitive decline prior to the development of AD dementia (Pietrzak et al., 2015) . This may be due to oxidative stress resulting from the increased allostatic load of pathological anxiety (Goldstein, 2012; Hovatta et al., 2005; Rammal et al., 2008a; Rammal et al., 2008b) . Despite the correlation between inflammation, chronic anxiety, and neurodegeneration, conflicting results pertaining to the prediction of AD development have highlighted the need for more comprehensive investigations."}, {"section_title": "Methods", "text": "In order to investigate the role of anxiolytics in moderating the risk of AD posed by anxiety independently and synergistically with APOE ε4, a secondary data analysis of the National Alzheimer's Coordinating Center Uniform Data Set was undertaken. The variables utilized for this study included self-reported anxiety, the use of anxiolytics, and APOE genotype. Sporadic late-onset AD was an outcome of interest and is referred to as probable AD throughout this study. MCI was examined as an alternative endpoint of interest. Those with normal cognition in their first visit (n = 12,083) comprised the analytic sample. Prior to conducting any analysis, this study received approval from the Florida International University Institutional Review Board.\nApolipoprotein E was measured by the presence or absence of ε4, denoted by ε4 carrier and non-carrier. An ε 4 carrier may have one or two ε4 alleles, while a non-carrier has other combinations of APOE, none of which contain ε 4. The anxiolytics examined included a general category anxiolytic, alprazolam, clonazepam, lorazepam, paroxetine, and venlafaxine.\nDescriptive analyses were employed for all relevant variables to determine frequencies and distributions of predictor variables and covariates. Survival analysis was utilized to test the hypothesis that anxiolytic medication use by those with anxiety and/or APOE ε4 moderates the hazard of AD development. An event was defined as a diagnosis of MCI, and secondarily, and independently, as the diagnosis of probable AD by a subject's last observation. Time zero was equal to the subject's first observation (visit number 1), and time was measured in days. True survival time was unknown unless a participant developed clinically observable MCI or AD by their last observation. The independent and/or synergistic effect of anxiety, ε4 carrier status, and the use of anxiety medication was examined in relation to time to the diagnosis of MCI or AD using the Cox proportional hazards model (Cox, 1972) . Efron approximation was used as a technique for handling ties (Efron, 1977) . To test the moderation effect of anxiolytic medication, a Cox regression model was employed for each anxiolytic category, including participants who took the medication, who did not take the medication, and who omitted their response. For each category, four models were used to examine the unadjusted main effects and adjusted main effects by different potential confounders. The main effects were examined unadjusted in the first model, and were adjusted for biological sex, age, education, race, and Hispanic origin in the second model. A further adjustment for ε4 carrier status was added in the third model, and the final model included all previous covariates with the addition of the use of AD medication. Although not displayed in the tables, depression was controlled experimentally given its status as a known comorbid disorder. Controlling for depression in the final model made no difference in the significance level of the hazard. The assumption of proportionality was examined in order to determine whether the Cox proportional hazards assumption had been met. The statistical program STATA (StataCorp, Release 14, 2015) was utilized for the analyses, and a p value < 0.05 was considered statistically significant."}, {"section_title": "Results", "text": "The minimum amount of time under observation was 208 days until the first occasion that the AD diagnosis occurred, and the maximum was 3458 days (M = 1549.38; Mdn: 1456; SD: 2305.17). The mean number of visits for those with normal cognition was three, with a range of one to ten visits. There were 361 diagnoses of AD dementia by the end of the observation period among older adults who had at least an initial visit as well as a follow-up visit (analytical sample = 9138). Similarly, the minimum amount of time under observation was 171 days until the first diagnosis of MCI occurred, and the maximum was 3458 days (M = 1437.81; Mdn: 1207; SD: 2196.98). There were 1520 diagnoses of MCI by the end of the observation period among older adults who had at least an initial visit as well as a follow-up visit (analytical sample = 9184). The mean age of subjects with normal cognition at visit one was 71.05 (SD: 10.86; Mdn: 72). At visit one, 80.5% of the sample were White, 13.01% were African American, and 5.95% were from other ethnic groups. Six percent of the sample reported Hispanic origin. Almost 35% of subjects reported that their mother had been diagnosed with dementia, while 17.75% reported that their father had been diagnosed with depression. Percentages, means, and standard deviations (where applicable) are displayed in Table 1 . The log-rank test for equality of survivor functions revealed statistically significant differences (p < .001) in the survival curves of those who did and did not experience anxiety."}, {"section_title": "Main effects for AD development", "text": "The Kaplan-Meier plot with probable AD as an outcome is displayed in Figure 1 . The hazard of probable AD development was statistically significantly higher for those reporting anxiety symptoms (HR = 3.50, 95% CI 2.77 -4.44, p < .0001). The effect of anxiety was no longer statistically significant when an anxiolytic was in use. The use of specific generic anxiolytics produced similar results when participants with anxiety also reported taking prescription medications, including alprazolam, clonazepam, lorazepam, paroxetine, and venlafaxine. Table 2 contains the results for these models. The Kaplan-Meier plot for participants with anxiety and probable AD defined as an outcome is displayed in Figure 2 .\nThis main effect and anxiolytic moderation effect of ε4 carriers in relation to probable AD development was tested. ε4 carriers saw a statistically significant higher hazard of AD development (HR = 1.92, [1.52-2.41], p < .001). The hazard ratio (HR = 2.55, [2.02-3.21], p < .001) increased when adjusted for sex, age, education, race, Hispanicity, and AD medication use. This relationship was no longer significant, however, when taking into account a broad anxiolytic categorization, alprazolam, clonazepam, lorazepam, and venlafaxine use. For those ε4 carriers who took paroxetine, a statistically significant relationship to probable AD remained. These results indicated that anxiolytics appear to neutralize the risk posed by APOE ε4. The results of these models are displayed in Table 3 .\nThe additive effect of anxiety among ε4 carriers indicates a continued high risk; the hazard of which is more than double the simple sum of the two hazards alone .89], p < .001). This hazard ratio increased when adjusted for sex, age, education, race, and Hispanicity .14], p < .001), but decreased slightly when also adjusted for AD medication use .22], p < .001). A similar pattern emerged in which the use of a general anxiolytic or alprazolam, paroxetine, or venlafaxine appeared to neutralize the previous significant hazard of AD development to the point where there was no longer a statistically significant risk. When the effect of paroxetine as a moderator was adjusted for the previously mentioned covariates, a statistically significant hazard emerged, though the sample size decreased to the point where the confidence interval greatly expanded beyond a meaningful range (Table 4) ."}, {"section_title": "MCI as the endpoint of interest", "text": "The Kaplan-Meier plot with MCI as an outcome is displayed in Figure 3 . The hazard of MCI development was statistically significant higher for those reporting anxiety symptoms (HR = 2.13, 95% CI 1.85-2.44, p < .0001). The Kaplan-Meier plot for participants with anxiety and MCI defined as an outcome is displayed in Figure 4 . The use of anxiolytics as a general category did not neutralize the effect of anxiety, which were virtually the same as the effect without the anxiolytic use. The effect of anxiety was no longer statistically significant when specific anxiolytics were used: alprazolam, paroxetine, and venlaxafine. Table 5 displays the results for these models.\nThis main effect and anxiolytic moderation effect among ε4 carriers in relation to MCI development The results of these models are displayed in Table 6 .\nThe additive effect of anxiety among ε4 carriers indicated a continued high hazard of MCI development (HR = 2.37 [1.84-3.04], p < .001). The hazard ratio increased when adjusted for sex, age, education, race, and Hispanicity (HR = 2.68 [2.09-3.44] p < .001), and remained virtually unchanged when adjusted for AD medication use (HR = 2.67 [2.08-3.44], p < .001). For ε4 carriers with anxiety, the use of the variety of medications included in the general anxiolytic category offered no reduction in risk, and surprisingly raised the hazard of MCI development (HR = 3.16 (1.86-5.37), p < .001). The use of alprazolam, lorazepam, paroxetine, or venlafaxine, specifically, appeared to neutralize the previous significant effect of anxiety to the point where there was no longer a statistically significant risk. The use of clonazepam conferred a statistically significant higher hazard of MCI development among ε4 users with anxiety (HR = 7.41 [2.39-22.95], p < .001). This hazard is three times the hazard of the main itself alone, suggesting that there is something about clonazepam use that is influencing the increasing hazard. This result speaks to the previous literature on the topic of anxiolytic use and neurodegeneration, which generally indicates an increased risk because of medication itself."}, {"section_title": "Discussion", "text": "The results of this study suggest that use of anxiolytics may moderate MCI and AD development, specifically indicating a neutralized risk for those with anxiety symptoms and ε4 carriers. These results require a visitation to the classic literature, which is highly publicized, and is widely known for suggesting a correlation between anti-anxiety medicine use and AD development. Billioti de Gage et al. (2012) found a correlation between AD diagnosis and benzodiazepine use starting at least five years before the AD diagnosis. The strength of association increased with usage length; three to six months of drug prescription raising the risk of AD development by 32% and more than six months of prescription raising the risk to 84% (Billioti de Gage et al., 2012) . Individuals prescribed long-acting benzodiazepines demonstrated a higher risk of AD development compared to individuals prescribed short-acting benzodiazepines (Billioti de Gage et al., 2012) . As the understanding of how anxiety relates to AD risk is still unknown, there are at least two competing explanations for the apparently neutralizing or even protective effects of anxiolytic drug use. The first is that anxiety is a prodromal symptom of AD that can appear years before AD diagnosis and may be the result of an unknown biological cause that ultimately concludes with AD diagnosis. In the second scenario anxiety is an independent disorder that, in combination with other diseases, disorders, or social problems, can exacerbate AD development.\nIf anxiety is an early onset symptom of AD, pharmaceutical treatment may mask the severity of other AD components, delaying identification and diagnosis. In general, symptomology of the early stages of AD includes possible difficulty with remembering events, names of individuals, and recent discussions (Alzheimer's Association, 2015). A gradual, very slow progression with more evidence of memory impairment than intellectual difficulties are associated with late-onset AD (World Health Organization, 2016). Disorientation, agnosia, aggression, agitation, anxiety, apathy, poor judgment, confusion, with gradual difficulty with walking, swallowing, as well as speaking can also occur in the late stages of Alzheimer's (Alzheimer's Association, 2015; World Health Organization, 2016). An individual can display a mixed presentation with both early as well as late onset symptomology (World Health Organization, 2016) .\nThere have been suggestions regarding the link between AD risk and the use of medications for anxiety such as benzodiazepines (Billioti de Gage et al., 2012; Rosenberg, 2015a) . Rosenberg (2015b) reports use of long-acting benzodiazepine medications over an extended period may increase risk of AD development. When assessing benzodiazepine use during the prodromal phase of AD, there may be no association between the development of the disease and benzodiazepine use (Imfeld et al., 2015) . Additional clinical control trials are needed to establish definitive conclusions regarding the relationship between AD development risk and benzodiazepine use (Defrancesco et al., 2015) . Because of the association between anxiety and brain atrophy, anxiety may precede the onset of dementia, although this association requires further examination (Mah et al., 2004) .\nAnxiolytics enhance the inhibitory neurotransmitter gamma-aminobutyric acid (GABA) in the central nervous system (Finkelman, 1997) . Researchers have suggested that GABAergic agents in medications may be responsible for reducing anxiety (Kalueff and Nutt, 2007; Lydiard, 2003) . Researchers have suggested that antagonists of the glutamate receptor, N-methyl-Daspartate (NMDA) have a potentially protective effect against neurodegeneration (Duguid and Smart, 2009; Garcia de Arriba et al., 2006; Lipton, 2004) . When combined with GABA, NMDA may have positive anxiolytic-like effects (Poleszak et al., 2011; Zarrabian et al., 2016) . Several anxiolytic medications are available to address anxiety symptoms. The most popular category of anxiolytics prescribed are benzodiazepines (Cascade and Kalali, 2008) . These medications increase GABA-A receptor activity, therefore reducing neuron excitability (Griffin et al., 2013) . Alprazolam (Xanax, Niravam, Alprazolam Intensol, or Xanax XR,) has been commonly prescribed for many years (Fawcett and Kravits, 1982) , and is classified as short-acting with highpotency (Griffin et al., 2013) . Another high-potency, short-acting benzodiazepine is lorazepam (Ativan, Lorazepam Intensol; U.S. National Library of Medicine, 2014) . This medication also binds to GABA-A, but with a lower affinity than alprazolam (Griffin et al., 2013) . Clonazepam (Klonopin) is a high-potency benzodiazepine that acts on the GABA-A receptor agonist (Griffin et al., 2013) and works as a serotonin agonist (Chouinard et al., 1983) . This medication is unique compared to other benzodiazepines as it does not bind strongly to GABA-A (Chouinard et al., 1983) .\nIt is hypothesized that selective serotonin reuptake inhibitors (SSRIs), another class of anxiolytics, increase extracellular serotonin via the reduction of serotonin reabsorption in the presynaptic cell (Stahl, 1998) , which increases synaptic cleft serotonin levels used to bind to the presynaptic receptor and stimulate the cell. This overstimulation signals the nervous system to decrease the release of serotonin (Stahl, 1998) . Paroxetine (Paxil, Brisdelle, Pexeva, or Paxil CR) is a SSRI (U. S. National Library of Medicine, 2014) . The medication has the highest affinity of serotonin of all SSRIs with aversion to norepinephrine and dopamine (National Center for Biotechnology Information, 2016). Venlafaxine (Effexor or Effexor XR) is a long-acting SSRI and norepinephrine reuptake inhibitor classified as specific serotonin and norepinephrine reuptake inhibitors (SNRIs; Lambert and Bourin, 2002) .\nMedications examined in the current study treat symptoms of anxiety, depression, and sleep difficulties. Concluding that older adults were especially sensitive to benzodiazepines and at risk of cognitive impairment, delirium, and bodily harm, the American Geriatrics Society (2015) strongly recommended that benzodiazepine use was inappropriate for older adults; the same experts also strongly recommended SSRIs as inappropriate because of an increased risk of falls (American Geriatrics Society, 2015) . Many of these side effects overlap with symptoms typically associated with AD diagnosis; memory impairment, concentration issues, personality changes, sleep disturbances, and eating or weight changes. With difficulties in separating the intended treatment, the prescription medication side effects, and the symptoms of AD, a delay in diagnoses of AD may be delayed in patients prescribed psychotropic medications. Anxiety may be a disorder that exacerbates the development of AD as part of a syndemic process. A syndemic is the synergism of two or more diseases, disorders, or social problems that result in negative health consequences that are worse than an additive effect (Singer, 2009) . Anxiety, in conjunction with other biological and psychosocial factors that fatigue the body and activate a stress response system, may impact AD development. Psychopharmacological treatment of anxiety may lessen the burden on the stress response system, reducing AD development risk. While there is no current cure for AD, there are a number of treatments for its modifiable risk factors, such as anxiety. Those in the public health professions remain uniquely positioned to research and provide direct service related to assisting clients with behavioral changes, which may delay the onset of neurodegeneration."}]