[{"section_title": "Abstract", "text": "On one hand, food system analysts have been concerned about many topics: the rising age of farm operators, declining farm numbers, lack of adoption of practices and systems supporting greater ecological sustainability, and interest in increased food production for local markets. On the other hand, many energetic and enthusiastic people express interest in farming and producing more community-based food. Many of these people also claim values related to sustainability. a This is a revised version of a paper presented at the annual meeting of the Rural Sociological Society, Tampa, FL, August Despite prospective and new farmers' strong interest and enthusiasm, most face numerous challenges in their start-up phase and many do not continue, even those showing considerable promise. In this paper we focus on the results from in-depth interviews with current and former startup farmers in the Northeastern U.S. We illuminate four sets of factors related to \"success\" in farm start-ups: social context, personal characteristics, business characteristics, and luck. We then make three recommendations for the consideration of policy-makers, farm start-up advisors, and beginning farmers: advising and mentoring, conceiving of farms as parts of a larger food system, and focus on playing to strengths."}, {"section_title": "", "text": "a This is a revised version of a paper presented at the annual meeting of the Rural Sociological Society, Tampa, FL, August 9-12, 2005 . This project was supported by the Growing New Farmers Project, which was funded by the Initiative for Future Agriculture and Food Systems program of USDA, and was administered through the New England Small Farm Institute (NESFI), 275 Jackson St., Belchertown, MA 01007."}, {"section_title": "Introduction", "text": ""}, {"section_title": "Challenges to Entry", "text": "The complex and changing contexts for contemporary agriculture greatly affect the prospects for success in entering farming in the U.S. In general, mainstream farming has been becoming less labor intensive and more capital intensive (Cochrane, 1993 (Cochrane, , 2000 . Farm enterprise size has been increasing and contemporary farm numbers are less than one-third of those in the 1920s (see the chapter on \"Farm Numbers and Land in Farms\" in National Agricultural Statistics Service, 2009). Moreover, the bulk of actual production of many commodities is increasingly coming from a relatively small percentage of the largest farms (MacDonald, Hoppe, & Banker, 2006) . And larger farms tend to have lower production costs due to labor-efficient technologies and volume buying (MacDonald, et al., 2006) , as well as better access to and higher prices in output markets (Martinson & Campbell, 1980) . Community-building practices of shared labor have been in decline with increasing farm size, increasing investments in machinery and other inputs, and growing variation in farm sizes (Harper, 2001 ). Many of the foregoing factors raise the costs of farm start-up and create other barriers that can make farm entry challenging. Those who succeed in farm start-ups need to find ways of navigating these challenges and finding niches where their enterprises can take root.\nThe challenges and opportunities for farmers also vary geographically. Historically, farm characteristics have tended to vary by region, due in part to patterns of continually emerging specializations rooted in climate, topography, markets, transportation systems, and other factors (see, e.g., Cochrane, 1993) . Although agro-ecological conditions vary widely in the Northeast, where this study was conducted, typical soil characteristics, field sizes, rainfall amounts, and proximity to major urban centers have yielded conditions conducive to dairy farming compared to some other parts of the country, although typically such farms have been on a smaller scale than dairy farms located in western states (see, e.g., Gilbert & Akor, 1988; Gilbert & Wehr, 2003) . The situation regarding fresh vegetable production would be similar, with even more pronounced change brought by technical innovations that include refrigeration and changes in the retail sector like the rise of large supermarkets (Friedberg, 2009) . Recently trends of regional divergence have continued, with the Midwest and Great Plains having farm losses due to consolidation of commercial farms (Gale, 2000) . In contrast, the Northeast and other areas that are \"high in amenities\" or in close proximity to large urban centers have been gaining farms, many of which are small, part-time operations (sometimes dubbed \"lifestyle\" and \"retirement\" farms, reflecting an interpretation of such farms based on their relatively small net returns).\nThe declines in numbers of commercial farms and the increases in the average age of farm operators in recent years are connected to the patterns of farm exit and entry. Indeed, declining farm numbers may result more from decreasing rates of farm entry than from increasing rates of exit (Gale, 1994) . The increasing average age of farmers reflects the trend of farming households not replacing themselves in agriculture. For the U.S. as a whole, the 2007 Census of Agriculture showed that the average age of farm operators had increased to 57 years, about 2 years older than in 2002 and nearly 7 years older than in 1978. 1 "}, {"section_title": "Opportunities for Entry", "text": "Despite the challenges to conventional farm entry, market opportunities for food and agricultural enterprises that differ from the dominant trend are also emerging (Lyson, 2004) . Significant and growing numbers of customers want foods with particular properties, such as fresh, local, unique, or produced without particular production practices that these customers deem environmentally unsound, risky, inhumane, etc. One trend in supplying this market is the rise of a diverse range of small-scale, alternative agricultural enterprises producing for specialized and local markets, e.g., through farmers' markets, community supported agriculture (CSA), farm stands, and mail order.\nAnother emerging trend is toward more middlesize enterprises -\"agriculture of the middle\" -whose operators tend to specialize in producing particular agricultural products, but have become embedded in alternative marketing arrangements that bring them greater returns (e.g., Lyson, Stevenson, & Welsh, 2008) . Many of these smaller and mid-size operators use production strategies and practices that differ from the mainstream and their operators strive to differentiate their produce from that of the mainstream, using clearly labeled practices like organic or grass-fed. These small and mid-size agricultural enterprises offer numerous opportunities for entry to new farmers, but typically also present complex production and marketing challenges that make getting sufficient returns to labor and capital for household livelihoods problematic. As a result, most such farms rely heavily on nonfarm income and benefits (USDA Economic Research Service, 2005) . Still another trend is the rise of \"social movement\" organizations of farmers that support the small and alternative enterprises that were dismissed by land grant university researchers and Extension agents for many years. These organizations of farmers have provided locally situated knowledge and social support for those engaging in such enterprises. Examples include grass-based livestock production (Hassanein & Kloppenburg, 1995) and organic vegetable production, e.g., the Northeast Organic Farmers Association.\nThemes from previous research on farm entry informed this study. Studies on dairy farming in the Midwest (Agricultural Technology and Family Farm Institute, 1995; Barham, Jackson-Smith, Stevenson, & Taylor, 2001a , 2001b Buttel, Jackson-Smith, Barham, Mullarkey, & Chen, 1999; Center for Integrated Agricultural Systems, 2001; Jackson-Smith, 1994; Program on Agricultural Technology Studies, 2001) suggest that a wide variety of dairy farm start-up strategies can be successful for new farmers from different kinds of backgrounds, that family succession is not the only route into farming, and that entry on a modest scale can succeed. They suggest the need for good matches between the characteristics and skills of the operating household and the scales and types of enterprises. They also suggest the need for a variety of policies that would help to increase net returns to farming, make affordable credit available, and implement programs that assist startup farm enterprises. Authors of a study in Michigan concluded that start-up dairy farming was feasible with innovative management techniques that reduce operating costs (Schwarzweller & Viera, 1996) .\nOther studies of farm start-ups have looked more broadly than dairy farming. In the late 1990s, the Northeast New Farmer Network (NENFN) project examined start-up farmers in the Northeastern states with the goal of developing the infrastructure needed to support farm start-ups (Johnson, Bowlan, Brumfield, McGonigal, Ruhf, & Scheils, 2001 ). Based on a series of focus groups, they developed a typology of new and prospective farmers with two main categories: prospective (with subcategories of recruits, explorers, and planners) and beginning (with subcategories of start-up, restrategizing, and establishing). To assist in planning programs for new farmers, Johnson, et al., also analyzed a variety of attributes of such farmers, their social contexts, their farming and financial goals, and their learning and assistance preferences. Their recommendations include tailoring programs to meet the needs of different types of prospective and start-up farmers, broadening the range of topics considered and covered in programming (e.g., family goals, social support system). Work from this same group led to a set of policy recommendations around important issues of farm start-up: \"access to capital and credit\"; \"access to land\"; \"access to information, training and technical assistance\"; and \"access to markets.\" In the context of Iowa, Paul Lasley (2005) examined the social context of Iowa agriculture with an emphasis on farm succession and how this context both discouraged young people from entering agriculture and created barriers to doing so. Lasley offered recommendations for policies that would assist beginning family farmers by improving the profitability of their farms and lowering their risks, and by improving the services provided by land grant universities and their Cooperative Extension arms.\nWe undertook a qualitative study to better understand the processes of decision-making embedded in social and ecological contexts that led to continuation and exit among those engaged in farm start-ups in the Northeast. Unlike many previous studies, this one is focused substantially on the social aspects."}, {"section_title": "Methodology", "text": "This study had two phases; in this paper we primarily report on the findings of the second phase, but we briefly describe the first phase because it provides an important backdrop. The first phase was a survey of a broad range of continuing and exited farmers who had begun farming in the Northeastern U.S. The second phase was in-depth qualitative interviews with a subset of these farm operators. Because qualitative studies are not common in this topic area, in the rest of this section we briefly describe the approach."}, {"section_title": "Sampling and Sample Characteristics", "text": "For the purposes of this study, we defined farming as undertaking agricultural activities with intent to produce products to sell commercially to generate profit (Johnson, et al., 2001) . Start-up farmers were those who had been actually engaged in farming for 10 or fewer years, regardless of the scale of their enterprises or net income levels. Since no lists of start-up farmers from which to draw a sample were known to exist, in the first phase we recruited participants at a range of events that beginning farmers were expected to attend. We also asked Extension staff, staff at nongovernmental organizations, and other farm service providers who worked with such farmers to invite their clients to participate. Through these means, we obtained a nonrandom, purposive sample of 99 beginning farmers from the 10 Northeastern states with farms that ranged from full-time businesses to small, sideline enterprises (see table 1 ).\nThe second phase of the study involved qualitative interviews with 36 start-up farmers who had participated in the first phase. We selected these cases from the pool of 62 cases who had both returned their questionnaires in time to be considered and had indicated that they would be willing to be interviewed in person (table 2) . From this pool we chose cases that reflected the range of both farm types and social contexts for start-up farmers. Our goal was improve our chances of detecting potential substantial differences because of these variables (\"theoretical sampling\" as described by Glaser & Strauss, 1967) . We surmised that the most important source of variation that we could meaningfully explore in this study would be type of commodities produced, with geographic context being another significant source. Accordingly, three considerations drove our selection of cases to represent: (1) the different states in the Northeast (shown in table 3), (2) the range of common farm types and circumstances (see tables 4 and 5 for indications of the range), and (3) both continuation in farming and exits.\nOne complication was that many of the farms were quite diversified and, therefore, not neatly classifiable. Since dairy farming represents one of the more specialized and common farm enterprises in the region, seven cow dairy cases, with herd sizes ranging from about 70 cows to 500, were chosen for interviewing. Other than the dairy farmers, most of the farmers marketed their products directly to consumers, with a few marketing in both ways, often by direct wholesaling to restaurants rather than selling in mainstream commodity markets (see table 5 ). Several of the start-up farmers operated community-supported agriculture (CSA) enterprises. Beyond the cleaning and packaging typical of preparing vegetables and other products for direct sale, at least three of the farm households did substantial on-farm processing of milk or herbs to add value to their products. Livestock producers who marketed their meat and other products directly to consumers typically used other firms for processing. We did not get detailed income information in the interviews, but judging from the interviewees' living circumstances, kind of farming enterprises, age, occupational history, and family employment information, we would expect that fewer than half of the farm households interviewed would have earned the bulk of their household income from their farming enterprises. Some had substantial resources from off the farm to invest in their farming enterprises, while others had very limited resources.\nOur third criterion was to get a balance between farmers who were still farming and those who had exited. Unfortunately, few already-exited farmers participated in the survey and many of those who exited between the time they completed the questionnaire and when we tried to contact them proved difficult to contact and to interview. Some Retail 21\nMixed 6\nWholesale 9\nTotal 36 of these had nonvalid addresses and phone numbers and we were unsuccessful in internet searches to find contact information for them. Of the 26 survey respondents whom we considered for interviewing, but did not interview, eight fell into this category. We surmise that they were no longer in farming during the time of our interviews. As a result, only three farmers who had exited farming were interviewed, although one of these was a partner in another, currently ongoing farm started initially by her spouse."}, {"section_title": "Recruitment and Interview Procedures", "text": "We mailed each of the farm households selected for interviewing a letter acknowledging their participation in the survey, describing both our reasons for asking them to be interviewed and the interview process, listing the benefits and risks of being interviewed, and indicating that they would be contacted. In the letter we requested that any adults who were directly involved in managing the farm enterprise participate in the interview.\nMost of the interviews, conducted between midApril 2003 and late April 2004, took place on the interviewees' farms, either in their homes or at other suitable places on their farms. The exceptions were the two operators who did not live on their farm sites and who were interviewed in the winter and the three cases who had left farming. One of these exited farmers lived in another part of the country, so was interviewed by telephone. Almost half of the interviews involved more than one interviewee. Some of those who were interviewed individually had no current domestic or farming partners. Some had domestic partners who had little or no interest in the farming enterprises. Others had farming or domestic partners who were involved, but were not present for a variety of reasons, including the interviewees' apparent choice, difficulty in scheduling the interview around partners' off-farm work, partners who chose not be interviewed, and unanticipated demands for transporting children. All interviews were tape-recorded, though the information from one was limited due to tape recorder failure. The interviewer casually observed each farm upon his arrival and departure and accepted most offers for tours of the interviewees' farms.\nThe interviews consisted of nine open-ended questions that we intended to elicit the \"stories\" of the interviewees' farm start-ups and the rationales behind the important decisions they made. In contrast to more typical approaches in which the observations might have been guided, interpreted, and analyzed from an outside frame of reference -such as farm management principles -we let the interviewees tell their own stories with the goal of gaining insight into how they themselves understood the processes and challenges of their start-ups. Our questions were: (1) (9) What do you think is the most important advice that you could give to someone who wants to start a farm? The conversations elicited by these questions and associated questions for obtaining elaboration and clarification typically lasted a little longer than an hour."}, {"section_title": "Analytic Approach", "text": "Since the analytical approach used in the second phase is not typical in this field, some explanation will be helpful for interpreting the findings. Because we were investigating the decision-making processes of start-up farmers and were unwilling to presume that we already knew what these processes were, we adopted a sociological approach well-suited to learning about this (see, e.g., Glaser & Strauss, 1967; Strauss & Corbin, 1994) . Since the authors already \"knew\" much about farming and beginning farming, we adapted the approach by starting with a set of working hypotheses based on our knowledge about farming from the literature, our previous research, and our personal observations. We then shared these hypotheses with selected others, including Richard Brzozowski, Seth Kroeck, and Duncan Hilchey, all of whom provided helpful comments for additions and elaborations. We continually \"tested\" and refined each of the hypotheses on the list by systematically reviewing it after each interview to assess whether it really fit the empirical information from the interview. As the study progressed, particular hypotheses needed to be modified to be consistent with the observations and some new hypotheses were added. The modified list of hypotheses that are consistent our observations appears below in the findings section, along with notes on how these were revised in the course of the study."}, {"section_title": "Findings: Factors Relating to Continuation in Farm Start-ups", "text": "In the processes of conducting the interviews and of analyzing the data, our focus was on two broad questions framed by the perspectives of our interviewees: (1) In what specific ways were the start-up farm enterprises doing well or poorly, and (2) what were their unmet needs?\nAlthough the term \"success\" appears in the title of this paper, we use the terms \"continuation\" and \"exit\" rather than \"success\" and \"failure\" to describe the outcomes of farm start-up attempts. Our reason is that many factors are involved in whether a particular farmer continues or exits. Farm start-ups (and their continuations) are complex events that unfold in changing ecological, social, economic, and operator conditions. Some farmers may have the resources to continue chronically unprofitable farm enterprises, while other farmers with well-run and profitable enterprises may not be able to continue because of short-term cash flow insufficiency, health problems, or family issues. Some exits result from business analyses that project net income or production outcomes that the operators deem unsatisfactory. To a certain extent every farmer guides the unfolding of his or her enterprises by making choices: choices that may result in solving particular problems, making them worse, or even creating new problems. It was apparent that farmers we interviewed learned from their experiences and this led to changes in their farming and business strategies, views of farming, and visions for their farms. The outcomes of these choices often became apparent only in retrospect, though some of these outcomes might have seemed obvious to experienced farmers (who sometimes might also have been wrong in their anticipations). Moreover, the farmers who produce the best products or who are the best stewards of their soil or livestock may not survive financially, while those who survive financially may not excel in these categories.\nBelow we report our findings on each of the four categories of factors of continuation in farming: social context, personal characteristics, business characteristics, and luck. We begin each section with the rationale for the general hypothesis, then present its details based on our data, and finally discuss how it was modified during the research."}, {"section_title": "Conducive Social Context", "text": "Typical materials for farm management tend to emphasize economic and individual operator factors. Although these are very important, they tend to reflect an individualistic emphasis (see, e.g., Bellah, Madsen, Sullivan, Swidler, & Tipton, 1992) and a tendency to credit \"good things\" and \"bad things\" to individual operators (e.g., the \"just world phenomenon\" of Lerner, 1980) . However, a farm, even a sole or family proprietorship, is not just an individual activity that occurs in a vacuum. Rather it is embedded in the conditions of the society of which it is a part, and these days, a society in which agriculture and food production, while fundamental, are no longer central, especially in the Northeast. In other words, any farm is affected greatly by the governments, support businesses, communities, and social relationships that make up its social context. Social structures related to food and agriculture typically contain many contradictory elements. For example, small farms tend to be equated with the American dream, while, simultaneously, manual labor and operators of small farms tend to be denigrated (Berry, 2002) , leading to what one commentator has called \"our hidden wound\" (Chapter 3 in Logsdon, 2000) . Focus groups for another project indicated that many people seem to want the low consumer food prices that are facilitated by governmentsubsidized, large-scale, highly specialized agricultural enterprises at the same time that they want to see a working landscape of small family farms around them (Hilchey, Gillespie, Kay, & Smith, 2008) . The complex and sometimes contradictory social world both enables and constrains agricultural enterprises, shaping opportunities and challenges in ways that vary over time and across social and geographic spaces. This generates niches that might be wonderful for particular kinds of farming enterprises and prohibitive for other kinds and is the basis for the hypothesis that continuation in farming will be more likely with a conducive social context -specifically, one that includes the following attributes:\n1. Access to land, equipment, livestock, facilities, operating capital, etc., that are adequate and appropriate for the kind of farm enterprise and that are on \"reasonable\" terms given contemporary product market conditions; 2. Practically available farm input suppliers, information providers, and service providers (defined roughly as having veterinarians, agricultural chemical suppliers, consultants, etc., who are both willing to serve and located close enough to make using their services economically reasonable) and, preferably, be committed to helping a start-up farm operator;\n3. Practical availability of \"good\" markets for products (defined roughly as access to conventional mass, established specialty niche, self-created niche, or other markets on terms which allow adequate net profits, e.g., have willing buyers, low transaction costs, and high selling prices);\n4. Supportive family members and significant others who value farming and who accept the associated work hours, constraints, risks, and inconveniences, and, preferably, are willing and able to contribute labor and other resourcesincluding benefits and income that allow for risk-taking -as needed; 5. A supportive agricultural \"community\" (perhaps geographically diffuse) with shared commitments and trust that enable both reciprocity in sharing knowledge, equipment, and labor and transactions among members, including bartering; 2 6. Neighbors who support the particular kind of farm, or at least accept it;\n7. Uses of surrounding land that are compatible with the particular agricultural enterprise (e.g., in areas with considerable urban sprawl, enterprises that do not produce substantial noise or offensive odors);\n8. Taxation of farm income, sales, and property as well as permit and regulatory fees and associated costs that, taken together, are reasonable relative to the opportunities for farm income; 9. Suitable policies (i.e., laws and regulations) pertaining to farming and agricultural product marketing that manage land uses and ensure public safety without strangling farm enterprises; and 10. Access to \"adequate\" health care and other benefits, through a government program, organizational membership, or attached to a farm household's off-farm employment.\nOf these ten hypotheses, two were added as a result of the information from one or more interviews: the ones referring to supportive neighbors and compatible uses of surrounding land. Several of the eight original ones were modified in small ways, mostly by adding the illustrative examples.\nWe offer two notes on interpreting these findings. First, not every hypothesis was explicitly pertinent to every case. For example, issues with neighbors were not mentioned in all interviews, but we had no cases which suggested that opposition from neighbors might improve prospects for continuation in farming. Second, we claim that the above propositions are \"provisionally true\" for and useful for understanding the situations of the type of start-up farmers that we interviewed, that is, they are consistent with what we observed in the interview data (see, e.g., Popper, 1968 ). As we discuss in the concluding section, neither our sampling nor our data analysis approaches speak to the topic of the prevalence. The comments in this paragraph also apply to the three categories of hypotheses that follow."}, {"section_title": "Appropriate Personal Characteristics", "text": "As in any small business, the operator or operating team of a farm enterprise is central to its operation and outcomes. For smaller-scale farm enterprises, few things happen without the operator's or operating team's initiative and attention. Therefore, the match between the attributes of the operator(s) and the characteristics of the particular enterprise are critical. An enterprise like a dairy farm that requires early morning labor 365 days per year for its effective operation would not be a good fit for a person who cannot function before 11:00 a.m. Therefore, continuation in farming will be more likely if the farmer(s) has appropriate personal characteristics for the specific farm enterprise undertaken, including in general:\n1. Willingness and physical capacity to work hard and long hours;\n2. Appropriate managerial knowledge and technical skills for producing, harvesting, storing, delivering, marketing, etc., the products produced, including the ability to \"work smart,\" to multitask, and, if needed, to manage other people effectively;\n3. Flexibility and innovativeness in the face of challenges;\n4. Ability and motivation to gain needed information from a wide variety of sources and astute personal observations that enable avoiding mistakes as well learning from any mistakes made;\n5. Aptitudes for the skills needed for producing any products in a farm's portfolio;\n6. Appropriate technical knowledge and skills for producing, harvesting, storing, delivering, and marketing farm produce of acceptable quality and with good timing;\n7. Willingness and capacity to curb personal consumption in favor of current operating expenses and investment in the business;\n8. Wisdom to avoid too rapid growth, undertaking too many new things at once, and other sources of overstretching management and resources;\n9. Ability to take outside perspectives -such as those of urban customers in the case of direct marketing -in evaluating products and identifying marketing opportunities;\n10. Skill in communicating and negotiating combined with the cultural knowledge needed for initiating, being open to, and maintaining effective working relationships with important others who provide needed and timely labor, services, information, financing, equipment, materials, and markets (reciprocity and community);\n11. Strong entrepreneurial motivation to do what is needed to produce successfully and efficiently and to market effectively; and 12. Persistence and perseverance.\nTen of the above 12 hypotheses relating to personal characteristics were in the original list.\nAdded were \"wisdom to avoid too rapid growth…\" (a key problem affecting two of the former farmers) and \"skill in communicating and negotiating…\" (a distillation of the challenges described by a number of the interviewees). Many of the original 10 were elaborated with additional small details and refinements."}, {"section_title": "Suitable Business Characteristics", "text": "Farms can be configured in many different ways. Some require the full-time, year-round labor and management of their operators, while others are very part-time and seasonal. Some provide all the income for their households, others provide little or no income. Some produce high-value products in relatively small quantities, others produce lowvalue commodities in relatively large quantities. Some use new equipment, others depend mainly on used equipment, and still others rely on custom operators. Some have considerable debt, others have no debt. Therefore, a farm's business characteristics need to be internally consistent. Continuation in farming will be more likely if a farm's business characteristics are suitable, including having:\n1. Adequate resources from accumulated capital, current farm income, current nonfarm income, lenders, or other investors for cash flow; 2. A sound, rational farm vision and business strategy that may be manifested in (a) in regularly-revised business plans that incorporate realistic scenarios, include contingency plans, balance diversification and specialization, rationally set rates of expansion or contraction, and match production and marketing opportunities, (b) slow, incremental business development kept well within the means and abilities of the operators, or (c) an appropriate balance between these opposing tendencies; and 3. A good match among production scale, production technologies, and available labor for each subenterprise.\nThese are the original three hypotheses regarding business characteristics, but the whole of the original second one was its current subcategory (a). Because we had cases of farmers who lacked written business plans for their enterprises, but appeared to have considerable promise for continuing in their farm enterprises, that statement was not supported by the data. Since a business plan still seemed to be a valuable tool for many farmers, we elaborated the hypothesis to include contingencies that would be consistent with all of our empirical observations."}, {"section_title": "Good Luck", "text": "Continuation in farming will be more likely if the farmer is lucky. The rationale behind this consideration involves two interrelated aspects. First, agriculture is an integral part of two very complex systems -biophysical and socialwhich form what can be thought of as a socioecosystem (Gillespie, 2010) . These two systems affect farm enterprises in ways that often cannot be anticipated. Second, it seems unreasonable that farm operators, especially beginners, can be expected to be \"perfect\" managers who know every possible thing about their farming enterprises and who correctly anticipate and control every possible transaction with outside parties, like buyers and lenders. Moreover, events outside of an operator's control can happen singly and coincidentally, potentially to the operator's benefit and potentially to his or her detriment. Consequently we anticipate that every farmer will at times experience successes, opportunities, and problems that are not direct results of his or her decisions and perhaps even without his or her awareness. For example, if, based on incomplete information, a farmer chooses a particular variety of a crop that proves to be highly suited to his or her farm's conditions and that year's weather, he or she would be \"lucky\" and likely not even know it. Further, farm enterprises vary over time in their vulnerability to going out of business because of such other variables as debt load and labor availability. Even with the best-conceived and -executed business plan, unforeseen changes in markets can cause major disruptions to cash flow and business progress. Examples would include the 1980s Alar incident in the apple industry, a major fire in a Massachusetts slaughterhouse in 2006 that forced its closure, and the collapse of pork exports with Asian economic downturn in the late 1990s. If a farmer's livestock have a disease or breeding problem during a time of high output prices, this would seem to be less likely to threaten the continuation of his or her enterprise than if the same thing happened at a time when output prices were very low. Similarly, a farmer who has significant debt will likely be more vulnerable than would be a farmer with little or no debt.\nIn summary, continuation farming involves an element of luck. Although each of the list of supported hypotheses listed below could be rewritten in a positive sense, e.g., \"good weather,\" \"good luck\" seems unlikely to be associated with farm exits. Therefore, we focus here on common types of unfortunate things that happen on farms that can involve luck and that new farmers and their advisors need to consider. 10. Operator, family member, or employee being unavailable due to health problems from accident or illness or due to lack of childcare; and 11. Family or partnership dissension or dissolution.\nThe above list was significantly modified from an original list of nine working hypotheses based on the data from the interviews. The second hypothesis, originally \"low market prices,\" was modified with the realization that \"high prices for inputs\" (or some combination of these two) experienced by some interviewees had essentially the same impact on net income. The third hypothesis, \"loss of markets…,\" was elaborated from the original \"loss of key markets\" based on the now included reasons that surfaced in the interviews. The fourth hypothesis, \"serious production problems…,\" was elaborated from the original \"serious disease or pest outbreaks in animals or crops\" when cases fit the general theme, but were not consistent with the original wording. The fifth hypothesis, \"incomplete, wrong, poor, or miscommunicated information….,\" was changed to include \"miscommunicated\" and to specify some specific types of sources uncovered. We had not anticipated the disturbing stories of unfortunate and uninformed advice from advisors, consultants, and lenders that are described below in the recommendations section. The key point relating to luck is that new farmers may not be able to immediately discern the quality of advice or have a real choice of advisors. The sixth and ninth hypotheses, \"loss of a key support business or person\" and \"effective labor shortages…,\" were added based on the interview data. The tenth hypothesis, \"operator, family member, or employee being unavailable…,\" was elaborated from the original \"bad health from accident or illness.\" Both the ninth and tenth hypotheses are similar in that they pertain to having needed labor available but they distinguish between different reasons for the problem. The eleventh hypothesis was elaborated from the original version by the addition of \"partnership\" in the sense of business partners as well as household partners. Both can have very adverse impacts on farm enterprises.\nA major issue within the research team and among the reviewers of the manuscript was the extent to which \"good\" business management should be theorized to eliminate luck as a significant factor in farming outcomes. One interviewee stated the business management position clearly as \"You make your own luck.\" Our position is that this statement is true, though the matter is much more complex and not fully true as we understood our interviewee to mean eliminating luck as a factor. Luck is related to management in that every management decision simultaneously frames future possibilities for both good luck and bad luck. For example, if a start-up farmer engages an advisor, that opens up the possibilities that this advisor will be a good match or a poor match for that farmer's particular aptitudes, scale, type of enterprise, farm ecological niche, etc. Such a decision would lead to a different set of potential events than would flow from deciding not to engage an advisor. Obviously, a prudent manager would seek recommendations from multiple sources as well as gather information about the advisor, but information is always incomplete and the future is never determined by past events. Another illustrative example would be deciding to take advantage of market opportunities by expanding an enterprise to a size that required hiring nonfamily labor. Even if such an operator developed expertise in managing employees and in all the regulatory, insurance, and tax matters related to having employees, such an expansion still exposes him or her to the risks of hiring phenomenally wonderful employees, on one hand, and hiring chronically underperforming or unreliable ones, on the other. This would be a significantly different set of possibilities than were present prior to expansion.\nNone of the above should be construed to imply in any way that we are downplaying the importance of engaging in sound business planning and management, gathering appropriate information, acquiring needed technical skills and knowledge, observing and responding to field and market conditions, and managing other enterprise matters astutely. A reasonable management strategy would include taking actions to prevent the most probable risk events or, if preventing such events was unsuccessful, to be prepared to mitigate their impacts. These are all important for positioning farm operators to take advantage of opportunities and to reduce their vulnerability to anticipated adverse events and conditions. Neither should we be understood to be downplaying the risks that arise from management shortcomings. Clearly the purpose of a business plan is to reduce the risk of problems through explicitly specifying and evaluating production projections, production costs, market opportunities, assumptions, risks, margins of error, etc., and to adjust enterprises to increase their likelihood of being profitable (including abandoning enterprises when prospects for achieving profits or other goals are poor). As such, business plans are arguably good things for all farmers and having a wellthought-out business plan can be expected to reduce a farmer's chances of a farm exit. At the same time, business plans do not guarantee success. These are negotiated among farmers, lenders, advisors, and others, with results that are based on current knowledge, economic theory, and shared expectations about market prospects. As many farmers in the Midwest in the early 1980s, hog producers in the late 1990s, and dairy farmers as recently as 2009 have learned, business plans prepared in times of optimism can be dangerous to business survival, because the projections and assumptions embodied in these plans are not always realized. Moreover, advisors and lenders may be committed to particular ideals of enterprise types, leading them, for example, to push expansions as conditions of getting loans, with the net result being increased vulnerability if market prices fall or if needed labor is not available, or, for an example seen in this study, to advise a start-up dairy farm household to enter into a specialized dairy farm rental contract that left them constrained to buying poor-quality feed crops produced by their landlord."}, {"section_title": "Recommendations", "text": "Given the complexity described above, it should not be surprising that we do not see any simple recipe, policy, or program for serving the needs of every start-up farmer. Nor can we see a simple recipe for sorting out which of these farms \"should\" survive (e.g., because they have the best chance of success) and, therefore, get special attention and resources. In their descriptions of their goals, situations, and the choices they made, all the start-up farmers we interviewed were quite rational and strategic. Although we saw some indications in the survey data and in the interviews that a few respondents had incorporated scenarios in their business plans that were in retrospect overly optimistic, all of the interviewees had thought through what they wanted and how to achieve it. Based on what we saw in the whole body of interviews, it is not at all clear that we would have predicted ahead of time the three cases who were out of farming. In fact, the set of farm operators who appeared to be in the most difficult financial circumstances at the time of their interview -and for whom things seemed only to get worse in the next year -appear to have reorganized and were still in farming in 2009.\nIn recent years many programs have served beginning farmers and many of these programs help these farmers greatly. However, not all beginning farmers participate in such programs and each program has its particular foci. We developed the recommendations that follow based on examining the interview data and asking what needs were and were not being met for these start-up farmers. Our purpose is to suggest what might increase the success of farm start-ups based on what we learned. We present these in three categories: advising and mentoring, conceiving of farms as parts of a larger food system, and playing to strengths. We leave our readers to contemplate the possible benefits of adopting these recommendations against their likely costs in particular social and ecological contexts."}, {"section_title": "Advising and Mentoring", "text": "This recommendation is derived from our interviewees' positive and negative stories of their experiences with mentors and advisors. It is directed particularly at local officials in their deliberations of policies that affect farming in their communities and at leaders of organizations that work with beginning farmers.\nQuite a few of the interviewees spoke gratefully of the contributions of one or more advisers or mentors. We discerned several characteristics of these valued advisers and mentors: (1) These persons understood important things about the interviewees' start-up farms that the interviewees themselves did not understand, i.e., they had relevant information, provided interpretations of things that were happening, foresaw problems, or provided needed solutions to problems. (2) They communicated well with the start-up farmers, i.e., they could explain things in ways that were understandable or did not make the new farmers feel demeaned. (3) They went out of their way to be helpful, e.g., some invested whatever time or energy was needed, including working on nights and weekends, to solve a problem at hand. For example, one financial adviser carefully went over a loan officer's adverse assessment of a loan application, worked overnight to find a persuasive way to make a positive cash flow projection, and then went with the applicants as they met with their lender's loan officer and convinced him to approve their loan application.\nIn addition, some of the interviewees related instances of emerging problems on their farms that they unfortunately perceived only after such problems had become very serious and some of these interviewees observed that a mentor or advisor might have identified such problems well before these became apparent to them. Perhaps having such mentors or advisors would have enabled these farmers to avoid the adverse consequences due to their own lack of experience or foresight.\nHowever, having advisors should not be seen as a panacea. Interviewees also told stories of bad advice from service providers (e.g., nutritionists or loan officers). These providers were presumably people who should have known what they were doing based on their professional positions and credentials; in some cases, the start-up farmers were not able to discern immediately that the cause of a problem was really the provider's work. Startup farmers interested in alternative types of enterprises, e.g., organic vegetable production or dairy farming based in management-intensive rotational grazing, may not find good advice from typical service providers and may need to turn to the local knowledge of other farmers involved in such activities (e.g., Hassanein & Kloppenburg, 1995) . The potential for problems from bad advice would likely to be much greater in situations in which the person giving the advice had power over the start-up farmer, as in the case of a loan officer.\nIn such situations having other mentors might help the new farmers assess the advice being given and formulate workable responses.\nEvery farm, start-up or not, is going to have some problems with weather, diseases, and the like. We do not think that it entirely reasonable to expect that every start-up farmer will be on top of every emerging problem or will know immediately what action will be effective. Because of this, we have been struck by what seems to us to be the importance of start-up farmers having advisers and mentors who have the key technical knowledge needed for their particular farms and who are sympathetic to the particular farmer's objectives and situation (e.g., an adviser with expertise in conventional farming and who believes that organic certification is primarily a deceptive marketing tool may be a poor match for a start-up farmer committed to ecological farming practices). Perhaps such advisors should refer the start-up farmer to advisors who would be a better fit.\nMoreover, it seems to us that teams of mentors or advisers could be very helpful to many start-up farmers. Experienced farmers would be obvious candidates for leading such teams, but teams would ideally have others with a wide range of technical expertise needed for the particular enterprise, e.g., in financing, production, postharvest management, marketing, regulations, and employee management. Despite the potential benefits of having advising teams, we offer two caveats. The first is that we acknowledge that having teams of mentors and advisers would likely take significant resources, so that assessments of the social benefits of having new farmers would affect assessments of whether such investments were justified. The social benefits, e.g., improved local food security, and environmental benefits, e.g., providing green space and preventing sprawl, could be considerable, but difficult to measure. Similarly, studies showing the impacts of farms on their local economies (e.g., Dobbs & Cole, 1992) suggest that purely economic benefits could also be significant, but also not easily measured. The second caveat is whether an advisory team would be appropriate for a particular farmer's situation. Having a team of people descend to bestow a diverse range of advice could be overwhelming. Also, the time required for getting advice and managing the relationships with advisors could both be significant and distract a farmer from other things that he or she needed to do. Finally, since the appropriateness and quality of advisors cannot be taken for granted, having a team might actually increase the risk of exit due to \"bad\" advice. In some cases, one experienced farmer mentor with an appropriate background, orientation, and commitment to the start-up might well be all that was needed."}, {"section_title": "Conceiving of Farms as Parts of a Larger Food System", "text": "This recommendation is intended for policymakers and decision-makers in organizations that support beginning farmers, and beginning farmers themselves. Considerations about investments in advising and mentoring should be coupled with the idea that any farm needs to be understood as a unit that functions in a particular role (or roles) within the food system -analogous to an organism in an ecosystem. Not surprisingly, many of interviewees seemed to focus largely on their own farms and gave little consideration to how their particular farms fit into the emerging local or global food system. Many considered their role in the local food-system context as a key focus of their farm goals, but not all seemed to understand the national and global food systems. At the same time, many interviewees with successful marketing niches seemed to have at least an implicit understanding of such matters. Though some advisors of our interviewees gave attention to this, we wonder the extent to which those who advise beginning farmers typically focus mainly on the farm -its production and marketing. Based on our observations, we urge advisers and mentors to look beyond the boundaries of farms in their work with prospective and beginning farmers. Where does a farm or potential farm fit into a particular product chain or chains? What are the short-and long-term options, risks, and opportunities in that product chain? What are the available input suppliers in the local food and agriculture system? On the particular farm, how do the resources (e.g., soils, built infrastructure) and the operator's skills and preferences fit with that system? What are the existing markets or potential markets that could be created for particular products that are or would be produced? Rather than relying solely on business planning, we should be looking more holistically at how farm operators may find or create viable, local niches in the changing food system."}, {"section_title": "Focus on Playing to Strengths", "text": "This recommendation is aimed especially at those who are either planning to start farming or are in the process of a farm start-up, and to their advisors. On one hand, this recommendation may be seen as stating the obvious; analyzing one's strengths and limits and those of one's potential or current farm situation is a central tenet of business planning. Given this, a key role for advisers and mentors would be helping prospective and actual start-up farmers perform this important analysis. On the other hand, the accounts given by some of our interviewees suggested that some advisors worked from narrowly scripted conceptions that did not account for the great diversity of beginning farmers and the social and ecological contexts of their enterprises. If a key step in the long-term success of a start-up farm is its operator or operators achieving understandings of their \"strong suites\" -in aptitudes, resources, market opportunities, etc. -and what aspects of their enterprises should be either allocated to other parties or otherwise adjusted, a variety of approaches to this step should be investigated, including Holistic Management, which provides a framework for incorporating the diverse and complex aspects and goals typical of a start-up farm and provides an approach to decision-making for achieving diverse goals (Henderson & North, 2004; Savory & Butterfield, 1999) . No start-up farmer will be perfect in all areas, e.g., overall management, production practices, bookkeeping and taxes, marketing, and dealing with employees. For example, some farmers have exceptional abilities for maintaining and repairing equipment and do very well with older and inexpensive used equipment. However, other farmers lack that ability and when they try to use such equipment the result may be unsatisfactory. The latter kind of farmer would likely be better served by investing in newer equipment, finding partners or employees who are strong in this area, or hiring custom operators. Often start-up farmers recognize their limits, but we doubt that anyone would be surprised that inexperienced farmers sometimes may not see that they need help in critical areas. Marketing may be a key example of this. Of course, once such a need is recognized, there is the difficulty of locating, engaging, and paying for whatever equipment and services are needed. Such needs may be best addressed at a level beyond that of the farm, especially on start-up farms with very limited resources. Given this, an integrated approach to assisting farm start-ups should be considered by both beginning farmers and their proponents."}, {"section_title": "Conclusions", "text": "The situations of the start-up farm households that we interviewed varied widely and so did their needs. Clearly, socio-ecosystem context as well as operator skill and planning affect start-up farmers' experiences. This affects their prospects for continuing in farming and how they subsequently cope with the challenges they face. New farmers also differ greatly in the resources they can muster to surmount the particular challenges they face in starting-up. Obviously, not every beginning farm operator or operating team will be situated in social contexts with all the attributes described above. Nor will they possess all of the personal and business attributes listed. Moreover, not every attribute will be equally important to all kinds of farming enterprises. Clearly, being inconsistent with one or even many of the items does not mean that a farmer will necessarily exit. Moreover, moderation and balance are crucial in dealing with attributes that can be incompatible in the short run, e.g., persistence and perseverance in the face of challenges can inhibit flexibility and innovativeness. Over the long run both are needed. Similarly, not every enterprise will experience or be subject to all possible unfortunate circumstances or fortunate circumstances.\nFor a study like this one, the logic of the potential applicability of the findings beyond the included cases differs from that of the more typical study based on the logic of inference from statistical theory. Barney Glaser and Anselm Strauss (1965) described a useful framework for thinking about \"conveying and judging credibility\" of research results of this type. Besides the challenges to researchers in their responsibilities for \"conveying\" to readers both the features of the \"theory\" being presented and for indicating how a familiar social setting is illuminated differently in the light of this theory, readers are always responsible for \"judging [the] credibility\" of the work and its potential utility to them. Glaser and Strauss suggest several considerations for such judgments that include (1) whether the results provide a \"meaningful picture\" for interpreting or acting in the setting; (2) an assessment of how the researcher(s) developed the conclusions (which we detailed above); and (3) making corrections and adjustments for applying the \"theory\" to particular uses or situations.\nRegarding the last consideration, this is a study of start-up farmers in the social and ecological contexts of the Northeastern U.S. At the same time, contextual attributes, such as values and belief systems, trends in concentration in agriculture and the rest of the food system, prevalence of \"cheap\" energy, urban dominance, etc., found in the region also tend to be present in other areas of the country. In this light, the findings of this research are offered as a source of conceptual understanding for development practitioners and beginning farmers to consider and evaluate.\nWhile arguably those interviewed were relatively typical of the highly varied respondents to the survey in the first phase of the study, they are not necessarily typical of all farm start-ups. In addition, though we lack data on the population of farm start-ups, two categories of beginning farmers seem likely to be underrepresented in our study: those taking over ongoing family farms, and those less apt to seek assistance or information from service providers and information sources like the farm media, libraries, the internet, and farm-related meetings. We surmise that start-up farmers in these two categories were underrepresented because they may be less likely both to attend meetings aimed at prospective and beginning farmers and to actively seek information in the venues we used to contact them. Moreover, we recognize that some people who attempt farm start-ups may be poorly suited to farming or may be poorly prepared for a start-up and, therefore, these findings may not apply well to such cases.\nclarifying our descriptions and explanations of the methods and results."}]