[{"section_title": "Abstract", "text": "Abstract. Alzheimer's disease (AD) is characterized by complex and largely unknown progression dynamics affecting the brain's morphology. Although the disease evolution spans decades, to date we cannot rely on long-term data to model the pathological progression, since most of the available measures are on a short-term scale. It is therefore difficult to understand and quantify the temporal progression patterns affecting the brain regions across the AD evolution. In this work, we tackle this problem by presenting a generative model based on probabilistic matrix factorization across temporal and spatial sources. The proposed method addresses the problem of disease progression modelling by introducing clinically-inspired statistical priors. To promote smoothness in time and model plausible pathological evolutions, the temporal sources are defined as monotonic and independent Gaussian Processes. We also estimate an individual time-shift parameter for each patient to automatically position him/her along the sources time-axis. To encode the spatial continuity of the brain sub-structures, the spatial sources are modeled as Gaussian random fields. We test our algorithm on grey matter maps extracted from brain structural images. The experiments highlight differential temporal progression patterns mapping brain regions key to the AD pathology, and reveal a disease-specific time scale associated with the decline of volumetric biomarkers across clinical stages."}, {"section_title": "Introduction", "text": "Neurodegenerative disorders such as Alzheimer's disease (AD) are characterized by morphological and molecular changes of the brain, and ultimately lead to cognitive and behavioral decline [8] . To date there is no clear understanding of the dynamics regulating the disease progression. Consequently several attempts have been made to model the disease evolution in a data-driven way, using sets of biomarkers extracted from different imaging acquisition techniques, such as Magnetic Resonance Imaging (MRI) [13] . However available data are mostly represented by cross-sectional measures or time-series acquired on a short-term time span, while the ultimate goal is to unveil the \"long-term\" disease evolution spreading over decades. Therefore there is a critical need to define the AD evolution in a data-driven manner with respect to an absolute time scale associated to the natural history of the pathology.\nTo this end, in [9] the authors introduce a disease progression score for each patient in order to identify a data-driven disease scale. This score is based on a set of biomarkers and was shown to correlate with the decline of brain cognitive abilities. A similar approach was proposed by [13] and [6] with scalar biomarkers. In [3] , a disease progression score was estimated using higher-dimensional biomarkers from molecular imaging. However these methods don't provide information about the brain structures involved in AD, and how the disease affects them along time. To overcome these limitations, [14] proposes a spatio-temporal model of disease progression explicitly accounting for different temporal dynamics across the brain. This is done by decomposing cortical thickness measurements as a mixture of spatio-temporal processes, by associating each vertex to a temporal progression modeled by a sigmoid function. The approach also estimates a disease progression score for each subject as a linear transformation of time. However since the proposed formulation does not account for spatial correlation between vertices, it may be potentially sensitive to spatial variation and noise, thus leading to poor interpretability.\nThe challenge of spatio-temporal modelling in brain images is a classical problem widely addressed via Independent Component Analysis (ICA [7] ), especially on functional MRI (fMRI) data [4] . ICA aims at decomposing the data via matrix factorization, looking for a reduced number of spatio-temporal latent sources. Although successful in fMRI analysis, ICA cannot find straightforward applications to the modelling of AD progression. First, ICA retrieves maximally independent latent sources best explaining the data. However, although brain regions can exhibit different atrophy rates, this doesn't necessarily imply statistical independence between them. Second, differently from fMRI data, the absolute time axis of AD spatio-temporal observations is unknown. Thus estimating the pathology timing is a key step in order to model the disease progression, and cannot be performed with standard dimensionality reduction methods such as ICA. Finally, fMRI time series are defined over hundreds of time points, while we work essentially in a cross-sectional setting with one or a few images per-subject.\nIn this work we present a novel spatio-temporal generative model of disease progression aimed at quantifying the independent dynamics of changes in the brain.\nWe model the observed data through matrix factorization across temporal and spatial sources, with a plausibility constraint introduced by clinically-inspired statistical priors. To promote smoothness in time and model steady evolution from normal to pathological stages, the temporal sources are defined as monotonic independent Gaussian Processes (GPs). We also estimate an individual time-shift parameter for each patient to automatically position him along the sources time-axis. To encode the spatial continuity of the brain sub-structures, the spatial sources are modeled as Gaussian random fields. The framework is efficiently optimized through stochastic variational inference. In the next sections we detail the method formulation and show its application on synthetic and real data composed by a large dataset of MRIs from the Alzheimer's Disease Neuroimaging Initiative (ADNI). Further information can be found in the Appendix."}, {"section_title": "Method", "text": "We assume that the spatio-temporal data\nis stored in a matrix with dimensions P × F , where P is the number of patients, F the number of image features, and Y i (x, t i ) is the image of an individual i observed at position x and at time t i . We postulate a generative model in order to decompose the data in N s spatio-temporal sources such that :\n(1)\nS is a P × N s matrix where each column represents a temporal trajectory, t p the individual time-shift parameter, and θ the set of parameters related to the temporal sources. A is a N s ×F matrix where each row represents a spatial map, and ψ is a set of spatial parameters. E is a N (0, σ 2 I) Gaussian noise. According to the generative model the likelihood is :\nFor each latent source n, the row A n of A is provided with a N (0, I) prior, while each column S n of S is a GP modeled as in [5] . This setting leverages on kernel approximation through sampling of basis functions in the spectral domain [15] . For specific choices of the covariance, such as the Radial Basis Function (RBF) used in our work, the GPs can be approximated as a Bayesian neural network with form : S n (t) = φ(Ω n t)W n . According to [5] , in this formulation Ω n is the projection in the spectral domain provided with a N (0, 1 ln I) prior, φ is defined as the (cos, sin) function in order to obtain a RBF kernel for the covariance matrix, and the regression parameter W n is provided with a N (0, I) prior. The GPs are estimated using variational inference by introducing approximated distributions of\nTo account for the steady increase of the sources from normal to pathological stages we introduce a monotonicity prior over the GPs. To do so, we constrain the space of the temporal sources to the set C = {S(t) | S (t) ≤ 0 ∀t}, following [12] . This leads to a second likelihood term constraining the dynamics of the temporal sources :\nWe jointly optimize (2) according to priors and constraints, by maximizing the data evidence :\nBy observing that S is completely identified by S, formula (4) can be written as :\nSince this integral is intractable, we tackle the optimization of (5) via stochastic variational inference. Following [10] and [5] we introduce approximations q 1 (A), q 2 (Ω) and q 3 (W ) to derive the lower bound :\nWhere D refers to the Kullback-Leibler divergence.\nWe specify the approximated distribution of the spatial activation maps q 1 such that\nTo introduce spatial correlations and model a smooth signal decay in the maps across voxels with coordinates (u i , u j ), we choose\nMoreover, we can use the separability properties of the exponential to decompose the covariance between two locations u i = (x i , y i , z i ) and u j = (x j , y j , z j ) :\n).\nThanks to this property Σ can be decomposed into the Kronecker product of 1D processes, Σ = Σ x ⊗ Σ y ⊗ Σ z , as shown in [11] , allowing us to deal with large-size matrices.\nThe approximated distributions q 2 (Ω) and q 3 (W ) are factorized across GPs such that q 2 (Ω) = Since we only work with Gaussian distributions we can obtain a closed-form for the Kullback-Leibler terms in (6) . The expectations are approximated by using the reparameterization trick as presented in [10] , and the lower bound is efficiently optimized through backpropagation. We chose to alternate the optimization between the spatio-temporal parameters and the time-shift. We set λ to the minimum value that gives monotonic sources, while σ was arbitrarily determined from the data. A detailed derivation of the model and lower-bound can be found in the Appendix."}, {"section_title": "Results", "text": ""}, {"section_title": "Benchmark on Synthetic Data", "text": "We tested the algorithm on synthetic data to assess its ability to separate spatiotemporal sources from mixed data, and to provide a model selection via the variational lower bound. We generated three monotonically increasing functions S i (t) such that S i (t) = 1/(1 + exp(−t + α i )), and three synthetic Gausian activation maps A 1 , A 2 , A 3 with a 30 × 30 resolution, to mimick grey matter brain areas (Figures 1a and 1b) . The data was generated as Y p,j = S(t p )A + E j over 40 time points t p , where t p is uniformly distributed in [0,1]. We sampled 50 images at instants t p and applied our method. To simulate a pure cross-sectional setting the time associated to each input image was set to zero. Figures 1c and  1d show the estimated spatio-temporal processes when fitting the model with three latent sources. In Figure 2 , we see that the individual time-shift parameter estimated for each subject correlates with the original time used to generate the data. This means that the algorithm correctly positions each subject on the temporal trajectories.\nTo test the model selection, we generated the data as described above using respectively one, two, or three sources over ten folds. For each fold we ran the algorithm looking for one to four sources. Figure 3 shows mean and standard deviation of the lower bound. We observe that when the number of sources is under-estimated the lower bound is higher. When the number of sources is overestimated, although the lower bound for model selection is more uncertain, by looking at the extracted spatial maps we observe that the additional sources are mainly set to zero or have low weights (see the map of Figure 3 ). These experimental results indicate that the optimal number of sources should be selected by inspection of both the lower bound and the extracted spatial sources. "}, {"section_title": "Comparison with ICA", "text": "We performed a comparison of our algorithm with ICA on an example similar to the one of section 3.1. However, since standard ICA can't be applied when the time associated to each image is unknown, the data was generated in a simplified setting. To do so we assigned the ground truth parameter t p beforehand. The goal was to compare the separation performances of both our algorithm and ICA, on data generated with three latent spatio-temporal processes. In Figure 4 we observe that the sources estimated by ICA are more noisy and uncertain than the ones estimated by our method, highlighting the importance of the priors and constraints introduced in our model. In this section we present an application of the algorithm on real data, using grey matter maps extracted from structural MRI. We selected a cohort of 555 subjects from ADNI composed by 94 healthy controls, 343 MCI, and 118 AD patients. We processed the baseline MRI of each subject to obtain high-dimensional grey matter density maps in a standard space [1] . We extracted the 90 × 100 middle coronal slice for each patient, to obtain a data matrix Y with dimensions 555 × 9000, and applied our algorithm looking for three spatio-temporal sources (see Figure 5) . The middle spatial map shows a strong activation of the hippocampus, while the left and right plots show an activation on the temporal lobes, with two similar temporal behaviours, characterized by a less pronounced grey matter loss compared to the hippocampus. More specifically, we observe that the hippocampal trajectory has a strong acceleration in opposition to the other brain areas. This pattern quantified by our model in a pure data-driven manner is compatible with empirical evidence from clinical studies [2] . In Figure  6 we observe the estimated time of each patient against standard volumetric and clinical biomarkers. We see a strong correlation between brain volumetric measures and the estimated time, as well as a non-linear relation in the evolution of ADAS11. The latter result indicates an acceleration of clinical symptoms along the estimated time course. "}, {"section_title": "Conclusion", "text": "We presented a method for analyzing spatio-temporal data, which provides both independent spatio-temporal processes at stake in AD, and a disease progression scale. Applied on grey matter maps, the model highlights different brain regions affected by the disease, such as the hippocampus and the temporal lobes, along with their differential temporal trajectory. We also show a strong correlation between the estimated disease progression scale and different clinical and volumetric biomarkers. We are currently extending the approach to scale to 3D volumetric images by parallelization on multiple GPUs. The lower bound properties will be also further investigated to better assess its reliability, in order to improve the model comparison. Moreover the method will be extended beyond the cross-sectional application of section 3.3, to account for time-series of brain images, as well as for multimodal imaging biomarkers. Finally we will investigate the use of the approach for prognosis purposes, to provide a data-driven assessment of disease severity in testing patients.\n-Ω n,j = r n,j + p n,j * ζ n,j , -W n,j = m n,j + s n,j * n,j , -A n = µ n + Σ \nE Ω∼q2,W ∼q3 [log(p(C|Ω, W , λ))] = E ,ζ [log(p(C|m, s, r, p, λ))].\nWhere ζ n , n and κ follow a N (0, I) distribution."}]