[{"section_title": "", "text": "genetically associated with heritable cognitive and mental health traits (1-5), and it is an 3 active research area to understand the shared genetic influences in these traits (6). 4\nIndividual variations of human brain volume are usually quantified by magnetic 5 resonance imaging (MRI). In region of interest (ROI)-based analysis, whole brain MRIs 6 are processed and annotated onto many per-defined ROIs, and then regional volumetric 7 phenotypes are generated to measure the structure of brain ROIs. Family and 8 population-based studies have both shown that these volumetric phenotypes are highly 9 heritable (7-9), and common single-nucleotide polymorphism (SNP) markers collected 10 across the genome can account for a large proportion of phenotypic variation (10). A 11 highly polygenic or omnigenic (11, 12) genetic architecture has been observed, which 12\nindicates that a large number of genetic variants influence regional brain volumes and 13 their genetic contributions are widespread across the whole genome. 14 15 Several genome-wide association studies (GWAS) (3, 7, 8, (13) (14) (15) (16) (17) (18) have been conducted 16 to identify genetic risk variants for brain volumetric phenotypes. However, except for 17 the whole brain volume and volumes of few specific ROIs (e.g., hippocampus in 18 subcortical area (3, 8, 19) ), GWAS of most brain volumetric phenotypes were 19 insufficiently powered, for which the largest sample size of discovery GWAS was less 20 than 10,000 in (7). Such GWAS sample size is much smaller than those of recent GWAS 21 of other heritable brain-related traits, such as cognitive function (20), neuroticism (21), 22 and intelligence (22) , where sample sizes ranged from 269,867 to 449,484. Given the 23 polygenic nature of brain volumes, most of the genetic risk variants may remain 24 undetected, and GWAS with larger sample size can uncover more associated variants 25 and enrich the pleiotropy and genetic co-architecture with other traits. Recently, the UK 26 Biobank (UKB, (23)) study team has collected and released MRI data for more than 27 20,000 participants. In addition, publicly available imaging genetic datasets also emerge 28 from several other independent studies, including Philadelphia Neurodevelopmental 29\nCohort (PNC, (24) ), Alzheimer's Disease Neuroimaging Initiative (ADNI, (25)), Pediatric 30\nImaging, Neurocognition, and Genetics (PING, (26) ), and the Human Connectome 31 consequences of the significant SNPs. We calculated the pairwise genetic correlation 23 between ROI volumes and 50 brain-related complex traits by the LD score regression 24 (LDSC, (32) ). To confirm the robustness of UKB GWAS findings, we jointly analyzed the 25 UKB GWAS results with those from PNC, ADNI, PING and HCP. We developed 26 genome-wide polygenic risk scores (PRS) to assess the predictive ability of the UKB 27 GWAS results on the other four datasets. GWAS summary statistics of the UKB sample 28 and meta-analysis for the five studies have been made available to public at 29 Table 2) . TBV had the largest number of 21 significant associations, which was 3,408 at 4.9*10 -10 significance level. In addition to 22 TBV, left/right hippocampus, left/right putamen, and cerebellar vermal lobules VIII-X 23 had more than 500 significant associations. In the rest of this paper, we refer 4.9*10 -10 24 as the significance threshold for SNP-level associations unless otherwise stated. 25 26 287 independent significant SNPs had 392 significant associations with 54 ROIs 27 (Supplementary Table 3 ). Independent significant SNPs were defined as significant SNPs 28 that were independent of other significant SNPs by FUMA (Online Methods, (31)). The 29 number of associations for each ROI is displayed in Figure 1 and Supplementary Table 4 . 30 Left/right hippocampus, cerebellar vermal lobules VIII-X, left/right putamen, and 31 cerebellar vermal lobules I-V had at least 19 independent significant SNPs. Other ROIs 32 6 that had at least 10 independent significant SNPs included left/right precentral, brain 1 stem, X4th ventricle, left/right lateral ventricle, left/right cerebellum white matter, and 2 TBV. The number of independent significant associations on each chromosome is shown 3 in Supplementary Table 5 , and clearly chromosome 12 had the largest number of 4 SNP-level associations with ROI volumes (Supplementary Fig. 6 ). 5"}, {"section_title": "Significant genetic controls widely spread across most ROIs of the whole brain (mean 11", "text": "h"}, {"section_title": "6", "text": "The 392 independent significant SNP-level associations can be further characterized 7 (Online Methods) as 134 significant associations between genetic risk loci and ROI 8 volumes (Table 1, Supplementary Table 6 ). Brain stem, cerebellar vermal lobules VIII-X, 9 left/right lateral ventricle, TBV and WM had at least five genetic risk loci 10 (Supplementary Table 7 (Supplementary Table 12 ). We also compared our results with those 1 reported in (7). Elliott, Sharp (7) performed GWAS of 3,144 imaging phenotypes 2 (including brain volume phenotypes processed by FreeSurfer (38)) using the UKB phase 3 1 data (n=8,428). When both being corrected for the number of performed GWAS, 26 of 4 the 78 unique SNPs (covered 66 of the 368 significant associations) reported in (7) were 5 within LD of our independent significant SNPs (Supplementary Table 13 Table 17 ). These results showed that genes with higher transcription levels on these 21 brain tissues also had stronger associations with the corresponding brain ROI volumes. 22"}, {"section_title": "23", "text": ""}, {"section_title": "Joint analysis with four independent datasets 24", "text": "To validate the UKB GWAS results, we repeated GWAS of 101 ROI volumes separately on 25 data obtained from four other independent studies: PNC (n=537), HCP (n=334), PING 26 (n=461), and ADNI (n=860). Due to the small sample size of these four datasets, the 27 probability of replicating significant findings in the UKB was low. Instead, we checked 28 whether the SNP effect signs were concordant in the five studies and whether the 29 p-value of top UKB SNPs decreased after meta-analysis (Online Methods). Smaller 30 p-values after meta-analysis indicates similar SNP effects in independent samples (52, 31 53) . 32\nThe joint analysis was carried out on 3,841,911 SNPs which were present in all five sets 2 of GWAS results. For the 5,940 significant associations (at 4.9*10 -10 significance level), 3 64.6% (3,839) associations had the same effect signs across the five studies, and 97.5% 4 (5,791) associations had the same effect signs in at least four studies (including UKB). 5 94.0% (1,880) of the top 2,000 significant associations had smaller p-value after 6 meta-analysis, and 92.3% (5,484) of all the 5,940 associations were enhanced. We then 7 performed meta-analysis on all the 8,944,375 UKB GWAS SNPs (SNPs were allowed to 8 be missing in the four independent datasets). There were more significant associations 9 after meta-analysis: 25,083 significant associations at 5*10 -8 significance level and 10 14,004 at 4.9*10 -10 significance level (Supplementary Table 18 , Supplementary Fig. 9 ). 11 12"}, {"section_title": "Genetic correction with other traits 13", "text": "The meta-analysis GWAS results were used to estimate the genetic correlation ( neuroticism (gc=-0.14, p-value=2.20*10 -4 ), and worry (gc=-0.14, p-value=2.94*10 -4 ). 12 13"}, {"section_title": "Predictive ability of the UKB GWAS results 14", "text": "We examined the out-of-sample prediction power of the UKB GWAS summary statistics 15 using polygenic risk scores prediction (55). We focused the analysis on total brain 16 volume. We first used a ten-fold cross-validation design to examine the prediction 17 power within the UKB sample (Online Methods). Five polygenic profiles were created 18 with p-value thresholds 1, 0.5, 0.05, 5*10 -4 and 5*10 -8 , respectively, and we examined 19 the incremental R-squared (Online Methods). The PRS can explain 1.51% of the variance 20 in total brain volume (p-value=4.42*10 -110 ) (Supplementary Table 23 ). We then used the 21 GWAS summary statistics of 19,629 UKB individuals to construct polygenic profiles on 22 subjects in PNC, HCP, PING, and ADNI. The UKB-derived PRS were all significantly 23 associated with the phenotype in all the four independent datasets, and can account for 24 1.38%-4.36% phenotypic variation (p-value range=[2.97*10 -22 , 1.44*10 -6 ]). The largest 25 R-squared 4.36% was in PNC dataset with threshold 1 and 224,657 SNP predictors. 26 27 DISCUSSION 28"}, {"section_title": "29", "text": "In this study, we presented GWAS of 101 ROI volumes using data of 19,629 UKB 30 individuals. Our novel contributions include 1) identification of many newly associated 31 genetic variants at SNP, locus, and gene levels; 2) revealing the genetic co-architecture 32 11 of brain volume phenotypes and other brain-related complex traits; 3) validation of the 1 UKB results in independent studies; and 4) assessment of the predictive power of UKB 2 GWAS results. Significant (p-value<4.9*10 -10 ) associations were found for 54 of the 101 3\nROIs. With larger sample size, the present study replicated many known genetic variants 4 but also prioritized new ones. Compared to (7), our GWAS not only discovered more 5 genetic variants, but also enriched the degree of (statistical) pleiotropy (56) of the 6 associated genes and characterized the shared genetic influences with cognitive and 7 mental health traits. 8 9 However, the current GWAS sample size of ROI volumes (and many other brain imaging 10 phenotypes) is still far from being sufficient. The highly polygenic genetic architecture of 11 ROI volumes requires a larger number of subjects to identify many weak causal SNPs. In 12 the era of sharing GWAS summary statistics, well powered GWAS is essential for ROI 13 volumes to be linked to the genetic co-architecture atlas with other complex traits. For 14 example, a recent study of Watanabe, Stringer (56) to discover the global overview of 15 genetic co-architecture of 2,965 traits only focused on GWAS with sample size larger 16 than 50,000, with the average sample size of selected traits being 256,276. In our 17 genetic correlation analysis, we only obtained limited number of significant correlations, 18 even though many pleiotropic genes were found in association lookups. Therefore, we 19 expect that GWAS of ROI volumes with larger sample size will be available and can 20 further improve our understating of genetic overlaps underlying other traits. Besides 21 increasing the sample size, combining SNP data with external omic information, such as 22 gene expression data (57) Takeda \n"}, {"section_title": "GWAS participants and phenotypes 10", "text": "We performed GWAS separately on five publicly available datasets: the UK Biobank 11 (UKB) study, the Human Connectome Project (HCP) study, the Pediatric Imaging, 12\nNeurocognition, and Genetics (PING) study, the Philadelphia Neurodevelopmental 13\nCohort (PNC) study, and the Alzheimer's Disease Neuroimaging Initiative (ADNI) study. 14 The main GWAS made use of data of 19,629 individuals of British ancestry from the UKB 15 study, and the other four GWAS were performed on individuals of European ancestry, 16 see Supplementary Table 24 for a summary of sample size of each GWAS. 17"}, {"section_title": "18", "text": "The raw MRI, covariates and SNP data were downloaded from each data resource. We 19 processed the MRI data locally using consistent procedures via advanced normalization 20 tools (ANTs) to generate ROI volume phenotypes for each dataset. The processing steps 21 were detailed in Zhao, Ibrahim (10) and we removed three ROIs (X5th ventricle and 22 left/right lesion) with missing rates > 99%. For each phenotype and continuous covariate 23 variable, we further removed values greater than five times the median absolute 24 deviation from the median value. All individuals were aged between 3 and 92 years. 25\nMore information about study cohorts can be found in Supplementary Table 25 and 26"}, {"section_title": "Supplementary Note. 27 28", "text": ""}, {"section_title": "Heritability estimation and Genome-wide association analysis 29", "text": "We estimated the proportion of variation explained by all autosomal SNPs in UKB with 30 using univariate GCTA-GREML analysis (40). The adjusted covariates included age (at 31 imaging), age-squared, gender, age-gender interaction, age-squared-gender interaction, 32 21 TBV (for ROIs other than TBV itself), as well as the top 40 genetic principle components 1 (PCs) provided by UKB ((58), Data-Field 22009). We performed GWAS for each ROI 2 volume with PLINK (59). The same set of covariates as in GCTA-GREML analysis were 3 adjusted. GWAS were also separately performed on PING, PNC, ADNI, and HCP data. In 4 these four datasets, we adjusted for age, age-squared, gender, age-gender interaction, 5 age-squared-gender interaction, TBV (for ROIs other than TBV itself), and top ten 6 genetic PCs estimated from the SNP data. We also adjusted for the Alzheimer's disease 7 status in ADNI GWAS. 8 9"}, {"section_title": "Genomic risk loci characterization and comparison with previous findings 10", "text": "Genomic risk loci were defined using FUMA (31) online platform (version: 1.3.4). We 11 input the UKB GWAS summary statistics obtained from PLINK (59). FUMA first identified 12 independent significant SNPs, which were defined as SNPs with a p-value smaller than 13 the predefined threshold and independent of other significant SNPs at R-squared < 0.6. 14 Using these independent significant SNPs, FUMA then constructed LD block for 15 independent significant SNPs by tagged all SNPs that had a MAF ≥ 0.0005 and were in 16 LD (R-squared≥0.6) with at least one of the independent significant SNPs. These SNPs 17 included those from the 1000 Genomes reference panel and may not have been 18\nincluded in the present study. Based on these independent significant SNPs, 19 (independent) lead SNPs were also identified as those that were independent from each 20 other (R-squared<0.1). If LD blocks of independent significant SNPs were closed (<250 21 kb based on the closest boundary SNPs of LD blocks), they were merged to a single 22 genomic locus. Thus, each genomic locus could contain more than one independent 23 significant SNPs and lead SNPs. More details can be found in Watanabe, Taskesen (31) . "}, {"section_title": "Meta-analysis of GWAS results 28", "text": "We meta-analyzed the UKB, PING, PNC, ADNI, and HCP GWAS summary results by 29 METAL (https://genome.sph.umich.edu/wiki/METAL) with the sample-size weighted 30 approach. Since the sample sizes of other four datasets were small, we removed the 31\nSNPs that were not presented in the UKB data. 32 23 1"}, {"section_title": "Genetic correlation estimation with LDSC 2", "text": "The LD Hub (v1.9.1, http://ldsc.broadinstitute.org/ldhub/) was used to estimate the 3 genetic correlation between several UKB ROIs volumes and their corresponding traits 4 studied in the ENIGMA consortium (54). Then the LDSC software (v1.0.0, 5 https://github.com/bulik/ldsc) was used to estimate the pairwise genetic correlation 6 with 50 sets of collected GWAS summary statistics. We used the pre-calculated LD 7 scores provided by LDSC (https://data.broadinstitute.org/alkesgroup/LDSCORE/), which 8 were computed using 1000 Genomes European data. We used HapMap3 SNPs and 9 removed all SNPs on chromosome 6 in the MHC region. 10 11"}, {"section_title": "Polygenic scoring 12", "text": "Polygenic profiles were created to examine the out-of-sample prediction power of the 13 GWAS results. Specifically, we used PLINK (59) to generate risk scores in testing data by 14 summarizing across pruned (window size 50, step 5, R-squared = 0.2) SNP alleles, 15 weighed by their effect sizes estimated from training data. We randomly divided the 16 19,629 UKB individuals into ten folds, then used nine of these folds as training data to 17 rerun GWAS, and created polygenic profiles on the individuals in the remaining fold, 18 which served as testing data. We repeated this procedure ten times such that each fold 19 alternated to serve as the testing data for exactly one time. Then we used the UKB 20 GWAS results to perform prediction on ADNI, PING, PNC and HCP data. The prediction 21 accuracy was evaluated on all samples in the four testing sets (with phenotype and SNP 22 data available), not limited to individuals of European ancestry used in GWAS. We tried 23 five p-value thresholds for SNP predictor selection: 1, 0.5, 0.05, 5*10 -4 and 5*10 -8 . The 24 association between polygenic profile and brain volume was estimated and tested in 25 linear regression model, adjusting for the effects of age and gender. The additional 26 variance of brain volume that can be explained by polygenic profile was used to 27 measure the prediction power. 28"}, {"section_title": "Data availability 30", "text": "All UKB and meta-analysis GWAS summary statistics of 101 ROI volumes can be found at: 31 https://med.sites.unc.edu/bigs2/data/gwas-summary-statistics/. c e re b e lla r. ve rm a l. lo b u le s .I .V 3 5 B ra in .s te m 3 3 r ig h t. p u ta m e n 2 8 X 4 t h . v e n t r ic le 2 8 le f t . la t e r a l. v e n t r ic le 2 8 l e f t . p u t a m e n 2 7 r i g h t . l a t e r a l . v e n t r i c l e 2 7 r i g h t . c e r e b e l l u m . e x t e r i o r 2 5 l e f t . c e r e b e l l u m . e x t e r i o r 2 5 l e f t . c e r e b e l l u m . w h i t e . m a t t e r AGBL2  AKAP10  ALDH1A2  ARHGAP27  ARL17A  ARL17B  ASTN2  BCL2L1  C16orf95  CAMTA1  CELF1  CENPW  CRHR1  CRIM1  CSRNP3  DACH1  DCC  DENND4B  DSCAML1  EFCAB5  ENO4  FAF1  FAM53B  FNBP4  FOXO3  GATAD2B  GMNC  GNA12  HMGA2  HRK  HYI  IGF2BP1  INA  KRTCAP2  LATS1  LRRC37A2  MAPT  MCC  MITF  NSF  NUP160  NUP210L  PITPNM2  PLEKHM1  RAPGEF2  RELN  SLC44A5  SPPL2C  SQSTM1  STX6  SZT2  TBC1D9B  TPX2  TRIOBP  TTC39A  VCAN G e n e r a l c o g n it iv e f u n c t io n ( C C A C E , n = 2 8 2 , 0 1 4 ) C o g n it iv e p e r f o r m a n c e ( S S G A C , n = 2 5 7 , 8 2 8 ) D e p r e s s iv e s y m p t o m s ( S S G A C , n = 1 6 1 , 4 6 0 ) C o ll e g e c o m p le t io n ( S S G A C , n = 1 2 6 , 5 5 9 )\nE d u c a t io n a l a t t a in m e n t ( S S G A C , n = 2 9 3 , 7 2 3 ) E d u c a t io n a l a t t a in m e n t ( S S G A C , n = 7 6 6 , 3 4 5 ) E d u c a t io n y e a r s ( S S G A C , n = 1 2 6 , 5 5 9 ) I n t e ll ig e n c e ( C T G , n = 7 8 , 3 0 8 ) I n t e ll ig e n c e ( C T G , n = 2 6 9 , 8 6 7 )\nN e u r o t ic is m − ( ir r it a b le ) ( C T G , n = 3 6 6 , 7 2 6 ) N e u r o t ic is m − ( w o r r y ) ( C T G , n = 3 7 2 , 8 6 9 ) N u m e r ic a l r e a s o n in g ( C C A C E , n = 1 6 8 , 0 3 3 ) R e a c t io n t im e ( C C A C E , n = 3 3 0 , 0 6 9 ) W o r r y ( C T G , n = 3 4 8 , 2 1 9 ) X3rd.ventricle *Significant after adjusting for multiple testing (n.test=4900) at 0.05 level"}]