[{"section_title": "", "text": "elgrass (Zostera marina L.) is a flowering plant that grows rooted in the sediment in low intertidal and shallow subtidal environments. In areas such as Casco Bay that are protected from severe wave action, eelgrass often forms extensive, dense meadows that provide critical ecological functions and values, including habitat for fish and wildlife. Many commercially and recreationally valuable species of fish and shellfish depend on eelgrass beds as feeding and nursery areas. Eelgrass is also important waterfowl habitat. Brant, in particular, rely on eelgrass for food. In addition, eelgrass beds help to protect shorelines by stabilizing the substrate and baffling waves and currents, and help to improve water quality by filtering sediments and absorbing nutrients. The leading cause of widespread eelgrass loss throughout New England is reduced water quality due to coastal watershed development, but local habitat damage or destruction has also been attributed to dredge and fill operations, boat propellers, docks, anchors and mooring chains, and fishing gear."}, {"section_title": "Key Findings", "text": "Eelgrass beds in Casco Bay were mapped from aerial photographs (1:12,000 scale) by the Maine Department of Marine Resources in 1993-1994 and again in 2001-2002. Photographs were acquired and interpreted following the NOAA Coastal Change Analysis Program protocol for seagrass mapping. The overall amount of eelgrass habitat has increased in Casco Bay over the past decade. In 1993decade. In -1994,056 acres of eelgrass were present in Casco Bay and in [2001][2002]8,248 acres were present. Areas of increase are largely restricted to the northeastern end of the bay; in particular, eelgrass beds in Maquoit Bay increased considerably in extent and density during this period (Barker 2005). However, decreases in coverage occurred in Broad Cove, north of Cousins Island, west of upper Great Chebeague Island, and in the vicinity of Upper and Lower Goose Islands (Barker 2005)."}, {"section_title": "Why is Eelgrass Habitat Important?", "text": "Eelgrass serves many important ecological functions, such as providing habitat for fish and wildlife."}, {"section_title": "Hilary Neckles", "text": ""}, {"section_title": "Hillary Neckles", "text": "Intertidal eelgrass bed in Maquoit Bay."}, {"section_title": "Has Eelgrass Habitat in Casco Bay Changed Over Time?", "text": "Answer: Yes. The overall amount of eelgrass has increased over the past decade.  -2002 1993-1994 E elgrass declined in portions of the middle section of Casco Bay. The causes of eelgrass loss have not been determined. The majority of extensive habitat loss is associated with the end of Casco Bay that is most populated, suggesting that influences of activities in the watershed on water quality may have played a role. Losses due to direct physical disturbance are also documented throughout the bay. A recent study identified 132.5 acres of eelgrass habitat in Maquoit Bay that had been degraded by mussel dragging, and drag marks in the vicinity of Little Mosier Island suggest additional local dragging impacts (Barker 2005). Scientific evidence indicates that eelgrass beds that are damaged by intensive dragging activity will take a mean of 10-11 years to revegetate under good growth conditions (Neckles et al. 2005)."}, {"section_title": "Inidicator 9: Eelgrass", "text": ""}, {"section_title": "2001", "text": "A dragging scar (circled in yellow) created in June 1999 in a Maquoit Bay eelgrass bed covers 78.6 acres (Neckles et al. 2005)."}, {"section_title": "Why Has Eelgrass Habitat Declined in a Few Areas?", "text": "Maine DMR"}]