[{"section_title": "Abstract", "text": "Volatile organic compounds (VOCs) emitted from poultry production are leading source of air quality problems. However, little is known about the speciation and levels of VOCs from poultry production. The objective of this study was the speciation of VOCs from a poultry facility using evacuated canisters and sorbent tubes. Samples were taken during active poultry production cycle and between production cycles. Levels of VOCs were highest in areas with birds and the compounds in those areas had a higher percentage of polar compounds (89%) compared to aliphatic hydrocarbons (2.2%). In areas without birds, levels of VOCs were 1/3 those with birds present and compounds had a higher total percentage of aliphatic hydrocarbons (25%). Of the VOCs quantified in this study, no single sampling method was capable of quantifying more than 55% of compounds and in several sections of the building each sampling method quantified less than 50% of the quantifiable VOCs. Key classes of chemicals quantified using evacuated canisters included both alcohols and ketones, while sorbent tube samples included volatile fatty acids and ketones. Volatile organic compounds (VOCs) emitted from poultry production are leading source of air quality problems. However, little is known about the speciation and levels of VOCs from poultry production. The objective of this study was the speciation of VOCs from a poultry facility using evacuated canisters and sorbent tubes. Samples were taken during active poultry production cycle and between production cycles. Levels of VOCs were highest in areas with birds and the compounds in those areas had a higher percentage of polar compounds (89%) compared to aliphatic hydrocarbons (2.2%). In areas without birds, levels of VOCs were 1/3 those with birds present and compounds had a higher total percentage of aliphatic hydrocarbons (25%). Of the VOCs quantified in this study, no single sampling method was capable of quantifying more than 55% of compounds and in several sections of the building each sampling method quantified less than 50% of the quantifiable VOCs. Key classes of chemicals quantified using evacuated canisters included both alcohols and ketones, while sorbent tube samples included volatile fatty acids and ketones. ). Location variations for top five compounds averaged 49.5% in each section of the building and averaged 87% for the entire building.\nPublished by Elsevier Ltd."}, {"section_title": "Introduction", "text": "There has been tremendous consolidation in animal agriculture in the USA for the past 20 years. Today most of the swine (95%, farms with 2000 or more) and virtually all the broilers (99%, farms with 100,000 or more) and layers (91%, farms with 20,000 or more) in the USA are produced on farms that can be described as large to medium CAFOs (2007 Census of Agriculture; Federal Register, 2003) . Most of the consolidations have come about by efficiency/ economy of scale in production that has been driven in a large part by the integration of growers with meat production (MacDonald and McBride, 2009 ). However, this growth has come at a price since large animal feeding operations (AFO) have increasing come under both regulatory and citizen group scrutiny due to the large amounts of untreated waste and odors generated. Environmental groups have labeled these large operations \"factory farms\" and this is reinforced by complaints of lower quality of life (Thu et al., 1997; Wing et al., 2008) , social justice issues (Wing and Wolf, 2000; Edwards and Ladd, 2000) and declining property value near these facilities (Palmquist et al., 1997) . Many of the complaints are rooted in air quality concerns and these are driven in large part by odor emissions, which have been identified as one of the most significant animal emission at the local level (NRC, 2003) . Air quality concerns have led local communities and environmental groups to push for enforcement of existing laws such as the Clean Air Act with US EPA on AFOs.\nThe problem of course is how to apply laws initially written for manufacturing facilities to farming operations? The challenge in determining compliance of these laws for agricultural operation is how to quantify the emissions from AFOs given both the nature of the compounds (Zahn et al., 1997; Blunden et al., 2005; Filipy et al., 2006) and uncertainty associated with emissions from non-point sources. Due to these unknowns, US EPA entered into agreement with large AFOs in order to develop a better understanding into the types and levels of compounds being emitted (Federal Register, 2005) . The Air Consent Agreement (ACA) outlines the methodology that will be used for measuring emissions from AFOs, and is the basis for the methodology used in both this study and those of the National Air Emissions Monitoring Study (NAEMS). The ACA specifies that quantitation of non-methane hydrocarbons (NMHC) use US EPA method 25A and speciation of volatile organic q Disclaimer: Names are necessary to report factually on available data; however, the USDA neither guarantees nor warrants the standard of the product, and use of the name by the USDA implies no approval of the product to the exclusion of others that may be suitable.compounds (VOCs) use a single method developed from canister analysis (Federal Register, 2005) . However, both Method 25A and canister air sampling are poorly suited for measuring the compounds associated with AFOs.\nCanisters sampling (USEPA Method TO-15) has been used at both swine and dairy facilities to speciate and quantify VOCs such as alcohols and light ketones (Blunden et al., 2005; Filipy et al., 2006) . However, slow filling of canisters and sampling in humid environments can result in condensation of water at the sample container inlet and inside canisters both of which can lead to potential loss of compounds (McClenny et al., 1999; Wang and Austin, 2006) . It has also been shown that certain polar compounds associated with AFOs do not lend themselves to canister analysis (Koziel et al., 2005) . In fact, volatile fatty acids (VFAs) have not been detected with canister sampling and analysis from animal feeding operations (Koziel et al., 2005; Blunden et al., 2005; Filipy et al., 2006) and they are known to be a significant VOC associated with animal production (Zahn et al., 1997; Zahn et al., 2001; Ngwabie et al., 2008) . Even alternative air sampling techniques such as sorbent tubes (USEPA Method TO-17) have their own short comings especially when sampling in humid environments using molecular sieve sorbents (Helmig and Vierling, 1995; Gawlowski et al., 1999; Trabue et al., 2008a) . Rabaud et al. (2002) noted problems with excess water when sampling air from a dairy facility in California. While sorbent material such as Carbopack X have been shown to trap both volatile and semi-volatile compounds in humid environments (Trabue et al., 2008a) , it is poor at trapping and quantifying alcohols (Kornacki et al., 2005) a key VOC from AFOs (Blunden et al., 2005; Filipy et al., 2006; Ngwabie et al., 2008; Sun et al., 2008) . Consequently, we propose using multiple techniques as complementary methods since a single technique would miss a significant fraction of the VOCs associated with AFOs.\nOne of the first animal groups to start vertical integration in management practices was the poultry industry, and today nearly all broilers in production are grown on a contractual basis (McDonald, 2008) . Despite the numerous studies on odor from poultry production, little work has been preformed on the types of compounds emitted from a poultry facility. Previous work on VOCs from poultry production have all been preformed in laboratory environments detached from both animals and production facility (Burnett, 1969; Smith et al., 1977; Yasuhara, 1987; Cai et al., 2007) . The purpose of this study was to determine the speciation of VOCs emitted from a commercial poultry facility during production and between production cycles. The air sampling techniques used to speciate VOCs included evacuated canister (US EPA Method TO-15) for volatile compounds and sorbent tubes (US EPA Method TO-17) for less volatile and semi-volatile compounds. In addition, sampling will include areas with and without bird populations and spatial uncertainties associated with each technique."}, {"section_title": "Experimental section", "text": ""}, {"section_title": "Field sampling", "text": "Air samples from a commercial broiler production house located in the southeastern United States were collected between flocks in spring and during an early production phase in winter. The production house sampled was representative of current commercial broiler systems with dimensions of 13.1 Â155.5 m (43 Â 510 ft) and designed to house approximately 25,000 birds per flock. Mechanical ventilation of the house was achieved by either side wall fans or tunnel fans, depending on the climate and bird age (Fig. 1) . Management practices included the use of rice hulls as bedding and decaking (removing the caked litter, a mixture of bedding and manure, under the water and feed lines) after each flock. The air temperature and relative humidity were 24.0 AE 3.0 C (mean AE standard deviation) and 61.1 AE10.3%, respectively, during spring sampling and 24.5 AE 1.8 C and 56.9 AE 12.6%, respectively, during the winter sampling. Samples were taken from side wall fan, tunnel portion of the building and throughout the building along water and feed lines (Fig. 1) ."}, {"section_title": "Canister sampling and analysis (TO-15)", "text": "Field samples were collected in either glass (0.47 L) or fused silica lined (1.4 L FSL) canisters (all purchased from Entech Instruments, Inc., Simi Valley, CA). All canisters were cleaned prior to taking in the field with details found in Trabue et al. (2008b) . In brief, all canisters were cleaned three times on an Entech 3100A automated cleaner system (Entech Instruments, Inc.) and evacuated to 1.33 Pa. Samples were obtained by filtered time integrated samples (1.5 h) using a restriction sampler (Entech Instruments, Inc) at approximately one meter height. Samples were taken from the two side wall fans and tunnel portion of the building (Fig. 1 ). Samples were typically analyzed within one month of collection with storage stability studies conducted on samples stored for longer than one month. Total number of samples collected during production cycle was 19 including an ambient air sample, while only five samples were taken between production cycles.\nCanister samples were analyzed using a canister sampling/ concentration system (7500 auto-sampler, 7100 concentrator, Entech Instruments, Inc.) coupled to a 6890 GC (Agilent Technologies, Inc., Wilmington, DE) with mass spectrometer (5973 Inert MSD, Agilent Technologies, Inc.). The 7100 used a three stage concentration procedure that removed sampled water via micropurge and trap technique prior to GC/MS analysis. The 6890 GC was equipped with DB-5MS column (60 m Â 0.32 mm Â 0.25 mm) (Agilent Technologies, Inc.) using helium gas at 1.5 mL min . Laboratory calibration gas standards and positional standards were purchased from either Entech Instruments, Inc., Scott Specialty Gases (Plumsteadville, PA), or created in the laboratory with compounds purchased from Aldrich (SigmaeAldrich, St. Louis, MO). Entech's TO-15 calibration gas standards cylinders contained a 77 compound mixture at concentrations of 1 ppm each (for complete list of compounds see Supplementary data section), while Scott's gas standard mixtures contained acetone, acetonitrile, methanol, ethanol, propanol, butanol, 2,3-butanedione, butanal, hexane, and propene all at 10 ppm. All standard mixtures were prepared in oxygen free nitrogen gas with an accuracy of at least AE5% and a tolerance blend of AE5%. Reference gases for calibration standards were mixed and diluted using a dynamic dilution system (4600A, Entech Instruments, Inc.). Standard curves for each compound was based on a minimum three point calibration curve (typically five) for the MSD. All calibrating reference standard points were run in duplicate as a minimum."}, {"section_title": "Sorbent tube sampling and analysis (TO-17)", "text": "Field sampling and analysis of sorbent tubes followed modified procedures developed in Trabue et al. (2008a) . In brief, air samples were collected on glass sorbent tubes (178 Â 6 mm diameter) containing a multi-bed sorbent packing of Carbopack C and Carbopack X (1:2 ratio v/v). Air samples were collected at 100 mL min À1 for 12 L using a field gas sampler (GS 301 gas sampler, Gerstel, Inc., Baltimore, MD) each sampler was equipped with 47 mm single stage filter assembly with <0.2 mm Teflon filter (Savillex Corporation, Minnetonka, MN) to remove suspended particles in air stream. Sorbent tubes were stored at ambient temperatures until shipped to Ames, IA where tubes were stored at <À20 C until analyzed. All samples were analyzed within one month and assumed stable based on storage stable studies with VFA, phenol, and indole compounds. Total number of samples collected during production cycle was 40 including ambient air samples, while only 20 samples were taken between production cycles. See Supplementary data for more details on procedures used to validate specific compounds analysis with sorbent tubes. Sorbent tubes were analyzed by thermal desorption (TDS) using an Agilent 6890N GC (Agilent Technologies, Inc.) with either a 5973N Inert MSD (Agilent Technologies), or MSD (5975N, Agilent Technologies). Both GC systems used a Gerstel TDSA (Gerstel, Inc., Baltimore, MD) as its TDS unit, each were equipped with PTV (programmed temperature vaporizer) inlets (CIS 4, Gerstel, Inc.) and both separated compounds on a 30 m Â 0.25 mm Â 0.25 mm FFAP column (J&W Scientific, Inc., Wilmington, DE) using a helium gas set at a maximum of 1.4 mL min À1 constant flow.\nThermal desorption (TDS) parameters were exactly the same as Trabue et al. (2008a) . The PTV inlet method was modified using a glass bead/Carbopack C packed inlet (previously glass beads only) and using a 1 min delay in the purge split flow (previously 0.01 min delay) making this procedure essentially a splitless injection. The GC oven temperature program was the following: 1) initial temp, 80 C hold 0.05 min; 2) ramp 10 C min À1 to 220 C; and 3) ramp 50 C min À1 to 240 C and hold 5 min. The MSD operated similar to canister system above. Identification and quantitation of each compound was based on retention time and ion ratio match of the target compounds. External standard curves were used for quantitation of samples. Standard curves for each compound were based on at least a five point calibration curve for the MSD using a linear regression with inverse concentration weighing of calibration points. All calibrating reference standard points were run in duplicate as a minimum. Reference chemicals were purchased from either SigmaeAldrich, Fisher Scientific (Thermo Fisher Scientific, Waltham, MA), or Cole Parmer (Cole-Parmer Instrument Company, Vernon Hills, IL) with a minimum purity of 97% or greater (GC grade). Methanol and water used to dilute reference standards were HPLC grade and were purchased from SigmaeAldrich and Burdican and Jackson (Muskegon, MI), respectively. Table 1 lists concentrations of the most abundant VOCs measured with both TO-15 and TO-17 methodology based on mass per unit volume (see Supplementary data for ambient air concentrations). Sample location in the facility had a significant impact on the types and levels of compounds measured with higher concentrations and more polar compounds associated with bird populations (SW1) and less polar compounds at lower levels associated with areas of no bird populations (empty building and tunnel). See Supplementary data for example chromatograms of samples taken at different sections of the building. Areas of the building with birds present had VOC levels seven fold higher than areas without birds and buildings in early production cycle had a 45% increased in VOC levels compared to the same building idle between production cycles. The types of compounds detected during production were also present in-between production cycles, but compounds detected in-between production was not necessarily found during a production cycle. This is evident by the fact that eight of the top 10 most abundant compounds quantified during the production cycle (i.e., birds present) were also among the top 20 compounds detected in the empty building. Only one of those compounds, 1-methyl-4-prop-1-en-2-yl-cyclohexene (common name is limonene), was not detected in the empty building but it represented less than 2% of the VOC by mass. Whereas, four of the top 10 compounds in the empty building were not among the top 20 compounds detected during production cycle and two of those compounds were not detected at all and these compounds represented close to 10% of the VOC by mass. This demonstrates the importance of characterizing animal facilities with animals present since aged manure/litter alone gave a different VOC profile in terms of both inventory load (i.e., concentration) and diversity of compounds."}, {"section_title": "Results and discussion", "text": "Concentrations of compounds varied considerably depending on the location of the sample and if animals were present (Table 1) . The top five compounds had large sampling variation were polar and detected in highest concentration in areas with birds present (Fig. 2) and this trend held for other polar compound classes such as ketones and carboxylic acids (Fig. 3) ; however, for aliphatic hydrocarbon compounds sampling variation was not as great and concentration levels tended to be more uniform throughout the poultry facility (Fig. 3) . Overall the top 5 compounds by mass constituted close to 70% of VOC for sampling buildings during and in-between production cycles (Table 1) . Location variations measured as standard error for an area divided by its mean concentration of top five compounds for a particular section in the building (i.e., SW1, SW3, and tunnel) averaged 64% with a median of 61%, while that same variation for the whole building averaged 74% with a median of 81%. This information when coupled with the large concentration differences between areas with and without bird populations shows the need to coordinate both sample location VOC speciation profiles with emission factors. In terms of VOCs' concentration (building air concentration minus ambient facility air concentrations), polar compounds are still by far the largest source of VOCs in areas with birds present, but in areas with no birds present compounds of anthropogenic in origin become more prominent yet still in the minority (Table 2) . Volatile organic compounds from SW1 were three and nine times higher than both SW3 and tunnel areas of the building, respectively (Table 2) , and highlight the need of measuring emissions with animals present. Technique in sampling VOCs is extremely important since biases in analysis can occur depending on choice of technique. While TO-15 and TO-17 sampling methodology can be considered alternative techniques, we used the two techniques as complementary. We used TO-15 as the technique of choice in sampling the more volatile compounds and TO-17 to sample the less volatile to semi-volatile compounds due to our choice of sorbents. There was some overlap between the two techniques and these compounds included: 1) 2,3-butanedione; 2) 2-butaone; 3) benzaldehyde; 4) hexane; 5) toluene; and 6) benzene. The compound 2,3-butanedione measured by TO-17 was a little over 25% of TO-15 values this may be a result of lower and more variable recovery of this compound with sorbent tubes as evidenced during validations studies using TO-17 (see Supplementary data on TO-17 method validation). In addition, when testing our thermal desorption methodology, the authors discovered that low levels of oxazole compounds formed (less than 1% of 2,3-butanedion levels) when thermal desorbing 2,3-butanedione in the presence of high ammonia concentrations (see Supplementary data section for details). Overall, there was good agreement between the methods for 2-butanone, toluene, benzene and benzaldehyde with average concentration levels differing by only 13.6% (Table 3) . However, that difference is a little deceiving since head to head comparisons between the two methods showed average difference to be 62% with the largest differences associated with bird populations (SW1). What was surprising was that the aliphatic hydrocarbon compounds had the highest variance not polar compounds in those areas (Table 3) . This difference in concentrations may be a result of both the air matrix (i.e., dust, relative humidity, etc.) and turbulent flow patterns in areas with birds present.\nIn terms of VOC speciation, it was not surprising that alcohols, ketones, and VFAs were the most abundant chemical classes since these compounds have been shown to be abundant with other animal groups (Zahn et al., 2001; McGinn et al., 2003; Blunden et al., 2005; Filipy et al., 2006; Ngwabie et al., 2008) and previous studies with poultry litter/manure have also reported the significance of these chemical classes (Smith et al., 1977; Yasuhara, 1987) . Odor studies from poultry litter/manure have reported the significance of both 2,3-butanedione, 3-hydroxyl-2-butanone and carboxylic acids (Burnett, 1969; Cai et al., 2007) . Sulfide compounds were not a major VOC chemical class in this study, but they were well above levels reported with other AFO (Blunden et al., 2005; Filipy et al., 2006; Ngwabie et al., 2008) and their abundance levels was associated with bird population and similar to levels previously reported in a volatile sulfur speciation study (Trabue et al., 2008b) . Fig. 4 shows the importance of each chemical class as a percentage of total VOC. Clearly areas with animals present were dominated by polar VOC, and areas without birds while still controlled by polar compounds had a higher percentage of compounds that were anthropogenic in origin. These results are not unexpected since dominance of polar compounds is common with other types of AFO (Blunden et al., 2005; Filipy et al., 2006; Ngwabie et al., 2008) .\nOne of the surprising aspects of this study concerned the high levels of 2,3-butanedione and this compound has been associated Fig. 1 for description of area). f SW3, side wall location of sampler (see Fig. 1 for description of area). g Tunnel area of the poultry facility (see Fig. 1 for description of area). h BDL, below detection limits. i ND, not determined. j NA, not applicable. k 3-Hydroxy-2-butanone quantified using 2-butanone calibration curve. l Unknown ester-01 quantified using triethyl citrate standard. m Triethyl citrate IUPAC name 1,2,3-triethyl 2-hydroxypropane-1,2,3-tricarboxylate. n 4,5-Dimethyl oxazole, quantified using 2,4,5-dimethyl oxazole calibration curve. o 2,4,5-Trimethyl oxazole, potential artifact from reaction of 2,3-butanedione in the presence of ammonia with formation at 0.6% of 2,3-butanedione levels (see Supplementary data).\nwith respiratory impairment (Kreiss et al., 2002) . Areas with the highest concentration were associated with active bird populations and the types of compounds detected in those areas (Table 1) were similar to the types of compounds measured in popcorn flavoring plants (Hubbs et al., 2002) . The average air concentration in the poultry facility where birds were located, 1615 mg m ). The concentration of acetic acid was also concerning since this compound was also found as part of suite of compounds associated with popcorn flavor facilities (Hubbs et al., 2002) . However, it should be noted that peak concentrations, 1936.7 mg m À3 , were well below NIOSH recommended eight hour exposure levels of 25,000 mg m À3 (NIOSH, 2005) . However, average concentrations of acetic acid reported in this study were well above what has been reported for other animal groups (Zahn et al., 1997 (Zahn et al., , 2001 McGinn et al., 2003; Ngwabie et al., 2008) . Currently most studies on workers occupational health risks from poultry facilities have focused exclusively on inhalation of dust or bioaerosols, but this study would suggest that some attention should also be paid to the role VOCs may play on worker respiratory health. While exposure levels of both 2,3-buanedione and acetic acid were well below levels found at popcorn favoring facilities and NIOSH exposure recommendations, the summation of all the other compounds detected in this study warrants additional investigation.\nAnother unexpected result was the levels of both pyraazine and oxazole compounds (Table 1 ) with most of these compounds being detected in areas of active animal populations. These compounds are not typically associated with VOCs from AFOs nor have they been reported with poultry production (Burnett, 1969; Smith et al., 1977; Yasuhara, 1987; Cai et al., 2007) . Unlike most compounds detected in this study these compounds may not be biologically derived from the waste nutrients or enteric emissions from the animals themselves. We speculate that these compounds formed abiotically due to the high levels of ammonia, 2,3-butanedione, and 3-hydroxy-2-butanone present since these compounds peak levels were coordinated with presence of 3-hydroxy-2-butanone. Previous research has shown that pyrazines form under mild conditions in presence of the aforementioned compounds (Shu and Lawrence, 1995; Shu, 1998; Yaylayan and Haffenden, 2003) with tertramethylpyrazine being its main product (Yaylayan and Haffenden, 2003) , and with the addition of formaldehyde both di-and trimethyl oxazoles form as well (Wang and Austin, 2006) . These compounds have low odor thresholds and may be responsible for some of the pungent and oppressive odors associated with poultry production. In addition, there was one significant compound detected in the empty building that was unidentified by either reference library (less than 70% NIST) or authentic standard. The compound itself is estimated to represent only 4% of the VOCs in the empty building with trace amounts detected during the production cycle. The compound is thought to be an ethyl ester of dicarboxylic acid due to fragmentation profile ( Fig. 5) and Turecek, 1993) . The compound also has a similar chromatographic peak shape as triethyl citrate. Several classes of compounds were noticeably absent from our study and these included small carbonyl compounds, small esters, and amine compounds. The carbonyl compound acetaldehyde has been reported at significant levels with other animal groups (Schiffman et al., 2001; Blunden et al., 2005; Shaw et al., 2007; Ngwabie et al., 2008) but it is reactive and unstable in storage (Kelly and Holden, 1995) . In fact, the highest reported concentration of this compound from AFOs has been reported with \"realtime\" analysis using PTR-MS (Shaw et al., 2007; Ngwabie et al., 2008) . Consequently, we likely missed this compound during our analysis. Small ester compounds are also challenging due to their volatility and instability during storage (Ochiai et al., 2002) , but these compounds have not been shown to be emitted from the litter at any appreciable levels (Smith et al., 1977) nor have they been associated at significant levels with other animal groups (Schiffman et al., 2001; Blunden et al., 2005; Filipy et al., 2006; Ngwabie et al., 2008) . Amines compounds are another chemical class difficult to quantify due to its reactivity during storage, but levels of these compounds from poultry litter are consider low (Burnett, 1969; Smith et al., 1977; Yasuhara, 1987) and outside of odor studies (Burnett, 1969; Cai et al., 2007) they have not been shown to contribute significantly to total VOCs from other animal groups (Blunden et al., 2005; Filipy et al., 2006; Ngwabie et al., 2008) .\nThis study clearly shows that quantifying VOCs from AFOs is challenging and requires a multiplicity of techniques due to the range of volatility and reactivity of compounds being sampled. If we would have used a single air sampling technique as specified in the ACA we would have missed a significant percent of VOCs emitted. If we would have chosen canister sampling alone for VOC speciation, only 55% of the compounds in this study would have been quantified and in areas with birds present less than 50% would have been quantified. If sorbent tubes would have been used exclusively, only 55% of the compounds in this study would have been quantified and in the areas without bird's less than 45% were quantified. In addition, the overwhelming polar nature of the compounds quantified in this study also has implications on the technique used to quantify VOCs in the ACA since most NMHC analyzers used for Method 25A are typically designed for aliphatic hydrocarbon compounds. Most commercial NMHC analyzers use flame ionization detectors (FID) based instruments, but FIDs have higher responses factors for aliphatic hydrocarbons than polar compounds. Studies harmonizing FID response factors of aliphatic hydrocarbons with polar hydrocarbons have shown that functional groups (i.e., carbonyl, ketone, alcohols, etc.) on hydrocarbons can reduce their effective carbon number (ECN) by as much as 1.27 for esters, 0.80e1.0 for each ketones, and 0.6e0.73 for each primary alcohol (Jorgensen et al., 1990; Kallai et al., 2001) . In fact, a leading manufacture of NMHC analyzers does not recommend their use in quantifying polar compounds (Sherwin, 2007) . Quantifying and speciating VOCs is a challenging task and methods employed for this task do have consequences in terms of both concentration levels and diversity of compounds found."}, {"section_title": "Conclusion", "text": "The purpose of this study was to measure the type of VOCs emitted from a poultry facility using evacuated canisters and sorbent tubes. Polar compounds were the most abundant compounds emitted from the facility. Areas of the building with bird populations tended to have higher VOC levels than areas without birds present and the compounds in those areas were highly polar in nature. Neither canister nor sorbent tubes was able to captures more than 55% of the compounds in any one area and in several cases either method capture less than 50%. Key VOC classes Total VOC (%) included carboxylic acids, alcohols, and ketones. Based on types and levels of compounds emitted from this poultry facility the use of EPA Method 25 for quantitation of NMHC at AFOs is not recommended."}, {"section_title": "Appendix. Supplementary data", "text": "Details on compound list for canister standards (Table S1 ), sorbent tube compound method validation (Tables S2), chromatograms of TO-15 and TO-17 of different areas of the facility (Figures S1 and S2, and Table S2 ). Ambient air concentrations (Table S3) can be found in the online version, at doi:10.1016/j.atmosenv.2010.06.009."}]