[{"section_title": "Abstract", "text": "Convolutional neural networks (CNNs)-based classifiers improve the accuracy of diagnosis and prediction for Alzheimer's disease (AD). However, exploiting specific brain regions with the AD is essential to understand pathological alteration in the AD and monitor its progression. This paper aims to construct novel AD classification models which have a good performance and interpretation on AD diagnosis. We propose the three classifiers including a simple broaden plain CNNs (SBPCNNs), a major slice-assemble CNNs (SACNNs) and a multi-slice CNNs (MSCNNs), which record the slice positions but have fewer parameters. Specifically, we integrate the ranking and the random forest methods to find the discriminative region that is consistent with domain knowledge about the AD. The results of the visualization explanation of pixel and slice level deliver a clearer understanding of the AD to specialists. The experimental results indicate that the proposed models are meaningful for AD classification.\nINDEX TERMS Alzheimer's disease, CNNs-based classification, structural magnetic resonance imaging (sMRI), visual explanation."}, {"section_title": "I. INTRODUCTION", "text": "When Alzheimer's disease (AD) presents a stern strategic challenge around the world [1] , computer-aided diagnosis (CAD) has improved AD diagnosis and prediction performance. AD, being incurable, fatal dementia, bring significant pain and cost to patients and their families [2] . Thus, the accurate diagnosis of AD is important to postpone the disease progression and improve the quality of life of people with AD [3] . With the development of computer vision, machine learning, and deep learning techniques, novel models using medical images promote AD diagnostic accuracy [4] , [5] . However, several difficulties constrain the models' performance.\nMain challenges of data-driven models of AD-related tasks are limited data, multiple dimensions, and sophisticated The associate editor coordinating the review of this manuscript and approving it for publication was Linbo Qing. preprocessing of medical images. Due to the small training dataset, many automatic models, especially for those using pixels or voxels of the images, apply classic augmentation techniques such as rotation and patching from slices. Furthermore, decomposing 3D subjects into 2D slices is another common trick to get more training dataset. To reduce the complexity and large dimensions of brain image, some previous works [6] focus on using local features based on AD domain knowledge such as the hippocampus, frontal pole, and shell core, limit in need for prior knowledge and complex prepossessing. Some researchers extract the region-of-interest (ROI) as features from the available images and effectively reduce the image dimension, while the partial details might be lost. Auto-encoder is widely applied for AD tasks, but it cost more time because it is the two-stage method [7] , [8] . Summarily, the art of state techniques takes raw features from an extensive, annotated data set, such as a collection of images or genomes [9] - [11] , and use them to create a predictive tool based on patterns buried inside. However, the partial methods might disturb or lost original location information which could interpret the disease.\nRecently, numerous studies investigated improving the performance of classifiers, but few studies focused on inspecting pathological changes in computer-aided diagnosis models [12] - [16] , especially for Alzheimer's diagnosis tasks. For example, the discriminal brain region of FDG-PET has been inspected in the machine learning models [17] . In the study, voxels of FDG-PET were firstly part into nonoverlapping groups. Next, they identified essential regions related to AD in group level by important score, which is calculated by the random forest (RF) model. When used CNNs-based models, the 2D-CAM and 2D-Grad-CAM have been revised for 3D CNNs on structural magnetic resonance image (sMRI) [18] . By the approach, the essential region of the brain involving AD was visualized. Recent work uses active maps to determine brain region information, but their solution focuses on specific 60 sagittal slices [13] . As was mentioned in [13] , [18] , above methods decrease diagnostic accuracy, because they modified and retrained classifiers during the visualization stage. As a result, the ability to interpret trained models would be affected, which might prevent specialists from understanding the brain structure variations in AD progression.\nThis paper aims to study the informative regions of the brain between AD and normal cohort (NC). We proposed three 2D CNNs-based classifiers, including a simple, broaden plain CNNs (SBPCNNs) using a specific slice, a simple assemble CNNs (SACNNs) and multi-slice CNNs (MSC-NNs) using slices combination. Our methods are sketched in Fig 2. Our methods monitor relevant region details in the brain without disturbing brain slice location. Thus, we can systematically explore the corresponding brain regions at the pixel and slice levels by reliable ways. This study makes the following three contributions: (1) We conducted three novel models of monitoring slices location with fewer parameters, which obtained more than 90% performance of AD vs. NC task. (2) We proved that a slice of a specific location or the several slices combination of sMRI could diagnose AD thoroughly. Moreover, we found precise discriminative regions of pixel and slice levels. (3) We use the saliency maps to visualize the slice information of the models of excellent performance. Consequently, we give new clues for understanding abnormal brain region related to AD. The remainder of this paper is organized as follows. Section II describes the proposed frameworks and analysis methods; Section III reports experiments and presents the results of AD classification and slice importance; Section IV explains the visualization process; Section V concludes this paper and discusses avenues for future research."}, {"section_title": "II. METHODOLOGY", "text": "We focus on CNN-based classifiers and explanation for sMRI changing in grey matter (GM) for AD tasks. GM is chosen, because it is a reliable and classic marker for AD diagnoses, such as its' local and whole atrophy, and the density changes. In this section, we firstly introduce proposed models, namely simple broaden plain CNNs (SBPC-NNs), major slice-assemble CNNs (SACNNs) and multi-slice CNNs (MSCNNs). Next, we present how to determine slices importance. Finally, we describe the visual explanation technique for the models."}, {"section_title": "A. MAIN NETWORK 1) MODEL CONSTRUCTION", "text": "To promise the diagnostic accuracy, we evaluate prevalent neural networks by AD dataset. The advanced CNNs generally separates into two groups. The first group of CNNs (e.g., AlexNet, LeNet-5, VGG, GoogleNet, etc.) has shallow, sequentially connected layers with bigger receptions. The second group (e.g., Resnet, DenseNet [19] , etc.) has deeper layers, and skip connections between blocks with smaller filter kernels. Comparing the two architectures' advantages, the first group runs faster due to the more straightforward structure, while the second group overcomes the vanishing gradient problem of deeper layers through their particular structure. In practice, the general rule of CNNs is that framework with deeper layers performs better than those with the broader layer. However, we conduct subnetworks from the two types of CNNs, because the used dataset's characteristics, which describes in Section. III.\nConsidering the risks of overfitting from the small scale of the dataset, we simplify models and apply regularization techniques. Fig. 2 presents three revised networks. For the first type of CNNs, we experimentally convolutionalize all full connected layer of classic AlexNet. Therefore, the network is flexible to the input size. Additionally, we insert the normal batch layer between convolution layers for regularization reason. Since the used slices on a specific location have similar shapes and less noise, we simultaneously explore a simple broaden plain CNNs (SBPCNNs) which have bigger receptive filed and fewer layers. The second type of CNNs, we select DenseNet-based architecture of 30 layers that learn structure information efficiently.\nGiven input of 2D sMRI, the CNNs based classifiers are described as follow: x = {x i |i = 1, ..., N }, here, x i ∈ [0, 1, 2, ..., L − 1] w * l represents a set of sMRI data with grayscale values, w * n is pixels, and y = {y i |i = 1, ..., N }, y i ∈ {−1, 1} are the disease labels. In the forward procedure, the adapted CNNs extracts features from slices, then generate the disease probabilities through the final classification layers. In the backward stage, we use a cross-entropy loss function to measure the distance between the ground-truth labels and the prediction results. Thus, the network will learn the parameter values through an optimization process. The loss function is defined as l = − ĉ i log (f (x i , w)), whereĉ i denotes the real label."}, {"section_title": "2) ARCHITECTURE OF SACNNs", "text": "After getting the results of the pre-trained models on every slice, we combine top K classifiers outputs for the final result. Fig. 3 deciphers MSCNNs architecture. According to the ranking in terms of accuracy, we get the results of the final diagnosis of the test stage:\nwhere p i is the probability of prediction for a given slice i, and k denotes the number of selected pre-trained classifier. y pre value denotes final results. "}, {"section_title": "3) ARCHITECTURE OF MSCNNs", "text": "The first method explores the contribution of non-correlated slices to AD diagnosis, while the second method examines the contribution of the slices combination. MSCNNs is inspired by multi-view CNN algorithm [20] , [21] . By fusing several views and compacting representation, the models can apply views' correlation and pixel details simultaneously. Besides, the MSCNNs of the end-end model is more efficient than the SACNNs of the two-stage model. Medical images have 3D and 2.5D characteristics. For this reason, the multi-view algorithm can be applied for the disease tasks [22] . For example, an adapted multi-view model is used to detect pulmonary nodules [23] , and a recent model used views from the axial, sagittal, and coronal directions to enable better disease diagnosisciteLiu2018Classification. In this paper, we develop MSCNNS based on multi-view algorithm. Fig. 4 illustrates the architecture. The specific slices combination is fetched to the subnet of the CNNs and concatenate at the latter layers. Theoretically, the MSCNNs runs faster, since it is parameter-efficient of its' parallel channels."}, {"section_title": "B. SLICE IMPORTANCE", "text": "The slices importance refer to how effection those areas make the final diagnosis. For SACNNs, there are two methods to determine the slice importance [24] .\nThe first method consists of a set of steps. Firstly, we rank all classifiers, which have trained on the individual slice. By ranking slice-based models' accuracy, we select the topk slices and refer them to the standard brain atlas. At last, we practically investigate the prediction accuracy of the k slices, then analyze the pixel-level relevance to AD.\nThe second method decide slice importance by using the RF classifier, which is a common classification tool in Biomedical fields [25] - [30] . SACNNs focuses on the local slices with the best performance, while RF identifies all slices correlated with disease. The importance score from the retrained RF classifiers identify the slice importance including the Mean Decrease in Impurity (MDI)/Gini and the Mean Decrease in Accuracy (MDA). Our method uses MDI. It is calculated as follow: [31] :\nwhere p (t) denotes the proportion N t N of samples t, and v (s t ) is a function of split s t . i (s t , t) is the impurity reduction at node N , which can be described as:\nwhere i (t) is the impurity measure, p Left = N tLeft N t , and p Right = N tRight N t . Note that, when using one of the correlated features, the importance of the rest features will drop. The reason is that the first feature has removed the impurity, then the feature importance score would be biased towards other rest related features.\nFor approach 2, the slice combination with the optimal performance contains important and supplemental information for the final diagnosis. We examined two sets of slice combination experiments: 1) select several slices in a fixed interval from three directions, which start from the center of the brain to cover abroad region; 2) choose the slices from the essential areas of the standard brain image, which rely on specialist's domain knowledge about AD. As a consequence, the diagnostic accuracy will reveal the most critical slice combination."}, {"section_title": "C. VISUAL EXPLANATION USING SALIENCY MAPS", "text": "Saliency maps interpret the trained models and describe the discriminative regions of the brain at the pixel level for AD classification. According to the method described by [32] , we follow four steps: (1) fetch an image through the trained model; (2) calculate the score of every class; (3) set the output of the selected class to 1 and the output of all other classes to 0; and (4) backpropagate this derivative to obtain the value of the gradients.\nGiven inputs of grayscale brain images, I m * n (m, n) denote rows and columns, c is specific class, the saliency map can be calculated as:\nwhere w represents the derivative and h (i, j) denotes the index of w on the image pixel (i, j). Because our models use softmax layers to generate the probability of all classes, the saliency map displays the most discriminative pixels represent class c under the extreme value of class c.\nBecause the feature maps of the first convolutional layer are usually interpretable and describe simple visual properties, we highlight the magnitude of their gradient on the same image. Then we can know the apparent regions on which the models focus."}, {"section_title": "III. EXPERIMENTAL RESULTS", "text": ""}, {"section_title": "A. SUBJECT AND IMAGE PROCESSING", "text": "Labeled sMRI obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI). 1 The three datasets, including AD images, NC images, and Mild Cognitive Impairment (MCI) images, are listed in Table 1 . The ADNI was built by the National Institute on Aging (NIA), a non-profit organization, which provide data related to brain diseases such as serial MRI images, serial PET images, clinical and neuropsychological assessments, and additional biological markers. In this work, used sMRI have been preprocessed with skull-stripping and alignment, and are ''spatially normalized, masked, and N3-corrected.'' [33] .\nIn experiments, we choose the first image, in case of images from the same person at different stages might induce ''noise'' to the models and affect their precision. Next, we renormalized the voxel value of each image to the range [0, 1] [34] . Finally, all profiles were then segmented into grey matter (GM), white matter (WM), and cerebrospinal fluid (CSF) using the Computational Anatomy Toolbox (CAT12 Box). After removing irrelevant details, the GM density was aligned to the International Consortium for Brain Mapping (MNI-ICBM-152) atlas [4] . A total of 387 2D slices then were extracted from the axial, coronal, and sagittal planes of the original 121×145×121 medical images."}, {"section_title": "B. IMPLEMENTATION DETAILS", "text": "Our models implemented on an AMD A8 CPU with 16 GB RAM and an NVIDIA GTX 1080 under the Linux operating system with the PyTorch framework. We set a mini the batch size of 32, a learning rate of 0.0001, weight decay of 0.005, and a momentum factor of 0.9 with Adam optimization. To reduce the risk of overfitting, we ran an early stopping criterion. Owing to retain the original brain image structure and increase training dataset, we utilized Mixup technology [35] to extend train-set instead of classic data augmentation techniques such as patching, rotation, and cropping.\nWe split all 2D image slices into training and validation sets in the ratio of 80 : 20. On the first stage of ASCNNS, we pretrained and validated the model on the training sets; on the voting stage, we test it on validation sets. For avoiding prediction bias, the training and validation sets do not have 1 http://adni.loni.usc.edu/ the images from the same subject simultaneously. The results were averaged over ten evaluation cycles.\nExperimentally, we use confusion matrix, a common evaluation standard for binary and ternary classification, to analysis classifiers performance. Table 2 explains confusion matrix. By making use of value of confusion matrix during test stage, sensitive (Sen) and specific (Spe) are computed:\nIn practice, we compared accuracy, sensitivity, specificity, and area under the Receiver Operating Characteristic Curve (ROC-AUC) of classifiers for different tasks on 10 cross folds. ROC-AUC was calculated using library of sklearn package."}, {"section_title": "C. MODEL INFERENCE", "text": "We experimented with AlexNet, full convolutional Alnex, DenseNet of 30 layers and proposed simple broaden plain CNNs (SBPCNNs). On the first layer of SBPCNNs, the kernel size was set as huge as 39, and the number of feature maps is 18. Fig. 3 displays differences in models of time cost and the number of parameters. SBPCNNs is the simplest model having significant conceived fields and fewer layers. DenseNet runs slower associated with the complex network structure which produces numerous feature maps during the training stage. Fig. 5 shows the comparative performance of those models via a specific slice of a fold. The accuracy of the diagnosis of SBPCNNs surpassed other models significantly. By input several slices from different folds, results also showed that SBPCNNs achieved the best performance. For SACNNs, we examined the effects of the number of classifiers required. The prediction accuracy was stable in using 9 classifiers. More than 9, the practice shows the number of classifiers increased while the performance decreased slightly. For MSCNNs, in consideration of the computational cost and slices' diversity,30 slices were selected from the original 387 images. Table 4 compares our approaches with several advance methods. Those researchers used different datasets which are various in the numbers of subjects and distribution on gender, age, education, and degree of impairment of the brain. For this reason, this table only shows rough contrast results. In this table, GoogleNet with ROI input have the best performance [4] ,however it needs extra image process. When using sMRI, 3D CCNs achieved the best performance but it used bigger dataset. Notely, our models also have closely accuracy to them."}, {"section_title": "D. COMPARISON RESULTS", "text": "To exhibit fairly performance against the other methods, and then we present comparison ours with the other methods on the same dataset. In Table 5 , SBPCNNs using the 81th slice in coronal plane, achieved good performance with fewest parameters; SACNNs improved more performance for AD and NC classification; MSCNNs have similar accuracy to 3D CNNs' with smaller parameters. We did not apply SACNNs for AD and MCI, MCI and NC classification, because ROC-AUC score of classification on one slice is less than 0.80 and not reliable. Although proposed models have limitations for AD and MCI, MCI and NC classifications, Rensenet or Densenet based 3D CNNs faced serious problem of overfitting and high computational cost. Compared MSCNNs and SACNNs, SACNNs spends considerable time on pertaining for whole slices including useless slices. All together, MSCNNs could be a good alternative to the voxel model for 3D CNN-based classification. "}, {"section_title": "E. SLICE IMPORTANCE", "text": "As the previous section argued, our models are the benefit of exploit informative region with AD in slice and pixel level. By ranking of the pertained 387 classifiers accuracy, the slices with greater than 80% accuracy are found to located in the sagittal (38 − 50, 73 − 84), coronal (59 − 90), and axial (24 − 47) regions. Referred to atlas, Table 6 presents the distribution of pixels of slices with good diagnosis performance. There are apparent discriminative regions of AD and NC concentrated on the hippocampus, parahippocampal region, and amygdala, which agrees with previous results [39] , [40] . Fig. 6 shows the Gini purity of individual slices, which have run 300 iterations to enhance the distinction. The maximum importance values in the sagittal plane appear from images 45 to 80, the maximum values in the axial plane occur around index 47, and the maximum values in the coronal plane cover indexes 22 to 67. The importance scores of particular slices drop to 0 because correlative features have a strong effect on the Gini index. For example, slice 44 is influenced by the slice 43, and so its importance drops to zero. Moreover, the Gini purity distribution varies with the number of slices. The Gini purity of the coronal plane evenly distributed, and the results are line with those reported by [5] for PET images. Fig. 7 display the distribution of the prediction accuracy of 387 slices along with the sagittal, coronal, and axial plane. The shape of the yellow line (sagittal plane) is symmetrical, corresponding to the two halves of the brain, the green line (coronal plane) exhibits gentle changes in shape. As shown by the orange line (axial plane), the frontal slices have the best performance for AD diagnosis. Fig. 8 displays the performance of five slice combinations via the MSCNNs. The image on the left in Fig. 8 , shows the comparison results of slices combination at fixed intervals in three planes, and results of coronal having the highest accuracy. 8 is in line with the results in Fig. 7 ; the image on the right in Fig. In the Fig, slices at fixed intervals along the coronal plane perform better than slices based on domain knowledge.We think the reason is slices combination at fixed intervals contain diversity information of brain."}, {"section_title": "IV. EVALUATION VISUALIZATION", "text": "This section describes the use of saliency maps, which interpret and display the related brain regions, by visualizing models with higher gradient values of a specific label. We set a threshold as the 99th percentile on the gradient image. Fig. 9 and Fig. 10 show where the pixels correspond strongly to specific labels and what is seen on the slices by the selected models. The images in Fig. 9 was generated on the first layers of two models via MSCNNs of different folds. Every picture includes 30 saliency maps. The similarity among them indicates that these models are stable, with the area of highlighted pixels denoting essential regions in the AD or NC groups. Fig. 10 sequentially presents visualization results from several saliency maps using SPBCNNs, MSCNNs, and DenseNet via the NC samples. In the visualization results (a) and (b), the highlighted regions from DenseNet covers those from SBPCNNs. Thus the saliency maps of DenseNet might be less useful in recognizing the relative locations of AD. In the images on (b) and (c), there are significant highlighted areas that affect the AD diagnosis given by SBPCNNs and MSCNNs. Since details of their locations and shapes are similar, these models produce stable location information, and these brain regions might vary during the progress of AD. The visualization results provide some explicit visual expressions, which expose the discriminative areas of sMRI in the view of the models."}, {"section_title": "V. CONCLUSIONS AND FUTURE WORK", "text": "In this paper, we have developed three 2D CNNs-based classifiers for enhancing the diagnostic accuracy and determining precise location effects for AD. Our models simultaneously record the slice positions and achieve good performance in AD classification tasks. We studied the contributions of different slices combinations to AD classification and derived visual explanations of the proposed models. We identified which brain regions have the largest differentiation between the AD and NC groups in slice-level 2D views. Additionally, visualizing what is ''seen'' by the different models will provide insights to experts and help with the design of ''understanding'' models.\nThe current work was limited in using a single modality of sMRI, which provide restricted clues for MCI conversion. At this point, the future work is to utilize the systematic methods in AD, MCI, and other related disease classification tasks [41] , [42] . Moreover, combining multiple medical images with genetic data for AD and other diseases [43] - [46] classification would be an excellent idea and future works [47] - [49] .\nCHUNTING CAI was born in Sanming, China, in 1991. He received the M.Sc. degree in communication engineering from Huaqiao University, Xiamen, China. He is currently pursuing the Ph.D. degree with Xiamen University, Xiamen, China. His current research interests include video watermarking and information hiding.\nCHAOQUN HOU was born in Quanzhou, Fujian, China, in 1993. He received the B.S. degree in computer science and technology from Huaqiao University, in 2016. He is currently pursuing the master's degree with Xiamen University, Fujian. His research interests including computer vision, deep learning, and active learning and its applications to image classification.\nQUAN ZOU (M'13-SM'17) received the B.Sc., M.Sc., and Ph.D. degrees in computer science from the Harbin Institute of Technology, China, in 2004 China, in , 2007 China, in , and 2009 , respectively. He was with Xiamen University and Tianjin University, from 2009 to 2018, as an Assistant Professor, Associate Professor, and a Professor. He is currently a Professor with the Institute of Fundamental and Frontier Sciences, University of Electronic Science and Technology of China. His research interests include the areas of bioinformatics, machine learning, and parallel computing. His several related works have been published Science, Briefings in Bioinformatics, Bioinformatics, and the IEEE/ACM TRANSACTIONS ON COMPUTATIONAL BIOLOGY AND BIOINFORMATICS. Google scholar showed that his more than 100 papers have been cited more than 5000 times. He is the Editor-in-Chief of Current Bioinformatics. He is an Associate Editor of IEEE ACCESS and an Editorial Board Member of Computers in Biology and Medicine, Genes, and Scientific Reports. He was selected as one of the Clarivate Analytics Highly Cited Researchers, in 2018. VOLUME 7, 2019 "}]