[{"section_title": "Abstract", "text": "Nonetheless, a more comprehensive evidence base is needed to support this theory and to inform policies and practices for HAI in education settings, activities, and interventions."}, {"section_title": "", "text": "The involvement of animals in education has become almost commonplace in many developed nations. In any preschool or elementary classroom in the United States and around the world, one is likely to see live animals (fish, gerbils, or reptiles), or images of animals, incorporated into lessons and activities. In fact, it is probably more challenging to find educational materials that do not include animals. Educators include live animals in classroom curricula in many creative and flexible ways: resident classroom animals, family pet visits, brief interactions with an animal accompanied by a volunteer or professional animal handler (including domesticated or nondomesticated species), and field trips to farms, zoos, aquariums, and animal theme parks (Gee, 2011) . The popularity of such activities is seen in the numerous publications for teachers on how to incorporate innovative lessons involving live animals into curricula (e.g., Anderson, 2007) .\nIt is remarkable, therefore, that there is not a more robust evidence base on the extent and nature of human-animal interaction (HAI) activities in schools and the benefits and risks of having animals in education settings. Limited research has addressed the prevalence of animals in classrooms. Uttley (2013) found that nearly two thirds of 1,400 accredited early childhood programs reported having animals in classrooms. Rud and Beck (2003) reported that 25% of elementary school teachers surveyed had a classroom animal, and nearly half of those who did not had allowed students to bring animals to class on special occasions. An online survey by the American Humane Association (2015) revealed that among 1,311 respondents, the most common classroom animals were fish (31%), guinea pigs (13.7%), and hamsters (10.5%); others included bearded dragons, hermit crabs, rabbits, and other unusual species. Although several large surveys have included information on HAI, few have addressed education settings. The only federal survey in the United States to document HAI in school-based settings found that 28% of school administrators reported using \"random dog sniffs to check for drugs\" (U.S. Department of Education, 2013) , hardly what most people think of when they envision HAI in schools. In order to better understand the extent and nature of the use of service 2 dogs in U.S. special education classrooms, the National Center for Education Statistics (NCES) included a question on its fourth-and fifth-grade special education teacher questionnaires as part of the Early Childhood Longitudinal Study, Kindergarten Class of 2010-11 (U.S. Department of Education, 2015) ; data are planned to be released in 2017 and 2018.\nDespite the prevalence of the practice, many schools/districts have policies strictly forbidding animals in classrooms, whereas others specify which animals may be brought to school and under what conditions. Policies regarding inclusion of live animals for educational purposes can be quite confusing (Huss, 2017a) . The inclusion of service animals in classrooms has increased as their involvement has expanded beyond traditional roles of supporting those with visual or hearing impairment to include supporting students with a range of disabilities (e.g., seizures, diabetes, autism, or emotional disorders), although the policies governing their access to education settings is often unclear (Huss, 2017b) .\nThe importance of animals in children's lives is well recognized (Beck, 2011; Melson, Schwartz, & Beck, 1997) , and educators have astutely incorporated them to engage students' interest and attention (Gee, 2011) . Hummel and Randler (2012) cite as conventional wisdom that the inclusion of living animals (compared to photos or videos of animals), particularly in science education, motivates and fosters deeper learning. Educators also include live animals to address student educational and developmental needs (Uttley, 2013) , such as learning turn-taking, developing empathy, and taking responsibility. Human interest and media attention highlight the possibility of a special humananimal connection that may offer unique learning opportunities to children (e.g., Daniels, 2015; Hoffman, 2015) . Thus, it is critical to examine the efficacy of these practices, especially when involving vulnerable populations.\nTo date, there has been no widely accepted overarching theoretical framework guiding research on HAI; this is not unusual given the interdisciplinarity of the field, which cuts across typical child development, aging, daily activities, and targeted interventions. In fact, Kazdin (2017) advocated explicit \"small theories\" regarding how and why interactions with animals might positively influence the health and well-being of humans, which would also, he argued, provide important information to guide practice, given that one should learn which processes are important for differing types of animal-assisted interventions (AAI).\n1 To accomplish this, the field must consider the heterogeneities of intervention approaches and build toward larger, more encompassing theories where possible; at the same time, we must as a field carefully attend to the numerous methodological challenges that have plagued previous research (Kazdin, 2017) .\nThe goal of this paper is to provide an overview of recent HAI research (including systematic reviews, meta-analyses, and edited volumes), either directly addressing or relevant to the inclusion of animals in school settings, from which we draw support for a model (see Figure 1 ) of how we believe HAI activities can impact learning. We examine the rationale that HAI practices may have important developmental implications, underlining the need to build a more extensive and robust evidence base to guide policy and practice related to HAI activities in general and special education classrooms. We address existing theoretical approaches, then examine how they have been used or are embedded in some recent work. We do this first in studies in which HAIs or AAIs directly affect children's social and emotional development, then in studies in which HAIs/AAIs directly affect motivation, attention, engagement, and self-efficacy with additional indirect effects on learning. We base our perspective on Kazdin's (2017) small theory approach.\nWe have found evidence of Kazdin's (2017) small theory approach in HAI research. That is, various researchers have been studying AAI within specific existing theoretical frameworks, building their own small theories for HAI effects. To date, the examples of theories guiding HAI research, especially for studies of children (discussed and cited in the following sections), involve social development, motivation, and learning theory (which of necessity incorporates cognition, emotion, and environmental influences), all of which appear well suited for integration into the unified framework we propose (graphically illustrated in Figure 1 ): HAI indirectly affects learning by directly affecting or enhancing children's motivation, engagement, and aspects of executive function (EF; attention, self-regulation, etc.) and social interaction. That is, HAI, and in particular, targeted AAIs, affect aspects of children's social, emotional, and cognitive development by promoting interaction, in some cases first with animals and then, within appropriately guided activities and structured situations, with humans. These HAIs can also or at the same time have an indirect effect on learning by increasing motivation and self-efficacy and enhancing engagement/attention and EFs for the activities in which the interaction with animals is embedded. This theoretical framework (Figure 1 ) is based on examples of existing research, which are overviewed in the following sections."}, {"section_title": "Research on HAI", "text": "Research on HAI has increased over the past decade. A 1987 conference, The Health Benefits of Pets, held by the National Institutes of Health (NIH), included a call for research on the influence of pets in child development and their potential social and therapeutic effects. Nonetheless, a workshop held two decades later still noted the need for such research; that workshop, sponsored by a public-private partnership established in 2008 between the NIH's Eunice Kennedy Shriver National Institute of Child Health and 3 Human Development (NICHD) and the WALTHAM Centre for Pet Nutrition, a division of Mars, Inc., also led to the formation of a research program at the NICHD (Esposito, McCune, Griffin, & Maholmes, 2011) . Since then, there have been three research solicitations and the NIH has funded 21 grants on HAI, including several that are relevant to the inclusion of animals in education settings. Just a few examples include two studies of the impact of child-horse interventions (one with typical students and one with students who have Autism Spectrum Disorder [ASD]), studies addressing the nature of the child-animal bond (the childdog bond in general and in forensic child abuse interviews, the impact of pets on the psychological development of young children, and two studies of HAI/AAI with children with ASD), a controlled study of the inclusion of dogs in psychotherapy for individuals with attention-deficit/hyperactivity disorder (ADHD), an intervention study of shelter dog training by adjudicated youth, and studies of health impacts (a study of zoonosis transmission between household pets and children and a study on asthma). Several of the studies funded have already resulted in peer-reviewed publications, some of which are among those cited in this overview.\nA recent systematic review of this literature used the Oxford Centre for Evidence-Based Medicine Levels of Evidence to rank the evidence quality of 25 papers (Brelsfored, Meints, Gee, & Pfeffer, 2017) . Most (n = 21) received a Level 2 classification (randomized trial or observational study with dramatic effect), and the remaining studies (n = 4) ranked at Level 4 (case series, case-control study, or historically controlled study). The following subtopics address research on HAI and AAI within the framework of our theory that such activities affect social and emotional development by promoting interaction (in some cases first with animals and then, under appropriately guided activities and structured situations, with humans) and influence learning by increasing motivation for the activities in which the interaction with animals is embedded. In addition, a recent edited volume (Gee, Fine, & McCardle, 2017) contains summaries of several studies of HAI and AAI in education settings, demonstrating such effects."}, {"section_title": "Social and Emotional Development", "text": "Because of the inherently social nature of HAI, there are clear implications for research on how animals may facilitate social interaction. For example, Melson (2003) suggests that companion animals might stimulate a young child's cognitive growth through curiosity and learning while also providing a source of emotional support. A child's interactions with animals are carried out not in a social vacuum but, rather, as part of a larger social network of interactions; pets can be a catalyst for social engagement and cohesiveness in larger social settings, such as classrooms, schools, and neighborhoods. Animals in classroom settings may facilitate peer social interactions, including for children with social skill deficits associated with developmental disorders, such as ASD. O'Haire, McKenzie, Beck, and Slaughter (2013) demonstrated 43% reduced skin conductance responses in students with ASD when animals were present, indicating that the animals may act as social buffers.\nResearch on stress management and stress buffering offers a view of possible mechanisms in promoting and facilitating social-emotional development. Friedmann and colleagues (Chapa et al., 2014; Engel, 1981; Friedmann, Barker, & Allen, 2011 ) discuss a biopsychosocial model to explain how animals might influence human physiological responses to stress, emphasizing the dynamic interaction of biological, psychological, and social domains and how these influence the immune system (see also Segerstrom & Miller, 2004) . In addition, an edited volume on the social neuroscience of HAI (Freund, McCune, Esposito, Gee, & McCardle, 2016) presents information on potential neurological mechanisms that explain how HAI could reduce stress, including the role that hormones play in social behavior and emotion regulation (Carter & Porges, 2016) and empathy and psychopathology (Lozier, Brethel-Haurwitz, & Marsh, 2016 Thus, the general investigation into neural mechanisms of HAI has begun.\nIncreased stress exposure and lack of personal stress management skills have been implicated in academic failure (Grant et al., 2014) . Several studies indicate an animal's presence can buffer or moderate physiological responses to stress (e.g., review by Friedmann & Son, 2009 ). Salivary cortisol is one biological measure that can be used in addition to behavioral measures in such studies. (For information about the role of salivary bioscience applied to HAI, see Dreschel & Granger, 2016.) Elevated \"exam stress\" (measured via salivary cortisol) has been associated with poor academic performance in a small cohort of graduate students (Ng, Koh, & Chia, 2003) ; the fact that animal-assisted educational activities have recently become popular in university settings (Reynolds & Rabschutz, 2011 ) also creates opportunities to study AAIs outside the laboratory, such as in situations where exam stress occurs. Dogs are visiting libraries and residence halls as an adjunct to counseling services and as part of stress-and anxiety-reduction programs during final examinations week. Researchers are investigating the efficacy of such programs, but there is as yet no causal evidence with college students. However, did demonstrate that participation in an after-school equine-facilitated program causally affected students' diurnal cortisol functioning; randomly assigned 10-to 14-year-old students demonstrated reduced average daily levels and lower afternoon levels of cortisol after participating in this 11-week program.\nAlthough the goal of AAIs with stressed college students is to reduce stress, these interventions may work differently with different populations. For younger children, for example, the presence of an animal may stimulate arousal. Children with ADHD who held a dog showed significantly increased heart rate and blood pressure 5 minutes after the interaction (Somervill, Swanson, Robertson, Arnett, & MacLin, 2009 ). Stimulants are a common ADHD treatment, so it could be argued that increased arousal in these cases may be beneficial. In a 12-week behavioral intervention, children with ADHD were randomly assigned to group therapy; one group received usual therapy and one canineassisted intervention (CAI; Schuck, Emmerson, Fine, & Lakes, 2015) . In both groups, the severity of ADHD symptoms declined, but those children who received CAI had a significantly greater reduction in ADHD symptoms. Schuck and Fine (2017) summarized the findings on AAIs for children with EF deficits, including ADHD, concluding that there were three specific benefits of AAIs for these children: reduced stress in learning, cognitive arousal that can prime students for optimal learning, and enhancement of social skills training programs. They note that outcomes seem to be dependent upon targeting specific student characteristics. It is important to consider the circumstances under which stress reduction or arousal may be the preferred outcome.\nAAIs could, if properly targeted to specific populations, be used to advantage in either situation. Clearly, more research is needed to identify specific circumstances, populations, and tasks to guide such treatments and assess their efficacy. Pendry, Carr, and Vandagriff (2017) examine the impact of CAIs and equine-assisted interventions within the theoretical framework of the social development model of Catalano and Hawkins (1996) . (Catalano and Hawkins, 1996 , hypothesized that both pro-and antisocial behaviors arise out of similar developmental processes and depend on risk and protective factors present in a child's life.) From the literature on their own research and that of others, Pendry and colleagues reported overall positive effects for equine-assisted interventions. First, correlational work showed that equine AAI was associated with lower levels of externalizing and internalizing problem behaviors than was classroom-based counseling (Trotter, Chandler, Goodwin-Bond, & Casey, 2008) . A randomized controlled trial (RCT) of a 5-week equine AAI for academically atrisk adolescents showed improved feelings of hope (Frederick, Ivey Hatz, & Lanning, 2015) . Finally, Pendry and colleagues' RCT of an 11-week equine AAI showed positive changes in social competence and reduced negative behaviors in the treatment group (Pendry & Roeter, 2013; Pendry, Car, Smith, & Roeter, 2014; as well as significantly reduced levels of the stress hormone cortisol (d = 0.46; . Canine AAIs have also been shown in an RCT to reduce aggression in the treatment group, although teachers reported that in both groups all children showed increased social behaviors and empathy (Tissen, Hergovich, & Spielg, 2007) . There were also studies showing that having a classroom dog for 3 months increased empathy in children (Hergovich, Monshi, Semmler, & Zieglmayer, 2002; Kotrschal & Ortbauer, 2003) and that weekly dog visits improved student attitudes toward school attendance and learning (Beetz, 2013) . All of these results show effects on social-emotional processes; although data on learning outcomes were not collected, it is logical to expect that there could be an impact on learning."}, {"section_title": "Motivation, Engagement, and Learning", "text": "Some researchers have situated AAI within theories of motivation and learning. For example, Olbrich (2009) and Wohlfarth, Mutschler, Beetz, Kreuser, and Korsten-Reck (2013) argue that animals influence intrinsic motivation, in which people engage in the activity for its own sake. They propose that implicit motives are increased by the animal, which results in a measurable increase in task performance. Schuck and Fine (2017) noted that classroom AAIs targeting self-regulation and reduced hyperactivity may work through both priming mental arousal and eliciting greater engagement and motivation."}, {"section_title": "5", "text": "One program in which canine-assisted activities have become popular in schools is reading to dogs. Mastering reading is essential to school success; failure to learn to read limits lifetime options in education and careers. Indeed, failure to learn to read has a huge worldwide cost both monetarily (estimated at over US$1 trillion; Cree, Kay, & Steward, 2012) and in health, family well-being, and labor force opportunities (Martinez & Fernandez, 2010 ; Organisation for Economic Co-operation and Development [OECD], 2010). Although several U.S. summary research reports address the solid evidence base that has existed for some years for reading instruction (see McCardle, Chhabra, & Kapinus, 2008 , for brief summaries), reading continues to be a focus of needed education improvement nationally and internationally (OECD, 2010) . Student engagement, guided practice, and motivation are elements that must be addressed in reading instruction (Biancarosa & Snow, 2004) .\nRecognizing this need to promote literacy and the value of engagement and motivation, some educators have advocated reading-to-dogs programs, popular in several nations (Australia, German, Japan, Spain, United Kingdom, and United States). These programs aim to improve reading by providing practice opportunities, possibly affecting student engagement, motivation, and self-efficacy. A recent systematic review suggests these programs may positively affect various behavioral processes leading to improved reading (Hall, Gee, & Mills, 2016) . Although only nine of the 50 relevant research reports found were peer-reviewed publications with original results, one RCT did demonstrate improvements in standardized reading scores for poor readers. Thus, although promising, the preponderance of the evidence base is not strong. More rigorous research is needed with larger samples, various reading abilities, appropriate controls, and contextual information (types of instruction received, any additional reading programs co-occurring, and whether feedback or guidance was provided during practice) to determine the value of these programs both directly to improve reading and indirectly to improve reading/learning through greater motivation and self-efficacy. It would be interesting to know whether there are specific profiles of readers who might benefit from certain types of reading practice programs involving dogs.\nIn a series of small (Ns < 30) randomized crossover studies (summarized in Gee, Fine, & Schuck, 2015) , preschool children performed cognitive tasks in the presence of a dog. Many of these children exhibited immediate improvements in recognition memory, categorization of animate objects, and adherence to instructions, and made fewer errors in a categorization task, compared to their own performance in the presence of a similar stuffed toy dog or human (effect sizes ranged from medium to large). Similarly, a randomized crossover study (N = 24) comparing the effect of presence of a real versus a robotic dog found that memory and neuropsychological attention performance (frontal brain activity, recorded by passive infrared hemoencephalograpy) for 10-to 14-year-old children were significantly enhanced in the real-dog condition (Hediger & Turner, 2014) . Despite small samples, these controlled laboratory studies assessed aspects of cognition related to learning and academic performance and indicated that the presence of a dog may enhance learning in classroom settings. Results are sufficiently provocative to stimulate larger studies to replicate these findings and explore potential mechanisms.\nTwo studies (effects sizes ranging from medium to large) address the effect of animals on children's physical activity related to learning. Gee, Harris, and Johnson (2007) found that preschool children performed a set of gross-motor-skills tasks faster without sacrificing accuracy in the presence (vs. absence) of a dog. Preschoolers asked to perform a task as modeled by a live dog, similar stuffed toy dog, or human were significantly more likely to adhere to instructions with the live dog as model (Gee, Sherlock, Bennett, & Harris, 2009) . Again, findings arouse sufficient interest to warrant larger replications and some deeper exploration; the animals may directly affect motivation and engagement, in turn indirectly affecting learning.\nEF. Several research teams (Blair & Raver, 2015; Graziano, Reavis, Keane, & Calkins, 2007; Shields et al., 2001 ) have examined or recommend examining HAI from the lens of developmental theories addressing EF and self-regulation. How well students learn in school is impacted by their level of EF skills and motivation. Although there is no single accepted definition of EF (Griffin, Fruend, McCardle, DelCarmen-Wiggins, & Haydon, 2016) , it is self-evident that success in school requires creativity, flexibility, self-control, and discipline. These invoke core EF skills, including mentally playing with ideas, giving a considered rather than an impulsive response, and being able to change course or perspective, resist distractions, and stay focused (Diamond, 2016) . EF skills are critical for cognitive, social, and psychological development as well as success in school (and life); they begin to emerge in infancy but are not fully mature until young adulthood. So-called \"hot\" EF skills are associated with learning involving motivators or feelings (e.g., rewards or punishment), whereas \"cold\" EF skills tend to be associated with rote learning and logic problems (e.g., memorization or mental puzzles; Diamond, 2016) . Although few HAI studies have explicitly examined EF as an outcome measure, there are some promising results suggesting that AAIs may positively impact EF skills in children with autism (Borgi et al., 2016) and ADHD (Schuck et al., 2015) . Ling, Kelly, and Diamond (2016) propose extending Diamond's (2012 Diamond's ( , 2013 model for programs and interventions to improve EFs in young children to education settings, using activities that require EF skills but also present direct challenges. They outline characteristics of EF interventions that are particularly amenable to AAI: the need for practice 6 (and for sustaining practice over time) and for progressively increasing the level of challenge in tasks children enjoy. The resulting increase in practice time, coupled with an increased ability to tolerate (and even enjoy) gradual increases in the difficulty level of fun activities, may result in decreased stress levels and increased social belongingness in students. Rajan, Gee, Golinkoff, and Hirsch-Pasek (2017) discuss how play and self-regulation serve as keys to school readiness in preschoolers and how the inclusion of HAI in play-based activities could influence the development of self-regulation. They see HAI as potentially indirectly influencing self-regulation through mechanisms such as stress regulation, promotion of social behaviors, calmness, and reduced fear and anxiety (citing a review by Beetz, Unvas-Moberg, Julius, & Kotrschal, 2012 , and research by Hergovich et al., 2002) . Given research indicating that physical activity can affect cognitive development and learning, specifically EF (Tomporowski, Davis, Miller, & Naglieri, 2008) , Rajan and colleagues further speculate that HAI activities that promote physical activity may also be an indirect path for HAI to influence preschool self-regulation and learning."}, {"section_title": "Field-Building Essentials", "text": "Linking \"small theories\" (e.g., of emotion regulation, self-control, motivation, or learning) to both behavioral and physiological development is important. It is likely that these small theories (as recommended by Kazdin, 2017) can be blended into larger, more overarching theories as the research progresses. We have tried to do that, in some measure, in this summary. In addition to having a theory in mind, there are other key elements that must be part of field building in HAI research (Griffin, McCune, Maholmes, & Hurley, 2011) . Research designs and methods must be rigorous, a trend the HAI field currently embraces. Further, to build a solid evidence base, replications are important; the field would surely not advocate for wider adoption of practices based on single studies or studies of only one setting or population. Another key issue is measurement: Researchers are encouraged to use standardized measures where possible and to share measures across studies to enable better crossstudy and meta-analytic analyses. Including larger numbers of subjects is also important and can be difficult for various reasons, not the least of which is funding. Therefore, we should also consider examining extant data sets from large national studies that may include relevant (animal-related) questions and adding questions to new studies being planned. Because future studies may depend on the establishment of effective collaborations with researchers in other fields, and with educators and school systems, consideration of mutual benefit and scope of application are also essential.\nResearch in schools involves many challenges, especially when animals are involved. Researchers must consider local and national polices and regulations, consider human and animal safety and welfare, and be prepared to present a strong rationale for the research. We must guard against individual biases. Because many HAI researchers are in the field in part due to personal affinity for animals, it is important to safeguard objectivity, to implement blinding whenever possible, and to work not to prove that AAIs are effective but to learn whether they work and, if so, why and how."}, {"section_title": "Conclusions and Future Research", "text": "There are several research questions we could pose regarding animals and education-in both translational (what is effective and can be reliably put into practice) and basic science research (mechanisms through which AAIs might affect learning or classroom behavior). One fundamental question that the field may not be able to answer is why so little HAI research is conducted by education researchers and published by education journals. It is certainly not for lack of topics relevant to teachers, school administrators, parents, and the students themselves. Some example questions are these: Are there optimal ages and grade levels at which certain types of AAIs might have the most beneficial effects? How might they vary by setting (urban/suburban/rural), demographic characteristics (socioeconomic status, race-ethnicity) and student composition (general classroom/self-contained special education classroom)? As social-emotional learning programs are becoming more prevalent in preschool and elementary classrooms, what role could animals play in these? Under what circumstances might it be optimal to include animals in mental health counseling, grief counseling, or special education programs? As the term HAI emphasizes the interaction between humans and animals, it would seem evident that a study of the elements of that interaction are also an important focus of potential research-what might we learn about the logistics and quality of the interaction that might alter the outcomes of AAIs (McCune et al., 2014 (McCune et al., , 2015 ?\nGiven our own theory that HAI activities can impact social-emotional development and learning, as depicted in Figure 1 , through four possible pathways, we would also urge researchers to design studies to challenge or confirm this model. We address this broadly, but when examining specific tasks and their impacts on specific learning outcomes, whether effects are direct and/or indirect and what may moderate them will likely vary. That is, when examining the impact of HAI on children's social interactions, emotional responses, and so forth, we hope researchers will take the next step and include specific learning outcomes in pre-and posttest measures. Control for those factors that could be confounders, and measure/record those variables that cannot be controlled. Build new models or modified versions of the model presented here, and use these models to design studies, addressing some of the above questions to help build evidence-based practices for HAI in education.\nFinally, we must inform policy. Given the current ubiquity of programs including animals in education settings, 7 policies will doubtless be proposed where they do not currently exist, and policies excluding animals may be challenged as more children seek to have their service animals in school or as teachers attempt to enhance classrooms with the inclusion of animals. To address these issues, policymakers would ideally look to evidence. If they do not, they should. But if we as a field have insufficient evidence to provide, we have not done our best! Animals are part of the fabric of life in many countries and are becoming a part of the educational lives of many children. Therefore, we need a better understanding of whether, when, and how the inclusion of animals in education is effective while assuring the welfare and wellbeing of both the animal and the student.\n8"}]