[{"section_title": "", "text": "International large-scale-assessments (LSA) studies of student achievement have been undertaken for some 60 years (Foshay, Thorndike, Hotyat, & Walker, 1962) . Over time, these studies have had a significant impact on educational policy in aspects such as curriculum reforms, educational standards, and educational budget decisions, among other educational initiatives (Grek, 2009; Rutkowski & Rutkowski, 2010; Schwippert, 2007; Schwippert & Lenkeit, 2012) . Their influential role in shaping educational policy is reflected by the continued emergence of international assessment studies in different regions, thematic areas, and for different target populations (Rochex, 2006) . In addition to the well-established TIMSS, Trends in International Mathematics and Science Study; PIRLS, Progress in International Reading Literacy Study; and PISA, Programme for International Student Assessment; some newer regional or language-focused initiatives are being now carried out in Southern and Eastern Africa (SACMEQ), Latin America (UNESCO-LLECE), and French-speaking countries (PASEC). At risk of oversimplifying, the common goals of international LSAs are to measure and compare academic achievement outcomes of students through the administration of achievement tests, as well as to identify student, family, school, and community factors associated with student outcomes through a set of background questionnaires. The main assumption being that assessing and comparing education systems is the primary way to increase their effectiveness.\nDespite the important role LSAs have had in advancing our understanding about factors associated to student outcomes and the influence this kind of studies have had on informing public policy around the world, significant criticisms regarding their theoretical, methodological, and policy commitments have fuelled a prolific debate about its boundaries and potentials. Both promoters (e.g., Teddlie & Reynolds, 2001 ) and detractors (e.g. Rochex, 2006; Slee, Weiner, & Tomlinson, 1998) of the use of international surveys concur that there is a lack of theory in the research program. These criticisms can be tracked down to the building blocks at the basis of the architecture of the theories subscribed by LSA research. On the one hand they refer to the epistemological rationale behind the selection, operationalization, and explanation of the relationships among constructs (name deleted to maintain the integrity of the review process); and on the other to the rather simplistic ontology that underpins the fundamental assumptions of LSA research regarding the nature of schools, students, and teachers (Thrupp, 1999; Wrigley, 2004) .\nAuthors like Coe and Fitz-Gibbon (1998) and Lauder, Jamieson, and Wikeley (1998) claim that in LSA research the decisions on what constructs are to be included in the surveys and its subsequent operationalization tends to relay on no more than common sense and statistical criteria, without considering the theories available in education and other disciplines. Following on these lines, Lauder and colleagues (op cit.) argue that the procedure used by LSA researchers to generate concepts like 'socioeconomic status' (SES) or 'school climate' is simply operationalize these concepts with a battery of items which when combined 'ad up' to proxy measures (name deleted to maintain the integrity of the review process). If they then turn to report significant coefficients in statistical models, they are regarded as important factors for improving education systems. A further problem of this kind of practice is that the battery of items used for operationalizating such concepts varies considerably in its content from one study to other, making it very difficult to accumulate the knowledge that would allow for theory construction (Chudgar, Luschei, Fagioli, & Lee, 2012) .\nA related criticism concerns the 'fishing for correlations' practice of testing for statistical relationships between particular constructs (e.g. SES or school climate) and student outcomes, without fully understanding why or how it is expected these two constructs to be related (Coe & Fitz-Gibbon, 1998) . In addition, this kind of practices are normally coupled with causal interpretations of findings that follow a simple linear logic (e.g. more of this is associated to more of that). Such practices oversimplify the complex nature of educational systems in which educational outcomes result from interactions and interrelated decisions of different educational actors (i.e., school staff, children, parents, etc.) (Murnane & Willett, 2011; Rochex, 2006) . From this perspective, we can claim to have gained great knowledge about the factors related to school effectiveness and yet, we know little about the mechanisms at work. As Murillo summarizes \"… it can be said that we are beginning to know some things about what works in education, but the ignorance about why it works is still very important\" (Murillo et al., 2007, p. 86) .\nFurthermore, the epistemological rationale of LSA research presupposes a particular social ontology that has also been questioned. Here, the criticisms concern what authors like Willmott (1999) termed as 'a depthless ontology', whereby what is 'real' is only what can be observed and measured; and educational actors are assumed to respond passively to incentives and sanctions of the system. These assumptions may not be adequate for the study of educational problems since, first, they ignore the agency of the actors (name deleted to maintain the integrity of the review process) and the context in which they are embedded (Thrupp, 2001) ; and second, because in essence, this perspective reduces scientific knowledge to what amounts to a description and/or prediction rather than a true explanation of social patterns (Layder, 1990) .\nMethodologically, construct development in LSA data has been limited by available techniques for theory generating and theory testing: exploratory factor analysis (EFA) and confirmatory factor analysis (CFA). EFA makes it possible to examine the factor structure of construct items but not to test the invariance of constructs across countries. CFA allows for invariance tests, but often yields inflated interfactor correlations and model fit indices that fail to support constructs with well-defined EFA structures. This results, at least in part, from the overly restrictive assumption of CFA that construct items can load on a single factor only, that is, crossloadings are fixed to zero (Marsh, Liem, Martin, Morin, & Nagengast, 2011) . The inflated interfactor correlations cast doubt about the differential validity of constructs and potentially introduce multicollinearity into models where the constructs are considered as predictors, distorting parameter estimates and obscuring the predicting ability of constructs (Marsh et al., 2011) . Poor model fit drives researchers to modify CFA models in a process that seems more exploratory than confirmatory in nature.\nRecently, the introduction of exploratory structural equation models (ESEM) has contributed to overcome some of the limitations of EFA and CFA (Marsh et al., 2009) . ESEM integrates the statistical properties of EFA and CFA. Essentially, ESEM is an EFA model that provides standard errors, model fit indices, and measurement invariance tests. Whenever CFA yields lower goodness-of-fit indices and higher interfactor correlations than ESEM, ESEM is preferred. ESEM has already been applied in psychological research to evaluate multidimensional models of university teaching (Marsh et al., 2009) ; personality trait domains (Marsh et al., 2010; Rosellini & Brown, 2011 ) and how they vary across different survey conditions (e.g., telephone interviewing, face-to-face surveys, and self-administrated questionnaire) (Lang, John, Lüdtke, Schupp, & Wagner, 2011) ; motivation and engagement (Marsh et al., 2011) ; and post-traumatic stress disorders in the military after deployment (van Zuiden et al., 2011) . To our knowledge, however, ESEM has not been yet applied to evaluate sociological constructs in international LSA data."}, {"section_title": "Purpose and Contribution", "text": "This paper applies ESEM to evaluate constructs of cultural, economic, and social capital in international LSA data from PIRLS 2006 and PISA 2009. The constructs are inspired in wellestablished theories by Bourdieu and Passeron (1977) , Bernstein (1975), and Coleman (1988) and represent attempts to apply these complex theories in empirical studies. Factor structure of constructs is examined, assessing and comparing fit indices of CFA and ESEM models, and testing for different levels of construct invariance across countries. The analyses represent an initial effort aimed at addressing some of the criticisms leveled at the theoretical underpinnings of international LSA studies. The paper aims to contribute to the literature in several respects.\nFirst, it lays the foundation for the study of the mechanisms whereby families influence academic achievement. Previous research using SES indicators or single family background variables has been unable to explain the mechanisms at work for associations. Our theory informed analyses could provide researchers with a framework for studying 'how' family processes relate to student outcomes, and policy makers with sounder bases for designing interventions. Second, the paper helps detach the analysis and interpretation of statistical results from the simple linear logic attributed to traditional LSA research. Unlike the standard CFA model, the ESEM allows for construct items to load simultaneously on various constructs. In our empirical model, for example, the variable 'number of books' can load on both cultural capital and economic capital, reflecting more precisely the complexities of existing theoretical models (see Bourdieu, 1983) . Fourth, the analysis of measurement invariance evaluates the validity of constructs across countries and offers researchers benchmarks for the possibilities of comparing results in analysis involving several countries."}, {"section_title": "Theoretical Framework", "text": "The literature is clear about the importance of cultural, social and economic capital constructs to student performance. How these constructs are defined and operationalized depends on the theoretical approach and the specific contexts. But the theories by Bourdieu and Passeron (1977) , Bernstein (1975), and Coleman (1988) are usually regarded as a useful framework to delineate these concepts.\nBourdieu defines capital as \"…accumulated labour (in its materialised form or its 'incorporated', embodied form) which, when appropriated on a private, i.e., exclusive basis by agents or groups of agents, enables them to appropriate social energy in the form of reified or living labour\" (Bourdieu, 1983, p. 241) . The educational performance of students depends on the amount and composition of different forms of capital and on the extent to which these satisfy the symbolic requisites of the dominant culture legitimated by the education system (Bourdieu & Passeron, 1977) . Bourdieu distinguishes between several types of capital. The concepts of cultural and economic capital are especially relevant for this work.\nCultural capital reflects the cultural long-lasting dispositions embedded in the human mind and body, as well as in cultural goods and educational credentials. It can appear in three states (Bourdieu, 1983) : objectified, institutionalized and embodied. In its objectified state, cultural capital consists of cultural objects, such as pictures, books, didactic materials, instruments and machines such as a PC, or even the access to Internet. In its institutionalized state, cultural capital consists of educational credentials such as academic degrees held by parents. In its embodied form, cultural capital consists of permanent dispositions acquired and inherited through family socialization that are reflected in the access to cultural practices legitimated by the dominant culture (e.g., theatre, museum exhibitions, music concerts), the production of legitimate signals (e.g., a specific linguistic code), and the value attached to education (e.g., the amount of time spent reading for pleasure or academic aspirations). Bernstein (1971) argued that the linguistic codes associated with parental occupational status reflected different forms of embodied cultural capital. He distinguished between restricted linguistic codes used by working class families and elaborated codes in middle-class families.\nDifferences in the use of linguistic codes help explain achievement inequality. In particular, since schools are concerned with the introduction of new knowledge beyond existing shared meanings (Atherton, 2011) , students who can handle an elaborated code (i.e., middle-class students) are more susceptible of performing better in the education system. For students who only have restrictive codes at their disposal (i.e., students from disadvantaged contexts) it would be more difficult to interpret and produce the symbols legitimized in an education system thought for and by the dominant middle class (Blanco, 2007) .\nEconomic capital is defined as the command students have over economic resources. This concept is commonly understood as exchange values, like income and assets that can be easily transformed into cash. Variables referring to the possession of consumer goods in the household are indicators of a family's economic capital, for example. Also, parental education and occupational status are usually regarded as resources that can be transformed into income. It is assumed that the greater the economic capital in a family the better the physical conditions supporting the cognitive development of its family members, and therefore the higher their educational attainment.\nTheories by Bourdieu and Passeron (1977) and Bernstein (1971) have with no doubt extended our understanding of how cultural and economic resources are passed from parents on to children. But the deterministic nature of these so-called reproduction theories has prevented researchers from explaining some unusual patterns, such as academic resilience. And alternative explanations are offered when we consider social capital (e.g., Coleman, 1988) and rational action theory (e.g., Boudon, 1981) , for example. We will use Coleman (1988) to frame the concept of social capital.\nAccording to Coleman (1988) social capital is a resource that facilitates action. This concept takes rational action theory as a starting point, but rejects the extreme individualistic premises that often accompany it by taking account of the social structure. The link between reproduction theories and social capital is represented by those aspects of the social structure that can be used by actors as resources to achieve their interests, and by the decisions actors make regarding the use of these resources. Along these lines, social capital is represented by the relationships among the family members that enhance the transmission of other structural resources like the parent's education, for example. Financial status. In PIRLS, parents' perception of the family financial situation."}, {"section_title": "Method", "text": "Responses categories are: 1 \"not at all well-off\", 2 \"not very well-off\", 3 \"average\", 4 \"somewhat well-off\", and 5 \"very well-off\".\nChildren's own room. In PIRLS, a dichotomous indicator of own room possession (1 \"yes\", 0 \"no\").\nHousehold overcrowding. In PISA, the proportion of household members to the number of rooms in the home."}, {"section_title": "Cultural Capital (F2)", "text": "Books at home. In PIRLS and PISA, the number of books at home excluding school related books. Response categories are 1-5 in PIRLS (1 \"0-10 books\", 2 \"11-25 books\", 3 \"26-100 books\", 4 \"101-200 books\", and 5 \"more than 200 books\") and 1-6 in PISA (1 \"0-10 books\", 2 \"11-25 books\", 3 \"26-100 books\", 4 \"101-200 books\", 5 \"201-500 books\", and 6 \"more than 500 books\").\nChildren's books. In PIRLS, the number of children's books. Response categories are same as above (1-5).\nParental attitudes toward reading. In PIRLS, the index of parents' attitudes toward reading. Responses categories are: 1 \"low\", 2 \"medium\", and 3 \"high\".\nParents' read for enjoyment. In PIRLS, the frequency parents read for enjoyment.\nResponses categories are: 1 \"never or almost never\", 2 \"once or twice a month\", and 3 \"once or twice a week\", and 4 \"every day or almost every day\".\nParents' reading time. In PIRLS, the time parents spend reading at home. Responses categories are: 1 \"less than one hour a week\", 2 \"1-5 hours a week\", and 3 \"6-10 hours a week\", and 4 \"more than 10 hours a week\".\nParents reading motivation. In PISA, an index of motivational attributes of parents own reading engagement.\nCultural possessions. In PISA, a summary index reflecting possession of classical literature, books of poetry, and works of art.\nHome educational resources. In PISA, a summary index reflecting possession of a desk to study, a quiet place to study, a computer for school work, educational software, a calculator, books to help with school work, and a dictionary."}, {"section_title": "Social Capital (F3)", "text": "Parents literacy support activities. In PIRLS and PISA, a summary index reflecting the frequency parents and children engaged in the following activities: read books, tell stories, sing songs, play with alphabet toys, talk about things they had done, talk about what they had read, play word games, write letters or words, and read aloud signs and labels.\nParent-child cultural communication. In PIRLS, parents reported the frequency they listened to the child read aloud and talk with the child about what he/she is reading on his/her own (responses categories are: 1 \"never or almost never\", 2 \"once or twice a month\", 3 \"once or twice a week\", and 4 \"every day or almost every day\"). Responses to these 2 items were averaged into a single index."}, {"section_title": "Parent-child communication and interaction.", "text": "In PIRLS, the frequency parents talk to the child about things they have done. In PISA, a summary index of the frequency parents eat with the child around the table and the frequency parents spent time talking to the child."}, {"section_title": "Parent-child academic communication.", "text": "In PIRLS and PISA, a summary index reflecting the frequency of parent-child communication about school related issues. Selected items in PIRLS are frequency of discussion about classroom reading work and the frequency parents helped the child with reading for school. Selected items in PISA are the frequency parents discussed with the child how well he/she was doing at school, the frequency parents talked with the child about what he/she was reading on his/her own, and the frequency parents helped the child with his/her homework.\nParent-child visit library/bookstore. In PIRLS and PISA, the frequency parents visited a library with the child (responses categories are: 1 \"never or almost never\", 2 \"once or twice a month\", 3 \"once or twice a week\", and 4 \"every day or almost every day\")."}, {"section_title": "Parent-child social communication.", "text": "In PISA, a summary index reflecting the frequency parents discussed films and political issues with the child."}, {"section_title": "Analytical Strategy", "text": "First, in unreported analyses we explored the structure of the complete social, cultural, and economic data (i.e., 36 items in PIRLS and 66 items in PISA) for dimensionality by means of traditional scree-plots and eigenvalues. The results yielded more than 3 factors and the interpretability of the rotated solution conveyed of item groups that captured sub-dimensions of theoretical constructs like embodied, objectified and institutionalized cultural capital. In order to achieve a 3 factor solution theoretically meaningful, item groups were summarized into single indexes while trying to maintain approximately the same number of items per factor and dropping items that poorly measured factors. Ultimately, a well-fitting 3-factor solution was obtained with 14 items in PIRLS and 12 items in PISA.\nSecondly, we compared CFA and ESEM models to demonstrate the advantages of ESEM. CFA imposed zero-loading restrictions on factor items, whereas ESEM allowed for items to load on the 3 factors simultaneously. Goodness-of-fit indices, interfactor correlations, and the interpretability of the rotated solution were compared. Goodness-of-fit was evaluated with the comparative fit index (CFI), Tucker-Lewis index (TLI), and root-mean-square error of approximation (RMSEA).\n1 Models were estimated using the geomin rotation with an epsilon value of 0.5 and maximum likelihood estimation robust (MLR) in relation to non-normality and non-independence of observations. Geomin was selected to minimize factor complexity (i.e., smaller cross-factor loadings and larger inter-factor correlations) and make loadings more interpretable."}, {"section_title": "2", "text": "Thirdly, multi-group analysis within the ESEM approach was conducted to evaluate factor and measurement invariance across countries in three steps following Meredith (1964) and Marsh, et al. (2010) . The multi-group analysis is important because the same items and models are employed to reflect our sociological constructs in all the education systems analyzed, but the constructs might not remain constant across education systems. The analysis started by testing configural invariance, that is, the similarity of the overall pattern of parameters across countries with no restriction imposed on the parameters. The configural invariance model without invariance constraints serves as a baseline for comparing subsequent models that do impose equality constraints on the parameter estimates across countries. ."}, {"section_title": "Results", "text": ""}, {"section_title": "ESEM vs CFA", "text": "In applying ESEM we assumed, based on theory, that the latent factors would show significant cross-loadings and that compared to CFA, ESEM would fit the data better and yield lower interfactor correlations, that is, greater discriminant validity. The starting point of our analyses was thus to test whether this assumption holds. If it did not, then there would be no clear purpose for conducting ESEM. Table 1 reports fit indices and Table 2 reports inter-factor correlations for the ESEM and CFA models applied to PIRLS and PISA. The indices in Table 1 for the CFA model did not support an acceptable fit to the data of PIRLS (e.g., TLI = 0.71; CFI = 0.77; RMSEA = 0.07) and PISA (e.g., TLI = 0.83; CFI = 0.87; RMSEA = 0.07). That is, the fit between the theoretical constructs and the empirical model is unsatisfactory according to the CFA specification.\nFurthermore, inter-factor correlations between economic capital and cultural capital for the CFA model (0.73 for PIRLS and 0.68 for PISA) exceeded acceptable levels under factor analysis with oblique rotation (|0.50|; Gorsuch, 1983) . The size of inter-factor correlations was problematic for distinguishing among theoretical constructs or supporting discriminant validity and casted doubts about the zero cross-loading restriction in CFA.\n*** INSERT TABLE 1 ABOUT HERE *** In contrast, ESEM results were acceptable in terms of both fit indices and inter-factor correlations. The ESEM solution (see Table 1 Table 3 ) and 12 items in PISA (see Table 4 ). The selected items loaded significantly and with the expected sign on their corresponding factors. The independent cluster CFA model restricted cross-loading correlations to zero, but the ESEM solution indicated that some items load significantly on more than one factor. For example, the item of parents literacy activities in PIRLS loaded positively and significantly on the social capital factor, as expected by theory, but also loaded significantly on the economic capital and cultural capital factors, though, with a smaller loading size (see Table 3 ). Similarly, the parents reading motivation items in PISA loaded on its theoretical factor of cultural capital, but also on the economic capital and social capital factors (see Table 4 ). And, the parental occupational status item in PISA loaded significantly on the anticipated economic capital factor, but also on the cultural capital factor. *** INSERT TABLES 3 AND 4 ABOUT HERE *** Furthermore, the books at home item and children's books item in PIRLS (see Table 3) loaded greater on the cross-factor of economic capital (0.65 and 0.70, respectively) than on the postulated cultural capital factor (0.27 and 0.16, respectively). Cross-loading correlations for these items were higher than 0.3 and thus complicate the interpretation of the rotated solution (Sass & Schmitt, 2010) . If driven solely by the data, the EFA component of ESEM would advice us to re-specify our CFA to include these items in the economic capital factor and not in the cultural capital factor. But PISA cross-loadings underlined a less complex structure: the crossloading of the number of books item on the economic capital factor amounted to 0.23 and the loading on the theorized cultural capital factor amounted to 0.58 (see Table 4 ). And the reviewed theories offered solid bases for the postulated models. While the CFA model was not respecified, the ESEM approach did reveal that the number of books item is indicative of both economic capital and cultural capital."}, {"section_title": "Multi-Group Analysis", "text": "We then evaluated factor and measurement invariance across educational systems using the ESEM model. The results are reported in Table 5 . The baseline model without invariance constraints supported the configural invariance of our PISA model (TLI = 0.96; CFI = 0.98; RMSEA = 0.04) but could not be estimated for PIRLS. The PISA results indicated that the same model is able to fit the data for each group (educational system) when no constraints across groups are imposed. The model for PIRLS did not converge most likely due to the large number of freely estimated parameters. Note that the number of groups in PIRLS, that is, 42 educational systems, is much larger than the 14 groups in PISA and that ESEM models seem to become unmanageable for larger groups (Marsh et al., 2009 ). Yet, it was possible to conduct subsequent multi-group analyses for both PIRLS and PISA.\nWhen we started to impose constraints across education systems, model fit indices declined substantially (see Table 5 ). For example, the weak invariance model, the one constraining loadings to be invariant across education systems, yielded fit indices far from being acceptable for PIRLS (TLI = 0.55; CFI = 0.58; RMSEA = 0.13) and PISA (TLI = 0.45; CFI = 0.42; RMSEA = 0.14). In other words, there was no support for equivalence of loadings across education systems. This is the most basic level of invariance, which is a precondition for examining more stringent levels of invariance (e.g., strong and strict invariance). It is expected that if a construct does not satisfy weak invariance conditions it also will not satisfy strong and strict invariance conditions that impose even more restrictions on factor parameters across education systems in addition to restricting the factor loadings to be equal across education systems. Accordingly, the fit indices for the strong and strict invariance tests were also far from being acceptable (see Table 5 ).\nBut although factor and measurement invariance was not supported for the total number of education systems when included in combination, there might still be pairs of education systems where invariance conditions are met. As a form of exercise, we performed country-wise tests of weak invariance to identify patterns of invariance across education systems. *** INSERT TABLE 5 ABOUT HERE *** Mainly, the comparisons indicated that loadings were not equivalent for most pairs of education systems. The median values of CFI, TLI, and RMSEA amounted to 0.71, 0.63, and 0.11, respectively (see Table 6 ). Fit indices were not as low as the ones obtained when evaluating weak invariance for the 14 systems simultaneously but still were not acceptable. "}, {"section_title": "Discussion", "text": "International LSA studies using SES indicators have made significant contributions to the study of educational inequality, but are also limited by the formative nature of SES models (name deleted to maintain the integrity of the review process). SES adheres to a formative measurement model because it depends mainly on its operationalization procedure and lacks a solid theoretical meaning (Bollen & Lennox, 1991) . And, as such, its use for explaining the mechanisms for family influences on student performance is unclear. Instead, reflective indicators grounded in well-established theories, like social capital, cultural capital, and economic capital can illuminate the reasons for student performance, but are less frequently used in empirical studies. Methodologically, Principal Component Analysis wherein causality flows from the items into the construct adapts well to the SES formative measurement, whereas EFA and CFA models wherein causality flows from the construct into the items are appropriate for reflective models (name deleted to maintain the integrity of the review process). Recently, ESEM integrated some of the properties of EFA and CFA (Marsh et al., 2009 ).\nThe presented analyses evaluated constructs of cultural, social, and economic capital in the data sets of PIRLS and PISA with ESEM. The constructs were defined and operationalized using influential and complex theories by Bourdieu and Passeron (1977) , Bernstein (1975) , and Coleman (1988) as a conceptual guide. The results suggested that these constructs are reflected in the data sets and that ESEM models are superior to CFA models to evaluate them, as ESEM produced higher model fit indices and reasonable inter-factor correlations. The study of the association of these constructs with student performance could increase our understanding of the mechanisms whereby family background affects schooling outcomes. We therefore believe that the adoption the ESEM approach in educational models deserves the attention of further research.\nThe flexibility of ESEM in terms of model specification is consistent with the constructs concerned. For example, it was expected that cultural possessions would relate to both economic and cultural capital and that parental literacy activities with children would relate to both cultural and social capital. Accordingly, ESEM results indicated that the number of books loads significantly on cultural and economic capital. In fact, in PIRLS, books exerted a greater load on economic capital than on its cultural capital corresponding construct, thereby suggesting that its extensive use as economic capital indicator might be justified. But PISA results indicated that the number of books loading is greater for cultural capital than for economic capital. This is in agreement with the cultural capital theory. And probably as access to Internet and online books increases, books will tend to indicate more cultural capital and less economic capital.\nAlso, as expected from the theory, parents literacy activities proved a good indicator of cultural and social capital. Similarly, parental motivation items loaded simultaneously on these two forms of capital. Bernstein (1971) suggested that parental occupational status reflected a form of embodied cultural capital. Therefore we expected occupational status not only to reflect economic capital but also cultural capital. Indeed, the results showed that the parental occupational status indicated mainly economic capital but also significantly cultural capital both in PISA and PIRLS. It could be then, as postulated by Bernstein (1971) , that families with low prestige occupations (e.g., working class) develop restricted linguistic codes because they tend to concentrate in culturally homogeneous areas and are employed in jobs that demand low verbal elaboration, whereas families with higher prestige occupations (e.g., middle class) develop elaborated linguistic codes because they are geographically, socially and culturally more mobile and are employed in jobs that foster oral and written communication skills to a greater extent.\nSince schools recognize and value elaborated linguistic codes, differences in embodied cultural capital related to parental occupational status will translate in differences in student performance.\nWe were unable to validate measurement invariance of these constructs with the multigroup analysis. The model results did not support the most basic weak invariance assumption. In other words, we cannot claim that the constructs are reflected equally across nations. And comparisons of construct scores and effects across nations could be misleading. This might reflect statistical complexities for managing invariance tests among a large number of groups.\nBut even the country-wise analysis yielded low fit indices for weak invariance tests. Only in few pairs of countries the sociological constructs were somewhat comparable. Socioeconomic characteristics of countries might explain construct invariance results across countries. (name deleted to maintain the integrity of the review process) have shown, for example, that home possessions tend to load differently on SES across countries, more strongly in poorer countries and weakly in wealthier societies. And May (2006) has proposed a technique to enhance construct invariance by using the information of national specific items of home possessions.\nFurther research should study more thoroughly the reasons for construct invariance across countries and propose methods to lessen construct variance.\nFurther research should also evaluate the presence of competing theories in the data sets.\nWe have applied ESEM to evaluate constructs inspired by reproduction and social capital theories in international LSA, but we could have also evaluated constructs based on rational action theory (e.g., Boudon, 1981) and whether the fit for these models is better than the one for the reproduction theory. More generally, it could be possible to add an ontological dimension to international LSA studies, through which best explanations for observed phenomena at a given time and in specific contexts are sought. The knowledge gained from such an approach could result in sounder theory grounded comparisons among education systems."}, {"section_title": "Notes", "text": ""}, {"section_title": "1.", "text": "Heuristically, values of TLI and CFI greater than 0.90 and 0.95, respectively, reflect acceptable and excellent fit to the data while for the RMSEA, values less than 0.05 and 0.08 reflect a close fit and a reasonable fit to the data (Marsh, Hau, & Wen, 2004) .\nis recommended not to employ factor analysis for inter-factor correlations larger than |0.5| (Gorsuch, 1983) . Cross-loading magnitudes greater than |0.3| are indicative of complex factor structures and complicate the interpretation of the rotated solution (Sass & Schmitt, 2010) ."}]