[{"section_title": "Abstract", "text": "This qualitative case study examined how middle school science teachers conducted collaborative inquiry and reflection about students ' conceptual understanding, and "}, {"section_title": "INTRODUCTION", "text": "n keeping with the focus of standardization, it is common practice within school districts to mandate that teachers implement a prescribed curriculum by school districts that includes state benchmarks, content objectives, vocabulary, technology and assessment sources (Florida Department of Education [FLDOE], 2013c) . While the focus tends to be on reading and mathematics, the science curriculum has been included as one of the content areas that policy makers and educational leaders have now incorporated as part of the thrust to standardize teaching and learning in schools across the United States (FLDOE, 2013c) . This development in educational reform has created the critical need for additional professional development of science teachers. In 2008, the state of Florida revised the content standards for science and provided face-to-face professional development on the implementation of the standards (FLDOE, 2013c) . Now, in 2013, the United States Department of Education (USDOE) advocates the adoption of a Common Core curriculum for reading and mathematics. As a result, districts expect the Common Core standards to be embedded in the science curriculum (FLDOE, 2013b) . Without continuous training and support, teachers tend to race through the school year to cover all the prescribed objectives. They may give limited attention as to how students learn, designing the curriculum for optimum student In most school districts the tendency has been to focus on and fund professional development in the areas of reading and mathematics with very little attention given to the field of science. Consequently, there now exists an urgent need to respond to the growing demands of the science curriculum as it is legislated by state standards and to adequately prepare teachers to meet these needs.\nClassrooms across the United States have become increasingly diverse, with students coming from all corners across the globe. The diversity that is now typical of classrooms calls for a similar diversity in the pedagogical strategies that teachers use. In particular, the demands for improvement in the areas of science and mathematics (National Assessment of Educational Progress [NAEP] , 2012; Trends in International Mathematics and Science Study [TIMSS] Report, 2011) indicate the pressing need to address the instructional content methods used by teachers to educate students in these critical areas (National Center for Education Statistics [NCES], 2012) . One way to respond to the need for professional development during times of economic hardship and the need to teach and support a diverse student population is to provide professional development that is constructivist in nature, enabling teachers to observe and ask questions about what's happening in their own classrooms, implement strategies that address the problems, and reflect about the impact of the solutions.\nThis research study examines how middle school science teachers conduct collaborative inquiry about how to deepen and broaden their students' conceptual understanding in science, and how individual teachers within the group act and reflect in response to the collaborative inquiry. The study also examines the external influences that affect collaborative inquiry. Collaborative inquiry and reflection may alter and improve the instructional methodology that science teachers use and may result in academic improvement of their science students. Further, collaborative inquiry and reflection are effective professional development approaches that promote constructivist teaching."}, {"section_title": "Statement of the Problem", "text": "Middle school science teachers receive limited opportunities to engage in professional development that is constructivist in nature, continuous, and supported. According to the NCES (2012), results from both the TIMSS Report (2011) and the NAEP (2012), indicate that there was no significant improvement in the performance of U.S. science students at the eighth-grade level during the period 1995 to 2011 (TIMSS) and 1996 to 2012 (NAEP). As evidenced by the international, national, and local achievement data, the diverse needs of students are not being met adequately due to teachers' limited time to identify and study the students' academic needs.\nIt is essential that teachers learn creative and innovative strategies that address student needs. Forms of professional development should be continuous and supported in order to facilitate the support of teachers. In order to meet the academic and socio-emotional needs of culturally diverse middle school students, science teachers should inform their knowledge of teaching and learning through collaborative inquiry and reflection by identifying and studying the strengths and weaknesses of their students. Without deliberate efforts for progress in science education, the result of not addressing teachers' needs for effective professional development is that teaching will continue to be handled through the \"all-for-one\" approach and achievement in science will continue to have no improvement in performance. If teachers empower themselves through collaborative inquiry and reflection about the teaching and learning of their students, then the outcome of the use of these forms of professional development will be that students' conceptual understanding and achievement in science may improve."}, {"section_title": "Purpose of the Study", "text": "The focus of the study was an examination of how middle school science teachers conduct collaborative inquiry about how to deepen and broaden students' conceptual understanding in science and how individual teachers within the group act and reflect in response to the collaborative inquiry. The study also examined the external influences that affect collaborative inquiry.\n1. What are the processes and outcomes of a collaborative inquiry about students' conceptual understanding in science among a group of middle school science teachers? 2. How do individual teachers in the middle school science group act and reflect in response to their collaborative inquiry? 3. What external influences affect the teachers' ability to engage in collaborative inquiry?"}, {"section_title": "THEORETICAL FRAMEWORK", "text": "This research study is grounded in the work of Darling-Hammond (2005) , Schon (1987) , and Drago-Severson (1997 . The three theorists examined the internal, individual, and external influences on the process of collaborative inquiry. Darling-Hammond and Drago-Severson's research studies have focused on collegiality and adult development. Schon's research studies centered on organizational learning and professional effectiveness through reflection.\nCollaborative inquiry among teachers can be successful when internal, individual and external influences are addressed (Darling-Hammond, 2005; Schon, 1987; Drago-Severson, 1997 . The study utilized a qualitative case study design. The researcher examined how the group works together (internal influences), how individuals act and reflect in response to their collaborative inquiry (individual influences), and the effects of support, barriers, and difficulties, and mandates imposed on collaborative inquiry (external influences). The theories presented by DarlingHammond and Schon, as well as the results of the studies by Drago-Severson, indicate that collaboration and reflection are essential elements toward the success of professional development of adult learners."}, {"section_title": "Internal Influences", "text": "The internal influences of collaborative inquiry were linked to the work by Darling-Hammond (2005) . DarlingHammond supported the concept of teacher development, specifically the theories of learning in a community. According to Darling-Hammond (2005) , approaches to knowledge development include \"knowledge of practice\" and \"knowledge in action.\" The second approach to knowledge, \"knowledge in action,\" refers to \"what accomplished teachers understand as it is articulated in their practice, reflections, and their narratives\" (p. 382). Darling-Hammond explained that \"knowledge of practice\" is enhanced by accomplished teachers through \"knowledge in action.\" Further, \"knowledge of practice\" facilitates the role of the teacher in understanding the knowledge, process, and the importance of self inquiry about problems in their own classrooms. Knowledge in practice is shared in professional learning communities, while professional learning communities represent knowledge in action.\nDarling-Hammond (2005) also described the essentials of effective professional development, which include goals for student performance, teacher involvement, school-based, collaborative problem solving, continuous and supported training, information rich resources, development of theoretical understanding, and part of a middle school change. Activities involved in collaborative problem solving include interdisciplinary teaming, curriculum development and critique, collaborative action research, and study groups. Collaborative problem solving addresses questions that teachers have about students, through inquiry about learning needs and the sharing of knowledge and expertise. Schon's (1987) work has focused on organizational learning and professional effectiveness through reflection. Schon (1987) supported reflection as an essential element in the collaborative inquiry cycle. Schon's view on the reflective practitioner stemmed from his philosophy on technical rationality. It is the responsibility of the practitioner to set the problem in the classroom. Schon (1987) described \"knowing in action\" as non-logical processes, such as skillful judgments, decisions, and actions undertaken by professionals simultaneously, without being able to state the procedures or rules. Beyond \"knowing in action\" there is \"reflection in action.\" According to Schon (1987) , this mean \"thinking back to what has been done to decide whether the 'knowing-in-action' contributed to the expected outcome. During this time, reflection has no direct connection to the present action. Schon asserted that knowledge-in-action engages reflection in the midst of teaching, while reflection-in-action is thinking about what took place after the lesson."}, {"section_title": "Individual Influences", "text": ""}, {"section_title": "External Influences", "text": "Drago- Severson's (1997 Severson's ( , 2002 external influences focused on the processes of collaborative inquiry, such as the incentives teachers receive to collaborate, the barriers that prevent collaboration, and the accountability pressures associated with collaboration. The results of both of the studies indicated that the principals' leadership in support of teacher development centered on collaboration and the welcoming of differences.\nThe views of Darling-Hammond, Schon, and Drago-Severson highlight the importance of the infusion of collaborative inquiry and reflection in a professional development cycle to improve teaching and learning. The cycle begins with teachers observing their classrooms, next talking with one another, followed by teachers' implementing improvement strategies with students, writing and sharing their reflections about the impact of the actions taken, and then participating in individual and focus group interviews. As a follow-up to the theoretical framework presented from the theorists, the researcher implemented several of the strategies associated with the concepts of collegiality, adult development, and reflection to fulfill the professional development cycle. This research study served to add to the literature on ways that collaborative inquiry and reflection can be utilized by middle school science teachers to improve their practices."}, {"section_title": "METHODS", "text": "For this study, teacher collaborative inquiry and reflection was used in a cyclic process, including teachers' observations of their classrooms, communication between middle school science teachers, action, and reflection. These models included face-to-face sessions, as well as online communication through a discussion board with anonymous postings. Science teachers decided whether they would focus on one theme, students' conceptual understanding, or identify one theme per month that was related to students' conceptual understanding, as the focus of collaborative inquiry. Allowing teachers to decide the process of the themes may empower them and maintain their interests to stay involved in the study. The participants then determined what they wanted to do to improve the issues and problems or what they would like to do differently based on the conversations, related to the theme(s).\nFor the theme(s), the teachers observed and reflected on their students' conceptual understanding of science, asked questions about students' conceptual understanding of science in relation to their instructional practices, brainstormed, selected solutions to implement, conducted inquiries, and reflected on the effects of the solutions. Self-reflection by science teachers was used as a basis for continued collaborative inquiry and was also used for delivering opportunities to restructure the curriculum and revisit difficult concepts. Collaborative dialogue and reflection were continuous. The group meetings took place once a month, for approximately 3 months for 1 hour. The reflective online sessions took place once a month, for approximately 3 months, through a face-to-face meeting, e-mail, or on a discussion board with anonymous postings, for 1 hour.\nSeveral strategies were used to engage in collaborative inquiry with the science teachers. Face-to-face strategies included the study of artifacts and documents and conversations between educators to enhance teaching and learning and teacher reflections, that are related to the group's monthly theme(s) for the collaborative inquiry.\nThe methodology for the study included observations of group meetings, individual participant interviews, a focus group discussion, as well as inquiry and reflections made by participants through online discussion. As a result of the process, a community of practice was developed by science teachers by meeting to talk together about their teaching practices.\nThe middle school level was chosen for the study because it is at this stage that students begin dropping out of school. In addition, the science curriculum is more complex in middle school than in elementary school. Science teachers from Grades 6 through 8 engage in monthly professional development meetings. For the purpose of the study, the science department communicated twice monthly for 3 months, so that there were 3 rounds of face-to-face conversation, and 3 rounds of face-to-face and online reflection.\nThe sample. The criterion for sampling was the teachers' membership in the science department. This group was used as the sample because it is already formed, the teachers all teach science, and the participants are familiar with each other. Science teachers of sixth through eighth grades were invited to be included in the sample."}, {"section_title": "Data Collection", "text": "Purpose. The sources of data collection were observations of department meetings, interviews with the sample science teachers, reflections made by participants through thinking and talking with one another online, and a focus group discussion. Additional sources of data included researcher field notes and e-mail communications. Science teachers employed their own ways of gathering data: journal keeping, observations of their own and others' teaching experiences, interviews with students, formative assessment, and analysis of student work.\nThe purpose of the observations of the collaborative inquiry meetings was to learn how the participants determined ideas discussed in the collaborative inquiry meetings. Field notes were gathered by the researcher at the meetings about how agenda items were generated and how concerns and decisions about the teaching and learning of science were generated, implemented, and reflected upon.\nIn addition to observations of the sample group, interviews were conducted with each science teacher in the group and a focus group discussion took place. A reflection log was maintained by the researcher that was updated after each group meeting, online communication series, interview, and the focus group interview. Written reflections made by participants through online journaling were also collected and analyzed. Journals and field notes were analyzed during the study, and an analysis of the reflections was based on focus questions. Participants submitted their reflections verbally and electronically after 3 weeks of implementing improvement strategies."}, {"section_title": "Interview Data", "text": "Individual interviews with teachers. The focus of the interviews with teachers was to determine the responses to the research questions from the perspectives of middle school science teachers in the sample. A schedule of interviews was prepared and shared with the selected sample group. One 30-minute interview about the process, implementation, impact, and challenges of collaborative inquiry was conducted with each science teacher after the collaborative inquiry cycle until five interviews were completed."}, {"section_title": "Focus group interview.", "text": "The purpose of the focus group discussion was the analysis of the data from the observations and interviews conducted, as well as reported reflections. All science teachers from the sample were invited to join the focus group. The teachers reflected and shared what they had learned from being a part of the collaborative inquiry and reflection processes."}, {"section_title": "Data Analysis", "text": "Data analysis consisted of strategies described by Creswell (2007) . Triangulation of data included analysis of observations of department meetings, interviews with the sample science teachers, reflections made by participants, and the results from the focus group interview. The strategies focused on \"the coding of data (reducing the data into meaningful segments and assigning names for the segments), combining the codes into broader categories or themes, and displaying and making comparisons in the data graphs, tables, and charts\" (Creswell, 2007, p. 148) . Categories were combined into themes.\nThe overarching theme of the study was conceptual understanding in science. In the initial conversation, teachers provided their definitions of conceptual understanding, evidence of conceptual understanding through observations of students, and areas that interfered with conceptual understanding.\nNext, the interview questions were divided so that each question responded to a particular research question. The components of the interview questions became the categories for each research question. The themes emerged from the overarching idea behind the activities for each of the research questions.\nFor Research Question 1, responses were extracted from data from the observations of collaborative inquiry meetings, online communication, and the focus group interview. The major theme that emerged was open inquiry amongst teachers. Teachers met for collaborative inquiry based on their availability and chose meeting times that the majority of the teachers had selected.\nFor Research Question 2, responses were extracted from data from individual interviews and online communication. The major theme that emerged was increased conceptual understanding. This theme was expressed through actions taken, reflections made, and the statements made through observations of the inquiry meetings.\nFor Research Question 3, responses were extracted from the observations of collaborative inquiry meetings, online communication, the individual and focus group interviews. The major theme that emerged was teachers' individual collaborative inquiry along with the district's prescribed inquiry see whether interim tests scores predicted state assessment scores. Teachers stated that since they were currently conducting the district's inquiry, it was challenging to conduct their own inquiry simultaneously."}, {"section_title": "RESULTS", "text": "This qualitative case study examined how middle school science teachers conducted collaborative inquiry and reflection about students' conceptual understanding and how the same teachers acted and reflected about the collaborative inquiry. It also examined the external influences that affected teachers' ability to engage in collaborative inquiry. Findings from this study revealed the following:\n1. Middle school science teachers used an open form of answering curricular questions that was developed by the same teachers to conduct collaborative inquiry about students' conceptual understanding. 2. Middle school science teachers came to consensus about actions to affect students' conceptual understanding. The teachers took action as stated and shared their reflections of the actions taken with consideration to current and upcoming school activities. 3. The greatest challenge to conducting collaborative inquiry and reflection is embedding teacher inquiry within prescribed inquiry, that is currently being conducted by the Sundown School District. A conducive atmosphere for collaborative inquiry and reflection is one in which administrators make the process mandatory and facilitate the process by removing an existing inquiry."}, {"section_title": "Qualitative Data Results", "text": ""}, {"section_title": "Conceptual understanding.", "text": "Students provide evidence of their conceptual understanding of science when they present projects at science fairs; argue the validity of information presented on the news by judging its validity based on insights gained in science classes; and make connections to real world occurrences and what they have learned in science classes.\nMiddle school science teachers believed that students were accountable to increase their own conceptual understanding. To reach conceptual understanding, students should become more responsible for their learning. They should share their ideas with parents to rationalize their views and gain support."}, {"section_title": "Summary of the Findings", "text": "The collaborative inquiry and reflection approach helped to increase students' conceptual understanding in science. It was determined that the collaborative inquiry and reflection approach is an open inquiry process developed by its participants. Supporting data indicated that teachers conduct the inquiry through consensual ideas. Teachers valued talking with one another about science content and pedagogy, but did find the inquiry portion of the collaborative inquiry and reflection approach to require more development. The third finding revealed that teachers believed that the district's inquiry posed the greatest challenge for them to conduct their own collaborative inquiry."}, {"section_title": "CONCLUSIONS AND RECOMMENDATIONS", "text": "The purpose of the study was to examine how middle school science teachers conducted collaborative inquiry and reflection about students' conceptual understanding and how individual teachers within the group acted and reflected about the collaborative inquiry. The study also examined the external influences that affected the teachers' ability to engage in collaborative inquiry."}, {"section_title": "Research Question 1", "text": "For the first research question, the researcher analyzed data from observations of the participants as they met and talked about the processes and outcomes to the collaborative inquiry, from individual interviews and a focus group discussion, and from reflections about their responses to collaborative inquiry. Darling-Hammond's (2005) internal influence of collaborative inquiry was evidenced when the middle school science teachers met together to talk about elements that their students lacked to have conceptual understanding in science and to choose specific weaknesses that they wanted to be the focus of their efforts for improvement. Teachers relied on content pedagogy to deepen their students' conceptual understanding and reflected both orally and in writing about the impact of improvement strategies used.\nThe results of the study indicated that the processes of the approach could greatly vary from one collaborative cycle to the next as they depended on the choices of the participants and that the outcome of the inquiry was greatly affected by the existing, prescribed inquiry being done by the district. The school should provide continuous support for collaborative inquiry, which may be in the form of mentoring. Mentors should aim to show science teachers how to link their individual inquiries and the district's to understand the value of conducting individual collaborative inquiry and to increase their students' achievement.\nThe outcome of the collaborative inquiry meetings was in reaching consensus to implement a specific strategy to impact a concern about students' conceptual understanding in science. In reflection, teachers discussed what action they performed with their students.\nRecommendations for further research. Collaborative inquiry should be structured so that it meets the needs of teachers in order to attend to the needs of students. Teachers must make observations of their students and then ask themselves questions related to the observations of interest or concern. While observation, communication, action, and reflection are essential components of collaborative inquiry, how these components are achieved should be left to the discretion of teachers."}, {"section_title": "Research Question 2", "text": "For the second research question, the researcher analyzed data from individual interviews, the focus group discussion, and from reflections about teachers' responses to their actions taken in the classrooms. The results indicated that the individual influence of collaborative inquiry was represented during the phase of the study when middle school science teachers made decisions, took actions as stated, and shared their reflections about actions to affect students' conceptual understanding through a modality that was comfortable and convenient for use.\nAs with Gaylord's (2003) and the Goodnough and Cashion (2006) studies, participants of the existing study worked collaboratively as practitioners, with colleagues, and were empowered by the process. Teachers made their own decisions for topics of inquiry, consensually decided upon action to take to affect the focus area, and thought more analytically as the study progressed.\nRecommendations for further research. As the collaborative inquiry process is cyclic, new inquiries may develop from teachers' reflections. Teachers should be given continuous mentoring to practice how to use the observation, communication, action, and reflection processes to answer questions about their students' achievement in science. In taking into account teachers' feelings that inquiry involves several trials, the collaborative inquiry process should be conducted over adequate time, as determined by the teachers."}, {"section_title": "Research Question 3", "text": "For the final research question, the researcher analyzed data from observations of the participants as they met and talked about the processes of collaborative inquiry, from the individual interviews and the focus group discussion, and from reflections about teachers' responses to collaborative inquiry, done by face-to-face meeting, e-mail, and the discussion board. The external influences encompassed challenges that hindered collaborative inquiry and environments and incentives that supported collaborative inquiry and reflection. The external factors that affected the collaborative inquiry concentrated on barriers, such as time to collaborate and the acceptance of others' ideas, and on accountability factors. Challenges included teachers' unwillingness or resistance to change and pressure of testing and time constraints.\nRecommendations for further research. Teachers' strongest argument for increasing collaborative inquiry was for administrators to cancel an inquiry already in place at the school to make time for their own collaborative inquiry. Mentoring may be used to counter the barrier of not being able to cancel a district inquiry and providing continuous support to teachers to develop the inquiry process. Teachers benefit from the use of collaborative inquiry and reflection by gaining meaningful modes for answering questions about how students' learn best, rather than primarily aiming to teach to meet state objectives."}, {"section_title": "Conclusion", "text": "NAEP (2012) and TIMSS (2011) state that science achievement is low at the middle school level. This research study has revealed that teachers require professional development that is constructive in nature, that is developed to suit their individual needs, and focuses on strategies that address students' needs to increase their conceptual understanding in science. Within the collaborative and reflection process, teachers set their problems in response to observations made within their classrooms, brainstorm about improvement strategies, implement specific strategies, and then reflect about the impact of the strategies. As a result of the reflections made by teachers, they may keep, alter, or change the improvement strategies to increase achievement. Therefore, the collaborative inquiry and reflection approach is effective in increasing achievement in science and should be used by middle school teachers.\nTeachers in the study utilized effective pedagogical strategies to impact students' conceptual understanding, including the consideration of how students learn, designing the curriculum for student learning, utilizing teaching that enhances student learning, assessing student learning and using collaborative inquiry as professional development on the learning of science.\nThe study supported the ideas by Collins (2002) , Bybee (2002) , Farenga et al. (2002) , and Powell et al. (2002) , that active learning was involved to reach conceptual understanding, that students' misconceptions and scientific inquiry to answer questions were compulsory components of science programs, and that teachers should integrate and link curriculum, instruction, and assessment when conducting collaborative inquiry and reflection. Also, in support of Powell et al. (2002) , teachers used the collaborative inquiry and reflection approach as a form of in-house professional development toward the learning of science. Teachers were interested in learning and practicing to use collaborative inquiry and reflection as a team, that is, deciding on a special area and exploring it, also improving the collaborative inquiry and reflection approach by extending time to collect sufficient data, and evaluating the use of collaborative inquiry and reflection.\nWhile the teachers saw the value of collaborative inquiry, their reality was that their curriculum is set against a timeline and correlates with assessments. They wanted to answer questions about how to get these tasks done most efficiently and how to have students deepen their conceptual understanding, as evidenced by their test data. They wanted to analyze data from interim tests to find out what students know and do not know and to develop growth.\nThe collaborative inquiry and reflection approach is valuable in increasing students' conceptual understanding in science and may be used with other disciplines. Gordon (2008) described inquiry as different aspects of the same process. These aspects include observation, communication, action, and reflection. Inquiry may be used as a process of answering questions to deepen and broaden ideas in many other disciplines. Collaborative inquiry and reflection allows for an open inquiry approach that facilitates multiple perspective and approaches to learning and professional development. Support is fundamental from administrators and mentors to support the practice and ownership of this cyclic process. New inquiries may develop from the continuation of the collaborative inquiry and reflection approach. When teachers implement specific strategies to effect achievement, they learn whether or not the strategies are effective, whether there is a need to refine the strategies, and to what degree the improvement strategies affected the problems. They may chose to keep using strategies that worked well or to test alternate strategies to affect the problems observed in the classrooms."}, {"section_title": "AUTHOR BIOGRAPHY", "text": "Dr. Christine Todd-Gibson is an experienced educator with an extensive background teaching both children and adults in the Miami-Dade County Public School system where she has worked as a classroom teacher, district instructional support specialist, and assistant principal during a career spanning more than twenty years. Her background focuses on multicultural education and on the design and implementation of programs that focus on culturally relevant pedagogy. She has maintained a program of continuous professional development, ensuring that she is abreast of the latest research findings on instructional leadership and classroom pedagogy. E-mail: toddgib87@gmail.com"}]