[{"section_title": "Abstract", "text": "Due to engineering limitations, the spatial encoding gradient fields in conventional magnetic resonance imaging cannot be perfectly linear and always contain higher-order, nonlinear components. If ignored during image reconstruction, gradient nonlinearity (GNL) manifests as image geometric distortion. Given an estimate of the GNL field, this distortion can be corrected to a degree proportional to the accuracy of the field estimate. The GNL of a gradient system is typically characterized using a spherical harmonic polynomial model with model coefficients obtained from electromagnetic simulation. Conventional whole-body gradient systems are symmetric in design; typically, only odd-order terms up to the 5 th -order are required for GNL modeling. Recently, a high-performance, asymmetric gradient system was developed, which exhibits more complex GNL that requires higher-order terms including both odd-and even-orders for accurate modeling. This work characterizes the GNL of this system using an iterative calibration method and a fiducial phantom used in ADNI (Alzheimer's Disease Neuroimaging Initiative). The phantom was scanned at different locations inside the 26-cm diameter-sphericalvolume of this gradient, and the positions of fiducials in the phantom were estimated. An iterative calibration procedure was utilized to identify the model coefficients that minimize the meansquared-error between the true fiducial positions and the positions estimated from images corrected using these coefficients. To examine the effect of higher-order and even-order terms, this calibration was performed using spherical harmonic polynomial of different orders up to the 10 thorder including even-and odd-order terms, or odd-order only. The results showed that the model coefficients of this gradient can be successfully estimated. The residual root-mean-squared-error after correction using up to the 10 th -order coefficients was reduced to 0.36 mm, yielding spatial accuracy comparable to conventional whole-body gradients. The even-order terms were necessary for accurate GNL modeling. In addition, the calibrated coefficients improved image geometric accuracy compared with the simulation-based coefficients."}, {"section_title": "Introduction", "text": "Conventional magnetic resonance imaging (MRI) reconstruction methods based on direct fast Fourier transform implicitly assume that the spatial encoding gradient fields employed for MR signal formation and data acquisition are perfectly linear throughout the entire imaging volume (Glover and Pelc 1986) . However, engineering limitations and physiological constraints such as the risk of peripheral nerve stimulation (PNS) dictate that the gradient fields are not perfectly linear and always contain higher-order nonlinear components (Glover and Pelc 1986; Harvey and Katznelson 1999; Lee et al 2015) . In addition, for some emerging MR platforms allowing high system performance, gradient linearity may be intentionally sacrificed in return for increased gradient amplitude and slew rate (Roemer 1993; Lee et al 2015; Tan et al 2016) . If linear gradients are presumed during image reconstruction, the effects of gradient nonlinearity (GNL) will manifest as geometric distortion into the generated images (O'Donnell and Edelstein 1985; Glover and Pelc 1986; Schad et al 1992; Janke et al 2004; Doran et al 2005; Baldwin et al 2007; Baldwin et al 2009) . The GNL-induced distortion has substantial impact on applications demanding high geometric accuracy, such as radiation therapy planning (Chen et al 2006; Huang et al 2016) , apparent diffusion coefficient mapping (Tan et al 2013) , and longitudinal studies of neurodegenerative diseases (Han et al 2006; Jovicich et al 2006; Gunter et al 2009) . If the GNL fields are a priori known, their effects may be retrospectively corrected in image domain after MRI reconstruction (Glover and Pelc 1986) , as conventionally implemented on commercial MR systems. Alternatively, the effect of GNL can be prospectively accounted for during, rather than after, image reconstruction, and therefore yield images that are compensated for GNL distortion without the need for interpolative postprocessing (Tao et al 2015a; Tao et al 2015b; Tao et al 2016) . Successful implementation of any gradient nonlinearity correction method relies on an accurate characterization of the GNL fields for an MR gradient system. Conventionally, the GNL fields of a gradient system are characterized based on a parameterization of magnetic gradient field using spherical harmonic polynomial expansion (Glover and Pelc 1986; Janke et al 2004; Doran et al 2005) . Given a particular gradient hardware design, electromagnetic (EM) simulation is performed to determine the coefficients of spherical harmonic polynomials. These coefficients are assumed to be applicable to all scanners built with the same gradient design, i.e., manufacturing variation is typically neglected. The order of spherical harmonic polynomials used for GNL correction varies among MR manufacturers and system models. Some whole-body MR systems utilize model coefficients up to the 5 th order, as done on many General Electric (GE)'s systems (Glover and Pelc 1986) .\nConventional whole-body MR gradient systems usually apply gradient coil windings symmetrically along each of the physical X, Y and Z gradients. Therefore, only model coefficients of odd-orders are non-negligible and required for distortion correction. Alternatively, phantom-based calibration methods have also been described to extract GNL information from MR images acquired on fiducial phantoms based on various mathematical models, such as spherical harmonic polynomial model, spline model, and polynomial model (Wang et al 2004; Doran et al 2005; Hwang et al 2012a; Hwang et al 2012b; Trzasko et al 2015; Huang et al 2016) . Such methods allow the calibration of system specific GNL distortion fields.\nRecently, a compact, asymmetric MR gradient system for brain imaging has been developed . Due to the 42 cm inner diameter of the gradient coil, it is also capable of scanning extremities and infants. This system has a 26-cm diameter spherical volume (DSV) for imaging, and is capable of producing a gradient amplitude and slew rate of 80 mT/m and 700 T/m/sec using a standard 1 megavolt-amp (MVA) per axis gradient driver due to the reduced coil inductance and resistance, with substantially reduced risk of PNS due to its compact spatial extent of the gradient coils . In comparison to conventional whole-body gradient systems, the transverse gradients (i.e., physical X and Y) of this system employ gradient coil windings asymmetrically along the longitudinal direction (Roemer 1993) . Such a design facilitates patient access by shifting the imaging volume towards the patient end of the gradient coil. The design and construction of this compact asymmetric gradient system was detailed in a previous work . However, due to the asymmetric design, this compact gradient system exhibits more complex GNL fields which require both odd-and even-order terms. Also, since the head fills nearly the entire field of view higher-order (i.e., N > 5) spherical harmonic polynomial models are needed for accurate characterization and calibration.\nIn this work, the GNL fields of this compact asymmetric gradient system over the entire 26cm DSV are characterized using the Alzheimer's Disease Neuroimaging Initiative (ADNI) phantom (Gunter et al 2009 ) and an iterative model fitting procedure (Trzasko et al 2015) .\nWe demonstrate that the GNL-induced image geometric distortion can be modeled using up to 10 th order spherical harmonic polynomial terms including both even-and odd-order terms. The GNL information obtained through this calibration is compatible with the framework utilized in on-system GNL correction, and can also be used as an independent validation for the vendor-provided coefficients obtained from EM simulation."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Fiducial Phantom", "text": "The GNL of the gradient fields were characterized using the ADNI phantom (figure 1), which is developed as a tool for evaluating image geometric distortion in the multi-site, multi-vendor ADNI project involving more than 58 sites (Jack et al 2008; Gunter et al 2009) .\nThe ADNI phantom is a 20-cm shell containing 160 spherical fiducial markers filled with a copper sulfate solution, a large 6.0 cm diameter signal-to-noise ratio (SNR) evaluation sphere in the center of the phantom, as well as two 3.0 cm diameter contrast-to-noise ratio (CNR) evaluation spheres. All fiducial markers have a diameter of 1.0 (158/160) or 1.5 cm (2/160) and are located at known relative positions in the phantom shell. Associated software tools are available to track the positions of the fiducials in the phantom (Gunter et al 2009) .\nThe fiducial tracking software is orientation insensitive. A local coordinate system is first established by locating the large SNR sphere and the two 1.5 cm diameter fiducials in the phantom. It then tracks the 1.0 cm fiducials by searching in the neighborhood of their expected locations based on phantom design using a template-based cross-correlation method. The ADNI phantom and fiducial tracking tool has been tested in the ADNI project and has demonstrated accuracy, reproducibility, and stability against image distortion of various sources, as detailed by Gunter et al. (Gunter et al 2009) "}, {"section_title": "Data Acquisition", "text": "The ADNI phantom was scanned with a single-channel transmit/receive (T/R) birdcage coil using a 3D inversion-recovery fast spoiled gradient echo (IR-FSPGR) acquisition (Bydder and Young 1985; Edelman et al 2009 ) (readout direction = superior/inferior (S/I); in-plane phase encoding direction = anterior/posterior (A/P); slab encoding direction = right/left (R/L); matrix = 256×256; in-plane field-of-view (FOV) = 27×27 cm 2 ; in-plane resolution = 1.055 mm; number of slices (i.e., partitions) = 196; slice thickness = 1.3 mm; TR/TI/TE = 3.5/400/1.5 msec; flip angle = 11°). The IR-FSPGR sequence was adopted in this work following the recommendation of the ADNI group. In our experience, an FSPGR sequence can also be used and provide similar performance (Gunter et al 2009) . A readout bandwidth (BW) of ±125 kHz was used to minimize the effect of off-resonance (readout gradient amplitude = 22 mT/m). To cover the entire 26-cm DSV of this gradient system of interest, the 20 cm-diameter ADNI phantom was scanned at gradient isocenter, and at ±3 cm offsets in the R/L, A/P and S/I directions along the gradient axes after manually shifting the phantom. To facilitate the experimental setup, the approximate positions of the displaced phantoms were confirmed using three-plane localizer images. Note that the exact positions of the phantom and fiducials were to be extracted from the acquired MR images, as described later in section 2.4, and the manual shifting of the phantom was to ensure the entire 26-cm DSV was covered. To examine the effect of off-resonance, data acquisition was repeated while the phantom was in the same position using the identical acquisition protocols, but with reversed readout gradient polarity. The built-in GNL correction on the scanner was disabled during these acquisitions.\nThe ADNI phantom was further scanned on the compact asymmetric gradient system using a fast spoiled gradient echo (FSPGR) sequence (BW = ±62.5 kHz; readout gradient amplitude = 11 mT/m; readout direction = superior/inferior (S/I); in-plane phase encoding direction = anterior/posterior (A/P); slab encoding direction = right/left (R/L); matrix = 256×256; in-plane field-of-view (FOV) = 27×27 cm 2 ; in-plane resolution = 1.055 mm; number of slices (i.e., partitions) = 252; slice thickness = 1.0 mm; TR/TE = 3.7/1.5 msec; flip angle = 11°) using the single-channel T/R coil.\nA healthy human subject was also scanned in the asymmetric gradient system under an IRBapproved protocol to demonstrate the effect of GNL correction, as described in later sections. Brain scan data were acquired with a 32-channel, receive-only brain coil (Nova Medical Inc., Wilmington MA, USA) using a 3D CUBE T2 FLAIR acquisition (Chagla et al Tao et al. Page 4 Phys Med Biol. Author manuscript; available in PMC 2018 January 21."}, {"section_title": "Author Manuscript", "text": "Author Manuscript\nAuthor Manuscript 2008; Kallmes et al 2001) (readout direction = superior/inferior (S/I); in-plane phase encoding direction = anterior/posterior (A/P); slab encoding direction = right/left (R/L); matrix = 256×224; in-plane FOV = 25.6×24.3 cm 2 ; number of slices (i.e., partitions) = 128; slice thickness = 1.4 mm; TR/TE = 7600/111 msec; BW = ±41.67 kHz; echo train length (ETL) = 180; flip angle = 90°). The raw data were retained for offline processing.\nAuthor Manuscript\nAuthor Manuscript\nNewton iteration. This optimization solver can be initialized either using zero-matrix (assuming no a priori information about model coefficients) or using the model coefficients obtained from EM simulation.\nAuthor Manuscript\nAuthor Manuscript procedure was executed for 10 iterations, which was previously demonstrated sufficient for achieving convergence (Trzasko et al 2015) . The calibrated coefficients of each case were then used to correct the GNL distortion using the standard method based on image domain interpolation, and the residual root-mean-squared-error (RMSE) of each case was then determined by comparing the estimated fiducial positions in the corrected images with the true fiducial positions. The RMSE of images corrected using coefficients (N = 10) obtained from EM simulation was also determined. The effect of even-order terms was tested by performing the calibration procedure using odd-order terms only, and calculating the RMSE from corrected images. To examine the effect of off-resonance on model coefficient estimation, the calibration procedure for the N = 10 case was repeated using the images acquired with readout gradient polarity reversed. The obtained coefficients were used to correct the same images used in previous analysis. The fiducial positions estimated from the corrected images were then compared with that estimated from images after the previous 10 th order correction using coefficients calibrated from images acquired with normal readout gradient polarity.\nAs an independent test, the ADNI image dataset acquired with FSPGR sequence was respectively corrected using the coefficients obtained from the proposed calibration process, as well as that obtained from the EM simulation (both up to 10 th -order including odd and even order terms), and the residual rooted mean square errors (RMSE) of fiducial positions after both corrections were then calculated.\nThe calibrated coefficients at various orders (N = 5 to 10) were also utilized to correct the GNL distortion in the 3D CUBE T2 FLAIR data set using an integrated GNL correction method based on type-I non-uniform fast Fourier transform (NUFFT) (Tao et al 2016) . \nAuthor Manuscript\nAuthor Manuscript accuracy of the periphery of imaging volume. Further increasing model order from 9 to 10 provides marginal improvement, which is consistent with the RMSE values in figure 2. Figure 6 compares the images corrected using up to 10 th order coefficients obtained from EM simulation and proposed calibration, along with the difference image. The first-order coefficients obtained from proposed iterative calibration were combined with the EM simulation coefficients and used for correction. A stronger difference can be observed at the periphery of the brain.\nAuthor Manuscript\nAuthor Manuscript The residual root-mean-squared error (RMSE) after correction using the proposed calibrated spherical harmonic polynomial model coefficients of various model orders including both odd-and even-order terms (solid line), or including odd-order terms only (circles). Examples of ADNI phantom images (FOV shifted from gradient isocenter by 3 cm in the superior direction) before and after gradient nonlinearity correction using the calibrated model coefficients (spherical harmonic polynomial model N = 10 including both even-and odd-order terms). The images corrected using model N=5 with odd-order only are also shown, which demonstrates residual distortion at the phantom superior end in the coronal and sagittal planes (see zoom-in panels and arrows). Tao et al. Page 15 Phys Med Biol. Author manuscript; available in PMC 2018 January 21.\nAuthor Manuscript\nAuthor Manuscript The residual displacement of phantom fiducials after correction using the spherical harmonic polynomial model coefficients (N = 10) obtained from EM simulation (a) and proposed iterative calibration (b) along the three orthogonal gradient axes (right/left = R/L, anterior/ posterior = A/P, superior/inferior = S/I). Each plot of the 3 by 3 panels represents the displacement of each fiducial from its true positions along one gradient axis (i.e., ΔRL, ΔAP, ΔSI), as a function of the true position of that fiducial (i.e., RL, AP, SI). Examples of the 3D T2 FLAIR images after correction using the calibrated coefficients of various orders (N = 5, 7, 9, 10), and the difference images between two subsequent fitting orders (i.e., N = 5 vs. 7, N = 7 vs. 9, N = 9 vs. 10). The displayed window width of the difference images is reduced by 10 times from that of the anatomical images to emphasize differences and to increase contrast. Tao et al. Page 17 Phys Med Biol. Author manuscript; available in PMC 2018 January 21.\nAuthor Manuscript\nAuthor Manuscript Examples of the 3D T2 FLAIR images after correction using up to 10th order coefficients obtained from EM simulation and the proposed iterative calibration, as well as the difference image between the two. The displayed window width of the difference images is reduced by 10 times from that of the anatomical images to emphasize differences and to increase contrast. Tao et al. Page 18 Phys Med Biol. Author manuscript; available in PMC 2018 January 21.\nAuthor Manuscript\nAuthor Manuscript"}, {"section_title": "Iterative GNL Calibration Procedure", "text": "The distortion field due to GNL for the k-axis (k = X, Y or Z) gradient coil, d k (x⃗ ), can be modeled using a spherical harmonic polynomial model as shown in (1): ( 1) where x⃗ is the physical position within the imaging volume, r (x⃗ ), θ(x⃗ ), ϕ(x⃗ ) denote the polar coordinates of position x⃗ , N is the order of spherical harmonic polynomial model, and represent coefficients of the spherical harmonic polynomial model terms of order n (0≤ n ≤ N) and degree m (0≤ m ≤ n ) for the k-axis gradient coil. P nm (·)denotes the associated Legendre polynomial for the model terms with order n and degree m. Denoting S as the total number of model coefficients used in modeling of each gradient coil (including both and ), the GNL fields for the X, Y and Z gradient coils can be characterized using an S by 3 matrix C with each column of C denoting the model coefficients of the X, Y or Z gradient coil. The model coefficient C summarizes the distortion fields shown in (1) and can then be used for GNL correction. Define x as the original 3D MR image data set with GNLinduced distortion (i.e., before any GNL correction), and further define Γ{x, C } as a function correcting the distortion in the image set x using model coefficient C (i.e., the distortion fields C represents). When x represents an image set of a fiducial phantom, such as the ADNI phantom used in this work, the fiducial positions in this image set can be extracted using a function Λ{x}. Hence, the fiducial positions estimated from the images after GNL correction using model coefficients C can be expressed as Π (C)=Λ{Γ{x, C }}, where Π(C) is a T by 3 matrix denoting the 3D positions of the T fiducials, and is a function of model coefficient C (i.e., the distortion fields). The residual GNL distortion after correction using C can be summarized by the mean-square-error (MSE) between the estimated fiducial positions Π(C) and the true fiducial positions Π 0 . The optimal model coefficients, Ĉ, can be found by solving the following nonlinear optimization problem (Trzasko et al 2015) :\n( 2) where ||·|| F denotes the Frobenius norm of a matrix. Equation (2) explicitly estimates the model coefficients that minimize the MSE between the true fiducial positions and that estimated from corrected image dataset. As shown by Trzasko et al (Trzasko et al 2015) , (local) minimizers of this problem can be efficiently determined using linearized Gauss- Tao et al. Page 5 Phys Med Biol. Author manuscript; available in PMC 2018 January 21."}, {"section_title": "Data Processing", "text": "All data processing was performed in Matlab environment (The MathWorks, Inc., Natick MA) on a stand-alone computer with a dual 8-core 2.6 GHz CPU and a 128 GB of memory.\nThe ADNI phantom used in this work has 160 fiducials, hence T = 160. The software tool originally associated with the ADNI phantom (Gunter et al 2009 ) was used to track the fiducial positions, which serves as the function Λ{·}. The GNL correction function Γ{·} was implemented using the conventional GNL correction method based on image domain cubic spline interpolation (Glover and Pelc 1986) . A rigid body transformation fitting was performed to match the relative fiducial positions from the true phantom design to the fiducial positions measured in each image data set. This rigid body transformation accounting for phantom rotation and shift was then applied to the designed relative fiducial positions (Π d ) to yield the true fiducial positions (Π 0 ). This process can be expressed as Π 0 =H Π C) {Π d } and is performed within each iteration when solving (2) with the rigid body transformation (H) obtained by minimizing the difference between the relative fiducial positions a priori known from phantom design ( Π d ) and the fiducial positions measured in the corrected image data set ( Π (C)). The calibration procedure in (2) was initialized with the model coefficients obtained from EM simulation. Note that the GNL coefficients C in (2) were solved iteratively (Trzasko et al 2015) . In the i-th iteration, the fiducial positions (Π (C i−1 )=Λ{Γ{x, C i−1 }} ) were tracked from the image after correction using the previous model coefficients (Γ{x, C i−1 }). The residual distortion fields were then estimated by comparing Π (C i−1 )=Λ{Γ{x, C i−1 }} and Π 0 =H Π (Ci−1) {Π d }, and were used to refine the GNL model coefficients in the current iteration (C i ). As iteration progresses, the residual distortion gradually decreases, and the accuracy of the fiducial tracking process (Λ{· }) as well as that of the rigid body transformation fitting (H Π (C) ) improves. All the image data sets acquired at the isocenter and various offsets were used in thecalibration procedure. If not otherwise stated, images acquired with normal readout gradient polarity were used. The spherical harmonic polynomial of the n-th order has a total of 2n+1 model coefficients corresponding to the terms of different degrees. The calibration procedure can be performed using all the available terms at each order, or using a subset of these. In this work, only one degree at each order was used for each gradient in the calibration procedure (i.e., for X gradient, for Y gradient, for Z gradient). This configuration is consistent with the standard practice on GE's systems and is incorporated in their gradient coil design (Glover and Pelc 1986; Turner 1986 ). On our gradient system, this configuration is justifiable because although its X and Y gradient coils had an asymmetric coil pattern in the longitudinal direction, their design still incorporated the m=1 harmonic dependence in the azimuthal direction (Turner 1986 ).\nTo test the effects of high-order spherical harmonic polynomial terms (N > 5), the iterative calibration procedure (2) was performed by incrementally increasing the model order N from 5 to 10 including both even-and odd-order terms. For each parameterization, the fitting "}, {"section_title": "Results", "text": "Among the 160 fiducials in the ADNI phantom, 159 fiducials were successfully tracked in each data set corresponding to a single phantom positioning. One fiducial was missing due to its low signal intensity, potentially caused by solution leakage, which is a documented issue in the ADNI phantom fleet (Gunter et al 2009) . Consequently, a total of 1113 fiducials from seven data sets corresponding to seven phantom positioning were used in the iterative calibration procedure. The RMSE values in images corrected using calibrated coefficients of various orders including both odd-and even-order terms are shown in figure 2. As model order increases, the RMSE values gradually decreases and stabilizes after N = 9. Figure 2 shows that the use of higher-order terms up to 10 th order decreases the RMSE from 0.70 mm (5 th order) to 0.36 mm. As a comparison, the RMSE from images corrected with EM simulation coefficients (up to 10 th order) is determined to be 0.96 mm. Figure 2 also shows the RMSE values of images corrected using odd-order terms only. Comparison between RMSE values of using odd/even-order terms and using only odd-terms demonstrates the importance of the even-order terms in GNL correction for this asymmetric gradient system. Note that the number of polynomial basis used in the N=9 case with odd-order terms only is the same as that used in the N=5 case with both even and odd-order terms, but the RMSE was 1.10 vs 0.70 mm, respectively. This demonstrates that the RMSE improvement is explained by the even-order terms used in the GNL calibration and correction, rather than solely the number of polynomial basis used. The difference between fiducial positions estimated from corrected images using the coefficients calibrated from images acquired using normal and reversed readout gradient polarity is 0.08±0.05 mm (mean value ± standard deviation). It shows that the influence of off-resonance on the calibration procedure was effectively suppressed by the high BW (±125 kHz). Figure 3 shows examples of images acquired at the superior end of the 26-cm DSV before and after correction using the calibrated 10 th order coefficients. The image distortion apparent at the superior end of the phantom is successfully corrected. Figure 4 shows residual displacement of each fiducial after correction using the 10 th order coefficients obtained from EM simulation (a) and from calibration based on the described procedure (b), respectively. Each plot in the 3×3 panel of figure 4 shows the displacement of each fiducial from its true positions along the right/left (ΔRL), anterior/posterior (ΔAP) or superior/inferior (ΔSI) gradient axis in the corrected images, as a function of the true position of each fiducial along each gradient axis (RL, AP, SI). Comparison between figures 4a and 4b shows that the residual displacements after correction using the EM simulation coefficients are reduced using the calibrated coefficients. The residual distortion fields in figure 4a for simulation coefficients show linear spatial dependence in the ΔAP vs. AP panel as well as ΔSI vs. SI panel, which suggests a potential for improvement of image geometric accuracy by recalibrating the AP and SI gradients. Gradient calibration is determined during field service, and cannot be accounted for using the EM simulation based coefficients. However, this first-order spatial distortion is captured in the proposed calibration procedure, which leads to reduced distortion field shown in figure 4b . For reference, the calibrated firstorder coefficients were combined with the EM simulation coefficients to yield a third set of coefficients (i.e., instead of using the simulation-based coefficients alone) and used for GNL correction, which yielded a RMSE of 0.40 mm, about 11% higher than that of the proposed calibrated 10-th order coefficients (0.36 mm).\nAs an independent test, the ADNI phantom images acquired using a different FSPGR sequence were corrected using the model coefficient obtained from the proposed GNL calibration as well as the EM simulation coefficients (both up to 10 th order with odd and even terms). The residual RMSE measured from the corrected images are 0.36 mm (using coefficients from the proposed calibration), 0.96 mm (using coefficients from EM simulation) and 0.41 mm (the first-order coefficients from the proposed calibration combined with EM simulation coefficients), which demonstrate the improved image geometric accuracy using coefficients obtained from the proposed calibration.\nExamples of the 3D CUBE T2 FLAIR images after correction using the calibrated coefficients of various orders are shown in figure 5 . The difference images between two subsequent model orders (i.e., N = 5 vs. 7, N = 7 vs. 9, N = 9 vs. 10) are also shown, which highlight the relative contribution of high-order terms as model order N increases. The displayed window width of the difference images is reduced by 10 times to emphasize the difference and increase contrast. Including higher-order terms mainly impacts the geometric "}, {"section_title": "Discussion", "text": "In this work, we characterized the GNL field of a compact asymmetric MR gradient system using an iterative GNL calibration procedure and the ADNI phantom. The GNL-induced image geometric distortion presents a challenge for the compact asymmetric gradient system due to its more complex GNL fields, as compared to conventional whole-body MR gradients employing symmetric designs that typically require only 3 rd and 5 th order terms. Figure 2 shows that the GNL field of this new system requires spherical harmonic polynomials terms of higher order (up to N = 10) including both odd-and even-order terms for accurate characterization. Based on the trends observed in Figure 2 , we hypothesize that increasing the modeling order beyond the order of 10 will contribute minimal additional improvements in terms of RMSE, while increasing the risk of over-fitting and introducing potential numerical instability in data fitting process. The RMSE value across the entire 26-cm DSV of this system is reduced to 0.36 mm by use of up to 10 th order terms, which satisfies the quality control criteria used in the ADNI study (Gunter et al 2009) . As reported in a previous work, the American College of Radiology (ACR) MR phantom images corrected using the calibrated coefficients have successfully passed the ACR phantom image quality control (QC) tests . On the other hand, the on-scanner GNL correction based on only 3 rd and 5 th order coefficients from EM simulation failed the ACR phantom QC test due to inadequate geometric accuracy. The effects of off-resonance on the calibration procedure were minimized by the use of high acquisition bandwidth (BW = ±125kHz). The calibration procedure based on images acquired using readout gradient with normal or reversed polarity yielded equivalent GNL model coefficients. The mean difference in fiducial positions (0.08 ± 0.05 mm) estimated from images corrected using these two groups of coefficients were much smaller than the residual RMSE (0.36 mm).\nThe GNL information obtained from the calibration procedure can potentially benefit any MR application performed on this asymmetric gradient system. This is important in 3D volumetric imaging requiring high geometric accuracy, such as the 3D MPRAGE used in longitudinal tracking of brain white/gray matter volume change during the progress of Alzheimer's disease (Gunter et al 2009) . Specifically, the proposed calibrated higher-order model in GNL correction is especially relevant in improving the image geometric accuracy around the periphery of brain volume where grey matter volume is measured. In this case, the small volume change along with disease progress is especially susceptible to unaccounted for spatially-dependent GNL distortion, as patient positioning may vary across multiple scans which can cause GNL distortion of various degrees and lead to measurement error on the level of disease-induced volume change.\nThe GNL model coefficients obtained in this work are compatible with the GNL correction framework utilized on commercial MR systems. They can be used as an independent verification for model coefficients obtained from EM simulation. Since the calibration is performed on a per-system basis, it can potentially identify system specific errors such as coil winding errors outside of manufacturing tolerances, etc. (Janke et al 2004) , or identify system imperfections that require a recalibration of the gradient, as shown in figure 4 . Note that the EM simulation-based coefficients yields sub-optimal RMSE (0.40 mm) even after the first-order terms was accounted for when compared with the proposed iterative calibration procedure (RMSE = 0.36 mm). This can be explained by the discrepancy between the ideal coil design assumed in the simulation and the actual coil position, caused by variation introduced in coil manufacturing. The calibration procedure used in this work was performed using a subset of the full spherical harmonic polynomial expansion, consistent with the standard practice on GE's systems. It is possible to include the full expansion including all degrees terms in each order in the proposed calibration. However, a previous study has shown that the GNL correction accuracy in clinical applications is comparable across vendors using different model configurations (Gunter et al 2009) . In practice, different MR acquisitions will be subject to various distortions in addition to GNL, such as those due to eddy current, concomitant field, and object-dependent susceptibility. The true benefit from the use of the additional degree terms in the presence of other distortion sources needs further investigation, which is beyond the scope of this work.\nAlthough including the higher-order terms (N>10), or terms of other degrees for each order can potentially further decrease RMSE, it could render the calibration process to be susceptible to over-fitting, while the standard configuration adopted here can reduce this effect."}, {"section_title": "Conclusion", "text": "We have demonstrated that it is feasible to calibrate the GNL field of a compact asymmetric MR gradient system using an iterative data fitting procedure based on the spherical harmonic polynomial model and the ADNI phantom. The image distortion is reduced using the calibrated GNL information up to the 10 th order with both odd-and even-order terms. The demonstrated method can be applied to characterize and improve the spatial encoding accuracy of other gradient coils with unconventional designs. The ADNI phantom used in this work. The phantom is a 20-cm spherical shell that has 160 spherical fiducials (1.0 cm or 1.5 cm in diameters) with known positions. "}]