[{"section_title": "Introduction", "text": "SARS-CoV-2 is a beta-coronavirus that targets cells through the viral structural peak protein (S) that binds to the angiotensinconverting enzyme receptor 2 (ACE2). The viral particle uses host cell receptors and endosomes to enter cells. The host has a transmembrane serine type 2 protease (TMPRSS2) that facilitates entry into the cell through the virus S protein. Once inside the cell, viral polyproteins that encode the replicase-transcriptase complex are synthesized. The virus then synthesizes RNA through its RNA-dependent RNA polymerase. Finally, structural proteins are formed, and the release of viral particles is achieved. 1, 2 According to the World Health Organization, the contagion occurs through person-to-person. It can be through drops of flush that are expelled by infected patients when they cough, sneeze or speak. They can remain on surfaces for a certain time, depending on factors such as surface, humidity, or heat. Covid-19 infection is believed to have been initially transmitted to humans from an animal host, but the continued risk of transmission through contact with animals is uncertain. No cases of fecal-oral transmission have been reported. There is also no evidence that it survives in water, including sewage. [3] [4] [5] Suman in 2020 argues that the Covid-19 virus can survive up to 72 hours on plastic and stainless steel surfaces, less than 4 hours on copper surfaces, and less than 24 hours on cardboard surfaces. Based on data for other coronaviruses, the duration of viral persistence on surfaces also depends on ambient temperature, relative humidity, and initial inoculum size. Alcohol-based disinfectants can significantly reduce virus survival. [6] [7] [8] Transmission capacity is estimated from the basic reproductive number or R0. A value of R0 below 1 indicates a poor ability to spread infectious disease, R0 values greater than 1 indicates the need to apply control measures. The R0 indicates the potential value of transmission of infectious disease; it does not mean a more extensive disease, nor does it indicate the speed of transmission. Covid-19 has a value of 1.4-2.5, this is a number similar to R0 of the SARS coronavirus at the beginning of the epidemic, which was 2.2-3.7, at the end of the epidemic, this virus had a value of 0, 67-1.23. Another coronavirus, known as MERS, always remained with lower R0 values of 0.29-0.80. Based on these values, COVID-19 could be more easily transmitted than SARS, however, R0 is an average value, there are people who, although infected, will not transmit the disease to anyone. In contrast, others may transmit it to many contacts. This is known as \"super-dispersers\" as these patients were called in the SARS and MERS epidemics. Control measures can contribute to the reduction of R0. The current statistics on Covid-19 probably show a bias towards the most serious cases, which are the most likely to have been diagnosed. Mild and asymptomatic cases are probably estimated downward. 9, 10 When thinking about previous pandemics, such as Influenza, some points are contrasted with the current situation, analyzing data published by the Center for Disease Control and Prevention"}, {"section_title": "Significance for public health", "text": "In the present investigation, there is an analysis of socioeconomic and demographics variables that influence Covid- 19 (CDC). McFall-Johnsen highlights that both Influenza and Covid-19 have a predilection for the population of older adults, having a significantly higher impact after the age of 65. During the analysis conducted in the United States, 1,358 cases were confirmed, 38 of which resulted in death, a mortality rate of 2.8%. Meanwhile, South Korea implemented free coronavirus tests, conducting more than 180,000. 66 deaths of 7,869 cases were reported, with a mortality rate of 0.84%. Still, older patients in South Korea had a much higher death rate than younger patients. Patients older than 80 years had a mortality rate of 7.2%. 11, 12 Older people and people with chronic conditions, such as diabetes, hypertension, and obesity, have faced increased mortality from Covid-19. In a series of cases in China, the case-fatality rate was less than 0.5% among people under the age of 50, 1.3% between 50 to 59, and 3.6% between 60 to 69. The case-fatality rate may approach 10% for people over the age of 60, with risk more than 20 times greater than people under the age of 50 without a high-risk condition. 13, 14 South Africa has faced saturation of health services since more than 80% of people go to public health services for chronic diseases such as tuberculosis and HIV. Despite the efforts made to combat Covid-19, this country had to decrease the intensity of their blockages and isolation. On May 19, 2020, when a less stringent blockade was established, South Africa had recorded 17,200 cases and 312 deaths and had carried out 488,609 tests. 15 For its part, Iceland carried out a study that consisted of tests aimed at people with a high risk of infection and detection of the population (from 20 to 70 years) analyzing 6% of the population. This study contributed to the success of the measures implemented to curb the spread of the virus. As of April 4, 2020, a total of 1,221 of 9,199 people (13.3%) who underwent directed tests were positive. Children under 10 years of age are less likely to be infected than older people, with percentages of 6.7% and 13.7%, respectively. In the randomized screening group, the difference was even more marked, as none of the 848 children younger than 10 years tested positive, compared to 100 of 12,232 people (0.8%) older than 10 years. An increase in the percentage that tested positive was observed with age. However, it is not clear whether this is because children are less likely to become infected or symptomatic. 16 So far, there are no reports that relate the type of screening and the structure of the population pyramid in each country with the current mortality from Covid-19. However, there are estimates that associate the population pyramid structures with the mortality projected by Covid-19. It is considered important to analyze the variables to have real conclusions with current figures.\nThe present study aimed at analyzing the possible association between the structure of the population pyramid, type of isolation, Gross Domestic Product, and screening used to detect Covid-19 in the countries with the highest and lowest mortality."}, {"section_title": "Specific objectives", "text": "1. Compare the mortality rate of Mexico with other countries, due\nto Covid-19 and analyze the relationship of mortality with strategies used to control infections."}, {"section_title": "Analyze the countries with the highest and lowest mortality from", "text": "Covid-19 and compare their population pyramid structures. 3. Compare the mortality rate of countries that have carried out screening."}, {"section_title": "Design and Methods", "text": "This research is a cross-sectional study because it is carried out at a specific time that corresponds to the period of health contingency in the selected countries (March-June 2020), and analytical because the objective is to analyze the possible association between different variables with Covid-19 mortality.\nThe following variables were analyzed: A population pyramid, which due to its structure, is classified as regressive; is the type with the largest adult population, stationary; it has a balance of all age groups and progressive; it is the type with the highest young population.\nIsolation is classified into three types: high; (strict isolation), which is described in the study with the color red, moderate; (isolation for risk groups with authorization of essential activities) described in yellow, and smart; (without isolation and strict hygiene measures) represented with the color blue. Gross Domestic Product and screening used to detect Covid-19 in countries with the highest and lowest mortality.\nIn the databases of Medline, Elsevier, UpToDate, Cochrane, Pubmed, Ebsco in June 2020, we searched for articles on the mortality due to Covid-19 and types of the population pyramid, type of isolation, gross domestic product and type of screening. Only three articles were found related to the topic. However, these publications made estimates based on the predictions of the World Health Organization and the authors themselves.\nWhen reviewing journals such as New England Journal of Medicine, Lancet, and JAMA Network in June 2020, 25 articles on research-related topics were analyzed, of which, in the end, information from 14 of these was used to substantiate. Updated information was obtained from the official websites of Johns Hopkins University, University of Oxford, World Health Organization, Our World in Data, Government of Mexico, to make charts and graphics for analysis. 17, 18 A systematic review of documents and statistics expressing mortality in the ten countries most affected by Covid-19 and the ten least affected was carried out. Similarly, information was sought in the media by country, to obtain the type of isolation because this information is not published in indexed articles (links in the webliography).\nThe variables were analyzed to assess the association between them, to establish statistical inferences, since they were quantitative variables, the difference in means of the groups established was measured through the statistical package for <Excel version Microsoft Office 365.\nThis research is a study with non-probability sampling since, due to the diversity of information, the objects of study were selected based on the specific variables of the study (convenience sampling). 19 "}, {"section_title": "Results", "text": "The countries with the highest and lowest Covid-19 mortality rates were identified in the Covid-19 Information Center at Johns Hopkins University. This rate quantifies the number of deaths per 100,000 people. These data were obtained until 05/21/2020, placing in the ten countries with the highest mortality: Belgium (80. A comparative chart of the ten countries with the highest and lowest mortality was made considering the type of isolation they adopted in response to the Covid-19 pandemic associated with their population pyramid.\nThe group of countries with the highest mortality is associated with the regressive population pyramid, only Sweden has a stationary rate, and no country reports the progressive rate. In the group with the lowest mortality, the progressive type is predominant (except for Taiwan) and the moderate type of isolation ( Figure 1 ). According to the groups of countries associated with their type of isolation, the \"smart\" isolation group obtained mean mortality of 16. The moderate isolation group obtained a mean of 13.2 and the high isolation group 57.4 ( Figure  2 ). Based on the results shown in Figure 2 , a comparative graph is made where the average mortality in each of the groups of countries is shown on the x-axis and the type of isolation on the yaxis. The increase in mortality in countries with high isolation can be identified, obtaining an R2 of 0.699. It shows an identifiable trend line. The comparison of mean mortality in smart isolation and moderate isolation groups did not show statistically significant differences (p<0.13). In the comparison of the average mortality of the moderate and high isolation groups, a value of p<0.017 was obtained, and in the comparison of the average mortality of the high isolation and smart isolation groups, a p<0.001 was obtained. Both differences are statistically significant. Figure 3 shows a comparison of the type of population pyramid and the type of isolation. At the top are the groups of countries by type of population pyramid and the mortality rate per 100,000 inhabitants. The prevalence of moderate isolation is observed again in the progressive population pyramid group, with mean mortality of 0.73. In the regressive population pyramid group, there are subgroups of the three types of isolation, obtaining a mortality average in the moderate isolation subgroup of 11.5, an average in the high isolation subgroup of 57.8 and an average in the smart isolation subgroup of 10.9, the average mortality of the regressive population pyramid group of 24.2. The stationary population pyramid group obtained a mean mortality of 10.6.\nWhen comparing the average mortality of each group of countries concerning their type of population pyramid, the following results were obtained: The comparison of the mean mortality of the group with the progressive and stationary pyramid got a p<0.001. A comparison of mean mortality of the stationary and regressive pyramid group obtained a p<0.08, and the comparison of the mean mortality of the regressive and progressive pyramid group obtained p<0.001, therefore the differences they are statistically significant (Figure 4) .\nIn the group of countries with a regressive population pyramid, the three types of isolation were identified. Therefore, a comparison was made between these subgroups. A comparison of the average mortality of intelligent and moderate isolation obtained a p<0. 24 . The comparison of the mean of moderate and high isolation had a p<0.46, and the comparison of the mean of high and intelligent insulation had a p<0.22. In the comparisons, statistically significant results are surely not reported due to the number of concepts analyzed. However, it seems that high isolation is associated with higher mortality. Of the countries in Figure 3 , groupings are made corresponding to their Gross Domestic Product (GDP). A comparison was made of the countries with the highest GDP, average GDP value, and lowest GDP concerning the average mortality of each group. The results were: group with higher GDP: average mortality of 21.43, group with half GDP value: average mortality 15.13 and group with lower GDP: average mortality of 10.88. 20, 21 The comparison of the mean mortality of the group with the highest and lowest GDP obtained a p<0.33. The comparison of the mean mortality of the group with the highest and lowest GDP value obtained a p<0.42, and the comparison of the mean mortality of the groups with medium and lower GDP got a p<0. 25 . It seems that the higher the GDP, the higher the mortality rate; however, no statistically significant differences were found between the groups.\nCountries were analyzed by their type of screening, mortality, population pyramid structure, and type of isolation. It can be seen that most of the countries with the lowest screening correspond to those with a progressive population pyramid. In the group with the highest screening, the countries with a regressive pyramid predominate obtained average mortality in the group with the highest screening of 18.3 and 5.6 in the group with the lowest screening. When comparing the same variables in countries with a regressive population pyramid, it was found that the countries with the highest screening obtained a mortality of 21.5 and the countries with the lowest screening obtained average mortality of 0.5. When comparing the type of screening type, mortality, population pyramid, and type of isolation in countries with a progressive population pyramid, the following results are obtained: the group with the highest screening had mean mortality of 3.5 and the group with the lowest screening of 5.6. It can be seen that there is a difference in mortality with the types of screening in countries with a progressive population pyramid ( Figure 5 ). Figure 6 represents the relationship between the type of screening and the average mortality in countries with a regressive and progressive population pyramid. The comparison of mortality in countries with high screening and low screening in the regressive population pyramid was p<0.001, which is statistically significant. It also shows the difference in mortality by type of screening in countries with a progressive population pyramid. The comparison of mortality in these two groups obtained a value of p<0.036, finding a statistically significant difference."}, {"section_title": "Discussion", "text": "With the data obtained by the analysis, it is possible to identify that the population pyramid structure has a strong impact in the Covid-19´s mortality, since those countries with regressive pyramid despite high screening, it does not affect lower mortality, in contrast with those countries with a progressive pyramid, where the high screening impacts on the reduction of mortality. In the interactive website OurWorldinData, it is reported the level of screening of every country, where you can see the relation with the mortality. With the highest level of screening is Lithuania with 2.44 daily test per 1000 inhabitants, and with the lowest level of screeing is Mexico with 0.44 daily test per 1000 inhabitants. The latest estimate of total screening in Mexico is 1.48 per 1000 inhabitants, which means that for every 1000 inhabitants, only 14.8 have been screened. These results demonstrate that Mexico has had an ineffective screening, and this could be affecting the mortality rate that is being estimated. 22 Ibañez Martí, explains the dynamics of the beginning of cases in an epidemic, the index case is indicated in the primary outbreak, and the cases increase until they reach the maximum and then decreased. In the secondary outbreak that depends on the incubation period, new cases can appear, until transmission ceases when the susceptible individuals are exhausted. In the transmission outbreaks person by person, the curve rise will be slow and progressive. Every secondary case could give rise to new cases, and that is the reason why the curve usually adopts a bimodal shape depending on the latest cases from the secondary cases. 23, 24 Fajardo et al., in their analysis of Influenza in 2009 in Mexico, identified the behavior of the epidemic graph. The \"epidemic wave\" until July 9 lasted four months and the curve was bimodal, with the first phase between March 11 and May 27 and a second phase between May 28 and July 9; in the first month of the first phase, it has slow growth. In the following 15 days, from April 12 to 27, growth is rapid and reaches a maximum of 407 cases, before declining in the following month. The second phase of this wave begins on May 28 and reaches its maximum one month later, and later there is a decline that lasts until July 9, the date on which it was decided to cut the data for publication. [25] [26] [27] Based on Fajardo's analysis of the epidemic behavior, about the influenza epidemic, it is estimated that there is a second wave in the Covid-19 pandemic, due to the still vulnerable patients. Despite the prevention measurements of every country, this second wave is expected. Countries with a progressive population pyramid, such as Mexico, would be recommended to take preventive measures according to the results of this analysis, which would be intelligent or moderate isolation and the application of the highest possible screening to the population.\nThe last time the world responded to a global emerging disease epidemic of the scale of the current Covid-19 pandemic was the 1918-19 H1N1 influenza pandemic. In that pandemic, some communities, notably in the United States (US), responded with a variety of non-pharmaceutical interventions (NPIs), and two fundamental strategies are possible: mitigation and suppression. The actual pandemic global growth estimates are down, and one estimate suggests that a 1% lower growth in the global economy would translate to between 14 million and 22 million more people living in extreme poverty. We'll use numbers from the Imperial College report and the lastest UNO population report: absent measures to stem the rate of infection. [28] [29] [30] People with other health issues have a higher risk of mortality from Covid-19, and people in low-income countries are at increased risk of non-communicable diseases, as well as infectious diseases like HIV/AIDS and malaria. But the different age distribution still means that lowincome countries will likely lose far fewer people to the virus than high-income countries. 31, 32 This conclusion agrees with the results of this analysis. In the case, the lower mortality ratio for Covid-19 was found in the countries with a progressive population pyramid, which are mostly low-income countries. High-income countries have higher Covid-19 mortality due to their population pyramid structure, this being the conclusion of both analyzes. The regressive population pyramid structure accompanied by high isolation is estimated to be associated with increased mortality per 100,000 population. As well as we note the association of countries with a progressive population pyramid structure and moderate isolation with less mortality per 100,000 inhabitants. Larochelle in 2020, discusses the risk that each type of person contracting Covid-19 and the recommendations that are given regarding going to work. Older people have faced increased death from Covid-19. In a large series of cases in China, the case fatality rate was less than 0.5% among people under the age of 50, 1.3% between 50 to 59, and 3.6% between 60 to 69. These data affect the case fatality rate. approaching 10% for people over 60, with risk more than 20 times greater than people under 50 without a high-risk chronic condition. Covid-19's low, medium, and high-risk categories are mentioned in the analysis based on age and the presence of high-risk chronic conditions identified by the CDC. People with high risk in both domains should consider stopping to work and people with high risk in one domain and medium risk in the other, should discuss the risk with a doctor. 14, 33 A plan is required for the safe reentry of Covid-19 high-risk individuals and occupational risk. Universal testing of staff and patients in healthcare settings should be considered. As the economy of different countries increases, this implies millions of employees and it put you at risk of getting the disease of Covid-19 on the job. 34, 35 The recommendations given by Larochelle (2020) are highly related to the study carried out, and the results. It has been concluded that countries with a regressive population pyramid have had higher mortality from Covid-19, this, due to the number of older adults among its population. Older adults are the people with the most chronic risky conditions. Therefore, they are the people most at risk of having unfavorable results when contracting It should be considered a policy in which people seeking to return to work, school, or social activities are tested for infection and antibodies. Negative tests would certify freedom of movement for some time. If the antibodies are found to provide long-term protection against reinfection and transmission, which is plausible but not yet well established, a positive serological test would ensure certification. The stringency of a test regimen could be raised or lowered, depending on the community prevalence of Covid-19. China is following a version of this approach by rating community risk on a four-level color-coded scale. The risk of contagion would be avoided by modifying the insulation measures abruptly. [36] [37] [38] Therefore, It is agreed that more screening is necessary to have a lower risk of contagion and to detect all possible cases to have an impact on mortality. In countries with a progressive population pyramid, the performance of higher screening and intelligent or moderate isolation has positive results according to the results of the analysis carried out, reflecting lower mortality. On the other hand, with high isolation in regressive pyramids, mortality is statistically higher."}, {"section_title": "Conclusions", "text": "Countries with a regressive population pyramid are more affected by Covid-19, reporting high mortality (per 100,000 inhabitants). The association of the regressive population pyramid and high isolation reflects a higher mortality rate. Finally, there is no significant difference in the mortality of countries that had smart isolation and moderate isolation. In countries with a progressive population pyramid, they present significantly less mortality than those with a regressive pyramid, regardless of the type of isolation performed. However, in this group, if high screening impacts favorably, reduces mortality.\nThe appropriate protection measures for each country must correspond to their level of risk of contracting the infection and of having an unfavorable result. The risk must be measured concerning the population pyramid, age of the patient, and their comorbidities, to implement the corresponding isolation and screening measures.\nDuring the following months after the analysis carried out, the outcome of mortality from Covid-19 has been observed in different countries. The variable that had the most impact was screening since isolation was intermittent in most countries with a regressive population pyramid and remained moderate in most countries with a progressive population pyramid.\nAs can be seen in the coronavirus resource center at Johns Hopkins University, mortality in countries with a regressive population pyramid did not have a significant change, unlike countries with a progressive population pyramid. When comparing mortality and screening in countries with the two types of population pyramid in June 2020 and September 2020, it was concluded that countries with a progressive population pyramid can significantly modify their mortality if they screen the population, since these Countries having low screening increased their mortality. Unlike countries with a regressive population pyramid, screening does not have a strong impact on mortality because their type of population pyramid predisposes them to higher mortality."}]