[{"section_title": "Abstract", "text": "Abstract The recent failures of potential disease-modifying drugs for Alzheimer's disease (AD) may reflect the fact that the enrolled participants in clinical trials are already too advanced to derive a clinical benefit. Thus, well-validated biomarkers for the early detection and accurate diagnosis of the preclinical stages of AD will be crucial for therapeutic advancement. The combinatorial use of biomarkers derived from biological fluids, such as cerebrospinal fluid (CSF), with advanced molecular imaging and neuropsychological testing may eventually achieve the diagnostic sensitivity and specificity necessary to identify people in the earliest stages of the disease when drug modification is most likely possible. In this regard, positive amyloid or tau tracer retention on positron emission tomography imaging, low CSF concentrations of the amyloid-β 1-42 peptide, high CSF concentrations in total tau and phospho-tau, mesial temporal lobe atrophy on magnetic resonance imaging, and temporoparietal/precuneus hypometabolism or hypoperfusion on 18F-fluorodeoxyglucose positron emission tomography have all emerged as biomarkers for the progression to AD. However, the ultimate AD biomarker panel will likely involve the inclusion of novel CSF and blood biomarkers more precisely associated with confirmed pathophysiologic mechanisms to improve its reliability for detecting preclinical AD. This review highlights advancements in biological fluid and imaging biomarkers that are moving the field towards achieving the goal of a preclinical detection of AD."}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD) has an extensive preclinical stage, which is initiated 15 to 20 years prior to the emergence of clinical signs [1, 2] . Neuropathologic examination of older people who died with a clinical diagnosis of no cognitive impairment (NCI) or mild cognitive impairment (MCI) often reveal similar pathological signatures to those with frank AD [3] [4] [5] [6] [7] , suggesting a heterogeneous asymptomatic phase of AD that varies in elderly individuals. These concepts have energized the field to develop a biomarker for identifying individuals in the earliest preclinical stages of AD, to facilitate early intervention and to delay or perhaps even prevent the onset of clinical symptoms. Moreover, biomarkers for AD progression may also have clinical utility for tracking the efficacy of potential disease-modifying therapies.\nThe National Institute on Aging-Alzheimer's Association (NIA-AA) developed new working criteria for using a panel of prognostic fluid and imaging biomarkers to determine the likelihood of AD pathology and the staging of preclinical AD and the progression to prodromal and then clinical AD [1, 8] , which included cerebrospinal fluid (CSF) amyloid-β (Aβ) 42 , amyloid positron emission tomography (PET), CSF total tau, threonine 181 (T181) phospho-tau, mesial temporal lobe (MTL) atrophy on magnetic resonance imaging (MRI), and tempoparietal/precuneus hypometabolism or hypoperfusion on 18F-fluorodeoxyglucose (FDG)-PET ( Fig. 1) [1, 9] . In general, findings to date have suggested that cerebral amyloidosis, as measured by increased amyloid PET signal and lower CSF levels of Aβ 42 , precedes markers of neurodegeneration and synaptic dysfunction (e.g., FDG-PET, MRI, and CSF tau) prior to the onset of subtle cognitive impairment related to AD. More specifically, loss of hippocampal volume on MRI and the ratio of CSF Aβ 42 to total tau or phospho-tau are predictive of longitudinal changes in cognitive measures in the face of mounting AD pathology and its clinical sequelae [9] [10] [11] [12] [13] . In addition, arterial spin labeling MRI is used to examine the influence of changes in resting cerebral blood flow, as well as blood oxygenation level-dependent signal response in relation to PET-derived regional amyloid load [14, 15] , or to memory encoding in the MTL [16] . Finally, new advances in tau PET imaging and novel fluid biomarkers hold promise to increase biomarker reliability. In fact, tau PET imaging studies suggest that tau accumulation may track better with cognitive decline compared with Aβ deposition in people with AD [17] [18] [19] . The combinatorial use of fluid and imaging biomarkers with neuropsychological testing may eventually achieve the diagnostic sensitivity and specificity necessary to identify people in the earliest stages of the disease when modification is most likely possible. In this regard, advancing biomarker research to clinical diagnostic settings will be critical for recruiting appropriate individuals who meet inclusion criteria for clinical trials. This article reviews the latest advancements in biological fluid and imaging biomarkers that are moving the field towards achieving this goal."}, {"section_title": "CSF Core Biomarkers", "text": "The CSF is in direct contact with the extracellular space of the brain and serves as a substrate for biochemical changes related to brain pathology. With respect to AD, the current core CSF biomarkers-Aβ 42 , total tau, and phospho-tau (phosphorylated specifically at residue T181)-are assayed by enzyme-linked immunosorbent assay (ELISA) or multiplexed assays as surrogates for mounting neuropathologic plaque and neurofibrillary tangle (NFT) lesions. Hence, it is generally thought that lower CSF Aβ 42 levels correlate with accumulating plaque deposition and higher CSF tau levels correlate with neuronal injury during AD progression.\nEarly CSF biomarker studies were cross sectional and focused on differentiating AD from control patients. After it was found that Aβ is generated as a soluble protein during normal cellular metabolism and secreted into the CSF [20] , biomarker research found that CSF total Aβ was decreased slightly in AD [21, 22] . However, as these initial findings did not discriminate between different Aβ isoforms, there was considerable overlap between patients with AD and controls, while other studies reported no change in CSF total Aβ in AD [23] . As the Aβ 42 isoform was found to be more prone than Aβ 40 to aggregate at physiologic pH and form the nidus of [1] , as originally proposed by Jack et al. [9] . In this model, amyloid β (Aβ) changes (red) as identified by cerebrospinal fluid (CSF) Aβ 42 assay or positron emission tomography (PET) amyloid imaging precede markers for synaptic dysfunction (orange), as evidenced by fluorodeoxyglucose (FDG)-PET and functional magnetic resonance imaging (fMRI). These alterations are closely associated with increased CSF tau (green), which serves as a surrogate for neuronal injury. The dashed orange line indicates that synaptic dysfunction may be detectable in apolipoprotein E (ApoE) ε4 carriers before detectable Aβ deposition. Brain atrophy on structural MRI (sMRI; blue) and subtle decline in cognitive function (purple) mark the transition from preclinical AD to mild cognitive impairment (MCI). (B) Hypothetical staging of preclinical AD. Stage 1 and 2 individuals may not progress to stage 3, whereas stage 3 individuals may be more likely to progress to MCI and AD. Reprinted from Alzheimer's and Dementia, Sperling et al., Toward defining the preclinical stages of Alzheimer's disease: Recommendations from the National Institute on Aging-Alzheimer's Association workgroups on diagnostic guidelines for Alzheimer's disease, 7 (3): 280-292, with permission from Elsevier senile plaques [24, 25] , subsequent analysis of CSF Aβ 42 used C-terminal-specific antibodies. These early reports consistently showed a~50% decrease in Aβ 42 in moderate AD compared with age-matched control subjects [26] [27] [28] [29] .\nThe first study of CSF total tau as a biomarker for AD used a pan-tau antibody that recognized both unphosphorylated and phosphorylated tau, and reported an~1000% increase in CSF tau from older patients with AD compared with younger adult controls [30] . Subsequent age-matched studies using tau monoclonal antibodies that detect all isoforms of tau independently of phosphorylation state found an~200% to 300% increase in total tau in AD [31] [32] [33] . ELISA methods were also developed for phospho-tau as a putative readout of tau pathology by targeting epitopes associated with NFTs, including threonine 181, threonine 231, and serine 396 + 404 (the PHF-1 epitope), among others, with observations of up tõ 300% increases in these phospho-tau moieties in the CSF of patients with AD [34] [35] [36] . Blennow [37] evaluated the sensitivity and specificity of core CSF biomarkers for differentiating AD from controls. CSF Aβ 42 demonstrated a mean sensitivity of 86% and a mean specificity of 89%. By contrast, total tau yielded a mean sensitivity of 81% and a mean specificity of 91%, whereas the diagnostic accuracy of multiple forms of phospho-tau also yielded a mean sensitivity of 81% and a mean specificity of 91% [37] . Moreover, combining measurements of Aβ 42 and tau concentrations in CSF improved diagnostic potential. For example, the CSF ratio of phospho-tau (T181) to Aβ 42 was found to be superior to either measure alone for identifying AD among controls and other neurologic diseases, with a sensitivity of 86% and specificity of 97% [38] . Another report revealed a sensitivity of 96% and specificity of 86% using the CSF ratio of total tau to Aβ 42 [39] . While Aβ 42 demonstrates good sensitivity for differentiating AD from nondemented subjects, combining CSF Aβ 42 and tau measures for the differential diagnosis of AD appears to mitigate some of the nonspecific biochemical characteristics of Aβ 42 , which is also reduced in Creutzfeldt-Jakob disease, multiple system atrophy, Lewy body dementia (LBD), frontotemporal dementia (FTD), vascular dementia, amyotrophic lateral sclerosis, and neuroinflammation, in addition to AD [40, 41] . However, CSF phospho-tau levels are particularly useful in differentiating AD from other dementias such as LBD, FTD, and vascular dementia with more than 80% specificity [42] .\nCSF biomarker development naturally extended to longitudinal studies and the utility of Aβ 42 , total tau, and phosphotau for predicting conversion from NCI to MCI and to AD. In this regard, high CSF total tau and low CSF Aβ 42 was found in 90% of MCI cases that progressed to AD compared with 10% of stable MCI cases [43] . Likewise, high CSF phosphotau (T231) was also found in MCI cases that progressed to AD compared with stable MCI cases and correlated with decline on neuropsychological testing [44, 45] . Several additional longitudinal studies of clinically well-characterized cohorts validated the concept that the CSF core biomarkers could be used to help predict likelihood of conversion. Notably, Hansson et al. [46] showed that the combination of high total-tau with a low Aβ 42 /phospho-tau (T181) ratio at baseline yielded 95% sensitivity and 87% specificity for the detection of incipient AD. Fagan et al. [10] compared baseline CSF samples from 139 patients with Clinical Dementia Rating (CDR) scores of CDR 0 (cognitively normal or NCI), CDR 0.5 (MCI or very mild AD), or CDR 1 (mild AD) with followup clinical assessments [10] . Cox proportional hazard models adjusted for age, sex, education, and APOE genotype revealed that participants with CSF total tau/Aβ 42 and phospho-tau (T181)/Aβ 42 significantly predicted conversion from CDR 0 to CDR greater than 0, with higher ratios predicting a faster rate of conversion than those with low ratios [10] . Interestingly, the tau/Aβ 42 ratios were similar in CDR 0.5 (MCI) and CDR 1 (mild AD), underscoring the diagnostic potential of the biomarker for identifying prodromal disease. A more recent analysis of CSF samples from patients in the Amsterdam Dementia Cohort showed that the tau/Aβ 42 ratio was the most robust combination for predicting dementia due to AD in subjects with MCI [47] .\nGiven the effects of apolipoprotein E4 (ApoE4) gene dosage on the risk of AD and age at dementia onset [48] , several groups have evaluated biomarker trajectories as a function of ε4 allele number, with varying agreement [49] [50] [51] [52] [53] . Most recently, 2 studies examined the effects of ApoE4 on longitudinal CSF core biomarkers within cohorts of cognitively normal middle-to-older-aged subjects. Sutphen et al. [52] found that ε4 homozygotes yielded among the lowest CSF Aβ 42 levels, whereas ε4 noncarriers were associated with the highest CSF Aβ 42 levels, with heterozygotes falling in the middle range. Moreover, longitudinal increases for total tau and total tau/ Aβ 42 and decreases in cognitive function appeared to overlap to a greater extent in ε4 carriers than in noncarriers [52] . Likewise, Toledo et al. [53] found that ε4 carriers showed higher CSF tau and lower Aβ 42 values than ε3/ε3 patients, with the largest effect observed for Aβ 42 . Whereas Aβ 42 values remained stable up to the beginning of the seventh decade in healthy controls without any ε4 alleles, Aβ 42 levels of healthy controls with 1 or 2 ε4 alleles showed a decrease beginning during the fifth decade of life and plateaued at the middle of the eighth decade. Hence, the ApoE gene dosage risk factor for AD may be reflected in CSF biomarkers-particularly low Aβ 42 levels-in middle age as a potential signal for the onset of preclinical AD.\nThe progression from single-center studies to multicenter efforts were initially faced with problems related to intersite differences such as CSF collection, storage methods and assay platforms [54] . For example, a 12-center study of 750 individuals with NCI, MCI, and AD recruited in Europe and the USA found that the combination of CSF Aβ 42 / phospho-tau (T181) and total tau identified incipient AD within the MCI group with fairly good accuracy, but with lower sensitivity (83%) and specificity (72%) than reported for single-center studies [11] . The Aβ 42 assay had considerable intersite variability, and the authors highlighted the need for standardization of analytical techniques and clinical diagnostics [11] . Indeed, standardization efforts became a major focus for multisite studies, including the AD Neuroimaging Initiative (ADNI). Within the Biomarker Core of ADNI, efforts were made to standardize the analysis of all collected baseline CSF samples by using the same multiplexed xMAP bead-based platform (Luminex, Austin, TX, USA) with Aβ 42 , phosphotau (T181), and total tau monoclonal antibodies provided in the INNO-BIA Alz Bio3 immunoassay kit (Innogenetics, Ghent, Belgium). The initial utility of the approach was demonstrated by comparing cut-off values of Aβ 42 , phospho-tau (T181), and total tau in an ADNI clinical cohort of control participants, and subjects with MCI and AD and comparing those values with CSF from independent, autopsy confirmed control and AD cases [55] . The baseline CSF profile for total tau/Aβ 42 was detected in 33 of 37 ADNI participants with MCI who converted to probable AD during the first year of the study. By contrast, Aβ 42 cut-off values derived from the ADNI cohort was the most sensitive biomarker for AD in the autopsy cohort, with a receiver operating characteristic area under the curve (AUC) of 0.913 and sensitivity for AD detection of 96.4% [55] . Using this same standardized procedure, Shaw et al. [56] analyzed within-site and intersite assay reliability across 7 ADNI centers using aliquots of CSF from normal controls and patients with AD. Each center performed 3 analytical runs using separate fresh aliquots of each CSF sample examined and data were analyzed using mixedeffects modeling to determine assay precision. The coefficient of variation was 5.3% for Aβ 42 , 6 .7% for total tau, 10.8% for phospho-tau within centers, and 17.9% for Aβ 42 , 13.1% for total tau, and 14.6% for phospho-tau between centers [56] . More recently, Toledo et al. [57] investigated biomarker changes in ADNI controls, and subjects with MCI and AD across multiple centers over a 4-year period using standardized procedures [57] . In this study, clinical diagnosis was associated with abnormal baseline levels of both Aβ 42 and total tau, or with abnormal phospho-tau (T181) levels alone. Moreover, low baseline Aβ 42 predicted greater increases in phospho-tau (T181) levels on follow-up, whereas neither baseline total tau nor phospho-tau was associated with an Aβ 42 decrease during follow-up, suggesting that changes in Aβ 42 levels precede tau levels [57] . Notably, the longitudinal stability of these biomarkers varied in patients with normal baseline levels: 1 group remained stable over time, whereas the other had decreasing Aβ 42 and increasing phospho-tau (T181) levels over time. When the stable population was excluded from analysis, the time taken to reach cut point levels of biomarkers was significantly shortened. Hence, longitudinal analysis of CSF biomarkers revealed substantial cohort heterogeneity and the lack of a clear association between level changes and cognitive status, at least over a span of 4 years. However, the suggestion that changes in Aβ 42 levels precede tau levels reflects a similar finding in a European cohort showing that levels of Aβ 42 are already fully decreased at least 5 to 10 years before conversion to AD, whereas increases in the tau markers appear later for converters [58] . However, as proposed by the new working criteria for AD, the appearance of elevated baseline CSF tau and other markers of neurodegeneration may reliably predict the onset of cognitive impairment in preclinical subjects [10, 59] . Hence, despite lingering pre-and post-analytic issues of intersite variability, the CSF core biomarkers developed to date are useful for the early diagnosis of AD and prediction of disease progression (Fig. 2) . Altered baseline levels in these markers, used in combination with imaging and other novel fluid biomarkers, as discussed below, may be clinically beneficial for the reliable identification of preclinical and prodromal disease for the efficient design of drug intervention clinical trials (Fig. 1 )."}, {"section_title": "Novel CSF Biomarkers", "text": "Despite the promise for CSF core biomarkers for the identification of presymptomatic AD, the inherent heterogeneity in the progression of mounting plaque and tangle load over time between patients, as well as the presence of mixed pathologies and different comorbidities, highlight the need to augment the CSF core biomarkers with novel proteins to improve diagnostic accuracy in longitudinal studies [60] [61] [62] . A growing list of candidate biomarkers for AD derived from the CSF has been proposed, including apolipoprotein isoforms [63, 64] , brainderived neurotrophic factor [65] , prostaglandin D2 synthase:transthyretin dimers [66] , synuclein isoforms [67, 68] , ubiquitin [69, 70] , SNAP-25 [71] , neurogranin [72] [73] [74] , visinin-like protein 1 (VILIP-1) and chitinase-3-like protein 1 (YKL-40) [52, 75, 76] , and the neurofilament light chain (NFL) [77] [78] [79] . In particular, a longitudinal CSF analysis of the postsynaptic protein, neurogranin, in 378 healthy controls and subjects with MCI and AD revealed significantly higher neurogranin in MCI converters and patients with AD compared with controls and MCI nonconverters [74] . Neurogranin was strongly correlated with CSF tau but not Aβ 42 levels, and high neurogranin levels were significantly associated with deterioration in cognitive performance, hippocampal volume on MRI, and cortical glucose metabolism on FDG-PET in healthy controls [74] . Likewise, CSF levels of the neuronal calcium sensor VILIP-1 differentiated CDR 0.5 to 2 from CDR 0 controls and individuals with other dementias such as LBD and FTD and correlated with CSF tau, phospho-tau (T181), and brain volume. CSF VILIP-1/Aβ 42 predicted future cognitive impairment at least as well as the tau/Aβ 42 ratios, and VILIP-1 and VILIP-1/ Aβ 42 accurately predicted the presence or absence of amyloid PET positivity, regardless of clinical diagnoses, suggesting its augmentative utility for preclinical AD screening [80] . NFL has also emerged as a potential surrogate marker for disease pathogenesis related to axonal pathology. In this regard, a recent study using cases from the ADNI cohort showed that CSF NFL was higher in subjects with MCI and AD than individuals with NCI, and that higher NFL concentration was associated with faster whole-brain and hippocampal atrophy, white matter intensity changes, and cognitive deterioration over time [79] . Another potential CSF marker for disease progression is pro nerve growth factor (proNGF), which is the predominant NGF moiety in brain that displays dual survival/apoptotic properties and is increased in MCI and AD postmortem brain tissue [81] [82] [83] . Our group recently showed that CSF levels of proNGF were higher in subjects with amnestic MCI and mild AD, as well as CDR 0.5 and 1, than in people with NCI or CDR 0, respectively [84] . Increasing CSF proNGF was significantly associated with cognitive deterioration, and the combination of proNGF/Aβ 42 performed better than tau/Aβ 42 for distinguishing amnestic MCI from controls [84] . Collectively, these novel CSF biomarkers could reflect molecular changes associated with disease pathogenesis, including deficiencies in synaptic function and cell survival factors.\nWith respect to inflammatory pathways, the proinflammatory chitinase YKL-40, which was isolated initially in a proteomic screen, displayed significantly higher levels in CDR 0.5 and 1 compared with CDR 0 individuals in a discovery and validation cohort, with CSF YKL-40/Aβ 42 ratio predicting the conversion from CDR 0 to CDR > 0, as well as total tau/Aβ42 and phospho-tau (T181)/Aβ 42 [85] . Other notable promising CSF candidate markers include protein modulators of the endosomal-autophagy-lysosomal system [86] , which may reflect the major disturbances found in these pathways in MCI and AD [87] [88] [89] ; protein and lipid markers of oxidative stress in MCI and AD [90] [91] [92] ; and alterations in microRNA profiles that may reflect underlying dysregulation of amyloid and tau pathways [93] [94] [95] . Two recent metareviews [96, 97] provide a current state of the field with respect to the utility of CSF core ( Fig. 2A) and novel (Fig. 2B ) biomarkers for identifying people at risk for dementia. As the most rigorously tested surrogates for AD pathogenesis, CSF amyloid-beta Aβ and tau levels will continue to help refine a reliable composite biomarker along with imaging and cognitive parameters. Ultimately, the addition of novel biomarkers to augment the differential diagnosis of AD and other dementias in their preclinical and prodromal stages may provide a front-line screen for early intervention and optimal subject recruitment for clinical trials. "}, {"section_title": "Molecular Neuroimaging Biomarkers", "text": "The development of PET radioligands for the in vivo detection of fibrillary Aβ deposits and intracellular tau aggregates has provided a significant advance in biomarker development, complementing CSF studies and expanding our knowledge of how early amyloid plaques and NFTs begin to develop in the preclinical phases of AD. Although the relative role that these hallmark AD pathologies play in the onset of synaptic loss, neuronal cell death, and clinical symptoms of MCI and early AD remain to be determined, it is becoming evident that they precede clinical onset by years or decades [1] .\nAlthough amyloid PET and CSF biomarkers can identify early AD with similar accuracy [98] , highly sensitive imaging radioligands used in combination with other novel AD biomarkers will be critical for timely initiation of therapy trials in pathological aging, MCI, and early AD.\nPittsburgh compound B [PiB; [C-11]6-OH-BTA-1; [N-methyl-11C]2-(4'-methylaminophenyl)-6-hydroxybenzothiazole] is the most widely used amyloid imaging agent and the first Aβ selective radiotracer to differentiate AD from NCI by PET [99, 100] . PiB binds with a high affinity to β-sheet structured amyloid aggregates [101] , and owing to its good brain penetrance and fast clearance is suitable for PET imaging [102] . In NCI controls, PiB PET retention is typically low in cortical, subcortical, and cerebellar regions, while in AD it is high in cortical regions displaying Aβ plaques at postmortem evaluation [103] . With respect to CSF core biomarkers, a strong concordance between PiB-PET and CSF Aβ 42 was seen in mixed cohorts of NCI and AD [104, 105] , or NCI, MCI, and AD [106] , with no correlation between PiB-PET and CSF tau [104] . These findings were corroborated in other cohorts with NCI [107] , MCI [108, 109] and AD [105] . Some longitudinal studies suggested that amyloid PET may be more sensitive than CSF Aβ 42 in identifying subjects with MCI who will convert to AD. Forsberg et al. [108] reported that all those with MCI who converted to AD had high PiB PET retention, but less than half of them had pathological CSFAβ 42 . In another study, 87% of MCI cases had high PiB retention, with only 53% having pathological CSF Aβ 42 [109] . A clinical-pathological study of a PiB-negative patients with NCI reported that 12 months after PET scan there was a decrease in CSF Aβ 42 and a slight increase in CSF tau and p-tau concentrations, and 6 months later the individual transitioned to MCI [110] . In this case, brain autopsy revealed primarily diffuse Aβ plaques in the neocortex, suggesting that compared with PiB-PET, CSF Aβ 42 is a more sensitive biomarker for detection of AD pathology [110] . Postmortem brain studies indicate that PiB binding is most prominent in classic neuritic plaques and vascular Aβ deposits [cerebral amyloid angiopathy (CAA)] [111] [112] [113] [114] , yet it does not bind to NFTs or non-AD neuropathology [112, [115] [116] [117] [118] . While both Aβ plaques and CAA can contribute to PiB-retention in vivo, CAA is most frequent in the occipital lobe, which is less affected with plaques when compared with other cortical regions [119, 120] . Johnson et al. [119] reported that all nondemented subjects diagnosed with clinically probable CAA and all AD subjects were PiB-positive. Global cortical PiB retention in CAA was greater relative to NCI cases, and lower than in AD; however, the occipital-to-global PiB ratio was greater in CAA than in AD, similar to other CAA cohorts [121] . An autopsy evaluation of a PiB positive patient with mild AD (CDR = 1; Mini-Mental State Examination score = 25) and a clinical diagnosis of LBD found numerous neocortical diffuse Aβ plaques but only rare cored plaques and severe CAA [111] . These mixed results support the need for postmortem evaluation of PiB-PET-imaged brains for validating radioligand sensitivity and specificity, and for estimating the threshold level of underlying pathology for PET positivity. Moreover, the presence of Aβ deposits in PiB negative patients with NCI and MCI brings into question the sensitivity of PiB for detecting fibrillary Aβ [110, 117, 122] [123, 124] . In other studies, [H-3]PiB binding in multiple brain regions was able to distinguish between clinical categories, and correlated with concentrations of fibrillar Aβ by ELISA [125, 126] . About 10% to 20% of patients with clinical AD are PiB negative, in agreement with autopsy reports, suggesting that they may have been clinically misdiagnosed [4, 100] . In a study using [F-18] florbetapir PET imaging, amyloid PETnegative individuals with AD and MCI were more likely to be ApoE4-negative, exhibit lower CSF tau concentrations, and perform better on longitudinal cognitive testing, while amyloid PET-negative subjects with MCI also had milder hippocampal atrophy and hypometabolism [127] . It is also well established that 20% to 30% of NCI subjects are PiB positive [99, 118, [128] [129] [130] [131] [132] , consistent with autopsy evidence of significant AD pathology in NCI cases [7, 133, 134] . This incidence increases up to 65% in those aged > 80 years [135] . However, these observations are influenced by a study center's threshold for defining amyloid positivity, its clinical definition of Bcognitively normal^, and ApoE genotype status. ApoE4 is associated with higher PiB PET retention in elderly NCI [131, 136] , while in people with MCI it confers an increased likelihood of converting to AD [137, 138] . Compared with noncarriers, ApoE4-positive patients with a PiB negative scan have more than double the rate of progression to PiB positive [139] , reminiscent of ApoE4 effects on lower CSF Aβ 42 . An association between ApoE4 and increased PiB PET retention was reported in cross-sectional [140] and longitudinal [141] analyses of AD cohorts, while some investigations found no such association [99, 138, 142] , and ApoE2 was associated with lower PiB PET retention [136] . The reason for preserved cognition despite significant plaque load in PiB positive NCI is not clear. It has been suggested that resilience to AD pathology can be due to less advanced Bmaturation^of amyloid plaques, preservation of neurons and synapses, less accumulation of soluble tau in synapses, and less severe inflammatory responses [143] . Nevertheless, PiB positive individuals with NCI are at risk for developing cognitive decline when compared with PiB negative individuals with NCI matched by age and education [132, [144] [145] [146] , and PiB positive in elderly people with NCI is a marker for preclinical AD [1] . Similarly, PiB positive subjects with MCI are more likely to convert to AD [108, 109, 146] , and individuals with amnestic MCI are more likely to be PiB positive than those with nonamnestic MCI [147, 148] . Thus, amyloid PET imaging is useful in identifying people that will develop AD, or those with pathology unrelated to AD.\nOne of the main drawbacks of PiB-PET imaging is the short radioactive half-life of carbon-11 (~20 min), which limits the distribution of [C-11] PiB to PET imaging centers with on-site cyclotrons. However, longer-lived fluorine-18 (F-18)-labeled amyloid PET tracers have been developed that are similarly effective in detecting fibrillar Aβ pathology [149, 150] . [F-18] flutemetamol is a 3'-fluoro analog of PiB (3'-F-PiB) with similar retention characteristics, although slightly greater retention in white matter [151] . In a phase I clinical study of subjects with NCI and mild AD, the AD group had greater retention of [F-18] flutemetamol in the neocortex and striatum but not in the white matter, cerebellum, and pons [152] . A multicenter phase II trial of [F-18] flutemetamol in 15 older patients with NCI (>55 years), 10 young subjects with NCI (<55 years), 20 patients with amnestic MCI, and 27 patients with early AD reported 93.1% sensitivity and 93.3% specificity [153] . As expected, regional retention levels of [F-18] flutemetamol and PiB correlated strongly in MCI and AD [153] , supporting the notion that these 2 related tracers are comparable in detecting fibrillar Aβ deposits in vivo. A clinicopathological study in a large end-of-life population demonstrated high sensitivity and specificity of [F-18] flutametamol [154] ."}, {"section_title": "[F-18]florbetapir [(E)-4-(2-(6-(2-(2-(2-[F-18]-fluoroethoxy)ethoxy)ethoxy)pyridin-3-yl)vinyl)-N-methyl benzenamine; [F-18]AV-45; or amyvid]", "text": "[155] has also proven to be effective in imaging Aβ fibrillar pathology in vivo [156] . Those with AD displayed higher [F-18]florbetapir retention in cortical regions when compared with NCI, while white matter and cerebellar retention was not different between AD and NCI [157] . In a large multicenter trial, positive [F-18] florbetapir PET scans were seen in 28% of NCI (>55 years old), 47% of MCI, and 85% with AD [158] . [F-18] florbetapir PET was negative in subjects with NCI younger than 50 years of age, and correlated with neuritic plaques assessed postmortem in 29 terminally ill patients [159] . High sensitivity and specificity was reported for [F-18] florbetapir PET using global cortical standardized uptake value ratio to differentiate AD from NCI [160] . [F-18] "}, {"section_title": "florbetaben [(E)-4-(2-(4-(2-(2-(2-[F-18]fluoroethoxy)ethoxy)ethoxy)phenyl)-vinyl)-N-methyl-benzenamine; [F-18]AV-1 or BAY-94-9172] has", "text": "higher neocortical PET retention in AD compared with NCI or patients with FTD [161, 162] . Increased [F-18] florbetaben gray matter retention was reported in AD compared with MCI or non-AD dementias [163] . High sensitivity and specificity of [F-18] florbetaben was seen in a multicenter phase II study consisting of 69 subjects with NCI and 81 with clinically probable AD [164] , a single-center phase 0 study of 10 subjects with NCI and 10 patients with clinically probable AD [165] , and in a clinicopathological study from a multicenter phase III trial [166] . These studies indicate the utility of these new tracers as markers for AD.\nNon-amyloid PET imaging methods can provide complementary information, such as assessing neuronal dysfunction with FDG-PET [167] . In patients with AD, decreased FDG-PET levels of cerebral glucose metabolism show a typical regional pattern of posterior temporoparietal to frontal hypometabolism [168] [169] [170] . Similar changes in cerebral metabolism were reported in NCI individuals with an ApoE4 allelle [171, 172] , and in MCI [173] [174] [175] [176] [177] [178] [179] [180] . FDG PET also predicted progression from NCI and MCI to AD [181] [182] [183] . The relationship between PiB-PET and FDG-PET remains to be determined in studies involving large cohorts of individuals with NCI, MCI, and AD. Agreement between these 2 methods is high in differentiating AD from NCI, but lower in classifying those with MCI [184] . MCI subjects were noticed to display positive correlations between PiB-PET and FDG-PET, possibly reflecting increased brain reserve in nonconverting MCI subjects [185] . Lowe et al. [147] reported that PiB-PET and FDG-PET had similar diagnostic accuracy, however, PiB PET was significantly better at separating MCI subtypes. In contrast, others have not observed significant correlations between PiB-PET and FDG-PET in patients with AD, and cognitive performance correlated strongly with FDG-PET but not with PiB-PET [186] . Amyloid deposition and brain atrophy are common in older individuals with NCI and MCI [100] , and hippocampal atrophy can be detected in elderly NCI, MCI and AD using structural MRI [187] [188] [189] [190] [191] . MRI studies demonstrated that the rate of hippocampal atrophy is associated with conversion from MCI to AD [189, [192] [193] [194] [195] [196] [197] . Globally, cerebral atrophy is observed spreading from within the MTL (i.e., hippocampal volume and entorhinal cortex thickness) to the parietal, occipital, and frontal lobes over the course of the disease, with future MCI converters most closely reflecting this pattern and exhibiting the highest rates of change [198] [199] [200] . Notably, a significant positive correlation was reported between rates of whole-brain atrophy on volumetric MRI and cortical PiB PET retention in AD [201] [202] [203] [204] .\nAD is a multiproteinopathy with fibrillar aggregates of both Aβ and tau. While Aβ is widely believed to precede tau pathology, when compared with amyloid plaques NFTs correlate better with cognitive dysfunction in AD [205] . Thus, the recent development of tau-specific tracers has been an important advance to complement amyloid imaging, although less vigorously characterized and validated [206] . Multiple challenges associated with development of tau ligands relate to different ultrastructural and isoform composition of tau deposits, and have been addressed elsewhere [207] . Several groups reported tau-selective PET radioligands, including [F-18]-labeled THK compounds [208] [209] [210] [211] [212] [213] [214] [215] [216] [217] ; PBB compounds [218] [219] [220] ; and [F-18]-labeled T807 and T808 compounds [18, 19, [221] [222] [223] [224] ; and with the tau imaging field developing rapidly new PET tracers are emerging [225] . Characterization studies of many of these tau candidate ligands are ongoing in subjects with NCI and AD, while studies of MCI are just emerging.\n[F18]AV-1451 (or [F18]T807) has a promising pattern of retention corresponding to known distribution of NFT in AD brains [226] . This ligand shows an association with cognitive impairment [17, 227] , greater PET retention in the oldest with NCI [19] , MCI, and AD compared with younger subjects with NCI [221] . In elderly NCI from the Harvard Aging Brain Study Cohort, cortical [18-F]AV-1451 PET correlated with CSF measures of total tau and phosphorylated tau [228] .\n[18-F]AV-1451 PET was abnormally high in cortical, entorhinal, and parahippocampal regions (but not in the hippocampus) in individuals with MCI and AD compared with patients with NCI and greater radioligand retention in the inferior temporal gyrus correlated with impaired cognition [18, 19] . Another study of [18-F]AV-1451 PET (20 patients with NCI, 15 with MCI, and 20 with AD) observed that retention was increased in multiple cortical regions in patients with AD and in the entorhinal cortex in MCI; increased PET retention correlated with impaired global cognitive performance [229] . It has also been reported that regional [F-18]AV-1451 PET retention corresponded to clinical manifestation of AD and increased [F-18]AV-1451 PET signal in the hippocampus correlated strongly with regional structural MR (volume) impairment only in the presence of Aβ pathology [230] . Although these reports indicate that [F-18]AV-1451 may be an additional tool for diagnosing AD, a lack of extensive imaging-topostmortem validation impedes further advancement in the field [206] . Only a limited in number tau ligand autoradiographic investigations using autopsy tissue sections have compared AD with non-AD tauopathy cases. Two studies have reported that AV-1451 binds preferentially to AD tau isoforms and displays a binding distribution corresponding better to NFTs than to Aβ plaques [231, 232] . While binding to TDP-43 and α-synuclein pathology was minimal or absent, these studies identified off-target binding in some areas, which requires further investigation [231, 232] . Another investigation of [F-18]AV-1451 binding using postmortem brain tissue also reported high specific signal in AD compared with non-AD tauopathies, however, no correlation was observed with tau pathology load within groups [233] . [F-18]AV-1451 imaging combined with postmortem histopathology of an autopsy case carrying the microtubule-associated protein tau (MAPT) gene mutation showed a strong correlation between regional tau pathology and antemortem PET retention [234] . The extent to which tau PET radioligands can discriminate between the accumulation of tau pathology in AD and other age-related tauopathies remains to be determined [235] .\nAlthough amyloid and tau PET imaging represent major advances in AD, there are still a number of limitations and unresolved questions. In contrast to their good specificity, the sensitivity of PiB-PET imaging and related [F-18] ligands is not well characterized for relatively low but histologically detectable Aβ deposits. Analyses of large numbers of PETpositive and PET-negative cases, with short imaging-toautopsy interval, will be required to establish threshold levels of Aβ and tau pathologies necessary for diagnostic accuracy. A major challenge for neuroimaging in AD is how to determine the onset of amyloid and tau accumulation in pathologyburdened individuals with NCI and MCI, and its association with cognitive measures and CSF biomarkers. As the field focuses on PET imaging studies to help determine the clinical significance of presymptomatic pathology and identify people at risk for cognitive decline, more studies are needed to compare directly the relative merit of amyloid and tau PET to CSF biomarkers, MRI, FDG, and clinical measures for earlier detection of AD, to improve the selection of patients for clinical trials, and for monitoring pathology progression and therapeutic efficacy."}, {"section_title": "Blood-Based biomarkers", "text": "The resources and costs related to CSF and imaging biomarkers make it difficult to incorporate them into routine clinical practice. Thus, there is a focus on the discovery and validation of biomarkers in peripheral blood. As blood collection is minimally invasive and inexpensive to perform, bloodbased biomarkers, developed and refined based on strong concordance with CSF and brain imaging parameters, would present a significant breakthrough in moving routine screening for incipient dementia into community-based clinics. However, the seclusion of the central nervous system (CNS) from the peripheral circulatory system is a significant challenge for blood-based biomarkers to diagnose neurological disorders such as AD. Nevertheless, discovery-and hypothesis-based approaches have led to the identification of numerous biomarker candidates associated with AD in blood, plasma, and serum.\nTo date, plasma Aβ and tau levels have not mirrored the sensitivity and specificity of their CSF counterparts. In general, Aβ 42 or Aβ 40 levels in plasma are found to be either unchanged or, in cases where higher plasma levels of either Aβ 42 or Aβ 40 are reported for AD, there is broad overlap between patients and controls [236] . With respect to predicting AD conversion in cognitively normal people, some studies report that high plasma Aβ 42 , or a high Aβ 42 /Aβ 40 ratio, is a risk indicator for future AD, whereas others report the opposite [237] [238] [239] . These equivocal findings suggest that plasma Aβ does not reflect brain Aβ turnover or metabolism [28] . For instance, there is no correlation between plasma Aβ species and brain amyloid load as determined by PiB binding [104] . Plasma assays for tau have been hampered by a lack of analytical sensitivity for accurate measurement. However, the recent application of digital ELISA technology revealed that plasma tau levels were significantly higher in patients with AD compared with controls and those with MCI, but with substantial overlap among the groups, with no correlation between tau levels in plasma and CSF [240] . In a significant advance for examining amyloid and tau in blood, Fiandaca et al. [241] examined these proteins in neurally derived blood exosomes derived from patients with AD, with FTD, and healthy controls [241] . Blood exosomal levels of total tau, phospho-tau (T181), phospho-tau (S396), and Aβ 42 were significantly higher in patients with AD than in matched controls, with combined levels showing 96% sensitivity. Moreover, analysis of blood exosomes in a group of AD patients at two different time points showed that the levels of these four markers were elevated in the blood of cognitively normal individuals who later developed AD, up to 10 years before clinical diagnosis of the disease [241] . Hence exosomes may provide a blood-based window into CNS activity and provide a more suitable substrate for marking preclinical AD stages.\nSeveral studies have reported promising novel blood biomarkers for AD. Combined multivariate analysis of levels of 120 known signaling and inflammatory proteins in plasma identified 18 candidate proteins that together identified patients with AD and predicted future AD in those with MCI with high accuracy [242] . Another study using plasma from patients with probable AD and controls found a significant AD-related increase in the ratio of proatrial natriuretic peptide, a vasodilator, to carboxy-terminal endothelin-1 precursor fragment, a vasoconstrictor (training set sensitivity = 81%, specificity = 82%) [243] . O'Bryant et al. [244] performed multianalyte profiling of 396 control and AD serum samples from the Texas Alzheimer's Research Consortium and 170 control and AD plasma samples from ADNI to develop a novel serum plasma biomarker algorithm based on 11 proteins differentially expressed between the two diagnostic groups (e.g., C-reactive protein, adiponectin, and pancreatic polypeptide). When combined with biological (e.g., glucose, cholesterol) and demographic (e.g., age, apoE status) variables, the biomarker yielded good accuracy (AUC = 0.88) comparable with the CSF total tau/Aβ 42 (AUC = 0.92) for these patients [244] .\nMore recently, Doecke et al. [245] identified a plasma biomarker panel that consisted of 18 proteins, including cortisol, ApoE, pancreatic polypeptide, and epidermal growth factor receptor, that discriminated patients with AD from healthy controls, with high sensitivity and specificity (85% and 93%, respectively). Hu et al. [246] identified 17 proteins and peptides that were associated with MCI or AD in a test cohort, which yielded four candidates in the validation cohort. Two of these four analytes, pancreatic polypeptide and ApoE, were among those included in the plasma biomarker panel developed by Doecke et al. [245] . However, Hu et al. [246] found that a different set of two plasma proteins, pancreatic polypeptide and B-type natriuretic peptide, were correlated with CSF levels of Aβ 42 and total tau/ Aβ 42 ratios. This concordance with core CSF biomarkers suggested that these two peptides could be useful blood surrogates for predicting the progression to clinical AD.\nA newly developed SOMAscan discovery-based platform was used to analyze 1129 plasma proteins simultaneously in blood samples from patients with AD and healthy controls [247] . In the discovery set, a 5-protein classifier (S100A9, CD84, CD226, AIF1, and ESAM) was identified that discriminated people with AD from healthy controls with a sensitivity and specificity of 90.0% and 84.2%, respectively, outperforming CSF tau and Aβ 42 markers from the same cases. In a validation study, the classifier discriminated controls from individuals with MCI with 96.7% sensitivity and 80% specificity [247] . Finally, an unbiased mass spectrometric lipidomics approach was used to identify a plasma phospholipid panel that predicted phenoconversion to MCI or AD within a 2 to 3-year timeframe with > 90% accuracy [248] . Thus, these novel discovery-based studies in plasma may also prove useful in the detection of AD in its earliest stages.\nThe field of blood-based biomarkers lags behind that of CSF as there is a significant lack of standardization in collection procedures and analytical platforms, which likely provides the main source for variability and low reproducibility rates across centers [241, 247, 249] . In this regard, an initial set of guidelines was developed to standardize the preanalytical procedures related to the utilization of blood-based biomarkers [250] . Once refined, a set of universal guidelines will allow the field to more accurately assess and cross-validate potential blood-based biomarkers to home in on a panel that either augments existing core CSF and imaging parameters or provides suitable diagnostic accuracy for noninvasive, low-cost screening for incipient dementia in community settings."}, {"section_title": "Circulating Autoantibodies as Biomarkers", "text": "Blood-based autoantibodies against neuronal proteins associated with neuroinflammation, vascular dysfunction/blood-brain barrier (BBB) disruption, and altered cholesterol/lipid metabolism suggest that autoimmunity markers may correlate with specific stages in the pathophysiology and comorbidities associated with AD.\nThe initial indication that autoimmunity could play role in the pathophysiology of AD was based on the identification of Aβ autoantibodies in cognitively normal older individuals [251] [252] [253] . Based on these results, active and passive amyloid immunotherapy has been tested in patients with AD [254] [255] [256] . Although active immunotherapy did not prove to be an effective treatment for patients with AD, administration of anti-Aβ antibodies is still currently being tested in patients with AD as therapeutic agents (i.e., aducanumab) [257] [258] [259] . The results released from the phase Ib trial for aducanumab indicate an encouraging reduction in brain amyloid and slowing of cognitive decline in patients with CDRs of 0.5 and 1.0 [259] . Nevertheless, while the scientific community anxiously awaits the results of passive Aβ immunotherapy in phase III trials, other autoantibodies have been identified as potential diagnostic biomarkers for AD [260, 261] .\nThe use of protein, peptides, and even peptoid arrays has led to the identification of autoantibodies specific to patients with AD. Autoantibodies against targets involved in synaptic activity, including neurotransmitters and receptors, are associated with cognitive decline, suggesting their use as signals of brain malfunction [262] [263] [264] [265] [266] [267] [268] [269] [270] [271] (Table 1) . With respect to inflammation, the relationship between neurodegeneration and autoimmunity was recently genetically confirmed in an epidemiological study where specific single-nucleotide polymorphisms in TREM2 (triggering receptor expressed on myeloid cells 2) and complement factors were shown to overlap between AD and immune diseases [272] . These findings suggest that alterations of the BBB and activation of neuroinflammation are intrinsic components of AD pathophysiology. In this regard, autoantibodies against glial fibrillary acidic protein and S100β have been associated with leakiness of the BBB and peripheral immune cell access to the CNS [263, 273] . Autoantibodies against other proteins that modulate the Ankyrin repeat and KH domain containing 1 [271] MAPKAPK5 = mitogen-activated protein kinase-activated protein kinase 5; ATP = adenosine triphosphate BBB have also been identified (Table 1 ) [274, 275] . Detection of autoantibodies is also associated with metabolic dysfunction and oxidative stress [276] [277] [278] [279] [280] [281] (Table 1) . Autoantibodies against proteins involved in energy metabolism, such as aldolase and adenosine triphosphate synthase β, have also been shown to be significantly higher in the sera of patients with AD than in healthy individuals [282] [283] [284] . The role of the antigenic proteins and the role of autoimmunity in the pathophysiology of AD is still unclear, but there is enough evidence to suggest that further studies could lead to the establishment of an autoimmune panel with increased specificity and sensitivity for differentiating among AD, normal aging, and other dementing disease processes."}, {"section_title": "Blood Metabolites", "text": "Lipids, amino acids, vitamins, and cholesterol are plasma metabolites that have been associated with AD [285] . Higher levels of cholesterol are associated with increased metabolism of amyloid precursor protein [286] . Consistently, a high cholesterol level in serum is associated with higher risk of cognitive impairment and AD. By contrast, reduced levels of plasma antioxidants, such as vitamin E, C, D, and others, correlated with both vascular dementia and AD [287, 288] . Recently, a panel of 24 plasma metabolites was developed as diagnostic biomarkers of AD that included phosphocholine metabolites and amino acids [289] . The differential abundance of the 24 metabolites accounted for a 90% sensitivity as biomarkers for the preclinical stage of AD. The authors anticipate challenges associated with validation and reproduction of the results obtained in different cohorts [289] . Differential comorbidities, especially metabolic disorders such as diabetes and hyperlipidemia, may also contribute to the lack of specificity and sensitivity desired for the use of metabolic biomarkers as a diagnostic tool. Moreover, current instrumentation and analytical software limitations preclude the analysis of the whole metabolome. Despite these technical obstacles, the combination of identified metabolites and autoantibodies could be a robust analytical panel for the preclinical diagnosis of AD."}, {"section_title": "Conclusion", "text": "Several potential disease-modifying drugs have been developed for AD based on translational rationales, yet have failed to show any effect on disease progression or cognitive function in clinical trials. However, these failures may simply be due to the fact that the patients with AD being treated are already too advanced to derive a clinical benefit. Thus, well-validated biomarkers for early detection and accurate diagnosis of the preclinical stages of AD will be crucial for therapeutic advancement. While positive amyloid or tau tracer retention on PET imaging, low CSF concentrations of Aβ 42 , and high CSF concentrations in total tau and phospho-tau are accurate biomarkers for the progression to AD, the ultimate AD biomarker panel will likely show improved reliability for detecting preclinical AD through the inclusion of novel markers that are more precisely associated with confirmed pathophysiologic mechanisms. In this regard, it is imperative to recognize AD as a multifactorial disease arising from heterogeneous etiologies, and that a combinatorial approach of imaging and fluid biomarkers reflecting disease pathogenesis integrated with genetic screening and sensitive neuropsychological testing will be required. In addition, the establishment of standards for sample collection and the unified calibration of specific instrumentation will be necessary to avoid multicenter variability. Altogether, the results described here illustrate that the field is inching closer to the development of a reliable and accurate diagnostic tool that will lead to the discovery of efficient therapeutic strategies for combating the onset of dementia."}]