[{"section_title": "", "text": "Crop residue management, provision of animal feed or bedding, and increased income are potential reasons for harvesting corn (Zea mays L.) stover. Reasons for not doing so include the need for crop residue to restore or increase soil organic matter, protect against wind and water erosion, and cycle plant nutrients. Bioenergy market development may increase the number of producers harvesting corn stover. Can farming practice data predict the likelihood for harvesting corn stover at a national scale? Farm operation, technology, and management variables from the 2010 Agricultural Resource Management Survey (ARMS) of U.S. corn growers were compared between operations that removed corn stover and those that did not. Nationwide, stover was removed from approximately 6.3% of all corn operations, indicating stover harvest was not a common practice in 2010. Factors increasing the likelihood for stover harvest included producing feed corn, managing crop residues for pest control, and farmland ownership. Technology and conservation practice adoption rates were similar in both groups. Excessive stover removal can increase soil degradation. Both groups had erosion control adoption rates of ≤10%, which may provide an additional disincentive to harvest stover. Overall, the evaluated variables were similar between producers that did and did not harvest stover. This assessment provides a 2010 national baseline that can be used for future evaluations as bioenergy and bioproduct markets develop.\nUSDA-ARS, National Lab. for Agriculture and the Environment (NLAE), 1015 N. Univ. Blvd, Ames, IA 50011-3166. USDA is an equal opportunity provider and employer. Received 31 Aug. 2017. Accepted 5 Jan. 2018. *Corresponding author (Doug.Karlen@ars.usda.gov).\nAbbreviations: ARMS, Agricultural Resource Management Survey; ERS, Economic Research Service; NASS, National Agricultural Statistics Service."}, {"section_title": "core ideas", "text": "• Corn stover removal was not common in 2010.\n• Crop sequences were similar for stover and non-stover harvest farms.\n• State-level variation occurred in the relative size of farms removing corn stover.\n• Soil erosion control measures were not frequently adopted by either farm group.\nthe soil from wind and water erosion, cycle nutrients, and help replenish soil organic matter (Owens et al., 2016; Wilhelm et al., 2004 Wilhelm et al., , 2007 Wilhelm et al., , 2010 . Farmers recognize the need for corn residues to protect the soil (Tyndall et al., 2011) , as evidenced by 55, 30, and 37% of the producers in eastern, central, and southern areas, respectively, who indicated they left crop residues in the field as a soil organic matter resource (Schmer et al., 2017) . One strategy for meeting the multiple potential demands for crop residue is to use site-specific removal rates (Muth Jr. et al., 2012) . A recent bioenergy summary report suggested 50% of corn stover could be removed from fields with grain yields of at least 11 Mg ha -1 (15.5% moisture content) to ensure sufficient residues are left in field to sustain soil resources (Owens et al., 2016) . This recommendation is in general agreement with 2011 to 2016 average grain yields from Iowa, Wisconsin, and Minnesota (10.9, 9.6, and 10.6 Mg ha -1 , respectively, [USDA-NASS, 2017] ) where stover harvest is more common (Schmer et al., 2017) . Furthermore, most of the reported stover harvest is likely to occur from areas where field and county yield levels exceed those state averages, but actual, site-specific data is currently not available to confirm that hypothesis.\nUsing cover crops and other conservation practices could provide sufficient groundcover to protect soil resources and accommodate corn stover removal (Bonner et al., 2014; Pratt et al., 2014) . However, stover removal rates may be limited by conservation guidelines, such as 30% groundcover being required for conservation tillage systems (Tyndall et al., 2011) . Modeled data across several U.S. corn producing states indicated that incorporating cover crops and vegetative barriers could increase available corn stover fourfold compared to baseline conditions (Bonner et al., 2014) . However, substantial growth in cover crop adoption may be needed to significantly increase stover harvest rates. Nationwide, cover crop adoption is currently estimated at 4.2 million ha, compared to 158 million ha of total cropland or 128 million ha that are harvested each year (USDA, 2017a (USDA, , 2017b . Successful cover crop use depends on many factors, including growing season length and moisture availability.\nStover harvest could increase substantially as bioenergy markets develop, but farmer participation will be affected by several factors, including proximity to markets, opportunity costs, and stover prices (Altman and Sanders, 2012; Thompson and Tyner, 2014; Tyndall et al., 2011; White and Selfa, 2013) . Current lack of an available market for corn stover was cited by 18, 20, and 45% of producers in eastern, central, and southern corn growing regions, respectively, as a reason for why residues were not harvested (Schmer et al., 2017) . Understanding farm characteristics that may make corn stover harvest more likely could have important modeling and potentially site implications for biorefineries. Identifying producer variables is important for estimating the likelihood that farmers will adopt conservation practices (Daloğlu et al., 2014) and for using sustainable stover harvest practices. New models using producer survey data have estimated long-term cellulosic feedstock supply rates (Huang et al., 2016) . Potentially linking those models with subfield residue removal models (Muth, Jr. et al., 2012) could generate landscape scale estimates of areas that are likely to supply stover feedstock without negatively affecting soil resources.\nSeveral challenges exist before such predictive stover removal models can be developed. Demographic characteristics do not always uniformly predict farming behaviors (Burton, 2014) , and entering bioenergy markets can be affected by several nonproduction considerations including both social and structural constraints (Galik, 2015) . Therefore, predicting bioenergy market development is more difficult than providing data on where crops can be grown and what the breakeven prices are for stover harvest, storage, and transport Mooney et al., 2015) . Each farm must be considered a unique decision-making unit that responds to crop price fluctuation and numerous other management challenges in ways that match their own respective goals (Öhlmér et al., 1998) . Some of those goals may include nonpecuniary benefits that cannot be readily estimated from costs of production (Howley, 2015; Swinton et al., 2017) .\nRecognizing the long-term need to predict cellulosic feedstock availability and effects across agricultural landscapes, our objective was to determine if selected farm operations, technology, and management variables were substantially different between farms that did and did not harvest corn stover. National estimates for corn stover harvest are known (Schmer et al., 2017) , but producer characteristics between the two groups at the national scale are not readily available in the literature. The results presented in this paper include an exploratory logistic regression model and survey descriptive statistics to provide a useful benchmark for future comparisons among producers who do and do not harvest corn stover."}, {"section_title": "MAteriALs And MetHOds", "text": "The 2010 ARMS Corn Phase II Version 23 dataset was used for this analysis. The survey instrument was the Corn Production Practices and Costs Report for 2010 (USDA NASS, 2010) . The next version of this survey was distributed to producers in 2016. Producers reported data for one randomly selected field within their operation. The response variable of interest was whether or not producers answered yes to survey question P1354, \"Were the stalks/stover harvested from this field\"? The results presented in this paper complement and expand on those presented by Schmer et al. (2017) .\nFour analyses were conducted to compare respondents that removed corn stover and those that did not. First, a logistic regression model was analyzed using a positive response to question P1354 as the dependent variable. Second, survey descriptive statistics for each variable included in the logistic regression model were generated to help evaluate the model's results. Third, data on the primary crop grown in the surveyed field for each cropping season between 2006 and 2009 were compared between the two stover harvest groups. The survey asked about a specific field during the 2010 cropping season and the cropping history of this particular field from 2006 to 2009. Fourth, individual state stover harvest rates and participation were compared to identify state-level variability in stover harvest decisions that could be evaluated in future studies.\nLogistic regression model variables were selected to compare farm operations, technology, and management factors between farms that did and did not harvest corn stover (Table 1) . These variables were selected based on previous evaluations in the literature and for reasons outlined in Table 2 . As an exploratory model, variable interactions were not evaluated. The logistic regression approach sought to identify the most important variables relative to the other variables included in the model for predicting corn stover harvest. Ownership, corn harvest intention, grain corn intention, and expected grain yield variables were recoded to accommodate logistic regression analysis (Table 1) . For survey responses with multiple options, such as grain corn intention (P1316), one option needed to be selected as the default (0) to provide a dichotomous variable for a categorical response. For unit consistency in the model, the \"GrainGoal\" variable converted all reported expected grain yields (pound, hundredweight, ton, or bushel) to pounds per acre units. Most variables discussed in this paper follow the ARMS survey convention of \"P\" followed by the corresponding question box from the survey. For example, \"P50\" indicates the response box \"0050\" (leading zeros are removed from the variable name).\nBased on the recoding of categorical variables shown in Table 1 , the logistic regression model intercept (dummy coded) included a producer owning their own acres, growing corn grain for food, and not adopting any of the technology or management variables. The recoded categorical variables for farm ownership (P1302), corn harvest intention (P1327), and grain corn intention (P1316) were then evaluated in the logistic regression model as the effect of ownership arrangements relative to farm ownership, corn harvest intentions relative to corn for grain, and grain corn intentions relative to food intentions. A brief overview of selected logistic regression terminology and some common logistic regression calculations are included in Supplemental Tables S1, S2, and S3 (see online version of the journal) based on descriptions in Osborne (2015) .\nData analysis was conducted using SAS (v 9.2, SAS Institute Inc., Cary, NC) and R software (R Core Team, 2016) . The logistic regression model was analyzed using the SURVEYLOGISTIC procedure in SAS software (SAS Institute Inc., 2008) . The SAS software code is included in Supplemental File S1 and the R recoding steps are included in Supplemental File S2. Response weights were applied according to NASS ARMS recommendations (L. Foreman, NASS, personal communication 2017). The weights, adjusted for every state, are intended to expand survey results to represent all planted corn acres. Farm-level expansion factors for each respondent were calculated by dividing the respondent's sample weight by the respondent's total number of corn fields planted."}, {"section_title": "resULts And discUssiOn stover Harvest participation", "text": "Responses to the question, \"Were the stalks/stover harvested from this field?\" were 202 \"yes\" (7.6%) and 2452 \"no.\" Complete data were available for 199 of the \"yes\" and 2430 of the \"no\" respondents and were included in the logistic regression model. Each individual response received a weighting factor to expand results to the state level. The average farm-level response weight for stover removal was 585 compared to 673 for non-harvest farms. These response weights were multiplied by the number of respondents in each group to estimate the total number of farms in each category. This resulted in an estimated 17,496 farms (6.3%) where corn stover was removed and 260,876 farms where harvest did not occur. This finding confirmed that corn stover harvest was not a routine practice in the 2010 survey results (Schmer et al., 2017) . However, the goal of the analyses described below was to identify if any of the farm operation, technology, or management variables could differentiate the two stover harvest groups."}, {"section_title": "Logistic regression Model Fit", "text": "Diagnostic statistics indicated the model, with the selected predictor variables included (Intercept + Covariates), had a higher predictive capability than a null scenario using the intercept only and all predictor variables ignored (Intercept) ( Table 3 , p < 0.001). The predictive capability of the model as evaluated by data pair concordance/discordance was 65.6%. The response rank correlation data reflected this level of concordance as values were not close to 1 (Table 3) . Values closer to 1 indicate a stronger association between paired predicted and observed values (Allison, 1991) . Additional logistic regression model summary data are presented in Table S4 .\nThe discordance data describes the results that occurred when analyzing pairs of stover/non-stover producers. Approximately one-third of the time a producer from the non-stover removal group was predicted to have a greater likelihood for removing stover than a producer from the stover removal group. These results indicated the model variables were not consistently differentiating between stover removal and non-removal groups. The model and the included predictor variables was statistically significant when compared in the null hypothesis test to a scenario in which all predictor variables were ignored, but the discordance data suggest the included variables may not have strong predictive power. Analysis of the model discussed below identifies where differences were and were not occurring between the two groups. The logistic regression analysis, in addition to the survey summary statistics discussed following the logistic regression results, helps refine future predictive stover models and stover removal research."}, {"section_title": "Logistic regression predictors", "text": "Of the thirty-one variables included in the model, seven had p-values less than 0.05 and odds ratios different from 1 (Table 4) . The model intercept indicated the likelihood for harvesting corn stover (P1354 = 1) when all other variables were held constant for a producer owning their own acres and growing corn grain for food. Controlling for the other variables in the model, these producers were unlikely to harvest corn stover, with a likelihood (conditional probability) of 0.1%. This value is much lower than the 6.3% stover harvest estimate provided above. The estimate of 0.1% is based on the total number of corn acres using survey weights, while the 6.3% estimate is based on the total number of farms. This finding raises questions about the sizes of farms removing corn stover which is discussed in a later section. The negative signs on some variable slope estimates in Table  4 indicated those variables reduced the likelihood for harvesting corn stover, particularly for the field ownership re-coded variables (P1302). Stover harvest was less likely on land rented for a fixed amount, flexible amount, or crop sharing arrangement (CashFix, CashFlex, Share). Estimates for any one of these variables would be lower than the likelihood for harvesting corn grain stover from owned land that was included in the intercept. These results are useful for identifying land ownership as a future variable of interest for subsequent research because rental agreements did not increase the likelihood of corn stover harvest. One hypothesis that could be evaluated further is if areas at the regional, state, or county levels with high rental agreement rates are less likely to participate in corn stover harvest compared to areas with high ownership rates.\nThe variables with positive slope estimates provide the focus of this discussion because they indicate an increase in the likelihood that corn stover would be harvested, controlling for all other variables. Three variables increased the likelihood for stover harvest: growing feed corn (Feed), not having a predetermined grain corn harvest intention (Unknown), and burning or removing residues for pest management (P843). The other variable with a positive slope estimate, \"Seed\", was statistically significant, but might not be practically important due to lower sample sizes associated with that response. The number of producers growing corn for seed was approximately 1% in both response groups. Therefore, a small increase in \"yes\" responses caused a much larger relative increase in stover harvest likelihood compared to other practices that were more common.\nOf the three remaining variables with sufficient sample size, \"Feed\" caused the largest increase in the likelihood for harvesting corn stover. A randomly selected producer who harvests corn grain for feed has an 11% likelihood (conditional probability) of harvesting corn grain stover. Compared to the 0.0095 odds for harvesting stover controlling for all model variables (the model intercept), the odds ratio for feed grain stover harvest was 12.88 with a 95% confidence interval of 3.87 and 42.87. This wide confidence interval suggests substantial variability with this effect. Using unweighted survey data, the conditional probability for growing feed corn when harvesting corn stover was 57%. As the majority of producers who harvest stover grew corn for grain (86%), growing feed corn represented 49% of all stover harvest respondents (0.57*0.86). This suggests that stover harvest is more likely when producers are selling to livestock corn markets compared to other corn harvest intentions. These results agree with Schmer et al. (2017) , who identified livestock as a key factor affecting corn stover use, including grazing corn residues remaining in the field.\nHaving an undetermined use for harvested corn grain (Unknown) caused the second largest increase in the likelihood for harvesting corn stover. A randomly selected producer harvesting corn grain with no specified grain use has a 6% chance (conditional probability) of harvesting corn grain stover. Compared to the intercept, the odds ratio was 7.08, with a 95% confidence interval of 2.08 and 24.16. As occurred with the feed grain estimate, the odds ratio indicated variability in the effect size. Of corn grain producers, 21% indicated an unknown harvest intention. Given that 86% of respondents who harvested corn stover indicated growing corn for grain, the likelihood of growing grain corn without a current harvest intention and harvesting stover was 18% (0.21*0.86). Future research could evaluate if there are specific farm characteristics, including producer preferences, for determining the end use of their grain corn. The logistic regression results suggest growing corn with an undetermined end use increases the likelihood for harvesting corn stover relative to when corn grain is grown for human food consumption.\nHarvesting or burning crop residues as a pest management practice was the third variable increasing corn stover harvest likelihood. The conditional probability for a producer to report removing stover if residues were removed or burned was 20%. In comparison, the conditional probability for stover harvest when residues were not removed or burned was 7%, due to the smaller sample size for this response. Compared to the intercept, this odds ratio was 3.32 with a 95% confidence interval of 1.63 and 6.76. Across all surveys, this pest management practice was reported by 6% of respondents, indicating this was not a common practice. These results suggest that when harvesting or burning crop residues as a pest management practice does occur, respondents were likely to remove corn stover. A challenge for interpreting these results is that both options, harvesting or burning, were included in a single survey question and we cannot separate how many individuals were harvesting only. If residues were burned they would not be available to harvest. The combination of pest management and corn stover removal could change if certain crop pests become prevalent in certain areas, particularly crop pests best managed through residue removal. A fourth variable that was not included in Table 4 due to a p-value greater than 0.05 was harvesting corn for silage. Model results suggested that producers who harvested corn for silage were more likely to report harvesting corn stover [estimate = 1.22 (p = 0.1076)] (Table S5) . However, this question did not ask if corn stover was removed in addition to the silage that was removed or if some survey participants considered the removed corn stover to be part of the silage.\nThe logistic regression results indicated that farms where corn stover was harvested and those where residues were left in the field were similar across the other model variables. This finding includes the grain goal variable, in which producers included their yield goal for the field. Fields with higher yield goals were not more likely to remove stover. However, this nationwide analysis did not consider the yield goals relative to state or county-level yield averages. Full model results for all variables are presented in Table S5 . The evaluated model was useful for identifying variables for future research including farm ownership, corn grain harvest intentions, and pest management practices that involve removing corn residues."}, {"section_title": "individual variable comparisons between stover Harvesting groups", "text": "The second analysis using the survey data evaluated responses between the two stover harvesting groups for individual ownership (Table 5) , technology, and management variables (Table 6 ). The similarities between the two groups clarify and expand the logistic regression results. Some of these results were briefly discussed above for the statistically significant model variables, and this section includes results for all variables. The data included in Tables 5 and 6 are summary statistics generated from the survey and not from the weighted logistic regression results.\nThe ownership variables help explain the negative coefficients for rental arrangements. Rental agreements were more common for producers that did not harvest corn stover (keep) compared to those that removed stover (remove). The majority of respondents in both groups owned their corn fields (Table  5) . Counts for a given variable can be calculated by multiplying the group percentage by the group sample size. For example, 71% of fields from which stover was removed were owned and not rented. Of the 202 responses indicating stover harvest, this would approximately be 143 respondents. These counts include all survey responses, not just the ones with sufficient data for the logistic regression analysis. Corn harvest intentions were similar between the two groups, except for harvesting corn for seed as was discussed previously. The grain corn use (P1316) responses explains the feed effect discussed above. Of the farmers that removed corn stover and grew corn for grain, 57% harvested their corn grain for feed.\nThe majority of respondents in both groups indicated they did not widely adopt the technology variables (Table 6 ). Yield monitors were the most frequently reported adopted technology in both groups, and GPS guidance steering was the second highest adopted technology. Variable rate equipment for fertilizers, seeding, and pesticides were not frequently reported in either group, although this was 2010 survey data and significant adoption may have occurred since that time. The greatest difference between the two stover removal groups was an 11% difference in the adoption of GPS guidance steering.\nResponses were similar for the management variables, except for removing or burning residue for pest management practices as noted previously (Table 6 ). Conservation practice adoption should theoretically be higher among producers who remove corn stover to ensure soil resources are being maintained by avoiding unnecessary soil erosion or degradation. Soil conservation practices were not frequently reported by either group. The highest conservation practice adoption rates were seen for stormwater runoff control/handling with 31% in the stover removal group and 23% in the stover keep group. Soil erosion control practices were reported in 10% or less in both groups. Fields were not frequently classified as highly erodible in either group, likely explaining the low rates of soil erosion control, even though erosion can occur on soils that are not classified as highly erodible.\nCover crops and no-till are suggested management techniques that can increase corn stover availability (Bonner et al., 2014; Pratt et al., 2014) . Cover crops can help protect soils between cash crop growing seasons, and no-till provides more surface residues rather than tilling them into the soil. Survey results did not indicate these practices were used more frequently in the stover remove group (Table 6 ). Five percent of both groups indicated they used a cover crop in the same field during Fall 2009. No-till was reported less frequently (23%) in the stover remove group than in the residue keep group (30%).\nGiven the similarities in the two stover removal groups demonstrated in Tables 5 and 6 , the logistic regression results are not surprising. Providing the individual variable comparisons in these two tables shows the ranges in response rates and summarizes the survey data for presentation in the literature. As bioenergy markets develop, the responses to these and other variables could be compared to identify how the two stover removal groups may be differentiating or remaining similar."}, {"section_title": "crop sequence patterns between stover Harvesting groups", "text": "The third data analysis aggregated reported field histories from spring/summer 2006 to fall 2009 for each group to compare overall cropping practices ( Table 7) . The average number of corn acres planted per field for producers who removed corn stover was 36 compared to 50 acres for those who did not remove corn stover. The survey question asked respondents to indicate which crops were planted on the majority of the field. The number of fields in a given operation were defined by the respondent.\nAggregated cropping practices were similar between the two groups ( Table 7 ), indicating that stover harvest did not influence the type of cropping system being used. During the spring/summer seasons, corn and soybean [Glycine max (L.) Merr.] were the primary crops. Fall cropping practices between the two groups were similar, with \"no crops planted\" being the most frequent response. Both groups reported that winter wheat (Triticum aestivum L.) was grown during the fall season. Soybean was more common in non-stover harvesting fields during spring/summer 2009 and spring/summer 2007, and corn was more common in the stover harvest fields during these two seasons. During spring/ summer 2008, alfalfa (Medicago sativa L.) hay and corn silage were more common in the stover removal fields, with corn and soybean more common in non-removal fields.\nThese data do not evaluate an individual producer's cropping practices. For example, continuous corn production would provide an annual corn stover source. The survey question asked about a specific field and not the entire operation. As producers rotate crops among several fields, an annual source of corn stover could be available, but would not be detected using this crop sequence analysis. The cropping sequence results expand on the cover crop results presented in Table 6 by demonstrating that cover crops, or more generally crops grown during the winter season, were not frequently used in either stover harvesting group."}, {"section_title": "state stover Harvest rate comparisons", "text": "The fourth analysis conducted using the survey data evaluated stover harvest rates and survey weighting factors. Average corn stover removal rates for each state ranged from 0.7 to 6.9 Mg ha -1 . Highest corn stover removal rates occurred in Michigan, North Carolina, Pennsylvania, and Wisconsin. As discussed previously, a respondent's farm expansion factor was calculated by dividing sample weight by the number of fields planted. The average farm expansion factors by state and stover harvest participation were calculated to evaluate relationships between stover harvest and farm size (Table 8 ). The ratio of expansion factors between the two groups can be used to compare relative farm sizes of each group. Regional and statelevel variability in farm sizes and biomass production interests were previously identified (Jensen et al., 2007; Tyndall et al., 2011) .\nComparing the expansion factor ratios by state suggests the types of farms removing corn stover vary by state. At the national scale modeled in the logistic regression, the number of acres in a given operation (P50) did not affect corn stover harvest intention (p = 0.19). Across all states, the average expansion factor ratio was 0.80. For example, in Iowa 16% of the survey respondents indicated they removed corn stover. The farm expansion factor ratio for the two groups was 0.67. Therefore, producers reporting stover removal tended to come from smaller farms relative to those that did not harvest stover. Conversely, in North Dakota, 8% of survey respondents indicated they harvested corn stover. The farm expansion factor ratio for the two groups in that state was 1.42, which being >1.0 indicated farms that harvested stover tended to come from larger farms than those that did not harvest corn stover. Texas and Colorado had ratios close to 1, indicating the farms in each group were of similar size. These data suggest state-level differences in corn stover harvest characteristics. Theoretically, if corn stover harvest goals for each state were generated, these data indicate there could be differences in the number of farmers that would need to remove stover to achieve that goal. In Iowa, a greater number of producers would need to participate because the number of acres farmed by this group is smaller than the group that does not harvest stover. In North Dakota, fewer producers would need to adopt stover harvest because these producers operate on a larger number of acres than those that do not harvest stover. These results do not account for differences in field conditions, crop yields, or equipment that would affect corn stover harvest participation and stover availability. However, these results suggest future research could explore how the size of farm operations in each state could affect stover supplies."}, {"section_title": "cOncLUsiOns", "text": "The four analyses indicated producers that remove stover or leave corn residues in the field were similar with regard to most of the selected farm operation, technology, and management variables. Nationally, corn stover harvest was more likely for producers who owned their corn acres, harvested feed corn, did not have a determined end use for harvested corn grain, or removed residues as part of a pest management practice. Stover removal was infrequent but more common on owned land rather than rented land. Adoption rates for key conservation practices that can help mitigate potential negative soil effects from excessive stover harvest were not widely adopted in either group. Conservation practice adoption, including using cover crops, was 5% for both groups and no-till adoption was lower (23%) in the stover removal group than the non-removal group (30%). Cropping sequences were similar between both groups from 2006 to 2009, with corn and soybeans being the primary crops. The differences in state-level weighting factors indicated regional or state-level analyses may be useful to evaluate differences in corn stover removal practices. At a national scale, harvesting corn stover was not common in 2010 and occurred on approximately 6.3% of farms. This study provides a baseline for future state, regional, and national level assessments of corn stover harvesting as the bioeconomy grows."}, {"section_title": "AcKnOwLedgMents", "text": "Data analysis made possible with the assistance of the Upper Midwest Region NASS office in Des Moines, IA, including Doug Hartwig, Cindy Adamson, and Greg Thessen. Access to ARMS database, project preparation, and analysis assistance provided by Robert Dubman, Data Coordinator/Data and Survey Coordinator for ARMS. Robert Dubman and Wallace E. Tyner provided feedback on paper drafts. Thank you to the anonymous reviewers for constructive comments and suggestions. SAS and all other SAS Institute Inc. product or service names are registered trademarks or trademarks of SAS Institute Inc., Cary, NC. Participation of John F. Obrycki on this project was supported in part by an appointment to the ARS Research Participation Program administered by the Oak Ridge Institute for Science and Education (ORISE) through an interagency agreement between the USDOE and the USDA. ORISE is managed by ORAU under USDOE contract number DE-SC0014664. All opinions expressed in this paper are the author's and do not necessarily reflect the policies and views of USDA, ARS, USDOE, or ORAU/ORISE. "}]