[{"section_title": "Abstract", "text": "The bottom line of welfare on our planet and its people is not only dependent on traditional economic measures, but also on knowledge and education and -last but not least -on human health. Human health is a critical factor for the welfare and prosperity of society. Many parameters appear to play a role in a health equation, even though the empirical measurement of health is fraught with many conceptual and empirical problems. As a consequence, we observe many disparities in empirical health conditions in a heterogeneous society; an appropriate definition and measurement of 'good health' are far from easy. Next to health disparities caused by a heterogeneity among the population, there is also an important geographical component in the spread of health patterns of the population as a result of differences in environmental quality-of-life, spatial density, quality of and access to health care facilities, and social stress conditions. From this perspective, geography matters in the field of human health. Although geographic differences in health conditions are not the only reason for people to reside or stay in a certain place, they are certainly an important decision parameter, often in combination with wellness conditions and environmental quality conditions. The aim of the present paper is to provide an overview of the literature on the geography of health and wellness, while the study is concluded with some lessons for research and policy.\nPurpose: The aim of the present paper is to provide an overview of the literature on the geography of health and wellness.\nMethodology/Approach: Literature review. We will outline the geography of human health, through a concise literature survey of the geographical patterns in human health outcomes to address the general research findings on spatial differences in health in relation to urban-rural patterns of life."}, {"section_title": "Findings:", "text": "The measurement of human health is fraught with many difficulties, as it is often not clear whether a correction is made for supply factors (such as health care facilities) or for individual characteristics of the people concerned (such as age or gender). In the social-medical research literature this has led to an increasing popularity of meta-analytic methods.\nResearch Limitation/implication: Meta-analysis may be seen as a collection of quantitative research techniques that aim at providing a synthesis of previously undertaken impact studies in a given field. Clearly, and ideally, both the response and the moderator variables would have to be identical, but in reality this is not the case. Besides, the quality of the research may be difficult (often reflected in the quality of the journal in which the results are published), while also the contextual conditions may be completely different (such as physical-geographical conditions or socio-economic or poverty conditions). This makes the results of meta-analytic studies somewhat ambiguous, but nevertheless it is a valuable method that may shed more light on the determinants of health outcomes.\nThere is clearly a case for more detailed spatial data on individual health situations. There may be a self-selection (or sorting) mechanism in the locational decisions of households so that there is a need for a more systematic data collection and analysis in this area."}, {"section_title": "INTRODUCTION", "text": "The welfare of a country or region is not only dependent on traditional income measures (such as GDP per capita), but also on knowledge and education and on human health. These ingredients are also found in the conventional HDI (Human Development Index) advocated by the UN. Clearly, human health is a critical factor for the welfare perception of society, even though the empirical measurement of health is fraught with many problems. Is the measuring rod of health made up of average life expectancy of young children (or conversely by child mortality), by the rate of death from terminal diseases, or by the average recovery rate from serious diseases, etc.? Clearly, many parameters play a role in any health equation. There is a wealth of literature on factors that determine the health of the population: individual and collective lifestyles, income and wealth, education and culture, access to and use of health care services, human biology and genetics, and the quality of the daily environment. As a consequence, we observe many disparities in health conditions in a heterogeneous society (see e.g., Aroca, 2001; Dahlgren and Whitehead, 2007; Illsley and Le Grand, 1993; Preston, 1975) . Clearly, an appropriate definition of 'good health' is far from easy. According to the WHO, health is related to a state of complete physical, social and mental wellbeing, which is more than the absence of disease or infirmity. The health state of a person is in general a function of both internal factors (e.g., habits, food, water quality, behaviour) and external or environmental factors (e.g., social conditions, ecological quality, organization of the health care system).\nIt goes without saying that the health situation of a person, of a community or of a region depends evidently on total health expenditure (both private and public), which cover inter alia the supply and use of health care services, nutrition provisions and emergency aids. Higher income groups and countries tend to spend more on health expenditures, while the opposite holds for low-income groups or countries. To trace countries with the highest health situation in the world, Bloomberg Rankings developed a so-called health scores (see map in Fig.  1 ). This map suggests that OECD countries are in general the healthiest countries, comprising inter alia Singapore, EU countries, Australia, Japan and the USA/Canada. Many African countries and several Asian countries appear to have the worst health conditions. This map shows that Economic and health conditions are clearly correlated. 's Healthiest Countries (Source: United Nations, World Bank, World Health Organization, 2012. Available at:<https://knoema.com/lhlddbb/the world-s-healthiest-countries>) In general, health and wealth appear to be two mutually correlated phenomena. The same holds for life expectancy at birth. Disparities in national incomes on our planet appear to be decisive for differences in the health situation in these countries.\nIt is noteworthy that -next to the health disparities caused by heterogeneity among countries and their population -there may also be an important localgeographical component in the spread of health patterns of the population, caused by differences in environmental quality-of-life, spatial density, quality of and access to health care facilities, and spatial social stress conditions. It is obvious that local or regional quality of air or water may be decisive factors for human health (as is witnessed in many developing countries), but also the local vicinity of medical care infrastructure and of outdoor and indoor sports facilities may play an important role in the health statistics of a country or region. Consequently, the geography of human health deserves due attention in health care policy and management and in related scientific research (see also Modranka and Suchecka, 2014; Jawoska, 2014) .\nAs a consequence of the rising interest in human health in modern welfare states, new support facilities are increasingly designed and implemented, especially in the domain of health-leisure amenities and wellness amenities. Health and wellness tourism is nowadays on a rising edge and may open up many new markets for international tourism so that new forms of smart geographic specialisation are emerging. This is particularly reflected in eco-tourism, health tourism and wellness tourism.\nIn conclusion, geography matters in the area of human health. It is therefore, an important question whether living in cities or in rural areas makes a difference for the health condition of a person. Clearly, geographic differences in health conditions are not the only reason for people to reside or stay in a certain place, but they are certainly an important decision parameter, often in combination with wellness conditions and environmental quality conditions. The aim of the present paper is to provide an overview of the literature on the geography of health and wellness. We start in Section 2 with a review of urban health and wellness issues as part of a broader exploration of geographical health differences. The subsequent section will address the general research findings on spatial differences in health in relation to urban-rural patterns of life. In Section 4 we will offer findings from a recent meta-analytical study, while the paper is concluded with lessons for research and policy."}, {"section_title": "THE BROADER HEALTH CONTEXT", "text": "On the hierarchical Maslow ladder of human needs, health has always assumed a prominent place, next to shelter. In recent times, human health is increasingly regarded from a broader welfare perspective, so that also elements from quality of life, environmental sustainability, food quality, safety, poverty conditions, social justice, and general feelings of well-being (including sometimes even social community feelings) are taken into consideration. Consequently, the external environment of human health is more and more addressed in recent social-medical research, which means an orientation of research towards general wellbeing research comprising a multidimensional and transdisciplinary social science-oriented approach (McCaig, 2005; Noble and Bronson, 2005) . Consequently, livability, socio-economic welfare, sustainable modes of living, social conviviality, spatial vitality and resilience, cultural heritage, and physical/mental conditions are all constituents of this broad interpretation of human well-being, sometimes called a 'complex social value' by Fusco Girard (1987) (see also Fusco Girard and Nijkamp, 1997).\nClearly, well-being and health are not only individual characteristics of an agent but have also features of a common good in a local or regional community (WHO, 1986; Thompson, 2007) . We may quote here Sen (1999) , who says: \"it often happens that the income level is not an adequate indicator of important issues such as the freedom to live a long time, the ability to escape from preventable diseases, the possibility of finding a decent job or to live in a peaceful community and free from crime\" (p. 6).\nFrom a spatial perspective, Barton and Grant (2006) have mapped out the general architecture of the social and health characteristics of actors at the local level, in particular, the urban ecological and land use components (see Fig. 2 ). This health map offers a description of a variety of background factors and human health determinants. Its constituents will be used here as a framework to trace the impact of space on human health and wellbeing patterns. Barton and Grant (2006, p.2 "}, {"section_title": "))", "text": "It should be made clear at the outset that the terms 'health' and 'wellness' stand for different things and may be different concepts, but the one concept cannot really function without the other for providing an ultimate operational result for and significant impact on our well-being, productivity, happiness, quality of life and life expectancy. In the current context of globalization, the relevance of differences in degree of connectedness between spatial (scale) variation of health-related issues and conditions from a multidisciplinary perspective (e.g., public health, safety, ecological issues) plays a fundamental role and provides an indispensable base for tracing life conditions of individuals and community in any culture and society. It is therefore, pertinent to address human health questions that contribute towards the wellbeing, social innovation and sustainability of societies, including housing quality and social capital (see Mohnen, et al., 2011; Shaw, 2004) .\nAt a global scale, a variety of environmental characteristics and external conditions in locations or urban systems of current societies is specific and placebased, and provides a multitude of influences of central importance for a proper understanding of the issues at hand. This calls for a conceptualization of different hierarchical levels of the complex multi-causality of population health and dynamics (e.g., physical circumstances, spatial factors, social context, economic conditions) and for a (re)shaping and (re)developing of the regulation of health and sustainability externalities that are conducive as a source of health innovation to the potential future of modern cities creating inclusive societies. Clearly, health conditions are normally shaped in a broader social and geographical context. We will now in particular address in Section 3 the geographic constituents of human health conditions."}, {"section_title": "SPACE AND HEALTH", "text": "Space matters in determining the health outcomes of individuals or groups in society: there are manifest differences in health in and between countries and regions. In a recent comprehensive study, Ishikawa, Kourtit and Nijkamp (2015) analyzed the significance of urban conditions for human health, with a particular view to the question why urbanization patterns may have specific implications for human health, all other things equal. Such contextual geographic or areabased differences may be ascribed to an urban-rural dichotomy, but the authors argue that the overall pattern is much more complex and that regional characteristics should be decomposed into more fine-grained components in order to trace more precisely which factors have a critical impact on health outcomes in a society. The authors also claim that the social determinants of human health (such as gender, race, wealth, income, social capital, support systems, etc.) have been rather well documented in a wide array of studies. But much less conclusive knowledge is available on the geography of human health. We will briefly summarize here some essential points made by the authors of the above mentioned comprehensive study.\nThe first source of methodological concern is the operational definition of health: this has various elements, such as: self-rated health (SRH), limiting long-term illness (LLTI), mortality rates or morbidity rates (categorized according to the International Classification of Diseases (ICD) into: availability of and accessibility to health care facilities and health care utilities, degree of hospitalisation, prevalence of disease risk factors and health-related behaviours, life expectancy, preventive health check-up systems, etc. It goes without saying that the identification of significant geographic determinants in this wide array of health indicators is excessively complicated, leave aside the fact that in many cases no detailed spatial information is available.\nNevertheless, in their overview Ishikawa, Kourtit and Nijkamp (2015) were able to find 105 studies containing quantitative information on the existence of health inequality between urban and rural areas. There was however, no unambiguous conclusion, as both the definition of urban or rural was fuzzy (or not standardized) and a uniform, operational and precise measurement of human health was absent. For example, from their data it became apparent that in about 30 percent of their studies urban living led to positive health effects and in some 40 percent rural areas provided a better health outcome! Clearly, there was also much heterogeneity in the studies concerned, caused e.g. by gender, age, education, poverty, access to health care amenities, etc. The impact of psychosocial factors was even more hard to identify (see also De Mello-Sampayo, 2016).\nIt is clear that the simple distribution into urban-rural is very crude: living near an urban park may create different health conditions compared to living near an urban motorway, for instance. To care for a too rough categorisation, the notions of urban influence codes (UIC) and rural-urban continuum codes (RUCC) have been introduced, but the biggest problem here is of course the collection of a reliable and representative small-grid database.\nAn important problem is clearly formed by demographic self-selection. Highincome people may move to green areas and enjoy better health conditions, which otherwise might have led to premature death. Thus, the consequences of the urban-rural dichotomy for human health results are difficult to measure in practice.\nInterestingly enough, Ishikawa, Kourtit and Nijkamp (2015) were able to come up with several relevant, though tentative findings, sometimes in relation to environmental and land use differences. They argue that despite some ambiguity in findings it is possible to identify key elements that are decisive for health outcomes in relation to the urban/rural context or environment: (i) the urban environment leads to productivity spillovers that arise from human capital accumulation, which are proven to positively affect the regional health status. This is where economic and social capital may exert a joint impact; (ii) the physical environment (in particularly land use variables) may be beneficial to human health, if it reduces commuting costs and car dependency, or favours walking or bicycling. Such a mixed land use composition in cities mitigates the negative elements in high population densities (with less green areas); (iii) urban proximity to health-care amenities favours of course also human health, especially in emergency cases. Clearly, urban land rents may be prohibitive to live close to such facilities, so that here also the income situation of residents plays a role. The claim of the authors that there is a need for a solid 'urban medico-metrics' ought clearly to be supported."}, {"section_title": "RESULTS OF A META-ANALYTICAL SYNTHESIS", "text": "In Section 3 we have outlined the geography of human health, through a concise literature survey of the geographical patterns in human health outcomes. Several of these analyses are based on case studies, often ad hoc or anecdotal in nature. But there are also many studies that try to come up with empirical estimates of the impact of the degree of urbanity or rurality (or of living in urban or rural areas) on human health. It was clear from the previous section that the measurement of human health is fraught with many difficulties, as it is often not clear whether a correction is made for supply factors (such as health care facilities) or for individual characteristics of the people concerned (such as age or gender). In the social-medical research literature this has led to an increasing popularity of meta-analytic methods.\nMeta-analysis may be seen as a collection of quantitative research techniques that aim at providing a synthesis of previously undertaken impact studies in a given field. Clearly, and ideally, both the response and the moderator variables would have to be identical, but in reality this is not the case. Besides, the quality of the research may be difficult (often reflected in the quality of the journal in which the results are published), while also the contextual conditions may be completely different (such as physical-geographical conditions or socio-economic or poverty conditions). This makes the results of meta-analytic studies somewhat ambiguous, but nevertheless it is a valuable method that may shed more light on the determinants of health outcomes. For more details on meta-analysis we refer to Van den Bergh, et al. (1997) and Stanley (2001) .\nIn the area of the geography of human health, a recent meta-analysis was carried out by Gheasi, et al. (2016) . They address the question whether rural ways of living are healthier than urban ways of living. They perform then a meta-analysis by using a wealth of empirical studies on human health and the geographical differences of working and living. They find that the effects of regional or urban characteristics on health outcomes are inconsistent between different studies/countries. A relevant background factor that is critical for this lack of consistency in empirical outcomes stems from inconclusive definitions of such concepts as health, urbanism, rurality and urban-rural heterogeneity (e.g. innercity areas). The authors then provide a systematic review of the prevailing literature on geography and health, based on a broad, but concise overview of the basic space-health mechanisms involved. Next, they develop a quantitative research synthesis based on a quantitative meta-analysis of previously published studies on self-rated/self-reported physical health conditions in both rural and urban areas. The results from their meta-analytical regression analysis show that in general people living in urban areas appear to rate themselves slightly less healthier than people in rural areas. Such findings are very interesting and prompt the need for more underlying research on causality patterns at a detailed geographical scale.\nTheir results reflect clearly the need for further applied work. The authors argue that the geographical scale should be more fine-grained than the categories employed in their study. They also claim that various illness phenomena may be specifically related to given geographical areas or climatological conditions (e.g., malaria), so that general inferences are hard to draw. There is clearly a case for more detailed spatial data on individual health situations. Last but not least, there may be a self-selection (or sorting) mechanism in the locational decisions of households, so that there is a need for a more systematic data collection and analysis in this area."}, {"section_title": "CONCLUSION", "text": "Human health is increasingly assuming a high position on the needs ladder of people. Following Maslow's hierarchical principle, safety, shelter, health and welfare are basic constituents of the satisfaction of human beings. In real-world geographical space, these factors are of course intermingled, since the place where one lives may have specific environmental, social and economic conditions that shape the health outcomes of individuals or a community. It goes without saying that a thorough analysis of these complex relationships calls for a detailed individually-based and longitudinal health database, collected from different places at refined geographical scales.\nClearly, the supply side of health care amenities may also be essential for the human health outcomes. This does not only concern the type and quality of such medical facilities, but also their location and accessibility (including opening hours). And last but not least, the interface between demand for and supply of health care systems is a major research challenge due to the multi-causal nature of these relationships. Our final conclusion is that for a thorough understanding of the urban and rural aspects of human health much more conceptual and empirical work is necessary. For the 'science of the city', the explicit inclusion of human health -as part of a broader package of welfare and sustainability constituents -will no doubt lead to a more mature urban science."}]