[{"section_title": "Abstract", "text": "Lesbian, gay, and bisexual youth are at heightened risk for bullying and other forms of in-school victimization. Anti-bullying laws are a potential policy mechanism for addressing this issue, yet there has been little investigation of the impact of such policies for this population using generalizable samples or quasi-experimental designs. The current study explores whether the presence of state anti-bullying laws predicts lower likelihood of bullying victimization, fear-based absenteeism, in-school threats or injury with a weapon, and suicidality for lesbian, gay, bisexual, and questioning high school students in the The results suggest that general and enumerated anti-bullying laws may help reduce bullying victimization for gay, bisexual, and questioning boys."}, {"section_title": "Introduction", "text": "Lesbian, gay, bisexual, and questioning (LGBQ) youth, also known as sexual minority youth, are more likely than heterosexual youth to experience various forms of victimization in school settings, including bullying, harassment, and being threatened or injured with a weapon (Goodenow et al. 2016; O'Malley Olsen et al. 2014) . Anti-bullying laws, which are now present in all 50 U.S. states (Nikolaou 2017) , have been shown to help reduce victimization among general populations of students, particularly when implemented more strictly, such as having a clear definition of bullying and consequences for perpetrators (Nikolaou 2017; Sabia and Bass 2017) . Enumerated anti-bullying laws that include sexual orientation as a protected class of people are now present in 19 states (Movement Advancement Project 2016) and are meant to improve the school environment, specifically for LGBQ students. Yet, studies of how general or enumerated anti-bullying laws impact LGBQ youth tend to have methodological limitations (e.g., cross-sectional designs, convenience samples, no straight youth for comparison) that constrain researchers' ability to interpret whether these policies cause a reduction in victimization among this population.\nFor some years now, a number of states in the U.S. have opted to include a sexual identity question on the biennial Youth Risk Behavior Survey, a population-based survey coordinated by the Centers for Disease Control and Prevention (CDC) distributed to public high school students. In 2015, a sexual identity question was incorporated into the standard Youth Risk Behavior Survey module, helping to boost the number of states that collect information about sexual minority youth in high school. The present study uses Youth Risk Behavior Survey data between 2005-2015 alongside state policy data for 22 states to study whether the presence of general and/or enumerated anti-bullying laws at the state level leads to a decrease in victimization, fear-based absenteeism, and suicidality among LGBQ high school students. Before detailing the current study, this paper will review the literature related to bullying and other forms of in-school victimization, particularly as they impact LGBQ youth, and the development of anti-bullying policies as a means of reducing peer-to-peer bullying and promoting a safer, more inclusive environment in schools."}, {"section_title": "Bullying and Other In-School Victimization and the Consequences for Youth", "text": "Bullying is defined by the U.S. Department of Health and Human Services (n.d.) as \"unwanted, aggressive behavior among school aged children that involves real or perceived power imbalance. The behavior is repeated, or has the potential to be repeated, over time\" (para. 1). Bullying can encompass physical (e.g., tripping, hitting, spitting), verbal, and/or social behaviors (U.S. Department of Health & Human Services n.d.). According to Youth Risk Behavior Survey data collected from , about one out of every five high school students in the U.S. say they were bullied on school property in the previous 12 months. At the same time, the percentage of students who report skipping school in the past month due to feeling unsafe has slightly increased since 1993, though decreased from 2013 to 2015 (CDC n.d.) . Although the rates of school bullying have stayed rather consistent in recent years, other behaviors appear to be decreasing on school property, including weapon carrying, physical fights, and being threatened or injured with a weapon (CDC n.d.) . Violent behavior among youth at school tends to be more common in areas with greater exposure to violence, such as areas with greater poverty (Khoury-Kassabri et al. 2004 ).\nPast studies have indicated that certain marginalized populations of students are at higher risk of being bullied, including students with disabilities (Rose et al. 2009 ) and students who are perceived to be or identify as lesbian, gay, bisexual, transgender, queer, or questioning (O'Malley Olsen et al. 2014; Ybarra et al. 2015) . There are inconsistent findings about a student's race and ethnicity and the likelihood of being bullied, but some scholars theorize that ethnic heterogeneity in classrooms or dynamics of race and ethnicity in the larger community may be more influential than individual identities on rates of bullying (Hong and Espelage 2012) . Compared to heterosexual students, sexual minority students tend to report greater likelihood of being threatened or injured at school or skipping school because of feeling unsafe (Kann et al. 2016; O'Malley Olsen et al. 2014) . Age and grade level differentials tend to matter when it comes to the power imbalance between bully and victim, with younger adolescents more likely to be victimized in high school than older adolescents (Messias et al. 2014) . In terms of student gender, there is some evidence that boys and girls may face different risks for different types of bullying, with boys tending to face greater risk of physical aggression and girls more likely to say they have been socially excluded or been the subject of false rumors at school (Wang et al. 2009) "}, {"section_title": ". Past analyses of Youth Risk", "text": "Behavior Survey data have suggested that boys are more likely to say they were bullied in school than girls (Messias et al. 2014 ).\nBullying, whether experienced directly by a student or observed in great frequency in the overall school environment, is a critical issue for youth and adolescents. Exposure to bullying has been linked to a variety of risk factors, including poorer individual academic performance (Strøm et al. 2013) , poorer school-level academic performance (Lacey and Cornell, 2013) , fear-based absenteeism (Steiner and Rasberry 2015) , poorer mental health (Arseneault 2017; Takizawa et al. 2014) , poorer general or psychosomatic health (Fekkes et al. 2006) , and increased risk for suicide ideation (Mueller et al. 2015; Takizawa et al., 2014) . Recent studies have indicated that such adverse outcomes can carry into adulthood, as longitudinal cohort studies of childhood bullying victimization document greater risks in terms of psychosomatic health, economic well-being, and social relationships in early and middle adulthood (Arseneault 2017; Takizawa et al. 2014 ).\nAmong sexual minority students, experiences of bullying are associated with increased likelihood of suicidal ideation (Mueller et al. 2015) , and high rates of in-school victimization are associated with a greater likelihood of substance use, sexual risk behaviors, and suicide attempts (Bontempo and D'Augelli 2002) . Further, a retrospective survey found that experiencing high levels of lesbian, gay, bisexual, or transgender (LGBT) related in-school victimization was associated with greater depression, suicide attempts, sexually transmitted infection diagnoses, and HIV risk in young adulthood (Russell et al. 2011 ).\nSince they experience heightened risks of bullying, in-school victimization, and fear-based absenteeism, and since these outcomes are associated with psychosocial risk factors including suicidality, there is a need for addressing the in-school bullying and victimization that impact sexual minority students."}, {"section_title": "Anti-Bullying Laws as a Policy Strategy to Reduce In-School Victimization", "text": "Anti-bullying laws have been presented as a potential means to reduce bullying, whether implemented in a school, a district, or an entire state. All 50 U.S. states have now enacted anti-bullying laws (Nikolaou 2017) , most having enacted them in the past 15 years (U.S. Department of Education 2011). Some broader trends and state-level factors correlate with these shifts in LGBQ-related policies in the U.S., including notable trends toward greater acceptance of LGBQ people, which can be influenced by having greater interaction with LGBQ people (Becker, 2012) , as may occur within more urban areas with greater LGBQ cultural influences and population density. The implementation of state anti-bullying laws can vary widely in a number of areas, including: how and whether bullying is defined in policy; how districts are monitored for implementation and compliance with state policies; expectations of required training or distribution of policy information to superintendents, principals, teachers, support staff, and students; procedures for reporting bullying and to whom such reports are distributed, such as a state Department of Education or parents; and policies related to disciplinary consequences for students who bully (Nikolaou 2017; Sabia and Bass 2017 ; U.S. Department of Education, 2011).\nSeveral researchers have studied the impact of anti-bullying laws on the frequency of school bullying behaviors over time and/or overall school violence among general populations of students. In an analysis of Youth Risk Behavior Survey data from 1993 to 2013 alongside state data on school shootings, crime, and anti-bullying laws (Sabia and Bass 2017) , difference-in-difference estimates indicated that the presence of an anti-bullying law at the state level had a negligible impact on school safety, school shootings, or school bullying. However, the implementation of stricter components of such laws (e.g., mandates for investigations, detailed consequences for bullying) significantly improved school safety and resulted in less bullying and fewer school shootings by minor teens (Sabia and Bass 2017) . In another study, Nikolaou (2017) used school-level data from the School Survey on Crime and Safety from 2002-2010 and found that, as reported by principals, presence of a state anti-bullying law reduced school-level bullying, including having an additional delayed effect of three or more years. State anti-bullying laws that had a clear definition of bullying, expectations about reporting bullying to administrators, and/or disciplinary consequences for bullying resulted in a stronger reduction in school-level bullying as reported by principals. Anti-bullying laws had more of an impact in early grades compared to high schools and had the strongest effect on reducing bullying in small schools (Nikolaou 2017 ).\nDespite such findings, little research has examined the impact of anti-bullying laws for LGBQ youth. All studies to date that have looked at the impact of school policies on LGBQ youths' likelihood of being victimized are cross-sectional rather than experimental or quasi-experimental in design (Russell et al. 2010) , limiting any interpretation of causation. Additionally, most studies of anti-bullying laws in relation to LGBQ students are based upon convenience samples of students. A recent national survey of a convenience sample of LGBT middle and high school students found that the majority reported living in school districts that did not have anti-bullying protections for LGBT youth or had not implemented recommended standards for anti-bullying policies, such as district/state accountability for bullying events (Kull et al. 2015) .\nNineteen states and the District of Columbia have added sexual orientation as a protected class to their anti-bullying laws -known as having an enumerated policy -over the past 15 years (Movement Advancement Project 2016), which is meant to better protect sexual minority students and reduce anti-\nLGBQ bullying. As with general anti-bullying laws, enumerated anti-bullying laws may vary in wording and in how they are implemented at district and school levels, including whether educators are consistently informed about protections based on sexual orientation and how often homophobic bullying is reported and addressed (Hall and Chapman 2018) . In a study of educators in North Carolina after the enactment of their enumerated state anti-bullying law, educators were least likely to have been informed that sexual orientation and gender identity were included in the policy (compared to other protected classes, such as race and disability) and were also least likely to have reported bullying based on sexual orientation and gender identity compared to other classes, except socioeconomic status (Hall and Chapman 2018) . Few studies look at whether having an enumerated anti-bullying law impacts the experiences of LGBQ students, particularly across time and with a change in policy. A study of youth in Oregon (Hatzenbuehler and Keyes 2013) found that gay and lesbian (but not bisexual) youth who lived in counties with a greater proportion of districts that included sexual orientation as a protected class in antibullying policy had lower rates of attempted suicide. Interestingly, being in a county with a higher percentage of districts with protections for LGBQ students was also associated with lower peer victimization for students in general, indicating that such policies can benefit heterosexual students as well (Hatzenbuehler and Keyes 2013) . Another study coupled data from a convenience sample of LGBT youth with data about anti-bullying policies within school districts, finding that LGBT youth in districts with enumerated policies reported less victimization based on sexual orientation, fewer experiences of social aggression, and greater perceived safety than LGBT youth in districts with a general anti-bullying policy or with no policy (Kull et al. 2016) ."}, {"section_title": "Gaps in the Research", "text": "While previous studies have identified higher rates of bullying and other forms of in-school victimization targeting LGBQ students and the consequences of such experiences, research on the impact of anti-bullying laws for LGBQ students tends to use convenience samples and cross-sectional designs.\nThere is a need for research that uses population-based data and is quasi-experimental in design, capturing experiences both before and after the implementation of an anti-bullying law. Furthermore, few studies look at the impact of having an enumerated anti-bullying law that includes protections based on sexual orientation for students. Educators, school administrators, school support staff, legislators, and others would benefit from empirical research that can help us understand whether general and enumerated antibullying laws are an effective policy intervention for reducing bullying, fear-based absenteeism, in-school victimization, and suicidality for LGBQ students."}, {"section_title": "The Current Study", "text": "Given the heightened risks for victimization among LGBQ high school students, there is a need for understanding interventions, such as the use of state anti-bullying laws, that can improve the school experiences of this population. The current study aims to address this topic using multiple years of generalizable data from high school youth to understand whether the establishment of anti-bullying laws in different states corresponds with a reduction in victimization, fear-based absenteeism, and suicidality among LGBQ students. This study thus addresses the research question: Do general and enumerated antibullying laws at the state level reduce in-school victimization (bullying and being threatened or injured with a weapon in school), fear-based absenteeism, and suicidality among LGBQ high school students?\nBased on emerging evidence related to anti-bullying policies and the protective impact for LGBQ youth (Hatzenbuehler and Keyes 2013; Kull et al. 2016 ), the hypothesis is that both general and enumerated anti-bullying laws at the state level will predict less victimization, fear-based absenteeism, and suicidality among LGBQ students. As studies of general populations of youth have suggested that younger students experience bullying more often than older students and boys report being bullied in-person or physically victimized more often than girls (Messias et al. 2014) , and sexual minority boys tend to face greater likelihood of harassment or assault related to sexual orientation at school than sexual minority girls , an additional hypothesis is that the impact of anti-bullying laws will be more pronounced for younger LGBQ students and for gay, bisexual and questioning boys."}, {"section_title": "Methods", "text": ""}, {"section_title": "Youth Risk Behavior Survey Data", "text": "This study involves secondary data analysis of de-identified data and therefore was determined to be \"not human subjects research\" by the IRB at the authors' university. The primary source of data was the biennial State Youth Risk Behavior Survey, a repeated cross-sectional survey of public high school students in the United States coordinated by the CDC and carried out by state health or education departments. The survey design uses complex sampling (clustered and stratified with unequal selection probabilities) that can, when weighted, represent the population of U.S. public high school students (CDC n.d.) . Many studies have utilized these data to analyze state-level policies and individual outcomes for youth (for example, see Hatzenbuehler et al. 2015; Sabia and Bass 2017) . Although there is some justified skepticism about the accuracy of self-reports of bullying victimization by youth , as well as potentially the other items related to victimization, absenteeism, and suicidality, the CDC develops and modifies questions based upon input from content experts biennially, and previous research has documented the reliability of adolescent responses to various questions (Brener et al. 2013) .\nThe measurement quality of the Youth Risk Behavior Survey question about bullying victimization is strengthened in its use of a definition of bullying as well as its mention of a specific timeframe (past 12 months). Further, the CDC has tested various methods for survey administration and question wording to inform design procedures, finding that alterations to question wording may sometimes change prevalence estimates for individual items but do not consistently produce higher or lower estimates (Brener et al. 2013 ). Thus, this dataset was viewed as a relatively strong option for capturing data about youth experiences of victimization, absenteeism, and suicidality. This dataset was also chosen because it is meant to be representative of all public high school students and contains information about individual youth's experiences of bullying, fear-based absenteeism, and other in-school victimization that anti- \"Heterosexual (straight),\" \"Gay or lesbian,\" \"Bisexual,\" or \"Not sure\"). In 2015, this question was included for the first time on the standard questionnaire, and many states, though not all, chose to include this question on their 2015 survey, helping to increase the number of sexual minority youth who can be identified (CDC 2017; see Table 1 ). This measurement of sexual identity is in line with suggested best practices for capturing this construct, although with the qualification that it does not do well at capturing youth who identify in ways other than lesbian, gay, bisexual, or heterosexual (Temkin et al. 2017) .\nFurther, it's important to note that sexual orientation can encompass not only identity, but also sexual behaviors and attraction (Temkin et al. 2017) . Data for 21 states that included the sexual identity question and had weighted data were obtained through the CDC website; additionally, data were directly requested from Massachusetts because this state had weighted data available and included the sexual identity question for multiple years (see Figure 1 for a map of states with weighted data that included the sexual identity question and which are included in the analysis). For some of the models, the \"not sure\" respondents were grouped with youth who responded \"gay or lesbian\" or \"bisexual\" to incorporate those who were questioning their sexual identity, which is a common stage in sexual minority identity development. Results are also reported for models in which the \"not sure\" group was excluded from analyses to see if results were robust without inclusion of this group. Table 1 During the past 12 months, how many times have you been bullied at school?"}, {"section_title": "| Insert", "text": "Response options ranged from \"0 times\" to \"12 or more times.\" However, to draw direct comparisons to the later bullying data in other states, this variable was dichotomized so that any bullying was coded as 1 and \"0 times\" coded as 0. Models were tested with and without these early data from Massachusetts, but results were similar, so these data were retained. Therefore, the bullying victimization data from 2005 and 2007 only include data from Massachusetts.\nFear-based absenteeism. The second measure of interest focused on whether students skipped school due to fear (what is termed fear-based absenteeism in the present study):\nDuring the past 30 days, on how many days did you not go to school because you felt you would be unsafe at school or on your way to or from school?\nResponse options included: \"0 days,\" \"1 day,\" \"2 or 3 days,\" \"4 or 5 days,\" and \"6 or more days.\" This variable was recoded to be dichotomous so that any absenteeism due to fear in the past month was coded as 1 and no absenteeism due to fear was 0.\nThreatened or injured with a weapon on school property. The next outcome measure was inschool victimization:\nDuring the past 12 months, how many times has someone threatened or injured you with a weapon such as a gun, knife, or club on school property?\nThis question had 8 response options; this variable was dichotomized so that any victimization was coded as 1 and no victimization was coded as 0.\nSuicidality. Finally, suicidal ideation and attempts were both examined as outcome variables.\nThe item on suicidal ideation was worded as:\nDuring the past 12 months, did you ever seriously consider attempting suicide?\nThe response option of \"Yes\" was coded as 1, and \"No\" was coded as 0. Suicide attempts were captured by the question:\nDuring the past 12 months, how many times did you actually attempt suicide?\nResponse options ranged from \"0 times\" to \"6 or more times;\" these responses were recoded into a dichotomous variable such that any suicide attempt in the past year was coded as 1, and zero attempts was coded as 0.\nDemographic measures. This project also used Youth Risk Behavior Survey data related to state of residence and survey year (2005) (2006) (2007) (2008) (2009) (2010) (2011) (2012) (2013) (2014) (2015) to capture victimization patterns over time by state. Two demographic questions were used to help compare the impact of anti-bullying laws across different subgroups of LGBQ students. First was a question capturing respondent age; responses were dichotomized into two age groups-15 or younger, and 16 or older. The \"younger\" group captured students as young as 12; although very few students attend high school as 12-or 13-year-olds, these young students were included in the analyses because they may have heightened vulnerabilities to victimization. Second, youth were asked their sex and could choose either \"Female\" (coded as 1) or \"Male\" (coded as 2).\n"}, {"section_title": "Measurement of State Anti-Bullying Laws", "text": "To analyze the impact of both general and enumerated school anti-bullying laws, the researchers located data that would indicate when, if ever, each state implemented each of these laws. To account for the fact that the Youth Risk Behavior Survey is typically conducted in the spring, any policies with an effective date of June or later were coded as being in place by the subsequent biennial survey (e.g., an\nanti-bullying law with an effective date of July 1, 2005 was coded as present for the 2007 survey). For general state anti-bullying laws, data come from an article by Nikolaou (2017) , w ho documented effective dates for anti-bullying laws for each U.S. state based on a review of state legislature websites. For effective dates of enumerated anti-bullying laws that include sexual orientation protections, data come from the Movement Advancement Project (2016), a think tank focused on research and information related to LGBT equality; when necessary, state legislative websites were consulted for precise effective dates for enumerated anti-bullying laws. Additional states have enumerated non-discrimination laws that are interpreted as covering educational settings or have school regulations or teacher codes that list enumerations. However, to maintain consistency in the policy analysis, the analysis focuses exclusively on enumeration within state anti-bullying laws. Table 1 provides an overview of general and enumerated anti-bullying law effective dates for each state included in the sample, as well as availability of Youth Risk Behavior Survey sexual identity data (a requirement for inclusion in the analyses). For each policy variable, presence of a policy was coded as 1 and absence as 0."}, {"section_title": "State-Specific, Time-Varying Control Variables", "text": "For the difference-in-difference models, several state-specific, time varying controls were included to account for linear time trends by state that may relate to both student experiences of in-school victimization and anti-bullying laws, as detailed in the literature review. Table 2 includes a list of these control variables, their weighted means or percentages, and the source of data for each variable. First, the percentage of a state's population that was composed of people of color in a given year was calculated and included as a control variable. Second, a dichotomous variable was created to indicate whether a state was an \"early\" or \"late\" adopter of same-sex marriage (0=had a state law legalizing same-sex marriage by the year 2013, and 1=had a state law legalizing same-sex marriage law by 2014 or 2015, or the law was changed as part of the 2015 Supreme Court decision); this variable was chosen to try to capture statespecific trends regarding acceptance of LGBQ people. Population density was entered into the models for each state by year according to U.S. Census data to reflect the likelihood of greater contact with and acceptance of LGBQ people in more urban, densely populated states. The state income variable indicated the percentage of the population with a household income <$35,000/year in a given year, since broader economic conditions can contribute to exposure to violence and the likelihood of school violence (Khoury-Kassabri et al. 2004 ). Youth unemployment rate was entered as the percentage of youth between ages 16-19 who were unemployed for each state by year; although not much research has explored the connection between youth unemployment and bullying, past research has documented a link between higher unemployment and school shootings (Pah et al. 2017) , which would be important to account for given this study's inclusion of in-school threats or injury with a weapon as an outcome variable. Table 2 approximately here. |"}, {"section_title": "Empirical Approach", "text": "This project uses linear difference-in-difference regression models to measure the impact of general anti-bullying laws and enumerated anti-bullying laws on the incidence of bullying, or the other outcomes, allowing the impact on LGBQ youth to differ. Because states introduced the anti-bullying legislation in different years, and because states included questions on sexual orientation in different years, this provides some variation to identify causality. To put this another way, by choosing the counterfactual and looking at the common trends, this analysis studies the impact of policy presence versus non-policy, controlling for observable effects, and differencing out the unobservable variables.\nThus, the statistical method is attempting to isolate the impact of policy change on student outcomes. The linear difference-in-difference models identify the causal impact of the policies by comparing students in states with similar demographics but no policy to states where a policy exists."}, {"section_title": "The basic estimating equation is:", "text": "In this equation, the variable refers to the outcome for student i in state s in year t. The outcomes considered are bullying at school, missing days of school due to concerns about safety, being threatened or injured with a weapon on school property, and suicide ideation or attempts. The vector of variables in are the state socio-economic control variables listed in Table 2 . refers to the sexual identity of the survey respondent, whereas refers to the existence of a policy, either the general antibullying law or the enumerated anti-bullying law. The remaining variables refer to a state effect, a year effect, , and an idiosyncratic error term, Weighted regression models were run using Stata, version 14.2. For comparison purposes, the researchers also estimated unweighted models that included state fixed effects. Year effects were included in both weighted and unweighted regressions."}, {"section_title": "Results", "text": ""}, {"section_title": "Sample", "text": "This analysis focused on the 22 states ( Figure 1 ) participating in the state Youth Risk Behavior Survey who had weighted data available between 2005-2015 and asked the sexual identity question on their survey for at least one of these years (see Table 1 for a list of such states), including Massachusetts, whose data were separately requested. This sample incorporates 286,568 total possible cases, including a weighted estimate of 10.5% of youth who report a sexual identity of lesbian, gay, bisexual, or not sure."}, {"section_title": "Difference-in-Difference Estimates", "text": "As the difference-in-difference equation shows, the impact of the policy was allowed to vary, depending on the sexual orientation of the students. The linear difference-in-difference regressions included the state-level, time-varying controls noted in the Methods section as well as the state and year effects. For each outcome variable, the models were run both examining the impact of policies on youth who identified as LGB or \"not sure,\" and those identifying only as LGB (dropping the \"not sure\" respondents) to examine the robustness of results without the latter group. The first series of models examined these results for the overall sample of youth between 2005-2015, with additional models examining the policy impact by student sex (male or female) and age (15 or younger, and 16 or older). Table 3 presents descriptive information for key outcome variables by age and sex using weighted data.\n| Insert Table 3 approximately here. |\nThe difference-in-difference results are organized by outcome variables. The estimation results for the control coefficients are not displayed, but are available upon request. The results for all models suggest that LGBQ youth report higher rates of adverse outcomes compared to straight youth. This is evident from the point estimates of the coefficient on the LGB variable (see Tables 4-6 ). For example, for younger boys, the unconditional, weighted prevalence of bullying was 21.1%, meaning that roughly 1/5 of young teen boys report being bullied on school grounds. Once covariates were accounted for, the incidence of bullying for gay and bisexual boys rose by 35 percentage points, indicating that over half of these young teens experience bullying (see Table 5 ). Note that these coefficients for all models were measured very precisely, as seen from the small standard errors. For a second example, consider younger\nLGBQ girls and their reports of missing school due to feeling unsafe. Overall, about 7% of younger girls reported missing school in the past year due to concerns about safety. For LGBQ girls, even after conditioning on the model's covariates, the proportion of younger girls who reported this adverse outcome rose to about 16% (see Table 6 )."}, {"section_title": "Bullying victimization.", "text": "The results support the hypothesis that both general and enumerated antibullying laws at the state level are associated with less bullying victimization among LGBQ students. The coefficient on the policy variable indicates the impact of the policy on the outcome for boys and girls who identify as straight. The impact of the policy on the outcome for boys and girls who identify as LGBQ is the sum of the coefficients on the policy variable and the interaction term. Among straight youth overall, the impact of the general or enumerated anti-bullying laws was virtually zero; for example, the estimated coefficient of the general anti-bullying law for Panel I (see Table 4 ) was -.009, with a larger standard error. The interaction term between the policy and the LGB variable, however, was both larger and statistically significant. Once conditioned on the other explanatory variables, the existence of a general anti-bullying law meant that roughly 6.4% fewer LGB students were bullied in a given year; when including \"not sure\" respondents, roughly 7.5% fewer LGBQ students were bullied in a given year when a general anti-bullying law existed in their state. For enumerated policies, a significant result was found only when dropping the \"not sure\" youth, suggesting a less robust result:\nLGB youth living in a state with an enumerated anti-bullying law experienced 5.1% less bullying in a given year.\n| Insert Table 4 approximately here. |\nTo test the second hypothesis, the results were separated by students' sex and age (see Table 5 ), estimating both the impact of the general anti-bullying laws and the enumerated laws. The impact of antibullying laws was particularly notable for GBQ younger boys (aged 15 and under). Once conditioned on the other explanatory variables, the existence of the general anti-bullying law meant that roughly 14.7%\nfewer young gay and bisexual boys were bullied in a given year (13.1% when including \"not sure\" boys).\nSo, if, for example, around half of these young boys who are gay or bisexual were bullied in states with no such policy, only around a third experienced bullying in states with policies. The results for the enumerated policies were similar, showing that about 16.3% percent fewer of these boys experienced being bullied in states with these policies (11.6% fewer when including \"not sure\" boys). As hypothesized, these policies had less of a relationship to bullying victimization for girls or for older boys, with none of the models demonstrating a significant interaction term for the older boys, and only one model showing a significant impact for girls (younger LGBQ girls experienced 7.3% less bullying in states with a general anti-bullying law, see Table 5 ). The latter result was not duplicated when dropping the \"not sure\" young girls from the model (Table 5 ).\n| Insert Table 5 approximately here. | Fear-based absenteeism. Next, this study examined the relationship between state anti-bullying laws, enumerated anti-bullying laws, and fear-based absenteeism (skipping school at least one day in the past month due to feeling unsafe). The estimation results yielded a small yet significant reduction in fearbased absenteeism for youth overall in states with a general anti-bullying law (a reduction of 1.4% for\nLGBQ youth), but this result did not hold up when \"not sure\" youth were dropped from the models (see Table 4 ). When examining results by youth sex and age (see Table 6 ), these was no evidence that the policies impacted fear-based absenteeism for either younger or older LGBQ girls. However, there was more evidence that the policies decreased the incidence of the outcome for sexual minority boys. For younger teenage boys, for example, presence of a general anti-bullying law meant that 7.5% fewer GBQ boys experienced fear-based absenteeism. However, this result did not hold up when \"not sure\" boys were removed from the model. The impacts of the enumerated policies suggested a similar, albeit smaller, impact on GBQ older boys (4% reduction in absenteeism, only when including the \"not sure\" respondents), but a statistically insignificant impact for younger sexual minority boys. Thus, the results yielded very modest evidence of a small impact of anti-bullying laws for fear-based absenteeism among\nLGBQ youth, particularly for boys, with no measurable impact for girls, and results were not robust to removing the \"not sure\" youth from analyses.\n| Insert Table 6 approximately here. | Threatened or injured with a weapon at school. This analysis looked at whether general or enumerated anti-bullying laws impact youth experiences of being threatened or injured with a weapon at school in the past year.\nLGBQ youth were more at risk for this outcome than were youth identifying as straight, although the incidence of threats falls substantially for both older teen girls and boys. Contrary to the hypothesis, the models did not yield any significant results for LGBQ youth overall in relation to inschool threats or injury (results not displayed, but available upon request). When dividing the sample by youth sex and age, in one model only, the impact of anti-bullying policies on younger sexual minority boys was statistically significant and negative; younger sexual minority boys experienced about 13.8%\nfewer incidents of in-school threats or injury with a weapon in states with general anti-bullying laws; however, this result was not robust to the exclusion of boys who were \"not sure\" of their sexual identity.\nSuicidality. Finally, models were run with suicidal ideation and suicide attempts as outcomes. No evidence was found to indicate that the presence of state anti-bullying laws significantly lowered the likelihood of suicidal ideation among LGBQ youth -either overall, or for specific age subgroups of boys and girls (results not displayed but available by request). For suicide attempts, one model found that enumerated anti-bullying laws reduced suicide attempts by 3.3% for LGBQ youth overall in a given year; however, this result was not robust to the exclusion of \"not sure\" youth, and there were not significant results when further examined by student sex and age. Thus, there was very limited evidence that the presence of either general or enumerated anti-bullying laws impacted suicidal behavior for LGBQ youth or that these laws differentially impacted suicidality by student sex and age."}, {"section_title": "Sensitivity Analyses", "text": "Multiple alternative models were analyzed as part of an assessment of the robustness of the reported results, beyond the comparison of models with and without the \"not sure\" sexual identity category of youth. First, the models previously reported are linear probability models; since the outcome variables are binary, logit models were also run for the bullying victimization outcomes. Results were in range and similar to the linear models, so the linear models were used. Models were also run in which the same-sex marriage control variable was coded based upon the year of marriage legalization per state (coded as \"0\" during years when not legal in each state and a \"1\" during years when legal). Results did not differ from the early or late adopters coding method for this variable, so the early/late adopter coding approach was used. Several other state-specific control variables theorized to be related to youth victimization and/or anti-bullying law adoption were tested, including violent crime rates for 16-19-yearolds, political party controlling the state legislature, per-pupil expenditure, and several other average household income levels for measuring poverty, none of which demonstrated significant patterns or different patterns from existing poverty variables, so these were not included in the final models.\nThe possibility of parallel trends affecting the outcomes was examined in several ways. First, the reported results come from models that included year effects. Second, models were run including statespecific linear time trends, particularly for bullying victimization outcomes, and similar policy effect results were obtained as the models reported here. Third, the prevalence of bullying victimization for youth in general stayed relatively constant across the years examined. The research team considered running models using leads and lags to determine whether there were any pre-trends in the outcome variables or whether the effect of anti-bullying laws took a few years to be measurable after implementation. However, characteristics of the dataset limited the meaningfulness of such analysisfirst, because the data panel was quite unbalanced (many states only had one or two years of data), and second, because the survey was biennial -meaning that the policies could have been in place anywhere from a few months to almost two years before the biennial youth survey. Therefore, such models were not\nrun.\nPlacebo variables were tested that should theoretically be unrelated to anti-bullying laws, including seat belt usage (never or rarely wore a seatbelt when in a car driven by someone else) and alcohol consumption (had a drink before age 13). For younger and older boys, which were the groups most impacted by anti-bullying laws, these models produced results as expected, with no significant impact of the policies on these behaviors for GBQ boys, despite differences in the underlying behaviors by sexual identity (see Table 7 ). However, when running these robustness checks for the overall sample of youth, occasional models did find a significant impact of anti-bullying laws for LGBQ youth; because there were substantive differences in so many behaviors by sexual identity, it's possible that the passage of these laws may in some way align with other changes of monitoring behavior at school, which may impact student behavior. The results suggest that the implementation of such policies needs to be investigated more carefully to see what schools are doing or not doing when implementing such a state policy. Finally, the results were similar with and without the 2005 and 2007 bullying victimization data from Massachusetts (the only state with bullying data in those years), so these data were retained in the final models.\n| Insert Table 7 approximately here. |"}, {"section_title": "Discussion", "text": "Previous research has documented the adversities facing LGBTQ students in high schools, including greater likelihood of bullying victimization, being threatened or injured at school, and skipping school due to fear (O'Malley Olsen et al. 2014) , as well a link between bullying victimization and suicidality (Mueller et al. 2015) . State anti-bullying laws are one policy solution that could help to address such risks. While some scholars have researched the impact of such laws on general populations of students (Sabia and Bass 2017; Nikolaou, 2017) , there has been little analysis of whether these policies benefit LGBTQ students. While some past work has indicated that LGBTQ students who say their school has an anti-bullying policy that incorporates sexual orientation as a protected class report less victimization than students in schools without such a policy , such studies tend to be limited in generalizability due to the use of convenience samples and lack of objective policy data. The present study advances knowledge by using generalizable data about high school students from 2005-2015, objective state-level policy data, and a quasi-experimental design to examine whether LGBTQ students report less bullying, fear-based absenteeism, in-school threats or injury with a weapon, and suicide ideation and attempts in states that have implemented a general or enumerated anti-bullying law.\nLike previous research (O 'Malley Olsen et al. 2014 ), the present study documents that LGBQ students are significantly more likely than heterosexual students to report being bullied at school, skipping school due to fear, being threatened or injured with a weapon at school, or experiencing suicide ideation or attempts. These differences were statistically significant for every outcome examined, regardless of whether the data were for all youth or for younger or older boys or girls. Such findings reiterate the importance of identifying interventions that can create a more supportive and affirming climate for LGBQ students and reduce the likelihood of victimization for this population.\nThe first hypothesis -that having a general or enumerated anti-bullying law at the state level would predict lower bullying, in-school victimization, fear-based absenteeism, or suicidality for LGBQ youth overall -was partially supported. Accounting for state-specific time-varying controls, LGBQ students living in a state with a general anti-bullying law experienced less bullying than LGBQ students in a state without such a law (this finding was the same regardless of whether the \"not sure\" students were included in the model). Additionally, LGB students living in a state with an enumerated anti-bullying law that included protections based upon student sexual identity were less likely to have experienced bullying.\nHowever, this result was not replicated when including youth who were \"not sure\" about their sexual identity. Such findings indicate that anti-bullying laws -whether general or enumerated -make a difference in the likelihood of bullying for sexual minority students, regardless of whether the students know about such a policy and how precisely a state, district, or school is implementing the policy. This evidence contributes to previous studies of convenience samples of LGBQ students that have indicated that anti-bullying laws appear to matter for this population's school experiences .\nWhile all 50 states now have general anti-bullying laws, the findings of this study contribute to the argument that enumerated anti-bullying laws may help improve the school climate and reduce bullying for LGB students, as has been long-asserted within the best practices literature (Kosciw et al. 2012; Walls et al. 2008) . It is unclear why the enumerated policy only demonstrated a significant impact for LGB, but not LGBQ students; perhaps the enumerated policies are particularly protective of students who are already identifying as LGB and are \"out\" within their school. The impact of enumerated laws on \"not sure\" youth merits further investigation.\nFor the other outcomes, there was either inconsistent evidence of a relationship to anti-bullying laws or the findings were not statistically significant. There was some evidence that LGBQ students experience less fear-based absenteeism when their state has an anti-bullying law, but this did not hold up when only examining LGB students (dropping the \"not sure\" youth) or in relation to enumerated laws.\nSimilarly, LGBQ students in states with an enumerated anti-bullying law reported fewer suicide attempts, but this finding was not statistically significant for general anti-bullying laws or when excluding the \"not sure\" youth. It is possible that youth who answer \"not sure\" to the sexual identity question may be particularly vulnerable to fear-based absenteeism or suicide attempts in states without anti-bullying laws;\nhowever, perhaps some youth are answering \"not sure\" when they do not understand the sexual identity question. As such, this subgroup could be contributing to measurement error for these two outcomes. No significant results were documented between anti-bullying laws and in-school threats or injury with a weapon or suicidal ideation. Thus, for LGBQ youth overall, anti-bullying laws show the strongest relationship to the outcome one would theorize would be most directly impacted by such laws -that is, bullying victimization.\nRelated to the second hypothesis, the difference-in-difference models indicate that general and enumerated state anti-bullying laws, as expected, tend to have protective effects for younger sexual minority boys, but less so for girls or for older boys. Younger sexual minority boys (aged 12-15) experienced less bullying victimization in states with either a general or enumerated anti-bullying law, regardless of whether \"not sure\" boys are included in the models. There was no significant relationship between anti-bullying laws and bullying for older boys or older girls. One model indicated that younger sexual minority girls experienced less bullying in states with a general anti-bullying law, but this was not significant when dropping the \"not sure\" girls. The strong findings for younger GBQ boys suggest that the presence of a state anti-bullying law -whether a general law or one with specific protections for GBQ students -correlates with a lower likelihood that this group of boys will experience bullying. Although past studies have documented greater likelihood of bullying among boys (Messias et al. 2014) as well as noted the relationship between bullying and homophobic name-calling among young boys (Birkett and Espelage 2015) , few if any studies, particularly using multiple years of data on anti-bullying laws, appear to examine the differential impact of such laws based on student sex, including for LGBQ students.\nHatzenbuehler and colleagues' (2015) study did not find consistent effects of student sex on the relationship between anti-bullying laws and bullying victimization, which contrasts with these results for\nLGBQ youth.\nYounger GBQ boys experienced less fear-based absenteeism in a state with a general antibullying law, and older GBQ boys experienced less fear-based absenteeism in a state with an enumerated law, but in both cases these results did not hold when dropping the \"not sure\" boys from the GBQ group.\nThese results reflect that expectation that a general anti-bullying law may increase feelings of safety among male students when capturing students who are questioning their sexual identity, thus lowering their fear-based absenteeism. The presence of such state laws may be impacting the local schools' policies around bullying such that bullying behaviors are paid attention to and more directly challenged by teachers and other staff, helping to improve the level of safety for GBQ boys. For older GBQ boys, perhaps the presence of an enumerated school policy reflects an environment that is more supportive of\nLGBQ people and promotes a safer school environment for older boys, though it's unclear why this does not have similar effects for younger boys and does not hold up when dropping the \"not sure\" boys. These findings are rather modest yet encouraging nonetheless given the deleterious effects absenteeism can have on academic well-being and ultimately graduation from high school. Neither type of anti-bullying law had an impact on fear-based absenteeism among LGBQ girls.\nNo significant results were found for LGBQ students by sex or age for in-school threats or injury, suicide ideation, or suicide attempts, contrary to the hypothesis. This contrasts with other literature documenting evidence of a negative correlation between enumerated anti-bullying laws and in-school victimization among LGBQ and transgender students ). One key difference may be that the present study relied upon objective indicators of an anti-bullying law, while Kosciw et al. asked LGBTQ students if they know if their school had an anti-bullying law. Students who are aware of the presence of such laws at a school-level may be in schools that are doing a particularly strong job at enforcing such policies through training of administrators, teachers, and students and creating a culture of zero tolerance for bullying as well as other forms of violence. In contrast, the present study does not capture student's awareness of such policies; thus, some students may reside in states where such laws exist, yet they see very little daily evidence of the implementation of anti-bullying policies in their own school. By not capturing information about implementation of such policies, the present study does not examine the nuances of how different reporting requirements, staff training expectations, or disciplinary actions may affect the larger school culture-particularly when expanding beyond bullying behavior to other forms of violence, such as physical assault. The lack of significant impact of anti-bullying laws on suicidality of LGBQ students may reflect both the lack of information about implementation of these laws as well as the many factors contributing to suicidality for LGBQ students that are above and beyond the reach of such laws, including their degree of internalized homophobia, whether these students have been rejected by their families or spiritual communities, and whether they have been exposed to other anti-\nLGBQ traumatic events outside of school. Indeed, compared to heterosexual students, LGBQ students in this study experienced greater disparities with suicidal ideation and suicide attempts than with any of the other outcome variables. Other research has found that the relationship between bullying victimization and suicidality is fully mediated by substance abuse, violent behavior, and depression, highlighting the role that other factors may play in relation to suicidality (Reed et al. 2015) .\nThis study indicates that the presence or absence of a general anti-bullying law or enumerated anti-bullying law generally did not have a statistically significant relationship with bullying victimization, fear-based absenteeism, being threatened or injured with a weapon, or suicidality among LGBQ girls in high school. This includes younger girls, even though the hypothesis was that younger students would be more impacted by the presence of anti-bullying laws (only one model showed a potential relationship between a general anti-bullying law and bullying victimization for younger girls). It is unclear why such policies may help younger sexual minority boys, but not younger girls. It may be that LGBQ girls would be more impacted by district-and school-level implementation of anti-bullying laws rather than policy presence at a state level. Perhaps girls' experiences of bullying victimization and feelings of not being safe at school are less often a function of sexual orientation alone and may reflect overlapping identitiesincluding sex, body size, or race -as well as social dynamics that are not well-addressed through antibullying laws. Temkin (2008) suggests that definitions of bullying within state anti-bullying laws generally overlook social aggression; such an omission could impact whether girls' aggressive behaviormore likely than to be socially aggressive than physically violent -is being addressed as bullying by school officials. Others (Shute et al. 2016 ) have documented how psychological aggression, including sexual insults, is the type of bullying most directly related to girls' experiences of feeling less safe at school. Sexual insults and harassment related to one's body might not necessarily be understood as \"bullying\" by girls, their teachers, or their schools, or even may be treated as \"normal\" experiences for girls, not as significant as physical aggression, and therefore not worth challenging (Jamal et al. 2015) .\nFurther, sexual insults and harassment might not be captured as easily either in surveys measuring bullying or in school bullying reporting requirements. Scholars have documented how girls' reports of bullying, particularly related to sexual behaviors or gender, may be systematically ignored or trivialized by adults (Mishna et al. 2018 ); if such norms are replicated in how anti-bullying laws are enforced, this could help explain why the simple presence of such laws has little measurable impact on victimization, absenteeism, and mental health for LGBQ girls."}, {"section_title": "Implications", "text": "This study provides evidence that anti-bullying laws matter for LGBQ high school students in relation to bullying victimization, particularly for younger gay, bisexual, and questioning boys. The methodology used suggests that these results have causal implications, rather than indicating that states most concerned about bullying are more likely to pass laws. This finding is valuable given the fact that young sexual minority boys face greater risks for experiencing bullying and other forms of victimization based on their sexual identity and/or gender expression compared to LGBQ girls and older LGBQ youth (Kosciw et al. 2009; Toomey and Russell 2016) .\nAs mentioned earlier, implementation of general and enumerated anti-bullying laws at the state level can vary considerably. Evidence related to the impact of such laws for students has indicated that knowledge and implementation matter in reducing student victimization. More precisely, having greater specification and intensity within the dimensions of an anti-bullying law-including having a clear definition of bullying, mandates for written records and filing reports, details about how investigations will be conducted, and disciplinary consequences for bullying-contribute to lowering fear-based absenteeism, fights at school, and bullying victimization (Nikolaou 2017; Sabia and Bass 2017) . There is some evidence that, with enumerated laws, educators may be less likely to know that protections based on sexual orientation are included in policies, and less likely to report sexual orientation-related bullying than that based on other protected classes (Hall and Chapman 2018) . Such lax implementation likely impacts whether bullying and other forms of anti-LGBQ victimization are reduced for LGBQ students.\nCross-sectional data with LGBTQ students suggest that those who know that their school has an enumerated anti-bullying law also experience fewer incidents of victimization and report greater likelihood that staff intervene when anti-LGBT comments are made . Such research indicates the importance of ensuring that states do not just have anti-bullying laws in place but make efforts to increase awareness about them about school employees and students, implement precise procedures for reporting bullying, pay attention to cultural norms that encourage inclusivity and discourage student violence and homophobia, and hold students accountable for acts of bullying. an analysis of leads and lags in relation to policy implementation."}, {"section_title": "Limitations and Future Research", "text": "Second, transgender youth could not be identified within the sample -even though they tend to be at even higher risk for victimization than LGBQ students This research only looked at the impact of the presence or absence of general and enumerated antibullying laws at a state level; further insights could be gained from school or district level data, as well as data that measure the intensity of anti-bullying law implementation. While the difference-in-difference approach was used to study the impact of a policy while accounting for common trends and controlling for observable effects, there may be other factors related to the changing acceptance of LGBTQ people and growing intolerance of anti-LGBTQ bullying that contribute to reductions in LGBQ student victimization in certain states. The present student attempts to account for some aspects of larger state culture by including a control variable related to each state's legalization of same-sex marriage. However, this may not fully capture the cultural shifts that are happening alongside of changes in anti-bullying laws and student victimization in various regions of the country. Thus, there may be some important omitted variables that were overlooked in these models. Finally, the results of this study indicated different patterns of policy impact between LGBQ girls and boys, with no significant impact of general or enumerated anti-bullying laws for LGBQ girls. Further research is needed into how anti-bullying laws and other school policies can reduce victimization for LGBQ girls."}, {"section_title": "Conclusion", "text": "Given the well-documented risks for bullying and other forms of victimization that face LGBQ adolescents O'Malley Olsen et al. 2014) , there is a need for research about interventions that can address this issue. General anti-bullying laws are now present in all 50 states (Nikolaou 2017) Est. = estimated. ABL = Anti-bullying law. LGB = lesbian, gay, or bisexual. Enum = enumerated. ABL: no policy = 0; policy = 1. Enumerated ABL: no policy = 0; policy = 1. LGB or not sure: 0 = straight; 1 = LGB or unsure.\nEstimates take into account weighting and complex sampling design of the YRBS. Standard errors based on stratified cluster sampling are in parentheses. Controls include state-specific time-varying variables listed in Table 2 . * p < .05. ** p < .01. *** p < .001. Estimates take into account weighting and complex sampling design of the YRBS using data from 2005-2015. Standard errors based on stratified cluster sampling are in parentheses. Controls include state-specific time-varying variables listed in Table 2 . Abbreviations and variable coding as in Table 4 . * p < .05. ** p < .01. *** p < .001. "}]