[{"section_title": "Introduction", "text": "Federal crop insurance (FCI) is a key component of US farm policy. While a vast literature considers the impact of FCI on production decisions, few empirical papers consider the impact of FCI on financial decisions. An emerging body of research is showing that a strong relationship exists between crop insurance participation and debt use. This relationship may due to risk balancing, or producers increasing financial risk in response to the lower business risk provided by crop insurance (Ifft et al., 2013). This relationship is also consistent with FCI addressing financial constraints or credit market imperfections in agriculture. If FCI does relax credit constraints in the farm sector, it may be creating substantial value. This study establishes the mechanisms through which crop insurance may alleviate credit constraints, using both a theoretical model and empirical analysis of farm financial data. Financial constraints can be broadly attributed to credit market imperfections that lead to information asymmetry between lenders and borrowers. Many empirical studies have established that firms are often subject to financial constraints, but the severity varies based on firm characteristics (Carreira and Silva, 2010). A large literature considers the impact of credit constraints in developing countries as well as the effectiveness of microfinance (Sadoulet and De Janvry, 1995). While credit constraints are certainly not present to the same degree in the U.S., they do have an impact on the farm sector. Briggeman et al. (2009) found that agricultural productivity was 3 percent lower than it would have been without the presence of credit constraints. While this impact might be considered relatively small, 3 percent of the value of agricultural sector production in 2005 would have been more than $8 billion (Economic Research Service, 2013). While high farm income and low interest rates over the past decade led to a situation of substantial competition between banks to lend to established borrowers (Kauffman and Akers, 2013), other groups such as new and beginning farmers may have continued to face difficulty accessing credit. Current forecasts indicate for a decline in farm income and increasing interest rates are likely over the next few years. If farm income declines, credit access may become a more widespread issue. Bierlen and Featherstone (1998) found that credit constraints played a role in investment in cattle inventories, especially during periods of low cash flow or more generally low farm income. Bierlen and Featherstone (1998) note that farms may face credit constraints because (1) due to either the capital intensive nature of farming, most assets being are \"farm-specific\" and hence not diversified, (2) inputs must be purchased long before crop or livestock sales, and (3) equity markets do not exist for most for farms. They also note that credit constraints did not affect any class of producer in their study in the 1970s but did affect some more vulnerable groups in the 1980s. In the 1970s lending conditions were notably less stringent than currently, and were tightened substantially in 1980s in responses to the farm crisis (Barnett, 2000). Other studies have shown evidence of how credit constraints affect the U.S. farm sector. Chaddad et al. (2005) found evidence of financial constraints for some agricultural cooperatives in the U.S. Mishra et al. (2008) find that farm solvency has an impact on farmland values, and suggest that government payments may affect farmland values not only directly but through through relaxing credit constraints. Hartarska and Nadolnyak (2012) found that new farmers in Alabama after 2005 were financially constrained. The finding that young operators are financially constrained is common in the agricultural economics economics, as well as the broader literature on credit constraints. Carreira and Silva (2010) found many empirical studies have shown that younger firms are more likely to be financially constrained."}, {"section_title": "Crop Insurance and Farm Policy", "text": "For almost two decades, FCI has been sold by private companies, who offer a variety of insurance policies that have been authorized the USDA Risk Management Agency (RMA). Indemnity risk is shared by the government and insurance companies, and subsides are provided for administration of the program and a share of the premium based on total coverage. Nearly 296 million acres were enrolled in a FCI program in 2013, with high enrollment levels for most major agricultural commodities. Premium subsides were $7.3 billion, about 62% of the total premium. While total premiums and premium subsidies have been increasing over the last decade due to a combination increasing enrollment, coverage rates, and commodity prices, the subsidy share of the total premium has been relatively constant (Risk Management Agency, 2013). One justification for the current level of subsidies is that they are necessary to ensure sufficient enrollment, which in turn can lower total costs if risk is spread across a large insurance pool. Net government costs for the program have been estimated to be approximately $4 billion per year from 2001 to 2012. In addition to premium subsidies and other costs, the government can incur underwriting loss or gains (Barnaby, 2013). For a more detailed review of the FCI program, see Glauber (2013). The Agricultural Act of 2014 (\"new farm bill\") strengthens the FCI program while eliminating direct payments and authorizing new programs that, like crop insurance, will only pay out when prices and/or yields fall below a certain level. The new farm bill marks a substantial change in agricultural policy, and follows a period during which the growth of crop insurance has coincided with a decline in the importance of other farm programs. While over the past decade payments linked to market prices averaged about 22% of total farm program payments, countercyclical payments, Average Crop Revenue Election Program (ACRE), and loan deficiency payments were less than one percent of farm program payments in 2012 and 2013. Since 2011, FCI premium subsides have been roughly equivalent to all \"non-conservation\" government payments. (Economic Research Service, 2013). As a reliable source of income, direct payments have been theorized to facilitate access to credit (Westcott and Young, 2004). Direct payments are paid based on historic acreage of eligible commodities or a farm's base acres. Kropp and Whitaker (2011) found that farms with a larger share of base acre faced slightly smaller interest rates for short term loans. Direct payments have remained relatively steady and are much smaller relative to revenues and expenses for most field crops than a decade ago. Ifft et al. (2012) found that elimination of direct payments would not lead to a substantial decline in the financial position of the majority of farms receiving direct payments. Given the elimination of direct payments, crop insurance and the new farm programs that pay out based on current market conditions may now have a larger role in farm financial decisions than in the past. A conceptual framework is needed to formalize how FCI affects credit constraint. Few theoretic literature discuss the interaction between the two. However, abundant theoretic and empirical works exist on each of the topics separately. Babcock (2012) provides a simple model on farmers' optimal choice of crop insurance coverage level. The author setup an expected-utility maximization framework where the randomness comes from crop yield and farmers optimize over possible coverage levels to maximize expected utility of profit. The model of Babcock (2012) is stemmed from Babcock and Hennessy (1996), which discusses the optimal input use under crop insurance. The main difference between the two models is that Babcock and Hennessy (1996) allows for different yield distribution conditional on different input choices, but the coverage level is assumed to be fixed. In our paper, the framework of Babcock (2012) is adopted as it explicitly models farmers' preference over crop insurance usage. Meanwhile, Sadoulet and De Janvry (1995) discusses a series of models on farmers facing credit constraint and Briggeman et al. (2009) is a recent extension of the credit constraint model of Sadoulet and De Janvry (1995). In Briggeman et al. (2009), farmers make intertemporal decisions on both consumption and production where the total borrowing limit is assumed to be a function of a set of farmer's characteristics. In our context, we aim to provide a conceptual model that combines the farmers' optimal choice of crop insurance and credit constraint modeling."}, {"section_title": "Data", "text": "We use data from the 2005 Agricultural Resource Management Survey (ARMS) to analyze the relationship between crop insurance participation and financial constraints. ARMS is a nationally representative annual survey of farm and ranch operators conducted by the USDA to obtain information about the status of farm finances and resource use (Kuethe and Morehart, 2012). ARMS stratified sample design requires weighted estimation of sample statistics, and we use the delete-a-group jackknife procedure of Kott (1998). "}, {"section_title": "Model", "text": "Consider a farmer's expected utility maximization problem. Let U(•) be the concave utility function for the farmer. Let q be the actual yield of the crop that the farmer grows, which is stochastic. We useq to denote the expected yield, and f (q) the distribution of q, where q ∈ [0, q M ]. Let b be the share of the expected yield that a farmer would like to purchase crop insurance on and r(b) be the premium of the insurance. The insurance pays the indemnity I = max(bq − q, 0) at the market price p, which is normalized to 1. Let a be the cost of producing the crop. Following Babcock (2012) and Babcock and Hennessy (1996), the expected utility of the farmer can be written as: where π 1 (a, b, q) = bq−a−r(b) is the profit when realized yield is less than bq, and π 2 (a, b, q) = q − a − r(b) is the profit for the case of q > bq. Let B be the credit constraint that the farmer faces. Following Briggeman et al. (2009), we assume that the total credit of the farmer is a function of farmer characteristics z q . Moreover, to reflect the possible impact of crop insurance on credit constraint, we also assume that B is affected by insurance coverage level r(b). Then the credit constraint inequality can be written as: In order to find the optimal of insurance coverage, we first write the Lagrangian for the problem as: And the Kuhn-Tucker condition associated with the problem are: Equation 5is essentially the complementary slackness condition: at optimal point, either the farm is operating at its credit limit or the shadow price λ of the constraint is zero. When the constraint is not binding, the first order condition (equation 4) reduces to the usual ∂EU ∂b = 0 condition. To investigate the optimal insurance coverage level under credit constraint, it is useful to first analyze the unconstrained case, which are introduced in Babcock (2012). We highlight some of the remarks under the unconstrained case. First of all, when the insurance premium is set at actuarially fair level, then the expect indemnity payment must equal to the insurance premium r(b). Note that indemnity is given by I = max(bq − q, 0), then the insurance premium must have the following form: Second, under actuarially fair insurance premium rate, farmers' expected utility is increasing in the coverage level b, for all b To see this, we note that: Notice that the marginal utility of π 1 is independent of q, and r ′ (b) = bq 0q f (q)dq under actuarially fair premium rate, then equation 7 can be further rewritten as: Note that measures the marginal risk premium of the farmer. We use P to denote the term. Due to concavity of the utility function, we have, for all b ∈ [0, q M q ], P > 0 , which implies that ∂EU ∂b > 0. A direct consequence of ∂EU ∂b > 0 is that, for farmers that don't operate at their credit limit, they will purchase full insurance at actuarially fair premium rate. For farmers that are operating their credit limit, we have the following remarks: Remark 1 For farmers that are operating their credit limit, the marginal risk premium must equal to the marginal shadow cost under actuarially fair insurance premium rate. This remark is derived from the optimality condition under credit constraint (equation 4). Combining the marginal expected utility expression in equation 8and equation 4, we know that the following equality must hold: The rationale behind equation (9) is that, with higher level of crop insurance coverage, farmers are less exposed to risk and the marginal risk premium goes down. However, higher insurance coverage pushes the farm's budget towards its credit limit. Then the farm must balance its extra insurance purchase and the shadow cost of insurance on the margin. By our assumption in the setup of the model, the term dB dr determines how much extra credit can be given under one extra dollar on crop insurance. Then the λ(1 − dB dr ) measures the effective shadow price of the credit constraint. In particular, we notice that when dB dr = 0, the marginal risk premium equals to the shadow price λ. Remark 2 For farmers that are operating their credit limit, they may or may not be restrained from full insurance depending on the magnitude of dB dr under actuarially fair insurance premium rate. This remark is a corollary of remark 1. Notice that, actuarially fair insurance premium, unconstrained farmers are willing to cover more than 100 percent of their potential yield loss. This is because the optimal coverage level b * = q M /q, which is greater than one. Thus, unconstrained farmers are willing to take full insurance. The question is whether constrained farmers necessarily purchase full insurance. And the key to the answer of this question lies in the magnitude of dB dr . We use figure 1 to help explaining the intuition. By construction of the problem, the expected utility is a concave function of coverage level b. Without credit constraint, the optimal b should be q M /q, but is restrained to 100 percent. Under credit constraint, the optimality condition ∂EU ∂b = λr ′ (b)(1 − dB dr ) indicates that the tangency occurs at a lower coverage level. However, if dB dr is sufficiently close to 1, we may still have a situation that farmers with credit constraint will purchase full insurance. On the other hand, when dB dr is close to 0, the tangency occurs at a steeper portion of the expected utility curve, which means farmers may choose to not fully insure their crops. As illustrated in figure 1, the optimal b * may be well under 100 percent. Moreover, if dB dr is greater than one, then farmers will definitely get full insurance. This remark can be viewed as a complementary argument to the moral hazard theory in Babcock (2012). Babcock (2012) realize that, unlike the theoretic predictions, not all farmers are willing to purchase the highest coverage. And the author explained that this is due to the fact that, at highest coverage level, the insurance premium rate is set to be higher than actuarially fair rate to fight against moral hazard problem. But our model shows that, even if moral hazard problem does not present, we may still observe less than full insurance which comes from farmers' credit constraint. Remark 3 The effect of farmers' characteristics on credit limit is further leveraged by optimal choice of crop insurance. In Ifft et al. (2013), one of the major finding is that farms with crop insurance may take more debt on average. In our model, this fact can be explained by the interaction between farm characteristics and optimal choice of crop insurance. Using implicit function theorem,  ∂b 2 < 0 is given by the second order condition. Then we have Notice that the effect of farmers' characteristics on credit limit can be written as: Equation (11) is essentially saying that the total effect of farmers' characteristics on credit limit can be decomposed into a direct effect and an indirect effect through crop insurance purchase. Therefore, even if farmers background characteristics are similar, their risk attitude among other factors may induce different crop insurance purchase patterns that will generate differences in debt positions. It should be noted that premium subsidy is not discussed in the simple model above. The natural next step is to ask whether the claims in the remarks above still hold. It's attempting to conclude that crop insurance participants are willing to purchase more insurance when the premium is subsidized. However, a closer look at the subsidy implementation may lead us to different conclusions. We know that the insurance subsidy is declining as coverage level  Equation 13indicates that when the marginal total subsidy is declining as coverage level increases. (i.e., (r • s) ′ (b) < 0) It is possible that marginal cost of crop insurance with subsidy is higher than the marginal premium rate without subsidy. Remark 4 Under insurance subsidies, the effect of farmers' characteristics on credit limit depends further on the sign of (r • s) ′ (b). Notice that now equation (11) becomes: where The essential message of remark 4 is that, under insurance subsidies, the effect of farmers' characteristics on credit limit can behave differently if (r • s) ′ (b) have different signs for different coverage levels. Suppose that the marginal effect of subsidy on crop insurance purchase changes from positive to negative at someb, then the effect of farmers' characteristics on credit limit will be different for b >b and b <b. Therefore, with crop insurance subsidies, the indirect effect of farm characteristics on credit limit through crop insurance enrollment is separated for different coverage levels, which comes from the changes of marginal subsidy over coverage levels. The intuition of the remark is straightforward: when subsidy effect is small, the premium of the crop insurance gets closer to the actuarially fair level. Consequently, more expensive insurance offsets the impact of insurance purchase on credit limit."}]