[{"section_title": "Introduction", "text": "The concept of multifunctionality in agriculture has become important in characterizing agricultural systems. Multifunctionality is the production of multiple outputs of agricultural activity in addition to producing food and fiber, such as maintaining the viability of rural communities and environmental sustainability (Wilson, 2008). The adoption of policies to support multifunctionality in farming has been especially important and dominant in Europe and Asian countries, as an effort to maintain flexibility in their farm and rural policies and to justify decoupled farm sector support. In this study we adopt the OECD definition of multifunctional agriculture which recognizes that \"Beyond its primary function of producing food and fibre, agricultural activity can also shape the landscape, provide environmental benefits such as land conservation, the sustainable management of renewable resources and the preservation of biodiversity, and contribute to the socio-economic viability of many rural areas. Agriculture is multifunctional when it has one of several functions in addition to its primary role of producing food and fibre\" (Maier and Shobayashi, 2001). There is a lack of empirical analysis in the U.S. about what factors motivate multifunctional agriculture activities. Although, \"multifunctionality\" per se is not a widely used or accepted term in U.S. agricultural policy (Bohman et al., 1999;Freshwater, 2002;and Blandford et al., 2002), its principles are particularly fundamental to some working lands conservation policies and programs, such as the Environmental Quality Incentive Program (EQIP), the Conservation Security Program (CSP), and the Wildlife Habitat Incentive Program (WHIP). Farmers are also engaged in providing recreational and agri-tourism services such as hunting, fishing, bird-watching, farm tours, petting zoos and hospitality services. Rice farmers in the U.S. have enjoyed in recent years very profitable conditions from the cultivation of rice (Baldwin et al. 2011). Despite favorable conditions, the farmer's scope of activities has expanded by adapting more efficient practices and engaging in other activities that provide farm income diversification. Participation in conservation programs, which introduce and encourage environmental considerations into agricultural operations, can be used as an indicator of a farm being multifunctional. Additional indicators of multifunctionality are the engagement in on-farm income diversification through the provision of recreational activities and agritourism services such as duck hunting. Selecting rice as a case study to analyze multifunctionality in U.S. agriculture is useful for two reasons. First, because rice is a staple crop with a very wide global distribution, it has always been the recipient of high domestic support in national policies, even in the case of the U.S. where consumption levels are relatively low compared with other countries. Second, rice production has received considerable attention as a multifunctional crop in different regions, as for example in the European Common Agricultural Policy or in Japan and other Asian countries (Cooper et al, 2009;Matsuno et al., 2006). The objective of this paper is to identify factors that affect U.S. farmer participation in initiatives considered multifunctional in rice production. A binary logit model is estimated for the empirical analysis. This modeling framework is selected because of its wide application to many empirical studies and the fact that it is appropriate for a binary dependent variable. However, as we subsequently discuss, a multinomial logit model could have application."}, {"section_title": "Data and Methodology", "text": "Using the Agricultural Resource Management Survey (ARMS) we analyze factors associated with participation in conservation, recreation and agri-tourism activities as a function of farm structure, farm financial measures, production practices, and socio-demographic characteristics of the farm operator. This study uses data collected for rice farms in 2006. From this sample, a total of 489 farms were included in our analysis. 1 To estimate the functional relationships we estimate a binary logistic model where the dependent variable takes a value equal to one if the farm operator reports in the ARMS survey participation in conservation programs, recreation or agritourism activities, zero otherwise Past studies provide references to factors that affect the adoption of best environmental practices or participation in conservation programs for the U.S. (see for example Caswell et al., 2001;Lambert et al., 2007;Prokopy et al., 2008;Chang and Boisvert, 2009). Although there are similarities among various studies, not all the studies use the same variables and the impact of the selected variables sometimes differs from one study to another. Table 1 provides a list of all these variables from the literature reviewed for the present study. Binary choice models are used to model situations that arise in a context where the dependent variable is constrained to one of two alternatives. In essence the binary logit model allows the computation of the marginal change in the odds ratio of an outcome as a function of a given independent variable. Since probabilities cannot exceed one (nor be less than zero) there is inherently a nonlinear relationship between the change in odds ratios and unit changes in the independent variables. This inherent non linearity is evident from the logit model and can be written as; log (P i /(1-P i ))= α+β 1 X i1 +β 2 X i2 +...+β k X ik . In the equation the α and β j are parameters to be estimated and the X ij are the values of the j th independent variable for the i th farm operator. PROC LOGISTIC procedure of the statistical package SAS was used to obtain parameter estimates. 2 The coefficients in the logit model are difficult to interpret, but the effect of marginal changes on the odds ratio for a unit change in one of the independent variables can be easily computed. To get the percentage change in the odds ratio for a one unit change in an independent variable it is sufficient to exponentiate the coefficient, subtract 1 and then multiply the difference by 100. Such statistics are computed in the empirical section. For the initial estimated model, all the available independent variables suggested from literature in table 1 were included. Based on the results of the initial model and the descriptive statistics of the variables, a second model was estimated only including those variables at least minimally significant in the original logit model or strongly suggested in the literature. These variables and their sample means are included in table 2. The final estimated model only includes those variables significant in the preliminary model, or whose importance was emphasized in previous studies."}, {"section_title": "Results and Discussion", "text": "The estimated logit model can be used to identify and understand the impact of factors affecting choice of rice farms to engage in multifunctional activities, either because farm operators receive income or cost sharing from conservation programs or because farm operators receive income from conducting recreational activities or agritourism on the farm. Based on the ARMS 2006 sample, an estimated 22% of the rice farms registered income for the multifunctional activities considered for 2006. Fig. 1 shows the estimated distribution of the total number of rice farmers participating in multifunctional practices for the different states. The lowest rates of participation are in the states of Arkansas and Missouri at 19%, slightly below the national average. California with 36% and Texas with 30% show the highest rates of participation. For the final model, higher education and technical assistance were found to be statistically significant at the 0.01 and 0.010 levels, respectively (Table 3). Given the large disparity in participation rates among the states just discussed, it is surprising that the state binary variables in the estimated model are not statistically significant. In part of our estimation it became clear that participation in Missouri was so small that to get reliable estimates of model parameters we had to combine Missouri into one state with Arkansas. But the lack of a \"state\" being significant suggests that there is a sample size problem. Since the estimated proportion of farms participating was 22%, there apparently was not sufficient variation to identify a state effect. We suspect that this sample size problem also rolled over to the individual variables. It should also be noted that each observation in an ARMS data set is given a weight to indicate how many farms it likely replicates. So estimation is undertaken using weighted maximum likelihood. In such situations we suspect the weights can skew the impact of particular variables. For example, if large farms are more likely to be multifunctional, then their impact may be overshadowed by smaller, non-participating farms that will enter the estimation routine with larger weights. There are also potential issues of endogeneity in the independent variables that may be making it more difficult to find statistical significance. Yield is a potential example. Participating in a land conservation program could require the retirement of land so that less productive land would be retired and, as a consequence, yield would increase. Another variable, implementation of water management plans for irrigation, was found not significant but it may have an endogenous effect on the dependent variable as participation in a conservation program may require development of a water management plan for irrigation. Table 4 displays the estimated odds ratios based on the estimated coefficients for each variable. These values are then computed by exponentiating the estimated coefficients for each variable. In the far right column the values indicate the percentage change in the odds ratios for a one unit change in the independent variable. These percentage changes show that not only are more education and technical assistance significant, but that they have reasonably large impacts. The highest impact variable is having education beyond the high school level. The percentage change is 291indicating that farmers with some education beyond high school increase their probability of being multifunctional by approximately a factor of three. The effect of having some technical assistance is slightly lower with an impact of about a factor of two. The access to technical assistance helps farmers solve crop management problems while giving information and advice on practices and initiatives that increase the viability of sustainable production and optimizing resources. According to this result, increasing the supply of services to provide technical assistance could also increase producer participation in multifunctional agriculture. According to the model estimates, the operator educational level has a major impact on the adoption of multifunctional practices (figure 2). A higher level of education is associated with an increased ability to learn new practices and adapt innovations at the farm level, indicating a greater ability to access information and more operator human capital.  The other variables were found to be not significant. However, the signs and parameter estimates for those variables suggest the effect of these variables on the decision to become multifunctional may be important in a study with a larger sample that includes other crops and profitability which has led to the expansion and consolidation of farms in Arkansas and Missouri (Baldwin et al., 2011). Years of farming experience is positively related to the increase in the likelihood that farm operators adopt multifinctionality; similar to the effect of education, but its coefficient is not statistically significant. Net worth is also not significant for the model. The estimated parameter sign suggests that farms with larger capital should be more likely to participate in multifunctionality, but it is clearly not significant, unlike the finding by Lambert et al. (2007). Finally, the percentage of land owned suggests the interest of owners adopting more sustainable or diversified practices to maintain the farm into the future. This assumption can be related again with the regions that in the last years had less intensive production systems. While the binary logit provides a point of departure for the analysis, future investigations should consider using a multinomial logit model. As currently modeled, farms are categorized as being multifunctional or not. But in the binary approach essentially six different forms of multifunctionality are lumped into one category. Analysis will be undertaken to determine if the six forms of multifunctional activities can be modeled separately. Such an approach with the current sample would likely not be successful. Greater numbers of observations could be generated by using a series of years and this might add needed variability to the sample. Also, sample size could be greatly enhanced by expanding the model to incorporate different farm types rather than have it be solely a rice model. Even with more years and farm types, expanding to a multinomial model with six different types of multifuncitonality might be beyond the ability of a logit model to find significant results. An intermediate aggregation could also be explored where multifunctionality is categorized into groups that are related to: (1) working lands conservation programs, (2) land retirement programs and (3) agritourism/recreation."}, {"section_title": "Conclusions", "text": "This study contributes to the empirical analysis of factors associated with multifunctionality in U.S. rice production. Multifunctionality was defined for the purpose of this study to include participation in conservation programs and reported income from recreational and agritourism activities. The ARMS data for U.S. rice farms collected in 2006 was used to evaluate the relationship between multifunctionality and a set of factors suggested by previous literature. The study found that operator educational level and conservation technical assistance have a significant and positive relationship with participation in multifunctional activities on rice farms. Further research on participation in multifunctional activities for producers of rice and other crops should investigate individual conservation programs and recreational and agritourism enterprises. Another promising area of investigation is geographic or regional differences in the U.S. with regard to multifunctionality."}]