[{"section_title": "Abstract", "text": "We describe methods used in the Year 6 Follow-Up (Y6FU) of children who participated in the Infant Feeding Practices Study II (IFPSII). This study consists of a questionnaire administered 6 years after the IFPSII to characterize the health, development, and diet quality of the children.\nThe Y6FU sample was a subset of those who participated in IFPSII. The IFPSII participants were drawn from a national consumer opinion panel; neither the IFPSII nor the Y6FU sample is nationally representative. The Y6FU sampling frame included all qualified participants who answered at least the first postnatal questionnaire. One questionnaire was administered by mail in 2012, and nonrespondents were contacted for a telephone interview. Survey topics included measures of health, development, diet, physical activity, screen time, and family medical history. We attempted to contact 2958 mothers and obtained completed questionnaires from 1542, a response rate of 52.1%. We conducted 2 sample evaluations, 1 comparing respondents and nonrespondents on data from IFPSII and the other comparing Y6FU respondents with 6-year-old participants in the National Survey of Children' s Health.\nRESULTS: Y6FU mothers are more likely to be white, married, older, and of higher education and income than both nonresponders and nationally representative mothers. Comparisons also revealed health-related differences and similarities.\nAlthough not nationally representative, the Y6FU provides a valuable database because of its wide coverage of diet and health issues and its unique ability to link early feeding patterns with outcomes at age 6 years. Pediatrics 2014;134:S4-S12"}, {"section_title": "", "text": "The Infant Feeding Practices Study II (IFPSII) was a longitudinal study of a geographically diverse cohort of US mothers and their infants born between May 2005 and March 2006, with information about feeding and care collected 12 times in nearly monthly questionnaires from the last trimester of pregnancy through the infant' s first year of life. 1 The Year 6 Follow-Up (Y6FU) study provided followup data on the IFPSII sample children through a single questionnaire administered in 2012, 6 years after the IFPSII, to characterize the health, development, and diet quality among children who participated in the IFPSII. In addition to these outcomes, information was collected on child care and school arrangements, cognitive stimulation at home, dental hygiene, physical activity of the child and the mother, screen time, sleep patterns, the eating environment, exposure to cigarette smoke and other inhaled contaminants, family medical history, maternal employment, health insurance coverage, and participation in government nutrition programs.\nBoth the IFPSII and the Y6FU were conducted collaboratively by the US Food and DrugAdministrationandtheCenters for Disease Control and Prevention, and both studies were guided by a working group with representatives from other agencies in the Department of Health and Human Services and from the US Department of Agriculture. For the Y6FU, the Department of Health and Human Services participants in the working group included scientists from the 2 principal agencies and the Office of Women' s Health, Eunice Kennedy Shriver National Institute of Child Health and Human Development, the Maternal and Child Health Bureau in the Health Resources and Services Administration, and the Agency for Healthcare Research and Quality. Additional scientific support was provided by scientists at the Economic Research Service and the Food and Nutrition Service of the US Department of Agriculture and also by scientists who had participated in the IFPSII from universities and nonprofit organizations. The group included experts in nutrition, pediatrics, epidemiology, study design, dietary assessment, food allergy, child health, economics, and other areas.\nThe methods of the IFPSII have previously been published. 1 This report describes the methods of the Y6FU, including a comparison of respondents and nonrespondents in the Y6FU based on data from the IFPSII and a comparison with 6-year-old children in a nationally representative study, the National Survey of Children' s Health (NSCH) 2011-2012. 2 "}, {"section_title": "STUDY SAMPLE", "text": "The sampling frame for the Y6FU was mother-infant pairs who participated in the IFPSII. The IFPSII sample was obtained from a nationally distributed consumer opinion panel consisting of 500 000 households throughout the United States. 1 Participants in the IFPSII cohort were $18 years old at the time of the prenatal questionnaire and had delivered a singleton infant who was $35 weeks' gestation and weighed $5 pounds at birth. In addition, the mother and baby had to be healthy, with no condition likely to affect feeding.\nTo qualify for the Y6FU sample, mothers had to have completed the Neonatal (Month 1) questionnaire in the infant study (n = 3033) and not be subsequently disqualified from IFPSII (n = 75). Disqualification criteria included death of the infant or mother, being diagnosed with a condition likely to affect feeding, or living in a geographic area to which the post office stopped delivering mail because of the Gulf Coast hurricanes of 2005. In total, 2958 mothers qualified for the Y6FU."}, {"section_title": "DATA COLLECTION AND STUDY APPROVAL", "text": "The data collection was conducted primarily by mail but also included telephone interviews with those who did not respond by mail. We verified the mailing address for each sample member in the National Change of Address files (records of people who have filed a change of address with the US Postal Service). If needed, we traced the current address through 4 databases (Targus, InfoUSA, Experian, and Acxiom) that compile information from various sources including the US Telecommunications Network, white page listings, public information, and proprietary sources. At each mail contact attempt, sample members with mailings returned as undeliverable were traced using the aforementioned databases to find a current address for the next mailing or to make it possible to find a telephone number for the telephone interview. Telephone interviews were attempted with nonrespondents to the mail contacts.\nA notification letter announcing the study was mailed to eligible IFPSII participants in January 2012; the first survey packet was mailed in March 2012, followed by a postcard reminder. The survey packet was remailed to nonresponders in April 2012. The survey packet consisted of a letter of consent, the questionnaire and demographic form, a tape measure for measuring the child' s height, and instructions on measuring height according to standard protocol.\nWe attempted to conduct a telephone interview with every sample member who did not return a written questionnaire or indicate refusal and for whom a telephone number could be found (n = 1110). The telephone interview included all information asked on the written questionnaire, and questions were asked as similarly as possible to the written questionnaire.\nData collection for both methods was closed at the end of June 2012. Respondents were given an incentive equivalent to $10, either as points that could be used to purchase a variety of products or by check, for completing the SUPPLEMENT ARTICLE questionnaire either by mail or by telephone.\nThe study was approved by the Research Involving Human Subjects Committee of the Food and Drug Administration. Respondents were sent all elements required for informed consent in the letter accompanying the questionnaire or were read the statements before the telephone interview, but a signed statement of consent was not required."}, {"section_title": "QUESTIONNAIRE DEVELOPMENT", "text": "To the extent possible, the questionnaire was developed using previous national surveys or published scales, so that responses could be compared with other samples. The project staff obtained permission to use the questions if they were not in the public domain. The demographic questions were taken from the panel' s standard demographic form so that Y6FU responses would be comparable with data from the IFPSII. Table 1 indicates the main sections of the questionnaire and the source of questions.\nThe questionnaire was tested by means of cognitive interviews and a pilot study. The cognitive interviews tested only questions that were new or modified. The questionnaire was divided into 2 parts, and each part was tested in 6 cognitive interviews conducted in 3 sets of 2 interviews, with questionnaire modification between the sets. The subsequent complete questionnaire was testedin a pilot study of 133 mothers of 6-year-old children identified through the same mail panel used for the IFPSII (excluding those enrolled in the IFPSII).\nThe initial notification letter for the pilot study was mailed in September 2011, and the first pilot questionnaire was mailed in November 2011. Pilot study responses were analyzed to evaluate distributions over response options, looking particularly for questions with no or very little variation and for range of responses to determine whether some response options might not be needed. They were also examined to evaluate whether skip patterns were followed, whether some questions had high rates of item nonresponse, whether responses were consistent throughout, and whether some open-end responses were out of range. A debriefing questionnaire asked how much time was needed to respond; whether any questions were hard to answer, and if so, why; whether the mother checked records to answersome questions; how certainshe was that she remembered specific information; how she reported about the child' s diet when she was not with the child; and whether she had any trouble remembering information specific to the target child if she had other children. The Y6FU questionnaire was finalized after we considered the findings from the pilot study and debriefing questionnaire.\nIn addition to testing the main study questions, the pilot study tested whether response rates differed if the respondent was offered an incentive of $10 vs $15. Response rates were identical for the 2 groups; therefore, the lower incentive was used in the study. The pilot study tested both the mail survey and telephone interview by calling respondents who did not return a mailed questionnaire. The same questions were asked in both methods, and we kept the interview questions as similar as possible to the written questions."}, {"section_title": "SAMPLE SIZE AND RESPONSE RATES", "text": "The final sample size for the Y6FU was 1542 ( Table 2) . We calculated response rates based on the recommendations of the American Association for Public Opinion Research. 8 In calculating the response rates, we included both mail survey and telephone interview categories because of the mixed data collection method of the study. The main survey was sent to all IFPSII sample members for whom a mailing address could be found. The response rate was 52.1%. We also calculated other relevant measures of response, which required differentiating between sample members who were contacted but refused and those who were not contacted. However, for 374 mothers we could not distinguish between those who did not receive a questionnaire (ie, were actually not contacted) and those who received it but never responded (ie, refused). Their contact status was unknown, and we classified them as \"not contacted\" when calculating various rates. The cooperation rate was 95.0%, the refusal rate was 2.8%, and the contact rate was 54.9%. Because the sampling frame was not designed to collect representative data, sample weights were not calculated for these data."}, {"section_title": "DATA LINKING AND DATA PREPARATION", "text": "The completed Y6FU questionnaires were matched to the infant data from IFPSII by the participation number that appears in both the IFPSII data and the Y6FU data. We verified cases as matches by comparing the infant' s birthday with the birthday given for the 6-year-old child. If the birthdays did not match or the child' s birthday was left blank, we evaluated the child feeding characteristics and mother' s characteristics for consistency with the infant data. Because we recognized that some of the information could have been entered incorrectly, we did not require a match on all characteristics. We compared these variables: breastfeeding duration, infant participation in the Special Supplemental Nutrition Program for Women, Infants, and Children, whether the mother had gestational diabetes during her pregnancy with the 6-year-old, mother' s height, mother' s age, and educational attainment. We compared 71 cases that did not match on child' s birthday and rejected 15 of them because they did not match on the other characteristics.\nWe cleaned the Y6FU data by following a method similar to the cleaning of the IFPSII data. We consolidated variables that could have information entered into .1 field (eg, food intake could be entered as servings per day, per week, or per month). We set to missing or flagged biologically improbable or impossible values and conflicting or inconsistent responses. For example, if a mother said she returned to work when her 6-year-old child was 7 years old, the value was impossible; if the child usually slept .20 hours per night, the value was improbable. If a mother marked that the home had no pet and also marked $1 specific pets, the response was recorded as inconsistent."}, {"section_title": "SAMPLE NONRESPONSE BIAS AND CHARACTERISTICS", "text": "Because the Y6FU sample is a subset of the IFPSII sample and is not nationally representative, we conducted 2 analyses to describe the potential sample bias. To describe how those who responded differed from those who did not, the first analysis compares respondents and nonrespondents to Y6FU. For this comparison, we used only information from the IFPSII for both groups because Y6FU data were not available for nonrespondents and demographic information (eg, maternal education and family income) could not be assumed to remain the same 6 years later. We compared demographic characteristics and also selected feeding and health characteristics. Income is shown as the percentage of the federal poverty level 9 in 2005 because most of the infants were born in that year.\nThe second analysis compares Y6FU respondents with data on 6-year-old participants of the nationally representative NSCH, 2011-2012, 2 using all questions that are identical or nearly so in both studies. The purpose of this analysis was to characterize the direction and extent of differences between the Y6FU sample and a nationally representative database of all 6-year-old children. Demographic characteristics of the Y6FU sample differed slightly from those in IFPSII because responses on geographic region, income, education, marital status, and other variables could have changed between the year of birth and year 6. Income is shown as percentage of the federal poverty level in 2012 for the Y6FU data. 9 We used x 2 to test the significance of differences between respondents and nonrespondents to the Y6FU. For comparisons between Y6FU and NSCH, because of the complex sample design of the NSCH data, we did not have the ability to combine it with the data from Y6FU to conduct x 2 tests on the overall distributions. Therefore, we used Z tests for the differences of each variable category between the Y6FU and NSCH samples, and we applied sample weights and estimated the standard errors of the NSCH sample by using SUDAAN (RTI International, Research Triangle Park, NC) to account for its complex sampling design. We considered differences with probability of #.05 to be significantly different."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Respondent and Nonrespondent Comparison", "text": "Mothers who responded to Y6FU were more likely than nonrespondents to be older, married, and white; to have higher education and higher income; to not smoke; and to have received prenatal care before 13 weeks (Table 3 ). In addition, respondents were more likely to be from the Northeast and less likely to be from the South. Respondents were much more likely to have returned $8 of the 10 postnatal questionnaires than nonrespondents. Respondents and nonrespondents did not differ by prenatal employment status, parity, having returned to work when the infant was #6 weeks old, or prepregnancy BMI.\nChildren of respondents were more likely than children of nonrespondents to have breastfed longer and not participated in the Special Supplemental Nutrition Program for Women, Infants, and Children. Children of respondents and of nonrespondents did not differ by infant gender, breastfeeding initiation, reporting a food allergy or intolerance during infancy, birth weight, or gestational age."}, {"section_title": "Y6FU-NSCH Comparison", "text": "The comparison with the nationally representative NSCH sample shows that the Y6FU sample mothers were older, more likely to be married, had higher education, and were more likely to be white and less likely to be Hispanic (Table 4) . Y6FU respondents were less likely to have a low household income and more likely to be from the Midwest or Northeast regions. The children in the 2 samples had a similar gender distribution and were similarly likely to have health care coverage, but the Y6FU children were more likely to have seen a dentist in the preceding year.\nThe Y6FUchildren were less likely to have received food assistance in the past year. They were more likely to be homeschooled and less likely to attend public school than the NSCH children, and the Y6FU children were more likely to have an Individualized Education Program at school. The Y6FU children were more likely to have no screen time on weekdays, but they were similar to the NSCH children in the percentage who watched TV, videos, or played video games for more than an hour on weekdays. Y6FU children were less likely to currently have attention deficit disorder or "}, {"section_title": "DISCUSSION", "text": "Linkage of the cross-sectional Y6FU data to data collected in the longitudinal IFPSII provides a unique ability to examine associations between detailed early feeding and health information and health, development, weight and height, and dietary patterns at 6 years old. The large number of potential confounders in the database enables researchers who are conducting multivariate analyses to control for many factors that might affect the associations of interest. The large sample size can support various types of multivariate analyses. The use of questions that have previously been used in national and international surveys enables researchers to compare the Y6FU results with those from other studies.\nThe main limitation of the study is that the sample was not nationally representative of the US population. The original IFPSII data were biased toward mothers who were older, more highly educated, of higher income, white, and less likely to smoke than mothers from the nationally representative National Survey of Family Growth. 1 The sample' s loss to follow-up exacerbated these differences, as shown by the significant difference between Y6FU respondents and nonrespondents on age, education, income, race, and smoking status. The comparison of Y6FU respondents with 6-year-old children from the nationally representative NSCH confirmed the demographic and regional bias of the Y6FU sample. That comparison also indicated a similarity in some measures of health care access; however, most health outcomes indicated that the Y6FU sample was healthier than the NSCH sample. An additional limitation is that all data were reported by the child' s mother. No medical records were examined to verify weight, height, health status, or other medical characteristics.\nA number of studies that have a longitudinal component and that collected information about infant feeding and subsequent health outcomes have been published in English in the past 15 years. [10] [11] [12] [13] [14] [15] [16] [17] [18] [19] [20] [21] However, none of these studies included detailed measures of early feeding patterns, including breastfeeding intensity (the amount of breast milk relative to all milk), use of expressed milk, patterns of introduction of food groups, and diet quality in late infancy. In addition, nearly all these studies were conducted in a country other than the United States. Given different cultures, customary diets, exposures to contaminants, and other differences that occur between countries, it is possible that results in the United States would be different from those in other countries even when the same outcome is measured. Of the 2 studies conducted in the United States, one 19 was in a specific state and concerned only diet, having no health outcomes. The second, the Early Childhood Longitudinal Study: Birth Cohort (ECLS-B) 12 included only basic information about infant feeding collected retrospectively at 9 months and 2 years of age. The ECLS-B asked about duration of any and exclusive breastfeeding and the time of introduction of select foods including formula, solid food, and cow' s milk, but not fruits and vegetables or other food groups that would enable a measure of diet quality in infancy. In contrast to the other study conducted in the United States, the ECLS-B has the advantage of measuring some health outcomes at later ages, including at the year of kindergarten, which is similar to the age of the Y6FU sample. 12 "}, {"section_title": "CONCLUSIONS", "text": "The Y6FU database, when linked to the IFPSII database, is a valuable resource for examining associations between infant diet, care, and health status and a large number of health, diet, and development outcomes at childhood age 6 years. Its strengths include a large sample, availability of information on a large number of potential confounders, and detailed information on feeding collected nearly monthly during the infant period. The main limitation is that the sample is not representative of the US population and overrepresents children from economically and a Information listed is from the Y6FU study and therefore is from the period when the children were 6 y old. For example, mother' s age is her age when she answered the Y6FU questionnaire and is about 6 y older than mother' s age in the IFPSII. Other characteristics may also have changed between the periods of infancy and young childhood. b The NSCH sample was limited to 6-y-old children. Percentages shown were weighted as recommended in the study documentation. c We were unable to combine the 2 data sets because of the complex sample design of the NSCH. Therefore, we could not use x 2 statistics when comparing these 2 samples. Instead, we used Z tests for the difference of proportions between each category of the variables and used sample weights and SUDAAN to estimate the standard errors for the NSCH data. d In Y6FU, race and ethnicity were asked about the mother, whereas in NSCH, race and ethnicity were asked about the child.\neducationally advantaged families. The IFPSII data have proved to be a valuable resource for many researchers, and the Y6FU data should prove to be similarly valuable, especially when they are linked to IFPSII."}]