[{"section_title": "Introduction", "text": "Coronaviruses (CoVs) is accountable for mixture of ailments in human and animals that include respiratory, enteric, renal, and neurological diseases [1] . These are categorized into four genera, for instance alpha-CoV, beta-CoV, gamma-CoV, and delta-CoV2. Seven coronaviruses (CoVs) of beta-CoVs have been isolated from human beings till date [2] . There have already been three zoonotic outbreaks in this century. Severe acute respiratory syndrome coronavirus (SARS-CoV) with about 10% case fatality rate (CFR) was initially witnessed from China in 2002, while Middle East respiratory syndrome coronavirus (MERS-CoV) infection with about 34.4% CFR was originally detailed from Saudi Arabia in June 2012 [2] . This third outbreak coronavirus disease is indisputably the most frightening compared to the previous epidemics, which has spread from a marketplace in Wuhan, China in December 2019 to more than 213 countries and territories, infecting more than 1.5 crore people with death toll more than 6 lakhs of the world within nine months. With nearly 4% CFR, we have never thought anything like this highly contagious and pathogenic COVID-19, caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) since the Spanish flu [3] .\nHowever, pathogenesis of SARS-CoV-2 is yet to decode and as result there is no appropriate management for COVID-19 patients. This article focuses on understanding the structure of the virus, pathogenesis for disease progression, diagnosis of the disease with pros and cons of different treatment strategies.\nStructure SARS-CoV-2 is positive-sense, single-stranded RNA connected to a nucleoprotein surrounded by a matrix protein based capsid (Fig. 1) [4] . Among the RNA viruses, the human CoV has the biggest viral genome [27-32 kilobase pairs (kb)] with 80-160 nm in diameter [2] . A classic CoV has no less than six open reading frames (ORFs) in its genome. All the structural and accessory proteins of CoVs are translated from it's single guide RNAs (sgRNAs) [4] . Two big overlapping ORFs, ORF 1a and ORF 1b, reside in two-thirds of the genome at the 50-terminus, and a third of the genome at the 30-terminus encodes for four conventional structural proteins in the sequential arrangement of spike (S), envelope (E), membrane (M), and nucleocapsid (N) (Fig. 2a) . The genome of SARS-CoV-2 encodes polyproteins pp1ab, four structural proteins and six accessory proteins (3a, 6, 7a, 7b, 8, and 10), which is comparable to the structure of SARSCoV and MERS-CoV ( Fig. 2b ) [2] . The viral ORFs are produced through purifying selection. The most restricted sequences corresponded to a few non-structural proteins (nsps) and membrane protein [5] (Fig. 2) .\nDifferent proteins of human CoVs play important roles for viral infection and/or pathogenesis (Table 1 ) [2] . Surface glycoprotein of the virus displayed five cytotoxic T lymphocyte (CTL) epitopes, three sequential B cell epitopes and five discontinuous B cell epitopes [6] . B cell mediated humoral immune response causes the clearance of SARS-CoV-2, while T cells play a fundamental role in viral infections [7] . The CTL epitopes attach to the major histocompatibility complex (MHC) Class I peptide-binding grooves with uninterrupted hydrogen bonds and salt bridge anchors, which is accountable for immune responses, leading to the development of subunit vaccines [6] .\nThe S protein can be fragmented into two functional subunits, N-terminal S1 subunit and a C-terminal S2 subunit (Fig. 3) . Every monomer of trimeric S protein is approximately 180 kDa, and is liable for attachment and membrane fusion. In the structure, N-and C-terminal parts of S1 fold acts as two autonomous domains: N-terminal domain (NTD) and C-terminal domain (CTD) (Fig. 3) . Based on the virus, either NTD or CTD can function as the receptor-binding domain (RBD) [1] . In adiition, a polybasic (furin) fragmenting site at the junction of the S1 and S2 subunits in the Spike protein of the SARS-CoV-2 was reported, which is absent in the other SARS-like CoVs [8] . Data suggests that SARS-CoV-2 is intimately shared with SARS-CoV structural proteins having only 12.8% of difference in S protein and has 83.9% similarity in minimal RBD [9] ."}, {"section_title": "Genomic Analysis", "text": "Using all accessible genomic information, the phylogenetic tree investigation has ascertained the high sequence similarity ([ 99%) between all the existing sequenced SARS-CoV-2 genomes, with the closest as Bat coronavirus (BCoV) sequence resembling 96.2% sequence identity [10] , while pangolin-CoV shares 85.98% identity [11] , authenticating the conception of a zoonotic origin of 2019-nCoV [10] . Other studies including full genome sequencing of strains from China, Japan, USA, Finland and Korea showed more than 99.9% sequence homology [12, 13] . Sequence homology of SARS-CoV-2 with SARS-CoV, and MERS-CoV was accounted 77.5% and 50%, respectively [12] . One study on the sequences of SARS-CoV-2 from India illustrated high (* 99.98%) identity with Wuhan seafood market pneumonia virus (accession number: NC 045512) [14] .\nAnalysing the 15 obtainable whole genome sequences of SARS-CoV-2, 12 whole genome sequences of SARS-CoV-2 and 12 extremely related whole genome sequences available in gene bank (five from the SARS-CoV, two from MERS-CoV, and five from bat SARS-like CoV) explained the mutation in spike glycoprotein and nucleocapsid protein [15] . It has been suggested that C-to-U conversion mediated by C deamination played a significant role in the evolution of the SARS-CoV-2 [16] . These outcomes implied that SARS-CoV-2 could have been evolving for a relatively long period in humans following the transfer from animals before spreading worldwide.\nOne study identified 12 novel recurrent mutations in South American and African viral genomes, among which 3 were exclusively in South America, 4 in Africa and 5 were present in-patient isolates from both populations [11] .\nPhylogenetic and alignment study of 591 novel coronaviruses of different clades from Group I to Group V identified several mutations and related amino acid changes. Detailed analysis on nucleotide substitution revealed 43 synonymous and 57 non-synonymous type substitutions in the coding region [17] . The nonsynonymous substitutions resulting into 57 amino acid changes were reported to be distributed over different human CoV proteins with maximum on spike protein [17] .\nOut of 3617 available complete genome sequences of SARS-CoV2 from across the world maintained in the National Center for Biotechnology Information (NCBI) database, the E protein possesses several non-synonymous mutations [18] . In another study, analysis of 10 SARS-CoV2 sequences by genome alignment from the NCBI database, did not report difference in amino acid sequences within M and N proteins, while two amino acid variances in the S protein region were reported. Two possible ''L'' and ''S'' SNPs were found in ORF1ab and ORF8 regions [19] . A third study, utilising genomes of twenty-nine 2019-nCoV and thirty b-coronavirus, it was found that E genes were extremely conserved (99.56%), while S genes had lowest identity (92.87%), suggesting that S gene was of a rapid evolutionary rate [13] . Analysis of the spike protein sequences from all five identified isolates from the state of West Bengal (Eastern India), two mutations were reported at position 723 and 1124 in the S2 domain. This mutation decreases the flexibility of S2 domain. Another mutation at the downstream of the receptor binding domain (RBD) at position 614 in S1 domain was found similar with the sequence reported from Gujarat (a state of western India). These mutations may be responsible for the affinity or avidity of receptor binding [20] .\nIn another study, analysis of thirty-two genomes of Indian COVID 19 patients revealed that ORF3a gene possesses single and double point mutations. The phylogenetic analysis revealed that the parental origin of the ORF3a gene over the genomes of SARS-CoV2 and Pangolin-CoV is same [21] .\nAll these investigations reliably suggested that 2019-nCoV is most narrowly related to BatCoV RaTG13 and belongs to subgenus Sarbecovirus of Betacoronavirus, together with SARS CoV and Bat-SARS-like Cov [22] . Evolutionary scrutiny using ORF1a/1b, S and N genes also implied that 2019-nCoV is probably a novel CoV, which is independently introduced to humans from animals [23] ."}, {"section_title": "Symptoms", "text": "The incubation phase of COVID-19 is 3-7 days globally. Approximately 80% of infectious cases remain mild or asymptomatic, 15% are severe and 5% infectious cases turn to critical, who require ventilation [24] . Three major courses of infection include mild disease with upper respiratory symptoms, non-severe pneumonia, and severe pneumonia complicated by acute respiratory distress syndrome (ARDS) and multi organ failure [25] .\nFever and cough are the foremost common symptoms, whereas dyspnea, fatigue, shortness of breath and chest distcomfort are observed in moderate to severe cases [26] . Olfactory and taste disorders also are reported in COVID-19 patients, who may not have nasal indications [27] .\nPatients may further suffer from extra-pulmonary manifestations, including those influencing the liver and GI tract, with indications like diarrhoea, vomiting and abdominal pain [28] ."}, {"section_title": "Transmission", "text": "Infection by droplets contaminating hands and surfaces are the foremost means of dispersal of the virus [29] . GI tract is also a plausible spreading pathway and target organ of SARS-CoV-2 [30] . One study demonstrated the presence of SARS-CoV-2 RNA in feces of COVID-19 patients, and suggested the chance of SARS-CoV-2 transmission through the fecal-oral route [28] . SARS-CoV-2 may also be noticed within the tears and conjunctival secretions in another study [31] . Airborne diffusion of SARS-CoV-2 may also take place if patient respiratory activity or medical processes generate respiratory aerosols [32] .\nPathogenesis SARS-CoV-2 primarily targets the lungs, the vasculatures, and the immune system [33] . The initial step of the viral multiplication is the binding to the surface of respiratory cells mediated by the spike (S) viral protein [34] . It had been speculated that SARS-CoV-2 likely utilize angiotensin-converting enzyme 2 (ACE2, EC 3.4.17.23) of various mammals, except murines and a few birds, such as pigeon [35] . The affinity of SARS-CoV-2 for ACE2 is 10-20-higher than that of SARS-CoV [36] .\nACE2 is a metalloproteinase and shares about 60% homology with the carboxypeptidase angiotensin-converting enzyme (ACE, EC 3.4.15.1). ACE2, which is made up of 805 amino acids, is type I transmembrane glycoprotein having a single extracellular catalytic domain [37] . Its expression is reported in the lungs, cardiovascular system, gut, kidneys, CNS and adipose tissue [38] . It is the key active peptide of the renin-angiotensin system (RAS) or renin-angiotensin-aldosterone system (RAAS) [38] .\nAngiotensin II (Ang II) is the major effector of the RAAS that advances hypertension partly by decreasing baroreceptor sensitivity to maintain heart rate, and increasing vasoconstriction, sodium retention, oxidative stress, inflammation and fibrosis. Evidence from various studies favors a crucial function of ACE2 to efficiently degrade Ang II to Ang-(1-7), which antagonizes the effects of Ang II (Fig. 4) [38] . Ang-(1-7) acts on the Mas receptor that modestly reduces blood pressure through vasodilation, promoting excretion of sodium and water by the kidney, and also attenuate inflammation through the nitric oxide production (Fig. 4) [36] . On the contrary, ACE converts Ang I into Ang II, which acts at the type 1 angiotensin receptor (AT1R) and increase blood pressure by inducing vasoconstriction, increasing kidney reabsorption of sodium and water by the kidney, and generating oxidative stress to promote inflammation and fibrosis (Fig. 4) [36] .\nThe S1 domain of the SARS-CoV attaches to its cellular receptor ACE2 on the host cells [39] . Binding of the SARS-CoV-2 spike protein to ACE2, followed by a conformational change in the S-glycoprotein permitting proteolysis of ACE2 by transmembrane serine protease 2 (TMPRSS2) to generate the S1 and S2 subunits is a critical step for S2-induced membrane fusion and virus internalization by endocytosis in the pulmonary epithelium. The entry of the virus into cells further facilitates virus multiplication and cell-to-cell transmission [39] , and is thought to suppress expression of ACE2. This suppression of ACE2 causes decrease in tissue level and reduces Ang-(1-7) formation, and correspondingly increase in Ang II levels. ACE further converts Ang-(1-7) to less biologically active peptides. This process can drive an Ang II-AT1Rmediated inflammatory response in the lungs and prospectively stimulate parenchymal injury [36] .\nThe pathogenesis involves two interconnected processes: lung inflammation and immune deficiency, both of which are related to an improper immunologic response and over-production of proinflammatory cytokines [33] , Additionally, altered redox balance in infected cells through alteration of NAD ? biosynthesis, poly (ADP-ribose) polymerase (PARP) function along with changeing proteasome and mitochondrial function further exacerbate inflammation and lipid peroxidation resulting in cell damage [40] . Furthermore, SARS-CoV-2 induced activation of apoptosis and p53 signaling pathway in lymphocytes causes lymphopenia in such patients [41] .\nSARS-CoV-2 demonstrates neurotropic behaviour and may also cause neurological diseases. It is reported that CoV are often found in the brain or cerebrospinal fluid [42] . Another feature of severe COVID-19 is coagulopathy, which is determined by elevated plasmin(ogen) in such patients. Plasmin and other proteases, may cleave furin site in the S protein of SARS-CoV-2 extracellularly, which increases its infectivity and virulence, and is related to hyperfibrinolysis [43] . Fig. 4 Functional scheme of the renin-angiotensin system. The protease renin converts the precursor angiotensinogen to Angiotensin I (Ang I) and subsequently converted to Ang II by dipeptidyl carboxypeptidase angiotensin converting enzyme (ACE). Ang II binds to the AT1 receptor (AT1R) to stimulate inflammation, fibrosis, oxidative stress and an increase in blood pressure. Ang II are converted to Ang-(1-7) via endopeptidases (NEP) and the monocarboxypeptidase ACE2, respectively. Ang-(1-7) binds to the Mas-R to exert antiinflammatory and anti-fibrotic actions, stimulate the release of nitric oxide and reduce blood pressure. SARS-CoV-2 binds to ACE2 to stimulate internalization of both the virus and peptidase causing deleterious effects. Angiotensinconverting enzyme inhibitors (ACEIs)/Angiotensin receptor blockers (ARBs) regulate the metabolic pathway Factors Associated with Pathogenesis-age, Gender and Co-morbidities Studies have shown that SARS-CoV-2 causes worse outcomes and a higher mortality rate in older people (more than 60 years of age) and those with comorbidities such as hypertension, cardiovascular disease, diabetes mellitus, chronic respiratory disease, and chronic kidney disease [43, 44] . The COVID-19 virus appears to cause mild infections in children. Though the reasons for this tolerance is unknown, some researchers suggested that non-susceptibility of children to coronavirus may be due to separate ACE activity [45] , and active innate immune response caused by trained immunity (secondary to live-vaccines and frequent viral infections). Adult patients are believed to have suppressed adaptive immunity and dysfunctional innate immune response [46] .\nIt is believed that women, compared to men, are less vulnerable to viral diseases due to dissimilar innate immunity, steroid hormones and factors related to sex chromosomes. The immune regulatory genes encoded by X chromosome in female category causes lower viral load, and less inflammation than in man, while CD4? T cells are higher with better immune response. Higher TLR7 in women and its biallelic expression is responsible for better immune responses and enhances the fighting to viral infections in comparison to men [47] .\nMyocardial injury is one of the important pathogenic features of COVID-19, possibly due to direct damage to the cardiomyocytes, systemic inflammation, myocardial interstitial fibrosis, interferon mediated immune response, exaggerated cytokine response by Type 1 and Type 2 helper T cells, in addition to coronary plaque destabilization, and hypoxia [48] .\nCOVID-19 may augment complications in individuals with diabetes through an imbalance in ACE2 activation pathways leading to an inflammatory response and b-cell dysfunction in the pancreas, which may deteriorate COVID-19 complications including vasculopathy, coagulopathy and psychological stress [49] . The chronic low grade inflammation in diabetes and obesity can also lead to an enhanced 'cytokine storm' in COVID-19 patients [50] .\nRespiratory epithelium cells of smokers and patients with COPD express higher ACE2 receptor. Nicotine binds and enhances nicotinic acetylcholine receptors (nAChR), specifically the a7subtype (a7-nAChR) in lungs and various other tissues, particularly in central nervous system. Increased expression of ACE2 receptors is mediated by stimulation of a7-nAChR, and facilitates the SARS-CoV-2 entry of into the respiratory epithelium [51] . ACE2 expression on endothelial cells is associated with virus mediated endothelitis and precipitate vascular dysfunction manifesting as acute respiratory distress syndrome (ARDS) [50] .\nOne meta-analysis comprising 1558 patients with COVID-19 from 6 studies revealed no association between the increased risk of COVID-19 with liver disease, malignancy, or renal diseases [52] ."}, {"section_title": "Diagnosis", "text": "Viral serological test is an efficient investigative means to determine the prevalence for SARS-CoV-2 infection among the population [53] . COVID-19 infection stimulates IgG antibodies against N protein that can be noticed in serum as early as day 4 after the onset of disease, and in most patients seroconversion take place by day 14 [24] . IgG illustrated higher positive rate and titer variance than that of IgM in COVID-19 [53] . Detection of IgM and IgG against SARS-CoV-2 is a fast and easy monitoring method [54] . Combined examination of the IgM-IgG proved better efficacy and sensitivity compared to a single antibody [55] .\nA decreased lymphocyte count and an increased highsensitivity C-reactive protein (hs-CRP) level are the most common laboratory findings [56] . As the infection advances, white blood cell count (WBC), neutrophil count, platelet count, red blood cell distribution width-coefficient of variation (RDW-CV), and RDW-standard deviation (RDW-SD) parameters elevates with severity of the diseases; while, lymphocyte count, eosinophil count, red blood cell count (RBC), hemoglobin, and hematocrit parameters decreases. The combined neutrophil-to-lymphocyte ratio and RDW-SD parameter is the best hematology index [57] .\nThe assenting diagnosis of COVID-19 is dependent on the viral isolation by polymerase chain reaction (PCR) from sputum, or nasal swab, or throat swab for the categories of those with symptoms or potentially exposed [58] . The real-time-reverse transcription (RT)-PCR detection of viral nucleic acid test (NAT) is considered as sensitive, specific and able to process large batches of samples [59] . The RT-PCR results generally become positive after 2-8 days [60] . However, the commonly used RT-PCR method shows false-negative in some cases, such as mutations of the SARS-CoV-2 genome, variable viral load kinetics or laboratory errors [61] . It may lack sensitivity, particularly in the advanced phase of infection, and depends closely on the samples' quality [62] . As turnaround time of RT-PCR is long, molecular point of care tests (POCT) should be considered in situations where quick results are critical [59] .\nThis rapid PCR by cartridge system (CBNAAT: cartridge-based nucleic acid amplification test or GeneXpert polymerase chain reaction test) reduces response times [62] , demonstrated equal performance compared to routine in-house RT-PCRs [59] , but is not suitable for laboratories with high throughput of requests [62] .\nComputed tomography (CT) can be considered as an essential supplemental investigative tool for the detection of COVID-19 pneumonia in this pandemic context. In severe cases, CT plays an important role in identifying viral lung infection, examining the nature and extent of pulmonary lesions, and scrutinizing the disease severity [63] . Known features of COVID-19 on initial CT consist of bilateral multilobar with an usual of three lung segments, ground-glass opacification (GGO) with a peripheral or posterior distribution, principally in the lower lobes and some times inside the right middle lobe. Consolidative opacities superimposed on GGO may be reported in a few elderly population. Other uncommon findings include septal thickening, bronchiectasis, pleural thickening, and subpleural involvement, which are rarely reported in the later stages of the disease [64] . The imaging pattern readily change over a short period of time [65] .\nHowever, CT decontamination is essential after scanning COVID-19 patients, which may disarray radiological service accessibility and advocates that chest radiography may lessen the risk of cross-infection [66] . In COVID-19, chest X-ray (CXR) shows patchy or diffuse reticularnodular opacities and consolidation, with basal, peripheral and bilateral predominance [67] . The consideration of CXR for early detection may contribute an important role in the regions around the world with limited access to RT-PCR COVID testing [66] .\nIncreased cytokine levels (IL-6, IL-10 and TNFa), lymphopenia (in CD4? and CD8? T cells), and decreased IFN-c expression in CD4? T cells are linked with severe COVID-19, illustrating the ''cytokine storm'' [68] .\nSome patients are detectd with definite disseminated intravascular coagulation (DIC) [69] . This DIC is primarily pro-thrombotic with high venous thromboembolism rate, increased D-dimer and fibrinogen levels, reduced antithrombin levels, pulmonary congestion with microvascular thrombosis and occlusion on pathology besides high rates of central line thrombosis and vascular occlusive events (e.g. ischemic limbs, strokes, etc.) [69] .\nThere is no study exclusively in asymptomatic participants. Combination of clinical presentation, imaging features and laboratory findings could help early diagnosis of COVID-19 pneumonia."}, {"section_title": "Preventive Measures", "text": "Infection can spead only in the existence of contact. Nosocomial spread is usually controlled through preliminary infection control measures, including wearing of face masks, respiratory etiquette, hand and environmental hygiene [70] . Personal protective equipment (PPE) is a vital element; but it is just one component of a shielding system from COVID-19 infection [32] . Quarantine or physical segregation is vital to confirm effectiveness, including short-to medium-term lockdowns, voluntary home curfew, curb on the gathering of people, cessation of social and public events and closure of mass transit systems [71] ."}, {"section_title": "Treatment", "text": "As extracorporeal membrane oxygenation (ECMO) is considered as an efficient remedy in the treatment of severe COVID-19 [72] .\nNo valdated medicine is available till date against COVID-19. Some drugs that are indicated for other afflictions are being tested, although without unambiguous evidence. Lipophilic antibiotics tetracyclines (e.g. tetracycline, doxycycline, and minocycline) can chelate zinc (Zn) compounds on matrix metalloproteinases (MMPs). Coronaviruses are believed to depend on host MMPs for survival, cell infiltration, cell to cell adhesion, and replication; many of those have Zn as a part of their MMP complex. It is possible that the Zn-chelating characteristic of tetracyclines may be responsible to inhibit SARS-CoV-2 infection in humans, and controlling their capacity to multiply within the host [73] . Ivermectin, an FDA-approved anti-parasitic drug that was previously shown as broad-spectrum anti-viral activity in vitro, was reported as an inhibitor of the causative virus (SARS-CoV-2) in Vero-hSLAM cells [74] .\nThe spike (S) protein on the viral envelope, is believed as a major intention of vaccine development for the prevention of coronavirus infection. The choices to block viral ingress include the employment of natural neutralizing antibodies from convalescent plasma (discussed elsewhere within the manuscript) and engineered antibodies. Engineered antibodies or neutralizing fragments are often utilised in various formats. The antibody/Fc-receptor complex imitates viral receptor to intervene viral entry. Antibodydependent enhancement (ADE) of viral entrance has been observed for several viruses. In such cases, antibodies mark one serotype of viruses and subneutralize another, causing to ADE of the second virus. A unique mechanism for the ADE is that a neutralizing antibody attaches to the S protein of coronaviruses like a viral receptor, triggers a conformational change of the spike, and mediates viral entry into IgG Fc receptor-conveying cells through canonical viral-receptor-dependent pathways [75] .\nAngiotensin-converting enzyme inhibitors (ACEIs) and/ or angiotensin receptor blockers (ARBs) might possibly alleviate the RAS-induced lung injury, and restrict heart and renal damage. It was reported that ACEIs and/or ARBs increases the ACE2 expression, and also inhibit angiotensin-converting enzyme 1 (ACE1) or stops angiotensin II type 1 receptor (Fig. 4) . Considering that ACE2 expression might be associated with the vulnerability to SARS-CoV-2, intake of ACEIs and/or ARBs might predispose patients to the infection of SARS-CoV-2 [76] . However, due to the functional complexity of the RAAS and the lack of strong information on the activities of ACE2 expression in various tissues following the use of ACE inhibitors or angiotensin receptor blockers, it is difficult to speculate on the relevance of those ACE modulators [76, 77] . Viral S-glycoprotein, TMPRSS2 and ACE-2 inhibition are important objectives of therapy and probably vaccine development [39] . Subunit vaccines are commenced depending on the full-length S protein, receptor-binding domain (RBD), non-RBD S protein fragments, and non-S structural proteins [2] . Using structure-based drug screening to detect SARS-CoV-2 protease blockers, macrolides (MAC) were believed to be effective for COVID-19 [78] .\nE proteins of SARS-CoV2 form ion channels. Result revealed that a-helix and loops present in this protein is associated with the random movement under optimal condition, which successively alter ion channel activity; and thereby developing the disease. Inhibition of those ion channels after binding with three phytochemicals, such as, belachinal, macaflavanone E, and vibsanol B, reduces the random motion of the human ''SARS-CoV-2 E'' protein, inhibit its function and controlling the disease [79] .\nThe main protease (Mpro) of SARS CoV-2 is an important component of this viral replication. Three polyphenols (epigallocatechin gallate, epicatechingallate and gallocatechin-3-gallate) of green tea [80] and compounds from Curcuma longa L. (Zingiberaceae family) [81] interact strongly with one or both catalytic residues (His41 and Cys145) of Mpro, and are considered as potential inhibitors against SARS CoV-2 Mpro. Famotidine, a class A G protein-coupled receptor antagonist used for the treatment of gastroesophageal reflux, is reported to interact within the catalytic site of the three proteases associated with SARS-CoV2 replication [82] .\nThere has been growing interest in the use of antimalaria and anti-amebiasis drugs chloroquine (CQ, N4-(7-Chloro-4-quinolinyl)-N1,N1-diethyl-1,4-pentanediamine) and hydroxychloroquine (HCQ), as potential treatments for COVID-19. Chloroquine inhibits quinone reductase 2, which is involved in the biosynthesis of sialic acids [83] . CQ (or it's active derivative HCQ) inhbits attachment of the viral spike to the gangliosides [34] . Further study suggested that both CQ and HCQ stall the movement of SARS-CoV-2 from endosomes to endolysosomes, which seems to be critical to discharge the viral genome [84] . HCQ probably reduce the progression of COVID-19 severity, by hindering the 'cytokine storm' through controlling the T lymphocyte activation [85] . Azithromycin together with HCQ was reported considerably more efficient for virus elimination [86] . However, there is inadequate proof to establish the safety and effectiveness of CQ/ HCQ to treat COVID-19.\nA few broad-spectrum antiviral drugs were tested against COVID-19 in clinical trials. RNA-dependent RNA polymerase (RdRp) is an essential protease that mediates the replication of RNA from RNA template for coronaviruses and is an important therapeutic target. Some clinical assessments against viral RdRp inhibitors had been conducted. Favipiravir, a purine nucleic acid analogue and effective RdRp inhibitor, which is endorsed against influenza, is additionally being considered in different clinical trials [87] . Remdesivir, an analogue of adenosine with broad-spectrum antiviral agent has shown a high capacity to block infection and viral replication in vitro and in animals with attainable concentrations in human plasma against SARS-CoV and MERS-CoV. It seems that remdesivir may be one amongst the few antiviral drugs with proven efficacy against SARS-CoV2 [88] possibly by delayed RNA chain termination [89] .\nRecently, the mixture of three drugs, lopinavir, oseltamivir and ritonavir has been proposed to mitigate the virulence to a good extent in COVID-19 affected patients. Hence, these drugs are often explored further for drug repurposing against the successful inhibition of COVID-19 [90] . A randomized controlled experiment of lopinavir/ritonavir showed no visible clinical or virologic benefit, and drug-drug interactions and consequences further limit its utility [91] . Oseltamivir demonstrated limited activity against SARS-CoV-2 [91] .\nPrevention of the cytokine storm may be one of the solution to save the patients with severe COVID-19 pneumonia. Limited pre-clinical data suggested that systemic mesenchymal stem cells (MSCs) administration could cure or significantly improved the functional outcomes in seven SARS-CoV2 patients without any adverse effect [92] . Addition of anticytokinic biological agents, like anti-IL-1 (anakinra) [93] or anti-IL-6 (tocilizumab (TCZ)) [94] are also recommended.\nAnti-complement C5 therapy with eculizumab is reported to be a potential key player in treatment of severe cases of COVID-19 [95] . Some studies reported that the use of corticosteroids might speed up improvement from COVID-19 [96] . However, it is also reported that nonsteroidal anti-inflammatory drugs (NSAIDs) and corticosteroids may worsen conditions in SARS-CoV2 patients [97] . Therefore, use of corticosteroids or Janus kinase (JAK) blockers need to be reconsidered in cases with hyperinflammation [98] . One study indicated that Lianhuaqingwen, a conventional Chinese medicine formula significantly inhibited SARS-CoV-2 replication in Vero E6 cells and markedly reduced pro-inflammatory cytokines [99] .\nMemantine, an antagonist of a7-nAChR and NMDA receptors may lessen ACE2 receptors expression and reduce oxidative stress and inflammation [51] . Early treatment with anti-oxidants such as N-acetyl cysteine during COVID-19 can be a way to control the excessive inflammation and cell damage [40] . Various randomized controlled trials, pilot studies, case reports and in vitro and in vivo studies confirmed that Nigella sativa (black cumin seeds) that showed antiviral, antioxidant, anti-inflammatory, immunomodulatory, bronchodilatory, antihistaminic, antitussive activities, could be considered as an adjuvant therapy along with repurposed conventional drugs for management of COVID-19 patients [100] . It further renders the importance of homocysteine-dependent trans-sulfuration pathway in COVID-19 infection. Hence, Vitamin B6, folic acid, and Vitamin B12 should also be included in the treatment regimen for SARS CoV-2 infections [101] .\nPassive antibody administration through transfusion of immune (i.e. ''convalescent'') plasma are often recommended as the sole short-term strategy to confer immediate immunity to susceptible ones. This approach has been used as post-exposure prophylaxis and/or treatment of contagious diseases, including other outbreaks of coronaviruses (e.g., SARS-1, MERS etc.) [102] . Though limited data suggested significant improvement [103, 104] , however, there are nuanced challenges, both regulatory and logistical, spanning donor eligibility, donor recruitment, collections and transfusion. Data from rigorously controlled clinical trials of convalescent plasma also are few [102] .\nThere is proof that fibrinolytic therapy in acute lung injury and ARDS progresss to survival [69] . Anticoagulant therapy chiefly with low molecular weight heparin seems to improve prognosis in severe COVID-19 patients suffering from hypercoagulation status or with increased D-dimer [105] ."}, {"section_title": "Challenges", "text": "Considering the characteristic high mutation rates of RNA viruses, more mutations may emerge within the viral genome [106] . Fortunately, coronaviruses likely have lower mutation rates in comparison to the other RNA viruses because of an intrinsic capacity for a few proofreading activity due to 30-to-50 exoribonuclease. Lower mutation rates are partly balanced by high virus replication rate within hosts [107] ."}, {"section_title": "Conclusion", "text": "Given the high infection rate of this virus between humans and its pandemics, it is essential to understand the structure and basis of its pathogenicity for the advancement to the special treatment or the prevention. Due to the greater resemblance of the virus to its families, attempts have been made to expolore the medicines and vaccines for COVID-19. Identification of the specific molecular details of the virus is helpful in achieving treatment goals. It is also important to monitor any changes in phenotype as the virus spreads."}]