[{"section_title": "Abstract", "text": "Background: Although altered lipid metabolism has been extensively implicated in the pathogenesis of Alzheimer disease (AD) through cell biological, epidemiological, and genetic studies, the molecular mechanisms linking cholesterol and AD pathology are still not well understood and contradictory results have been reported. We have used a Mendelian randomization approach to dissect the causal nature of the association between circulating lipid levels and late onset AD (LOAD) and test the hypothesis that genetically raised lipid levels increase the risk of LOAD."}, {"section_title": "Introduction", "text": "Altered lipid metabolism has been extensively implicated in late onset Alzheimer disease (LOAD) pathogenesis but the molecular basis of this relationship is not well understood. Cell biological studies support a critical involvement of lipid raft cholesterol in the modulation of Ab precursor protein processing by b-secretase and c-secretase resulting in altered Ab production (reviewed in [1] ). In the brain, apolipoprotein E (APOE) acts as the major cholesterol transporter, taken up into neurones via low density lipoprotein receptor (LDLR) family members. APOE is lipidated by the cholesterol transporter ABCA1 in astrocytes and its correct lipidation is necessary for binding and clearance of Ab from the brain [2] . Additionally, APOE is a crucial regulator of triglyceride metabolism throughout the body [3] .\nIn addition to the APOE gene, many of the LOAD susceptibility loci identified through genome wide association (GWA) studies and meta-analyses are also involved in lipid metabolism [4] [5] [6] . For example, CLU, or APOJ, is the second main lipoprotein in the brain after APOE; PICALM and BIN1 are implicated in receptor mediated endocytosis; and ABCA7 is involved in the efflux of lipids from cells to lipoproteins.\nEpidemiological studies have shown associations between high cholesterol levels in midlife and LOAD risk [7] [8] [9] , and statins have been shown to have a protective effect against the development of dementia [10] [11] [12] . However contradictory results have also been reported, with other epidemiological studies reporting no association of lipid levels on LOAD risk [13, 14] or a decline in cholesterol levels before the onset of dementia [12, 15] and randomized control trials overall finding no benefit of statin treatment [16] [17] [18] [19] .\nThe aim of this study was to examine whether genetic predisposition to increased blood cholesterol and triglyceride levels (i.e., dyslipidemia) plays an aetiological role in LOAD.\nConsequently genetic risk variants, which affect lipid metabolism, would influence risk of LOAD through changes in lipid levels. This is the first genetic study, to our knowledge, to investigate the causal nature of the relationship between lipid dysregulation and LOAD using such an approach, the results of which have the potential for public health interventions."}, {"section_title": "Methods", "text": "Ethical approval was obtained for all cohorts in the corresponding centres.\nWe have employed a Mendelian randomization approach (Figure 1 ), which uses the principle that the random meiotic assortment of genotypes is independent of confounding nongenetic factors or disease processes.\nSince the effects of individual loci identified through GWA studies and meta-analyses are small, we examined whether genotype risk scores (GRSs), based on the joint additive effect of 157 well-established independent loci involved in lipid metabolism (p,5610\nThe first group was the Medical Research Council (MRC)-Wellcome Trust Case Control Consortium (WTCCC2) group including 3,292 individuals with LOAD (cases), 1,223 older individuals without LOAD (controls), and 5,074 individuals from the general population (population controls), consisting of four cohorts: 3,216 cases and 1,165 controls from the GERAD1 cohort (Genetic and Environmental Risk for Alzheimer's disease) consortium [4] genotyped on the Illumina 610-quad chip; 18 LOAD cases and ten controls from the MRC Brain cohort, genotyped on the Illumina 666W-Quad chip; and 5,074 population controls from the WTCCC2 publically available control cohorts (www.wtccc.org.uk/ ccc2/: the 1958 British Birth Cohort [WTCCC2 1958 BC] and UK Blood Service Collection [WTCCC2 National Blood Donors (NBS)]), genotyped on the Illumina 1.2M chip.\nThe second group was the Institute of Psychiatry Plus (IOP+) group including 450 individuals who were cases, and 365 individuals who were controls, from the AddNeuroMed (ANM) cohort (362 cases, 237 controls) [21] , and individuals from the Dementia Case Register (88 cases and 128 controls). These groups were genotyped on the Illumina 610-Quad chip in two different batches and merged together (batch 1: 222 cases, 111 controls; batch 2: 228 cases and 254 controls). Additionally, batch 1 contained 99 and batch 2 contained 78 individuals with mild cognitive impairment (MCI).\nThe third group consisted of 330 individuals who were cases and 187 who were controls obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu), genotyped on the Illumina 610-Quad chip.\nFurther details on all groups and cohorts are found in Text S1. All individuals contributing data for this study were white. All individuals with LOAD (cases) met criteria for either probable (NINCDS-ADRDA, DSM-IV) or definite (CERAD) AD [22] . All non-population individuals who were controls were screened for dementia using the MMSE or ADAS-cog, or were determined to be free from dementia at neuropathological examination or had a Braak score #2.5. All individuals with LOAD (cases) had an age of onset $60 years and controls were $60 years at examination. The 58BC individuals (population controls) were around 54 years at the age of collection and no age was available for the NBS cohort. Because genotype data were used from multiple sources, stringent quality control (QC) filters were applied since differential genotyping error rates between groups could result in spurious associations when the data are combined [23, 24] . These filters were applied separately to each of these groups to remove poorly performing samples followed by SNP QC on each group. Prior to individual and SNP QC the MRC brain cohort was merged with the GERAD1 cohort after removing symmetric SNPs and flipping SNPs with opposite strands (from now on referred to as the MRC cohort)."}, {"section_title": "GWA Quality Control", "text": "Individual QC filters in the MRC, WTCCC2 58C, WTCCC2 NBS, IOP+, and ADNI datasets were applied using tools implemented in PLINK [25] . QC for the IOP+ group took place separately for the two different batches.\nBriefly, we excluded individuals with (a) gender mismatches (M.0.8, male; F,0.2, female rule in PLINK; (b) an individual call rate #98%; (c) individuals with autosomal heterozygosity outside 64 standard deviation (SD) of the mean heterozygosity; and (d) duplicates and cryptically related by calculating identity by descent (IBD) estimates for all possible pairs of individuals in PLINK and removing one of each pair with an IBD estimate $0.1875 (the level expected for second cousins). Each of the five datasets were then merged with genotypes from 210 unrelated European (CEU), Asian (CHB and JPT), and Yoruban (YRI) samples from the HapMap project (www.hapmap.org). Following removal of SNPs in extensive regions of linkage disequilibrium and pruning of SNPs if any pair within a 50-SNP window had r 2 .0.2, principal components analysis (PCA) as implemented in SMARTPCA [26] was used to infer continuous axes of genetic variation. Eigenvectors were calculated on the basis of the linkage disequilibrium (LD)-pruned subsets of each of the merged datasets to identify and then remove individuals of divergent ancestry displayed by plotting the first two principal components and using K-means clustering. EIGENSOFTplus [27] was then applied to each of the datasets to additionally correct for population substructure, and genetic outliers defined as individuals whose ancestry is at least 6 SDs from the mean on one of the top ten axes of variation were removed. Four principal components explained most of the variation in the IOP+ and ADNI datasets and were extracted in order to be used as covariates in further analyses. Since the MRC and WTCCC2 datasets were merged at a later stage, extraction eigenvectors took place after sample merging."}, {"section_title": "SNP Quality Control", "text": "Because of unresolved genotype-calling issues with a proportion of SNPs on the sex chromosomes in the 610 cohort, only autosomal SNPs were included in SNP QC for all cohorts. Briefly SNP QC took place (a) including SNPs with MAF.1%; (b) including SNPs with missingness ,3% if MAF$0.05 and SNPs with missingness ,1% if MAF,0.05, and (c) excluding SNPs with HWE p#1610 24 in controls."}, {"section_title": "Imputation", "text": "Since some of the SNPs to be used in this study were not included on the Illumina platform or failed QC, imputation took place using IMPUTE_2.2.2 [28] and the 1000G phase1 integrated reference panel (April 2012, National Center for Biotechnology Information [NCBI] build 37) (Text S1). Final QC Steps\nThe MRC dataset was then merged together with the WTCCC2 58C and WTCCC2 NBS datasets and the two IOP+ batches were also merged together. Symmetric SNPs were excluded and PLINK was used to identify incorrect strand assignment by utilizing LD patterns and exclude SNPs where the strand may have been incorrectly assigned between the three datasets. The merged datasets underwent an additional round of individual QC as described above and EIGENSOFTplus was applied to correct for population substructure as described. Four principal components explained most of the variation in the data and were extracted to be used as covariates in further analyses. Final QC resulted in 3,234 individuals with LOAD (cases), 1,175 individuals who were controls, and 4,989 individuals who were population controls from the MRC-WTCCC2 group (n = 9,398); 350 individuals with LOAD (cases) and 313 individuals who were controls from IOP+ group (n = 663); and 330 individuals with LOAD (cases) and 187 individuals who were controls from the ADNI group (n = 517), a total of 10,578 individuals included in all analyses."}, {"section_title": "Outcomes", "text": "The main outcome of the study was LOAD status (dichotomous) in the 10,578 individuals included in analyses with available imputed data.\nA total of 227 individuals with LOAD (cases) and 196 individuals who were controls of the ANM cohort of the IOP+ group had HDL-c, LDL-c, TC, and TG serum levels (mmol/l) available. Additionally, lipid serum data were also available for 127 individuals with MCI from the ANM cohort who had undergone GWA/imputation together with LOAD cases and controls of the ANM cohort."}, {"section_title": "Genotype Risk Score Construction", "text": "Genotype scores were calculated for each of the four lipid phenotypes (TC, LDL-c, HDL-c, and TG) using the SNPs at 157 independent loci associated with plasma lipids at (p,5610"}, {"section_title": "28", "text": ") as reported by Willer and colleagues [20] . To avoid any spurious associations the rs4420638 SNP within the APOE locus was excluded from further analyses and we used SNAP [29] to investigate linkage disequilibrium patterns between the blood lipid SNPs and SNPs associated with LOAD in the latest LOAD metaanalysis finding no significant linkage disequilibrium (r 2 ,0.2). We also excluded SNP rs581080 in the TTC39B locus, SNP rs9411489 in the ABO locus, and SNP rs3177928 in the human leukocyte antigen (HLA) locus because they failed genotyping/imputation QC and we could not find any successfully genotyped/imputed SNPs with r 2 .0.8 to use as proxies. We initially constructed a GRS that included all SNPs associated with each target lipid trait at a prespecified p-value threshold of p,5610 28 (full score); we therefore used 69 HDL-c SNPs, 55 LDL-c SNPs, 40 TG SNPs, and 70 TC SNPs for the construction of the respective full score. Since one of the prerequisites for a Mendelian randomization study is that there must not be pleiotropic effects of the genetic variants of interest and since there is a considerable overlap of SNPs associated with each trait ( Figure S1 ), a second score was constructed using SNPs exclusively associated with the target lipid trait at a p-value threshold of p,5610 28 (trait specific score); we therefore used 45 HDL-c SNPs, nine LDL-c SNPs, 18 TG SNPs, and 18 TC SNPs for the construction of the respective trait specific score.\nFull and trait specific risk scores (GRSs) were constructed in PLINK using the -score option [25] and assuming that each SNP in the panel acts independently and contributes to the risk of LOAD in an additive manner.\nThe weighted risk scores were constructed by multiplying each SNP by its relative effect size (b-coefficient) obtained from Willer and colleagues [20] and selecting as the ''risk'' allele that was associated with increased LDL-c, TG, and TC levels and decreased HDL-c levels.\nWe summed the products of each score and divided them by the number of non-missing SNPs genotyped/imputed for each individual, creating a score per non missing SNP. The GRSs were further standardized and results are expressed per 1 SD of each GRS.\nIndividuals missing $5% of the SNPs for each GRS were excluded. Table S1 presents the details of the SNPs used for the construction of the GRSs."}, {"section_title": "Statistical Analyses", "text": "All analyses were performed in STATA 12 (Stata Statistical Software: Release 12, StataCorp LP). Power calculations were performed using QUANTO (http://hydra.usc.edu) to estimate the power of this study."}, {"section_title": "Association of Serum Lipid Levels with Each Lipid Genotype Risk Score and LOAD Status", "text": "Serum lipid levels (mmol/l) available for the ANM subset were converted to mg/dl by multiplying HDL-c, LDL-c, and TC by 38.67 and TG by 88.57. Each lipid was regressed against age, agesquared, and gender, and the residuals were inverse normal transformed.\nLinear regression analyses were performed using the inverse normal lipid traits values as the dependent variable and the respective GRS as the independent variable (first stage equations) using the 227 LOAD cases and 196 elderly controls from the ANM study. To increase power we also included the 127 individuals with MCI. These first stage equations were later used to weigh the association of each GRS with LOAD status. We also used logistic regression analyses to investigate the association of the inverse normal transformed lipid traits levels with LOAD status in the ANM cohort."}, {"section_title": "Instrumental Variable Analyses", "text": "We used instrumental variable (IV) estimators to quantify the strength of the causal association between lipid traits and LOAD. We used two different procedures for our IV analysis. Instrumental variable analysis using individual level data. For the main analysis of this study we investigated the association of each of the four lipid trait GRSs with LOAD. Logistic regression analyses were used to test for the association of each GRS with LOAD separately in each group adjusting for the first four PCS extracted during QC for each group. It was not possible to include a covariate for each chip for the MRC-WTCCC2 group as only population controls were genotyped on the 1.2 M chip. Similarly, it was not possible to include a covariate for each of the four cohorts of the MRC-WTCCC2 group, as the WTCCC2 groups included only population controls. The IOP+ cohort was adjusted for an additional covariate denoting genotyping batch. The instrumental variable estimate for each lipid trait was obtained by dividing the LOAD-GRS log OR estimate of each group (second stage equation) with the respective beta estimate of the linear regression of each lipid trait against the respective GRS (lipid trait-GRS) from the 550 individuals of the ANM study with serum lipid data available (first stage equation). To take into consideration the uncertainty in both the LOAD-GRS and the lipid trait-GRS associations we used the delta method to estimate the standard errors of the instrumental Table 1 . Characteristics of the participants in the MRC-WTCCC2, the IOP+, and ADNI study groups who passed GWA and imputation QC, broken down by cohort and by disease status. 73 (9) 73 (9) N/A N/A 73 (7) 73 (7) 75 (7) NA Mean age at baseline (SD)\n80 (8) 80 (8) N/A N/A 76 (7) 76 (7) 76 (7) 75 (7) Mean age at death (SD) a 84 (8) 84 ( 63 (6) 77 (7) 60 (0) N/A 74 (7) 73 (7) 76 (6) 76 ( variable ratio estimates [30] . The resulting estimates were pooled together using inverse-variance fixed effects meta-analysis. We acknowledge that our instrumental variable (lipid trait-GRS associations) is calculated using only 550 participants from the ANM study. A recent study [31] has demonstrated that generating exposure data (such as lipid trait-GRS data) for a subset of participants rather than all participants in the study or from participants who are obtained from independent non-overlapping samples drawn from the same population does not substantially decrease power when the instrumental variable is relatively strong. An instrumental variable is considered strong when the first stage equation R 2 <2.5% and, as demonstrated by Pierce and Burgess [31] , full power is achieved for an R 2 $1.5% with exposure data for ,20% of the total sample. Additionally, loss in power is very small when the subsample/independent sample is 5%-10% of the total study sample. In our study groups, exposure data for the lipid trait-GRS association is available for 6% of the sample size of the MRC-WTCCC2 group (independent sample), for 83% of the IOP+ group (sub-sample), and for more participants than those in the ADNI group (independent sample). We have therefore used the instrumental variable estimate when the first stage equation for the four traits was R 2 $1.5%. Instrumental variable analysis using summary data. A second instrumental variable approach was used in order to verify findings of the instrumental variable approach using individual level data and to be used alternatively when the lipid trait-GRS first stage association was R 2 ,1.5%. This approach was based on calculating the instrumental variable estimate using summary data approach, which has been shown to be similarly efficient to individual level data analyses [32] . Logistic regression analyses were used to test for the association of each lipid trait SNP with LOAD separately in each group adjusting for covariates as detailed above. As in the case of the GRS, we selected as the ''risk'' allele that which was associated with increased LDL-c, TG, and TC levels and decreased HDL-c levels. The instrumental variable estimate from summary data for each lipid trait was then obtained by summing the log OR of the individual logistic regression analyses of all SNPs associated with each plasma lipid trait and weighing this with the summary of the estimates of each SNP with the respective trait obtained from Willer and colleagues [20] in an inverse-variance weighted meta-analysis. The delta method was used to approximate the standard error [32] .\nInstrumental variable analysis was conducted using both full and trait specific scores."}, {"section_title": "Additional Analyses", "text": "Additional analyses were performed excluding the population controls from the MRC-WTCCC2 group and adjusting for age at baseline visit, gender, and number of APOE e4 alleles (Text S1)."}, {"section_title": "Results", "text": "The sample characteristics are presented in Table 1 . SNPs details, including their minor allele frequency and association with LOAD in each group, are presented in Table S1 ."}, {"section_title": "Association of Blood Lipid Levels with the GRS and with LOAD in the ANM Cohort", "text": "The four full scores strongly correlated with the corresponding lipid trait phenotype; however, we observed no correlation between the trait specific scores and the corresponding lipid traits (Table 2) in the ANM individuals. We additionally observed no association between measured lipid levels and LOAD (Table 3) for this cohort."}, {"section_title": "Expected Effect Size and Power of the Study", "text": "Using two epidemiological studies that have shown positive associations between cholesterol levels and LOAD and the observed associations between the weighted TC GRS and TC levels in the ANM sample, we estimated the expected effect sizes (Figure 1 ) and the power of our study. According to Whitmer and colleagues [7] midlife high TC levels ($240 mg/dl) were associated with increased LOAD risk, hazard ratio [HR] = 1.42 (95% CI 1.22-1.66), after adjusting for other cardiovascular risk factors and, according to Kivipelto and colleagues [8] , high TC levels ($6.5 mmol/l, i.e., 251.35 mg/dl) were associated with increased LOAD risk, OR = 2.8 (95% CI 1.2-6.7) (Figure 1b) . We dichotomised serum TC levels in the ANM subset according to these two studies and estimated their association with the TC GRS. The OR of high TC levels in our sample using the Whitmer and colleagues [7] cut-off ($ 6.2 mmol/l) was OR = 1.679 (95% CI 1.35-2.10, p = 4.01610"}, {"section_title": "26", "text": ") and the OR of high TC levels using Kivipelto and colleagues [8] cut-off ($6.5 mmol/l) was OR = 1.71 (95% CI 1.34-2.20, p = 1. 92610 25 ) per GRS SD (Figure 1a) for the full GRS. This means that, if the weighted TC GRS is associated with LOAD through its association with TC levels we would expect the association of the GRS with LOAD ( Figure 1c ) to be between OR = 1.19 (95% CI 1.06-1.46) and OR = 1.73 (95% CI 1.06-4.48). Our sample size of .10,000 participants and the GRS approach we employed gave us .99% power to capture these ORs."}, {"section_title": "Association of the Genotype Risk Scores with LOAD Status", "text": "Instrumental variable analysis for the four full GRSs was performed using individual level data since the association of the four full GRSs with the corresponding lipid produced R 2 .0.015 (first stage equation). We found no association between any lipid traits and LOAD status (Figure 2 ; Table S2 ). Instrumental variable results for the four full GRSs using summary data based on the plasma lipid study by Willer and colleagues [20] were identical ( Figure S2 ; Table S2 ).\nSince we found no association between the four trait specific GRSs and the respective serum lipid (Table 2) , instrumental variable analysis for the trait specific scores was performed using summary data only from Willer et al [20] . We observed a weak positive association between HDL-c and LOAD status when using the trait specific score and no associations for the rest of the traits (Figure 2 ; Table S2 ). Results of the logistic regression analyses for each of the four full and trait specific GRSs against LOAD status (second stage equations) are presented in Table 4 .\nExcluding population controls and adjusting for covariates produced similar results for all analyses (Tables 5 and 6 )."}, {"section_title": "Discussion", "text": "The aim of this study was to dissect the causal nature of the association between blood lipid levels and LOAD and to investigate whether genetic predisposition to dyslipidemia plays an aetiological role in LOAD. To achieve this we used a Mendelian randomization approach and we examined the causal role of HDL-c, LDL-c, TG, and TC in LOAD risk by exploring the association of GRS based on the additive joint effect of 157 well established genetic loci [20] that influence plasma HDL-c, LDL-c, TC, and TG levels with LOAD in a sample of .10,000 participants. Full GRSs were constructed including all SNPs associated with the respective trait at p,5610 28 . Instrumental variable analysis took place using individual level data and calculating the instrumental variable estimate by dividing the LOAD-GRS estimate for each lipid trait with the respective lipid trait-GRS estimate for each study and pooling them together using meta-analysis, when the association of the lipid trait-GRS was R 2 .1.5%. Instrumental variable analysis using summary data was used to verify individual level results and when the lipid trait-GRS was R 2 ,1.5%. Since one of the prerequisites for a Mendelian randomization study is that there must not be pleiotropic effects of the genetic variants of interest, we additionally attempted to dissect these associations further and we constructed trait specific GRSs including SNPs associated exclusively with each lipid phenotype.\nWe found no association between any of the full GRSs and LOAD risk. Our results suggest that genetically raised HDL-c, LDL-c, TG, and TC levels are not causally associated with LOAD risk. Results for the trait specific scores were similar. Although we observed a positive association between the HDL-C GRS and LOAD we must acknowledge the large standard error of the association and that the trait specific score is a weaker instrument. The 157 loci account approximately for 12%-14% of the variation of each trait [20] ; however, there are no published results of the trait variance explained by SNPs exclusively associated with each trait. In our study we observed a clear difference between the full GRS (R 2 = 1.8%-4.3%) and the trait specific GRS (R 2 #0.5%) highlighting that although the trait specific score had increased specificity for the target lipid, it is less statistically powerful and consequently less biologically interpretable. Finally, excluding population controls and adjusting for covariates produced similar results."}, {"section_title": "Clinical Relevance", "text": "Altered lipid metabolism has been extensively implicated in AD pathogenesis through cell biological, epidemiological, and genetic studies, but the molecular mechanisms linking cholesterol and risk for AD are still not well understood. This relationship between AD and altered lipid metabolism is of considerable interest for both basic scientists and clinicians. This is the first study, to our knowledge, to model the joint additive effect of lipid associated loci on LOAD risk using a Mendelian randomization approach. Therefore this article contributes considerably to research on the role of lipids in risk for LOAD and has potential for suggesting novel therapeutic and public health interventions."}, {"section_title": "Strengths and Limitations", "text": "One of the strengths of this study is that genetic variants combined into a GRS to test for a complex association between metabolic traits and LOAD in a very large sample using Mendelian randomization were used. The additive effects of these SNPs have been found to be highly associated with the extremes of the distribution for each trait. For example, in a meta-analysis by Teslovich and colleagues [33] using a smaller number of lipid associated loci (n = 95), the OR of high plasma LDL-c (mean 219 mg/dl) against low plasma LDL-c (mean 110 (mg/dl) for individuals on the top LDL-c GRS quartile was 12.5 (95% CI 9.1-17.5, p = 1610 214 ). Here, in the subset with serum lipid levels we observed strong associations between all of the GRSs and the corresponding serum lipid levels, which are similar to those previously published for plasma lipid levels. Using two epidemiological studies that have shown positive associations between HR = 1.45 and OR = 2.8 (the majority of positive associations reported are OR/HR between 2 to 3) and the association between TC GRS and abnormally high serum TC levels in the ANM cohort, the expected effect sizes in this study were estimated to be between OR = 1.20 and OR = 1.70 per GRS SD giving us .99% power to capture these associations. Using individual level data and summary data when appropriate, we calculated instrumental variable estimators assessing the association of the GRS with LOAD status per increase in 1 lipid unit.\nMendelian randomization studies overcome biases found in non-genetic studies such as confounding and reverse causation. For example, epidemiological studies investigating the association of lipid levels and LOAD can be biased from confounding factors that may affect lipid levels, from the co-occurrence of other conditions that may be associated with LOAD such as impaired Table 2 . Association of the four full and trait specific GRSs with the respective serum levels in participants of the ANM cohort. glucose metabolism and obesity, from the type of study performed, from the fact that the majority of the studies have only used total cholesterol measurements, from the different blood lipid cut-offs used for analysis (or their use as continuous variable), and, most importantly, from the different timing of lipid measurements in relation to age and disease onset. For example many studies have been conducted late in the life of the participant when substantial AD neuropathology may already be present and it is therefore difficult to determine whether any changes in cholesterol levels are increasing risk for disease or, conversely, whether the pathophysiological changes that accompany AD alter cholesterol levels (reviewed in [34] ). Interestingly, it has been shown that total cholesterol decreases with age [35] , which may reflect ongoing disease processes and it has been suggested that as blood pressure and body mass index have been shown to begin to decline several years before dementia, the same may occur for LDL-c levels, supporting a role for reverse causation. Indeed, for males in the Honolulu-Asia study comparing total cholesterol levels across 26 years, an accelerated pre-clinical decline in cholesterol was observed for those who subsequently developed AD [15] . A recent study examined serum cholesterol levels and cerebral Ab measured with carbon C11-labeled Pittsburgh Compound B (PIB) and found a negative association between HDL-c and global PIB index and a positive association between LDL-c and global PIB index [36] . Although these findings are consistent with some epidemiological and clinical studies, the authors acknowledge that the measurements are cross-sectional, obtained late in life, and from a high vascular risk population; hence these associations could be confounded through reverse causation as other cross sectional studies. Genetic studies, however, overcome these issues since they are more likely to reflect lifelong exposure to altered circulating blood lipid levels. Our study, similar to other Mendelian randomization studies, suffers from potential limitations [37] [38] [39] , which are related to the validity of the assumptions underlying these studies. The main assumptions are: (a) independence between instrument and Figure 2 . Results of the meta-analysis pooled estimates for the effect of a 1 unit increase in blood lipid traits on LOAD risk using instrumental variable analysis (n = 10,578). GRSs were calculated using all independent SNPs associated with each trait (full score) and SNPs associated exclusively with each trait (trait specific score). Full score estimates were derived by weighing the association between GRS and LOAD for each dataset with the association between GRS and blood lipid trait and pooling them together using inverse-variance fixed effects meta-analysis and by using the summary method. Restricted score estimates were derived by using the summary method since the trait specific score and blood lipid estimate was a weak instrument. See Methods for further details. doi:10.1371/journal.pmed.1001713.g002 Table 4 . Association of lipid genotype risk scores with LOAD per lipid score SD using individual level data (stage 1 equation). Scores were calculated using all independent SNPs associated with each trait (full) and SNPs associated exclusively with each trait (trait specific) for all datasets and pooled together using inverse-variance fixed effects metaanalysis. Since there was some evidence for between study heterogeneity, random effects models were also tested but did not affect the meta-analysis results. Scores were calculated using all independent SNPs associated with each trait (full) and SNPs associated exclusively with each trait (trait specific) for all datasets and pooled together using inverse-variance fixed effects metaanalysis. Full allele scores were calculated using both raw genotype data and summary data. Trait specific allele scores were calculated using summary data only. Since there was some evidence for between study heterogeneity, random effects models were also tested but did not affect the meta-analysis results.\na Maximum. doi:10.1371/journal.pmed.1001713.t005 Table 6 . Association of lipid genotype risk scores with LOAD per one unit increase in lipid levels after controlling for age at baseline visit, number of APOE e4 alleles, and gender. Age for the WTCCC2 population controls was set to 60 years (See Methods). Scores were calculated using all independent SNPs associated with each trait (full) and SNPs associated exclusively with each trait (trait specific) for all datasets and pooled together using inverse-variance fixed effects meta-analysis. Full allele scores were calculated using both raw genotype data and summary data. Trait specific allele scores were calculated using summary data only. Since there was some evidence for between study heterogeneity, random effects models were also tested but did not affect the meta-analysis results. covariates, i.e., that the tested genotypes in the GRS are randomized; (b) a reliable association between the GRS and the intermediate phenotype (first stage equation), and (c) lack of pleiotropy. Although we know that there is no violation of the second assumption particularly in the case of the full GRS, possible violations of the first and third assumptions include population stratification, pleiotropic effects, canalization, epigenetic effects, and the confounding effect of genes associated with confounders and outcomes in high linkage disequilibrium with genotypes. Population stratification is not present in the current study since a white population has been used and allele frequencies between the different cohorts are very similar. Additionally, pleiotropy and the potentially confounding effects of linkage disequilibrium are likely avoided owing to the use of multiple genetic variants in the GRS and the use of the trait specific scores. Nevertheless, canalization cannot be completely excluded as a limitation of the present study.\nAnother limitation of our study, linked also to Mendelian randomization assumption two, is that that serum lipid levels were only available for a small proportion of the sample (227 LOAD cases, 196 controls and 127 MCI from the ANM cohort). We used the 550 participants from ANM dataset to calculate the GRS-lipid trait association (first stage equation) for the individual level data instrumental variable analysis in order to derive these estimates from a sample nested within our total sample. We also used the 550 participants from the ANM cohort in order to infer the expected association between the GRS with LOAD in our power analysis, since we could not find any available large published studies where the same cut-off for cholesterol levels was used when investigating its association with GRS and with LOAD. We have to additionally acknowledge that since these estimates are derived from the ANM cohort they may not apply to the other cohorts.\nAlthough we acknowledge the small number of participants, all the full GRSs were strongly associated with the respective lipid with R 2 = 1.8%-4.3% (strong instruments) and it is shown [31] that full power is achieved for an R 2 .1.5% with exposure data for ,20% of the total sample/independent sample and with very small loss in power when the subsample/independent sample is 5%-10% of the total study sample. Moreover, we acknowledge that our lipid measurements for the ANM cohort come from serum as opposed to the Willer and colleagues [20] study which was based on plasma lipid measurements. Consequently, the association between the GRS and lipids and the instrumental variable analysis using individual level data are based on lipid serum data. On the other hand, our instrumental variable analysis using summary data is based on plasma lipid data from Willer and colleagues [20] . The association between the GRS and serum lipid levels in our sample closely reflect those for plasma in published studies (for example, Teslovich and colleagues [33] ). Additionally, the suitability of our instruments when R 2 .1.5% was verified by performing instrumental variable analysis using summary data.\nAnother limitation was that although no association was observed between the GRS and age in cases or controls suggesting no survival effect, cases were on average older than controls. We also included ,6,000 population controls, ,3,000 of whom were ,60 years and could therefore develop AD in the future, and ,3,000 of this group had no age or cognitive level information. Additionally, samples from the WTCCC2 1958 Birth Cohort were also included in the Global Lipids Consortium study. However, when we repeated analyses excluding the population controls, results were essentially identical. A strength of our large case control study is that diagnosis of AD is standardised and performed under a research setting and for a proportion of cases and cognitively normal elderly controls diagnosis was confirmed by pathological examination. We must also take into consideration that case-control studies have the potential for selection or ascertainment biases in the inclusion of cases with dyslipidemia associated problems (e.g., cardiovascular disease [CVD]). However, CVD co-morbidity was not excluded here, which would result in an artificially healthy case group with beneficial lipidinfluencing genetic profiles. Information on history of myocardial infarction was available only for 643 MRC participants (521 cases and 132 controls)."}, {"section_title": "Generalizability", "text": "The relationship between lipid metabolism and LOAD is likely to be complex. The blood-brain-barrier prevents any efficient exchange between brain and blood lipoproteins, and the majority of brain cholesterol is derived from de novo biosynthesis, rather than from blood LDL-c [40] ; cholesterol levels in the periphery may therefore not reflect brain cholesterol levels. Additionally, although excess free cholesterol in brain is metabolised into cholesteryl-esters, it is also converted into 24(S)-hydroxycholesterol, an oxidized metabolite of cholesterol, which crosses the blood-brain-barrier and reaches the periphery. It has been shown that during the early stages of AD, blood 24S-hydroxycholesterol concentrations, which reflect TC concentrations in the brain, are high in cerebrospinal fluid and in peripheral circulation, potentially reflecting increased cholesterol turnover in the brain but fall in later stages of AD suggesting a lower rate of cholesterol metabolism as disease progresses (reviewed in [41] )."}, {"section_title": "Conclusions", "text": "There is no dispute over the involvement of lipid metabolism in the pathophysiology of LOAD. However, the results of our study do not support a causal role for genetically increased plasma cholesterol in LOAD and suggest that epidemiological associations between peripheral lipids and LOAD may be confounded by secondary disease processes. Future studies should focus on large LOAD datasets with longitudinal peripheral lipid measures and other markers of lipid metabolism. Figure S1 Venn diagram illustrating the overlap of SNPs associated with the four lipid traits used in this study. The rs4420638 SNP in the APOE locus, the SNP rs581080 in the TTC39B locus, the SNP rs9411489 in the ABO locus, and the SNP rs3177928 in the HLA locus are excluded. (TIF) Figure S2 Results of the meta-analysis pooled estimates for the effect of a 1unit increase in blood lipid traits on LOAD risk using instrumental variable analysis (full genotype risk scores), using the summary method (n = 10.578*). Estimates were derived by weighing the association between GRS and LOAD for each dataset with the association between GRS and blood lipid using the summary method. See Methods for further details. *Maximum. (TIF) Table S1 Information on SNPs used for the construction of the genotype risk scores in this study. SNPs used for the four GRSs constructed in this study and their association with the respective plasma levels in Willer and colleagues [20] , as well as their association with LOAD in the three groups in this study. Risk allele refers to the allele associated with increasing LDL-c, TC, and TG levels and decreasing HDL-c levels. Analyses are performed with respect to the risk allele. Risk allele frequency refers to the frequency of the risk allele used in the analysis. For the four full GRSs all SNPs associated with the specific phenotype at p,5610 28 were used. For the trait specific GRSs only SNPs associated exclusively with each lipid trait at p,5610 28 were used. The APOE rs4420638 SNP was not included in the calculation of the GRS because of its association with LOAD. rs581080 in TTC39B locus, rs9411489 of ABO locus, and rs3177928 in HLA locus were not successfully genotyped/imputed and we found no SNPs with R 2 .0.8 that were successfully genotyped/imputed to be used as proxies. *Maximum. (XLSX) The commonest form of dementia is Alzheimer disease. In this type of dementia, protein clumps called plaques and neurofibrillary tangles form in the brain and cause its degeneration. The earliest sign of Alzheimer disease is usually increasing forgetfulness. As the disease progresses, affected individuals gradually lose their ability to deal with normal daily activities such as dressing. They may become anxious or aggressive or begin to wander. They may also eventually lose control of their bladder and of other physical functions. At present, there is no cure for Alzheimer disease although some of its symptoms can be managed with drugs. Most people with the disease are initially cared for at home by relatives and other unpaid carers, but many patients end their days in a care home or specialist nursing home."}, {"section_title": "Supporting Information", "text": "Why Was This Study Done? Several lines of evidence suggest that lipid metabolism (how the body handles cholesterol and other fats) is altered in patients whose Alzheimer disease develops after the age of 60 years (late onset Alzheimer disease, LOAD). In particular, epidemiological studies (observational investigations that examine the patterns and causes of disease in populations) have found an association between high amounts of cholesterol in the blood in midlife and the risk of LOAD. However, observational studies cannot prove that abnormal lipid metabolism (dyslipidemia) causes LOAD. People with dyslipidemia may share other characteristics that cause both dyslipidemia and LOAD (confounding) or LOAD might actually cause dyslipidemia (reverse causation). Here, the researchers use ''Mendelian randomization'' to examine whether lifetime changes in lipid metabolism caused by genes have a causal impact on LOAD risk. In Mendelian randomization, causality is inferred from associations between genetic variants that mimic the effect of a modifiable risk factor and the outcome of interest. Because gene variants are inherited randomly, they are not prone to confounding and are free from reverse causation. So, if dyslipidemia causes LOAD, genetic variants that affect lipid metabolism should be associated with an altered risk of LOAD.\nWhat Did the Researchers Do and Find? The researchers investigated whether genetic predisposition to raised lipid levels increased the risk of LOAD in 10,578 participants (3,914 patients with LOAD, 1,675 elderly people without LOAD, and 4,989 population controls) using data collected in six genome wide studies looking for gene variants associated with Alzheimer disease. The researchers constructed a genotype risk score (GRS) for each participant using genetic risk markers for four types of blood lipids on the basis of the presence of single nucleotide polymorphisms (SNPs, a type of gene variant) in their DNA. When the researchers used statistical methods to investigate the association between the GRS and LOAD among all the study participants, they found no association between the GRS and LOAD.\nWhat Do These Findings Mean? These findings suggest that the genetic predisposition to raised blood levels of four types of lipid is not causally associated with LOAD risk. The accuracy of this finding may be affected by several limitations of this study, including the small proportion of lipid variance explained by the GRS and the validity of several assumptions that underlie all Mendelian randomization studies. Moreover, because all the participants in this study were white, these findings may not apply to people of other ethnic backgrounds. Given their findings, the researchers suggest that the observed epidemiological associations between abnormal lipid levels in the blood and variation in lipid levels for reasons other than genetics, or to LOAD risk could be secondary to variation in lipid levels for reasons other than genetics, or to LOAD, a possibility that can be investigated by studying blood lipid levels and other markers of lipid metabolism over time in large groups of patients with LOAD. Importantly, however, these findings provide new information about the role of lipids in LOAD development that may eventually lead to new therapeutic and public-health interventions for Alzheimer disease. Wikipedia is a free online encyclopedia that anyone can edit; available in several languages)"}]