[{"section_title": "", "text": "school-based physical activity programs, such as physical education, favorably affect educational outcomes. Physical activity and resulting fitness affect physical health via the cardiovascular, musculoskeletal, endocrine, and neurological body systems. In adults, physical activity or physical fitness has been associated with reduced risk of cardiovascular disease, [10][11][12][13] cerebrovascular disease, [14][15][16] various cancers, 10,[17][18][19][20][21] diabetes, 10,14,22 depression and anxiety, [23][24][25] all-cause mortality and survival, 11,[26][27][28] and with enhanced cognitive functioning. [29][30][31] The causal effects of physical activity and fitness on health status are most apparent in adults since, in adults, they have the opportunity to accrue over decades. Physical activity and fitness are also powerful markers of child and adolescent health. 32 Physical activity and/or aerobic fitness has been associated with reduced fatness [33][34][35][36][37][38][39][40][41] and blood pressure, 35,42,43 and improved bone health. [44][45][46] Relatively strong (observational) evidence indicates the positive effects of physical activity and fitness on mental and emotional health of youth. 32,[47][48][49][50][51][52] Physical fitness and aerobic fitness decline as youth transition from childhood and middle school to adolescence and high school [53][54][55][56] and this may be especially true for females, in general, [57][58][59][60][61][62] females who mature early 63,64 and youth who are overweight. 41,56 Males have higher levels of typical physical activity than females; for both, activity tends to decline over the progression from elementary and middle school through grade 12. 54 Estimates of populationwide levels of physical activity indicate that Black and Hispanic youth are less physically active than White youth, with disparities particularly evident for females. 54 Almost two thirds of the nation's high school students do not meet one recommended level of participation in physical activity: being physically active enough to raise heart rate and breathe hard some of the time at least 60 minutes per day on 5 days of the prior week. About 20% more of White high school students met this criterion than Black or Hispanic high school students (37.0% vs 31.1% and 30.0%, respectively). About 25% more of White female high school students met the criterion than Black or Hispanic females (27.9% vs 21.0% and 21.9%). The rates among high school males were 46.1% for Whites, 41.3% for Blacks, and 38.6% for Hispanics. Another criterion is not being physically active for at least 60 minutes on any of the prior 7 days. By this measure, prevalence among Hispanic females was approximately twice as high and, prevalence among Black females more than 150% as high, as prevalence among White females (35.2% and 42.1% vs 16.7%) ( Figure 1). In summary, a large proportion of youth is insufficiently physically active or inactive. This is especially true for females and immigrant children and adolescents. 65 Due to the magnitude of the problem, this behavior confers a large population attributable risk with respect to a variety of health and educationally relevant outcomes. Those population segments of youth experiencing disparities in level of physical activity and fitness also have disparities in access to school-based physical activity opportunities and resources. Opportunities for physical activity have been associated with access to school sports facilities and equipment storage space. 66 Subjective and objective measures of recreational opportunities have been associated with physical activity levels among youth, including adolescent girls. [67][68][69] Recreational facilities are not equally distributed. Poor urban minority youth have less access to safe recreational facilities. 70,71 The low level of physical activity among Black and Hispanic adolescent girls is largely attributable to the nature of the schools they attend. 72 Not surprisingly, there is an inverse relationship between school's median household income and average body mass index. 73 Adequate investment of financial and human resources is associated with greater opportunities for physical activity. 66 "}, {"section_title": "CAUSAL PATHWAYS AFFECTING EDUCATIONAL OUTCOMES", "text": "Recent advances in molecular biology detailing the causal mechanisms through which physical activity influences brain chemistry and cognitive function have explained what the Greeks knew, intuitively, thousands of years ago-a strong mind and body are intimately related. Physical activity affects metabolism and all major body systems, exerting powerful positive influences on the brain and spinal cord and, consequently, on emotional stability, physical health, and ability to learn. This section reviews causal pathways by which physical activity and fitness may affect educational outcomes. The strongest evidence supports direct effects of physical activity on cognition. Other plausible, albeit speculative, pathways mentioned are connectedness with school, absenteeism, and dropping out."}, {"section_title": "Cognition", "text": "An emerging body of knowledge documents beneficial cognitive effects of physical activity among animals 74 and among human adults of different ages. 29,30,[75][76][77][78][79] Exercise may favorably affect learning and memory ability associated with aging, 29,30,76,80,81 and recovery from brain or spinal cord injury; 81 it may also help to minimize adverse effects from chronic neurogenerative disease. 82,83 The greatest cognitive benefits of physical activity may be for those with the lowest cognitive ability. 77,84 Studies conceptualize and define physical activity and fitness and cognition in different ways, complicating the task of delineating which specific aspects of physical activity or fitness (eg, cardiorespiratory, strength, flexibility, balance, speed, agility) are causally related to which specific aspects of cognition (eg, executive function, verbal, auditory and visual memory, inhibition, attention, response speed). Nevertheless, current knowledge strongly indicates that physical activity can benefit aspects of cognition, thereby favorably affecting educational outcomes. Recent literature reviews on physical activity or physical fitness and cognition 29,79,80,[85][86][87] have all reached the same conclusion: physical activity (or aspects of physical fitness) favorably affects cognitive functioning. Ploughman 88 provides a concise summary of how exercise may affect executive functioning: (1) increasing oxygen saturation and angiogenesis, (2) increasing brain neurotransmitters (eg, increasing serotonin), and (3) increasing brain-derived neurotrophins that support neuronal differentiation and survival in the developing brain. Diverse research on exercise and energy metabolism, exercise and molecular causal pathways affecting the brain, and exercise and memory and learning (eg, brain-derived neurotrophin factors and resultant increased neuronal plasticity) provides a compelling rationale for ascribing a role in cognition to physical activity. It is likely that the effects of physical activity on cognition would be particularly important in the highly plastic developing brains of youth. 88 Among children, physical activity, physical fitness, and cognition have been investigated, from a variety of educationally relevant perspectives beyond the cellular level. Interpretation of this literature is complicated by several factors, most notably, variations in educational outcome measures. Some intervention studies analyzed on-task behavior during instruction 84 or concentration; 89 others used standardized achievement tests. [90][91][92] Some observational studies used standardized test scores; 93,94 others used grades 50 or other measures of cognitive function (eg, neuroelectrical indices of memory, attention and response speed), 95 or interference control (a component of executive control). 96 Some consider physical activity, 50,93 others consider physical fitness. [94][95][96] Three recent literature reviews conclude that school-based physical activity programs may result in short-term cognitive benefits, 97 improve cognitive functioning among children, 98 and do not hinder academic achievement. 99 These different kinds of evidence support the case for favorable effects of physical activity or physical fitness on cognitive functioning of youth."}, {"section_title": "Connectedness", "text": "No studies have specifically evaluated the relation between school-based physical activity programs and connectedness, but such programs would seem a natural context in which youth might engage and cooperate with peers, learn teamwork, and excel physically. These behaviors would be expected to foster engagement in school. Connectedness might also be enhanced via decreased overweight and obesity. The transition from childhood to adolescence is a time when mental and emotional problems increase. [100][101][102][103] Problems such as anxiety and depression, among others, and resultant internalizing and externalizing behaviors, can have powerful adverse effects on school success, both academic and social. Physical activity favorably affecting indices of mental and emotional health can promote improved overall well-being and, indirectly, connectedness with peers and teachers at school. [104][105][106] "}, {"section_title": "Absenteeism", "text": "School-based physical activity programs may improve attendance by reducing obesity, which has been associated with absenteeism, 107,108 by increasing connectedness, and by favorably affecting the health status of children with asthma. A consistent finding is that physical activity can improve cardiopulmonary fitness among youth with asthma. [109][110][111][112] Physical activity has also been reported to have favorable effects on physiological indices other than fitness 113,114 and to improve quality of life. 114,115 Exercise-induced asthma should be addressed, not by avoiding exercise, but by increasing physical fitness. 116 School-based physical activity programs can help youth with asthma to learn and maintain healthy physical activity habits."}, {"section_title": "Dropping Out", "text": "One study investigated the relation between participation in school-based physical activity programs and dropout. Findings were based on repeated measures collected as part of the National Educational Longitudinal Study. Dropout rates were lower for youth who consistently participated in interscholastic sports. 117 This is not meant to imply that school-based physical activity programs are a panacea for the dropout problem. However, to the extent such programs are enjoyable for youth and foster teamwork, cooperation, and physical fitness, youth who participate may be more connected with and engaged in school, and more likely to attend and remain in school."}, {"section_title": "WHAT CAN SCHOOLS DO TO INCREASE LEVELS OF PHYSICAL ACTIVITY AND FITNESS?", "text": "School administrators, trying to raise standardized test scores, may mistakenly believe that physical education curricular time should be sacrificed and reallocated to reading, mathematics, and science. There is currently no evidence indicating that this strategy is, in fact, effective in increasing standardized test scores; in fact, a growing body of evidence shows that increased time for physical education and other school-based physical activity programs is associated with either a neutral or positive impact on academic outcomes. A variety of consensus recommendations are available to guide the conceptualization of schoolbased physical activity/education programs. [118][119][120][121][122] Increased student physical activity and physical fitness can best be achieved through a comprehensive approach 118 that includes physical education, wise use of recess and after school times, co-curricular physical activity opportunities, and bicycling or walking to and from school. The nature and scope of schoolbased physical activity/education programs will vary with the resources available (eg, human, physical, and social environmental) and with the level of commitment by school administrators. Community linkages can ease access to community recreational facilities. Cooperation of the local police can help ensure safety as students walk to and from school. In some localities, schools may represent the main recreational resources within the community. The cornerstone of school-based physical activity programs should be a high-quality physical education program based on national standards. Such programs are strongly recommended by the Task Force on Community Preventive Services as a way to increase physical activity and physical fitness among youth. 123,124 National Standards for Physical Education published by the National Association for Sport and Physical Education 119 posit that a physically educated person: 5. Exhibits responsible personal and social behavior that respects self and others in physical activity settings. 6. Values physical activity for health, enjoyment, challenge, self-expression, and/or interaction. Physical education class is an important opportunity for youth to be active and to learn self-awareness, self-regulation, and other social-emotional skills, such as teamwork and cooperation. As with any school subject, quality is greatly influenced by teacher preparedness and enthusiasm. Opportunities for professional development can facilitate both. Another critical factor is the use of a sound physical education curriculum, consistent with the national physical education standards and the evidence-based characteristics of effective curricula. The Centers for Disease Control and Prevention's (CDC's) ''Physical Education Curriculum Analysis Tool'' can help school districts select or develop such a curriculum. Increasing participation by students least inclined to be active may require a new approach to physical education. Many youth really enjoy school physical activity/education programs. This can be true for many more. Opportunities for enjoyable play at school can dramatically affect youth development 125 and foster school connectedness and engagement. Identifying and implementing physical activities that youth enjoy, particularly those who are less inclined to participate, is a key strategy in conceptualizing an effective physical education program. Research, [126][127][128] as well as common sense, dictates that if students enjoy physical education, they will be more inclined to participate actively and to be engaged. A school environment that motivates and enables youth to be physically active can serve to promote physical activity. Such an environment is determined in great part by the availability of space, equipment, and supplies. A safe environment is essential. Safety is achieved through design and maintenance of facilities, use of appropriate protective equipment, and adequate supervision. There is a well-documented inverse relationship between environmental safety and physical activity. [129][130][131][132] The psychological environment is also important. If recreational time is characterized by negative social interactions, benefits will be limited. Some youth (eg, overweight girls) may choose to avoid physical activities altogether. A psychological environment characterized by encouragement to be active and minimization of teasing and other aggressive behaviors will have benefits beyond physical activity, and is considered a national standard for physical education. 119 Social support has been positively associated with level of physical activity among adolescent girls. 67 While emphasizing increased physical activity and fitness, schools can also help youth to learn, value and practice respectful and cooperative behaviors, and provide attentive social support for development of physical self-efficacy. 133 The interpersonal interactions characteristic of many physical activities and learned in the context of a physical activity program can have important spillover effects on school climate. Like all school programs, physical activity programs require insight and leadership. 66 Extracurricular activities, before and after school and in the summer, can greatly contribute to the acquisition of regular physical activity habits. For many youth, participation in sports teams is an important context for physical activity and a powerful element of connectedness with school. As a matter of course, competitive sports tend to limit themselves to those with the greatest athletic abilities. Sports teams are not the answer for all students. Encouragement to be physically active needs to be intentionally directed toward those who need it most: the overweight and those with the least athletic abilities. Alternatives to competitive sports include dance, martial arts, walking, and physical activity games. Recess, a time for play, may be an appropriate time to promote physical activity. Some data suggest that school-day recess playtime can contribute significantly to children's overall levels of moderate to vigorous physical activity. 134 Students, however, are not all equally likely to be physically active during recess. 135 For some, free time for relaxation may be advantageous. Children who walk or bike to school have higher levels of physical fitness and physical activity than those who do not. 136 Walking to and from school may be an option for some students, particularly in urban areas, but the majority of children in the United States do not walk to school [137][138][139][140] and the percentage of children who do has declined sharply over the past decades. 139,140 Longer distances and safety concerns have been identified as barriers to walking to school. 137,138 Active transportation to school has been identified as a potentially important strategy to increase physical activity among low-income minority youth. 141 The CDC 142 and the National Center for Safe Routes to Schools 143 have developed programs and resources to encourage walking and biking to school. Academic classroom time can be beneficially relieved with brief breaks for stretching or other activity associated with physical well-being. A classroom physical activity program integrating academic and physical activity curriculum-''TAKE 10!''-was found to increase levels of moderate physical activity among elementary level students. 144 Another intervention, comprising two 10-minute lessons per day taught by classroom teachers, was found to yield increased levels of energy expenditure. 145 Both interventions achieved beneficial physical activity goals without undermining academic goals."}, {"section_title": "PROVEN OR PROMISING APPROACHES", "text": "Most evaluation studies focus on the extent to which school-based physical activity/education programs increase physical activity and physical fitness. An ample number of studies document that well-conceived programs, implemented by skilled staff, can increase levels of both physical activity and physical fitness among youth. [146][147][148][149][150][151] Based on synthesis of the scientific literature on evaluations of school-based physical education programs, the Task Force on Community Preventive Services 123 strongly recommends longer physical education classes and increased time engaged in moderate to vigorous activity as a strategy for increasing physical fitness. An emerging body of evidence suggests that schoolbased physical activity programs, such as physical education, have either a neutral or a positive impact on educational outcomes; there appears to be no evidence to support the notion that reducing time for physical education is a sound strategy for increasing academic achievement. [97][98][99] In the most recent and comprehensive review, Trudeau and Shepard 99 concluded, based on a review of 7 quasi-experimental and 9 cross-sectional studies, that allocating more curricular time to physical activity programs, and less time to other academic subjects, does not affect the academic performance of elementary school students negatively and that an additional curricular emphasis on physical education may result in small absolute gains in academic achievement. A recent cross-sectional study not included in the Shepard review examined the association between time spent in physical education and academic achievement among a nationally representative sample of more than 5000 students in the US Department of Education's Early Childhood Longitudinal Study, Kindergarten Class of 1998 to 1999. Carlson et al 93 found a small but significant benefit for academic achievement in mathematics and reading for girls enrolled in higher amounts of physical education, while higher amounts of physical education were not positively or negatively associated with academic achievement among boys. Useful standards for implementing high-quality, school-based physical activity programs are available from credible sources. 119 The nation's public schools are well positioned in their communities to have a dramatic influence on the physical activity and social behavior of youth. Students who have the greatest need to increase physical activity, namely urban minority children and adolescents, have the scantest resources and supports to do so. 66,[70][71][72] "}, {"section_title": "SUMMARY", "text": "Strong evidence supports the ability of school-based physical education programs to improve populationwide rates of physical activity and fitness. Benefits of such programs include facilitating physical activity and physical fitness, and favorably affecting weight control and overall health. It seems likely that mental and emotional health may benefit as well. Because physical activity affects the brain and cognition, there are likely to be favorable effects on ability to learn. Further, school-based physical activity programs provide an opportune time to help youth learn and practice social. behaviors associated with teamwork, cooperation, and respect for others, which in turn can favorably influence school climate, connectedness with school, and educational outcomes."}]