[{"section_title": "Abstract", "text": "Recent population studies suggest an intriguing inverse relationship between several types of cancer and neurodegenerative diseases, including Alzheimer's disease. Understanding the intersection of the underlying biology for these two distinct families of diseases with one another may offer novel approaches to identify new therapeutic approaches and possible opportunities to repurpose existing drug candidates. The Alzheimer's Association and the Alzheimer's Drug Discovery Foundation convened a one day workshop to delve into this discussion. Workshop participants outlined research focus areas, potential collaborations and partnerships for future action."}, {"section_title": "Introduction", "text": "Over the past decade, several population-based studies have suggested an intriguing relationship between many types of cancer and neurodegenerative diseases, including Alzheimer's disease (AD), and Parkinson's disease (PD) and amyotrophic lateral sclerosis (ALS) (1) . Both cancer and AD are heterogeneous diseases of aging that cause substantial morbidity and mortality. They receive substantial investment from both the National Institutes of Health (NIH) and the biotechnology/pharmaceutical industry. Success in translating biological discoveries about AD into new therapies lags far behind those achieved to date within the cancer field, an area of major foment with an explosion of interest in effective immune approaches.\nThe nexus of cancer and neurodegenerative disease may offer novel opportunities to expand understanding of disease-related mechanisms and identify new therapeutic targets. Recognizing these possibilities, the Alzheimer's Association and the Alzheimer's Drug Discovery Foundation (ADDF) convened a one-day think tank on May 25, 2016 . Its purpose was to delve into the biological underpinnings that may provide further context for the inverse relationship between cancer and later-life neurodegenerative diseases, particularly AD and PD. Further, we explored whether and how these insights may be exploited to advance drug discovery. Participants in this discussion spanned the disciplines of biostatistics, epidemiology, genetics, immunology, neurology, neuropsychology, oncology, radiation oncology, psychiatry, and surgery."}, {"section_title": "Epidemiologic evidence linking cancer with neurodegenerative disease", "text": "Evidence from multiple epidemiological studies suggests a negative or inverse association: i.e., a lower risk of some cancers among persons with AD and PD (2) , as well as a lower risk of subsequent AD among cancer survivors (3) . Additional work has identified associations between other cancers and AD (4) . Reduced risk of cancer has also been identified in patients with ALS (5), although no effect has been found on the risk of incident ALS following a diagnosis of cancer (6, 7) . These associations appear across many individual types of cancer, including both smoking-related cancers (oral, breast, lung, pancreas, etc.) and smoking-unrelated cancers. However, in PD, studies have also suggested positive or direct associations with melanoma and prostate cancer (8, 9) .\nObservational findings, even when remarkably consistent, are only signals; the challenge is to understand what mechanisms they represent. Methodological explanations may account for some of the observed reduced risk of cancer in patients with neurodegenerative disease. Three types of bias are particularly germane to this discussion. First, a competing risks or survival bias could result from poorer survival among patients with both AD or PD and cancer, compared to those with neurodegenerative disease alone. A second type of biasascertainment bias -would result from a difference in the likelihood of screening or detection of one disease after the diagnosis with the other. Indeed, a study by Freedman and colleagues suggested that PD patients are less likely to receive cancer screening and aggressive diagnostic procedures, and they concluded that the data do not support a biological relationship between PD and cancer (10) . Finally, non-population-based studies may suffer from selection bias if, for example, people with cancer do not volunteer for dementia research, and vice versa.\nWhen analyzing risk relationships between cancer and AD, the type of data available (e.g., from large database or multiple studies), study design, and analytic approaches, all influence results. For example, to take into account the relatively low frequency of both individual cancer types and the various neurodegenerative disorders, the sample must be large enough and follow-up sufficiently long with adequate assessment of both outcomes. The study may have a prospective cohort, nested case-control, or cross-sectional design, depending upon the data available and the selected study population (e.g., cancer registry, AD registry, or population-based cohort or registry). Analytic methods and inferences should vary according to the sample and design. For a time-to-event or survival analysis, the baseline must be clearly specified.\nInterpreting signals from epidemiologic studies is challenging for multiple reasons in addition to the issues of bias discussed above. Multiple overlapping mechanisms and common risk factors appear to underlie both cancer and neurodegenerative disease. Further complicating this scenario is the fact that risk factors may be associated with either an increased or diminished risk of both some cancers and some neurodegenerative diseases. Epidemiologic studies also point to possible biological factors that could explain the observed association between cancer and neurodegenerative diseases, including common risk factors such as stress, obesity, diabetes, chronic inflammation, and immunosenescence (1). Stress itself can alter cancer immunity. For other risk factors, such as smoking, the associations may be in opposite directions: smoking is associated with a higher risk for some cancers and in some studies for AD, but a lower risk for PD (11, 12) . Ethnicity and other environmental factors also play important roles in disease pathogenesis. In a Taiwanese study, for example, PD showed a positive rather than negative relationship with increased risk of all cancers (13) . One possibility is that cultural bias, especially in terms of dementia, could affect diagnosis rates and thus the overall results. Vascular interactions could also play important roles, related to whether cancer survivors have an increased risk of metabolic disorders that may, in turn, increase their risk of vascular disease.\nInteractions among risk factors further complicate the picture. For example, the association between melanoma and PD appears to be biologically plausible, given that melanocytes and neurons both arise from a common embryonic cell type. In addition, levodopa (the predominant treatment for PD) serves as a substrate for the syntheses of both dopamine and melanin. Some studies have suggested that pigmentation gene polymorphisms may explain the increased risk of melanoma in PD patients (14) . However, another study found no association between PD single-nucleotide polymorphisms (SNPs) and melanoma (15) , and yet another study found no association of pigmentation phenotypes with PD (16). Thus, current evidence does not clearly support a genetic link, although sample sizes are underpowered to definitively support a negative statement. Environmental links are more difficult to assess in this context."}, {"section_title": "Mechanistic links between cancer and AD", "text": "Neoplasia and neurodegeneration share many genes and biological pathways, although they are often regulated in different directions (17, 18) . The common pathways implicated in both cancer and neurodegenerative diseases include those that have an age-related change in regulation: cellular metabolism, inflammation, immunosenescence, oxidative stress, angiogenesis, DNA repair, apoptotic cell death and removal of effete proteins and organelles, and cell cycle entry. Aging is also associated with alterations in chaperone-mediated protein folding, and protein degradation. In support of the hypothesis that cellular molecular processes are dysregulated in opposite directions, Ibanez and colleagues conducted transcriptome meta-analyses of microarray gene expression data from three neurodegenerative diseases and three cancers, examining pathways that were downregulated in central nervous system (CNS) disorders and up-regulated in cancer, and vice versa. Metabolism and genetic information-processing pathways were most significantly down-regulated in CNS disorders and up-regulated in cancer (19) . Holohan et al reviewed differential pathway regulation based on related microRNA based mechanisms in cancer and AD (18) . The protective effect of cancer history in a person with AD behaves in a similar manner to genetic modulation of AD risk. Nudelman et al, analyzing ADNI data, found that individuals with a history of cancer demonstrated later onset age of symptoms of AD (20) . Some 60 years ago, Otto Warburg proposed that cancers arise as a result of metabolic dysfunction (21) , suggesting that so-called oxidative glycolysis with dysfunctional mitochondria was central to the disease. Although this finding resulted in a Nobel Prize for the scientific team, it was many years before scientists began to appreciate the important role of mitochondrial function in the development and progression of cancer. Now, increasing evidence suggests that the inverse association between cancer and neurodegeneration may, at least in part, result from diametrically opposite bioenergetic requirements of neurons and cancer cells (22) , neurons being post-mitotic and relying largely on oxidative phosphorylation (OXPHOS) and tumors arising with associated hypoxia and nutrient deprivation, with fermentative glycolytic pathways. Thus, in response to metabolic dysregulation, both cancer cells and neurons undergo metabolic reprogramming. Cancer cells up regulate glycolysis, while astrocytes and neurons up regulate OXPHOS, results in more reactive oxidation species and stress (23) . Mitochondria are the cell's primary generators of energy, and mitochondrial dysfunction occurs in aging as well as in many diseases, including neurodegenerative diseases. Mitochondrial proteins are important in cerebral remodeling (24) and common proteins involved with mitochondrial quality control are disordered in the setting of neurodegeneration and cancer (25) . Mitochondria may also play a role in the development of cancer and neurodegenerative diseases (26) through cellular energy deficits and oxidative stress pathways (27) , by emergent mitochondrial heteroplasmy (28, 29) and effective mismatch between the mitochondrial and nuclear genomes present throughout the lifetime of the individual (30) .\nAging is typically associated with changes in immune function; in particular a more activated innate immune system and increased inflammatory profile combined with immunosenescence or the decline of adaptive immunity and immune exhaustion. Indeed, immunosenesence coincides with the onset of AD and many cancers, and the immune system, including brain resident microglia and astrocytes, appears to contribute significantly to neurodegenerative pathology (31) . A recent effort called the Immune Variation (ImmVar) project is seeking to map the genetic variation that leads to variation in immune function in healthy subjects, as a first step in understanding how such variations contribute to various diseases, including AD and PD (32, 33) . In addition, studies aimed at dissecting the role of the immune component of mRNA-derived molecular networks of the aging human cortex are ongoing (34) . These integrative approaches provide an unsupervised evaluation of all cells in the target cortical tissue, and, in combination with longitudinal profiling of peripheral blood and deep phenotypic characterization of individuals with neurodegenerative disease and cancer, they should provide a new framework with which to better understand how systemic and brain immune function affect one another in making a person susceptible to AD and/or cancer.\nMolecular chaperones -in particular heat-shock proteins (HSPs) -regulate the folding and unfolding of proteins. HSPs are regulated by the heat shock transcription factor 1(HSF-1) and are abundantly expressed in many cancer cells, but their synthesis declines with age in neuronal cells. In cancer, HSP72, for example, has been linked to breast cancer progression and tumor initiation, growth and metastasis in lung cancer. Thus, HSPs and HSF-1 have been implicated as attractive therapeutic targets. Molecular chaperones can also be secreted, whereupon they carry out extracellular functions, including those related to immune and inflammatory modulation and wound healing. Another abundant nuclear protein, HMGB1 is associated with both neurodegeneration and cancer (35) .\nAging is associated with the loss of the sex steroid hormones, estrogens in women and testosterone in men. Sex hormones have also been linked to cognitive function and cancer, particularly of the breast (36), but also other cancers such as colorectal cancer (37) . A positive association has also been found between prostate cancer and both Alzheimer's and PD dementia (9) . The relationship between sex hormones and neurodegeneration is complicated, since estrogens and androgens exert both positive and negative effects in the brain (38, 39) . However, the age-related loss of sex hormones -such as loss of estrogen in women and testosterone in men -is associated with an increased risk of AD as well as increase levels of β-amyloid levels, increased tau phosphorylation,, increased neuronal death, and decreased spine density (38) .\nSex hormones have also been linked to the development of certain cancers. For instance, estrogens are well-known drivers of tumor proliferation in hormone-receptor positive breast cancer (40) , and androgens are known to play a similar role in the pathogenesis of prostate cancer (41) . Given their critical roles in the development of breast and prostate cancer respectively, therapies that modulate or inhibit estrogen and testosterone have become mainstays of treatment for these diseases. Endocrine therapies, including selective estrogen receptor modulators (SERM), such as tamoxifen, and aromatase inhibitors, have dramatically improved survival in women with hormone-receptor positive breast cancer (42) . However, the anti-estrogen properties of both of these endocrine therapies can exert negative effects on the brain, and endocrine therapy use is positively associated with impairment on a number of cognitive domains (43) . Similarly, while androgen deprivation therapy significantly improves prostate cancer outcomes, treatment has also been associated with negative effects on visuomotor ability (44) and there is evidence that androgen deprivation therapy may increase the risk of developing AD (45) .\nComplicating the inverse relationship of cancer with neurodegenerative disease is the fact that cancer treatments like chemotherapy may accelerate aging effects. Chemotherapy for cancer has been associated with inconsistent effects on cognitive impairment, although there appear to be parallels between the biology of aging and the effects of chemotherapy (47, 48) . Structural, functional and molecular imaging approaches similar to those used in AD research have been employed in studies of cancer patients (49) . There is also evidence that chemotherapy may impact brain regions associated with brain aging (49) (50) (51) . Thus, when examining the mechanisms underlying the association between cancer, AD and related dementia, the adverse cognitive effects of chemotherapy and hormonal cancer treatments should also be considered."}, {"section_title": "Genetic links between cancer and AD", "text": "Genes that are implicated in both cancer and neurodegenerative disease may provide clues about pathogenic mechanisms as well as point to potential therapeutic targets. For example, the breast and ovarian cancer type 1 susceptibility gene (BRCA1) encodes a DNA repair protein, BRCA1. BRCA1 is expressed at reduced levels in the brains of individuals with AD and in animal models of AD. Beta-amyloid (Aβ) oligomers reduce BRCA1 levels in neuronal cultures, and BRCA1 depletion in mice is associated with impaired cognitive function (52). It is not yet known whether mutations in BRCA1 would change its function in the brain. In addition, the APOE e2 allele which reduces risk of AD may increase risk and aggressiveness of some cancers (64) .\nAPOEε4 is the strongest genetic risk factor for late onset AD (53) . Presence of the ε4 haplotype is also associated with poor cognitive function following chemotherapy, possibly because of impaired neural repair mechanisms (54) . Recently, bexarotene, a drug developed to treat skin cancer that targets the expression of APOE, has shown promise in AD mouse models, both clearing Aβ and reversing cognitive, social, and olfactory deficits (55) . A proof of concept phase 2 clinical trial of this drug did not suggest a benefit of the drug compared with placebo and highlighted potential cardiovascular adverse events (56) .\nOther genes that have been linked to both cancer and AD include tumor suppressor genes, including BIN1 (57), the transmembrane receptor gene expressed on myeloid cells TREM2 (58) , and genes involved in cell-cycle and angiogenesis transcriptional signaling, pathways (59) . A mutation in the gene LRRK2, which is associated with increased PD susceptibility has also been shown to increase the risk of certain cancers (60)."}, {"section_title": "Drug repurposing and other therapeutic implications", "text": "Although AD and cancer share biological targets, approaches to these targets may be opposing for these different indications. For example, proteasome inhibitors may be effective anti-cancer drugs, while proteasome activators may be useful in slowing neurodegeneration. Some cancer treatments may target proliferation by promoting apoptosis, while AD treatments might seek to protect neurons and limit cell death. Alternatively, pathways affected in AD and cancer can also be similarly regulated -for example certain epigenetic changes may both cause neurodegeneration and contribute to cancer. As experimental agents for cancer are applied to neurodegenerative disease, there will be a need to make these agents more brain penetrable, safe, and effective at lower doses to enable chronic dosing.\nRepurposing of cancer chemotherapeutics already on the market offers a possible accelerated pathway to new drugs for AD (61) . A number of cancer drugs that target mechanisms important in neurodegeneration have been proposed for repurposing, including tyrosine kinase inhibitors, immune checkpoint inhibitors (62), liver X receptor and retinoid X receptor (LXR/RXR) agonists that target lipid-transport proteins such as APOE, and microtubule stabilizers. Conversely, as AD treatments focused on these targets are developed, there is also the potential for these therapies to benefit cancer patients."}, {"section_title": "Conclusions/next steps", "text": "Both cancer and AD are complex, polygenic diseases in which multiple overlapping pathways are implicated. The apparent links between these diseases suggest possible therapeutic options and the testing of cancer treatments for AD, as well as the need for deeper investigation into the cognitive side effects of cancer treatments and the long term implications (63) .\nWhile there may be a few immediate opportunities for repurposing clinical trials of cancer drugs for neurodegenerative disease, workshop participants agreed that a better understanding of underlying mechanisms between these diseases is needed. This includes a more thorough understanding of the biological heterogeneity that characterizes both neurodegenerative diseases and cancers. Further work to elucidate the biological underpinnings of these diseases will also help in terms of detection, biomarker development, the development of pharmacological and non-pharmacological interventions, and prevention. A systems biology approach to answering these questions could be applied to address the inherent complexity and overlapping features of these diseases.\nDiscussion focused on identifying the potential avenues of exploration that could leverage learnings and existing resources in the oncology space to neurodegenerative diseases and vice versa. For instance, in the U.S., the National Cancer Institute (NCI) supports a Surveillance, Epidemiology, and End Results (SEER) Program, which collects data on cancer incidence and survival in some parts of the country. A SEER equivalent for AD, even if adopted in only one or two of the same areas of the country, could provide similar resources in the AD field. Exploring genetic links between neurodegenerative disease and cancer is feasible, but, given the variability within AD and PD patient populations, sample size requirements are significant. European population-based registries provide a potential resource for exploring these avenues more powerfully. Areas of research that would significant enhance our understanding and provide a framework for advancing research toward applying therapeutic approaches from cancer to neurodegenerative disease were discussed. Identified research priorities include:"}, {"section_title": "•", "text": "Explore existing cancer cohort studies with AD biomarker studies including genetics and genomics, blood and CSF analytes, and advanced neuroimaging. Conversely, new studies could include more comprehensive assessment of cancer data in cohorts addressing aging related cognition and MR imaging outcomes.\n• Develop systematic, longitudinal immunoprofiling of the human peripheral and resident immune system in subjects with deep phenotypic characterization relevant to AD pathology and cancer, to understand how systemic and brain immune function affect one another in making someone susceptible to AD and cancer.\n• Develop longitudinal characterization of immunosenescence to understand immune system dynamics and identify biomarkers with which to measure innate immune function that is relevant to cancer and AD.\n• Invest in large-scale functional and compound screening of novel human in vitro systems to understand and perturb the functional consequences of genetic and other AD risk factors in immune cells.\n• Develop comprehensive phenotyping across multiple domains of available cohorts through collaborations between NCI, NIA, and other agencies.\n• Identify well-characterized cohorts of young adults and following them through late adulthood with a life course approach to simultaneously identify and track the development of both cancer and neurodegeneration, including their risk factors and preclinical marker.\n• Identify common or variant biomarkers that reflect the two diseases\nMore immediate needs include a toolkit for immune profiling and the development of pharmacodynamic markers for AD. To learn from what has been achieved in the cancer field and transfer these lessons to AD, these and other initiatives will require consortia of government and non-profits as well as policy innovations to stimulate investment in repurposed drug evaluation for AD and other neurodegenerative diseases.\nAs the cancer survivorship population grows, issues related to the long term effects of chemotherapy on cognition will also become more and more important. To understand these effects, as well as how other exposures in mid-life may impact both cancer and neurodegenerative disease in combination, funding agencies will also need to support longlasting longitudinal studies. Taken together, the current evidence along with the strong scientific rationale for future investigations supports the need to understand the nexus between cancer and neurodegeneration, including Alzheimer's disease, and to translate this information to therapy learnings for potential future clinical trials."}, {"section_title": "Research in context", "text": ""}, {"section_title": "Systematic Review", "text": "Recent population studies suggest an intriguing inverse relationship between several types of cancer and neurodegenerative diseases, including Alzheimer's disease."}, {"section_title": "Interpretation", "text": "Understanding the intersection of the underlying biology for these two distinct families of diseases with one another may offer novel approaches to identify new therapeutic approaches and possible opportunities to repurpose existing drug candidates. During this one day workshop, experts explored the nexus of biological mechanisms -inflammation, cell cycle regulation, cell survival, and others -to identify potential targets for future investigation."}, {"section_title": "Future Directions", "text": "Workshop participants outlined research focus areas, potential collaborations and partnerships for future action. Discussion focused on identifying the potential avenues of exploration that could leverage learnings and existing resources in the oncology space to neurodegenerative diseases and vice versa. "}]