[{"section_title": "Abstract", "text": "Background-Although exercise-induced ST depression is an independent predictor of future coronary events in asymptomatic populations, the predictive value of ST depression beginning after exercise cessation is unknown. Methods and Results-We analyzed the treadmill exercise tests of 825 healthy volunteers who were 22 to 89 years of age from the Baltimore Longitudinal Study of Aging. All subjects were free from coronary heart disease by history, physical examination, and resting ECG. From 825 participants, 611 (group 0) had no ischemic ST-segment changes during or after treadmill exercise, while 214 subjects developed Ն1-mm flat or downsloping ST depression: 151 (group 1) had ST changes starting during exercise, and 63 (group 2) had changes limited to recovery. Groups 1 and 2 were similar in age, sex, smoking status, hypertension prevalence, fasting plasma glucose, and serum cholesterol (CHOL). However, both groups were older and had higher CHOL and prevalence of hypertension than group 0. Treadmill exercise duration, peak oxygen consumption, and maximal heart rate were similar between groups 1 and 2 but were lower than in group 0 (each PϽ0.05). During a mean follow-up time of 9 years, 55 subjects developed coronary events (angina pectoris, myocardial infarction, or coronary death): 21 of 611 (3.4%) in group 0, 22 of 151 (14.6%) in group 1, and 12 of 63 (19%) in group 2 (Pϭ0.001). By survival analysis, the risk of coronary events was similar in groups 1 and 2 but significantly higher than in group 0 (PϽ0.0001 "}, {"section_title": "", "text": "D espite the availability of newer methods, exercise ECG testing is still the most widely used screening test for coronary artery disease (CAD). Numerous studies, including a prior one from our laboratory, 1 have shown that an ischemic ST-segment response to exercise is a powerful harbinger for future coronary events (ie, angina pectoris, myocardial infarction, or sudden cardiac death) in apparently healthy populations, [1] [2] [3] [4] [5] [6] [7] [8] [9] [10] [11] [12] independent of conventional risk factors. An unsettled issue, however, is whether ischemic ST-segment changes that begin during the recovery period have diagnostic and prognostic significance similar to that of ST-segment depression appearing during exercise. Studies in symptomatic patients comparing exercise-onset versus recovery-onset STsegment depression have demonstrated similar sensitivity and specificity for angiographic CAD. [13] [14] [15] In contrast, only a single study limited to young male aircrew personnel has examined the significance of ischemic ST-segment depression beginning during recovery. 16 Because age is a major risk factor for CAD, extrapolation of these findings to the general population requires additional support. The present study was therefore designed to determine whether recovery-onset ischemic ST-segment responses to treadmill exercise in apparently healthy male and female volunteers across a broad age range have prognostic significance for future coronary events similar to that of an ischemic response appearing during exercise. All subjects were volunteers from the Baltimore Longitudinal Study of Aging (BLSA) and were free from coronary heart disease by history, physical examination, and resting ECG."}, {"section_title": "Methods Population", "text": "Since its beginning in 1958, the BLSA has enrolled Ͼ2400 community-dwelling volunteers who return biennially to the Gerontology Research Center of the National Institute on Aging in Baltimore, Md, for 2 1 ⁄2 days of extensive testing. 17 This population of upper-middle-class subjects is generally well educated and health conscious and has a low to intermediate risk profile for coronary heart disease. Approximately two thirds report some aerobic physical activity each week. BLSA participants undergo a thorough history and physical examination and resting 12-lead ECG. Those without clinical evidence of heart disease who are able to exercise (Ͼ80% of subjects) perform a maximal treadmill exercise test on alternate visits."}, {"section_title": "Exercise Testing Protocol", "text": "Between January 1978 and December 1993, 1500 subjects underwent exercise treadmill testing. Before exercise, a routine 12-lead ECG was recorded with the subject in the supine and seated positions after 30 seconds of forced hyperventilation and after 30 seconds of standing. All subjects then exercised to exhaustion on a motorized treadmill according to a modified Balke protocol, during which the treadmill grade was increased 3% every 2 minutes, starting from a horizontal position; women walked at a constant speed of 3.0 mph; men, at 3.5 mph. 1 A 12-lead ECG and brachial artery cuff blood pressure were recorded every 2 minutes during exercise, at maximal effort, immediately after exercise cessation, and every 2 minutes for at least 6 minutes into recovery. Testing was terminated because of fatigue, dyspnea, or leg discomfort. All postexercise ECGs were taken in the seated position. Individuals who developed anginal pain during the test were excluded from the analysis. ECG changes were assessed according to Minnesota Code criteria 18 by a single observer (J.L.F.). A positive or ischemic response was defined as Ն1-mm J-point depression with ST segment flat or downsloping in the majority of complexes in any ECG lead except AVR (Minnesota code 4:1). The ECG response was not an indication for test modification or termination. Individuals with significant ST-segment abnormalities (Minnesota code 4:1, 4:2, 4:3, or 4:4) at rest or induced by postural shift or hyperventilation who demonstrated worsening ST-segment depression during or after exercise (nϭ101) were considered indeterminate responders and were not included in the data set. In addition, subjects who demonstrated intermediate exercise-induced ST changes (Minnesota code 11:2, nϭ110; code 11:3, nϭ51; and code 11:4, nϭ165; totalϭ326) were excluded from analysis.\nA total of 285 subjects demonstrated an ischemic ST-segment response to exercise. Of these, 71 subjects were excluded for the following reasons: exercise-induced angina pectoris before or on the index visit (nϭ32), pathological Q waves (Minnesota code 1:1 or 1:2) present on any ECG before the index visit (nϭ4), follow-up time Ͻ2 years (nϭ11), known valvular heart disease (nϭ12), and the presence of cardiac glycosides or other antiarrhythmic drugs (nϭ12). Thus, 214 individuals with a positive exercise ECG met the inclusion criteria for our study. After these same exclusion criteria were applied to the 788 subjects with a normal exercise ECG and after elimination of 77 subjects who did not achieve Ն85% of predicted maximal heart rate (defined by 220 minus their age), 611 individuals constituted the control group."}, {"section_title": "Follow-up", "text": "All participants, with or without asymptomatic ischemic ST-segment responses to treadmill exercise, were evaluated for the development of new coronary events during subsequent biennial visits to the Gerontology Research Center. Coronary events were defined as follows: angina pectoris, myocardial infarction, or coronary death (fatal myocardial infarction or sudden death). The subsequent development of angina pectoris was determined from the subject's response to a standard questionnaire and clinical assessment by a specially trained cardiopulmonary technologist and was made independent of exercise test results. Myocardial infarction was diagnosed by conventional clinical criteria during a subsequent hospitalization or by the development of diagnostic Q waves on the resting ECG (Minnesota code 1:1 or 1:2). For deceased individuals, the cause of death was determined by the consensus of three BLSA physicians after review of the death certificate, hospital records, and autopsy data and communication with subject's family and personal physician as available. Follow-up time for individuals who experienced an event was calculated to the event date. When subjects developed more than one event, only the first event was used and the follow-up analysis was censored after this time, unless otherwise described. For subjects free from coronary events, follow-up time was calculated to their last biennial visit or their death from a noncoronary cause."}, {"section_title": "Statistical Analysis", "text": "Subjects were divided into three groups: group 0 consisted of individuals free of ST-segment changes, group 1 comprised individuals with ST-segment depression Ն1 mm starting during exercise, and group 2 consisted of those with ST-segment shift limited to the recovery period. The following baseline characteristics were compared among the three groups: age, sex, current smoking status (smoker defined by Ն10 cigarettes a day), prevalence of hypertension (blood pressure Ͼ160/95 mm Hg or currently on antihypertensive medication), fasting plasma glucose, body mass index, and serum cholesterol. Duration of exercise, peak oxygen consumption (available in 75%, 85%, and 51% of groups 0, 1, and 2, respectively), maximal heart rate, peak systolic pressure, and rate-pressure product at peak exercise were also compared. Comparisons were made among the three groups by use of 2 , ANOVA, or Kruskal-Wallis tests as appropriate. Adjustments were made for multiple comparisons by the method of Tukey for ANOVA and by least-squares means for the Kruskal-Wallis test. Bonferroni correction was used in comparing proportions. To adjust for differences in follow-up time, coronary events rates were calculated per person-year of observation. The 2 , unpaired t test, or Wilcoxon rank sum test was used when appropriate to compare event and nonevent groups. Multiple logistic regression was used to determine the independent predictors of coronary events in the entire sample. Indicator variables were used to identify differences between groups 1 and 0 and between groups 2 and 0. The 2 test was used to test the hypothesis that there is a difference between groups 1 and 2 in predicting events (ie, a difference in the parameters of the logistic model) compared with group 0. Event-free survival was compared in the three groups by Kaplan-Meier survival analysis by use of the log rank statistic. For all analyses, a two-tailed value of PϽ0.05 was required for statistical significance. All analyses were done with the Statistical Analysis System (SAS Corp)."}, {"section_title": "Results", "text": "Between January 1978 and December 1993, 214 subjects with asymptomatic ischemic ST-segment changes during or after treadmill exercise and 611 subjects (group 0) free of ST changes fulfilled the inclusion criteria. Of these 214, 151 (70.6%) developed ischemic ECG responses during exercise (group 1), whereas 63 (29.4%) manifested ST-segment depression only in the postexercise period (group 2). Baseline characteristics of all groups are presented in Table 1 . Age, sex distribution, the prevalence of smoking and hypertension, fasting plasma glucose levels, body mass index, and serum cholesterol were similar in groups 1 and 2, whereas individuals in group 0 were younger and had a lower level of cholesterol, a lower prevalence of hypertension, but a higher percentage of current smokers compared with the other two groups. With regard to exercise test variables (Table 2) , the two groups with ischemic ST changes were similar, but compared with subjects with no ECG changes, both groups had a shorter duration of exercise, lower maximal heart rate, and lower peak oxygen consumption but higher peak systolic blood pressure. Both the lower maximal heart rate and peak oxygen consumption in groups 1 and 2 versus group 0 are explicable by the respective 17-and 19-year age differences. 19 The peak rate-pressure product was similar among groups. Groups 1 and 2 also did not differ with regard to heart rate (158Ϯ17 versus 152Ϯ22 bpm, PϭNS), systolic blood pres-sure (181Ϯ29 versus 179Ϯ36 mm Hg, PϭNS), or ratepressure product (28 369Ϯ5195 versus 27 396Ϯ5734, PϭNS) in the immediate postexercise period.\nIt is noteworthy that only 6% of exercise tests in group 1 were submaximal (defined either by failure to achieve 85% of predicted maximal heart rate or a Borg perceived exertion rating Ͻ15) versus 23% in group 2 (PϽ0.01). When those subjects with submaximal effort were removed from the analysis, the results for groups 1 and 2 remained similar. By study design, group 0 contained no subjects with submaximal tests. Five individuals (3.3%) in group 1 and 1 (1.6%) in group 2 were receiving ␤-blockers for hypertension. Calcium channel blockers for hypertension were used by 4 subjects, all from group 1.\nDuring a mean follow-up time of 9 years, 55 subjects experienced a coronary event: 21 (3.4%) in group 0, 22 (14.6%) in group 1, and 12 (19.7%) in group 2 (Pϭ0.001; Table 3 ). A total of 29 cases of angina pectoris, 15 nonfatal myocardial infarctions, and 11 coronary deaths were distributed among the groups as follows: 5 cases of angina pectoris, 10 nonfatal myocardial infarctions, and 6 coronary deaths in group 0; 16 cases of angina pectoris, 4 nonfatal myocardial infarctions, and 2 coronary deaths in group 1; and 8 cases of angina pectoris, 1 nonfatal myocardial infarction, and 3 coronary deaths in group 2. In group 0, 1, and 2, there were 0, 3, and 5 individuals, respectively, who experienced more than one end point; ie, after developing angina pectoris as the initial manifestation of coronary artery disease, they later developed myocardial infarction or coronary death. Coronary revascularization was performed after the initial event in 5 subjects in group 0 (3 with angina pectoris and 2 with infarction), 7 subjects in group 1 (all with initial angina) and 4 subjects in group 2 (1 with angina and 3 with infarction). Table 3 compares the incidence of coronary events between groups. Because there were group differences in median follow-up duration (8.9, 4.5, and 12 years for groups 0, 1, and 2, respectively; Pϭ0.0001 for groups 1 and 2 versus group 0 and PϽ0.05 for group 2 versus group 1), the coronary event rates were also calculated per person-year. This analysis verified that event rates were higher in groups 1 and 2 compared with group 0 but were similar between groups 1 and 2. Although hard events (myocardial infarction or coronary death) tended to appear more often in group 2 versus group 1, adjustment for person-years of follow-up eliminated this difference. However, the incidence of hard events was significantly higher in both groups compared with group 0. When group 1 was stratified by median onset time of ischemic ST-segment changes during exercise (median, 7 minutes), the incidence of future coronary events was higher in the early-onset subgroup (21% versus 7%, Pϭ0.02). These subgroups did not differ with regard to age, cholesterol level, body mass index, maximal heart rate, or ST depression, but subjects with late onset of ST-segment depression had greater exercise duration, peak oxygen consumption, peak systolic blood pressure, and rate-pressure product than those with earlier onset of ST-segment changes. Table 4 compares clinical and exercise test variables between the subset of subjects who developed a coronary event versus those who remained event free, regardless of exercise test results. As shown in the table, age, prevalence of hypertension, serum cholesterol, and peak systolic blood pressure were higher, whereas duration of exercise, maximal heart rate, and VO 2peak were lower in the subset who experienced a coronary event compared with those who did not. In contrast, sex distribution, smoking prevalence, fasting blood glucose, and body mass index were similar in the two subsets, as was rate-pressure product at exhaustion.\nTo determine the independent predictors of future coronary events, we constructed a multiple logistic regression model with age, sex, serum cholesterol level, smoking status, prevalence of hypertension, and onset time of ST-segment changes (exercise versus recovery). Maximal heart rate during exercise, duration of exercise, and peak VO 2 were not included because of their high correlation with age (rϭϪ0.75, Ϫ0.61, and Ϫ0.57, respectively). The full model was strongly predictive of future events ( 2 ϭ99.9, Pϭ0.0001). As shown in Table 5 , age, cholesterol, and ST-segment depression Ն1 mm were positive independent predictors of future coronary events, whereas male sex, smoking status, and hypertension did not reach statistical significance. The probability of experiencing a coronary event was 2.5 times as high in subjects with ischemic ECG changes as in those with a normal exercise ECG. Most importantly, the onset time of ST-segment changes (ie, exercise versus recovery) did not influence future prognosis in this model ( 2 ϭ0.05, PϭNS). A survival analysis (see Figure) confirmed the adverse effect of ST-segment depression, regardless of time of onset, on future coronary event risk. When onset time of ST-segment depression during exercise was further stratified into early and late subgroups, no independent effect of onset time was found by multiple logistic regression analysis."}, {"section_title": "Discussion", "text": "In a prior study conducted in our laboratory on apparently healthy BLSA volunteers, we showed that an ischemic ST-segment response to treadmill exercise is associated with a nearly threefold relative risk of future coronary events, independent of conventional risk factors. 1 The present study, encompassing a larger sample of the same asymptomatic BLSA population, confirms previous findings and extends them to indicate that ischemic ST changes developing during recovery from exercise have adverse prognostic significance similar to those appearing during exercise. By multiple logistic regression analysis, older age, higher serum cholesterol, and ST-depression induced by exercise testing but not the onset time of ischemic ST-segment changes (exercise Event-free survival for groups 0 (normal exercise tests), 1 (ischemic ST response during exercise), and 2 (ischemic ST response limited to recovery). Survival curves for groups 1 and 2 are similar but lie significantly below that of group 0. versus recovery) are independent predictors of coronary events during a mean follow-up of 9 years. The concept of exercise screening for the prediction of future coronary events in apparently healthy populations has received considerable attention. 1-12,20 -22 Numerous studies have demonstrated that asymptomatic subjects with exerciseinduced ischemic ST-segment depression have a severalfold higher risk of future coronary events than those with negative exercise ECGs. [1] [2] [3] [4] [5] [6] [7] [8] [9] [10] [11] [12] These findings have led to the practice of performing exercise testing to screen middle-aged and older adults, especially those with a high coronary risk profile. In these surveys, the predictive value of an ischemic STsegment response for future coronary events ranged from 5% to almost 40%. Such wide variation is probably due to the inclusion of different outcome criteria (ie, inclusion of \"soft\" events, such as angina pectoris, versus hard events, such myocardial infarction or cardiac death, only) and population differences in CAD prevalence. In the present study, angina was the presenting event in approximately half of the cases, consistent with findings from McHenry et al, 9 Erikssen and Thaulow, 22 and others. In a pooled analysis comprising nearly 20 000 individuals from 10 studies, Detrano and Froelicher 23 found that ischemic ST-segment depression induced by exercise testing had a 20% predictive value for future events. In that analysis, however, the prognostic significance of STsegment changes limited to recovery versus those appearing during exercise was not assessed. Given the general absence of hard data, it has been proposed that ischemic ST changes appearing after cessation of exercise are more likely to be false-positive compared with those developing during exercise. 24 Over the last 20 years, only a few studies have addressed the diagnostic or prognostic value of ischemic ST-segment changes appearing after cessation of exercise. [13] [14] [15] [16] 25 However nearly all of them were limited to symptomatic populations and examined only the angiographic prevalence of CAD. [13] [14] [15] Karnegis and colleagues 14 examined 328 subjects with a history of a myocardial infarction and a blood cholesterol level of Ն220 mg/dL who had exercise-induced ischemic ST-segment changes during treadmill exercise or recovery. There were no significant differences in baseline characteristics and hemodynamic variables between subjects with onset of ST changes during recovery versus during exercise. Both groups had similar severity of CAD, with positive predictive values for coronary artery disease near 90%. Savage et al 15 evaluated 62 subject with suspected CAD who experienced ischemic ST-segment depression limited to the postexercise period. In the subset of subjects with positive thallium scans, the positive predictive value for angiographic CAD was 96%. Ellestad 25 reported that in 308 symptomatic subjects with ischemic ST changes starting 3 to 8 minutes after exercise cessation, these ischemic ECG changes were a definite but a weak predictor of subsequent coronary events. In subjects with suspected CAD, Lachterman et al 13 found that ischemic ECG changes limited to active exercise time or prolonged into recovery period had almost the same predictive value (87% versus 84%, respectively) for angiographic coronary artery stenoses Ͼ75% as ST-segment depression that developed after exercise. Neither clinical characteristics nor exercise test variables were significantly different between those with ST changes limited to recovery and those with changes starting earlier.\nTo the best of our knowledge, only one prior study has examined the significance of recovery-onset ST-segment depression versus ST depression appearing during exercise in apparently healthy subjects. Among 140 young, asymptomatic, male aircrew with ischemic ECG changes induced by exercise testing, 36% of subjects developed ST-segment changes limited to recovery. 16 In the 111 male aircrew with a positive exercise ECG who underwent cardiac catheterization, the positive predictive value for angiographic coronary stenosis Ͼ50% was 28% for subjects with changes limited to recovery versus 33% for subjects with onset of ST-segment changes during exercise (PϭNS). Over a mean follow-up of 6.3 years, the positive predictive value for future coronary events for individuals with \"recovery-only\" ST-segment depression was 12% versus 24% for those with onset of ST segment changes starting during exercise (PϭNS). However, these results may not be representative for the general population, because the study group was limited to young men and ECG changes were analyzed only in one lead. On the contrary, our study included both sexes across a wide range of ages and analyzed multiple ECG leads, allowing extrapolation to the broad spectrum of apparently healthy individuals likely to undergo screening exercise tests.\nThe prevalence of recovery-onset ischemic ST-segment changes appears to be higher in asymptomatic populations compared with those with symptomatic CAD. Among individuals with suspected CAD, the prevalence of postexercise ischemic ECG changes reported by Savage et al, 15 Karnegis et al, 14 and Lachterman et al 13 was 3%, 6%, and 16%, respectively. However, in asymptomatic subjects, the prevalence was 36% in the young male aircrew members described by Froelicher et al. 16 In our study, individuals with postexercise ST-segment depression constituted 29% of the entire sample. Thus, ischemic ST-segment responses limited to recovery period from exercise comprise approximately one third of abnormal exercise ECGs in asymptomatic populations, a much higher proportion than observed in those with clinically manifest CAD.\nThe mechanisms for the onset of ischemic ST-segment depression during recovery from treadmill exercise are unclear. In our sample, all baseline characteristics and exercise tests variables such as duration of exercise, maximal heart rate, peak systolic blood pressure, peak rate-pressure product, and VO 2peak were similar in both groups with ischemic ST changes. Thus, a lack of diagnostic ST-segment changes during exercise cannot be ascribed to inadequate effort, except perhaps in the 23% of group 2 subjects with submaximal tests. Other authors 13,14 also failed to find significant differences in these variables between symptomatic patients who developed ischemic ST-segment changes during exercise versus recovery.\nOne possible mechanism for the initial appearance of ischemic ST-segment changes during recovery is augmentation of plasma catecholamines in the early postexercise period. 26, 27 Higher catecholamine levels could augment myocardial oxygen demand by increasing myocardial contractil-ity, even as rate-pressure product decreases. In addition, the postural change from erect during exercise to supine or sitting during recovery may augment left ventricular preload, which could facilitate subendocardial ischemia by increasing wall stress. 15 Furthermore, the decline in diastolic blood pressure during recovery reduces the myocardial perfusion pressure gradient and may impair subendocardial blood flow.\nIn summary, the present findings indicate that in an asymptomatic population, ischemic ST-segment changes that begin after cessation of exercise have an adverse prognostic significance for future coronary events similar to that for ST changes appearing during exercise. Both patterns of ST changes presaged an Ϸ2.5-fold independent risk for future coronary events compared with individuals with a normal exercise ECG. Thus, how one recovers from exercise appears to be as important as how one performs it."}]