[{"section_title": "Abstract", "text": "In the past decades, income inequality has risen in most developed countries. There is growing interest among economists in international comparisons"}, {"section_title": "", "text": "However, as the currently available internationally comparable education data are all cross-sectional, the emerging international research cooperation aims to render domestic longitudinal data for children as comparable as possible, to gain insights into the differences in the degree of the effects of family resources on educational inequality, and the associated policy implications (Ermisch, Jäntti, & Smeeding, 2012a; Smeeding, Erikson, & Jäntti, 2011 )."}, {"section_title": "Aim of the Present Paper: Educational Mobility in Japan Using Longitudinal Data", "text": "Japan should not be an exception to this cooperation, as Japan also faces concerns about increasing inequality. Although previously considered to be an equality-oriented society, research over the past 15 years has found emerging and increasing inequality in Japanese society (Tachibanaki, 2006) .\nThe widening gap in children's and students' academic ability has recently been identified as a serious problem in Japan (Park & Lee, 2013) . Household socioeconomic factors have been highlighted as a possible explanation for this widening gap. In previous surveys of academic ability, a child's academic ability was found to be affected by his or her parents' educational attainment and income (Kariya & Shimizu, 2004) . The percentage of questions answered correctly by children who did not study anywhere outside of school was also found to be low. It has been suggested that the impact of school teaching on a child's academic ability has decreased, whereas the impact of the child's home environment has increased (Kariya, 2008, p. 37) . A recent study based on the National Assessment of Academic Ability, a nation-wide cognitive test of Japanese and mathematics that assessed children in grades 6 and 9, found that parental income and education had a positive association with both scores in both grades (Hamano, 2014) .\nAs the home environment has an influence on children's academic ability, recent social changes such as increasing socioeconomic inequality and poverty may have resulted in the Source: Reproduced from Corak (2013) with permission. Figure 1 Great Gatsby Curve accelerated decline in academic ability and the widening academic ability gap across households with different family backgrounds. Therefore, to address the issues of the decline in academic ability and the increase in academic ability gap, it may be important to clarify the impact of household socioeconomic factors such as parents' educational attainment and income on children's academic abilities, as well as the dynamic process of this impact.\nThe importance of using longitudinal data to examine the role of family resources in shaping children's educational outcomes has long been recognized. For example, Carneiro and Heckman (2003) provided an early account of how educational inequality, such as test scores, evolved during child development across income groups in the United States. More recently, Duncan and Murnane (2011) documented the changes in the relationship between socioeconomic status (SES) of families and an array of children's educational and social outcomes such as test scores, academic achievement, and behaviors and attitudes of children over their lifecourse and over generations.\nHowever, in Japan, the lack of longitudinal data for children's academic and non-academic outcomes has hindered researchers in comprehensively investigating dynamic interrelationships between family, educational investment, and children's outcomes. The present paper aims to make three contributions. First, we introduce the Japan Child Panel Survey (JCPS), Japan's first longitudinal survey of school-age children, including cognitive and non-cognitive measures and plentiful household information. We conceived, designed, and developed this dataset with the help of many other researchers, in order to measure the dynamic interrelationships between children's academic and social outcomes, their family background, and local policies and environments. We also explain the survey design of the JCPS that makes the dataset potentially comparable to major datasets available in other developed countries, and the construction of key variables used in the present analyses.\nSecond, we present some of our recent findings on the dynamics of inequality using multiple indicators of children's educational and behavioral outcomes based on the JCPS.\n2 Previously, Akabayashi et al. (2013) presented evidence of the correlation between a child's attributes and home environment and that child's academic abilities. In the present paper, taking advantage of the recent accumulation of multiple observations of the same children, we take the analysis a step further and examine the dynamics of the correlations between family socioeconomic conditions and children's academic outcomes. We also compare our results with those from other countries, and provide a brief discussion about the differences and similarities, as well as the issues involved in international comparisons of this kind.\nFinally, we discuss some issues underlying the globalization of education research, based on our JCPS experiences. We consider the growing interest in international comparisons of economic and educational mobility, and discuss possible reasons and strategies for further globalization of education research in Japan. We also suggest several potential future directions for Japanese education research, to allow better international comparisons of the economic and educational mobility of children."}, {"section_title": "Japan Child Panel Survey: Design and Measurement", "text": "The JCPS is a longitudinal parent-child The JCPS participants were parents of children enrolled in elementary school (grades 1-6; aged 6-12 years) or junior high school (grades 7-9; aged 12-15 years), as well as the children themselves. The PDRC conducts JCPS surveys with the JHPS and KHPS adult samples on alternate years.\n3 Participants in the JHPS 2010 were invited to participate in the first JCPS survey (2010). The second JCPS survey (2011) targeted participants from the KHPS 2011, the third JCPS survey (2012) targeted participants from the JHPS 2012, and the fourth JCPS survey (2013) involved participants from the KHPS 2013.\n4 Figure 2 summarizes the JCPS, JHPS, and KHPS timeline structure. Table 1 shows the potential number of households/children who could participate in the JCPS, the number of households/children who actually participated, and the response rates by household and child units, respectively.\nThe JCPS survey consists of separate children's and parents' forms. The children's form includes basic academic ability tests in Japanese and mathematics , logical reasoning tests, and a questionnaire relating to school, studies, and subjective quality of life (QOL). The exam questions for Japanese and mathematics tests differed for each grade. 5 The same academic ability test batteries were used in each of the different JCPS years. Children were asked to complete the academic ability test by themselves within 20 minutes, and then to complete the questionnaire independently. The questionnaire included questions on afterschool activities, favorite and least favorite study subjects, school life, and homework situation. The instructions specified that the child him/herself should immediately seal the completed survey form using the enclosed seal and then hand it to his/her parent. Parents completed the same questionnaire irrespective of their child's grade. The parent's questionnaire included items such as the type of school that their child attended, the size of the child's class, experience with entrance examinations for private or national schools, the time the child spent studying, the actual household expenditure on education, parenting style, and their child's socialization and problem behaviors. Parents who had two or more children in the survey were asked to respond to an individual questionnaire for each child.\nThe children's outcome variables analyzed were: Academic ability test scores for Japanese and mathematics (cognitive ability), and questionnaire scores for behavioral difficulties (non-cognitive ability). The Japanese test consisted of vocabulary, and reading and writing of kanji characters. The mathematics test consisted of calculations and word problems concerning numbers and the manipulation of figures. The reliability and validity of the academic ability test was verified elsewhere (for details of the academic ability test, see Shikishima et al., 2013) . The internal consistency of each grade's test using Cronbach's α ranged from 0.84 to 0.94 (Mean = 0.88) for Japanese and 0.76 to 0.93 (Mean = 0.87) for mathematics.\nChildren's behavioral difficulties were assessed based on parental responses to the Strengths and Difficulties Questionnaire (SDQ) (Goodman, 1997) for each child. The SDQ is a 25-item Likert-style psychometric scale that asks parents to rate children's difficulties on four subscales: emotional symptoms, conduct problems, hyperactivity/inattention, and peer relationship problems. Each subscale is measured with five items, with the sum of the five items forming the subscale score. The total difficulties score is derived from the sum of the subscales (based on 20 of the 25 items). This questionnaire has been used by Japan's Ministry of Health, Labour, and Welfare as a continuous variable scale to screen children for problematic behaviors and to identify mild developmental disorders (Matsuishi et al., 2008) . The reliability and validity of the scale has been confirmed (Stone, Otten, Engels, Vermulst, & Janssens, 2010) . The internal consistency for the total score of our sample (Cronbach's α) was 0.77. Individual-level datasets from the JCPS, JHPS, and KHPS are available to international researchers for general research purposes. Currently, children over 18 years of age who formerly participated in the JCPS are being resurveyed, with a variety of social, economic, and psychological outcomes to be measured. These data will be incorporated into the current JCPS data files, to allow empirical clarification of how the developmental process and school age family environment affect the individual's later outcomes in adolescence and adulthood."}, {"section_title": "Empirical Analysis of Cognitive/Non-cognitive Achievement and Family Background", "text": "At the time of the present analysis, we had only two waves of survey data for all cohorts of children. Therefore, we pooled the cohorts and analyzed changes in the distribution of outcome variables across groups over the two waves. To overcome the small sample size, we pooled children of two grades to form groups to compute average outcomes. For example, the distribution of outcomes for children in grades 1-2 across groups was compared with the distribution of outcomes two years later (outcomes for grades 3-4). Therefore, we had three different groups of children: grades 1-2, 3-4, and 5-6 in the base year, with a two-wave panel structure. This formed the basis of our sample data.\nThe outcome variables of interest were (1) cognitive test scores (Japanese and mathematics), and (2) non-cognitive questionnaire scores (SDQ total difficulty score). For the cognitive measures, we converted the individual total test scores to factor scores using categorical factor analysis. 8 We also applied standardization at grade level whenever possible for the purpose of comparability.\nWith regard to the test scores, we first examine the dynamics of the test scores across households with different levels of income. We then examine the 2-year mobility of test scores. Finally, we present the results of the association between the total difficulty score and parental education background.\nFor household income groups, we used household gross income quartiles surveyed in the base year of the 2-year panel structure. For parental education background, we used the International Standard Classification of Education (ISCED) to achieve comparability across countries. Any international comparison using different national data sources has obvious limitations, and difficulties and possibilities are noted whenever applicable. In the present paper, we present selected results that demonstrate the value of the JCPS in terms of its comparability to the results from other countries reported in Ermisch, Jäntti, & Smeeding (2012a) : the United Kingdom, the United States, Australia, and Germany. We describe the details of the data sets in those countries in the Appendix. Among these surveys from other countries, the German data set is similar to the JCPS in that their children sample is supplementary to national representative household panel data. However, the detailed children questionnaire is conducted only for the sample born in 2002 and 2003. Therefore, it is virtually a \"cohort survey\" designed to follow up (typically every 2 or 3 years) a cohort of children born in a particular range of birth dates. The data from the United Kingdom, the United States, and Australia, are also cohort surveys.\nThe relatively small sample size of the JCPS precludes the strategy of following a particular birth cohort; it is a disadvantage of the JCPS that researchers are not able to focus on a particular cohort of sufficient sample size. On the other hand, all new children in the pre-determined age range of the JCPS can automatically become survey targets, and the sample size for each age is expected to increase as the survey progresses, although they belong to different cohorts."}, {"section_title": "Dynamics of Cognitive Test Score Inequality", "text": "Figure 3 (1) shows the dynamics of the average Z-scores 10 for Japanese and mathematics tests for the top and bottom income quartiles for the grade-based groups of children (grades 1-2, grades 3-4, and grades 5-6) in the JCPS base survey year. The vertical axis shows standardized Z-scores and the horizontal axis the groups of children. The lines are connected for children in the same family income quartiles in the same grade-based group."}, {"section_title": "11", "text": "This indicates that the test score gap tends to widen across income groups over grades. The pattern of the changes is similar for the Japanese and mathematics scores, with a negligible score gap for children in grades 1-2, but a widening gap toward grades 3-4 that continues to Source: (1) Akabayashi, Naoi, & Shikishima (in press) . (2) and (3) Authors' calculation based on Magnuson, et al. (2012, Table 10.4-5, 10.8-9, pages 248-249, 254-255) . Note: Data for Japan is the Japan Child Panel Survey (JCPS), data for the United Kingdom is drawn from the Avon Longitudinal Study of Parents and Children (ALSPAC), and data for the United States is drawn from the Early Childhood Longitudinal Study, Kindergarten Cohort (ECLS-K). The vertical axis measures the Z-score of cognitive test outcomes. widen, albeit to a lesser extent, toward grades 5-6. However, the gap tends to shrink toward grades 7-8. The score gap between the top and bottom income quartiles is the widest at grades 5-6.\nIn comparison, Figures 3 (2) and (3) show the dynamics of the test scores for reading and mathematics for income quintile groups constructed from longitudinal data from the United Kingdom and United States (Magnuson, Waldfogel, & Washbrook, 2012) . Although exact comparability across different countries is not possible because of differences in the test items, the similarities in the test score gaps across income groups between the two countries are interesting, and the gap appears to be more stable across the ages than in Japan. Moreover, the gap appears to increase continuously from 7 years of age toward 14 years of age, especially in the United Kingdom. This differs from Japan, where the gap appears to narrow around ages 11 to 14.\nMagnuson Waldfogel, & Washbrook (2012, p. 257 ) provide a suggestive discussion of the underlying reasons for the sharply widening income gradient after age 11 in the United Kingdom as follows: \"(In the United Kingdom), secondary schools vary widely in quality and academic orientation…, whereby affluent parents exploit residential location or the ability to navigate a complex admissions system….., such sorting is disequalizing, increasing the gradients present when children left primary school., and to a greater extent than occurs in the United States.\" Between Japan and the other two countries, there are potentially more social and institutional differences than between the United Kingdom and United States, making immediate interpretation extremely difficult. One candidate is the existence of the nation-wide high school entrance exam which is standardized at prefecture level and virtually serves as the \"exit exam\" at age 15, since more than 98 percent of junior high school graduates actually advance to high school in Japan as of 2013. Proving whether this is the major reason for the cross-country differences in Figure 3 requires more detailed analysis of the effects of national education policies in each country. Figure 4 shows graphical images of the transition matrix of cognitive outcomes for two years in three countries: Japan, the United Kingdom, and Australia. The Japanese figure was created for children who were in grades 7-8 in the base year. We calculated the 4 × 4 transition matrices for Japanese and mathematics test scores, and used the average of the two transition matrices for the figure for comparability to the other two countries. Figure 4 (1) shows the two-year transition probabilities from the first (bottom) quartile to each quartile, and Figure  4 (2) shows the same transition probability from the fourth (top) quartile to each quartile. The United Kingdom (age 7 years) and Australia (ages 6 to 7 years) figures were drawn from Blanden, Katz, and Redmond (2012) . At a glance, the curves are strikingly similar across the countries, although the dataset in each country includes different test items. The transition probability to remain in the bottom quartile ranges from 46.2% to 55.9%, with the United Kingdom showing the highest persistence. The transition probability to remain in the top quartile ranges from 45.9% to 52.0%, and again the United Kingdom shows the highest persistence. Blanden, Katz, and Redmond (2012, p. 159-160) argue that \"It is possible that the United Kingdom performs more poorly in spite of its more targeted policy interventions because social and economic inequalities have traditionally been higher in the United Kingdom than in Australia…We could infer that the negative influence of high inequality has more of an effect on the United Kingdom than the recent policy focus on the early years.\" Japan's similarity to both countries may not be surprising if short-term mobility of test scores are greatly determined by the child and family fixed effect. Much research remains to be done in this area by using additional information regarding the national school education policy such as the distribution of qualified teachers and the standardization of the school curriculum. Figure 5 shows the mean Z-scores for the SDQ total difficulty score (a negative value is more desirable) by parental education and parental income quartiles for Japan. Comparable figures were created for the United Kingdom, and for Germany by Ermisch, Peter, & Spiess (2012b) . 12 The comparability of outcome variable is maintained as all countries used similar questionnaires."}, {"section_title": "Correlation Between Difficulty Scores and Parental Education", "text": "13 To maintain the comparability of parental education level across different higher education institutional settings, we followed Ermisch et al. (2012b) , and defined four education level categories in Japan using the UNESCO-ISCED classification table. 14 We found that the mean standardized difficulty scores by parental education are similar across the three countries, with the gap being the largest in the United Kingdom and the smallest in Japan. The average scores by parental income in Japan show a different structure from those in the United Kingdom and Germany. The mean scores show a monotonic decline as the level of parental income increases in the two European countries. However, the mean scores in Japan are not monotonically related to parental income levels, and the score gap between income groups is smaller for Japan. This suggests that economic condition seems less important than parental education in terms of the effect on children's problematic behavior in Japan."}, {"section_title": "Growing Importance and Current Limitations of International Comparison of Educational Mobility", "text": "Several factors have influenced the increasing interest among economists in international comparisons of economic and educational inequalities.\nFirst, there is growing interest in the role of institutions as a factor affecting economic and social outcomes. Traditional neoclassical economics has relied heavily on the prototypical model of the market, applying it as an approximation to countries with different cultures and historical backgrounds and using predictions from the prototypical model as a benchmark. However, researchers have increasingly noted that institutions have a key role in determining differences in the economic development across countries (Acemoglu & Robinson, 2012) .\nSecond, the internationally comparable education data initiated by TIMSS and PISA has been successful, allowing researchers to examine cross-country studies of the performance of different educational institutions as factors that potentially determine economic performance (Hanushek & Woessman, 2015) .\nThird, as a logical consequence of the first and second points, economists in the United States have started to direct more attention to educational systems and performance in other countries.\nCurrent international comparisons of educational mobility and dynamics use longitudinal data from different countries with different test items and survey questionnaires. This has obvious limitations and potentially invites severe criticism. Our analysis has made it clear that it is not possible to create perfect comparability across countries using different national survey questionnaires and test items. However, economists, while noticing these weaknesses, tend to take an \"incremental approach,\" and \"boldly\" compare scores from different test items and variables from slightly different questions. In other words, economists working on international comparisons tend to place more weight on finding thought-provoking new evidence or empirical puzzles that can stimulate the development of new theoretical frameworks or data sets than on Source: Akabayashi, Naoi, & Shikishima (in press), calculated using the Japan Child Panel Survey. Note: Ages of children were 7 to 8 years. The vertical axis measures the standard deviation unit of the total difficulty score of Strengths and Difficulties Questionnaire (SDQ; positive value means more difficult). Researchers in this field tend to believe that the gain from imperfect comparison outweighs the loss from lack of practice. For example, in a recent volume that collected analyses of crosscountry data for children, Ermisch, Jäntti, Smeeding, and Wilson (2012c) note that A set of comparably designed national studies of this type can reveal how family resources are correlated with individual outcomes at various points during the early life course, and may be able to shed light on the structural differences that moderate intergenerational mobility in different ways in different countries. Another advantage ... is that genetic transmission in the outcome (for example, cognitive ability) should be the same across countries, and so crosscountry differences should reflect different environments, policy and otherwise. (Ermisch et al. 2012c, p. 11) "}, {"section_title": "Agenda for Future Research in Japan", "text": "For Japanese education researchers, what are the positive purposes for challenging international comparisons? This question may best be answered by considering three separate stages.\nAs in any comparative study, the first step is to incorporate outside perspectives of the state of education in Japan. There have been many studies for this purpose (Omomo, Inoguchi, Ueda, & Uesugi, 2007; Shimizu & Yamada, 2015) . The second step is to attract non-Japanese researchers to undertake quantitative research on Japanese education. Japan should be an attractive country to study as it is continuously ranked in the top tier of international educational achievement tests. Through attracting international researchers, Japanese researchers learn about recent quantitative methods, which in turn stimulate policy makers to create new datasets and experimental policies. The third step is to share the quantitative evaluation of Japanese education and policies with other countries, and thereby use it to improve education policies in Japan and other countries. Japan has not yet accomplished the second stage.\nSeveral previous studies have noted the uniqueness and effectiveness of non-Western education systems and teaching styles. Until the mid-1990s, Japan attracted many education researchers with its distinctive education tradition of family and school organization (Lewis, 1995; Stevenson & Stigler, 1992; Tobin, Wu, & Davidson, 1989) . However, these have been predominantly studied with anthropological or participatory methods, and their influence is limited to open-minded educational practitioners. Often, they are treated as a good \"case study\" that provides some reflections for traditional Western education practices, but not overarching policies.\nRecent trends in the United States, backed by a growing awareness of institutions and comparable data, are making an impact on countries previously overlooked in the research community. The OECD has published several detailed reports using PISA data to compare the results of selected high-performing countries (OECD, 2012b) . In addition, journalists have started to take serious note of previously neglected countries such as Poland (Ripley, 2013) .\nGlobalization is expected to accelerate through the power of the Internet and big data, and the international research and policy community has assumed the use of the Internet and easy access to education big data. In the era of quantitative research, with the exception of some notable publications (OECD, 2011b; , Japan seems to have faded from international comparisons of the performance of education policies.\nOur discussion suggests the following steps to achieve the second stage of the globalization of education research.\n1. Education research in Japan should use language that is common and internationally interpretable. 2. Data and general information about Japanese school and education policies should be made easily accessible in English on the Internet. 3. More weight should be placed on the use of economic frameworks, data, and quantitative methods as a common language in education research and policy debates.\nRecently, education researchers have criticized the state of Japanese education research for its frequent use of technical terms and concepts that are not easily shared with other fields.\n15 A similar argument can be applied to international education research collaboration. Japan remains an \"invisible\" country in terms of education research in the Internet era, because of the paucity of basic information about education policies, laws, and states of schools available in English. For example, the official English language websites for governmental education policies often lack information compared with the official Japanese websites. 16 Many PISA reports have highlighted that basic economic and quantitative methods play the role of a common language in evaluating the state of education and policies in different countries. There is much to be gained for education researchers and policy makers if they acquire basic knowledge of economic frameworks and statistical modeling.\nOur study of economic and educational mobility using JCPS data highlights the importance and challenges for the Japanese research community in participating in international comparisons in the economics of education. The JCPS is in its early stages, and there is much room for improvement to allow better comparability with international data. We wish to continue to make this database larger and more reliable for research on economic and educational mobility, which will involve more people from different fields. However, it should also be noted that the data is just one of the necessary conditions. To compare and share the strengths and weaknesses of the Japanese education system with the global community, further movement of the research community and policy makers toward globalization is necessary.\nincluding the JCPS. 2. Some of these results are presented in our forthcoming monograph, Akabayashi, Naoi, & Shikishima (in press ). 3. The JCPS structure is similar to the Children of National Longitudinal Survey of Youth. 4. For an overview of the JCPS 2012, see Shikishima (2013) . 5. Therefore, the test scores are not comparable across grades. We are planning to make grade-standardized test scores using item response theory (IRT) in future. 6. The JCPS also measures educational investment by the parent, including monetary expenditure in several categories (tuition, allowances, and extra-curricular study costs); frequency of the child's extra-curricular activities (arts, sports, study excluding cram school, and cram school). There are other behavioral and health outcomes such as hours of study (answered by the parent), height and weight at present and at birth. The JCPS also includes the subjective QOL of children enrolled in grades 3 and beyond through self-report. See Akabayashi, Naoi, & Shikishima (in press) for analyses using these variables. 7. The JCPS 2010-2012 files are currently available with questionnaires in English. See http://www. pdrc.keio.ac.jp/en/ for detailed information. 8. For details of the academic ability test score, see Shikishima et al. (2013) . 9. As the sample weights of children were not available at the time of writing, our mobility calculation was based on the raw distribution of our sample. 10. Individual factor scores were transformed to Z-scores, with a mean of 50 and a standard deviation of 10. 11. An alternative choice is to define the quartiles based on the contemporaneous income level, which has an advantage in being applicable to both cross-section and panel data and in precisely reflecting the contemporaneous income inequality. Our current definition exploits the structure of the panel data, and has the advantage of confirming unobserved household and child characteristics. 12. The ages of the children in the United Kingdom and Germany were 5 and 6 years, whereas we used children aged 7 and 8, the youngest children in the JCPS. The figures for the two countries in Ermisch, Peter, & Spiess (2012b, Figures 5.3-4, pages 129-130) are available at https://www.russellsage.org/publications/parents-to-children. 13. Ermisch, Peter, & Spiess (2012b, p.126) , however, note that the German data used only 13 items out of 20 SDQ questions to construct the difficulty score. 14. http://www.uis.unesco.org/Education/ISCEDMappings/Pages/default.aspx 15. Hirota (2007) criticized education research in Japan as using jargon difficult for professionals in other fields to understand. 16. As of the time of writing (September 5, 2015) , the official English site of Japan's Ministry of Education, Culture, Sports, Science and Technology (http://www.mext.go.jp/english/) had 809 pages, compared with a total 208,000 pages on the official Japanese website (http://www.mext.go.jp/). The Tokyo Metropolitan Board of Education, the district with the largest non-Japanese population, had only 28 English pages out of a total 19,300 pages."}, {"section_title": "Appendix", "text": "In this appendix we provide a brief description of the longitudinal data of children from the United Kingdom, United States, Australia, and Germany used in Blanden, Katz, and Redmond (2012) , Ermisch, Peter, & Spiess (2012b) , and Magnuson, Waldfogel, & Washbrook (2012) .\nThe UK data were drawn from the Millennium Cohort Study (MCS) and Avon Longitudinal Study of Parents and Children (ALSPAC). The MCS is a national longitudinal birth cohort study that follows approximately 19,000 children born in the United Kingdom between 2000 and 2002 (Plewis, 2007) . Various demographic, educational, psychological, and health variables have been collected through interviews, questionnaires, assessments, and physical measurements for children and parents (Johnson, 2012) . ALSPAC, supported by the University of Bristol, recruited more than 14,000 pregnant women in the Bristol area with estimated dates of delivery between 1991 and 1992 (Golding, Pembrey, Jones & The ALSPAC Study Team, 2001) . From early pregnancy the children and parents have been followed up to investigate how the physical and social environments interact with genetic influences to affect children's health, behavior and development. The data collection method includes questionnaires for mothers, their partners, children, and teachers; hands-on assessments; collection of biological samples,;and linkage to educational and medical records.\nThe source of the US data is the Early Childhood Longitudinal Study, Kindergarten Cohort (ECLS-K), maintained by the U.S. Department of Education's National Center for Education Statistics (Tourangeau, Nord, Lê, Sorongon, Najarian, & Hausken, 2009 ). Children entering kindergarten in the fall and spring of the 1998-1999 school year were recruited from both public and private kindergartens, and 21,260 kindergartners throughout the United States participated in the study. ECLS-K focuses on children's early school experiences beginning with kindergarten and ending with eighth grade, employing interviews with parents, the collection of data from principals and teachers, and student records abstracts, in addition to direct child assessments and children's self-completed questionnaires.\nThe data for Australia is based on the Longitudinal Study of Australian Children (LSAC). Funded by the Australian Government Department of Social Services, LSAC has followed the development of 10,000 children and families from around Australia \"to provide data that enable a comprehensive understanding of development and life-course trajectories within Australia's current social, economic and cultural environment\" (Australian Institute of Family Studies, 2014). The study consists of two cohorts: families with 4-5 year old children (born between March 1999 and February 2000) and families with 0-1 year old infants (born between March 2003 and February 2004) . Data were collected from parents, children, carers or teachers, and interviewers. The data collection method includes interviews, self-completed questionnaires, physical measurement of the child, assessment of the child's vocabulary and cognition, completion of time use diaries, computer-assisted telephone interviews, and linkage to administrative or outcome data.\nThe German data are from the German Socio-Economic Panel Study (G-SOEP), produced by the German Institute for Economic Research (DIW Berlin). G-SOEP is a longitudinal survey following up approximately 11,000 private households in Germany from 1984 to 2013 (Wagner, Frick, & Schupp, 2007) . Information on all household members was collected with a wide range of variables including household composition, employment, occupations, earnings, health, personality, and well-being. Age-specific questionnaires about mothers and children were introduced for birth cohorts of 2002 and 2003, and they were subsequently asked about pregnancy, birth, health, and care situation at ages 0 to 1 in 2003, temperament and activities of children at ages 2 to 3 in 2005, personality, and socio-emotional behavior (modified SDQ) at ages 5 to 6 in 2008."}]