[{"section_title": "Abstract", "text": "The main objective of this study is to present a food environment measure, the Produce Desirability (ProDes) Tool, to assess consumer desirability of fruits and vegetables (FVs) based on generalizable sensory characteristics that can be applied in diverse socio-ecological contexts. We implemented the ProDes Tool in rural and urban built food environments (grocery stores) in 11 counties in the frontier state of Montana, United States, towards elucidating access gaps to desirable produce based on rurality of location. Total ProDes scores were calculated by averaging the five sensory parameters of the tool (overall desirability, visual appeal, touch and firmness, aroma, and size) for individual and total FVs. We statistically analyzed the relationship of ProDes scores by FV type, rurality, Nutrition Environment Measurement Scores for Stores (NEMS-S), and price. Mean Total ProDes scores for all produce was 3.5 (SD = 0.7), or low to moderate, on a 7-point scale (0 to 6). Significant differences (p < 0.0001) in means of Total ProDes scores were found on the basis of rurality with FVs from the rural food environments having lower scores compared to the urban food environments. There was no significant relationship for Total ProDes Scores by NEMS-S Total Scores (p = 0.880; r = −0.019), NEMS-S Availability scores (p = 0.926; r = 0.012), NEMS-S Quality scores (p = 0.457; r = 0.095), and for the majority of NEMS-S acceptable ratings for individual produce. A significant negative relationship was found between price and the ProDes sensory parameter of touch and firmness (p < 0.0029) for total fruit. Findings support our overall hypothesis that FV desirability as measured by the ProDes Tool varies based on rurality of location of the built food environment in Montana. The lack of correlation of Total ProDes scores with NEMS-S scores rationalizes the need of the ProDes Tool to accompany existing food environment tools to more comprehensively characterize the food environment."}, {"section_title": "Introduction", "text": "Diets high in fruit and vegetable (FV) consumption are widely recognized to reduce the risk of diet-related chronic diseases that are leading causes of death globally (Boeing et al. 2012) . However, the majority of adults worldwide consume fewer FVs than the amounts recommended by dietary guidelines (Moore and Thompson 2013; National Cancer Institute 2015) . A vast body of literature highlights that disparities exist in accessing and consuming FVs depending on location (Byker Shanks et al. 2015a; Lutifyya et al. 2012; Story et al. 2008) . For example, rural populations in the state of Montana in the United States have less access to FVs from the market compared to more urban populations, including less access to higher quality produce (Byker Shanks et al. 2015a) . Disparities that exist between rural and urban communities have implications for health outcomes including diet-related chronic disease (Story et al. 2008) .\nNumerous programs have been initiated at the national, state, and community levels in the United States to increase FV consumption towards improving dietary quality, nutrition, Electronic supplementary material The online version of this article (https://doi.org/10.1007/s12571-017-0748-1) contains supplementary material, which is available to authorized users. and public health (CDC 2011 ), yet FV consumption remains low (Haack and Byker 2014) . While food and nutrition programs historically focused on individual psychosocial and educational approaches, more recent initiatives have taken an ecological approach that targets the complex determinants of consumption in the food environment (Story et al. 2008; USDA 2015) . The food environment is defined as the context that influences the availability, affordability, convenience, and desirability of food (Herforth and Ahmed 2015) .\nA food environment approach shifts the role of dietary intake from the individual solely to a more complex perspective that also accounts for interacting socio-economic and political factors of one's surroundings (Dufour et al. 2012) . Research and interventions targeting the food environment are increasingly being implemented towards trying to create population-wide changes that support healthy, diverse, and nutritious dietary patterns based on the hypothesis that the food environment influences individual food choices, which then in turn influence health outcomes (Story et al. 2008) .\nDespite the recognized links between the food environment in nutrition, health, and well-being, there is a shortcoming on how we measure the food environment (Herforth et al. 2017) . While numerous new food environment measurements have been developed in the past few decades (USDHHS 2015) , consumer desirability and food quality measurements are among the least studied features of the food environment (Cummins et al. 2009; Herforth and Ahmed 2015) . A systematic review of food environment measures found that geographic analysis involving geospatial data of food outlets was the most frequently used type of food environment measure as a proxy for availability, affordability, and accessibility (McKinnon et al. 2009 ). Most food environment tools focus on FVs in terms of price, geographic distance to vendors selling fresh produce, and density of vendors, without a comprehensive analysis of desirability of this produce (Herforth et al. 2017) . While these aspects of the food environment are important for determining consumption (Reedy et al. 2010) , economic decision-making involving monetary and time costs as well as distance are not always sufficient to explain consumption decisions that also include behavioral factors on food choices (Shepard 1999; Sobal et al. 2014) .\nConsumers consider multiple aspects of the food environment when purchasing and consuming food items. For example, in-store placement (Wansink 2010) , shelf labels (Gittelsohn et al. 2012) , product packaging, and sensory appeal (Health Canada 2013; Pollard et al. 2002) contribute to consumer's perception of availability, affordability, convenience, and desirability of foods (Herforth and Ahmed 2015) . Enhancing the multiple components of the total food environment, including the availability, affordability, convenience, and desirability of healthy foods together is crucial for supporting food security where Ball people, at all times, have physical, social and economic access to sufficient, safe and nutritious food that meets their dietary needs and food preferences for an active and healthy life^ (FAO 2002) .\nConsumer desirability of food items is among the most understudied aspects of the food environment (Herforth and Ahmed 2015) . The food environment parameter of desirability involves both external and individual factors that influence a consumer's preference, purchase, and, ultimately, consumption of a food item. Factors external to individuals influencing food desirability include social norms based on cultural histories and acceptability, marketing, product placement, and food quality. Individual factors influencing food desirability include perceptions of sensory appeal such as visual characteristics, taste, aroma, and texture, as well as personal preferences linked to food quality.\nStudies demonstrate that sensory factors of desirability are among the most influential determinants of eating behavior (Pollard et al. 2002) and that consumer perceptions of FV quality are positively correlated with their consumption (Zenk et al. 2005) . A pan-European study on consumer attitudes on food, nutrition, and health found that 'quality' and 'taste' were the most prevalent parameters that influenced food-choice behavior (Institute of European Studies 1996). Glanz et al. (1998) found that taste was a key factor influencing American consumer's food purchasing decisions along with nutrition, cost, convenience, and weight control. Studies have further documented that unattractive visual appeal resulting from bruising of produce or unpleasant aroma and loss of firmness from extended storage periods can serve to deter consumers from buying these foods (Glanz et al. 2005; Jago et al. 2007) . Unattractive visual characteristics associated with fruit that has been stored for a relatively long period or is past ripeness can further be indicative of degradation of nutrients and phytonutrients in these foods (Bartley and Knee 1982) .\nThe need for measuring consumer desirability of FVs is clear, given that food preferences are a key component of many food security definitions (FAO 2002; World Food Summit 1996) and FVs are among the most under consumed recommended food groups worldwide. Even so, there are no generalizable or comprehensive validated food environment measures to assess consumer desirability of FVs that can be used in a range of socio-ecological contexts. For example, the most widely used food environment measure in the United States, the Nutrition Environment Measurement Survey for Stores (NEMS-S) (Glanz et al. 2007) , takes into consideration desirability of FVs through a dichotomous evaluation by the survey investigator regarding quality. Specifically, the survey investigator records if 50% or more of the specific FV assessed is considered acceptable. Cummins et al. (2009) made a notable contribution to food environment measures on FV desirability through an in-depth sensory tool that examined the 12 most commonly consumed FVs in Scotland. However, Cummins et al.'s (2009) sensory tool is limited to the 12 specific FVs included in their survey as it rates sensory characteristics that are specific to each produce item surveyed. Thus, this tool is not adaptable to other types of FVs beyond those included in the survey tool and cannot be applied to assess the food environment in diverse socio-ecological contexts.\nThe main objective of our study is to present a food environment survey tool to assess consumer desirability of FVs based on observational sensory characteristics of produce that are generalizable. Further, the research aims to develop a measure that can be applied in diverse socioecological contexts to evaluate, monitor, and compare food environments around the world. Specifically we present the development and implementation of the Produce Desirability (ProDes) Tool that measures overall desirability, visual appeal, touch and firmness, aroma, and size of a range of FVs. We implemented the ProDes Tool in rural and urban built food environments (grocery stores) that varied based on rurality in the frontier state of Montana, United States in order to elucidate access gaps to desirable produce based on rurality of location. In this study, we differentiate 'built' food environments from wild and cultivated food environments. The built food environment includes grocery stores, restaurants, schools, workplaces, farmers' markets, as well as other market systems. The wild and cultivated food environment includes the supply of food procured directly from forests, home gardens, fields, pasture, and other agricultural systems.\nThe overall research question examined here is: Does FV desirability as measured by the ProDes Tool vary based on rurality of location (using USDA Rural Urban Continuum Codes (RUCC codes)) of the built food environment? The following are the specific research questions addressed in this study: (1) How does FV desirability using the ProDes Tool vary among produce items and rurality of the grocery store location that the produce was procured from?; (2) Is the ProDes Tool valid and reliable?; (3) What is the relationship of FV desirability using the ProDes Tool with desirability using the NEMS-S tool?; and (4) Is there a relationship between FV desirability using the ProDes Tool and price? The following are the hypotheses supporting each of these research questions: (1) FV desirability based on the ProDes Tool will significantly vary based on rurality of the grocery store location from which the produce was procured; (2) The ProDes Tool is valid and reliable; (3) FV desirability based on the ProDes Tool and the NEMS-S tool will not be correlated; (4) There will be a significant positive relationship between FV desirability based on the ProDes Tool and price. It is expected that the ProDes Tool can be used to supplement existing food environment tools such as the NEM-S in order to better understand the desirability of FVs from a consumer sensory perspective."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Development of validity and reliability for the ProDes Tool", "text": "Validity (face and content) and reliability (variability and internal consistency) were established using several stepwise methods: a review of the survey by a panel of experts, revision of the survey based upon expert feedback, pre-testing of the survey with a panel of consumers, revision of the survey based upon pre-testing results, pilot testing with a panel of consumers, and the calculation of internal consistency and variability with pilot tested data. These methods, used for the development of validity and reliability, were based upon previous research into the development of food environment surveys conducted by Byker Shanks et al. (2015b) ."}, {"section_title": "Development of the ProDes Tool", "text": "The ProDes is a paper and pencil (see Supplementary Material) or web-based consumer survey (https:// montana.qualtrics.com/jfe3/form/SV_2blPo7YpvvkzOSh) that records sensory aspects of produce in food outlets. We drew from the food sciences and sensory sciences to develop the observational sensory components of the ProDes. Further, ProDes was developed based upon the authors' research experience with measuring food environments. The survey tool focused on taking the perspective of a consumer in a supermarket given findings on the importance of consumer perspectives of quality, selection, and convenience as determinants of fruit and vegetable consumption (Blitstein et al. 2012) .\nDevelopment of the ProDes proceeded through primary research describing produce characteristics coupled with a search of the secondary literature in the fields of food sciences and sensory analysis (Schmilovitch and Mizrach 2013) . Five observational sensory characteristics were identified to be prevalent and generalizable for FVs: overall desirability, visual appeal, touch and firmness, aroma, and size. The ProDes Tool based on a 7-point Likert scale with 0 as the lowest score and 6 as the highest (Lewis-Beck et al. 2004) .\nFace validity and content validity were established by circulating the first draft of the ProDes to a panel of five field experts for feedback (Nunnally and Bernstein 1994) . Experts were given survey instructions with the tool and asked to review the ProDes for its ability to measure desirability of produce purchased in the grocery store setting. We made minor modifications based upon feedback and then pre-tested the survey with study participants before pilot testing the survey."}, {"section_title": "Statement of human rights", "text": "Approval of human subjects to participate in this study was received by the Institutional Review Board (IRB) at Montana State University. Informed consent was obtained from all individual participants included in the study following IRB guidelines before testing began."}, {"section_title": "Study sites", "text": "FVs were collected from 12 grocery stores in 11 urban and rural communities in the state of Montana, USA. Produce was randomly selected from grocery store sites that were also randomly selected based on the 2013 USDA rural-urban continuum codes (RUCC; USDA 2013). RUCC ranges from 1 through 3 are classified as metro (urban) and 4 through 10 are classified as non-metro (rural). The sample size of counties included in this study was determined as 20% of the rural (n = 10) and urban (n = 1) counties in the state. Montana has a total of 5 metro (urban) counties and 51 non-metro (rural) counties. Thus, ten rural counties and one urban county was randomly selected using a random number generator from a master list of RUCC in Montana.\nThe largest town was selected within each county based on the US Census (2015). When a county was selected more than once, the next largest town was selected for assessment. Within each town, the largest grocery store based upon the size of the store perimeter was selected to collect FVs. If two grocery stores were of near equal size, both grocery stores were surveyed. The largest grocery store was selected because, based on observational pilot work, this is where the consumer has access to the greatest variety of FVs and also where the majority of consumers within the town purchase food. Many of the stores included in this study are commercial chains with stores across the region and country. The consumer survey was administered using FVs collected from 12 grocery stores in 11 urban and rural communities.\nThe average community population of the 11 communities in Montana from which the FV samples were purchased for this study was 20,971 people (SD = 33,658) with an average population of 12 (SD = 17) persons per square mile of land. Table 1 shows that one in five (19%) members of the community populations were aged 65 years or older, 92% were nonHispanic white, 89% held at least a high school degree, and 18% were living under the poverty level. The average household encompassed 2.5 members (SD = 0.3). Eighty-eight percent of stores studied participated in the government Supplemental Nutrition Assistance Program (SNAP) for low-income individuals and families.\nNEMS-S scores for the stores included in this study were previously reported by Byker Shanks et al. (2015a) and are shown in Table 1 . The average NEMS-S total availability score was 17.6 (SD = 5.3; out of 30 possible points), the average total price score was 2.9 (SD = 3.0; out of −9 to 18 possible range), and the average total quality score (acceptability of FV) was 4.2 (SD = 1.9; out of 6 possible points). Overall, the average total NEMS-S score for the sampled stores was 24.7 (SD = 7.2; out of 54 possible points)."}, {"section_title": "Implementation of the ProDes Tool", "text": "The ProDes Tool was pilot tested with anonymous consumers and administered through the Montana State University Food and Health Lab. In order to assess the usefulness of the survey as a complement to NEM-S, the most utilized food environment tool in the United States, we included assessment of the first four types of fruits (banana, Red Delicious apple, navel orange, red seedless grape) and the first five types of vegetables (carrot, tomato, green sweet bell pepper, broccoli, green leaf lettuce) listed in NEMS-S that represent the most consumed produce in the United States. For collection of produce to include in the study, researchers randomly selected three of each type of produce from the top, middle, and bottom of each produce display. FVs were immediately placed on ice upon collection and transported to the lead authors' lab for sensory evaluation within two days of collection.\nThe ProDes was administered to a sample of raters (average of five raters per evaluation) that assessed each of the FV samples from two stores at a time using the ProDes. Raters assessed the FVs individually and were requested to not speak with each other during the rating process. Produce was placed on tables, coded and randomized so that participants were blinded to the FV store and community origin. The ProDes took approximately 20 min for a rater to rate produce from two stores at a time based upon all sensory parameters."}, {"section_title": "Statistical methods", "text": "SAS (version 9.2 SAS Institute Inc., Cary, NC) and JMP (version 12.0 SAS Institute Inc., Cary, NC) were used for statistical analysis and creating graphs. Statistical significance was set at a two-sided alpha level of P < 0.05."}, {"section_title": "ProDes scores by FV type", "text": "Total ProDes scores were calculated by averaging the five sensory parameters (overall desirability, visual appeal, touch and firmness, aroma, and size). Means and standard deviations of individual ProDes scores, as well as means and standard deviations of Total ProDes scores were calculated both individually per nine produce items and collectively for all produce. Differences in Total ProDes scores, as well as individual sensory observational measures of the Total ProDes Tool, among the different FV types, were examined by Analysis of Variance. All ANOVAs were adjusted for the price per pound or piece of the fruit or vegetable. A multiple comparison using the LS Means Tukey HSD method was applied to examine if Total ProDes scores and individual sensory observational measures significantly varied among the different FV types. ProDes scores were classified into four categories. A very low score was assigned for produce scoring 0 to 1. A low score was assigned for produce scoring 2 to 3. A moderate score was assigned for produce scoring 4 to 5. A high score was assigned for produce scoring 6 to 7.\nANOVA found significant (p < 0.05) differences between means for Total ProDes scores for fruit, overall desirability scores for fruit and vegetables, touch and firmness for fruit, and visual appeal for fruit and vegetables. No significant differences were found between means for Total ProDes scores for vegetables, touch and firmness for vegetables, size for fruits and vegetables, and aroma for vegetables. Figure 1 further shows results from the Tukey-Kramer HSD comparing all pairs of means for fruits and vegetables separately (FVs connected by different letters are significantly different)."}, {"section_title": "ProDes scores by RUCC", "text": "An ANOVA examined differences in ProDes scores based on RUCC levels. All ANOVAs were adjusted for the price per pound or piece of the fruit or vegetable. A multiple comparison using the LS Means Tukey HSD method was applied to examine if Total ProDes scores and individual sensory observational measures significantly varied along a rural to urban continuum based on RUCC levels.\nSignificant differences (p < 0.0001) in means of Total ProDes scores were found on the basis of rurality (Fig. 2) . Comparisons for all pairs using Tukey-Kramer HSD found significant differences in the means of Total ProDes scores of produce purchased from stores in a metro county (RUCC of 3) in comparison to communities that are rural (RUCC of 7, 8, or 9). The same pattern (Fig. 3) was observed across four of the five observational sensory measures evaluated by the ProDes Tool for overall desirability (p = 0.002), visual appeal (p = 0.003), touch and firmness (p = 0.011), and size (p < 0.0001). Comparisons for all pairs using Tukey-Kramer HSD found significant differences in these four individual measures of the ProDes Tool for RUCC 3 compared to RUCCs 7, 8, and 9. Aroma was the only sensory characteristic that did not demonstrate a significant difference for ProDes scores by RUCC (p = 0.348)."}, {"section_title": "Reliability of the ProDes Tool via internal consistency and variability", "text": "We tested the reliability of the ProDes Tool through calculating variability (standard deviation) of rater scores and internal consistency of responses. Internal consistency of Total ProDes scores was examined using Cronbach's alpha score. Total ProDes scores were calculated by averaging the five sensory parameters (overall desirability, visual appeal, touch and firmness, aroma, and size). Means and standard deviations for the overall scale, subscale, and FV items were calculated. The following rating scale was used to assess scores: ≥ 0.9 = Excellent, ≥ 0.8 = Good, and ≥ 0.7 = Acceptable (George and Mallery 2002; Cronbach and Meehl 1955 )."}, {"section_title": "Correlation of Total ProDes scores with NEMS-S scores and ratings", "text": "We assessed the correlation of Total ProDes scores with NEMS-S scores (Total NEMS-S scores, NEMS-S Availability scores, NEMS-S Price scores, and NEMS-S Quality scores) using the Pearson correlation ratio (George and Mallery 2002; Cronbach and Meehl 1955) . Scores from the ProDes were compared to NEMS-S Availability scores regarding the availability of healthy options (possible points range = 0 to 30), NEMS-S Price scores (possible price range = 0 to 18), NEMS-S Quality scores (possible quality range = 0 to 6 points), and total summary score (availability, price and quality combined; possible total range = 0 to 54 points) offered within stores (Glanz et al. 2007 ). In addition, we examined Total ProDes Scores of individual produce with NEMS-S acceptable ratings of the corresponding produce items. For NEMS-S acceptable ratings of produce, each produce item was ranked as 1 if Bacceptable^and 0 if Bnot acceptable^."}, {"section_title": "FV price by ProDes scores", "text": "A series of linear regression analyses and ANOVAs were carried out to examine the relationship of FV price (USD per The county characteristics part of the table shows the mean and standard deviations of demographic characteristics of the four counties corresponding to the locations of the 12 grocery stores in the 11 communities included in this study. These counties represent four different Rural Urban Continuum Codes (RUCC; 3, 7, 8, 9 ) with an RUCC of 3 being the most urban and an RUCC of 9 being the most rural county sampled. The grocery store characteristics part of the table shows the mean Nutrition Environment Measurement Survey for Stores (NEMS-S) Scores of the 12 grocery on the basis of county RUCC pound) and ProDes scores by FV (including total fruits, total vegetables, and individual FVs). We evaluated Total ProDes scores and the individual sensory parameters of the Total ProDes Tool (overall desirability, visual appeal, touch and firmness, aroma, and size). Figure 1 shows the mean ProDes scores for the individual fruits and vegetables, Total ProDes scores, and five observational sensory measures (overall desirability, visual appeal, touch and firmness, aroma, and size) on a 7-point scale (0 to 6). The overall mean Total ProDes score for all produce was 3.5 (SD = 0.7). A majority of ProDes scores were classified as low or moderate based on the following classification: very low score = 0 to 1; low score = 2 to 3; moderate score = 4 to 5; high score = 6 to 7. The mean Total ProDes scores for each of the individual produce items ranged from 3.2 to 4.1 with green sweet bell peppers having the lowest scores and Red Delicious apples having the highest. The mean ProDes scores for each of the five sensory characteristics for each of the produce items ranged from 2.7 to 4.7. The lowest score for each of the five sensory characteristics for each of the FVs was found for the visual appeal of green sweet bell peppers and the highest rating was found for the size of the Red Delicious apples.\nANOVA output for the linear regression analyses examining the relationship between FV price (USD per pound) and ProDes scores by total fruits and total vegetables found that there was a significant relationship between price and the ProDes sensory parameter of touch and firmness (p < 0.0029). Specifically, as ProDes scores for touch and firmness increased for total fruit, there was a statistically significant and relevant decrease in price (Fig. 4a-e ). For the relationship of price and overall desirability of individual FVs (Fig. 4f) , the ANOVA found significant positive relationships only for carrots (p < 0.0465) with an increase in ProDes scores correlated with increased price. Likewise, for price and visual appeal, ANOVA found significant positive relationships only for carrots (p < 0.0321) with an increase in ProDes scores correlated with increased price. For price and touch and firmness, the ANOVA found significant negative relationships for grapes (p < 0.019), oranges (p < 0.0193) and lettuce (p < 0.028) while finding positive relationships for carrots (p < 0.0173). No significant relationship was found between price and the ProDes parameters of aroma and size for individual FVs."}, {"section_title": "Results", "text": ""}, {"section_title": "Reliability of the ProDes Tool: Internal consistency and variability", "text": "The standard deviation among raters for Total ProDes scores for all produce was 0.70 on a 7-point scale (Table 2) . For individual fruits, standard deviation of Total ProDes scores by rater for three (apples, bananas, and oranges) of the four fruits ranged from 0.90 to 1.1, while it was higher for grapes (1.3). For individual vegetables, standard deviation among raters of Total ProDes scores for four of the five vegetables (broccoli, tomatoes, green peppers, and carrots) ranged from 0.90 to 1.2, while being higher for lettuce (1.3). The standard deviation of the raters' evaluation of individual sensory characteristics for individual produce varied from 0.9 to 1.8 (on a 7-point scale).\nInternal consistency values represented by Cronbach's alpha scores for Total ProDes scores for all produce demonstrated excellent internal consistency (Table 2; Cronbach's α = 0.94, > 0.9 = Excellent). For individual produce, five (grapes, oranges, carrots, green peppers, and lettuce) of the nine FV items surveyed had 'excellent' internal consistency while the remaining four (apples, bananas, broccoli, and tomato) had 'good' internal consistency with Cronbach's α scores ranging from 0.81-0.94 (Table 2) ."}, {"section_title": "Correlation of total ProDes scores with NEMS-S scores and ratings", "text": "There was no significant relationship for Total ProDes scores by NEMS-S Total scores (p = 0.880; r = −0.019), Total ProDes scores by NEMS-S Availability scores (p = 0.926; r = 0.012), and Total ProDes scores by NEMS-S Quality scores (p = 0.457; r = 0.095). For the comparison of Total ProDes scores for individual FVs with NEMS-S acceptable ratings for the corresponding produce items, very few significant correlations were found (Table 3) . Only the Total ProDes scores for broccoli, oranges, and tomatoes demonstrated a correlation with the NEMS-S acceptable ratings. "}, {"section_title": "Produce Type", "text": "A p p le B a n a n a G r a p e s O r a n g e B r o c c o li C a r r o t s G r e e n P e p p e r s L e t t u c e T o m a t o \nA p p le B a n a n a G r a p e s O r a n g e B r o c c o li C a r r o t s \nA p p le B a n a n a G r a p e s O r a n g e B r o c c o li C a r r o t s "}, {"section_title": "Touch and Firmness", "text": ""}, {"section_title": "Discussion", "text": "Desirability based on sensory attributes of food items is an important determinant of consumer food choices (Pollard et al. 2002; Blitstein et al. 2012; Institute of European Studies 1996; Zenk et al. 2005 ) yet is an under-measured aspect of the food environment (Herforth and Ahmed 2015) . This study presents a generalizable food environment tool, the Produce Desirability (ProDes) Tool, to assess the desirability of fruits and vegetables (FVs) to consumers that can be used in a range of socio-ecological contexts. We implemented the ProDes Tool in the built food environment in the rural frontier American state of Montana in order to examine if disparities exist in access gaps to desirable produce based on rurality of location. Findings support our overall hypothesis that FV desirability as measured by the ProDes Tool varies based on rurality of location (RUCC codes) of the built food environment in the study area.\nCompared to the locations, FVs procured from the metropolitan built food environments had significantly higher Total ProDes scores and higher scores for each of the five observational sensory parameters evaluated by the ProDes Tool including overall desirability, visual appeal, touch and firmness, and size. The lack of correlation of Total ProDes scores with NEMS-S Quality scores and acceptable rations of individual produce rationalizes the need of the ProDes Tool to accompany existing food environment tools. The relatively low overall ProDes scores are noteworthy, as consumer perception of quality is a key determinant of fruit and vegetable consumption. Variation of ProDes scores for the individual five observational sensory measures highlight the importance of assessing the sensory desirability of produce using multiple parameters. The standard deviation of the raters' evaluation of ProDes scores highlights the subjective nature of desirability measures that are recognized to vary based upon perceptions among consumers (Herforth and Ahmed 2015) . Such subjective measures can enhance objective measures by more comprehensively characterizing the complex factors that influence dietary behavior.\nA majority of the correlation coefficients demonstrated almost no relationship between ProDes scores and NEMS-S Quality scores. Fewer of the correlation coefficients demonstrated a weak positive or negative relationship between ProDes and NEMS-S. The negligible correlation of ProDes scores with NEMS-S Quality scores and acceptable ratings per produce item highlight the value of administering the ProDes to capture FV desirability and food choice evaluation from a consumer perspective. While noting the value of the ProDes, we further note the value of administering the ProDes alongside other food environment measures such as the NEMS-S to have a more comprehensive understanding of the consumer food environment. In particular, the ProDes is suitable to implement alongside NEMS-S because it can rate the same FVs as those assessed for acceptability by the NEMS-S while providing supplemental information by incorporating the perspective of consumers regarding multiple measures of sensory desirability. ProDes highlights that consumer choice for fruits and vegetables is more nuanced than a dichotomous Analysis of Variance found significant differences in the means Total ProDes scores on the 7-point scale on the basis of rurality as determined by the USDA RUCC. RUCC ranges from 1 through 3 are classified as metro (urban) and 4 through 10 are classified as non-metro (rural). RUCC levels not connected by the same letters in the graph have significantly different means while RUCC levels that have different letters above the bar in the graph are statistically different. Each bar is constructed using one standard error from the mean acceptable or unacceptable score. ProDes captures multiple sensory characteristics, whereas the NEMS-S Quality score asks the rater to provide one score based upon several parameters. For example, if future research demonstrated a negative and significant correlation between ProDes and NEMS-S Quality scores, the fruit or vegetable may score very low on one ProDes parameter but score high in other sensory parameters. The rater assessing the same produce based upon a NEMS-S Quality score may decide that the produce is acceptable because most of the parameters are acceptable.\nFindings that FVs procured from more urban built food environments have higher ProDes scores compared to more rural built food environments in Montana points to the unique challenges of ensuring healthy food access and availability to residents of rural food environments. These findings are in line with previous studies showing that produce from rural built food environments is of lower quality than in more metropolitan areas (Byker Shanks et al. 2015a ). The lower ProDes scores for FV desirability in more rural areas may be due to limited infrastructure for food distribution that poses obstacles to maintaining highquality produce in rural built food environments (Calancie et al. 2015; Johnson et al. 2014 ) as FV quality degrades over time. The lower FV desirability in rural areas is especially problematic as adults in rural communities are less likely than adults in non-rural communities to consume the nationally recommended amount of fruits and vegetables per day (Lutifyya et al. 2012) . At the same time, rural residents are at higher risk for diabetes and heart disease as well as are more likely to be obese (Lutfiyya et al. 2007; Befort et al. 2012; O'Connor and Wellenius 2012) . We found surprising relationships between ProDes scores and price. As ProDes scores for touch and firmness increased for total fruit, there was a statistically significant and relevant decrease in price. Likewise, a significant negative relationship was found for ProDes scores for the parameters of touch and firmness and price for grapes, oranges, and lettuce. On the other hand, a significant positive relationship was found for the Total ProDes Scores were calculated by averaging the five sensory parameters (visual appeal, touch and firmness, size, overall desirability, and aroma). We classified standard deviation of the raters' evaluation of Total ProDes scores for individual produce items of individual sensory characteristics for individual produce. Internal consistency was examined using Cronbach's alpha score based on the following rating scale of scores: ≥ 0.9 = Excellent, ≥ 0.8 = Good, and ≥ 0.7 = Acceptable (Cronbach and Meehl 1955) The Pearson correlation ratio was used to examine the relationship of Total ProDes scores per produce with NEMS-S acceptable ratings per produce. For NEMS-S acceptable ratings, each produce item was ranked as 1 if Bacceptable^and 0 if Bnot acceptable* p < 0.05, **p < 0.01, ***p < 0.001 a N is equal to the number of raters contributing to the ProDes score per produce item. The number of raters vary because some fruits or vegetables were not available at all stores and therefore fewer raters contributed to a Score ANOVA output for a linear regression found a significant relationship between price and the ProDes sensory parameter of touch and firmness for a total fruit, b grapes, c oranges, d carrots, and e lettuce. A significant relationship was further found for price and overall desirability ProDes scores for f carrots overall desirability, visual appeal, and touch and firmness of carrots and price. These findings highlight that only some sensory parameters of the ProDes Tool are related to price. These findings are noteworthy because previous research indicates that the price of fruits and vegetables impacts their purchase, and ultimately consumption, especially for low-income individuals (Cassady et al. 2007; Jones et al. 2014; Afshin et al. 2017) . Future research is needed to examine consumer buying decisions based on both ProDes scores and price.\nAs the ProDes has a generalized rating system for evaluating characteristics of a range of FVs, it can be used in a broad range of contexts including ethnic food stores in the United States and markets in developing countries. While we pilot tested the ProDes Tool in the built food environment in Montana, United States, it is expected that this measure can be used in varied communities globally, including in low-income countries. Future research is needed to implement the ProDes Tool in food environments around the world including in low-income, moderate-income, and high-income countries in order to evaluate the usefulness of this tool. In addition, future research is needed to implement the ProDes Tool using a diversity of FVs that were not included in this study. Lastly, research is called for to evaluate if the ProDes Tool can be integrated with foods from the wild and the cultivated food environment.\nThis study only measured FV desirability using the ProDes Tool and did not measure links to FV consumption. We can thus only extrapolate findings of FV desirability to previous studies that have shown that sensory attributes are among the most influential determinants of eating behavior (Pollard et al. 2002; Institute of European Studies 1996) including FV consumption (Zenk et al. 2005) . Additionally, our study was carried out with a relatively small number of grocery stores and consumers in a specific context. Therefore, our findings may not be generalizable outside of Montana to other parts of the USA. Future research is needed to examine if FV desirability based on the ProDes Tool is significantly related to FV consumption. Such evidence would strengthen the value and application of the ProDes Tool as well as support food environment interventions targeted at increasing FV desirability with the goal of supporting FV consumption for healthy dietary patterns. Research should aim to understand if the significant inverse relationship between price and sensory characteristics is due to location, consumer preference, or other factors. Additionally, the ProDes Tool should be tested in diverse geographies and among various consumer groups."}, {"section_title": "Conclusion", "text": "This study presents a generalizable food environment tool, the Produce Desirability (ProDes) Tool, to assess FV desirability that can be used in a range of socio-ecological contexts. Findings support our overall hypothesis that FV desirability as measured by the ProDes Tool varies based on rurality of location (RUCC codes) of the built food environment in the frontier state of Montana, United States. The lack of correlation of Total ProDes scores with NEMS-S scores rationalizes the need of the ProDes Tool to accompany existing food environment tools to more comprehensively characterize the food environment. As the parameters in ProDes are generalizable to a range of produce and fresh foods, it is expected that this survey can be amended to include different FVs and other food groups that are specific to a context, including in ethnic neighborhoods within the USA as well as for food security research internationally. In addition, it is anticipated that implementation of the ProDes will elucidate disparities in the food environment among geographic locations and provide evidence to inform the design of food and nutrition interventions towards improving desirability of FVs linked to consumption and ultimately to dietary quality, food security, and public health. Selena Ahmed's research, teaching, and outreach interests are at the intersection of the ecological, cultural, and health aspects of food systems. She is an Assistant Professor of Sustainable Food Systems at Montana State University, USA, where she coleads the Food and Health Lab ( w w w . m o n t a n a . e d u / foodandhealthlab/) that explores food environment-nutrition-health linkages. Selena is particularly interested in identifying the socioecological determinants of environmental and human wellbeing in the food system. This work involves quantifying the influence of environmental factors on ecosystem services; food availability, diversity, and quality; dietary transitions and health outcomes in the context of global change. Selena has carried out transdisciplinary research in a range of ecological and cultural contexts in China, India, Morocco, Venezuela, Belize, the Dominican Republic, and with Native American communities in the United States. The ultimate translational goal of this work is to develop evidence-based plans to promote biodiversity and mitigate risk of food insecurity and diet-related chronic disease towards enhancing the sustainability of food systems.\nCarmen Byker Shanks' research program aims to increase dietary quality and decrease nutritionrelated health disparities, while contributing to healthier food environments and systems. She partners with communities, researchers, students, and stakeholders to measure and implement contextually specific strategies in food systems that facilitate dietary change and positive health outcomes. Throughout all stages of his interdisciplinary academic background Justin has studied how science and technology both shape and are shaped by society. His research continues to pull at this thread."}]