[{"section_title": "", "text": "Introduction. Recent record high sea surface temperature anomalies (SSTa) in the California Current Large Marine Ecosystem (CCLME; Fig. 6 .1a) produced dramatic impacts on marine life (Cavole et al. 2016; Peterson et al. 2016; Welch 2016) . While effects on many species and fisheries may have been short-lived, salmon fisheries, for example, were heavily impacted in 2016 due to multiyear persistence of unfavorable conditions. Negative impacts on CCLME salmon fisheries are likely to persist until at least 2019, as poor stream and 2014-16 ocean conditions directly influence the 2016-19 Chinook salmon abundance. U.S. West Coast Chinook salmon catches in 2016 were approximately 52% of the average catch since 2006, quotas for Chinook salmon fisheries were not met, and spawning escapements to the Klamath and Sacramento River basins were very low (PFMC 2017a) . For 2017, the Klamath River Chinook salmon abundance forecast is the lowest on record, and salmon fishing has been sharply restricted from southern Oregon to southern California (PFMC 2017b) .\nOur analysis focuses on the climatic drivers of the 2014-16 CCLME warm period and its extremity in the context of the past century. This study is motivated by an important question from a fisheries management perspective: to what extent were the 2014-16 extremes due to natural variability versus anthropogenic climate change?\nTemperature impacts on salmon. Salmon are a subarctic species that thrive in marine habitats featuring lipid-rich food-webs with cool-water plankton and fish communities. Warm periods in the CCLME are characterized by sharp reductions in cool, nutrientrich, highly productive upwelled and subarctic water (Chavez et al. 2002; Checkley and Barth 2009 ), a shift from lipid-rich to lipid-poor zooplankton (Peterson and Schwing 2003) , and an inf lux of predators to the nearshore areas critical for salmon early marine survival (e.g., Pearcy 1992; Wells et al. 2017) . These shifts in the prey base and predator distributions favor reduced growth and survival rates for CCLME salmon (e.g., Daly et al. 2017) , and anomalously warm CCLME SSTs are associated with low post-release survival rates for hatchery-origin coho and Chinook salmon from southeast Alaska to California (Sharma et al. 2012; Kilduff et al. 2015) . While links between salmon abundance (or catch) and SST are not easily evaluated with time series correlations (see online supplement material), a strong link between record-warm 2014-16 CCLME SSTs and negative impacts on the West Coast salmon fishery in 2016 is evidenced by a shift to subtropical species and widespread negative impacts (increased mortality rates, reduced reproductive success and/or abundance) on top predators like sea birds, salmon, and marine mammals that typically thrive under neutral or cool SST conditions (Cavole et al. 2016; Peterson et al. 2016; Welch 2016) ."}, {"section_title": "Data and methods.", "text": "For 1920-2016 CCLME SST observations, we used the 1° Hadley Centre Sea Ice and Sea | Surface Temperature (HadISST; Rayner et al. 2003) dataset. For spatial SSTa correlation analyses we used the 1982-present, higher resolution (0.25°) NOAA Optimum Interpolation Sea Surface Temperature, version 2 (Banzon et al. 2016; Reynolds et al. 2007) .\nAnthropogenic forcing contributions to extreme warming were assessed using SSTa distributions from \"historical\" (1920-50) and \"present\" (2000-30) periods in the Coupled Model Intercomparison Project Phase 5 (CMIP5; Taylor et al. 2012 ) ensemble and the Community Earth System Model Large Ensemble Project (CESM-LENS; Kay et al. 2015) . We used 26 and 30 members from the CMIP5 and CESM-LENS ensembles, respectively. For each ensemble, historical external forcing was applied until 2005, after which representative concentration pathway 8.5 (RCP8.5) external forcing was applied (Lamarque et al. 2010 (Lamarque et al. , 2011 to provide continuous simulations of the twentieth and twenty-first centuries. The change in risk of an extreme event due to anthropogenic forcing is estimated using the fraction of attributable risk, FAR = 1 -(P 0 /P 1 ), where P 0 is the probability of an event in the historical period and P 1 is the probability of the same event in the present period (Stott et al. 2004) .\nForcing of CCLME SSTa is explored using firstorder auto-regressive [AR(1)] models of the form SSTa t = a*SSTa t−1 + b i *F i + ε t where a is the lag−1 autoregression coefficient such that a*SSTa t−1 represents damped persistence, F i are b i are forcing functions and their regression coefficients, respectively, and ε is a residual error term (noise). CCLME SST anomalies in the context of variability and change. The 1920-2016 distribution of observed annual mean CCLME SSTa is positively skewed, with more extreme warm anomalies than cold, and the 2014-16 values in the tail of the distribution (Fig. 6.1d) . The CESM-LENS and CMIP5 distributions are nearly Gaussian and generally match the observed histogram (Figs. 6.1d,e) , with the observed record 2015 SSTa near the upper bound of both ensembles (Figs. 6.1b,c) . From the historical period to the present period , increases in the ensemble mean (standard deviation) of SSTa are 0.47°C (0.10°C) in CESM-LENS and 0.65°C (0.06°C) in CMIP5. There is a long-term tendency for warmer SSTa to occur later in the observed record, although it is unclear if the increase is linear (Johnstone and Mantua 2014) . Indeed, simulated CCLME SSTa exhibit little trend from 1920 to ~2000, after which they increase rapidly (Figs. 6.1b,c), similar to nonlinear changes that emerge for coastal upwelling in the CCLME (Brady et al. 2017) .\nIn 2015, the observed annual mean CCLME SSTa was 1.7°C, or 3.3 standard deviations (σ) above the mean, the highest value in the 1920-2016 record (Fig.  6.1b) . The persistence of this heat wave was also remarkable; 2014-16 was the warmest 3-year period on record, with mean SSTa of 1.3°C, 3.1σ above the mean of all 3-year periods from 1920-2016 (Fig. ES6.1) . The annual and three-year mean SSTa observed in 2015 and 2014-16 are never reached in the historical period for either CMIP5 or CESM-LENS (~1700 total simulated years under 1920-50 external forcing). In the \"present\" period, mean 2015 SSTa and 2014-16 SSTa occur approximately 2%-4% and 7%-9% of the time, respectively (Table ES6 .1). Therefore, for these events, FAR = 1. However, one must take care when interpreting FAR as over shorter periods it can be influenced by natural variability; we discuss this variability in the next section.\nForcing of SST anomalies in the CCLME. Bond et al. (2015) showed that record SSTa in the Gulf of Alaska (GOA) in 2014 were caused by a persistent ridge of high sea level pressure anomalies that reduced surface wind speeds and weakened normal cooling processes over the 2013/14 winter. In 2015, northeast Pacific SST extremes expanded to include an area encompassing Alaska to Baja California (Gentemann et al. 2017) . Di Lorenzo and Mantua (2016; hereafter DM2016) showed this persistent marine heatwave was a consequence of two atmospheric forcing/ocean response patterns, the 2014 GOA pattern and the 2015 northeast Pacific Arc pattern, linked with ENSO via teleconnections.\nWe examined the forcing of CCLME SST anomalies using AR(1) models in which observed SSTa derive from damped persistence of pre-existing anomalies plus some forcing. As the CCLME is a coastal upwelling system, the alongshore wind is a dominant forcing via mechanisms that include coastal and offshore upwelling, horizontal advection, and surface heat fluxes (Johnstone and Mantua 2014) . The SSTa tendency has maximum correlations with meridional wind stress off the coasts of California and Baja California, from ~130° to 140°W (Fig. 6.2a ). An AR(1) model forced by this index of local atmospheric forcing reproduces much of the observed SSTa variance (Fig. 6.2b) . However, it fails to reproduce the extreme 2014-16 warming.\nA lag-correlation analysis of residuals from the AR(1) model suggests an important inf luence of GOA SSTa at lead times of ~6 months (Fig. 6.2c) , and | | inclusion of 6-month lead GOA SSTa dramatically improves the AR(1) model, particularly in 2014. While a mechanistic evaluation of the GOA influence on the CCLME is beyond the scope of this paper, this finding is consistent with a tendency found in the historical record for warm GOA SSTa to evolve into an Arc pattern warming the following year (DM2016).\nCorrelating residuals from our second AR(1) model with basin-wide SSTa produces a spatial pattern that implicates ENSO variability (Fig. 6.2e) . While one pathway for ENSO forcing is through the alongshore wind (Alexander et al. 2002; Jacox et al. 2015) , which is already in our model, ENSO may impart additional variance through coastal trapped waves or anomalous poleward advection. Inclusion of the NOAA/CPC Equatorial Southern Oscillation Index (EqSOI) only modestly improves the overall performance of the AR(1) model, but improvements are visible for calendar years impacted by strong El Niños (Fig. 6.2f ). The influence of the 2015/16 El Niño is visible in our AR(1) model, though its timing was earlier (a larger ENSO influence in 2015 than 2016; Frishknecht et al. 2017 ) and its impact on the CCLME weaker (Jacox et al. 2016 ) than common ENSO indices (e.g., Niño3.4) suggest.\nDiscussion. While a FAR calculation of the 2014-16 CCLME SSTa suggests an important role for anthropogenic warming, over shorter timescales the FAR is also influenced by natural internal variability, especially in the CCLME (Weller et al. 2015) . The analysis outlined in Fig. 6 .2 suggests roles for multiple drivers of SSTa in the CCLME, specifically atmospheric variability off the North American west coast, a lagged response to GOA SSTa, and ENSO teleconnections impacting the CCS. While these forcing mechanisms share some variance (r = 0.4-0.6), the 2014-16 period had notably strong and sustained forcing from all three (Fig. ES6.2) . The superposition of multiple drivers (weakened poleward winds, an extremely warm GOA, and El Niño) contributed heavily to the CCLME anomalies, and additional mechanisms are also likely at play [e.g., reemergence, where anomalies are sequestered beneath the mixed layer in spring/ summer and reemerge when the mixed layer deepens in winter (Fig. ES6.3)] . Nonetheless, climate model ensembles suggest that anthropogenic warming increased the likelihood of the 2014-16 SST extremes through both a shift to a warmer mean state and an increase in temperature variability ( Fig. 6.1; DM2016) .\nMarine resource management decisions will benefit greatly from mechanistic understanding, risk assessments, and attribution studies of extreme events (Oliver et al. 2017; Webb and Werner 2018) . To that end, we find that the recent extreme ocean temperatures off the U.S. West Coast, which significantly impacted many marine species and fisheries, were caused by the confluence of multiple complementary natural drivers and were likely exacerbated by longterm anthropogenic warming."}, {"section_title": "ACKNOWLEDGMENTS.", "text": "We thank Desiree Tommasi, the editors, and two anonymous reviewers for their insightful comments on our manuscript, and Michael O'Farrell for providing a summary of 2016 and 2017 U.S. West Coast salmon fisheries. Contributing support for this work was provided by the National Oceanic and Atmospheric Administration's Integrated Ecosystem Assessment (NOAA IEA) Program. The scientific results and conclusions, as well as any views or opinions expressed herein, are those of the authors and do not necessarily reflect the views of NOAA or the Department of Commerce."}]