[{"section_title": "Introduction", "text": "The seasonal cycle is one of the ubiquitous elements of low frequency signals in sea level [Pattullo et al., 1955]. Understanding its spatial and temporal variability is important because temporal changes in its large amplitudes may affect the frequency and magnitude of coastal flooding [e.g., Menendez et al., 2009;Dangendorf et al., 2012;Wahl et al., 2014]. Changes in atmospheric pressure and wind stress, as well as changes in surface heat flux and advection of heat by currents, are the primary causes for changes in the seasonal sea level cycle (SSLC) [Gill and Niiler, 1973]. Hydrological forcing due to river runoff can also contribute to the seasonal cycle in some regions [Tsimplis and Woodworth, 1994]. Gravitational forcing includes an annual and semiannual astronomical tidal contribution [Pugh, 1987]. However, the corresponding sea level amplitude in the South China Sea (SCS), based on estimation by Pugh and Woodworth [2014], is less than 1 cm and will therefore be neglected in this study. Early studies of the SSLC on a global scale were based on sparsely distributed tide gauge records [i.e., Pattullo et al., 1955, Tsimplis andWoodworth, 1994]. These, however, are limited to the coastal zone and thus not necessarily appropriate for estimating the height and phase of the SSLC in the open ocean [e.g., Tsimplis and Woodworth, 1994]. The development of satellite altimetry has provided near global coverage of sea level observations, allowing for a better understanding of the SSLC both in the coastal zone and in the open ocean [e.g., Stammer, 1997;Vinogradov et al., 2008]. It has been found, for instance, that the amplitudes of the annual component of the sea level cycle estimated on the basis of tide gauge records are generally greater than those measured by satellites in the adjacent shallow ocean (<200 m depth) [Vinogradov and Ponte, 2010]. Regional studies of the SSLC have been carried out for example in the Caribbean Sea [Torres and Tsimplis, 2012], the US Gulf Coast [Wahl et al., 2014], the North Sea [Plag and Tsimplis, 1999;Dangendorf et al., 2012Dangendorf et al., , 2013aDangendorf et al., , 2013b, the Baltic catchment [H€ unicke and Zorita, 2008], and the Mediterranean [Marcos and Tsimplis, 2007].  Table S1  Table S2  Table S3 Journal of Geophysical Research: Oceans"}, {"section_title": "PUBLICATIONS", "text": "All these studies agree in the existence of considerable interannual to interdecadal variability in the amplitudes and phases of the seasonal cycle. The forcing factors of such variability are highly dependent on the region. For instance, Marcos and Tsimplis [2007] showed that temporal variability of the SSLC in the Mediterranean Sea was linked to changes in the surface heat fluxes, whereas Wahl et al. [2014] found changes in air surface temperature and atmospheric pressure to be the major drivers in the US Gulf Coast. In the North Sea and the Baltic Sea, Plag and Tsimplis [1999] found considerable influence of atmospheric pressure on the temporal variability of the SSLC. In this study, the SSLC in the SCS and its temporal variability are examined. In the literature, several studies have explored the seasonal sea level variability in this area using either tide gauges or satellite altimetry data. Tsimplis and Woodworth [1994] noted different annual phases between the east and the west coast of the Malaysian Peninsular. Saramul and Ezer [2014] reported that the seasonal sea level along the coast of the Gulf of Thailand is primarily driven by the wind associated with the seasonal monsoon. Based on satellite altimetry and an ocean model, Qinyu et al. [2001] found that the largest annual amplitude can be found off the northwest coast of the Philippines and peaks in July. Using altimetry data, temperature and salinity observations and satellite gravimetry data, from the Gravity Recovery and Climate Experiment (GRACE), Cheng and Qi [2010] suggested that the steric component contributes significantly to the SSLC in the deeper parts of the basin, whereas the mass component dominates in shallow waters. Using the ORA-S3 ocean analysis/reanalysis system, Zhou and Yu [2012] demonstrated that the seasonal variations of dynamic sea level in the SCS are driven by buoyancy fluxes and local wind stress. Nevertheless, to date, the SSLC in the SCS has not been comprehensively examined using tide gauge records in conjunction with satellite altimetry data, and no study has yet investigated temporal variations in the seasonal cycle. Furthermore, the contributions of the steric component and the wind forcing to the SSLC around the coastline of the SCS are still unclear. The SCS is the largest semi enclosed marginal sea in the western Pacific (Figure 1). It comprises shallow continental shelf areas in the north and south and deep ocean areas in the central basin. A variety of water bodies surround the SCS including: the Malacca Strait, the Gulf of Thailand, the Sulu Sea, the Celebes Sea Figure 1. Map of the study area showing the location of the tide gauge sites. Sites are numbered as in Table 1. The grey colour indicates the low elevation coastal zone (i.e., the land that lies between 0 and 10 m above mean sea level). Journal of Geophysical Research: Oceans 10.1002/2015JC010923 and the Philippine Sea. It has one of the world's most vulnerable coastlines to sea level rise [Neumann et al., 2015] with several low lying coastal regions (grey area in Figure 1) with large and rapidly growing megacities (i.e., populations > 5 million) such as Guangzhou (China), Bangkok (Thailand) and Ho Chi Minh City (Vietnam). The oceanographic conditions in the region are dominated by the two main monsoonal systems which reverse direction twice a year [Wang and Li, 2009]. The Northeast Monsoon brings south-westward winds in winter (Figure 2a), which turn opposite during the Southwest Monsoon in summer (Figure 2b). During the Northeast Monsoon, persistent high atmospheric pressure systems reside in the northern SCS. The annual amplitude of sea level pressure reaches 7 hPa and peaks in January in this region [Chen et al., 2011]. The monsoonal system drives the surface ocean circulation in the basin leaving a clear fingerprint in the coastal sea levels [Xu and Malanotte-Rizzoli, 2013]. The surface currents (< 100m depth) in the winter season are opposite to those occurring in the summer season [Liu et al., 2008;Fang et al., 2009]. In winter, the SCS currents are southwest-southward directed forming a cyclonic circulation in the entire basin ( Figure 2c). During summer, the current flow turns to the north-northwest forming an anticyclonic circulation in the south of the SCS (Figure 2d). Journal of Geophysical Research: Oceans"}, {"section_title": "10.1002/2015JC010923", "text": "The overall aim of this paper is twofold: first we quantify the spatial and temporal variability of the SSLC, which is considered as the sum of an annual and a semiannual component. Second we determine the importance of various forcing mechanisms. The work is structured as follows; the data and methodology are described in sections 2 and 3, respectively. The spatial and temporal variability of the seasonal cycle is analyzed in section 4. Conclusions are given in section 5.\npattern in the Gulf of Thailand due to the Mw9.2 Sumatra-Andaman earthquake in 2004 based on two GPS stations. They found that the downward land motion from 2005 to 2008 was about 24 mm/yr in the northern part and about 213 mm/yr in the eastern part of the Gulf of Thailand. The distance between the GPS stations and nearby tide gauges is 26 km and 27 km for northern (Ko Sichang (17)) and eastern (Ko Mattaphon (14)) stations, respectively. Comparison of the detrended tide gauge data in Ko Taphao Noi (1), in the western part of Thailand with neighbouring stations (Langkawi (2) and Pulau Pinang (3)) shows large monthly mean differences (10 cm) after 2004. Similar discrepancies were found for the tide gauges at Ko Lak (15) and Ko Mattaphon (14). Therefore, we decided to reject all data after 2004 in these three tide gauge records (Ko Lak, Ko Mattaphon and Ko Taphao Noi). The final tide gauge data set contained 53 tide gauge records across the study area, the locations of which are shown in Figure 1. The period covered by each record is shown in Figure 3. Mean sea level pressure, zonal (u) and meridional (v) winds at 10 m, and surface air temperatures, were obtained from the 20 th Century Reanalysis Version 2, provided by the National Oceanic and Atmospheric Administration (NOAA) [Compo et al., 2011] (http://www.esrl.noaa.gov/psd/data/gridded/data.20thC_ ReanV2.html). The data are available as monthly mean values on a 2.08 resolution grid, covering the period 1871-2012 and were used to assess their relative contributions to the coastal seasonal cycle. To estimate the contribution of the mean sea level pressure and the air temperature to the SSLC at a tide gauge station, Journal of Geophysical Research: Oceans\nwe use the value of such variables at the nearest grid point to the tide gauge. The wind relevant to the tide gauge is taken from the grid point providing the highest correlation with the tide gauge record among all grid points within a 48 3 48 area around the tide gauge. Monthly means of global gridded of temperature and salinity data, from the Ishii version 6.13 data set [Ishii and Kimoto, 2009] (http://atm-phys.nies.go.jp/ism/pub/ProjD/), were used to compute the steric contribution to the observed SSLC. This data set covers the period 1945-2012 and has a horizontal resolution of 18 3 18 with 16 vertical levels from the surface to 1500 m depth. An analysis of the available data in the SCS from the major sources of the Ishii data set, the World Ocean Database 2009, indicates that both T and S observations are poorly sampled. For the period 1993-2009, there are, on average, 14 temperature and 3 salinity profiles per 28 3 28 for each year. For temperature, 34% of the data are above 200 m depth, 39% between 200 m and 500 m depth, 26% between 500 m and 1000 m depth, and 1% below 1000 m depth, whereas for salinity, the percentages are 35%, 23%, 22% and 20%, respectively. Two climate indices namely, the Multivariate ENSO Index (MEI) and the Western North Pacific Monsoon Index (WNPMI), were used to assess the large scale forcing on temporal variability of the SSLC. The MEI Index is represented by the first principal component of six observable monthly standardized variables over the tropical Pacific from the Comprehensive Ocean-Atmosphere Dataset (COADS), that is: sea level pressure, surface u and v wind, sea surface temperature, surface air temperature and cloudiness [Wolter and Timlin, 1998] (http://www.esrl.noaa.gov/psd/enso/mei/). The Monsoon Index is defined using the difference of the 850 hPA zonal wind between a southern region (58-158N, 1008-1308E) and a northern region (208-308N, 110-140E) [Wang and Fan, 1999] (http://iprc.soest.hawaii.edu/users/ykaji/monsoon/seasonalmonidx.html).\nPhilippines Sea. The annual phase changes by a maximum delay of 52 days at Beihai (24), in the northern SCS, and advances by 5 days at Sejingkat (51), in the south-eastern SCS. Most stations in the northern SCS show an increase in IB-corrected annual amplitude between 4 cm and 7 cm. This is in agreement with the higher annual amplitude (6 mb -7 mb) of sea level pressure in the northern SCS, peaking in January (supporting information Figure S2). a The standard error (95% confidence level) of amplitude and phase are presented. Only values for statistically significant harmonics and amplitude more than 1 cm are shown. Journal of Geophysical Research: Oceans\nThe semiannual amplitude at Legaspi (37), Surigao (40) and San Jose (36) in the Philippines Sea becomes insignificant (95% confidence) after correcting for atmospheric pressure. Thus for these stations atmospheric pressure is the dominant forcing parameter for the semiannual cycle. However, the atmospheric pressure correction does not significantly change the semiannual amplitude at any other stations in the study area.\nannual harmonic is not significant in the western and eastern part of the Celebes Sea (hashed area on Figure 4a). The semiannual amplitude also shows considerable spatial variability (Figure 4c). The average amplitude for the study area is 3 cm with larger values of about 6 cm to 8 cm in the Malacca Strait and the Gulf of Tonkin (adjacent to northern Vietnam). The mean semiannual amplitude is statistically insignificant (95% confidence level) in the Philippine Sea, in the Celebes Sea, in most of the Sulu Sea and in the central deep basin of the SCS extended to the southern continental shelf. The semiannual phase generally peaks between March and June (Figure 4d) with the northern region peaking earlier and the southwestern part peaking later. The average percentage of variance explained by the mean seasonal cycle over the entire region is 51% (Figure 5a). It is higher, about 85-90%, in the Gulf of Thailand. The seasonal cycle also has a relatively large contribution on the northern and southern continental shelves of the SCS with an explained variance mostly exceeding 70% of the observed total sea level variability. This is in agreement with higher sea level variance along the continental shelf of the SCS (Figure 5b). Interestingly, the explained variance in the central deep basin lies only between 20 and 60% (except in the northwest Philippines), showing a major difference with respect to the explained variability over the continental shelves. A regional minimum of explained variance is found in the Celebes Sea where its spatial average is only about 10%. The spatial variability of the seasonal cycle from altimetry is generally consistent in most places with the results from the 29 IB corrected tide gauge sites that contain more than 19 years of records for the common period from 1980 to 2012 (not shown). Comparison of the annual amplitudes of the seasonal cycle from altimetry with those derived from IB corrected tide gauge records for the period 1993-2012 shows significant differences at 20 stations (Figure 6a). In the Gulf of Thailand, the south-western SCS, and the western SCS, differences of more than 3 cm are observed. The maximum difference reaches 10 cm at Pom Phrachun (16), Thailand. The maximum difference in the annual phase is found at Tawau (44), in the south-eastern SCS and Tanjung Keling (6), in the Malacca Strait where the IB corrected tide gauges lead altimetry by 47 days. For the semiannual amplitudes (results not shown), only one station (Zhapo (26) in the northern SCS) shows significant differences indicating better agreement between the IB corrected tide gauge and the altimetry data for the semiannual cycle. Differences in the annual harmonic may be due to the smaller scales of dynamical processes dominating the shallow water compared to the spatial resolution of altimetry data [Birol and Delebecque, 2014] especially the existence of seasonal coastal current along the continental shelf of the SCS. Journal of Geophysical Research: Oceans 10.1002/2015JC010923\ngauge stations in the Malacca Strait and the Philippine Sea with the steric phase leading the IB corrected tide gauge records by less than 30 days. The semiannual amplitude of the steric component has an average value of 2 cm and reaches a maximum value of 6 cm at all stations in the Malacca Strait except Kukup (7) ( Table 2). Most stations peak between May and June. The semiannual amplitude is statistically insignificant (95% confidence level) at 2 stations at Cebu (39) and Surigao in the Philippines Sea. On the other hand, the semiannual residual component is    50, in the south-eastern SCS) reflecting considerable influence of the steric component at these stations. In general, the semiannual harmonic at the tide gauges around the Malacca Strait and the south-eastern SCS is dominated by the steric component, as indicated by the fact that the semiannual amplitudes of the steric are larger than those of the local wind at most stations (except Kukup and Sejingkat (51)) and do not show significant differences in phase with IB corrected tide gauge (Figures 7c and 7d). The seasonal cycle of the steric component is also computed using 200 m and 700 m as reference depths. Interestingly, the steric component computed down to 200 m depth shows significant differences with that referenced to 500 m in the semiannual amplitudes at all stations in the Malacca Strait, with values that are about 4 cm lower for the steric referenced to 200 m. This result suggests a considerable influence of the steric component from the subsurface layer on the seasonal cycle in these particular regions. No significant difference is found between the seasonal cycle of the steric for reference depths of 500 m and 700 m. Using the simple barotropic model, the average annual amplitude of the contribution from the local wind is 8 cm, with a maximum value of 27 cm at Ko Mattaphon 14, in the Gulf of Thailand ( Table 2). The estimated annual phase at most tide-gauge locations peaks between October and February. Most of the stations located outside the continental shelves of the SCS including the south-eastern SCS have annual amplitudes smaller than 3 cm. For the semiannual harmonic, the average semiannual amplitude is 2 cm with the largest value of 6 cm at Pom Phrachun (16) and Ko Sichang 17, in the Gulf of Thailand. In general, the annual harmonic of the IB-corrected tide gauges located on the continental shelves of the SCS and the Gulf of Thailand are dominated by the local wind (Figures 7a and 7b). For the semiannual harmonic, the local wind only dominates the IB-corrected tide gauges at 10 stations, mostly located in the northern SCS (Figures 7c and  7d). The annual and semiannual amplitudes of local wind are larger than those of the steric at these regions with the IB-corrected tide gauge leading the local wind by less than 30 days and 20 days for the annual and semiannual phase, respectively. Large different phases of forcing factors (steric and local wind) with the IB corrected tide gauge records, for annual (>30 days) and semiannual (>20 days) harmonics, were observed at six and 10 stations, respectively. These indicate neither the steric component nor the barotropic model can approximate the observed (IB corrected) amplitudes and phases. For example, at Lahad Datu (45) in the Celebes Sea, the annual phase lag of steric component with IB corrected tide gauge is about 100-120 days. The other factors such as the seasonality of currents and circulation maybe the responsible forcing factors of SSLC at these stations. In order to examine the different influences of the forcing mechanisms on the continental shelf and in the open ocean area of the SCS, we undertook an analysis using the steric component referenced to 500 m for the period 1993-2012. The annual amplitude of the steric component has a basin average value of 5 cm (Figure 8a) and an annual phase peaking between April and September (Figure 8b). The annual amplitude of the steric component is largest, up to 15 cm, in the northwest of the Philippines, similar to the result observed from altimetry (Figure 4a). The enhanced amplitudes in this area may be related to changes in the eddy circulation and water mass redistribution associated with them [Wang et al., 2012;Yuan et al., 2007]. For instance, during summer, a spin up of the anti-cyclonic eddy caused water to accumulate in the interior of the eddy, which in turn would result in sea level rising in the eddy and falling on the coast. The annual amplitude is lower, less than 3 cm, in the south-western part of the SCS and in the Gulf of Thailand, and statistically insignificant (95% confidence) in the Celebes Sea. The annual amplitude of the steric component has similar spatial patterns to the altimetry data in terms of amplitude and phase in the central deep basin of the SCS, the northern Malacca Strait, the Philippines Sea and the Sulu Sea. This suggests that the SSLC in the deep basin is mainly triggered by the seasonal heating and cooling of the ocean and confirms findings from Cheng and Qi [2010]. This heating and cooling, during the Southwest Monsoon and the Northeast Monsoon respectively, can be due to surface heat fluxes or local Ekman pumping induced by wind stress curl. The semiannual amplitude of the steric component is statistically insignificant (95% confidence level) across most of the study domain in the Philippines Sea (Figure 8c). The semiannual amplitude of the steric component is larger, up to 6 cm, in the northernmost part of the Malacca Strait. In the northern Malacca Strait and Journal of Geophysical Research: Oceans 10.1002/2015JC010923 northern SCS, it peaks around May while the regions south of Vietnam peak in January (Figure 8d). The spatial pattern of the semiannual amplitude and phase of the steric component in the northern part of Malacca Strait and south of Vietnam is similar to that observed from altimetry (Figures 4c and 4d), indicating that steric variations are the main forcing of the semiannual component of observed SSLC in these regions. The larger variance explained by the residual (i.e., steric-corrected altimetry) is found in the south-western SCS (70-90%), which primarily represents the contribution of wind (Figure 9). This is supported by the results of a number of tests using a simple barotropic model which show that the SSLC in the coastal tide gauges in this area is dominated by wind ( Figure 7). The mass displacement between sea level in the northern SCS and south-western SCS, on the continental shelves, is due to the current induced by the Northeast Monsoon wind. During the commencement of the Northeast Monsoon, sea level on the northern shelf of the SCS rises by up to 20 cm between the end of October and November (Figure 10d) and falls by 10 to 15 cm between December and January (Figures 10a and 10i). The sea level in the south-western SCS, including the Gulf of Thailand, rises by up to 20 cm between December and January (Figures 10a and 10i) before decreasing by 10 to 15 cm in March (Figures 10b and 10j). During the Southwest Monsoon (June-August), the sea level on the continental shelves of the SCS falls by 10 to 20 cm (Figures 10c and 10k). The observed seasonal fluctuation of sea level in the southwestern SCS is in agreement with the findings of Tkalich et al., [2013], who found the annual sea level is about 6 20 cm in the Singapore Strait and the shelf area of the south-western SCS and is driven by the monsoon. Journal of Geophysical Research: Oceans 10.1002/2015JC010923"}, {"section_title": "Data", "text": "Several different data sources were used in this analysis. Tide gauge records with more than five years of data were obtained from the Permanent Service for Mean Sea Level (PSMSL) [Holgate et al., 2013] (http:// www.psmsl.org) and from the Research Quality Database of the University of Hawaii Sea Level Center (UHSLC) (http://www.uhslc.soest.hawaii.edu). The PSMSL database contains monthly averages from both the Revised Local Reference (RLR) and Metric data sets, while the UHSLC database comprises high resolution records (hourly). In order to make both data sources comparable, the UHSLC records were averaged to monthly means if at least 75% of data were available each month. Tidal signals were removed by applying a 72 h moving average to the UHSLC hourly record before calculating the monthly average. The difference of reference values of Metric and UHSLC data with the RLR data were corrected using the datum information provided on the PSMSL webpage for each station. The RLR records were selected as the primary data set because the monthly means have been reduced to a common datum by the PSMSL, except in the Kaohsiung (31-station number as in Figure 1), Ishigaki (33) and Vungtau (18) tide gauge records. The Metric and UHSLC data were chosen, at the Kaohsiung and Ishigaki tide gauge stations, respectively. For Kaohsiung station, the Metric data are available from 1973 to 2010 with a different datum for the period 1973-1996and 1997. The Metric data (1973-1996 show good agreement with the RLR data for their common period (1973)(1974)(1975)(1976)(1977)(1978)(1979)(1980)(1981)(1982)(1983)(1984)(1985)(1986)(1987)(1988)(1989). The UHLSC data for Kaohsiung station are available from 1980 to 2010 but shows disagreement with the RLR and metric data during 1980-1981 (up to 17cm). Furthermore, a comparison of the monthly UHSLC data with the nearest altimetry data point also shows differences for the period 1999-2003 of about 10 cm. As a result, we have more confidence in using the metric data  for the Kaohsiung station. For Ishigaki station, the UHSLC data are longer (1969-2012) compared to the metric and RLR data . As for the Vungtau station, the monthly tide gauge record was acquired from the EWATEC-COAST project (http://www.tu_braunschweig.de/ewatec). This data set has a longer record (1980-2012) than the RLR data set  and both agree well during their common period. Maps of Sea Level Anomalies (DT-MSLA), produced by SSALTO/DUACS, were obtained from AVISO (Archivage Validation Interpr etation des donn ees des Satellites Oc eanographiques) (http://www.aviso.oceanobs. com/en/data/products/sea-surface-height-products/global/msla.html). These were used to estimate the SSLC on the continental shelves and open ocean regions. The data set is a merged sea level anomaly product from various altimetry missions (i.e., T/P, Jason-1, Jason-2, Envisat, ERS-1 and 2 and Cryosat-2) to which all standard corrections have been applied, including the solid earth tide, ocean and pole tides, the wet and dry tropospheric corrections, the ionospheric correction, and the dynamic atmospheric correction (DAC). Note that DAC uses a barotropic model (MOG2D) forced by atmospheric pressure and wind for periods shorter than 20 days and the inverse barometer, otherwise. The sea level anomalies are available on a 1/38 3 1/38 global Mercator grid at weekly intervals. In this study, we averaged the weekly data to compute monthly mean time series for the period January 1993 to December 2012. Quality checks for each tide gauge record were performed by comparing the detrended data to those of nearby stations and to sea level anomalies from the nearest altimetry grid point (minimum correlation coefficient of 0.65), with the aim of identifying and removing outliers. As the tide gauge records at Quarry Bay and North Point contain matching datum information [Ding et al., 2001], they were merged into one time series and renamed as Hong Kong (28). Two long tide gauge records at Manila (35), in Philippines and Pom Phrachun (16), in Thailand are known to contain geophysical and anthropogenic signals since the 1960s, caused by land subsidence from excessive groundwater pumping [Phien-wej et al., 2006;Rodolfo and Siringan, 2006;Raucoules et al., 2013]. The nonlinear trend at these tide gauges was estimated by fitting a sixth (r 2 50.86) and fifth (r 2 50.87) degrees polynomial at Manila and Pom Phrachun, respectively, and then removed from the records. Trisirisatayawong et al. [2011]||||| assessed the changes in the crustal motion Journal of Geophysical Research: Oceans"}, {"section_title": "Methods", "text": "We estimated the contribution of changes in surface atmospheric pressure by using the inverted barometer (g IB ) approximation, as follows: where q o is water density, g is the acceleration of gravity, P is the local atmospheric pressure and P a is the spatial average of pressure over the global oceans. Increases of 1 mb in local atmospheric pressure correspond to decreases of 1 cm in local sea level. The long-shore and cross-shore winds were estimated from the u and v wind components to better assess the forcing of wind on the SSLC in the study area. The long-shore and cross-shore winds were computed as follows:p wherep andq refer to the long-shore and cross-shore winds, respectively; and h is the angle between the wind direction and the coastline. The longshore wind is positive if it blows over the shelf with the coast on its right, whereas the cross-shore wind is positive if it blows from the ocean toward the coast. The steric height (g s Þ was computed from temperature (T) and salinity (S) data profiles by: where q s is a reference density; H is the reference depth; q 0 represents a density deviation with respect to the time average of the in-situ density; and z denotes depth. In this study, the steric height was computed taking 500 m as the reference depth in order to consider the steric variations due to seasonal intrusion of water from the Philippines Sea into the SCS [Qu et al., 2000;Fang et al., 2009]  the continental shelf, should not be taken at a point too close to the tide gauge, where water may be too shallow to give a significant steric contribution. Bingham and Hughes [2012] found that taking the steric signal from a site close to the tide gauge but on the upper continental slope at a depth between 500 m and 1000 m provided a good estimate of the steric height. Here the steric height at the tide gauges located in the Malacca Strait, the northern SCS, the Philippines Sea and the south-eastern SCS is taken at the steric grid point showing the highest correlation with the tide gauge (for which all are located over the continental slope). For instance, the coastal steric signal for all tide gauges in the Malacca Strait was taken from the northern area where water depth reaches up to 1000 m. However, for tide gauge stations located in the south-western SCS and the Gulf of Thailand, the correlation is mostly negative due to the formation of gyre circulation near the edge of the shelf off the south of Vietnam [Fang et al., 2012]. Hence, for such tide gauges, the seasonal harmonics of the coastal steric component were estimated by selecting the grid point providing the lowest root mean square error when being compared to the tide gauge record within a 48 3 48 area around the tide gauge station. To estimate the seasonal cycle, the annual and semiannual harmonics have been calculated for each variable by a common least squares fit of the following form: where A a /P a and A sa /P sa are the amplitude and phase of the annual and semiannual cycle, respectively, and t is time in days. The mean of the time series, and a linear trend, are removed before fitting equation 5to the records. Phases in this equation are expressed in days, with zero phase corresponding to 1 st January. The uncertainties of the estimated amplitudes and phases are given as a standard error, which is then doubled to provide 95% confidence intervals [for further discussions see also Plag and Tsimplis [1999]. The tide gauge records cover different periods and contain gaps. Therefore, interpretation of the obtained seasonal components must include the possibility of temporal changes in the seasonal signals. To assess the sensitivity of the estimated amplitudes and phases of the annual and semiannual cycle, to different data periods and lengths, the harmonics were quantified for: (1) the whole record, at each site; (2) the period 1980-2012, which is common to most tide gauge records; and (3) the period 1950-2012. The estimated amplitudes and phases are not statistically different (not shown) between the three periods. The comparison of the harmonic analysis at Manila and Pom Phrachun for the whole record with the record prior 1960 also showed no significant differences and thus, both records are assumed to be reliable for this study (see the discussion of both tide gauges in Section 2). Accordingly, the analyses of seasonal harmonics were calculated for two representative periods; the period 1950-2012; and 1993-2012. The period 1950-2012 was selected since all forcing variables are available for this period. The period 1993-2012 was chosen to compare the seasonal cycle from 43 tide gauge records (those containing at least 75% of data for this period) with that from the nearest grid point of altimetry data (using only valid measurement of monthly tide gauge data). The contribution of local wind to the coastal mean SSLC was quantified using a simple barotropic model formulated by Sandstrom [1980]. This model estimates the setup of sea level ðg W Þ from the maximum expected along-shore currents induced by 3% of the local long-shore wind (p) on the shelf by: where f is the Coriolis parameter for the corresponding latitude of each station and L is the shelf-width (which we took as the distance from the coast to the 200 m isobath). The temporal variability of the SSLC was assessed by fitting equation (5) to 5 year overlapping periods (shifted by one year) of the tide gauge records that contained at least 36 months of data. The period of five consecutive years was proposed by Tsimplis and Woodworth [1994] to gain robust values for the amplitude and phase of the seasonal cycle. To estimate the contribution of different forcing factors to the temporal variability of the SSLC, equation 5was also fitted to the steric height, barotropic contribution estimates with the Sandstrom model, u and v wind components, p and q wind components, sea level pressure, surface air temperature and two climate indices (MEI and WNPMI). Then, a stepwise regression with forward selection was applied with the observed tide gauge records as the dependent variable and the forcing Journal of Geophysical Research: Oceans 10.1002/2015JC010923 factors described above as predictors. The stepwise regression allows identification of a regression model containing only significant predictors that explained the largest fraction of sea level variability [see also Dangendorf et al., 2013b]. The mean was subtracted from each parameter before fitting the regression model and the statistically insignificant values were also included to compute a continuous prediction model for the whole available record without gaps. Due to the 5 year overlapping periods of annual harmonic, the statistical significance (95% confidence level) of the regression model, calculated for each station, take into account the reduction in the degrees of freedom following the equation proposed by Pardo [2008]: where Rdf is remaining degrees of freedom, Udf (5 year) is used degrees of freedom and Odf is original degrees of freedom. Statistical significance of the predictor is based on t test at the 95% confidence level. To estimate the maximum and minimum of the total SSLC, the seasonal variation of coastal mean sea level was estimated on the basis of a monthly climatology of the observed tide gauge record. The monthly climatology was computed from the mean value for each month over the whole period of 1950-2012, after removal of the mean and long-term trend. Then, the height and month in which such climatology reaches its maximum and minimum values were determined. The maximum range of sea level is calculated from the difference between the average maximum and minimum of climatology data."}, {"section_title": "Results and Discussion", "text": ""}, {"section_title": "The SSLC at Tide Gauge Sites", "text": "The amplitudes and phases of the annual and semiannual coastal SSLC, at the 53 tide gauge sites in the study area, are listed in Table 1 for the maximum period covered by each tide gauge within the period 1950-2012. The annual amplitudes show large spatial variability with a maximum value of 23 cm at Ko Mattaphon (14) in the Gulf of Thailand and an average value across the study area of about 11 cm. There is only one station (Tawau (44) in the Celebes Sea) where the annual amplitude is not statistically different from zero (at the 95% confidence level). The annual amplitude is generally larger (>15 cm) at stations in the south-western SCS, the Gulf of Thailand and around the southern Vietnam coastline, where the shelf is wider. The annual cycle peaks between July and January, with the sites around the Malacca Strait and the Philippines Sea peaking earlier and those in the Gulf of Thailand peaking later. The semiannual amplitude has an average value of 4 cm and a maximum value of about 7 cm at Lumut (4), in the Malacca Strait, Danang (20), in the western SCS, and Zhapo (26), in the northern SCS. There are two stations (Puerto Princesa (43) in the Philippines Sea and Xi Sha (53) in the central SCS) where the semiannual is statistically insignificant. It reaches its maximum between March and June, with the sites around the north-western Philippines Sea peaking early and the sites at the southern SCS peaking later. The seasonal cycle accounts on average for 60% of the observed monthly mean sea level variability at the tide gauges. It accounts for more than 88% in the coastal areas along the east of Peninsular Malaysia with maximum explained variance of 92% at Tanjung Gelang (11). The minimum percentage of explained variance (6%) is obtained at Tawau, in the Celebes Sea. In the Malacca Strait, there is no significant difference between the annual and semiannual amplitudes at the tide gauge records except in Ko Taphao Noi (1) and Pulau Langkawi (2). This indicates that the magnitude of annual and semiannual cycle in the middle and southern part of the Malacca Strait are comparable at each station. To assess the role of atmospheric pressure on the annual and semiannual harmonics at the tide gauges, the inverse barometer (IB) correction was applied to the sea level records. The resulting amplitudes and phases of the annual and semiannual coastal seasonal cycle after applying the IB correction are also listed in Table  1 for the maximum period spanned by each tide gauge, within the period 1950-2012. Correcting for atmospheric pressure effects significantly changes (either increasing or decreasing its value) the annual amplitude at 22 stations: these are mostly located in the northern and western parts of the SCS, the Gulf of Thailand and the north-western Philippines Sea. The largest increase is from 9 to 15 cm at Dongfang (23), in the northern SCS, which account about 74% of changes in the annual amplitude (supporting information Figure  S1). On the other hand, the largest decrease is from 16 to 9 cm at Keelung (32), in the north-western Journal of Geophysical Research: Oceans"}, {"section_title": "The SSLC from Altimetry", "text": "The analysis of the sea surface height anomalies from satellite altimetry provides better spatial resolution of the seasonal cycle (including differences between the open ocean and the continental shelf). The annual amplitude from the altimetry data shows an average amplitude of about 9 cm and exhibits significant spatial variability across the SCS (Figure 4a). Larger mean annual amplitude values (18-24 cm) are found in the Gulf of Thailand, whereas the lowest amplitudes (3 cm) occur in the Celebes Sea. Large annual amplitudes are also observed along the coasts of the northern, western and south-western SCS, the Gulf of Thailand and the northwest of Philippines with values ranging from 13 to 24 cm. The annual harmonic peaks at different times across the study area (Figure 4b). On the northern and southern continental shelves, the annual harmonic peaks between November and January. In the central deep basin of the SCS, the Sulu Sea, the Malacca Strait and the Philippine Sea, the annual cycle mainly peaks between July and September. The Journal of Geophysical Research: Oceans"}, {"section_title": "The Forcing of the Seasonal Cycle", "text": "Having determined the general characteristics of the seasonal cycle across the study area, we now turn our attention to the examination of potential forcing mechanisms. To address this problem, we quantify the seasonal cycle in: (1) the steric component; (2) the residual resulting from the removal of both the IB effect and the steric component from the total sea level; and (3) the wind contribution as estimated by a simple barotropic model (Equation 6). It is important to note that, besides the contribution of buoyancy fluxes, the steric component accounts also for the baroclinic response to the wind and the advection of heat by ocean surface currents. The residual provides a measure of the contribution of changes in ocean bottom pressure to the seasonal cycle, including those induced by the barotropic response of the ocean to changing winds (remote and local) and by changes in freshwater fluxes. The simple barotropic model (Equation 6) is only calculated at tide gauge sites. Note that because the barotropic model is computed using the long-shore wind from the grid point showing the highest correlation within a 48 3 48 area, it represents the contribution of local wind only. The annual amplitudes of the steric height component computed down to 500 m are significant at all tide gauge stations with values ranging from 2 to 11 cm ( Table 2). The average annual amplitude of the steric height is 5 cm with most of the stations reaching a maximum between August and November. The smaller values observed at stations mostly located in the southwestern SCS and the Gulf of Thailand while the larger values found in the stations in the northern Philippines Sea. The annual amplitude of the residual (corrected for steric and IB effect) is statistically insignificant (95% confidence level) at San Jose (36) and Surigao (40) in the Philippines Sea indicating that the steric component is the major forcing mechanism at those sites (supporting information Table S1). A comparison of the annual amplitude and phase from IB corrected tide gauge records with those from the steric and local wind indicates that the annual harmonics at most tide gauge sites in the Malacca Strait and the Philippines Sea are dominated by the steric component (Figures 7a and 7b). The annual amplitude of the steric component is larger than local wind, at most tide Journal of Geophysical Research: Oceans"}, {"section_title": "Temporal Variability of the Seasonal Cycle", "text": "Next we examine whether the amplitudes and phases of the SSLC change over time at the tide gauge sites. The annual and semiannual harmonics around the SCS show different temporal variations (Table 3). The variation of the annual amplitude is largest at Honngu (21), in the western SCS, with a range up to 11 cm, corresponding to 55% of the maximum amplitude (19 cm) observed at this station. The largest range of annual phase is 63 days at Lahat Datu (45), in the Celebes Sea. For the semiannual amplitude, the largest range is with a value of 5 cm, largest at Danang (20), in the western SCS, corresponding to 45% of the maximum amplitude (11 cm). The largest range of the semiannual phases is 66 days at Ishigaki (33), in the Philippines Sea. The temporal variation in the annual amplitude is statistically insignificant (95% confidence level) at one station at Tawau (44), in the Celebes Sea. In the Malacca Strait, the temporal variations of the annual (Figure 11a) and semiannual amplitudes (not shown) from tide gauge records show spatial coherency. The decreasing trend of annual amplitudes from 1985 to 1999 is observed in all records except at Tanjung Keling (6) and Kukup (7). Interestingly, the temporal variations of the annual amplitude at the stations in the northern part of the Malacca Strait after 2005 indicate a decreasing trend, whereas the southern stations (Tanjung Keling and Kukup) register an increasing trend. Spatial coherence of the annual (Figure 11b) and semiannual amplitudes (not shown) is also identified in the tide gauge records in the south-western SCS. The decreasing trend of amplitudes from 1990 to 1995 is observed in all records except at Tanjong Pagar (8). In the northern SCS, spatial coherence of annual ( Figure 11c) and semiannual amplitudes (not shown) are evident at Zhapo (26), Macau (27), Hong Kong (28), Shanwei (29) and Xiamen (30). The annual amplitudes show a sharp decrease from 1976 to 1980. In contrast, the semiannual amplitudes show an inverse evolution with a pronounced peak in 1980 at these stations (not shown). The peak of the semiannual amplitude in 1980 is also noticeable at Ko Lak (15) and Ko Sichang (17) in the Gulf of Thailand. The annual amplitudes at Legaspi (37), Tacloban (38), Cebu (39) and Davao (41) peak in the 1968/1969 (Figure 11d). In order to assess the forcing of the temporal variability of the seasonal cycle, a harmonic analysis was also performed on de-trended time series of wind, steric height, the simple barotropic model, sea level pressure, surface air temperature, and two climatic indices (MEI and MI). Then, their influence on the annual amplitudes of the SSLC was assessed via stepwise regression. The surface air temperature was included as an Journal of Geophysical Research: Oceans 10.1002/2015JC010923 additional predictor due to the potential contribution from temperature difference between continental landmass and sea that can affect coastal SSLC [Plag and Tsimplis, 1999]. The climate indices are assumed to represent the regional forcing while other predictors act as a local forcing of sea level variability. Two multiple regression models were used with different initial conditions in the wind forcing. These differ with respect to the direction on which the wind components are projected using either: (1) u and v wind components; or (2) p and q wind components (along-shore or cross-shore winds). The regression models for each site and the associated predictors are selected based on significance (95% confidence) and the percentage of sea level variance explained by each model. The time series of the seasonal cycle estimated by the regression model is shown for comparison by the red lines in Figure 11. The average variance explained by the regression model is 66% with a maximum value of 97% at Pulau Langkawi (2), in the Malacca Strait (supporting information Table S2). In the Malacca Strait, the explained variance of the regression model at four stations (Pulau Langkawi, Pulau Pinang (3), Lumut (4)and Pelabuhan Kelang (5)) exceeds 88% leaving only a minor part unexplained (Figure 11a). The u wind component alone is able to explain between 52% and 88% of the temporal variability of annual sea level cycle at these stations (supporting information Table S3). Note that the percentages of variance accounted for by the u wind alone (except Pelabuhan Kelang) includes the interaction effects (for further discussions see also Jaccard and Turrisi [2003]), therefore they share the variance with the other significant predictors. Nevertheless, the main aim of this analysis is to identify the significant forcing mechanism of temporal variability by optimizing the regression model rather than estimating the unique contributions of forcing factors to the observed changes. The u wind is also significant (95% confidence level) at all stations in the Malacca Strait (except Ko Taphao Noi) signifying a dominant role of forcing mechanism on temporal variability in this region. There is no clear forcing parameter inducing the increasing trend after 2005 at Kukup and Tanjung Keling. In the northern SCS, the sharp decrease of annual amplitude between 1976 and 1980 can be attributed to the influence of cross-shore wind (supporting information Figure S3a). As for the Philippines Sea, Journal of Geophysical Research: Oceans 10.1002/2015JC010923 the peak of annual amplitudes in the 1968/1969 can be partly associated to the changes of long-shore wind component (supporting information Figure S3b). Atmospheric pressure and surface air temperature are found to have considerable influence in the northern SCS and the Philippine Sea. The alteration between the higher pressure and cooler Northeast Monsoon associated with the Siberian High, and the warmer and lower pressure Southwest Asian summer Monsoon, Journal of Geophysical Research: Oceans 10.1002/2015JC010923 may explain the influence of atmospheric pressure and surface air temperature. The inclusion of climate indices is significant at 27 stations, increasing the variance explained by the regression model on average by about 36% and by a maximum of 83%. However, it must be noted that several predictors used are not independent, for instance, atmospheric pressure and wind. Therefore, it is questionable whether it really reflects direct effects rather than better correlation with other physical predictors. The varying importance of the driving factors between sites signifies the complexity of the forcing of the temporal variability in the seasonal cycle. The different lengths of record for each station may also influence results. In summary, the forcing of temporal variability does not show coherency with the major forcing in the mean seasonal cycle, similar to the findings from Torres and Tsimplis [2012] in the Caribbean Sea."}, {"section_title": "The Seasonal Variation of Coastal Mean Sea Level", "text": "Up to now we have considered the annual and semiannual cycle separately. Now we consider the combination of the two harmonics, which equates to the observed cycle. The changes in magnitude and period of maximum sea level particularly, are important to consider from a coastal flooding point of view [Dangendorf et al., 2012]. The height and month in which the seasonal cycle reaches its maximum and minimum was calculated as an average climatology and is listed in Table 4 for each of the study sites. The seasonal coastal sea level in the SCS and the Gulf of Thailand peaks in the period between November and December. Interestingly, although only separated by Peninsular Malaysia, there is a large difference of Figure 11. The temporal variability of annual harmonic from observed tide gauge records (blue) and from the regression model (red). Vertical bar represent the standard error (95% confidence). Journal of Geophysical Research: Oceans 10.1002/2015JC010923 the maximum sea level in the coastal area between the Malacca Strait (8-9 cm) and the south-western of the SCS (19-29 cm). This is due to the different forcing mechanisms. For instance, the steric component has a larger influence in the Malacca Strait (as shown at Pulau Pinang (3) in Figure 12a). Furthermore, the period of maximum coastal sea level in the Malacca Strait differs between the northern part in May and June, and the southern part in November, mainly representing the first and second peak of the semiannual harmonics of steric, respectively. This also indicates greater importance of the semiannual cycle compared to the annual cycle in this sub region. In the south-western SCS, the wind forcing is more dominant (as shown at Cendering (12) and Vungtau (18) in Figures 12b and 12c). In the Philippines Sea, the coastal sea  Figure 12d). The minimum seasonal coastal sea level in the south-western of the SCS mainly occurs during June and July whereas at the Philippines Sea stations, it occurs between January and February. Interestingly, these results demonstrate a seesaw effect of sea level gradient, an opposite phase difference about 1808 between stations in the south-western SCS and the Philippines Sea. The average of maximum range of seasonal coastal sea level from all station is 25 cm. The highest range is up to 50 cm at Ko Mattaphon (34) in the Gulf of Thailand. Most of the stations located along the southwestern SCS and Gulf of Thailand have a maximum range more than 36 cm associated to the strong influence of wind during the Northeast Monsoon."}, {"section_title": "Conclusions", "text": "The SSLC around the SCS has been investigated using tide gauge records and altimetry data, revealing significant spatial variability in both amplitude and phase. The coastal mean annual amplitude is up to 23 cm, reaching maximum values mainly between July and January. For semiannual harmonic, the mean amplitude reaches 7 cm and peaks between March and June and again six months later. The seasonal cycle accounts on average for 60% with maximum values of up to 92% of the monthly sea level variability along the coast. Correcting for atmospheric pressure caused significant changes in the annual harmonics at 22 tide gauge stations, mainly located in the northern and western SCS, the Gulf of Thailand and the north-western Philippines Sea. Furthermore, atmospheric pressure provides the main forcing of the semiannual harmonics at three stations located in the Philippines Sea. The SSLC from altimetry shows significant differences of annual harmonics between the continental shelves of the SCS (including the Gulf of Thailand), and the deeper basin in the SCS, the Philippines Sea, the Sulu Sea and also the Malacca Strait. On the continental shelves, the annual amplitudes range between 13 and 24 cm and peak between November and January. In contrast, the annual amplitude in the deeper basin of Journal of Geophysical Research: Oceans 10.1002/2015JC010923 the study area is lower, ranging between 3 and 10 cm and reaching a maximum between July and September. The seasonal cycle exert greater influence on the continental shelf areas of the Gulf of Thailand, the south-western and the northern SCS with the percentage of explained variance about 70-90% of the sea level variability. A comparison of the annual harmonics estimated from tide gauge records and nearest altimetry grid point, showed significant differences at 20 stations, mostly located at the south-western SCS, the western SCS and the Gulf of Thailand. The altimetry data underestimate the amplitude of annual cycle on average about 5 cm with maximum values of up to 10 cm. For the semiannual harmonic, tide gauge records and altimetry are in better agreement with significant differences at only one station. The steric component dominates the SSLC in the Malacca Strait, the Philippines Sea, and the central deep basin in the SCS. The maximum annual and semiannual amplitude of the steric component is up to 15 cm and 7 cm, respectively with the annual steric phase generally leading the tide gauge (IB corrected) by less than 30 days. In the continental shelves of the SCS and the Gulf of Thailand, the SSLC is generally dominated by the forcing of wind, associated with the Monsoon wind. Using a simple barotropic model (Sandstrom, 1980), the maximum annual and semiannual amplitude of sea level induced by local wind is 27 cm and 6 cm. The wind phases generally lag the tide gauge records (IB corrected) by less than 30 days and 20 days for the annual and semiannual phase, respectively. However, neither the steric component nor the barotropic model can approximate the SSLC at several tide gauge stations (see chapter 4.3). This could be due to the remote forcing factors such as the current and circulations. Estimating the contribution of the seasonal variability of circulation pattern and water exchange between basins to the seasonality of sea level in the SCS, should be considered in the future. There is considerable temporal variability in the amplitudes and phases of SSLC. The variation of the annual and semiannual harmonics is up to 63% and 45% of the maximum amplitude, 15 cm and 11 cm, respectively. The spatial coherence is stronger in the Malacca Strait and in the south-western SCS. A stepwise regression analysis explained the variability on average by about 66%, with a maximum of 97%. The temporal variability of annual sea level cycle in the Malacca Strait is mainly associated with the zonal wind. In the other region, the forcing factors varied between stations indicating the complex forcing of the temporal variability. Furthermore, the forcing of temporal variability is not consistent with the sea level forcing in the mean SSLC. Nevertheless, the results of our analysis provide valuable information about the forcing mechanism responsible for the changes in the SSLC in this region. This information can be used to build dynamical models with improved predictive capability, and thus to produce better prediction of possible future changes in the SSLC that can be included, for instance, in impact assessment. The average of maximum range of the total (i.e., annual and semiannual harmonics combined) SSLC is 25 cm, with the highest range up to 50 cm. The maximum range is larger, more than 37 cm, along south-western parts of the SCS and the Gulf of Thailand. During the Northeast Monsoon, the maximum period of coastal seasonal sea level together with the occurrence of spring tide and storm surges, will increase the risk and probability of coastal flooding in these regions. Moreover, the risk of flooding is greater along the east coast of Peninsular Malaysia due to the heavy precipitation (>12 mm/hr) during the Northeast Monsoon concentrated along the coastal flood prone area [Varikoden et al., 2011]. Therefore it is important to incorporate the information of mean SSLC and its temporal variability in the assessment of coastal risk and vulnerability in this region."}]