[{"section_title": "Abstract", "text": "The lack of readily available biomarkers is a significant hindrance toward progressing to effective therapeutic and preventative strategies for Alzheimer's disease (AD). Blood-based biomarkers have potential to overcome access and cost barriers and greatly facilitate advanced neuroimaging and cerebrospinal fluid biomarker approaches. Despite the fact that preanalytical processing is the largest source of variability in laboratory testing, there are no currently available standardized preanalytical guidelines."}, {"section_title": "Introduction", "text": "There is a large concern regarding the lack of reproducibility of research findings across independent laboratories, within laboratory settings, and particularly from academic laboratory settings to industry settings [1] [2] [3] [4] . In fact, an \"unspoken rule\" among venture capital firms is that 50% of published studies will not replicate in industrial labs [4] and the National Institutes of Health (NIH) recently outlined a plan to address this problem [2] . While there are a large number of factors contributing to this issue, one key factor is the substantial variability in study designs, definitions, outcomes, and analytic models that make replication less likely [1] . While in the discovery phase of science, it is important to have substantial flexibility; however, as scientific discovery proceeds closer to the clinic, there is an increased need for optimization and standardization if these discoveries are to replicate reliably and pass regulatory authority. Unfortunately, there is oftentimes a disconnect between academic and industrial laboratories that hampers the movement of important scientific discovery to clinical practice, and the generation of standardized methods is one way to bridge this gap. The purpose of this white paper is the generation of the first set of guidelines for use in research of bloodbased biomarkers of Alzheimer's disease (AD).\nA major impediment to the therapeutic development and clinical trial design for AD is the lack of a sensitive, easilyobtained biomarker of disease [5] [6] [7] . Biomarkers of disease presence, subtypes (i.e., endophenotypes), treatment response, and progression are needed to advance therapeutic and preventative opportunities for this rapidly growing health care crisis [5, [8] [9] [10] [11] [12] [13] . Biomarkers are also considered promising tools to enhance all phases of drug discovery and development programs by allowing the validation of mechanisms of action [14] . They can be employed in clinical trials to improve diagnostic accuracy in trial participants, thus allowing cohorts of patients to be enriched with cases of AD (patient enrichment) [15, 16] . In light of this, such markers may not only be useful in patient identification, selection, and stratification into clinical trials, but may also be useful in the identification of novel therapeutic targets.\nOver the last two decades, the search for biomarkers that have diagnostic and prognostic utility in AD has grown exponentially [6, 11] with most work focusing on neuroimaging and cerebrospinal (CSF) methodologies [6, 11, 17] . Advanced neuroimaging and CSF techniques yield highly accurate diagnostic accuracy within the clinicbased settings for detecting AD and blood-based biomarkers represent an approach for enhancing the utility of imaging and CSF-based modalities by serving as a generalized screening tool. In fact, it has been proposed that bloodbased methods can serve as the first step in a multistep diagnostic process [7] as is the case with many other pathologies, such as cardiovascular diseases, infectious diseases, and cancer. All screen positives could be referred for neuroimaging or CSF assessment for confirmatory purposes (e.g. for diagnostics or enrollment into clinical trials).\nThere has been a significant increase in research efforts examining the potential for blood-based biomarkers of AD. While the search was largely unsuccessful for decades, recent work shows promise. In a seminal study, Ray and colleagues [18] analyzed 120 plasma-based proteins and developed an algorithm consisting of an 18-biomarker panel that accurately distinguished AD patients from healthy controls with an overall classification accuracy of 89% and accurately identified 81% of mild cognitive impairment (MCI) patients who progressed to AD within a 2-to 6-year follow-up period [18] . This study represented the first major support for the notion that an AD biomarker profile could yield excellent accuracy; however, enthusiasm waned when the findings did not crossvalidate on an independent assay platform [19] . Despite this initial setback, other groups have continued to identify promising signals in peripheral blood, suggesting that a bloodbased AD screen may be on the horizon [20] [21] [22] [23] [24] [25] [26] [27] [28] [29] . Recently, data from well-characterized international cohorts have yielded additional candidate biomarkers and panels [25, 30] . In the Texas Alzheimer's Research and Care Consortium (TARCC) cohort a serum-based algorithm yielded a 30-protein profile with a sensitivity of 88% and specificity of 82% for clinical AD diagnosis [31] . The biomarker panel from baseline plasma collected in the Australia Imaging Biomarkers and Lifestyle Study of Ageing (AIBL) study consisted of 18 analytes that could distinguish AD from healthy controls with a sensitivity of 85% and specificity of 93% [29] . A 17-biomarker panel was associated with the diagnosis of MCI and AD in independent cohorts from the University of Pennsylvania and Washington University in St. Louis, and two of these analytes were found to be highly correlated with the CSF t-tau/amyloid-beta (Ab) 42 ratio [30] , a strong predictor of future cognitive decline [32, 33] . There have been several markers consistently altered in AD across cohorts. As outlined by Kiddle and colleagues [34] , an example of these markers (and number of cohorts they have been replicated across) include: apolipoprotein E (APOE) (five cohorts), alpha-2-macroglobulin (five cohorts), complement C3 (five cohorts), pancreatic prohormone (five cohorts), serum amyloid P (four cohorts), tumor necrosis factor (two cohorts), and serum albumin (four cohorts). Many of these blood-based studies are similar in terms of utilizing a common analytical platform; however, the biomarker panels obtained are strikingly different, sharing only a few common analytes. For example, in the study by Hu and colleagues, several markers were significantly related to dementia status but in the opposite direction across cohorts despite the use of the same analytic platform. Additionally, several studies have examined the Alzheimer's Disease Neuroimaging Initiative (ADNI) proteomic database with different protein signatures reported [29] [30] [31] . The discrepant findings may be due to the approach employed as the ADNI cohort was utilized as the validation sample with the protein signatures being developed in other cohorts (i.e. University of Pennsylvania, Washington University, AIBL, TARCC). For comprehensive recent reviews of AD proteomic studies conducted across a broad range of cohorts see Lista and colleagues [35] and Kiddle and colleagues [34] .\nApart from the fact that different initial panels were tested (along with different study design), inconsistencies across study findings could be attributable to many preanalytical variables, both technical and biological, across studies which may have significant impact on the outcomes of the proteomic analyses. There are numerous possible sources of preanalytical variations or errors across studies [36] ; however, out of these, we have attempted to highlight only a few important ones. For example, the selection of study participants in terms of their ethnicity, lifestyle parameters, and statistically sufficient numbers could be an important source of variation. In addition, within-subject variation has long been highlighted as a possible source of concern as participants need to adhere to certain guidelines during the course of the study [37] . Variations could also be introduced by work staff in terms of sample collection mode, collection tubes, preparation, transportation, handling, storage and processing, and different calibration protocols of the equipment being used [37, 38] . One of the most important factors is the fraction of the blood used for testing (serum vs. plasma) as not only the abundance of a particular analyte may vary in these different fractions, but additives such as heparin, citrate, or ethylenediaminetetraacetic acid (EDTA) influence the required processing methods and their presence may impact biomarker stability and detectability [39] [40] [41] . Table 1 presents a list of some of the uncontrollable and controllable variables that can impact findings from studies of blood-based biomarkers in AD. The uncontrollable variables should be reported in the methods of protocols and taken into account statistically, whereas the controllable variables represent scientific areas where harmonization can occur.\nA key step toward generating consistency across studies with regards to blood-based biomarkers is the establishment of guidelines for preanalytical protocols [5, [42] [43] [44] [45] mirroring the ongoing initiatives for CSF AD biomarkers [17, 46, 47] . In fact, such standardization efforts for blood-based biomarkers have been underway in other fields for some time [24, [48] [49] [50] [51] [52] and the European Federation of Clinical Chemistry and Laboratory Medicine (available at http://efcclm.eu/) working group reported a substantial reduction in analytic error with improvements in standardization and reliability of instruments, reagents, and techniques [53] . Notably, the STandards for Alzheimer's Research in Blood biomarkers The ultimate goal of this international working group is the advancement of blood-based biomarkers for the improvement of diagnosis, treatment, and care for those suffering from AD. This international collaboration recently has provided an overview regarding the status of the field [5] and the Alzheimer's Association and Alzheimer's Drug Discovery Foundation recently and jointly convened a workshop to discuss the state of the field [54] . The current work from the working group was undertaken to (1) summarize selected methods across many ongoing longitudinal cohorts, (2) take an initial step toward the provision of guidelines for preanalytical methods for studies examining the development and role of blood-based biomarkers of AD, and (3) provide a minimum set of preanalytical variables that must be provided in publications (within the publication or as a supplement) in this line of work. Moreover, a set of next-step variables specific to the elderly and dementia populations to be examined has been proposed as areas for further research is needed on this topic to inform the next revision of the current guidelines."}, {"section_title": "Ongoing studies", "text": "Protocols from 10 (ongoing) AD cohort studies, collaborations, and the National Institute on Aging (NIA) Best Practice Guidelines (also currently being updated) were reviewed. These studies were selected as they (1) denote ongoing longitudinal studies with specific foci (including blood-based) in biomarkers of AD, (2) represent a significant portion of the investigators and/or publications in the topic area, and (3) were willing to share detailed protocols regarding blood collection and processing. These studies also presented established protocols for requesting biological samples. Those studies or groups who did not respond to either the request for protocols or for whom did not provide confidential methods were subsequently excluded. The studies included consisted of the following: the Alzheimer's Center Amsterdam [55] , Alzheimer's Disease Cooperative Study (ADCS) [56] , Alzheimer's Disease Neuroimaging Initiative [57] , Australian Imaging, Biomarkers and Lifestyle study [58, 59] , Dominantly Inherited Alzheimer Network (DIAN) [60] [61] [62] , Health and Aging Brain among Latino Elders (HABLE) [63] , King's Dementia Studies [64] , NIA Best Practices [65] , TARCC [25, 26, 31, 66] , and the Washington University Adult Children Study (ACS) [67, 68] .\nAs reported in Table 1 , there is significant consistency, but also inconsistency and lack of technical details across existing studies. The TARCC, ADCS, NIA Best Practices, and Alzheimer Center Amsterdam studies do not require fasting blood draws, whereas all others make use of them. On the other hand, while \"overnight fast\" was needed for several studies, only the DIAN protocol provided a definition for fasting duration (i.e. 8 hours). Many studies provided information regarding needle gauge to be used, but not all, with 21-gauge being the most commonly utilized size. Tube type varied across studies, with little consistency across the category of serum tube selected. Lavender/purple top EDTA plasma (K2) was commonly utilized for plasma collection. Centrifugation speed varied across studies by speed, duration, temperature and number of spins, with little consistency noted. Additionally, the number of revolutions per minute (rpm) in some studies but g-force in others was utilized for documentation of centrifugation speed. Sample preparation time (total) was most commonly less than or equal to two hours. Samples were most commonly stored immediately at 280 C, but some studies used immediate freeze on dry ice before placement in 280 C or liquid nitrogen. The most common longterm storage condition was 280 C."}, {"section_title": "Guidelines for preanalytical methods", "text": "There is a sizable literature documenting the impact of preanalytical methods on proteomic results, with most of the errors in laboratory testing coming from outside the analytic phase [37] and the majority originating from the preanalytical processing phase [69] [70] [71] [72] . Specifically, the role of preanalytical variables-affecting the quality of the utilized samples and, consequently, the quality of the data produced-is frequently disregarded in clinical proteomic analyses [73] . In this regard, it has been suggested that 46% of the errors in laboratory testing comes from the preanalytical phase [74] .\nIf any blood-based AD biomarkers are to move from research only (discovery phase or cross-validation phase) to in vitro diagnostic use, standardization of methodologies is compulsorily required. While there is still a great need for additional discovery in the area of blood-based biomarkers, there is also the necessity to \"lock-down\" or further clinically validate the potential utility of the putative markers currently available, which is the focus of the current guidelines. In the United States, all testing on human samples as clinical diagnostics must be performed within a regulated good laboratory practice setting as defined by the Clinical Laboratory Improvement Amendment of 1988 and other associated regulatory guidelines [37] . Many procedures for reaching clinical diagnostic status are determined by standard protocols, standard operating procedures and national or international standards, which include the preanalytical procedures provided by the Clinical Laboratory Standards Institute (CLSI, available at http://clsi.org/) (formally the National Committee for Clinical Laboratory Standards), with strict adherence to such standards being important [37] ."}, {"section_title": "Preblood draw", "text": "There are a number of patient/participant-related factors that will impact blood marker results that cannot be accounted for unless proper documentation is obtained. Some physiological variables to consider include demographics (age, sex, race/ethnicity), overall health, food and beverages consumed before collection, chronic drugs/ alcohol use, dietary supplements, smoking, gestation, diet, exercise, posture or bed rest, and patient medical conditions and medication status [37, 45, 48, 50, 52] . Attempts should be made to record information related to these variables as much as possible for appropriate adjustments to be made during the analysis of results [37, 48, 50] . As can be seen from Table 2 , most ongoing studies use fasting bloodcollection although the definition of fasting (i.e. 6, 8, 12 hours) is not articulated, despite the fact that fasting duration has a known impact on many blood-based biomarker levels. Prior work also suggests that some, but not all, blood biomarkers exhibit diurnal fluctuations [75] [76] [77] , which can have a substantial impact on the clinical significance of such markers [78] . Standardizing to a morning (before 10 AM fasting) blood draw would address the possible diurnal fluctuation issues by harmonizing sample collection times across studies."}, {"section_title": "Blood collection", "text": "There are a number of variables associated with the blood collection procedure itself that can impact laboratory assay results. Needle gauge, single-, or multidraw needles, and needle composition can impact assay results [37] , with hemolysis being a major consideration [79] [80] [81] [82] . For example, in an emergency department setting, the use of a 22-gauge needle was significantly associated with an increased risk of hemolysis [83] . Based on prior results, a 21-gauge needle is preferred [82, 84, 85] . Needles can be composed of various materials including stainless steel, aluminum, titanium, chromium, iron, manganese, nickel, and alloys which may impact assays that measure various metals within the blood. A detailed description of how to perform a venipuncture is provided by CLSI document H3-A6. There are advantages and disadvantages for both serum and plasma, which can fluctuate based on the specific marker of interest (e.g. see Rai and Vitzthum [37] ).\nThe site used for blood withdrawal is also an important aspect to consider [86] . The median cubital vein, usually easily found and accessed, is considered the preferred site. The preparation of the blood collection sites necessitates an accurate cleaning of the skin with alcohol (2-propanol) that should be allowed to evaporate, given that the contamination of blood with residual alcohol may induce hemolysis, increase the concentrations of some analytes, therefore, producing interferences [87] . In addition, the position of the patient (standing, lying, and sitting) can have an impact on the hematocrit, and, thus, may cause fluctuations in the levels of the analytes [88] .\nMoreover, the collection tube can significantly have an affect the obtained results [37, 82] . In fact, tube components of rubber stoppers, tube wall materials, surfactants, anticoagulants, separator gels, clot activators, anticoagulants can all impact assay results [82] . To comply with Occupational Safety and Health Administration (available at https://www.osha.gov/) guidelines to minimize risks from shattering tubes, plastic tubes have replaced glass collection tubes [82, 89] . Although plastic tubes offer many advantages, such as increased gas and water permeability, they also offer several disadvantages such as the adhesion of proteins to tube walls [82] , which has been an issue identified for CSF AD biomarkers [90] [91] [92] [93] . A detailed review of the impact of tube components on blood-based assay performance has been published by Bowen 2010 [82] . The order of tube collection in blood draw is also important (CLSI H3-A6 and Rai and Vitzthum [37] ) and the current recommendations can be found in Fig. 1. "}, {"section_title": "Blood processing", "text": "CLSI H18-A4 provides detailed information regarding procedures for handling and processing blood specimens for laboratory tests. The time considerations from blooddraw to storage, storage temperature, centrifugation parameters, storage volume and container type are all important for sample processing [37, 44, 79, 94, 95] . A key point for consideration is the separation of the sample from the tubes immediately after centrifugation. Although the processing time may vary by study and the importance by protein being measured, one should not store aliquots from serum/plasma that have been in contact with cells for more than two hours [79] . Review of Table 1 shows that most ongoing protocols require the total processing time to be 2 hours or less, which is preferable. See H18-A4 for a detailed list of uncentrifuged specimen stability for a range of times and sample types. Per H18-A4, centrifugation parameters that should not be subject to variation are: horizontal rotors should be utilized and first centrifugation speed should be at 2000g for 10 min [50] . Parameters that are subject to variation but should be documented include: (1) presence and type of separator, (2) temperature of centrifugation, and (3) number of centrifugations (single or double). With regards to postcentrifugation processing, the parameters that should not be subject to variation include: (1) serum/ plasma is not to be heated or otherwise inactivated, and (2) no storage at 220 C. Parameters subject to variation but requiring documentation include: (1) type of secondary container (tube, straw), (2) time interval between centrifugation and freezing, (3) sample temperature before aliquoting and freezing, (4) storage temperature, (5) number of freeze/ thaw cycles, and (6) duration of storage [50, 79] . Polypropylene tips and tubes are recommended to reduce adherence of analytes to walls."}, {"section_title": "Storage", "text": "It has been well acknowledged that protein stability and enzymatic activity are strictly dependent on temperature [96] . Long-term storage should be at 280 C or liquid nitrogen. According to Rai and colleagues [50] , liquid nitrogen storage should represent an excellent system to ensure protein stability. However, this way is not often practicable in comparison with the availability of 280 C freezers. Hence, the longterm storage temperature should be set at 280 C, using freezers whose temperature oscillations are absent or extremely diminished. If storage on dry ice is utilized for shipment, the headspace should be vented or the sample should be allowed to sit in 270 C freezer for nine hours before thaw to facilitate protein stability [97] . Fig. 1 provides the proposed guidelines for preanalytical processing outlined here."}, {"section_title": "Minimum data required for publication", "text": "For attempts to be made at cross-validation of biomarker findings across cohorts and laboratories, a minimum amount of information is required in addition to utilizing common methods. The select preanalytical elements outlined above need to be made available to the scientific community within the manuscript or online supplement. Fig. 1 not only provides the current guidelines, but also a template for provision of key preanalytic elements to be provided within publications for use by other teams."}, {"section_title": "Elderly-and dementia-specific preanalytic processing variables requiring additional research", "text": "Although the current guidelines provide the first-step in the process toward the generation of standards for the field, there remain several topics that require additional research. Most importantly relates to the question of how these preanalytical methods require modification for geriatric populations. For example, the World Health Organization points out skin breakdown as a potential complication of capillary sampling among elderly patients [98] . However, a systematic study of the impact of the proposed guidelines specifically among the elderly has not been undertaken. In fact, review of the previously published materials (including CLSI documents) does not provide information that is age specific. Therefore, it is recommended that the need for specific alterations in the guidelines for the target population be undertaken with the current guidelines as a starting framework."}, {"section_title": "Conclusions and future perspectives", "text": "For blood-based biomarker work in AD to progress, there is a need for the adoption of guidelines to standardize preanalytical methods across cohorts and laboratories [5, 42] . Such guidelines will allow for validation or crossvalidation across laboratories and cohorts to further validate the clinical performance of putative markers where signals have been established. The current guidelines are an attempt to verify such existing putative markers for specific clinical utilities and are not intended to stifle in any way new discoveries, which are certainly needed in the blood-based AD biomarker arena. The Blood Based Biomarkers (PIA) of IS-TAART combined the efforts of the STAR-B and BBBIG working groups for a single cohesive effort. This working group recently published a position article on the future of blood-based biomarkers of AD in which several needed areas of work were outlined, which included the need for guidelines and standards for preanalytical methods [5] .\nThe current project reflects the continued efforts of that working group and development of the first such international guidelines for preanalytical processing of bloods in AD research. It is anticipated that these guidelines will be updated as needed based on advancements of the field.\nThere are multiple potential clinical utilities for bloodbased AD biomarkers, and the study design must be reflective of that particular purpose. For example, blood-based AD biomarkers of disease presence, amyloid positivity, CSF biomarker positive (i.e. diagnostic markers) may be developed within clinic settings of case-control designs; however, if such markers are to be clinically useful in primary care settings, they must be tested and evaluated within such settings as the diagnostic accuracy will vary greatly due to the difference in disease base rates and diagnostic practice [99] [100] [101] . To date, no such studies have been carried out validating putative blood-based AD biomarkers within primary care settings. Issues around analytical assay validation, discovery versus clinical diagnostic-grade platforms, etc. have also received little attention. As with preanalytical processing variables, CLSI guidelines are currently available for assessing performance of assays (e.g. EP5, EP6, EP7, EP10, EP14, EP15, EP17, ILA21, ILA23), which should be followed if the assay is to move toward clinical application.\nTo date, there are numerous signals for putative bloodbased biomarkers and biomarker panels, although no consensus has been reached so far following Institute of Medicine (IOM) guidelines [102] . The purpose of the provision of the current guidelines from the international working group is to begin the process and dialogue of moving toward standardized methods that can be utilized to move putative blood-based biomarkers closer to clinical or additional research practices. An important step will be the detailed disclosure of the preanalytic parameters used for collection of clinical samples in publications of the clinical evaluation of biomarkers. The current document provides information regarding the minimum necessary information regarding these preanalytic methods used to facilitate crossvalidation of methods across research teams. Additional working group documents will address both analytic and postanalytic variables. 2. Interpretation: There are currently many different protocols for the preanalytic processing of blood samples in AD biomarker work. Guidelines were generated by this international working group as was a minimum set of information that warrants inclusion in research publications.\n3. Future directions: These guidelines will provide a starting-point for the harmonization of procedures for the validation phase of blood-based biomarker science in AD. As new research becomes available, these guidelines will be updated as needed."}]