[{"section_title": "Introduction", "text": "The investigation of the factors that can have meaningful relationships with learning and academic achievement have frequently been the focus of educational research. As a result, theorists, researchers, educators and policy makers are provided with valuable information (Kupari & Nissinen, 2011) . In particular factors stemming from students' background, such as gender and Socioeconomic status (SES) have been the focus of many studies and appear to be particularly salient for students' academic achievement (Areepattamannil, 2014; Hattie, 2009) . Apart from the background characteristics, other non-cognitive factors have also been examined in the existing research literature. Individuals who are otherwise similar tend to construe themselves differently based on the attributes they feel they possess, their confidence to employ them and others' judgements (Bandura, 1997; Bong & Skaalvik, 2003) . Since these perceptions are established, they act as determinants of action and further development at the cognitive, social and emotional levels and consequently of academic achievement (Bandura, 1997; Bong & Skaalvik, 2003; Guay, Ratelle, Roy, & Litalien, 2010; Stankov, 2013) . However, there is a paucity of studies that simultaneously examine the relationships between non-cognitive variables and academic achievement through multilevel analyses, highlighting a weakness among existing research (Green, Nelson, Martin, & Marsh, 2006; Snijders & Bosker, 2012 )."}, {"section_title": "Mathematics literacy and the case of Greece", "text": ""}, {"section_title": "A MULTILEVEL ANALYSIS OF GREEK MATHEMATICS ACHIEVEMENT 2", "text": "Mathematics constitutes one of the key competences for personal fulfilment and participation in school, society and the labour market of the 21 st century (European Commission, 2011) . It also appears to be a critical academic filter for students' educational pathways (Chiu & Klassen, 2010; Crombie et al., 2005; Wang, 2006) . PISA, which is one of the largest international assessment studies in education, has revealed that a large proportion of students internationally are low achievers in mathematics, with this proportion being particularly high in Greece (OECD, 2014a) . The PISA 2012 results indicated that the mathematics performance of Greek students continues to increase gradually, but it still remains below the OECD average. Greek students' performance is also below that of other countries with a lower level of economic development and expenditures per student (OECD, 2011a) .\nMoreover, the education system in Greece is characterised by an outdated and ineffective structure, and policy initiatives by successive governments have been haphazardly applied (OECD, 2011a) . Greece is also one of the few countries in Europe which lacks any form of external audit of teaching, school organisation or assessment (OECD, 2011a (OECD, , 2015 . PISA is the only indicator that provides information on the efficiency of the Greek educational system (OECD, 2011b (OECD, , 2015 . Given the above and the ongoing economic crisis in Greece, which is closely related to students' self-beliefs, motivation and attitudes but does not permit further monetary stimulus, the urgency of investing in the acquisition of citizens' skills through tackling educational deficiencies, especially in mathematics, has increased (OECD, 2013b).\nHowever, there is a lack of research studies, especially in the case of the Greek context, that focus on a range of non-cognitive factors simultaneously, that also take into account students' background to provide a comprehensive picture of the factors that are associated with domainspecific academic achievement. Furthermore, the lack of robust evidence regarding noncognitive factors is attributed to the fact that most studies employ bivariate or multivariate analyses without considering that students belong to different groups of people (i.e. school, district etc.), when analysing clustered data (Chiu & Xihua, 2008) . Therefore, further research on the relationships between non-cognitive factors, which appear to be particularly important to the field of mathematics, and subsequent achievement of Greek students in more depth is necessary as it would provide policy makers and educators with valuable evidence for improvement, since the findings from other countries may have limited generalizability to the Greek context (European Commission, 2011; Mullis, Martin, Foy, & Arora, 2012; OECD, 2011b )."}, {"section_title": "Aim", "text": "The aim of the present study was to examine how non-cognitive factors, with a particular focus on mathematics anxiety, mathematics self-efficacy, mathematics self-concept, intrinsic and instrumental motivation to learn mathematics and attitudes towards school, influence mathematics achievement of Greek 15-year-old students, while accounting for their gender and school SES. The analysis involves a rigorous multilevel approach that appropriately takes account of the clustered nature of the data."}, {"section_title": "Research questions", "text": "1. How much of the variability in 15-year-old Greek students' mathematics achievement is distributed within and between schools? 2. Are 15-year-old Greek students' non-cognitive constructs, their gender and school SES significant predictors of their mathematics achievement? 3. How much variability in 15-year-old Greek students' mathematics performance is explained by the student-and school-level variables included in the multilevel model?\n2. Literature Review 2.1 Student background 2.1.1 Gender\nOne of the most often considered factors assumed to account for differences in mathematics achievement is gender. However, study findings are not consistent in relation to the role of gender in students' mathematics achievement. In the past there was a prevalent view about boys' superiority, but more recent research has either shown that girls' performance was superior, or alternatively an absence of gender differences in mathematics performance (Antunes & Fontaine, 2007; Guo, Marsh, Parker, Morin, & Yeung, 2015; Meelissen & Luyten, 2008; Steinmayr & Spinath, 2008) .\nTwo recent large-scale meta-analyses on gender differences in mathematics achievement among adolescents found that girls' and boys' mathematics performances did not differ, or even when they did, the differences were negligible (Else-Quest, Lindberg, Hyde, Petersen, & Linn, 2010) . These findings are in accordance with Hyde's (2005) \"gender similarities hypothesis\" which suggests that males and females are similar in terms of most psychological variables as well as their actual levels of mathematics attainment.\nNevertheless, some research studies suggest that gender differences exist in mathematics achievement. Steinmayr & Spinath (2008) , who investigated gender differences in adolescents' mathematics performance, supported that the gender gap existed in favor of girls. Moreover, a very recent study examining all PISA cycles from 2000 to 2009 indicated that girls outperformed boys in overall performance, including mathematics (Stoet & Geary, 2015) . However, the same authors suggested that boys were more likely to be top performers, an inference also supported by other national and international analyses (Gilleece, Cosgrove, & Sofroniou, 2010; Mullis et al., 2012; OECD, 2014a; Stoet & Geary, 2015) . Other studies have found conflicting results highlighting a gender gap in favor of boys (Areepattamannil, 2014; Byrnes & Miller, 2007) . Most authors, though, pointed out that the magnitude of the gender gap has declined in recent years (Else-Quest et al., 2010) and the synthesis of meta-analyses by Hattie (2009) confirmed this conclusion giving an overall effect size of 0.12 (Cohen's d), which was considered of minor practical significance. Therefore, due to the inconsistency of the findings in the literature, it is not possible to draw clear conclusions about gender differences."}, {"section_title": "Non-cognitive constructs 2.2.1 Mathematics anxiety", "text": "Mathematics anxiety is a domain-specific self-belief which refers to the extent to which students feel helpless or stressed when studying mathematics. It is unlike any other types of anxiety as it appears to affect visual rather than verbal working memory (Marsh, Hau, Artelt, Baumert, & Peschar, 2006; Miller & Bichsel, 2004; Stankov, Lee, Luo, & Hogan, 2012; Stankov, Morony, & Lee, 2014) . Large proportions of students admit that they are highly anxious and they report feeling tense and afraid of mathematics, thus they tend to avoid mathematics and mathematics related courses and the extent of practice which is necessary for mastering mathematics skills. This can also result in the avoidance of career paths that require mathematical skills (Morony, Kleitman, Lee, & Stankov, 2013; OECD, 2013c) .\nMany research studies, including large-scale studies in different countries, have indicated a strong negative relationship between mathematics anxiety and students' achievement in mathematics, revealing correlations of r=-0.27 to -0.57 (Goetz, Cronjaeger, Frenzel, Lüdtke, & Hall, 2010; Morony et al., 2013; Stankov, 2013) . Regarding Greek students, Lee (2009) found a correlation of r=-0.36 between mathematics anxiety and mathematics achievement based on the PISA 2003 data, concluding that mathematics anxiety is one of the strongest self-beliefs that can predict mathematics achievement."}, {"section_title": "Mathematics self-efficacy", "text": "Academic self-efficacy constitutes judgements of one's abilities to perform academic tasks, without having to compare themselves with others (Bong & Skaalvik, 2003; Kleitman & Gibson, 2011; Parker, Marsh, Ciarrochi, Marshall, & Abduljabbar, 2014) . In particular, mathematics self-efficacy refers to the confidence and the extent to which students believe in their own skills to handle mathematical tasks effectively, produce outcomes and overcome difficulties (Fast et al., 2010; Marsh et al., 2006; OECD, 2013c; . The research literature has unanimously concluded that mathematics self-efficacy is consistently positively correlated with mathematics achievement, showing an even stronger association with mathematics achievement than mathematics anxiety, based on the results of studies that have examined both of these self-constructs together (Jiang, Song, Lee, & Bong, 2014; Lee, 2009) . In particular, correlations found between anxiety and mathematics achievement ranged from r=0.32 to 0.56 (Jiang et al., 2014; Lee, 2009; OECD, 2013c) . Shavelson, Hubner, & Stanton (1976) were among the first researchers to investigate the notion of self-concept. Mathematics self-concept refers to students' perceptions of their abilities and their competence to master mathematics knowledge (van Dinther, Dochy, & Segers, 2011; Vandecandelaere, Speybroeck, Vanlaar, De Fraine, & Van Damme, 2012) . Mathematics selfconcept appears to be consistently positively associated with mathematics performance, although results have indicated to a lesser extent than either mathematics anxiety or mathematics self-efficacy (Seaton, Parker, Marsh, Craven, & Yeung, 2014) . revealed a moderate correlation (r=0.30) between secondary school students' mathematics self-concept and mathematics performance. While Lee (2009) found an average correlation of r=0.23 between self-concept and mathematics achievement, among 41 countries in PISA 2003, in the case of Greece, students' mathematics self-concept appeared to have a stronger relationship with mathematics achievement than the international average (r=0.39) (Lee, 2009) . In another study, using structural equation modelling to evaluate the relationship between academic self-concept and performance in specific domains for two different grades, correlations of 0.68 and 0.76 were found for mathematics in grade 8 and grade 11, respectively (Goetz et al., 2010) . When the above relationship was investigated longitudinally, with adolescents aged 11-17, correlations ranged from 0.42 to 0.50 and was the only variable to remain significant, even after several variables (e.g. mathematics performance approach goal orientation) were included in a single model (Seaton et al., 2014) ."}, {"section_title": "Mathematics self-concept", "text": ""}, {"section_title": "Motivation 2.2.4.1 Intrinsic motivation to learn mathematics", "text": "Intrinsic motivation is defined as the performance of an activity driven by self-satisfaction rather than by external incentives (Guay et al., 2010; Ryan & Deci, 2000) . It is considered the most important type of motivation and the one that is most closely related with academic outcomes (Ryan & Deci, 2000) . Taylor et al. (2014) , examining the relationship between intrinsic motivation and academic achievement through synthesizing the results of a metaanalysis and several longitudinal studies, suggested that intrinsic motivation was positively associated with academic achievement on mathematics and science, even after controlling for baseline achievement. Other researchers stressed that intrinsic motivation is positively related not only to academic achievement, but also to students' emotions, since intrinsically motivated students are more likely to enjoy the process of learning, thereby enhancing their achievement (Corpus, McClintic-Gilbert, & Hayenga, 2009 ).\nAccording to the PISA data, levels of intrinsic motivation have remained stable and low on average in OECD countries since 2003, showing a weak association with mathematics performance, while the intrinsic motivation of Greek students increased by 14 percentage points on average from 2003 to 2012 (Goh, 2006; OECD, 2013c) . Correlations between intrinsic motivation and overall academic achievement of third to eighth grade students throughout a year, were statistically significant but weak (Corpus et al., 2009 ). Nonetheless, once students' self-beliefs and attitudes were controlled for in the above studies, intrinsic motivation became a poor predictor of mathematics achievement or even an insignificant one, due to its overlap with the above-mentioned constructs (Jiang et al., 2014; ."}, {"section_title": "Extrinsic motivation to learn mathematics", "text": "Extrinsic or instrumental motivation is a construct that refers to the external incentives an activity is based on (e.g. fear of parental chastisement, career aspirations etc.) (Ryan & Deci, 2000; Taylor et al., 2014) . Actions based on extrinsic motivation are not performed out of enthusiasm, but for the benefits they are considered to be associated with (Wrzesniewski et al., 2014) . On the one hand, researchers have argued that extrinsically motivated students tend to focus only on performance outcomes, therefore they may be distracted from the learning process and as a consequence their achievement deteriorates (Chiu & Xihua, 2008; Corpus et al., 2009 ). This theory has been confirmed by research evidence revealing negative correlations between extrinsic motivation and mathematics achievement ranging from r=-0.24 to r=-0.42 (Corpus et al., 2009 ).\nOn the other hand, results from the two largest-scale international studies, PISA and TIMSS, show conflicting results. Both the PISA 2012 and TIMSS 2011 results indicate that extrinsic motivation is positively related to mathematics achievement (Mullis et al., 2012; OECD, 2013c) . Marsh et al. (2006) , who analyzed the PISA 2003 data, confirmed the above conclusions finding a significant but small positive correlation (r=0.07) between extrinsic motivation and mathematics achievement. However, researchers have emphasized that when self-beliefs are taken into account in the analysis extrinsic motivation tends to lose some or all of its predictive strength (Chiu & Xihua, 2008; Jiang et al., 2014; ."}, {"section_title": "Attitudes towards school", "text": "Zimbardo and Leippe (1991) defined attitude as an evaluative disposition toward a subject comprised of cognitive, affective, and behavioral aspects, which can in turn predict knowledge level, affective reactions, and behavior prepositions (Ogbuehi & Fraser, 2007; Vandecandelaere et al., 2012; Zimbardo & Leippe, 1991) . Attitudes towards learning have been conceptually linked with students' engagement in school activities, their school experiences, and their dedication to schooling (Green et al., 2012; OECD, 2013c) . Findings regarding the relationship between attitudes towards school and academic performance have been mixed, both in respect to the strength and the direction of the relationship . Lee and Stankov (2013) who used PISA 2003 data concluded that attitudes towards school were negatively, but weakly correlated with mathematics performance (r=-0.06). On the other hand, the PISA 2012 results revealed that the correlation between attitudes towards school and mathematics performance, though weak, was statistically significant and positive (OECD, 2013c) . The above studies mostly found weak relationships between attitudes towards school and mathematics achievement based on bivariate correlations.\n2.2.6 Gender differences in non-cognitive constructs\nThe patterns of gender differences in mathematics achievement vary across different studies, but findings regarding gender differences in non-cognitive variables tend to be more consistent . Else-Quest et al. (2010) , in their meta-analysis of cross national trends in gender differences regarding mathematics, revealed that boys had significantly lower mathematics anxiety, higher self-efficacy and self-concept, higher intrinsic and extrinsic motivation and more positive attitudes towards mathematics. The consistency of these associations was also evident in other studies, including PISA, where the relationships of the above affective factors with gender remained significant even after controlling for the effects of other criterion variables, such as students' approaches to learning and SES Meelissen & Luyten, 2008; OECD, 2013b) ."}, {"section_title": "School influences", "text": "There is a growing body of literature highlighting the role of schools in shaping students' academic achievement (Anderson, Lin, Treagust, Ross, & Yore, 2007) . These studies suggest that in European and OECD countries, school differences explain approximately 35 and 40 per cent of students' mathematics achievement, respectively (European Commission, 2013; OECD, 2014b) . Moreover, PISA found that the percentage of the total variance in the dependent variable that is accounted for by school (i.e. intra-class correlation-ICC) has increased significantly since 2003, suggesting that differences between schools are getting larger (ICC 2003=0.34, ICC 2012=0.37) (OECD, 2014b). Gamoran and Long (2006) have also indicated that schools matter a great deal for student learning, in the sense that inequalities among students would be much greater than they already are if schools did not exist."}, {"section_title": "SES at the school level", "text": "In educational research, SES appears to be the most widely used contextual variable following the \"Coleman Report\" in 1966, when Coleman argued, based on a large sample of students from various grades, that the influence students' family background had on academic achievement was greater than of any other variable measured (Coleman et al., 1966; Sirin, 2005) . SES constitutes a multidimensional factor, incorporating various aspects, such as parental educational level, parental occupation, family wealth and home resources (OECD, 2014b; Shavit & Blossfeld, 1993; Sirin, 2005; Zhao, Valcke, Desoete, & Verhaeghe, 2012) . The research literature has consistently identified the importance of SES for student mathematics achievement (Hampden-Thompson, 2013; Stewart, 2008) .\nIt has been stressed that school socio-economic composition contributes to the prevalence of socio-economic equalities or inequalities much more than the individual SES (Anderson et al., 2007; Martins & Veiga, 2010; Stewart, 2008) . Sirin (2005) conducted a meta-analysis on studies from 1990 to 2000 based on 74 independent samples, concluding that SES at schoollevel positively predicted mathematics achievement with an effect size of r=0.35, revealing a stronger association between SES and mathematics achievement than with other school subjects. Areepattamannil (2014) also supported the above relationship and Zhao et al. (2012) has also emphasized the role school-level SES plays in the relation between student-level SES and mathematics performance. They found that approximately 22 per cent of the variance at the school level was explained by the school mean SES. Consequently, they concluded that SES at the school-level tends to be a more powerful predictor of academic achievement than individual SES. This supported Hattie's (2009) inference, from the synthesis of four meta-analyses (DeBaz, 1994; Fleming & Malone, 1983; Sirin, 2005; White, 1982) , which showed an effect size of d=0.57 between school-level SES and mathematics achievement.\nHowever, when SES is evaluated at school-level, results should not be interpreted as if they represented individual SES, hence measures should be taken to avoid an ecological fallacy, the transfer of individual-level inferences to the school-level, assuming that findings at the individual-level can depict between-school relationships (Jehangir, Glas, & van den Berg, 2015; Sirin, 2005) . For the purposes of this study, multilevel analysis is used, because it can simultaneously estimate the complexity of student-and school-level effects, thereby preventing this ecological fallacy (Jehangir et al., 2015; Snijders & Bosker, 2012) .\n3. Methodology 3.1 Design of the study PISA is a collaborative effort among the OECD member countries designed to measure how well 15-year-old students, approaching the end of compulsory schooling, are prepared to meet the challenges of the future. It focuses on the students' ability to use the knowledge they have mastered at school in their everyday lives, demographic factors as well as their attitudes, interests, motivations, and beliefs in order to facilitate a deeper understanding of student learning cross-nationally (OECD, 2013a (OECD, , 2014b . PISA has taken place every three years, since 2000, and focuses on a particular domain for each cycle (reading, mathematics or science) (OECD, 2014b). The PISA 2012, the fifth PISA study, was conducted in the 34 OECD countries and 31 partner countries/economies."}, {"section_title": "Participants and sampling", "text": "PISA samples are selected based on a two-stage stratified sample design. In the first stage, schools are sampled systematically with probabilities proportional to a measure of size (i.e. estimated number of eligible students enrolled) (OECD, 2013a (OECD, , 2014b . The second-stage sampling units are students within sampled schools. A complete list of each sampled school's 15-year-old students is prepared and typically 35 students per school are randomly selected. In PISA 2012, 5,125 Greek students from 192 schools participated in the assessment, out of a target population of 105,096 enrolled 15-year-old students (OECD, 2014b)."}, {"section_title": "Variables 3.3.1 Dependent variable", "text": "Mathematics literacy (Mathscore) in PISA 2012 involved four content areas: change and relationships, space and shape, quantity, and uncertainty (OECD, 2013a) and was defined as: 'An individual's capacity to formulate, employ and interpret mathematics in a variety of contexts. It includes reasoning mathematically and using mathematical concepts, procedures, facts and tools to describe, explain and predict phenomena. It assists individuals to recognize the role that mathematics plays in the world and to make the well-founded judgments and decisions needed by constructive, engaged and reflective citizens' (OECD, 2013, p.25) ."}, {"section_title": "Student-level independent variables", "text": "Most questionnaire items were designed to be combined in order to measure latent constructs that could not be observed directly (i.e. self-efficacy, anxiety etc.). These items were scaled to create indices through item response theory (IRT), based on weighted likelihood estimates (WLEs) (OECD, 2014b) . For the purposes of the present analysis, scale indices were standardized with a mean of 0 and a standard deviation (SD) of 1 for the Greek sample. The specific items that comprised the following latent variables are included in Appendix A."}, {"section_title": "School-level independent variable", "text": "Index of economic, social and cultural status (SCESCS): aggregated index derived from the scale indices of home possessions (HOMEPOS) -which comprised all items on the WEALTH, CULTPOS and HEDRES scales, as well as books in the home (ST28Q01), the highest parental occupation (HISEI) and the highest parental education expressed as years of schooling (PARED). For the purposes of the present analysis the school ESCS (SCESCS) will be computed as the mean of students' SES for each school (OECD, 2014b)."}, {"section_title": "Statistical analysis", "text": "The present study is a secondary analysis of the PISA 2012 data from Greece. The PISA sampling design implies that students within the same schools will have more characteristics in common than with students from other schools (Goldstein, 2011; OECD, 2014b) . This is the 'intra-class correlation (ICC)' that represents the proportion of the total variance in the dependent variable that is attributable to the cluster (Field, 2013) . ICC constitutes a problem because many statistical models assume that cases should be independent of each other, but students who study at the same school are actually not independent of each other (Field, 2013) . Multilevel modelling is used when the independent variables belong to different hierarchical levels, since it can take into account the clustering of the individuals, estimating the variation in the dependent variable that is attributable to differences within or between the clusters and identify the factors at each level that are associated with this influence, while not underestimating the SE of the regression coefficients (OECD, 2009; Steele, 2008; Woltman, Feldstain, Mackay, & Rocchi, 2012) .\nTherefore, the contribution of both student-and school-level variables in explaining variance in mathematics performance is evaluated through a two-level multilevel model with studentlevel variables at the first level and school-level variables at the second level. Survey weights were required to facilitate the analysis of the PISA data, given that students were selected randomly within-schools, thus the selection probabilities varied (OECD, 2014b) . Survey weights constituted specific variables in the database and were used at the student-level, as suggested by PISA, since they allow the calculation of appropriate estimates of sampling error and unbiased estimates of standard errors (SE) and confidence intervals (OECD, 2013a (OECD, , 2014b . Since in PISA students only answer a subset of the item battery, their other scores are imputed from the observed item responses (OECD, 2014b). Thus, for each mathematics scale and subscale, five plausible values (PV) PVs per student were included in the international database (PV1MATH to PV5MATH). For the purposes of the present analysis, the PVs were averaged in order to constitute the overall mathematics score for each student. Missing values were imputed via multiple imputation in SPSS, since it is considered the most valid approach to impute missing values (Goldstein, 2014) and allowed the inclusion of all 5,125 participants in the analyses.\nThe multilevel modelling was conducted with MLwiN 2.32 software. Moreover, prior to the multilevel model, descriptive statistics, bivariate correlations and a check of the underlying assumptions of the multilevel model was conducted using SPSS 21."}, {"section_title": "Analysis and Results", "text": ""}, {"section_title": "Descriptive statistics", "text": "Prior to the main analysis descriptive statistics are presented in order to provide a comprehensive overview of the sample. Table 1 presents the number and percentages of girls and boys in the Greek PISA 2012 sample and their raw mean mathematics scores. Mathematics score has a mean of 500 for all OECD countries and a SD of 100. Thus, Greek students' mean mathematics score was lower than the OECD average. In the Greek sample, boys had a higher mathematics score, outperforming girls by 8 points on average. The alpha level of .05 was used for testing the significance of all statistical tests. The differences were found to be statistically significant (p<.01, t=3.42, df=4988.73) between boys' and girls' mean mathematics scores, in favor of boys. However, the effect size of this relationship was small (r=0.04), suggesting limited practical significance of the finding. 4.1.1 Gender differences in non-cognitive constructs Table 2 includes the standardized means of the non-cognitive variables for both boys and girls in the sample and the effect size of gender differences in the non-cognitive constructs. The boys' and girls' means suggested that boys had lower levels of mathematics anxiety, higher mathematics self-efficacy and self-concept, intrinsic and instrumental motivation and less positive attitudes towards school. The differences in the non-cognitive constructs between boys and girls were examined. The results of the Independent-Samples T-tests indicated that these gender differences in the non-cognitive constructs were statistically significant, suggesting that boys and girls differed in the way that they perceived themselves, their strengths and weaknesses, the value of mathematics and schooling. In order to examine the relationships between the above background, non-cognitive and schoollevel variables a multilevel model was conducted, prior to which certain assumptions needed to be checked (Field, 2013; Tabachnick & Fidell, 2013) . The following assumptions were checked and found to be acceptable: continuous outcome variable following the normal distribution (see Appendix B, Figure "}, {"section_title": "Multilevel model", "text": "The PISA sample is clustered within schools and if this clustering is taken into account, then estimates of the proportion of the variation in the dependent variable that is accounted for by specific independent variables can be more valid, since the SE of the coefficients are not underestimated (Woltman et al., 2012) . Therefore, a two-level multilevel model was conducted to investigate the contribution of both student-and school-level variables in explaining variance in mathematics performance. The analysis was developed starting with the simplest model (null model, Step 1) and systematically moved towards more complex models (Steps 2-5) as Hox (2010) recommended.\nStep 1: No explanatory variables-The variance components model\nThe simplest linear model (1) does not take into consideration the clustered nature of the data. Thus, a random effect model was created to serve this purpose (2):\nMathscoreij = β0j + eij = β0 + u0j + eij (2) where β0 [-0.133 (0.051) ] is the overall mean across schools, u0j is the effect of school j on mathematics achievement and eij is the student-level residual.\nThis null model without explanatory variables (2) was fitted in order to detect whether there were statistically significant differences between schools and therefore indicating a multilevel model was required. To test the significance of school effects, a likelihood ratio test comparing the null random effect model to a null single-level model was conducted. The likelihood ratio test statistic was calculated as the difference in the -2*loglikelihood values for the two models, which in this case was statistically significant (LR=1795.786 in 1 df, p<.001), thus there was evidence of school effects on mathematics score, suggesting that a multilevel model should be applied to take into account these differences. The between-school variance in this model was 0.446 with a SE of 0.049, the within-school variance was 0.634 with a SE of 0.013 and the total unexplained variance was 1.08. The variance partition coefficient (VPC) was This indicated that 41.3 per cent of the total variation was attributed to differences between schools, therefore 58.7 per cent of the total variation was attributed to within-school differences. The variation in mathematics achievement derived mostly from the within-school than the between-school variance, but there was a remarkable proportion of variation that was accounted for by the schools.\nStep 2: Adding level 1 variables to the random intercepts model All level-1 explanatory variables were added to the model in succession. Firstly, the noncognitive variables were added to the model depending on their significance in the prediction of mathematics achievement, according to the literature. Mathematics self-efficacy was a statistically significant variable that positively predicted mathematics score, since its coefficient was more than twice its SE (coefficient=0.348, SE=0.014). This indicated that students with higher levels of self-efficacy tended to perform better in mathematics. Mathematics self-efficacy accounted for reductions in variations of both levels (student and school), implying that schools were somewhat homogeneous with respect to this variable (Muijs, 2012) .\nMathematics anxiety was also statistically significant (coefficient=-0.201, SE=0.011) and negatively predicted mathematics score, which means that highly anxious students tended to have lower mathematics achievement. Adding mathematics anxiety in the model caused reductions in the unexplained variations of both student and school level, as well. Although measured at the student-level, mathematics anxiety appeared to explain also between-school differences among students. Moreover, the entry of mathematics anxiety caused a decline in the coefficient of mathematics self-efficacy, but it remained statistically significant. Another statistically significant but positive predictor of mathematics achievement was mathematics self-concept (coefficient=0.130, SE=0.014). Students with higher levels of mathematics selfconcept were more likely to have higher mathematics performance. This variable appeared to be less powerful in the prediction of mathematics achievement since its coefficient was weaker and the differences it caused to the variations of both student and school level were not large, compared to the two previous variables.\nIntrinsic (coefficient=0.011, SE=0.016) and instrumental motivation to learn mathematics (coefficient=-0.001, SE=0.014) were both not statistically significant thus did not account for any differences in the model. However, insignificant variables were not excluded from the model, since analysis followed the research questions. Furthermore, students' attitudes towards school was a statistically significant negative predictor of mathematics achievement (coefficient=-0.067, SE=0.010). This finding indicated that students, who had positive attitudes towards school, tended to have worse mathematics performance than those with more negative attitudes, but this variable did not account for much variation neither at the student nor at the school level. However, entering attitudes towards school in the model turned instrumental motivation to learn mathematics statistically significant and a positive predictor of mathematics achievement (coefficient=0.036, SE=0.014), which may indicate an interaction between students' instrumental motivation to learn mathematics and their attitudes towards school. Finally, gender differences in mathematics achievement in favor of boys, were also found to be statistically significant when gender was added to the model (coefficient=-0.095, SE=0.020). Thus, with other variables held constant, girls tended to perform 0.095 points lower than boys in mathematics. The subsequent equation (3) After adding level-1 variables the unexplained variance at the student-level decreased from 0.634 to 0.475 and the school-level variance from 0.446 to 0.342, explaining further 25 and 23.3 per cent of the unexplained variance, respectively at each level. Mathematics self-efficacy appeared to be the strongest predictor of mathematics achievement among the student-level variables, since its coefficient was more than 10 times greater than its SE.\nStep 3: Adding Level 2 variables to the random intercepts model Although level-1 variables led to a considerable reduction of the unexplained variance at both levels, there was still statistically significant level-2 variation which remained unexplained (coefficient=0.342, SE=0.034). Thus, school mean SES was added to the model to investigate whether school socio-economic composition could explain this variation. School mean SES was statistically significant (coefficient=0.391, SE=0.031) and positively predicted mathematics achievement. SES caused a considerable difference in the unexplained variance at the school-level, explaining a large proportion of the between-school differences among students. The subsequent equation (4) After controlling for the school mean SES, there were some slight changes in the coefficients and SE of the level-1 variables, but these changes did not influence their statistical significance. The unexplained variance at the school-level decreased from 0.342 to 0.151, explaining further 27.3 per cent of the unexplained variance at the school level and consequently leading to a reduction of 0.452 from the total unexplained variance at the null model. School mean SES appeared to be the strongest predictor of mathematics achievement among all the variables, since its coefficient was more than 10 times greater than its SE. Moreover, mathematics selfefficacy, mathematics anxiety and mathematics self-concept remained statistically significant after controlling for SES at the school level.\nStep 4: Interaction effects According to the research literature, non-cognitive variables included in the present multilevel model at level 1 tend to interact with each other in the prediction of mathematics achievement. Moreover, in the second step of the multilevel model where level-1 variables were added to the model, an interaction appeared to exist between instrumental motivation and attitudes towards school, since when the latter was added to the model, instrumental motivation turned out to be statistically significant although it was not at first. The statistical significance of these interactions was examined through introducing the respective interaction terms in the model. More specifically, interactions were tested between instrumental motivation to learn mathematics and attitudes towards school, mathematics self-efficacy with mathematics selfconcept, mathematics anxiety and intrinsic motivation to learn mathematics, mathematics selfconcept with intrinsic motivation to learn mathematics and mathematics anxiety and finally between intrinsic motivation to learn mathematics with instrumental motivation and attitudes towards school. Interaction terms that were initially non-significant were excluded from the model to avoid complexity. The only statistically significant interaction term was between mathematics selfconcept and mathematics anxiety (coefficient=-0.042, SE=0.007). This indicated that the influence of mathematics self-concept on mathematics achievement was dependent on the levels of mathematics anxiety, in the sense that the influence of mathematics self-concept on mathematics achievement was larger for students with low levels of mathematics anxiety than students with high levels of anxiety.\nStep 5: Random slopes At the random intercepts model, coefficients of the level-1 explanatory variables are considered to be constant across schools. However, the way in which independent variables influence mathematics achievement may differ across schools, thus level-1 coefficients of statistically significant variables were allowed to vary.\nOnly the random slope for mathematics self-efficacy was statistically significant and led to a statistically significant change in -2*loglikelihood (LR=20.549 in 2 df, p<.001). The selfefficacy effect for school j was estimated as 0.214 + u1j and the between-school variance in these slopes was estimated as significant (coefficient=0.007, SE=0.002), indicating that the relationship between mathematics self-efficacy and achievement differed across schools. A 95 per cent coverage interval (normal distribution) for the school slopes was estimated as 0.214 ± 1.96 √0.007 = 0.050 to 0.378. Intervals did not include negative values, thus in schools where students had low mathematics self-efficacy they tended to perform worse than students in schools with high levels of self-efficacy or put more simply in all schools there was a positive relationship between mathematics self-efficacy and mathematics score. The significant positive covariance estimate between intercepts and slopes (σu01=0.018) implied that schools with steep slopes tended to have high intercepts and schools with shallow slopes, low intercepts.\nThus, if a school had students with high mathematics achievement, the relationship between mathematics self-efficacy and achievement would be stronger than in schools with low average mathematics achievement.\nInterpretation of the final model All variables were found to be statistically significant in the final model, apart from intrinsic motivation to learn mathematics. The non-significant relationship between intrinsic motivation and mathematics achievement can be explained based on the overlap in the influences among the self-constructs, the motivation and attitudes that may have detracted part of each level of predictive power. Regarding the significant variables, school mean SES was the strongest predictor since its one-unit increase (1 SD) led to an increase of 0.378 points in the standardized mathematics score. Mathematics self-efficacy was the second most powerful predictor of mathematics score, increasing it by 0.214 points at the average school, since its random slope was statistically significant (its coefficient was allowed to vary among schools). Mathematics anxiety was also a strong negative predictor, introducing a decrease of 0.131 points with each one-unit increase (1 SD) in the standardized mathematics score. Mathematics self-concept was positively related to mathematics score, increasing it by 0.111 points with its one-unit increase (1 SD). Students' instrumental motivation to learn mathematics and attitudes towards school were less powerful predictors of mathematics score, but still statistically significant. Instrumental motivation was positively associated with mathematics score, increasing it by 0.038 points with its increase by one unit (1 SD), while attitudes towards school were negatively associated with mathematics score, decreasing it by 0.067 points with its increase by one unit (1 SD). Thus, students who were extrinsically motivated and had less positive attitudes towards school were more likely to achieve higher in mathematics. Finally, gender was also a statistically significant variable, indicating that girls had lower mathematics achievement, scoring 0.094 points less than boys.\nThe total unexplained variance in the final model was . Compared to the null model the unexplained total variance decreased by 0.457, indicating that the explanatory variables explained 42.3 per cent of the total variance in mathematics from which 26.8 percent referred to the between-school variance and 15.5 per cent to the within-school variance. However, both the within and between-school unexplained variance remained statistically significant. Table 3 presents a summary of the multilevel model from the null model, the level-1 and level-2 models and the interaction model to the random slope model, which was the final one. "}, {"section_title": "Level 1", "text": "Gender ( The null model in the multilevel analysis highlighted the proportions of the variance in mathematics achievement attributed to the student and school level, indicating the extent to which student and school characteristics can explain students' mathematics achievement. In this model, about 41 per cent of the variance was attributed to between-school differences and 59 per cent to within-school differences. This means that apart from the student characteristics that shaped mathematics achievement, there was a sizeable portion of the total variance in mathematics achievement at the school level, something that many authors have previously stressed, suggesting remarkable differences in students' performance between schools (Jehangir et al., 2015; Martins & Veiga, 2010) ."}, {"section_title": "Are 15-year-old Greek students' non-cognitive constructs, their gender and school SES significant predictors of their mathematics achievement in the multilevel model?", "text": "According to the existing research literature, mathematics self-efficacy seems to be one of the most potent predictors of mathematics achievement (Jiang et al., 2014; Lee, 2009) . In the present multilevel analysis, mathematics self-efficacy remained the most significant noncognitive variable after controlling for the influences of other significant non-cognitive variables. The findings in the current study also support Ferla, Valcke, & Cai (2009) contention that while mathematics self-efficacy is particularly salient in relation to mathematics achievement, mathematics self-concept whilst also related to mathematics achievement, tends to be a stronger predictor of other affective and motivational variables. In fact, a statistically significant relationship was found between mathematics self-concept and mathematics achievement, corroborating the findings from previous research (Goetz et al., 2010; Seaton et al., 2014; .\nAnother self-belief added in the multilevel model was mathematics anxiety, which was also statistically significant, confirming previous findings in the literature Morony et al., 2013; . It was also found that mathematics anxiety interacted with mathematics self-concept in terms of their influence on mathematics achievement. This indicated that the relationship between mathematics self-concept and mathematics achievement was moderated by the levels of mathematics anxiety students had and vice versa, corroborating the PISA 2012 results based on all OECD countries (OECD, 2013c). These three mathematics self-beliefs were the most powerful predictors of mathematics achievement among the non-cognitive variables and in line with the established research evidence about the strong relationship between students' self-beliefs and mathematics achievement (Chiu & Klassen, 2010; Morony et al., 2013; Stankov, 2013) .\nRegarding the motivational variables, the findings of this study are also consistent with previous studies that have claimed that when self-beliefs are taken into account in the analysis, motivation seems to be a less important predictor of academic achievement due to the conceptual overlap between the notions of self-beliefs and motivation (Cretchley, 2008; Green et al., 2012; Jiang et al., 2014; Stankov, 2013) . More specifically, intrinsic motivation to learn mathematics was not a statistically significant predictor of mathematics achievement, confirming conclusion that intrinsic motivation was not associated with mathematics achievement, but simultaneously contradicting a range of other studies which have highlighted a weak but statistically significant relationship between intrinsic motivation and mathematics achievement (Corpus et al., 2009; Marsh et al., 2006; Taylor et al., 2014) . This can be explained by the structure of the Greek educational system, which according to the OECD does not support students' basic psychological needs of autonomy and competence and it does not also promote parental involvement in schooling, factors which have been found to be beneficial to students' interest in learning and by the fact that the present multilevel model included various background and non-cognitive factors that may have decreased the predictive power of intrinsic motivation (European Commission, 2011; OECD, 2011a; Taylor et al., 2014) .\nOn the other hand, instrumental motivation to learn mathematics was found to be statistically significant, suggesting that students who intended to learn mathematics because of external incentives (e.g. grades, job success) tended to perform better in mathematics, which was also in accordance with the results of the PISA and TIMSS studies (Mullis et al., 2012; OECD, 2013c) . Nonetheless, this finding was in contrast to what , Chiu & Xihua (2008) and Corpus et al. (2009) found. The last non-cognitive variable added to the model was attitudes towards school, which also turned out to be statistically significant and negatively associated with mathematics achievement. were among the few authors examining this relationship in relation to mathematics achievement and concluded in a weak, negative association, which was also evident in the present multilevel analysis. Others, such as Green et al. (2012) , have mainly investigated attitudes in relation to overall academic achievement.\nMoreover, according to the findings of the present study, boys and girls differed significantly in their mathematics achievement, with boys achieving higher, even after controlling both for the clustered nature of the data and other significant variables. In recent years, few studies have found significant gender differences in favor of boys. In contrast, independent and international assessment studies concluded that girls outperformed boys in mathematics tests. Guo, Marsh, Parker, Morin, & Yeung (2015) concluded that girls were more likely to achieve higher in mathematics, a finding which was also evident in the last results of the TIMSS study in 2011 (Mullis et al., 2012) . Meelissen & Luyten (2008) using multilevel analyses initially found gender differences in mathematics favoring boys until other students' characteristics were controlled for, which reversed the difference in the favor of girls. Stoet & Geary (2015) and Gilleece, Cosgrove, & Sofroniou (2010) stressed that despite girls outperforming boys on average in their studies, boys were more likely to be top performers in mathematics.\nHowever, the findings remain inconsistent in terms of gender with other studies also finding higher achievement among boys in mathematics achievement. For example, Areepattamannil (2014) and Byrnes and Miller (2007) , who examined data from PISA and the National Education Longitudinal Study (NELS), respectively. Like the present study, they found a statistically significant relationship between students' gender and mathematics achievement, favoring boys. Nevertheless, the fact that girls were found to be more anxious and less selfconfident than boys could provide one explanation for these gender differences in mathematics achievement. But the fact that a statistically significant relationship between gender and mathematics achievement remained once these non-cognitive constructs were accounted for, suggests that the explanation must lie elsewhere. This finding indicated that gender inequities in the Greek educational system in relation to mathematics achievement are strong.\nFinally, school mean SES was the most powerful predictor in the multilevel model, suggesting that the school students attended was of major importance regarding their mathematics achievement. This finding is also in line with previous research that has suggested school SES is one of the most salient predictors of both overall academic achievement, and mathematics (Areepattamannil, 2014; Jehangir et al., 2015; Sirin, 2005; Zhao et al., 2012) . This finding points to the continued persistence of inequalities in relation to SES that has been highlighted elsewhere (Shavit & Blossfeld, 1993; Sirin, 2005) , but may be exacerbated in the Greek context, where the inflexibility of the admission system to schools in the educational system, whereby students are allocated to schools based only on their area of residence, something which can lead to differentiated influences of the socio-economic composition of schools (OECD, 2015) ."}, {"section_title": "How much variability in 15-year-old Greek students' mathematics performance is explained by the student-and school-level variables included in the multilevel model?", "text": "The explanatory variables added to the multilevel model explained a remarkable proportion of the unexplained variance in mathematics performance that existed in the null model. More specifically, the explanatory variables explained 42.3 per cent of the total variance in mathematics performance from which 26.8 percent referred to the between-school variance and 15.5 per cent to the within-school variance. However, there was still statistically significant unexplained variance in mathematics performance at both levels, which suggests further research is required into other factors that could account for the unexplained variance in mathematics achievement."}, {"section_title": "Limitations of the study", "text": "A number of limitations of the present study should be acknowledged and taken into account in the interpretation of the results. Firstly, the cross-sectional and non-experimental nature of the data did not allow us to make causal statements in terms of relationships between the variables (Goetz et al., 2010) . Secondly, information about SES and non-cognitive constructs was based on the students' self-reports (Taylor et al., 2014) . Finally, the findings of this study should be carefully generalized to other age groups or countries due to the specific domain of investigation and context of the study."}, {"section_title": "Strengths of the study", "text": "Despite the above limitations, the present study has made a significant contribution to knowledge. First of all, the study examined a wide range of non-cognitive constructs while controlling for the effects of gender and school SES, and is the first study of its kind to look at the simultaneous investigation of these factors through multilevel modelling in relation to mathematics achievement. Moreover, the measures that the non-cognitive constructs derived from were domain-specific, capturing a more comprehensive picture of the specific noncognitive variables that were related to mathematics achievement and being more useful for policy making (European Commission, 2011) , and the measures had either good or acceptable reliabilities. The PISA data also provides a large and representative sample, which enhances the validity of the results. Finally, the multilevel model used in the analysis takes account of the clustered nature of the data and enhances the analysis of many prior studies that have failed to take this into account (Woltman et al., 2012) ."}, {"section_title": "Recommendations for Future Research", "text": "According to the findings of the present study, one of the main implications for future research is the conduct of longitudinal studies examining the influence of non-cognitive factors on mathematics achievement. Moreover, longitudinal studies could be conducted on different age groups and countries or even across particular subgroups (i.e. high achievers -low achievers), in order to clarify whether the findings identified in this study were unique to the Greek sample and whether the findings are generalizable more widely. Investigating these relationships longitudinally could also allow for the probable causal orderings of these constructs with mathematics achievement to be detected, while the use of structural equation modelling could also test the validity of the constructs, whether questionnaire items actually measured the constructs of interest, the loading of each item onto each latent variable, and the interrelationships between the independent variables."}, {"section_title": "Recommendations for Educational Policy", "text": "Based on the findings from the current study in conjunction with previous research reported in the literature review, there are some recommendations that can be made which may not only be useful for educators and policy makers in Greece, but are likely to be more widely applicable. The non-cognitive constructs considered in the present study were all found to be significant predictors of mathematics achievement. Therefore, educational interventions that are designed to promote these constructs are considered particularly important, not only in order to enhance mathematics achievement, but also to improve students' emotions and attitudes. Innovative programs and curricula should be designed that aim to target mathematics self-efficacy and mathematics anxiety in particular, those that are informed by the best evidence through existing systematic reviews. Such interventions should target early childhood education, when these constructs are highly malleable (Hegland & Colbert, 2001; Liew, McTigue, Barrois, & Hughes, 2008) . This is likely to be one of the most effective ways in shaping and enhancing students' non-cognitive constructs and subsequent achievement in mathematics.\nIn particular, schools and teachers can play an important role in increasing students' interest and engagement in schooling, by ensuring that students have positive perceptions about their abilities, which will help them improve and sustain their gains in achievement. Teachers should try to arouse students' interest in mathematics by showing its relevance to their everyday lives and giving students feedback in order to raise their expectancy of success. Furthermore, when teachers invest in the enhancement of students' non-cognitive constructs they could also promote gender equity in mathematics, which is closely related to their self-beliefs, motivation and attitudes. In conjunction with the above, teachers should not associate students' confidence with their actual abilities, bearing in mind that girls' lower levels of positive attitudes and selfbeliefs do not reflect their abilities, consequently introducing equity in the Greek educational system in order to tackle the gender differences.\nEducators and policy makers should also take into account that academic success was greatly influenced by the school SES and gender. In order to address social inequality in relation to schools, they should focus on adequacy, rather than equity, of resources, in the sense that socially and economically disadvantaged schools may need more financial resources and expertise than those needed by more advantaged schools. The Greek educational system should also make the admission system in schools more flexible, by providing the option of selecting the school students will attend, regardless of their residential area. The findings also suggest that there is a need to examine the pedagogical approaches to teaching mathematics in Greece to reduce the apparent disadvantage among girls."}, {"section_title": "Conclusion", "text": "The results of this study emphasized the importance of mathematics self-efficacy, anxiety, selfconcept, instrumental motivation to learn mathematics and attitudes towards school in the prediction of 15-year-old students' mathematics achievement in Greece. Additionally, it was suggested that school mean SES and students' gender were also important factors in shaping mathematics achievement. Students' gender was found to play a statistically significant role for students' self-beliefs and motivation about mathematics as well as attitudes towards schools. All the included independent variables in the multilevel model explained a large amount of the variance of the dependent variable. Overall, the findings indicated that policy makers, educators and parents should take into consideration students' self-beliefs, motivation, attitudes and gender when designing educational policies, programs and curricula. Moreover, it was evident that the school itself can and should properly tackle its important role in shaping mathematics achievement. Consequently, the present study shed light in the non-cognitive factors that can predict mathematics achievement of 15-year-old students by answering important research questions and filling a significant gap in the existing research literature. "}, {"section_title": "Personality", "text": ""}]