[{"section_title": "Introduction", "text": "The case-control design has been widely used in many imaging studies, such as Alzheimer's Disease Neuroimaging Initiative (ADNI). The case-control study usually starts with identifying two or more groups with the known outcome (e.g., case and control) and then retrospectively identifies risk factors (e.g., structural and functional imaging) that may contribute to the outcome. Case-control studies are comparatively quick, inexpensive, and easy, but they provide less evidence for causal inference than a randomized controlled trial. They are particularly appropriate for investigating outbreaks and studying rare diseases or outcomes. For example, although the overall design of ADNI is a longitudinal prospective study for studying various biomarkers at baseline and their longitudinal profiles, ADNI is essentially a case-control design for studying genetic influences on these biomarkers, since the ADNI participants is not a random sample of the age-matched general population (Kim and Pan, 2015) .\nThe use of the case-control design in imaging genetic studies raises many intricate statistical issues in the joint analysis of imaging, genetic, clinical, and cognitive data (Lin and Zeng, 2009; Monsees et al., 2009; Schifano et al., 2013; Wei et al., 2013; Chen et al., 2013; Ghosh et al., 2013; Tchetgen, 2014; Kim and Pan, 2015) . Specifically, in casecontrol imaging genetic studies, there are four sets of variables including marker genotype(s), G, secondary traits, Y, primary (outcome) phenotype, D, and clinical variables X. Imaging measures have been widely used as secondary (or intermediate) traits, that may be directly associated with a specific disease outcome, for most neuropsychiatric and neurodegenerative illnesses (Chou et al., 2009; Filippini et al., 2009; Jahanshad et al., 2010; Yoon et al., 2010; Molina et al., 2011; Kremen et al., 2010; Montag et al., 2008; Chiang et al., 2011; Gilmore et al., 2010; Shen et al., 2010; Peterson et al., 2009 genotype(s) G are collected conditional on the primary phenotype D, whereas the main target of inference is the population model for Y given G. As a result, it may be essential to adjust for D when one models Y given G in case-control studies.\nIt is well known in genetic epidemiology that for quantitative trait, improperly handling case-control sampling scheme can lead to estimation bias, inflated false positive rate, and decreased power (Lin and Zeng, 2009; Tchetgen, 2014; Kim and Pan, 2015) , while one may gain substantial powers by appropriately accounting for the case-control scheme (Lin and Zeng, 2009; Monsees et al., 2009; Schifano et al., 2013; Wei et al., 2013; Chen et al., 2013; Ghosh et al., 2013; Tchetgen, 2014) . To the best of our knowledge, however, existing GWAS of imaging phenotypes either ignore the case-control sampling scheme or include both diagnosis and the interaction between diagnosis and SNP as covariates (Potkin et al., 2009) . Until recently, Kim and Pan (2015) wrote a cautionary note on the potential importance of adjusting the case-control design in the GWAS of imaging measures. Specifically, they compared the retrospective likelihood method in Lin and Zeng (2009) and the standard linear regression method by using simulation studies and ADNI data analysis and concluded that standard linear regression is generally valid (with only small biases or slightly inflated Type I errors) for the ADNI data.\nThe aim of this paper is to understand the effects of the case-control sampling scheme on GWAS of imaging measures. There are two major contributions in this paper. The first one is to carry out GWAS of imaging measures obtained from ADNI by comparing statistical methods with and without correcting for the case-control study design (Tchetgen, 2014; Lin and Zeng, 2009) . To this end, we first study the association between 501,584 Single Nucleotide Polymorphisms (SNPs) and each of 93 regions of interest (ROIs) across 362 subjects including 198 cognitively normals (CNs) and 164 AD patients from ADNI-1. Then to confirm the results with a larger sample size, we combine ADNI-1 with ADNI-2 in order to study the association between 6,017,259 markers (including SNPs and indels) and the right hippocampus across 494 subjects (CN and AD patients). In contrast, in Kim and Pan (2015) , they focused on the genetic markers on the 19th chromosome and single ROI volume (right hippocampus), while they did not adjust for population stratification. The second one is to carry out additional simulation studies based on relatively simple genetic models in order to examine the case-control sampling scheme. We consider some settings, in which moderate association exists between the secondary trait and disease status. In contrast, in Kim and Pan (2015) , they focused on the settings, in which a weak correlation exists between the secondary trait and disease status. Specifically, in their simulations, the odds ratio of the secondary trait with disease status is very close to one. Therefore, it is not surprising that simple linear regression only introduces small amount of biases and slightly increase inflated Type I errors."}, {"section_title": "Methods", "text": "Suppose that imaging genetic data are collected from n independent subjects under the retrospective case-control sampling design. For each subject, given the case-control status D i (0 or 1), we observe the imaging measure Y i of interest, the clinical factors X i , as well as the genotype score G i at one of SNP markers along the whole genome for i n = 1 ,..., . We only consider the additive mode of inheritance, where G i counts the number of copies of the minor allele at the locus. We assume, from now on, that Y i is a quantitative trait due to the fact that almost all imaging measures of interest are continuous. In the following, we briefly describe two sets of methods to model the association between single genetic variant and imaging phenotype with and without considering the casecontrol sampling scheme, both of which can be used to screen the whole genome in GWAS of imaging phenotypes. \nwhere α 0 , α 1 , and α 2 are regression coefficients, and ϵ i s' are measurement errors with zero mean and variance σ 2 .\nLinear regression model adjusting for disease status: The other method is to regress Y i on G i , while including both X i and D i as covariates in the model. Specifically, we consider a linear regression model as follows:\nwhere α 3 is a regression coefficient. We may also consider an interaction model by adding the interaction between G i and D i in the above model (Potkin et al., 2009 ) as follows,\nIn both models (1) and (2), we are interested in making statistical inference on α 1 by using a test statistic, such as score test, to test whether α 1 =0 holds or not. In model (3), we are interested in making statistical inference on α 4 as we did for α 1 in both models (1) and (2). Moreover, α 2 can be a vector due to the presence of multiple environmental factors, among others."}, {"section_title": "Methods with properly handling case-control sampling scheme", "text": "Several approaches have been proposed to properly account for the case-control scheme in the association analysis of secondary trait. Here we adopt two of them for comparison purposes.\nA retrospective likelihood method: Lin and Zeng (2009) \ngiven by\ni i i as a linear regression model given by\nwhile we consider a logistic regression model as follows:\nWe are interested in making inference on α 1 . Since we are not interested in P X G ( , ) i i , it is possible to treat P X G ( , ) i i s' as nuisance parameters. To make inference on α 1 , Lin and Zeng (2009) proposed a profile-likelihood approach to eliminate the nuisance parameters and obtain a profile-likelihood function, which can be maximized by the Newton-Raphson algorithm. More details please refer to Lin and Zeng (2009) . In this paper, we use the software SPREG downloaded from http://dlin.web.unc.edu/software/spreg-2/.\nA re-parameterization of the conditional model: Tchetgen (2014) presented a general regression framework for the analysis of secondary trait in case-control studies. This method is based on a careful nonparametric reformulation of the conditional model for the secondary trait given D and X. As pointed out by Tchetgen (2014) , the inverse probability weighted regression method (IPW) (Monsees et al., 2009 ) is a special case of his method and therefore, we do not consider IPW here.\nFollowing Tchetgen (2014) , we are mainly interested in two mean models as follows. One is the population mean model for\nThe other one is the conditional mean of\nwhere S i =1 indicates selection into the case-control sample and the second equality holds under the assumption that selecting individuals into the case-control study is independent of Y G X ( , , )\ngiven D i by using the unmatched case-control design.\nThe key idea of Tchetgen's (2014) method is to re-parameterize the conditional mean model (4) based on a relationship between α μ G X ( , ; )\n(5) Fig. 3 . ADNI data analysis results: Q-Q plots of genome-wide association study (GWAS) of the right hippocampus volume by using the four methods including LReg, LRegD, SEE, and SPREG.\nW. Zhu et al. NeuroImage 146 (2017 ) 983-1002 where\nFurthermore, we have\nwhere\nare the disease prevalences in the target population and in the case-control sample, respectively. Moreover,\ncan be modeled as a logistic regression as follows:\nThe estimation of η in model (6) is followed by the estimations of β and α in model (5). Here, we are also interested in making inference on α 1 . See Tchetgen (2014) for more details."}, {"section_title": "Simulation studies", "text": "We use Monte Carlo simulations to evaluate the finite sample performance of the five methods mentioned in Section 2 including (i) LReg: linear regression method without adjusting for case-control status; (ii) LRegD: linear regression method adjusted for case-control status; (iii) LRegDG: linear regression method adjusted for casecontrol status as well as interaction between case-control status and genetic factor; (iv) SPREG: the retrospective likelihood method in Lin . ADNI data analysis results: Q-Q plots of genome-wide association study (GWAS) of the right amygdala volume by using the four methods including LReg, LRegD, SEE, and SPREG.\nW. Zhu et al. NeuroImage 146 (2017 ) 983-1002 . ADNI data analysis results: Q-Q and Manhattan plots of genome-wide association study (GWAS) of the right hippocampus volume by using LReg (first row), LRegD (second row), SEE with dp=0.25 (third row), and SPREG with dp=0.15 (fourth row) and dp=0.35 (fifth row). Fig. 7 . ADNI data analysis results: Q-Q and Manhattan plots of genome-wide association study (GWAS) of the left amygdala volume by using LReg (first row), LRegD (second row), SEE with dp=0.25 (third row), and SPREG with dp=0.15 (fourth row) and dp=0.35 (fifth row). Fig. 8 . ADNI data analysis results: Q-Q and Manhattan plots of genome-wide association study (GWAS) of the right amygdala volume by using LReg (first row), LRegD (second row), SEE with dp=0.2 (third row), and SPREG with dp=0.15 (fourth row) and dp=0.35 (fifth row).\nand Zeng (2009); and (v) SEE: the approach based on the reparameterization of conditional model in Tchetgen (2014) ."}, {"section_title": "Simulation setup", "text": "The data were simulated through the following steps:\n1. Generate design vector X X X = ( , ) T 1 2 , where X 1 is simulated from a Bernoulli distribution Bernoulli(0.5) and X 2 is simulated from a normal distribution N (0, 1). 2. Generate biallelic genetic variable G. Given a minor allele frequency (MAF) of p A and assuming Hardy-Weinberg equilibrium, SNP genotypes (AA, Aa and aa) were simulated from a multinomial distribution with frequency (p\nA 2 ) for (AA, Aa, aa). We consider only the additive mode of inheritance, under which the genetic variable was coded as the number of minor alleles. We set p A =0.1, 0.3, and 0.45. under the alternative hypothesis, respectively. 4. Generate case-control status. The case-control status was simulated using a logistic model given by\nWe considered two values of γ 2 : −log(2) and log (2) and three values of γ 1 : 0, log(1.2) and log(1.4). Then, we chose γ 0 to get a disease prevalence of 10%. Negative γ 2 indicates that the secondary trait and the quantitative trait are negatively correlated. For example, reduced brain volumes is often seen in Alzheimer's Disease patients and reduced gray matter (GM) volume is often seen in subjects with schizophrenia. 5. Repeat Steps 1-4 until a sample with 100,000 is obtained. 6. Sample 1000 cases and 1000 controls from the above large pool of subjects.\nSince we focus on the association study of imaging measures, we will primarily calculate Type I error rates and powers for each method instead of assessing estimation biases. For each combination of simulation parameters, we simulated 100,000 data sets and then estimated Type I error rates and powers of the four estimation methods. The estimated Type I error rates and powers are defined as the ratios of the number of tests that were rejected among the 100,000 replications under the null hypothesis (α = 0 1 ) and the alternative hypothesis (α = −0.12 1 ), respectively. Table 1 shows Type I error rates of the five methods for the analysis of the SNP-secondary trait association at different MAFs and two given nominal significance levels 0.01 and 0.05. If the Type I error rate for a test exceeds the nominal significance level too much, it cannot control Type I error well and is undesirable. The closer that the Type I error rate is to the nominal significance level, the better the test will be. When no SNP is associated with the disease, except for LReg, all other four methods have comparable Type I error rates and can appropriately control Type I errors at the nominal significance level. However, the Type I error rates for LReg increase with the odds ratio of SNP with the case-control status, especially when the secondary trait and the disease status are negatively correlated (OR DY =0.5). For LRegD, although the Type I error rates can be controlled well when the secondary trait and the disease status are negatively correlated, they increase with the odds ratio of SNP when the secondary trait and the disease status are positively correlated (OR DY =2). In contrast, LRegDG, SEE in Tchetgen (2014) , and SPREG in Lin and Zeng (2009) maintain appropriate Type I errors in all scenarios."}, {"section_title": "Type I error rates", "text": ""}, {"section_title": "Power results", "text": "As shown in Figs. 1-2, when no SNP is associated with the disease, LReg, LRegD, and SPREG have similar power, whereas they have higher power than SEE. The power of LRegDG is extremely small for all the simulation settings. Similar to the results for Type I errors, for all MAF settings, LReg and LRegD are not stable with respect to the odds ratio of SNP and the case-control status. When the secondary trait and the disease status are positively correlated (OR DY =2), the power of LReg decreases with the odds ratio of SNP and the case-control status. Similar phenomenon can be found for LRegD when the secondary trait and the disease status are negatively correlated (OR DY =0.5). Lin and Zeng (2009) also addressed the power loss in their main conclusions about the standard statistical methods for the secondary trait analysis. Please refer to Appendix B of Lin and Zeng (2009) for more details. For some settings, the higher power of LReg and LRegD comes with the cost of inflated type I error rates. In contrast, the power of SEE and SPREG remains stable regardless the direction of the correlation between the secondary trait and the case-control status, and no matter what the MAF is. This leads to a noteworthy observation that it is very important to appropriately handle the case-control sampling scheme in the analysis of secondary trait."}, {"section_title": "GWAS for ADNI", "text": ""}, {"section_title": "ADNI", "text": "\"Data used in the preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.lo- ni.usc.edu). The ADNI was launched in 2003 by the National Institute on Aging (NIA), the National Institute of Biomedical Imaging and Bioengineering (NIBIB), the Food and Drug Administration (FDA), private pharmaceutical companies and non-profit organizations, as a $60 million, 5-year publicprivate partnership. The primary goal of ADNI has been to test whether serial magnetic resonance imaging (MRI), positron emission tomography (PET), other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of mild cognitive impairment (MCI) and early Alzheimer's disease (AD). Determination of sensitive and specific markers of very early AD progression is intended to aid researchers and clinicians to develop new treatments and monitor their effectiveness, as well as lessen the time and cost of clinical trials. The Principal Investigator of this initiative is Michael W. Weiner, MD, VA Medical Center and University of California, San Francisco. ADNI is the result of efforts of many coinvestigators from a broad range of academic institutions and private corporations, and subjects have been recruited from over 50 sites across the U.S. and Canada. The initial goal of ADNI was to recruit 800 subjects but ADNI has been followed by ADNI-GO and ADNI-2. To date these three protocols have recruited over 1500 adults, ages 55 to 90, to participate in the research, consisting of cognitively normal older individuals, people with early or late MCI, and people with early AD. The follow up duration of each group is specified in the protocols for ADNI-1, ADNI-2 and ADNI-GO. Subjects originally recruited for ADNI-1 and ADNI-GO had the option to be followed in ADNI-2. For up-to-date information, see www.adni-info.org."}, {"section_title": "Sample", "text": "Two data sets, including imaging and genetic data as well as demographics, have been used throughout the paper. We focus on the first data set, which contains 818 ADNI-1 subjects, out of which 806 also had baseline neuroimaging data. For the second data set, we also include 432 ADNI-2 subjects and merge them with ADNI-1 subjects in order to increase the sample size. Both ADNI data sets contain three groups of subjects classified according to disease status, which are AD patients, patients with mild cognitive impairment (MCI) and cognitively normal (CN) subjects. Since we focus on evaluating how the case-control sampling scheme affects GWAS of ADNI imaging measures, we only consider AD patients and CN subjects from the baseline diagnostic groups for both data sets."}, {"section_title": "MRI acquisition and image preprocessing", "text": "The MRI data in ADNI 1, collected across a variety of 1.5 Tesla MRI scanners with protocols individualized for each scanner, included standard T1-weighted images obtained using volumetric three-dimensional sagittal MPRAGE or equivalent protocols with varying resolutions. The typical MRI protocol for ADNI1 included the following parameters: repetition time (TR)=2400 ms, inversion time (TI) =1000 ms, flip angle=8°, field of view (FOV)=24 cm with a 256×256×170 acquisition matrix in the x-, y-, and z-dimensions yielding a voxel size of 1.25×1.26×1.2 mm 3 (Jack et al., 2008) . All original uncorrected image files are available to the general scientific community at http://adni.loni.usc.edu/. All participants newly enrolled in ADNI 2 are scanned using the 3 T MRI scanning protocol. The typical MRI protocol for ADNI 2 included the following parameters: 8-channel coil, TR=400 ms, TE=min full, flip-angle=11°, slice thickness=1.2 mm, resolution=256×256 mm and FOV =26 cm. We processed the MRI data by using standard steps as follows. First, AC (anterior commissure) and PC (posterior commissure) correction were performed on all original images using MIPAV software, which is a free image analysis program developed by the National Institutes of Health and is available at http://mipav.cit.nih.gov (McAuliffe et al., 2002) . We re-sampled the images to have dimension 256 × 256 × 256. N2 bias field correction was implemented to reduce intensity inhomogeneity in these reconstructed images (Sled et al., 2002) . For each subject, we aligned the follow-up time point images to the baseline image using rigid registration for one subject in order to keep intracranial registration consistent. Skull-stripping on the baseline image were performed using a hybrid of two widely-used algorithms: Brain Surface Extractor (BSE) (Shattuck et al., 2001 ) and Brain Extraction Tool (BET) (Smith, 2002) , which can be used to compensate for problems encountered with individual methods and ensure the accuracy of the skull-stripping results. Intensity inhomogeneity correction followed the skull-stripping procedure. Then, we removed the cerebellum from the images based on registration using a manually-labeled cerebellum as a template. We performed intensity inhomogeneity correction for the third time and subsequently segmented the brain into four different tissues: grey matter (GM), white matter (WM), ventricle (VN), and cerebrospinal fluid (CSF) using the FSL-FAST software (Zhang et al., 2001 ). We used the deformation field that we obtained during registration to generate RAVENS maps (Davatzikos et al., 2001; Davatzikos and Resnick, 1998; Goldszal et al., 1998) to quantify the local volumetric group differences for the whole brain and each of the segmented tissue type (GM, WM, VN, and CSF), respectively. Regional volumetric measurements and analyses are then performed via measurements and analyses of the resulting tissue density maps. This technique has previously been applied to a variety of longitudinal aging studies (Beresford et al., 2006; Fan et al., 2008; Resnick et al., 2000) and has been extensively validated. Lastly, we carried out automatic regional labeling: first, by labeling the template and second, by transferring the labels following the deformable registration of subject images. Labeling of the ROIs for each subject's data was done Fig. 12 . ADNI data analysis results: Q-Q and Manhattan plots of genome-wide association study (GWAS) of the volume of me.f-o.gy.R by using LReg (first row), LRegD (second row), SEE with dp=0.25 (third row), and SPREG with dp=0.25 (fourth row).\nautomatically and based on previously-validated segmented atlas of the human brain (Kabani et al., 1998) After labeling 93 ROIs, we were able to compute volumes for each of these ROIs for each subject."}, {"section_title": "Genotype data", "text": "For the first data set, the subjects from ADNI-1 were genotyped using the Human610-Quad BeadChip (Illumina, Inc. San Diego, CA). The original data contained 620,901 markers, including multiple types of genetic variants. This paper focuses on single nucleotide polymorphisms (SNPs) and only SNP markers on the autosomes were analyzed (582,539 out of 598,821 SNP markers on the autosomes). To reduce the population stratification effect, we only used 749 Caucasians from all 818 subjects with complete imaging measurements at baseline. The following quality control (QC) procedures were then performed: (i) call rate check per subject, (ii) gender check, (iii) sibling pair identification, and (iv) population stratification. After the quality control procedures, 708 subjects remained. Furthermore, SNPs were excluded from the imaging genetics analysis if they could not meet any of the following criteria: (i) call rate per SNP ≥95%, (ii) minor allele frequency (MAF) ≥5%, and (iii) Hardy-Weinberg equilibrium test of p ≥ 10 −6 . Remaining missing genotype variables were imputed as the modal value. Finally, by removing all MCI subjects, 362 subjects and 501,584 SNPs remained in the final data analysis.\nFor the second data set, to increase the sample size, we merged ADNI-1 and ADNI-2 together. The subjects from ADNI-2 were genotyped using the Illumina Human OmniExpress BeadChip (Illumina, Inc. San Diego, CA). The original data contained 730,525 markers, including multiple types of genetic variants. We applied the following preprocessing technique to the genetic data obtained from ADNI-1 and ADNI-2. The similar quality control procedures, except that the call rate per SNP was changed to ≥90%, were performed on the genotype data for ADNI-1 and ADNI-2, separately. After the quality control procedures, 503,892 Fig. 13 . ADNI data analysis results: Q-Q and Manhattan plots of genome-wide association study (GWAS) of the volume of sup.f.gy.R by using LReg (first row), LRegD (second row), SEE with dp=0.25 (third row), and SPREG with dp=0.25 (fourth row).\nSNPs obtained from 22 chromosomes of 708 Caucasians with complete imaging measurements at baseline were included in ADNI-1, and 517,152 SNPs of 349 Caucasians with complete imaging measurements at baseline were included in ADNI-2. MACH-Admix software (http:// www.unc.edu/~yunmli/MaCH-Admix/) (Liu et al., 2013) was applied to perform genotype imputation, using 1000G Phase I Integrated Release Version 3 haplotypes (http://www.1000genomes.org) (1000 Genomes Project Consortium, 2012 as a reference panel. The 7,986,566 bi-allelic markers (including SNPs and indels) were included in ADNI-1 and 8, 218,182 markers were included in ADNI-2. Finally, the two data sets were merged based on the intersection of markers and quality control was also conducted after imputation, excluding markers with (i) low imputation accuracy (based on imputation output R 2 ), (ii) HardyWeinberg equilibrium p < 10 −6 , and (iii) MAF <5%. Finally, 494 AD and CN subjects and 6,017,259 bi-allelic markers (including SNPs and indels) remained in the final data analysis."}, {"section_title": "GWAS analysis", "text": "Since LRegDG has extremely small power according to our simulation studies, we only applied the four methods: LReg, LRegD, SEE, and SPREG mentioned in Section 2 to the 93 ROIs for the first data set, and to the right hippocampus only for the second data set. To correct for population stratification, we adopt the widely used principal component analysis (PCA) approach that was proposed by Price et al. (2006) . This approach applies principal components analysis to genotype data in order to identify several top principal components (PCs), which are the continuous axes of genetic variations, and then these PCs are treated as covariates in the association analysis. Here we only consider additive genetic model and include age, sex, and the top 5 principal component scores as non-genetic covariates. In addition, ICV is generally considered to be an accurate indicator of brain volume. In order to adjust for the effect of brain volume, the volume phenotypes were transformed by first being divided by ICV and then taking logarithm as response variables. For SEE (Tchetgen, 2014) and SPREG (Lin and Zeng, 2009) , an estimated disease prevalence is needed. However, since the disease prevalence of ADNI varies over time as well as different subpopulation of age based on the annual reports of ADNI, it is not straightforward to estimate the disease prevalence properly for the ADNI case-control sample. We varied the disease prevalence rate from 0.1 to 0.4 with an increment of 0.05."}, {"section_title": "Results", "text": "For the sake of space, we first present GWAS analysis based on 6 selected ROIs including the left and right amygdala, the left and right temporal lobes, and the left and right hippocampi at different disease prevalences for the first data set. Since the aim of this paper is to evaluate the effects of the case-control sampling scheme on different methods of GWAS, we did not use the usual significance threshold of GWAS due to only very few SNPs passing 5 × 10 −8 for all the methods. In order to achieve better comparison results, we use 10 −6 as the cut point of the p-values although we may also use other cut points for our GWAS of imaging measures. The quantile-quantile (Q-Q) plots of GWAS analyses on the right hippocampus, the left amygdala, and the right amygdala are shown in Figs. 3-5. The Q-Q plots for the left hippocampus and the left (or right) temporal lobe are not included here since there are no SNPs with p-value <10 −6 . Figs. 3-5 reveal that SEE is severely affected by disease prevalence (dp), whereas SPREG performs very well under different disease prevalence rates. The Manhattan plots of GWAS analyses on the right hippocampus, the left amygdala, and the Fig. 15 . ADNI data analysis results: Q-Q and Manhattan plots of genome-wide association study (GWAS) of the volume of fornix.R by using LReg (first row), LRegD (second row), SEE with dp=0.25 (third row), and SPREG with dp=0.25 (fourth row). Fig. 16 . ADNI 1 and 2 data analysis results: Q-Q and Manhattan plots of genome-wide association study (GWAS) of the right hippocampus volume by using LReg (first row), LRegD (second row), SEE with dp=0.25 (third row), and SPREG with dp=0.15 (fourth row) and dp=0.35 (fifth row).\nright amygdala are shown in Figs. 6-8. Here we only include the results corresponding to LReg, LRegD, and SEE for the right hippocampus and the left amygdala as dp=0.25 and for the right amygdala as dp=0.2, and those corresponding to SPREG as dp=0.15 and dp=0.35. All Q-Q plots and Manhattan plots show that LReg and SPREG give similar results for the 6 selected ROIs in the first data set, which are basically consistent with the results of Kim and Pan (2015) . Moreover, including disease status as a covariate in the linear model (LRegD) may be problematic for the GWAS analyses of secondary imaging phenotypes from ADNI. , we did not include them in Table 2 due to the poor performance of the Q-Q plots. As shown in Table 2 , SPREG is able to detect more SNP-ROI pairs with values smaller than 10 −6 compared with LReg and/or LRegD.Specifically, six SNP-ROI pairs with their p-values smaller than 10 −6 are identified by SPREG, whereas only four of them are found by LReg, and one is found by the LRegD. SPREG leads to the smallest p-values compared with all other methods, if disease prevalence can be chosen properly.All these results indicate that it is helpful to properly consider the sampling scheme in GWAS of secondary imaging phenotypes even though LReg is seemed to be reasonable. The SNP marker rs2075650, identified by LReg and SPREG, is associated with the right hippocampus and the right amygdala.\nThe association between rs2075650 and the right hippocampus was also detected by previous works (Shen et al., 2010; Xu et al., 2014) . Figs. 9-11 present the LocusZoom plots around SNPs in 19q13 for the right hippocampus and right amygdala, in 18q21.31 and 5q33.1 for the left amygdala, and in 14q24.3 for the right amygdala. In the 18q21.31 region, rs12457258 and rs12605132 are highly correlated with each other (r > 0.8 2 ) and show similar low p-values for the association with the left amygdala volume, even though rs12605132 does not show significant association at the significance level <10 −6 . In the 5q33.1 region, rs10476743 and rs1056993 are both highly correlated with rs1135093 (r > 0.8 2 ), rs4629585 is correlated with rs1135093 (r > 0.6 2 ), and they show similar low p-values for the association with the left amygdala volume. In the 14q24.3 region, rs2655997 is correlated with rs207801 (r > 0.6 2 ) and the p-value for the association with the right amygdala volume is E 7.32 − 6. In the 19q13 region, rs2075650 has the smallest p-value for the right hippocampus volume and the right amygdala volume.\nWe summarize some key findings for other 87 ROIs in the first dataset. For SEE and SPREG, we only include the results corresponding to dp=0.25 here. ( Figs. 13 and 15 ), SPREG has smaller p-values than LReg for these two SNP-ROI pairs. These summaries show that SPREG is better than LReg in GWAS of these four ROIs from ADNI-1. Finally, we present the GWAS results of the right hippocampus in the second data set. Here, we only include the results with dp=0.25 for SEE and the results with dp=0.15 and dp=0.35 for SPREG. Fig. 16 shows the Q-Q plots and Manhattan plots of GWAS on the right hippocampus. Again, LReg and SPREG, even SEE, give the similar results.\nOverall, LReg is a good choice for most of ROIs from ADNI, but all the above results lead us to believe that it may be necessary to consider the sampling scheme in GWAS of secondary imaging phenotypes from ADNI."}, {"section_title": "Discussion", "text": "The two aims of this paper are to draw an attention on the importance of accounting for the case-control sampling scheme in the genome-wide association study of secondary imaging phenotypes and to understand how much the inflated false positive rate may be produced by standard LReg and LRegD when neglecting the sampling scheme and how much power we may potentially gain by properly accounting for it.\nWe have used the ADNI data to show that LReg and SPREG give very similar results for most of ROIs although LReg does not take account of the sampling scheme, which is probably due to the high prevalence of the AD in the target population as pointed out by Kim and Pan (2015) . However, further analyses showed that more significant SNP-ROI pairs with their p-values smaller than 10 −8 can be identified by using SPREG based on the retrospective likelihood method for me.f-o.gy.R, sup.f.gy.R, inf.f.gy.L and fornix.R. We have used extensive simulations to show that linear regression methods including LReg and LRegD show severely inflated Type I error rates when the genetic variant is associated with the case-control status and reduce powers when the secondary trait is highly associated with the case-control status. Moreover, the retrospective likelihood method performs very well both for power calculation and for controlling of Type I error. Although we have designed the simulation studies by assuming a single quantitative secondary trait and the additive mode of inheritance, the studies can be easily extended to consider other kind of secondary traits such as binary traits (Wang and Shete, 2011; Chen et al., 2013) , longitudinal traits (Skup et al., 2012; Xu et al., 2014) , multiple traits (Lin et al., 2012; Zhang et al., 2014; Zhu et al., 2014) as well as other modes of inheritance. We only include AD patients and CN subjects in the GWAS of ADNI data in the paper, but we may include the MCI subjects in our GWAS and treat them as controls by following the analysis in Kim and Pan (2015) . Moreover, it may be more interesting to develop new methods for secondary imaging phenotypes under the multiple-group design.\nAlthough our conclusions are only based on the analysis of ANDI dataset, in which the main conclusion is that it is helpful to adjust for the sampling scheme in GWAS of secondary imaging phenotypes, we expect that the general conclusions will not be changed too much even for other imaging genetic datasets. Following the discussions of Kim and Pan (2015) , it is necessary to properly adjust the sampling scheme of any imaging genetic study when the disease prevalence in the target population is much less than that of AD in ADNI study. The topic initiated by this paper is rather important and timely, as there is an increasing interest in GWAS of secondary imaging data, but almost all existing analyses do not account for the case-control sampling scheme. We hope that our paper along with Kim and Pan (2015) can encourage more scientists to conduct further research on the development of new methods for secondary-trait analysis and other related issues in imaging genetic studies."}]