[{"section_title": "", "text": "problems with unmet need, but only if there are providers able and willing to provide treatment. Some authors have expressed concern that rural areas-and possibly urban areas as well-may experience an acute shortage of mental health providers. 20 However, regardless of setting, all providers must continue to work to identify mental health conditions to better assess what they are doing or not doing for population health management. 21, 22 Increasing family physicians' understanding of the importance of addressing mental health is a critical step toward better addressing this problem.\nAs Xierali et al. 23 highlight, there is great potential for family physicians to help fill the mental health gap in the United States. There are nearly twice as many family physicians as psychiatrists in the United States, and family physicians are more likely than psychiatrists to be situated in rural areas. The authors report that about 40% of family physicians report providing mental health services in urban areas, with up to 52% providing mental health services in more rural settings (rural-urban continuum codes 7-9).\nPsychiatrists, like other specialist groups, tend to cluster in urban regions, potentially reducing access to mental health care in rural areas. Xierali et al. 23 suggests that family physicians can help fill this need. While this is indeed an ambitious goal and, as some might argue, one that medicine as a whole has been pursuing for decades, 24 the assumption that one provider can adequately address all of a patient's needs is being increasingly replaced by the necessity of teams and team-based care.\nAs the article highlights, only 43% of family physicians nationwide provide mental health care, which begs the question, Why aren't more family physicians providing mental health care? Lack of knowledge, competing work demands (too busy providing other types of services), and payment and reimbursement issues could all be Funding: none.\nplaying a role. These issues need to be addressed in how we train family physicians, how primary care practices are structured, and how reimbursement is provided. Nonphysician mental health providers are far more numerous than psychiatrists and family physicians. 25 To address the population's need for mental health, primary care teams should include psychologists, social workers, and nurses to help extend the reach of physicians. 8 Such team-based integrated models use allied professionals to provide treatments such as psychotherapy, care managers to coordinate care, and registries and other health information technology to organize delivery of care. 26, 27 These integrated programs are being used already in rural settings with low concentrations of psychiatrists and other mental health providers, such as Alaska. 28 In addition, new technologies such as telemedicine can also be used to address gaps in mental health care in rural settings. 29 Primary care is currently witnessing a substantial redesign through the patient-centered medical home. 10,30 -32 This redesign affords primary care the opportunity to discuss ways to better deliver comprehensive care for patients with comorbid mental health conditions. 33 Contemporary evidence supports the notion that primary care can, and should, integrate mental health providers into care teams. 25,34 -37 However, these models are not yet in widespread use, and there are still challenges in paying for integrated care models. For example, having separate mental and physical health payment structures and reimbursement practices often is a barrier to better integration of care and leaves primary care to rely on referrals to mental health specialists. 38, 39 In the absence of coordination, referral alone may result in limited follow-up and poor outcomes of care. 4,40 -42 This policy brief suggests that family physicians are an important and currently underutilized resource for improving access to mental health care. Their potential will best be realized if they are appropriately trained and supported, and if practices are restructured to include allied mental health providers, care managers, and specialist consultants and use information technology such as registries and telemedicine to support comprehensive and integrated health care. Models such as these are beginning to take hold, and we now have an opportunity to make the integrated health care vision real."}]