[{"section_title": "Abstract", "text": "This article examines mothers' part-time employment, comparing working part-time with fulltime employment and not working at all. Our analysis is organized around 2 paradigmatic views of maternal employment, 1 centered on the adaptive nature of mothers' part-time employment and the other on the detrimental nature of mothers' part-time employment. In each perspective, a variety of theories have been used to shape the literature, influencing the choice of research questions and interpretation of findings. These theories include stress and coping, life course, role, family systems, ecological, and feminist theory. In general, findings support part-time employment as an adaptive strategy. As an exception, mothers employed full-time had better marital quality and performed less household and child-care work than did mothers employed part-time. We also document limitations regarding attention to diverse familial outcomes in subgroups of mothers or families and to potentially important selection factors maternal employment | part-time employment | work-family | work hours | parenting Keywords:\nThe majority of mothers in the United States are employed, and approximately 25% of all women currently work part-time schedules (Bureau of Labor Statistics [BLS], 2009). Prevalence rates vary somewhat by ethnicity; more European American than African American female wage earners work part-time (White, 30.5%; Black, 22%; Asian, 25.2%; Hispanic, 25.7%; BLS, 2008). Most mothers living in the United States or Britain have worked part-time at some point during their lives (Budig & England, 2001; Manning & Petrongolo, 2008) . Thus, part-time work is a common experience for women in Western culture.\nBy contrast, men rarely work part-time unless they are combining work with school or with retirement from a full-time job (Duffy & Pupo, 1992; Hakim, 2000; Sheridan, 2004) . In a recent national survey, fewer fathers of children younger than age 18 reported a preference for working part-time (12%) than for not working at all (26%; Pew Research Center, 2007). According to data from the National Study of Families and Households, 10% of the two-parent families surveyed said they would prefer both father and mother to work part-time, but in reality almost none of the families did so (Clarkberg & Moen, 2001 ). The gendered nature of part-time work has implications for the ways we view employment in families and its relation to child development and family functioning. Although a full discussion of these issues would require a longer article, we identify gendered issues and assumptions as they relate to the literature reviewed. From the outset, it is important to note that mothers' more frequent use of part-time employment than fathers both reflects and contributes to gender inequities in family life and the work force over time (Budig & England, 2001; Duffy & Pupo, 1992; Eby, Casper, Lockwood, Bordeaux, & Brinley, 2005; Gatrell, 2007; Webber & Williams, 2008b) . Low prevalence rates for fathers' part-time employment and biases in the scholarly community also have resulted in an extremely sparse empirical literature devoted to the effects of fathers' part-time employment on child, parent, and family outcomes.\nAt this point in historical time, we believe that mothers' part-time work deserves in-depth attention as a unique employment status because both parents and employers find the classification meaningful and distinct (Duffy & Pupo, 1992; Pew Research Center, 2007). The literature on maternal part-time employment clearly indicates that mothers view part-time employment as qualitatively different from full-time employment, not as a space on a continuous curve of work hours (e.g., Higgins, Duxbury, & Johnson, 2000; Jacob, 2008; Webber & Williams, 2008a ). There also is some literature suggesting that men view their wives' part-time work as qualitatively different from full-time employment (Duffy & Pupo, 1992) . In addition to family members, employers also view part-time work as a distinct work status (Falzone, 2001 ). Employers' distinctions affect expectations and promotional opportunities for employees, as well as compensation structures (Correll, Benard, & Paik, 2007; McDonald, Bradley, & Guthrie, 2006; Prowse, 2005; Sinclair, Martin, & Michel, 1999) . In fact, these different expectations, opportunities, and compensation structures have reinforced the vulnerable and marginalized nature of many part-time jobs (Webber & Williams, 2008a; Wenger, 2001) . Finally, some workfamily researchers who have examined variability in work hours also have viewed part-time work as qualitatively different by asking parents about their work preferences using these three classifications and by organizing their statistical tests and findings using the categories of not employed, part-time, and full-time (e.g., Burchinal & Clarke-Stewart, 2007; Falzone, 2001; Jacob, 2008) . In addition, researchers who have operationalized work hours continuously have rarely examined curvilinear effects and so have been unable to determine whether part-time employment has advantages or disadvantages over nonemployment or full-time employment. Thus, the analysis of work hours as continuous has created a large gap in the understanding of maternal employment.\nIn this article, we describe paradigms and associated theories that have shaped the discourse on mothers' part-time work. This first section draws on expository essays and qualitative and quantitative research. Following this theoretical section, we detail issues related to mothers' parttime work, including operational definitions of part-time, compensation, and reasons women give for working part-time. The quantitative research on mothers' part-time employment is reviewed in the following section, organized by comparisons with nonemployment and full-time employment. The article ends with a discussion of major trends and issues, highlighting the need to examine part-time work as a distinct work arrangement, the importance of refining theory, the need to use improved research methodologies, and the necessity of examining salient moderators (including demographic and attitudinal factors) that condition key findings.\nIn this section, we briefly describe two paradigmatic views of maternal employment and the associated theoretical approaches that have shaped the literature on mothers' part-time work. A variety of theories have been used to guide research on maternal employment in general and part-time work by extension. Even when implicit, theory has been important in the literature on mothers' employment because it has shaped the selection of predictors and outcomes, has been used to justify a primary focus on mothers' rather than fathers' employment, and has served as a foundation for the direction of hypothesized associations.\nThe most common paradigm found in the literature on mothers' employment views part-time employment as an adaptive strategy that allows women to balance work and family needs when both require extensive time, energy, and attention (e.g"}, {"section_title": "", "text": "national survey, fewer fathers of children younger than age 18 reported a preference for working part-time (12%) than for not working at all (26%; Pew Research Center, 2007) . According to data from the National Study of Families and Households, 10% of the two-parent families surveyed said they would prefer both father and mother to work part-time, but in reality almost none of the families did so (Clarkberg & Moen, 2001 ). The gendered nature of part-time work has implications for the ways we view employment in families and its relation to child development and family functioning. Although a full discussion of these issues would require a longer article, we identify gendered issues and assumptions as they relate to the literature reviewed. From the outset, it is important to note that mothers' more frequent use of part-time employment than fathers both reflects and contributes to gender inequities in family life and the work force over time (Budig & England, 2001; Duffy & Pupo, 1992; Eby, Casper, Lockwood, Bordeaux, & Brinley, 2005; Gatrell, 2007; Webber & Williams, 2008b) . Low prevalence rates for fathers' part-time employment and biases in the scholarly community also have resulted in an extremely sparse empirical literature devoted to the effects of fathers' part-time employment on child, parent, and family outcomes.\nAt this point in historical time, we believe that mothers' part-time work deserves in-depth attention as a unique employment status because both parents and employers find the classification meaningful and distinct (Duffy & Pupo, 1992; Pew Research Center, 2007) . The literature on maternal part-time employment clearly indicates that mothers view part-time employment as qualitatively different from full-time employment, not as a space on a continuous curve of work hours (e.g., Higgins, Duxbury, & Johnson, 2000; Jacob, 2008; Webber & Williams, 2008a ). There also is some literature suggesting that men view their wives' part-time work as qualitatively different from full-time employment (Duffy & Pupo, 1992) . In addition to family members, employers also view part-time work as a distinct work status (Falzone, 2001) . Employers' distinctions affect expectations and promotional opportunities for employees, as well as compensation structures (Correll, Benard, & Paik, 2007; McDonald, Bradley, & Guthrie, 2006; Prowse, 2005; Sinclair, Martin, & Michel, 1999) . In fact, these different expectations, opportunities, and compensation structures have reinforced the vulnerable and marginalized nature of many part-time jobs (Webber & Williams, 2008a; Wenger, 2001) . Finally, some workfamily researchers who have examined variability in work hours also have viewed part-time work as qualitatively different by asking parents about their work preferences using these three classifications and by organizing their statistical tests and findings using the categories of not employed, part-time, and full-time (e.g., Burchinal & Clarke-Stewart, 2007; Falzone, 2001; Jacob, 2008) . In addition, researchers who have operationalized work hours continuously have rarely examined curvilinear effects and so have been unable to determine whether part-time employment has advantages or disadvantages over nonemployment or full-time employment. Thus, the analysis of work hours as continuous has created a large gap in the understanding of maternal employment.\nIn this article, we describe paradigms and associated theories that have shaped the discourse on mothers' part-time work. This first section draws on expository essays and qualitative and quantitative research. Following this theoretical section, we detail issues related to mothers' parttime work, including operational definitions of part-time, compensation, and reasons women give for working part-time. The quantitative research on mothers' part-time employment is reviewed in the following section, organized by comparisons with nonemployment and full-time employment. The article ends with a discussion of major trends and issues, highlighting the need to examine part-time work as a distinct work arrangement, the importance of refining theory, the need to use improved research methodologies, and the necessity of examining salient moderators (including demographic and attitudinal factors) that condition key findings."}, {"section_title": "Theoretical Underpinnings", "text": "In this section, we briefly describe two paradigmatic views of maternal employment and the associated theoretical approaches that have shaped the literature on mothers' part-time work. A variety of theories have been used to guide research on maternal employment in general and part-time work by extension. Even when implicit, theory has been important in the literature on mothers' employment because it has shaped the selection of predictors and outcomes, has been used to justify a primary focus on mothers' rather than fathers' employment, and has served as a foundation for the direction of hypothesized associations."}, {"section_title": "Part-Time Employment as an Adaptive Strategy", "text": "The most common paradigm found in the literature on mothers' employment views part-time employment as an adaptive strategy that allows women to balance work and family needs when both require extensive time, energy, and attention (e.g., Falzone, 2001; Sweet & Moen, 2006) . From this perspective, part-time employment is conceptualized as having advantages over fulltime employment, including increased scheduling flexibility and less conflict between work and family demands (Byron, 2005; Hill, Martinson, & Ferris, 2004) . Although working part-time is only one of several possible work-family adjustment strategies, it is a relatively common consideration for mothers who care for young children (Becker & Moen, 1999; Falzone, 2001) .\nThe term adaptive also has been used in the context of comparing part-time employment with not being employed. Some consider part-time employment to have advantages over no employment because it increases family income, maintains women's employment skills, and provides mothers with social support (Bonney, 2005; Falzone, 2001; Webber & Williams, 2008a) . In addition, compared with nonemployment, part-time employment has been viewed as adaptive when full-time work hours are not available (e.g., involuntary part-time employment; Maynard, Thorsteinson, & Parfyonova, 2006) .\nThe adaptive nature of part-time employment has been emphasized by researchers who frame their work according to stress and coping theories, which generally focus on the transfer of job stress to various family outcomes. Perry -Jenkins, Repetti, and Crouter (2000) noted that stress models typically examine how objective job conditions such as work hours affect various indicators of family life through parents' psychological responses. They suggested that it also is critical to explicate chronic stress transfer processes by identifying the subgroups of families for whom various transfer mechanisms are applicable. The importance of identifying salient mediators and moderators has been highlighted when stress theories have been used to frame research (Lleras, 2008) .\nLife-course theories emphasize the variation in choices individuals make at different points in time and address the importance of children's and parents' ages, transitions, and life trajectories (Hynes & Clarkberg, 2005) . This approach draws attention to the fact that many women move among full-time work, part-time work, and nonemployment at different points in the life course (Bogenschneider & Steinberg, 1994) . Sweet and Moen (2006) have detailed several contributions from life-course theories to the literature on work and family. They argued that research is enhanced when it takes into account the links between employment and family careers in individuals and couples; the historical context of occupational and familial institutions that changes across birth cohorts; and the strategic choices parents make over time as they address family, employment, and personal needs and demands. The construct of linked lives in life-course theory highlights the importance of considering the role of husbands and fathers, regardless of residential status. Life-course theories also highlight the importance of including the interaction among key factors over time as a way of incorporating context into the understanding of work-family issues (Bianchi & Milkie, 2010) .\nAnother framework for research into adaptation comes from a role-theory perspective. Fulfilling multiple functions such as caring for children and earning income is viewed as creating role strain because of inadequate time, energy, or attention to enact multiple and possibly competing demands across roles (Nomaguchi, 2006; Roxburgh, 2005; Voydanoff, 2002) . Alternatively, but also from a role-theory perspective, fulfilling multiple functions, such as caring for family members and earning income, is viewed as creating role enhancement by increasing selfefficacy, enhancing well-being, and promoting self-growth (Marks & MacDermid, 1996; Nomaguchi, 2006; Voydanoff, 2002) .\nFamily systems theories have been used to examine the work-family interface with an emphasis on the constructs of boundaries and boundary processes (Bianchi & Milkie, 2010) . Important characteristics of boundaries include permeability and flexibility (Bass, Butler, Grzywacz, & Linney, 2009) ; systems theory also focuses on the spillover, both positive and negative, of emotions, cognitions, and behaviors from work to family and from family to work. Ecological theories (Bronfenbrenner, 1986; Perry-Jenkins & Gilman, 2000) also have been used to conceptualize the interconnections between family and employment. The work-family interface is typically used in ecological theory as a key example of a mesosystem, as the experiences a parent has at work (a microsystem) are hypothesized to affect their interactions in the family (another microsystem). An ecological approach also recognizes the importance of considering personal characteristics, bidirectional proximal processes, contextual factors that modify processes, and both developmental and historical time (Perry-Jenkins & MacDermid, in press; Voydanoff, 2002) . The emphasis in the work-family literature on balance, fit, spillover, and adaptation stem from ecological theories (Pittman, Kerpelman, & McFadyen, 2004) . Ecological models also have highlighted the importance of examining family-environment fit and quality of life (Bubolz & Sontag, 1993; Jacob, 2008) . Rarely has fathers' part-time work been theorized as adaptive."}, {"section_title": "Part-Time Employment as a Detrimental Strategy", "text": "A second paradigm views part-time employment as an exploitive work status that promotes and sustains inequality between men and women (Barnett & Gareis, 2000; Warren, 2004) . From this viewpoint, part-time jobs are created at the expense of women for the benefit of employers and male full-time workers and create vulnerabilities in women's current and future economic wellbeing because of low pay and lack of opportunity for advancement (Connolly & Gregory, 2007; Duffy & Pupo, 1992; Webber & Williams, 2008a) . Part-time work is primarily a strategy that employers use to save themselves money, not to promote family well-being (Sheridan, 2004) . Employers view part-time workers as less committed to a career and therefore invest less in them in terms of training or opportunities for advancement (Bonney, 2007; Clarkberg & Moen, 2001; Jenkins, 2004) ; as a result, part-time workers may stay at the same level of responsibility and often the same wage level for many years. Working long hours is often considered as equating to high productivity and is therefore rewarded (Clarkberg & Moen, 2001; Sheridan, 2004) . Furthermore, part-time workers are often not eligible for fringe benefits such as health insurance and unemployment benefits (Bonney, 2007; Jenkins, 2004) . Because of these structural characteristics of part-time work, couples, especially those with young children, are likely to consider it important that at least one parent work full-time. Men who reduce their work hours see a greater reduction in their income than do women because women's average earnings are less than 80% of men's (Institute for Women's Policy Research, 2010). Part-time work typically makes a person dependent on some other source of income, such as the income of a partner (Sheridan, 2004) . Women almost always assume the resulting vulnerability, which places them at risk for long-term financial dependency. Furthermore, there is some evidence that structural shifts in sharing family work with husbands and partners occur only when mothers are employed full-time (Stier & Lewin-Epstein, 2000) . From this viewpoint, then, mothers' part-time employment is an unsatisfactory strategy for achieving personal and familial goals.\nThis view is presented most clearly by feminist theorists, who have emphasized the gendered nature of part-time employment, its contribution to the male-female wage differential, and its role in perpetuating male dominance (Bennetts, 2007; Budig & England, 2001; Jacobs & Gerson, 2004) . Feminist theorizing has sensitized employment researchers to the importance of the social contexts of race, ethnicity, family structure, and sexual orientation (Budig & England, 2001 ) and has argued that the consideration of patriarchy should be a central focus in work-family research given the influence it has had on the structure of the work force and the family contexts in which employment decisions are made. The reasons that men do not work part-time undoubtedly include societal expectations and ideas about personal identity that emphasize men as the providers for their families (Daehlen, 2007; Hakim, 2000; Sheridan, 2004) . Reasons for mothers' more prevalent use of part-time work than fathers' also may result, in part, from families \"doing gender\" as they make key employment decisions across their life course. As such, feminist researchers have raised important issues, such as why mothers' but not fathers' employment has been examined as a risk factor for child and family functioning (Stier & Lewin-Epstein, 2000) ."}, {"section_title": "Summary", "text": "Each of these perspectives has shaped discourse and guided research on maternal employment, in some cases paying particular attention to part-time employment. This variety in theoretical orientations reflects the widespread interest in the work-family interface but has also had the effect of splintering the literature (Perry- . Regardless of this splintering, we believe that employment researchers should explicate their theoretical perspective and that integrative theoretical models need to be created that address the interconnections between reasons families use part-time employment and the effects of part-time work on various child, adult, and family outcomes."}, {"section_title": "Mothers' Part-Time Employment", "text": "In this section, we address issues related to the general topic of mothers' part-time employment: terminology, operational definitions, compensation, and reasons for part-time employment. These topics inform the context for the interpretation of findings from the research literature that we describe in the following section."}, {"section_title": "Terminology and Definitions", "text": "The overwhelming majority of studies that have considered mothers' part-time employment have used the term part-time to label this phenomenon. Some scholars, however, have preferred other terms, including reduced work hours (Barnett & Gareis, 2000) , fractional employment (Gatrell, 2007) , and new concept part-time (Hill, Martinson et al., 2004) . Drawing on earlier terminology by Negrey (1993) , Barnett and Gareis (2000) examined part-time employment by focusing on reduced employment hours of physicians in dual-earner marriages. These spouses had prestigious, high-skilled, demanding occupations, and reduced work hours were operationalized as fewer than 40 hours each week for female physicians and fewer than 50 hours for male physicians. The term fractional employment has been used in European research and the popular press to indicate professional mothers who work a percentage of a whole-time equivalent position (Gatrell, 2007) . These positions typically are salaried jobs with high occupational status and employment security. Building on Barnett's work, the term new-concept part-time employment has been used to connote part-time jobs for highly educated mothers in professional, salaried positions (Hill, Martinson et al., 2004) . Thus, this new terminology has largely been used to describe somewhat atypical part-time jobs that have high occupational status, job security, relatively high levels of skill discretion and/or complexity, and opportunities for career advancement. Qualitative researchers have recently labeled these as \"good\" part-time jobs, as distinguished from \"bad\" part-time jobs that do not carry these advantages (Webber & Williams, 2008a) .\nThere is no standard definition of the number of hours that constitutes part-time employment. For example, the U.S. Bureau of Labor Statistics (2009) defines part-time employment as working between 1 and 34 hours per week; Statistics Canada (2000), as working between 1 and 29 hours per week for at least 48 of 52 weeks (Nomaguchi, 2006) ; and the British Household Panel Survey, as working between 1 and 30 hours per week (Warren, 2004) . Individual researchers also have operationalized part-time employment using a variety of cutoffs that have ranged from 20 hours per week (e.g., Han, Waldfogel, & Brooks-Gunn, 2001 ) to 35 hours per week (e.g., Lleras, 2008) . Some researchers also have set a minimum number of work hours to be considered employed part-time, such as at least 15 or 20 hours weekly (Hill, Martinson et al., 2004; Stier & Lewin-Epstein, 2000) . Other researchers have failed to report their operational definition of part-time employment (noted by Thorsteinson [2003] and confirmed in the present review), and this omission has created some unnecessary ambiguity in the research on maternal work hours.\nRecently, researchers have highlighted the heterogeneity within part-time employment (Walters, 2005) and have suggested further partitioning the work hours of individuals employed parttime. Lleras (2008) has suggested categories of low part-time (1-20 hours) and part-time (21-35 hours). Walters (2005) suggested four categories: marginal part-time (0-7 hours), short part-time (8-15 hours), moderate part-time (16-23 hours), and long part-time (24-30 hours). Although recognizing the potential heterogeneity within part-time employment increases the complexity of the study of mothers' work hours, we believe such considerations are necessary to further future research.\nIn the current review, we identify the operational definitions used by researchers rather than impose one specific definition. This is consistent with procedures used in other reviews (e.g., Thorsteinson, 2003) and by the National Compensation Survey (2007), which classified workers as full-time and part-time on the basis of the employer's designations."}, {"section_title": "Compensation", "text": "On average, U.S. women age 25 and older employed part-time earned $263 per week in the second quarter of 2010 (BLS, 2010a), a $4-per-week increase over 2007 earnings but a $6-perweek decrease compared with earnings from the second quarter of 2009. Not surprisingly, wage rates are lower for part-time than full-time employees. In their analysis of U.S. regional data for all workers, male and female, Pongrace and Zilberman (2009) reported that part-time workers' hourly wage averaged between 88.1% (Pacific region) and 98.6% (East North Central region) of full-time workers' hourly wage. This wage differential may be related to lower occupational skill requirements and limited work experience, as well as gender and parental status (Budig & England, 2001; Correll et al., 2007; Hirsch, 2005) .\nIn addition to lower hourly wage rates, part-time workers also have fewer benefits than do fulltime workers. The difference is dramatic and includes deficits in medical insurance, retirement, life insurance, and paid sick leave (BLS, 2010b). The greatest current coverage differences are for medical insurance, with 24% of part-time workers, compared with 86% of full-time workers, having access to employee-sponsored medical insurance in private-industry jobs. These data were not disaggregated for female and male workers."}, {"section_title": "Preferences and Reasons for Part-Time Employment", "text": "Some mothers prefer part-time employment over not being employed and over full-time employment. The Pew Research Center (2007) recently conducted a national survey of 2,020 randomly-selected adults and found that 21% of employed mothers preferred full-time work, 60% preferred part-time work, and 19% preferred no employment. For mothers currently not employed, 16% preferred full-time employment, 33% preferred part-time work, and 48% preferred no employment. Few preference differences were found across mothers' education or income levels, but more White than Black mothers preferred part-time employment. Preferences also varied by ages of children; mothers with children younger than age 4 were more likely to prefer part-time work than mothers of older children. Jacob (2008) conducted a telephone survey of a nationally representative sample of 1,777 U.S. mothers, 23% of whom were currently employed part-time. Among those employed part-time, 49% preferred this arrangement, 26% preferred to work for pay at home, 14% preferred no employment, and 11% preferred full-time employment. Among mothers employed full-time, 23% preferred this arrangement, 30% preferred to work for pay at home, 12% preferred no employment, and 35% preferred part-time employment. Among mothers who were not employed, 44% preferred this arrangement, 29% preferred to work for pay at home, 22% preferred part-time employment, and 5% preferred full-time employment. Although there is relatively little research on women's preferences for part-time employment over other arrangements, research suggests that many women are satisfied with a part-time schedule (Shaefer, 2009; Sweet & Moen, 2006) . Some economists and researchers distinguish involuntary from voluntary part-time employment, with involuntary part-time employment defined as working reduced hours because of economic reasons, such as being unable to find full-time work or having reduced hours as a result of economic downturns (BLS, 2008; Connolly & Gregory, 2007) . In 2008, 14.8% of women age 25-54 were considered involuntary part-time workers. Current Population Survey (CPS) data from 2007 indicated that the majority of women who were voluntarily employed part-time reported that they chose this status because of noneconomic reasons, such as caring for family members and/or difficulties with child-care arrangements (Shaefer, 2009 ). Meta-analytic findings indicate that women who are voluntary part-time employees have higher levels of job satisfaction than do involuntary part-time workers (Thorsteinson, 2003) .\nSchaefer (2009) documented that it is important to distinguish working part-time involuntarily or voluntarily from being a primary or secondary wage earner in a family. Using earnings data from the 2008 CPS, he found that 26% of primary wage earners and 54% of secondary wage earners were working part-time voluntarily. Involuntary rates did not differ by type of earner, with 10% of both primary and secondary wage earners working part-time involuntarily. Schaefer contends that primary wage earners employed part-time face many challenges, including a high risk of poverty and inadequate medical insurance coverage, whereas secondary earners employed parttime are less likely to confront those vulnerabilities.\nWomen's age is related to reasons for choosing to work part-time. Abramson (2007) found that women age 30-34 worked part-time voluntarily to care for their own children or because of family responsibilities, whereas older women age 45-49 chose part-time work as a personal preference. Reasons for working part-time involuntarily did not differ across women of different ages."}, {"section_title": "Mothers' Part-Time Employment and Child and Family Well-Being", "text": "Our review of quantitative research focuses on two questions: How do outcomes for children, parents, and families differ when mothers are employed part-time compared with (a) situations in which mothers are not employed and (b) situations in which mothers are employed full-time?"}, {"section_title": "Mothers' Part-Time Employment Compared With Nonemployment", "text": "The review of research is organized by type of outcome: children's well-being, mothers' wellbeing, and family functioning (e.g., parenting, marital and relational functioning, division of family work). With the exception of children's cognitive functioning, research is sparse. Across several outcomes, differences tend to favor part-time employment over nonemployment.\nChildren's well-being. A major focus of research on maternal employment has centered on child outcomes. We organize this review by first examining children's cognitive and intellectual functioning and then children's socioemotional functioning.\nChildren's cognitive and intellectual functioning. Most cross-sectional research has found that children's and adolescents' cognitive functioning is similar when mothers are not employed and when mothers are employed part-time. In their meta-analysis of 14 studies, Goldberg, Prause, Lucas-Thompson, and Himsel (2008) found no differences between these employment groups on general cognitive functioning, school grades, teacher reports of child academic performance, or standardized IQ and achievement scores. These analysts used the primary researcher's operational definition of part-time work hours to designate part-time in the meta-analysis.\nLongitudinal research focused on children's cognitive development from age 2-8 also has shown few significant differences between nonemployed and part-time employed mothers, particularly when demographic factors are controlled (Brooks-Gunn, Han, & Waldfogel, 2010; Burchinal & Clarke-Stewart, 2007; Greenstein, 1995; Hill, Waldfogel, Brooks-Gun, & Han, 2005) . Although much of this research has been limited to examining employment main effects, Greenstein conducted 24 interaction analyses by race and child gender; the only significant finding was that cognitive stimulation was associated positively with children's vocabulary scores for all subgroups except Black sons of mothers who worked part-time continuously.\nMuch less research has been conducted on older children's cognitive outcomes. Bogenschneider and Steinberg (1994) found no maternal employment (current or previous) differences on high school grades, whereas Muller (1995) found positive outcomes in terms of math scores for children of mothers employed part-time (fewer than 35 hours per week) compared with nonemployment.\nIn general, the demographics of participants in studies of child cognitive outcomes indicate that mothers who are employed part-time are an economically advantaged group compared with nonemployed mothers. Muller (1995) conducted extensive analyses of selection factors by employment status categories and documented that 20 years ago mothers who worked part-time (compared with nonemployed mothers) were more likely to be White, less likely to be Hispanic, had higher socioeconomic status, had fewer children, and were more likely to live in suburbia. These advantages may function to facilitate children's cognitive development and therefore must be taken into account in comparing part-time employed and nonemployed groups. In addition to addressing selection issues, future research needs to investigate interactions between part-time work hours and other social and demographic variables.\nChildren's socioemotional functioning. As with the broader maternal employment literature, research into part-time employment has examined children's cognitive outcomes more often than other child outcomes. We found only three studies that compared mothers' part-time employment to nonemployment with regard to children's socioemotional well-being. Controlling for selection effects, neither Hill, Waldfogel et al. (2005) nor Brooks-Gunn et al. (2010) found longitudinal group differences on children's behavior problems; Nomaguchi (2006) also found no differences on most child outcomes, with the exception that children with mothers employed part-time showed greater increases in prosocial behavior from age 2-4 than did children whose mothers were not employed, and when type of child care was controlled, they also showed decreased anxiety and hyperactivity (part-time was fewer than 30 hours per week). Thus, research has been scarce, but there is some evidence that part-time employment may be favored over nonemployment with regard to young children's socioemotional well-being.\nMothers' well-being. Surprisingly little research has been conducted that focuses on part-time employment and mothers' well-being.Coley, Lohman, Votruba-Drzal, Pittman, and ChaseLansdale (2007) examined 2,000 low-income, urban mothers at two points in time separated by about 16 months. They found that becoming employed, even as few as 20 hours per week, was associated with decreased depressive symptoms and increased self-esteem; they found no changes in maternal anxiety or perceived physical health. Extensive demographic controls were employed, but the moderating role of contextual factors was not examined. Brooks-Gunn et al. (2010) analyzed the effects of mothers' employment by child age 12 months using data from the National Institute of Child Health and Human Development's (NICHD) Study of Early Child Care (SECC) and found opposite results for employment during infancy. Controlling for background variables, depressive symptoms at 1 month, and subsequent employment, mothers employed part-time during their child's infancy reported higher depressive symptoms than did nonemployed mothers through first grade. This difference was present for European but not African American mothers.\nWhen studying work and family, an important aspect of mothers' psychological well-being is perception of work-family conflict. The outcome of work-to-family conflict is not relevant when comparing mothers employed part-time with mothers who are not employed. Hill, Mead et al. (2006) , however, examined work-family variables at the couple level in 3,097 two-parent families where one spouse was employed full-time; they found differences that favored part-time employment for the second parent. They labeled this arrangement the \"60-hour workweek.\" In couples with the 60-hour arrangement, the full-time (primarily men) and part-time (primarily women) employees reported better work-family fit and family satisfaction, as well as lower work-to-family and family-to-work conflict in comparison with couples in which one partner worked full-time and the other was not employed."}, {"section_title": "Parenting.", "text": "With regard to quality of parenting, Brooks-Gunn et al. (2010) found that mothers employed part-time during infancy had higher scores on observed sensitivity through first grade than did mothers who were not employed during infancy. This difference was present for European but not African American mothers. Nomaguchi (2006) found more positive motherchild interactions when mothers of preschoolers were not employed than when mothers were employed part-time (fewer than 30 hours per week) but no differences in time spent reading to children or time children spent watching television (Canadian National Longitudinal Survey of Children and Youth). In a study of New Zealand families of school-age children, Horwood and Fergusson (1999) found that mothers who were employed part-time (fewer than 20 hours per week) were rated as more responsive than mothers who were not employed. Similar findings have been reported for eighth-grade youths living in the United States. Using National Education Longitudinal Study data, Muller (1995) found that, compared with nonemployed mothers, mothers employed part-time (fewer than 35 hours per week) discussed school-related issues more often with children, checked homework more often, and had greater involvement in school activities. Youths living with nonemployed mothers were supervised more after school than youths living with mothers employed part-time.\nMarital functioning and family work. We were unable to find research conducted in the past 20 years that compared mothers employed part-time with nonemployed mothers on marital quality or marital stability, or any research conducted in the United States focusing on division of household labor. In an Israeli sample of 807 married or cohabitating parents, however, Stier and Lewin-Epstein (2000) found that mothers who were employed part-time (15-34 hours per week) contributed the same proportion of household work as did mothers who were not employed. Thus, mothers employed part-time continued to do the majority of the domestic work.\nSummary of part-time and not employed contrast. Beyond a focus on children's cognitive, intellectual, and academic well-being, little research comparing mothers' part-time employment with nonemployment has been conducted. Other outcomes for children, mothers, and families have been understudied. Few differences have been found for children's cognitive development, although there is some indication that mothers' part-time employment may be beneficial for children in single-parent families and when family incomes are low. The scant research suggests that part-time employment is more favorable than nonemployment in terms of children's socioemotional well-being and mothers' parenting, even controlling for extensive maternal and child characteristics. Few investigators, however, have examined demographic factors as moderators, which makes it difficult to draw conclusions regarding the conditions under which part-time employment by mothers is linked to more positive or negative outcomes than not being employed. Furthermore, and consistent with other aspects of work and family research (Bianchi & Milkie, 2010) , much of the literature has focused on families with young children, where the type and quality of child care may confound the interpretation of findings. Finally, with three exceptions (Hill, Mead et al., 2006; Nomaguchi, 2006; Stier & Lewin-Epstein, 2000) , these studies have not considered fathers' work hours in their analyses of mothers' work hours, and future studies of two-parent households need to consider this important variable."}, {"section_title": "Mothers' Part-Time Employment Compared With Full-Time Employment", "text": "As Goldberg et al. (2008) noted, and as we confirmed in our review, little research has compared part-time and full-time employment. Many researchers have considered employment a dichotomous variable, comparing employment of any type with not being employed. As such, the \"lost\" contrast has been between part-time and full-time employment.\nChildren's well-being. As in the previous section, we organize the review of part-time and fulltime employment by first examining children's cognitive and intellectual functioning and then children's socioemotional functioning.\nChildren's cognitive and intellectual functioning. In a meta-analysis of 15 studies, Goldberg et al. (2008) reported higher cognitive functioning, in terms of achievement tests, grades, and formal tests of intellectual ability, in children whose mothers were employed part-time rather than full-time. Burchinal and Clarke-Stewart's (2007) study using the NICHD SECCYD data, which was not included in the Goldberg et al. (2008) meta-analysis, controlled for several demographic, maternal, and child characteristics and found no group differences on cognitive and language measures at ages 36 and 54 months or in first grade. Also using these data, but focusing only on employment during the child's first year, Brooks-Gunn et al. (2010) found that cognitive outcomes were better for children with European American mothers employed parttime rather than full-time through first grade. They employed extensive controls for background and maternal characteristics, as well as subsequent employment.\nChildren's socioemotional functioning. We found only two studies that compared mothers' part-time and full-time employment with regard to children's socioemotional well-being. Using the subsample of 572 European American families in the NLSY data set, Baydar and BrooksGunn (1991) found no differences between part-time (fewer than 20 hours per week) and fulltime employment on preschool-age children's behavior problems. Possible moderating effects of contextual variables were not examined. Using the NICHD SECCYD data, Brooks-Gunn et al. (2010) also found no differences on child externalizing problems across part-time and full-time employment.\nMothers' well-being. Few studies have examined the well-being of mothers employed part-time and full-time. Conway and Briner (2002) found that part-time (participant-designated) U.S. bank employees (84% women) had higher levels of positive affect than did full-time employees. Using data from 3,500 employed women in the British Household Panel Survey, however, Warren (2004) found no differences in general life satisfaction between part-time (fewer than 31 hours per week) and full-time employed women. Similarly, in a series of studies of female physicians, Barnett and colleagues found no part-time (fewer than 40 hours per week) versus full-time differences in psychological distress (Barnett & Gareis, 2000; . Using the NICHD SECCYD data, Brooks-Gunn et al. (2010) found no differences between mothers employed part-time and full-time during infancy on mothers' depressive symptoms through the child's first grade. In their study of 6,721 Canadian mothers, Higgins et al. (2000) found no differences between part-time and full-time employed mothers for perceived stress and depressed mood, but they found that mothers employed part-time had higher life satisfaction than did mothers employed full-time. They tested for interactions between work-hour category and career versus earner orientation and found no significant interactions.\nResearch on the work-family interface generally has indicated that mothers employed part-time have reported less work-family conflict and interference than have mothers employed full-time Higgins et al., 2000; Hill, Martinson et al., 2004; van Rijswijk, Rutte, & Bekker, 2004) . A similar pattern of lower work-to-family conflict for part-time versus full-time employment has been found when examining couple-level total work hours (Hill, Mead et al., 2006) . It is important to note that these studies of work-to-family conflict have included primarily mothers in professional occupations, and most were married. Part-time was defined in one of the studies as fewer than 41 hours and as fewer than 32 hours in the other two. Also, we located no studies that examined the crossover effects of mothers' part-time employment hours on fathers' psychological well-being or perceived work-to-family conflict.\nParenting. In an examination of 417 single mothers with preschoolers in the NLSY, Lleras (2008) found the quality of parenting varied nonlinearly with employment hours. Mothers who were employed between 21 and 35 hours per week scored lower on an index of parenting quality than did those employed fewer than 21 hours per week or full-time. In follow-up analyses, the author suggested that lower wage rates and job satisfaction played a role in this finding. Using data from the NICHD-SECCYD, Brooks-Gunn et al. (2010) found that mothers employed parttime during infancy had higher observed sensitivity scores through the child's first grade than did mothers employed full-time. Using the NELS data, Muller (1995) found that mothers employed part-time (fewer than 35 hours per week) scored higher than those employed full-time on schoolrelated communication with their eighth-grade children, checking homework, television monitoring and restrictions, after-school supervision, school involvement, and knowledge of children's friends' parents."}, {"section_title": "Marital functioning and family work.", "text": "Research on marital functioning related to part-time employment is sparse. Analyzing data from married female physicians, Barnett and Gareis (2002) found that mothers who were employed part-time (fewer than 40 hours per week) were less satisfied with their marriages than were mothers employed full-time. Mediational analyses suggested that the differences were due, in part, to part-time workers' lower income, higher interference between work and family roles, and lower satisfaction with the division of household work.\nWe found only three studies that examined the division of household labor in families where mothers were employed part-time rather than full-time Hill, Mead et al., 2006; Stier & Lewin-Epstein, 2000) . In each case, regardless of the operational definitions, mothers employed part-time engaged in a greater share of the household work than did mothers employed full-time. None of the studies analyzed data from a large group of U.S. mothers from diverse demographic backgrounds, and none examined potential moderators."}, {"section_title": "Summary of part-time and full-time contrast.", "text": "Largely because of the ways that employment has been conceptualized and measured, as either employed versus nonemployed or as a linear function examining continuous work hours, little research has directly compared child and family outcomes when mothers work part-time versus full-time. Given the sparse research, it is difficult to make conclusions. It appears that findings for the part-time and full-time contrast vary by the outcome examined. Children's cognitive functioning was better when mothers were employed part-time than full-time, and this pattern also characterized children's socioemotional well-being, although fewer significant group differences were evident. The findings on mothers' well-being and parenting have been inconsistent. No group differences have been found for psychological and physical well-being, but mothers employed part-time have reported lower levels of work-family conflict and interference. Research on parenting has been scarce and the few differences that have been found have favored part-time employment for married mothers. Finally, differences found in marital functioning and the division of family work have favored mothers who are employed full-time. Much of the literature comparing part-time with full-time employment on maternal and family outcomes has included only advantaged professional families, leaving a large gap in our understanding of mothers' part-time work. With the exception of the study by Stier and Lewis-Epstein (2000) , none of the studies reviewed in this section included measures of fathers' work hours, which has further increased the gap in our understanding of how families use part-time employment during their lives and its effects on various outcomes."}, {"section_title": "Major Trends and Issues", "text": "Several trends and issues are evident in the contemporary literature on mothers' part-time employment. We highlight those which we believe are central to forwarding research that will help families make informed decisions, including the importance of focusing on part-time work as a distinct work arrangement, greater depth in theorizing, use of improved methodology, and the examination of salient moderators that may condition key findings."}, {"section_title": "Part-Time as a Distinct Work Arrangement", "text": "Consistent with some scholars who have studied maternal employment (e.g., Duffy & Pupo, 1992; Maynard et al., 2006) , we believe it is important to emphasize part-time employment as a distinct work arrangement. Family members and employers conceive of it as a distinct work status, thus shaping expectations, benefits, and stressors. The sparse literature on mothers' use of part-time employment has uncovered more significant associations than are typically found when work hours are measured using a continuous measures. Our belief in the distinctive nature of part-time work also is influenced by the ecological life-course theoretical perspective. The context of part-time work differs from the contexts of both full-time work and nonemployment, forming niches that vary on central social, economic, psychological, and familial factors. In addition, changes in employment status across the life course are better understood when nonemployment, part-time, and full-time work histories are considered (Sweet & Moen, 2006) .\nResearchers have identified reasons mothers work part-time, with a general finding that mothers often work less than full-time to allow time for family caregiving (Abramson, 2007) . In lowincome families or when the mother is the sole wage earner in the family, part-time employment typically is undesirable and may lead to higher levels of distress than full-time employment (Shaefer, 2009; Thorsteinson, 2003) . These various situations suggest the need to examine a range of demographic and attitudinal characteristics that are involved in women's choices (albeit often constrained choices) to be employed at all and to be employed full-time or part-time at various times during their lives. As researchers continue to investigate mothers' use of part-time employment, we believe it is important to examine carefully familial and community constraints in addition to structural constraints in the employment sector (Correll et al., 2007; Tomlinson, 2006; Webber & Williams, 2008a ). Women's personal, family, and structural situations play a role in their selection of employment, and importantly, these demographic, individual, and family factors may condition the interpretation of relations between employment status and child and family outcomes (Bianchi & Milkie, 2010) ."}, {"section_title": "Theoretical Issues", "text": "Our review of the theoretical literature that has addressed mothers' part-time employment supports the assertion that a wide range of theories has been used to study work-family issues . Many of these theories have been used to examine specific topics from a perspective that either implicitly or explicitly views part-time employment as an adaptive or detrimental strategy for addressing personal and family needs. Mothers' employment decisions seem to be a product of an intersection of (a) mothers' work preparation, history, and experiences; (b) maternal preferences; (c) partner preferences; (d) family needs, demands, and expectations; (e) family members' gender-role attitudes; and (f) the structural characteristics of employment and cultural contexts. The relative weight of these factors is unknown. As researchers continue to investigate this context of constrained choice, we believe it is important to examine carefully familial and community constraints in addition to structural constraints in the employment sector (Correll et al., 2007; Tomlinson, 2006; Webber & Williams, 2008a) . For example, some mothers with high family demands likely believe that working part-time is their preference, whereas others believe that they are working part-time because full-time employment is not a realistic alternative from which to choose. This difference in perceptions might interact with work hours to differentially affect various child, maternal, and family outcomes.\nThere also is evidence that a paradigmatic lens of part-time work as either detrimental or adaptive is too narrow. For certain important outcomes, such as lifetime earnings and the division of family labor between couples, there is evidence that part-time work may be deleterious (Budig & England, 2001 ). Use of this paradigm also has narrowed theoretical discourse by not addressing in any detail comparisons between part-time work and nonemployment. For other important outcomes, such as work-family conflict and involvement in children's learning, there is evidence that part-time work may be adaptive. Rather than limit the investigation of part-time work to theories that favor one paradigm over the other, we think the field will be strengthened by using theory to build models that test the conditions under which part-time work either improves or compromises various outcomes over time. Testing these models will help refine and integrate existing theories suggesting reasons for and effects of mothers' part-time employment. We believe that this theoretical integration of reasons for employment and outcomes of employment is critical for furthering meaningful research on mothers' part-time work.\nAlthough we see strengths and limitations of the various theoretical perspectives that have been used to examine mothers' part-time employment, we believe that a focus on a life-course, ecological orientation is particularly useful for framing research on mothers' part-time employment. The life-course orientation addresses the dynamic and fluid nature of the workfamily interface across time, as well as the importance of resources, values, linked lives, and constraints in family decision making (Bubolz & Sontag, 1993; Sweet & Moen, 2006) . In addition, the ecological approach highlights the intersections of family, work, social class, race, and gender ideology and recognizes the importance of variation based on individual, family, and societal factors (Perry-Jenkins & MacDermid, in press; Prowse, 2005) . As such, a life-course ecological orientation is well suited for understanding the effects of mothers' part-time employment on child, parent, and family well-being, because it highlights the importance of looking at contextualized, linked, historically situated patterns of employment and well-being over time."}, {"section_title": "Methodological Issues", "text": "As with the broader literature on work and family (Bianchi & Milkie, 2010) , the literature on mothers' part-time employment also will be strengthened by the use of contemporary innovations in research methodology. Some of the studies reviewed here used large data sets that had large (and sometimes representative) samples. Many of these investigators tested their hypotheses using extensive controls for relevant demographic, child, and maternal characteristics. This has accounted for potential confounds, which is important, but also has the effect of adjusting findings for important moderating factors rather than focusing on how the conditionalizing variables may contribute to our understanding of part-time work. As such, many investigators have not fully capitalized on the large, heterogeneous samples they used to identify factors that make part-time work more or less beneficial for particular mothers and families.\nSome researchers have begun to incorporate the investigation of selection effects into their designs and analyses (Budig & England, 2001; Hill, Waldfogel et al., 2005) . This is important because the research suggests that mothers with particular demographic, familial, and psychological characteristics are more likely to work part-time (Barnett & Gareis, 2000; Muller, 1995) . It is particularly noteworthy that, as a general rule, women who choose part-time employment tend to be more advantaged economically and educationally than other women (Berger, Brooks-Gunn, Paxson, & Waldfogel, 2008) . These characteristics are highly likely to be linked to child and family functioning regardless of mothers' employment hours. Those investigators who have examined selection factors have typically limited their scope to demographics and prior employment history, but attitudinal factors, particularly those involving both mothers' and fathers' beliefs about work and family and ideas about gender roles, are likely to be instrumental in employment decisions as well (McGroder, Zaslow, Papillo, Ahluwalia, & Brooks, 2005) .\nThe current literature has included both between-group and within-group research designs, and both are needed to further the understanding of part-time employment among mothers. Betweengroup designs have compared mothers across different work-hour categories. Because of the inclusion of part-time employment as a category, these studies have added greatly to an earlier literature that often just compared employed mothers with those who were not employed. This previous approach to the study of maternal employment may have arisen during the 1960s and 1970s when it was relatively uncommon for U.S. women to return to the workplace after childbirth (Jacobs & Gerson, 2004) . Today, however, when a majority of mothers are employed, such comparisons seem uninformative. Our review also demonstrates that the between-group designs that have included the three work-status arrangements (i.e., not employed, part-time, and full-time) have shown differential results when contrasting nonemployed mothers with those who are employed part-time and those who are employed full-time. These are two very different comparisons.\nWithin-group designs have examined variability among mothers employed part-time both crosssectionally and over time. These studies have been important because of their contribution to our understanding of part-time work as a qualitatively distinct work arrangement (Caputo & Cianni, 2001 ). These studies also have sensitized researchers to potentially important variation within part-timers, differentiating levels of part-time work (Walters, 2005) as well as varying motivations and circumstances (Martin & Sinclair, 2007; Maynard et al., 2006) .\nMost of the quantitative studies we reviewed used ordinary least squares regression to analyze the relationship between maternal work hours (operationalized categorically) and various outcomes. Given the importance of bringing social, economic, and personal context into these analyses, it will be important for researchers to include in their designs factors that help explain varying relations between part-time employment and outcomes at different points in the family life course, as well as differences between groups of mothers. Multilevel modeling is likely to be a useful approach to the examination of variation within and between families and the role of moderating factors within and across levels of analysis (Wharton & Blair-Loy, 2002) . Growth mixture modeling also could be used to examine patterned variation among mothers employed part-time (Hynes & Clarkberg, 2005) ."}, {"section_title": "Highlighting Context", "text": "As documented throughout this review, few investigators to date have included interactions between part-time work and key potential moderators. We believe the inclusion of moderators is critical in the research on mothers' part-time employment. At a minimum, four types of moderators should be examined in greater depth: selection factors, demographic factors, mothers' (and partners') employment attitudes, and mothers' (and partners') familial attitudes. Selection factors that are likely to be important include prebirth employment, prebirth beliefs and identity salience regarding mothers' care of children and paid work, ethnicity, maternal education, socioeconomic status, local employment opportunities, and mothers' prebirth psychological and physical well-being (Caputo & Cianni, 2001; Goodman, Crouter, & Family Life Project Key Investigators, 2009; Hill, Waldfogel et al., 2005; Lleras, 2008; Muller, 1995; Prowse, 2005; Webber & Williams, 2008b) . These factors also might interact with work status histories to affect outcomes (Perry-Jenkins & MacDermid, in press; Sweet & Moen, 2006) .\nAs with the general literature on maternal work hours and family well-being (Dearing, McCartney, & Taylor, 2006; , it is critical that the intersection of various indicators of social location and mothers' part-time work be studied in greater depth (Budig & England, 2001) . Much prior work has focused on relatively advantaged samples or has statistically controlled for demographic factors rather than examining them. As a result, little is known about how the association between mothers' part-time employment and various indicators of child, parental, and familial well-being vary across levels of income, education, occupational status, race and ethnicity, or family structure. A better understanding of how social location intersects with work hours is an essential focus for future research on mothers' part-time employment.\nBeyond selection and demographic factors, it is important to consider the interaction between part-time status and mothers' beliefs about familial gender roles and children's care, as well as their beliefs regarding various aspects of paid work. As Perry- Jenkins and Gilman (2000) noted, these attitudinal characteristics are a central ingredient in how family members experience their environments (Bronfenbrenner, 1986) . Although studied rarely, part-time work hours might interact in important ways with mothers' beliefs regarding women's and men's roles in child care and housework (Barnett, 2004; Duffy & Pupo, 1992) ; with mothers' beliefs about nonfamilial child care (Bianchi & Milkie, 2010) ; and with mothers' desired work hours or schedule, their actual schedules (e.g., nonstandard hours), and their desire for jobs that are flexible, interesting, and offer some autonomy (Keil, Armstrong-Stassen, Cameron, & Horsburgh, 2000; McDonald et al., 2006; Stone & Lovejoy, 2004) ."}, {"section_title": "Conclusion", "text": "This review of the literature on mothers' part-time employment and its relation to child, parent, and family outcomes indicates clear gaps in our knowledge of the extent to which working parttime is an adaptive strategy for families during the child-rearing years or a form of exploitation that maintains women's second-class status and reduces well-being in the long run. Substantial numbers of women in the United States, especially those with children at home, report they prefer to work part-time, yet the nature of many part-time jobs makes them unrewarding both economically and psychologically. Future research into the outcomes for mothers, children, and families when mothers work part-time needs to consider the part-time status in comparison both to full-time work and to not working outside the home and to incorporate both individual and contextual moderating factors that condition the relation between part-time work and outcomes."}]