[{"section_title": "Introduction to Special Issue of PRIMUS on Improving the Teaching and Learning of Calculus David Bressoud and Paul Zorn", "text": "Calculus courses are increasingly problematic in our colleges and universities. The strongest students no longer study single-variable calculus in college. Exploding enrollments in the sciences and engineering bring less well-prepared students into these courses. Budget cuts force larger classes. And the greater accountability of public universities to those who fund them implies that high rates of D, F, or Withdraw (DFW), which might have been unremarkable 20 years ago, are no longer acceptable. All these factors have led to a great search for answers. Two-thirds of our departments of mathematics have recently implemented changes, are now implementing changes, or plan to change strategies for student placement within the precalculus through single-variable calculus sequence. There is a great deal of experimentation across the board. The MAA's Progress through Calculus study [1] has discovered that among Ph.D.-granting mathematics departments, 40% describe the use of active learning in the calculus classroom as \"very important,\" and 35% are experimenting with at least some sections taught with active learning approaches. The presidents of the member societies of the Conference Board of the Mathematical Sciences, including AMS, MAA, and SIAM, have endorsed a statement [3] calling for the incorporation of effective active learning in all post-secondary mathematics instruction. Departments across the country yearn for clear direction on how to incorporate active learning into their courses at all levels. This volume gives voice to a small selection of the efforts now happening across the country, many of which have picked up and built upon the seven characteristics of successful programs in college calculus identified in the MAA Notes volume edited by Bressoud, Mesa, and Rasmussen in 2015 [2]. We begin with one of the oldest and most successful efforts at improving calculus, the calculus program at the University of Michigan. Having achieved and documented great success for a quarter of a century, the Michigan program is a leading example of what can be accomplished. The team that now runs this program offers a view into its inner workings. Our second article has an analytical flavor, crunching data from the US Department of Education's High School Longitudinal Study, which began in 2009 to follow students who were then entering the ninth grade. Authors Joe Champion and Vilma Mesa present disturbing evidence that by the time students enter the ninth grade, their mathematical knowledge, course placement, socio-economic status, and ethnicity almost completely predict whether they will complete a calculus course before graduation from high school. The next four papers describe a variety of recent department-wide efforts to improve the teaching and learning of calculus, at San Diego State University, the University of Illinois-Chicago, Colorado State University, and the University of Hartford. At each institution, changes have occurred on multiple fronts, including greater collaboration among faculty instructors, better preparation of graduate teaching assistants, and a variety of approaches to the introduction of active learning. Though each intervention is distinctive, all share a recognition that high DFW rates are not acceptable, that what has been done is no longer working, and that sustained improvement requires multiple changes and strong departmental support. The next paper, \"Resequencing Calculus,\" describes a curricular innovation: the inclusion of topics from several-variable calculus into Calculus 2. Although this is not a new idea, the work of Axtell and collaborators represents the first real attempt to bring this to scale, and the article includes evidence of the effectiveness of this approach. The last two papers describe efforts to boost active learning. \"Calculus Students Flipped Out\" chronicles an experiment with a flipped class and documents clear gains by the students. In \"Calculus Challenges,\" we see how Jacksonville University has used discovery learning, writing, and judicious use of technology to engage their calculus students. Collectively, these nine papers sample some of the activity surrounding calculus instruction today. The present challenge is to work on a departmental level, operating on multiple fronts to address the many ways in which calculus instruction and student support can be improved."}, {"section_title": "ORCID", "text": "Paul Zorn http://orcid.org/0000-0002-2477-8058"}]