[{"section_title": "Introduction", "text": "Evaluation is an essential part of the educational process and an integral part of it. It is a means by which we can know the extent to which the objectives have been achieved, and the extent to which the results are consistent with the effort of the individuals at different levels with target potential. Through evaluation, the positive and negative aspects of the educational process can be identified and diagnosed as weaknesses and deficiencies in order to take appropriate decisions and actions. Due to its importance in the educational process, educators have been interested in it and defined it multiple definitions (Affana, 2011: 22) .\nThe modern concept of educational evaluation has evolved in recent years due to the emergence of a new philosophy in education that calls for the responsibility of the educator not only for the development of concepts, skills and habits only, but also to stimulate the growth of the student in various fields such as: attitudes, tendencies, ability to think and personal and social compatibility (Abu Allam, 2014: 45) .\nAfter centuries of traditional evaluation, it focused on highlighting individual differences among students and encouraging them to compete for advanced positions among their peers, without knowing what these students have and what they can do. This is only a measure of the information the students possessed and their ability to recall them. This is not consistent with the aspirations and future aspirations of education in light of the rapid developments, the explosion of knowledge and the communications revolution. Therefore, it became necessary to shift from traditional testing methods to strategies of development to develop an integrated and balanced personality of the student (Muhaidat & Al -Mahasnah, 2009: 9) .\nThe criticism of the traditional evaluation has contributed to the emergence of a type of evaluation known as the alternative evaluation that focuses on performance evaluation. Perhaps the focus on performance evaluation was based on a new vision of knowledge, as knowledge is constructive form that the student participates in acquiring through active and productive participation and not just choosing the right answer from a group of artificial alternatives given (Allam, 2004: 20) . Therefore, the alternative evaluation was accompanied by drastic shifts in the philosophy of the educational evaluation, which caused a shift from the policy of tests to the policy of multiple evaluation, and from the tests of cognitive abilities to the evaluation of multiple abilities, and from a separate evaluation to an integrated evaluation, and from evaluation aimed at achieving efficiency to an evaluation aimed at achieving quality and excellence, and from a final evaluation to a permanent evaluation by all concerned and from attention to the overall degree to attention to details of performance (Salam, 2015) . These transformations were based on the main pillars of contemporary developments in cognitive psychology, and information technology, as well as the resulting new intellectual perceptions of theories of human learning, and the concept of intelligence and achievement and what contributed to the change of views (Allam, 2004: 34) .\nThe alternative evaluation focused on the direct experiences related to the reality of the student and his daily life. It also focused on deep understanding and careful investigation and the ability of the student to build a sense of what he learned and build knowledge himself, as well as his ability to apply what he learned to solve his daily problems and to make appropriate decision on the issues facing him (Sabri & Rafii, 2008: 256) .\nThus the alternative evaluation is distinguished by the fact that it offers a multi-dimensional and multifaceted images unlike the traditional evaluation. This necessitated the multiplicity of alternative evaluation strategies depending on the different tasks to be evaluated. A number of specialized educational literature have pointed out that the most important alternative evaluation strategies are: rules of performance assessment, achievement files, self -assessment, peer evaluation, observation, writing tests, concept maps and project method (National Evaluation Team, 2004: 99) .\nIn this sense, the use of alternative evaluation strategies by mathematics teachers makes the evaluation a real, realistic and human process, giving a multi -dimensional evaluation, thus providing a more accurate picture of students' achievement and over all development. This is consistent with the assumption that knowledge can be created and constructed by the student, as well as to fit with the modern global orientation after what has been the transition from behavioral where the linear learning and objectives associated with a clear and specific behavior to cognitive which emphasizes what is happening within the mind of the student."}, {"section_title": "Study Problem and Questions", "text": "The last years of the twentieth century witnessed a growing awareness of the need to develop evaluation strategies and criticized both traditional tests and classroom evaluation practices globally. Studies have pointed to the serious deficiencies in student evaluation strategies. Complaints about the negative effects of the prevailing concept in the educational circles of evaluation with its narrow and closed perspective, which is synonymous with traditional exams and routine testing processes, and the resulting grades not often reflect the reality of the educational process, and it is not useful in monitoring students' academic progress and following up their development, thus leading to the rigidity of the educational process and impeding the development of educational work (Allam, 2004: 3) .\nThe results of the test \"Trends in International Mathematics and Science Study\" in 2015 showed a decline in the average performance of elementary students in Saudi Arabia in mathematics compared to the results of the same test of the year 2011. This may require a comprehensive review of the curriculum with all its components, the most important of which are the evaluation strategies used in the evaluation of students (Center of Excellence for Research in the Development of Teaching Science and Mathematics, 2016).\nThe American Association argued that any attempt at educational reform should include reforming students' evaluation as a main objective in the educational reform process (Adly, 2010: 2) .\nA survey of the opinions of some mathematics teachers conducted by the researchers on the importance of using alternative evaluation strategies in teaching mathematics showed that their reactions are very different on the importance of multiple evaluation strategies. Some believe it is simply an increase in the teacher's teaching load and the student's workload, and some of them see futility. Others try to apply different evaluation strategies, and see them as useful in teaching mathematics and contribute to improving the level of students and increase their achievement.\nBased on these reasons and justifications, the problem of the study was determined in an attempt to reveal the degree of practicing alternative evaluation strategies by mathematics teachers, through answering the following main question:\nWhat is the degree of practicing alternative evaluation strategies by mathematics teachers in elementary stage in Hail city? mas.ccsenet.org Modern Applied Science Vol. 14, No. 1; 2020 Branching from the main question, the following two questions:\n(1) What is the degree of practicing alternative evaluation strategies by mathematics teachers in elementary stage?\n(2) Are there any significant differences in the degree of practicing alternative evaluation strategies by mathematics teachers in elementary stage attributed to experience and training courses in alternative evaluation?"}, {"section_title": "Objectives of the Study", "text": "The study sought to achieve the following two objectives:\n(1) Determining the degree of practicing alternative evaluation strategies by mathematics teachers in elementary stage.\n(2) Finding out the significance of differences in the degree of practicing alternative evaluation strategies by teachers of mathematics in elementary stage."}, {"section_title": "Importance of the Study", "text": "The importance of the study was as follows:\n-Mathematics teachers at the elementary stage may benefit in improving their evaluative abilities and performance in light of alternative evaluation.\n-The study may benefit researchers in the field of alternative evaluation, where it provides a list of some alternative evaluation strategies in the elementary stage.\n-The study may help parents and students to identify alternative evaluation strategies.\n-This study may help reveal the training needs of elementary mathematics teachers in light of alternative evaluation strategies.\n-The results of this study may contribute to the attention of educational supervisors of the importance of alternative evaluation in the educational process."}, {"section_title": "Hypotheses of the Study", "text": "The study sought to verify the following two hypotheses:\n-There were no significant differences in the degree of practicing alternative evaluation strategies by mathematics teachers in elementary stage due to experience variable.\n-There were no significant differences in the degree of practicing alternative evaluation strategies by mathematics teachers in elementary stage attributed to the variable of training courses in alternative evaluation."}, {"section_title": "Limitations of the Study", "text": "The results of this study were determined within the following limits:\n-Objectivity limits: This study was limited to the following alternative evaluation strategies: observational evaluation, evaluation based on communication, performance based evaluation, evaluation using achievement file, self-evaluation, peer evaluation, and evaluation by paper and pen.\n-Temporal limits: This study was applied during the first semester of the academic year 2017/2018.\n-Spatial limits: This study was limited to public elementary schools in Hail city.\n-Human limits: This study was limited to a sample of elementary school mathematics teachers in Hail city."}, {"section_title": "Delimitations of the Study", "text": "-Alternative evaluation: It is a multi-dimensional evaluation of a wide range of abilities and skills. It includes a variety of nontraditional methods that focus on employing knowledge and requires performing certain tasks related to real life and meaningful for the student.\n-Alternative evaluation strategies: They are a set of methods and tools that evaluate the learner in a context similar to real life situations and take into account the modern trends in the evaluation, where integrated with teaching process to reflect the performance of the student and measure it in life situations and seeks to achieve a variety of results related to the course, including: Observational evaluation strategy, Communication -based evaluation strategy, performance -based evaluation strategy, evaluation strategy using achievement file, self-evaluation strategy, peer evaluation strategy, and the paper and pen evaluation strategy.\n-The degree of practice of mathematics teachers: It is defined operationally as: Responses of mathematics teachers during their teaching on observation card items."}, {"section_title": "Theoretical Framework and Previous Studies", "text": ""}, {"section_title": "First: Theoretical framework", "text": "The educational evaluation witnessed rapid developments and radical changes in the methodologies of measurement and evaluation, and a qualitative leap in its various strategies and techniques. These comprehensive educational changes have contributed to significant changes in the educational system. The voices of teachers and specialists have reconsidered the traditional practices that show their limitations in evaluating programs and curricula, performance evaluation and their lack of usefulness in accurate diagnosis of their achievements and competencies (Majeed, 2011: 9) .\nAs a result of all this, new approaches and trends have emerged in the field of educational evaluation through which measurement and evaluation scientists have tried to devise new types of educational evaluation that will be useful alternative to the traditional evaluation which focuses on simple cognitive aspects measured by limited types of theoretical questions, which rely mostly on paper and pen, and make the measurement of achievement at the lowest levels (Hashem, 2006: 264) .\nFrom these trends alternative evaluation emerged as a new orientation in educational thought and a fundamental shift in the prevailing traditional practices in measuring and evaluating students' achievement and performance in different educational stages (Allam, 2004: 13) .\nThe concept of alternative evaluation is that knowledge is built by the student and not by the teacher, and the role of the teacher is the role of mentor and facilitator more than the role of initiator. Thus, the main objective is to provide an integrated picture of the student, including the knowledge and skills and the ability to employ what he learned in practical situations, using a range of alternatives that measure the real performance of the student (Al -Shukairat, 2014: 27)."}, {"section_title": "Importance of the Alternative Evaluation", "text": "The importance of the alternative evaluation lies in many respects. Tsagari (2004) summarized them in the following points:\n1. Changing the role of students in the evaluation process. They have become active participants engaged in activities that reveal what they can do rather than highlight their weaknesses. This reduces anxiety and increases their self -esteem.\n2. Providing valuable tasks in everyday life that challenge students' abilities to ask questions, make decisions and seek possibilities and alternatives.\n3. Taking into account individual differences among students, whatever their work and mental abilities.\n4. Create new tools for teachers to help students take responsibility for their own learning and self-assessment."}, {"section_title": "5.", "text": "Give parents positive roles in the evaluation process, by providing meaningful information at the student level, and encourage parents to look beyond the results of tests and grading reports in the evaluation of their children performance and their achievement."}, {"section_title": "Alternative Evaluation Strategies", "text": "In the present study, the following alternative evaluation strategies were discussed:"}, {"section_title": "Observational evaluation strategy:", "text": "This strategy is a kind of qualitative evaluation in which the behavior of students is recorded in order to identify their tendencies, desires, interests and interaction with each other, to get feedback that is useful in judging their performance, as well as evaluate their skills, values and the way they think (Lanting, 2000) .\nThe observation is divided into two main types: a. Simple observation: Observing students' behavior and actions as they occur automatically in real situations.\nb. Structured observation: Observing the behavior of the students and their actions in a planned manner in advance and determine the conditions of observation such as time, place and the criteria for each performance.\nTeachers' awareness of the observation strategy helps them to obtain a range of qualitative information that provides them with a high degree of confidence in decision -making and inclusiveness in evaluating educational out comes. In addition, the strategy is highly flexible and enables teachers to adapt it to different educational outcomes (National Evaluation Team, 2004; Adams & Hsu, 1998 ).\n2. Communication -based evaluation strategy: An active and organized collaborative process by which information is collected on the extent of learning achieved by the student. One of its most important features is that it reveals the nature of the student's thinking and his method of solving problems and enhances his ability to review himself and thus improves his performance later (Al -Sharaa, 2011: 25) .\nWithin this strategy are several types (Al -Abssi, 2010: 51):\na. Interview: A predetermined meeting between the student and the teacher in which the teacher gets information related to the student's ideas through questions prepared by the teacher.\nb. Questions and answers: Direct questions from the teacher are not prepared in advance and the student answers to know the progress and gather information about the nature of his thinking and his method of solving problems.\n3. Performance -based evaluation strategy: In this strategy, students are required to demonstrate their learning by using their knowledge and skills in real life situations, or conduct research related to the subject of the course, or perform some practical tests, or conducting practical activities, presentations, or practical performances through which he shows his mastery of his skills. Many activities fall under this strategy including: project, simulation, role -playing talk, debate, oral presentations, exhibitions and practical experiences (Muhaidat & Al -Mahasnah, 2009 ).\n4. Evaluation strategy using achievement file: It is a selection of the work of the student depends mainly on his performance. The file includes the strengths of his work as the student chooses the best work such as a report or project and put it in the file. It also includes some work in progress that shows improvement in performance over time. This type shows the student's progress and learning through the course. The file is the student's work group in a period of time -a school year or semester -can be used for evaluation by teacher or student. It may include writings, projects, audio tapes, computer disks and other tasks (Al -Shahri, 2012: 36).\nThe student contributes to the selection of the content of the file, the instructions followed in the test, standards for judging the work and evidence that refers to the student's self -reflections. 5. Self -evaluation strategy: Self -evaluation is an essential component of independent learning for student and increases his/ her motivation and self -esteem. It draws more attention to what he performs and how he performs, thereby developing constructive thinking and problem -solving skills and helping him to diagnose strengths and weaknesses, identify needs and evaluate attitudes.\nAl -Marhabi (2013) believed that self -evaluation is an effective means of learning and evaluation that develops students with higher thinking skills through review, thinking and self -reflection of their work and make appropriate decision using various self -measuring tools including levels and criteria that students are involved in their identification.\n6. Peer evaluation strategy: The concept of peer evaluation is closely related to self -evaluation and is based on a new perspective in evaluation that allows students to work together in evaluating their work among themselves. This makes them a positive role in their learning and evaluation of their own work. It encourages them to take responsibility and also helps to know the characteristics of good works they are evaluating. The patterns of human relations and the context in which evaluation takes place play a major role in the success of this type of evaluation (Allam, 2004: 225) .\n7. The paper and pen evaluation strategy: This strategy is the most common and used in the school and is a way to determine the level of students through their answers to a set of questions that represent the content of the subject. It is characterized by its ease and effectiveness in case of validity, reliability and objectivity. Its importance lies in its knowledge of the strengths and weaknesses in the performance, and measure their level of achievement and progress, which provides teacher and parent with feedback on their performance.\nTests of all kinds are the basis of this strategy, including the tools that enable the teacher to measure the performance of the students and their skills in specific fields that show their possession of the mental and performance skills included in the educational outcomes of the content of the learning that they have learned previously."}, {"section_title": "Second: Previous Studies", "text": "This part deals with previous studies related to alternative evaluation and strategies:\nThe study conducted by Watt (2005) aimed at revealing the attitudes of mathematics teachers toward the use of alternative evaluation in teaching mathematics at the secondary stage, and determining the alternative evolutional practices that applied in the classrooms. The study sample consisted of (60) mathematics teachers in Sydney. To achieve the objectives of the study, the descriptive -survey methodology was used. The study found positive attitudes among mathematics teachers toward using achievement tests as appropriate measures to measure the achievement of secondary school students. Teachers also revealed that they did not prefer to use alternative evaluation strategies in teaching mathematics.\nWikstrom (2007) conducted a study aimed at finding the degree of practicing alternative evaluation styles by mathematics teachers in evaluating teaching process, and their attitudes toward their uses. The sample of the study consisted of (16) basic education teachers. The questionnaire was used as a tool to collect data. The study showed that (14) teachers used alternative evaluation strategies such as: classroom discussions, individual and collective projects, evaluation, and illustrative presentation, with positive attitudes. While some relied on traditional forms of evaluation such as achievement tests.\nAl-Budoor (2010) study aimed at identifying the degree of practicing real evaluation by mathematics teachers and its relation to mastering students' learning and their ability to solve mathematical problems and their attitudes toward mathematics in Jordan. The study sample consisted of (99) teachers teaching mathematics. The descriptive methodology was used. To achieve the objectives of the study, five measuring tools were designed: a questionnaire of the degree of practicing real evaluation by mathematics teachers, a questionnaire of students' attitudes toward mathematics, a questionnaire of students' abilities on problem solving, a test of students' proficiency in mathematics, a classroom observation tool, and an individual interview and document analysis.\nThe results of the study showed that the degree of practicing real evaluation by mathematic teachers was high.\nThe study of Adediwura (2012) aimed at identifying the impact of peer and self -evaluation on improving the effectiveness of self and autonomy of students in learning mathematics. The study sample included (60) male and female secondary school students in Nigeria. A quasi -experimental research methodology was used. The scale of study habits and autonomy in learning mathematics was used to collect data, and the evaluation of the emotional and social outcomes of study programs scale was used also to measure the self -efficacy of students.\nThe results showed that peer and self -evaluation contribute to enhancing students' sense of self -efficacy and improving their independence in learning mathematics. The results also indicated that the use of peer and selfevaluation led to increased focus and attention, increased motivation, confidence, take responsibility, active participation, critical thinking, and using various strategies to solve mathematical problems and making decisions.\nAl-Marhabi (2013) carried out a study aimed at identifying the evaluation methods used by mathematics teachers in the middle stage in Al-Qunfudah Governorate, and the degree of their practice. The study sample included (30) teachers of mathematics who were selected by stratified random method. The descriptive -survey methodology was used. A (36) items observation card was designed. The items of the card were distributed on four main axes for alternative evaluation tools. The results of the study showed that the degree of practicing alternative evaluation styles used by mathematics teachers in the middle stage in Al -Qunfudah Governorate was weak. Self -evaluation came in the first rank, followed by peer evaluation, and then files of achievement, and came in the last rank, rules of performance assessment.\nThe study of Al-Olayan (2015) sought to identify the reality of using alternative evaluation styles by mathematics teachers at the intermediate stage. The sample of the study consisted of (68) mathematics teachers in private intermediate schools in Riyadh. The descriptive -survey methodology was used. To achieve the objectives of the study, a questionnaire was used as a tool to collect data. The results of the study showed that the degree of practicing alternative evaluation styles by mathematics teachers was poor.\nIbrahim (2017) conducted a study aimed at investigating the degree of teachers' use of alternative evaluation strategies and tools in Sohag Governorate, Egypt. The study sample consisted of (324) male and female teachers. The descriptive methodology was used. A questionnaire was used to collect data. The results showed that the use of the paper and pen based evaluation strategy was high, while the performance -based evaluation, observation, and communication scores were moderately practiced, and the self-review evaluation received poor practice."}, {"section_title": "Study Methodology and Procedures", "text": ""}, {"section_title": "Study Methodology", "text": "The present study followed the descriptive methodology which aims at describing the phenomena, collecting facts and information about them, describing and determining their conditions as they are in reality, which is consistent with the objectives of this study."}, {"section_title": "Sample of the Study", "text": "The sample of the study was selected from elementary school mathematics teachers. All elementary schools in the city of Hail were numbered, and (40) schools were randomly selected and (55) mathematics teachers were selected. Table 1 shows the distribution of the study sample. "}, {"section_title": "Tool of the Study", "text": "To achieve the objectives of the study, an observation card was prepared containing alternative evaluation strategies. In this study, in determining the axes of the alternative evaluation in the observation card, it relied on the elementary mathematics teachers' guides, as well as some educational literature and studies related to the subject of the study, such as the study of (Wikstorm, 2007) and Affana (2011) . The variables discussed in the previous studies have been studied and identified the axes and items of the observation card in its initial form, consisting of seven axes are: Observational evaluation strategy, communication -based evaluation strategy, performance based evaluation strategy, evaluation strategy using achievement file, self -evaluation strategy, peer evaluation strategy and paper and pen evaluation strategy."}, {"section_title": "Validity of the Study Tool", "text": "The validity of the tool was verified in two ways:\nFirst: Validity of the arbitrators: The study tool was presented, in its initial form, to a group of specialists in teaching mathematics and some supervisors and mathematics teachers to find out their views on the validity of the tool to measure the degree of practicing alternative evaluation strategies by mathematics teachers, and clarify of items and accuracy of language and grammatically formulated and the importance of items, as well as the extent to which the item is related to its axis.\nAfter the retrieval of the tool from the arbitrators were taken their observations and make some necessary adjustments to show the study tool in its final form of (68) items distributed over seven axes are:\n-Observational evaluation = (11) items.\n-Communication -based evaluation: (10) items.\n-Performance -based evaluation: (9) items.\n-Evaluation using achievement file: (11) items.\n-Self -evaluation: (8) items.\n-Peer -evaluation: (7) items.\n-Paper and pen evaluation (8) Second: Validity of internal consistency: To verify the validity of the internal consistency of the study tool, the tool was applied to a pilot sample from mathematics teachers in elementary stage consisted of (20) teachers from outside of the study sample. Pearson correlation coefficient was calculated between each of the tool axes and the total score of the tool. Table 2 illustrates this. Table 2 that the correlation coefficients between each axis and the total score of the tool are acceptable, ranging from (0.89 -0.97). This refers to the validity of the tool and its applicability to the study sample. Based on the above, the study tool has an acceptable degree of validity."}, {"section_title": "Reliability of Observation Card", "text": "The reliability of the observation card was verified in a way of \"agreement of observers\" with the help of a cooperating observer who was trained on how to use the card, it was applied to a pilot sample of five elementary school mathematics teachers other than the study sample. The coefficient of reliability between observers was calculated using the Cooper equation. Table 3 shows this. Table 3 , the rate of agreement in all axes of the observation card was high as the general average of the agreement of observers was (87%) which indicates the reliability of the observation card."}, {"section_title": "Application Procedures", "text": "-Educational literature and studies related to alternative evaluation were reviewed.\n-Constructing the study tool in its initial form.\n-Ensuring the validity of the study tool by presenting it to a group of specialized arbitrators and making sure the reliability of the observation card using Cooper equation.\n-Preparation of the study tool in its final form. It consisted of (64) items.\n-Obtaining a letter of facilitation from the University of Hail and a letter from the director of the general administration of education in Hail for the schools included in the study sample. -Coordinating with mathematics teachers included in the study sample to organize classroom visits and coordinate them to observe their performance.\n-Applying the observation card to the study sample during the first semester of the academic year (2017/2018) and for two months.\n-The results were extracted, discussed and recommendations made in light of the results."}, {"section_title": "Statistical Methods", "text": "Frequencies, percentages, means, standard deviations Cooper equation and Kruskal -Walls test were used to answer the study questions:"}, {"section_title": "Study Results and Discussion", "text": ""}, {"section_title": "Results of the First Question", "text": "What is the degree of practicing alternative evaluation strategies by mathematics teachers in elementary stage?\nTo answer this question, means, standard deviations and ranks were calculated for each axis of the observation card and the observation card as a whole. Table 4 shows that the means of the degree to which mathematics teachers practice alternative evaluation strategies ranged from (1.92 -2.41). The paper -and -pen evaluation strategy was ranked first, with a mean of (2.41) and a standard deviation of (0.54) and a high degree of practice. The other axes received medium degree of practice. The same table also shows that the mean of the degree of practice of mathematics teachers at the elementary stage of the alternative evaluation strategies as a whole was (2.12) with a medium degree of practice.\nThis may due to short pre -service and in -service teacher training programs. There is also a lack of guidelines to help teachers use alternative evaluation strategies. The reason may also be because teachers are not convinced of the feasibility of alternative evaluation, and that it increases the teaching load on them.\nThis result differed with studies that showed the low degree of practice of mathematics teachers for alternative evaluation strategies, such as Al -Marhabi (2013) and Al -Olayan (2015) studies. This result also differed with the Al -Budoor (2010) study, which showed that mathematics teachers' practice of alternative evaluation was high.\nTo judge the degree to which mathematics teachers practice alternative evaluation strategies, the degree is determined as follows:\n-Less than (1.67): Low practice degree.\n-From (1.67 -less than 2.34): Medium practice degree.\n-From (2.34) and above: High practice degree.\nThe tables (5, 6, 7, 8, 9, 10, 11) show the degree of practice of mathematics teachers for each alternative evaluation strategy. Table 5 shows that the mean of the degree to which mathematics teachers practice the observational evaluation strategy, ranged from (2.24 -1.53). As shown in the table, all items received a medium degree of practice except item (8) which obtained a low degree of practice with a mean of (1.53) and a standard deviation of (0.63). The table also shows that the general mean of the degree of practice of mathematics teachers the observational evaluation strategy was (1.92) and a standard deviation of (0.36) with a medium degree of practice.\nThis result may be attributed to the attempt of some teachers to apply this strategy, even if moderately to meet the orientation of the new educational system and keep pace with the requirements of the age toward diversification in the evaluation strategies used in the evaluation of students. The reason may also be because the strategy requires a range of practical skills for the teacher.\nThis result was consistent with Ibrahim's (2017) study, which showed that teachers' practice of observational evaluation strategy was moderate. Table 6 shows that the mean of the degree of practicing communication based strategy by mathematics teachers ranged from (2.60 -1.65). The general mean of this axis was (2.29) and a standard deviation of (0.38) with a medium degree of practice. The items \"Students were asked to validate the solution\", \"Discussion is used to monitor students' progress\", \"He uses oral questions to evaluate students' understanding of the facts\", \"Asks the students to justify the answer\", \"Listens to students' questions\", and \"Shows interest in students' questions\", had got a high degree of practice.\n10.1.3 The Third Axis: \"Performance -Based Evaluation\" Table 7 shows that the mean of the degree of practice of mathematics teachers for the performance based evaluation strategy ranged from (2.29 -1.75). All of them have moderate degree of practice. The table also shows that the general mean of the axis was (1.98) and a standard deviation of (0.39) with a medium degree of practice. Item (26) had the highest mean of (2.29) and a standard deviation of (2.29). While item (29) had the lowest mean of (1.75) and a standard deviation of (0.58).\nPerhaps the reason that all the items in this axis came to a medium degree is that the use of performance estimate rules require a relatively long time, mathematics teachers may not have due to the intensity of the subject and the limited time of the class, and the large number of students and increase the quorum of teachers on the burden of teaching. It may also be due to the fact that performance -based evaluation requires the knowledge and effort of teachers who do not have continuous training programs before and during service.\nThis result is consistent with Ibrahim's (2017) study, which showed that teachers' practice of performancebased evaluation strategy was moderate. While differed with the studies of Al -Marhabi (2013) and Al -Olayan (2015) which revealed the low practice of teachers to the strategy of performance -based evaluation.\n10.1.4 The Fourth Axis: \"Evaluation Using Achievement File\" Table 8 shows that the mean of the degree of practicing \"evaluation using achievement file\" strategy by mathematics teachers ranged from (2.18 -1.76). All of these items have a medium degree of practice. The table illustrates that the general mean of the axis was (2.03) with a standard deviation of (0.44). Items (35) and (36) had the highest mean of (2.18) and a standard deviation of (0.64). While item (40) had the lowest mean of (1.76) and a standard deviation of (0.67).\nThis result is explained by the effect of the comprehensive development of mathematics curricula, including the interest in evaluating the work of students which necessitates the existence of a file of achievement through which the student works throughout the semester. This has had a positive effect on achieving a moderate degree of practice. However, increasing the teaching load of teachers, the existence of quarterly plans to finish the course, and the need for evaluation strategy to use the achievement file to follow -up actively and continuously by the teacher as the achievement files are not rigid, but need to be updated continuously and follow -up by the teacher and the parent. All these have prevented this strategy from achieving a high degree of practice.\nThis result differed with the studies of Al -Marhabi (2013) and Al -Olayan (2015), which revealed the weakness of the teachers' practice of the evaluation strategy using the achievement file. It also disagreed with the study of Al -Budoor (2012), which showed that the practice of teachers to the files of achievement was high.\n10.1.5 The Fifth Axis: \"Self -Evaluation\" As shown in Table 9 that the means of the degree of practicing \"Self -evaluation\" strategy by mathematics teachers ranged from (2. 36 -1.71 ). The table also shows that the items of this axis have a mean of (2.10) and a standard deviation of (0.36), with a moderate degree of practice. Item (46) had the highest mean of (2.36) and a standard deviation of (0.68). While the other items had a medium degree of practice.\nThis result is due to the lack of skills of mathematics teachers in designing self -assessment lists, questionnaires and self -learning records. The percentage of mathematics teachers in the study sample who did not receive training courses in alternative evaluation strategies reached (81.8%). This is also attributed to the lack of confidence of the teacher in the students, as well as the weakness of their abilities and skills in determining the levels of self -evaluation. Also, the increased teaching loads of mathematics teachers and the lack of class time do not enable them to use self -evaluation optimally. Self -evaluation also requires special tools that a teacher may not be able to design individually.\nThis result was consistent with the Al -Marhabi (2013) study, which showed that the teachers' degree of practicing self -evaluation strategy was moderate. This result differed with the studies of Al -Olayan (2015) and Ibrahim (2017) which showed the weakness of teachers' practice of self -evaluation strategy.\n10.1.6 The Sixth Axis: Peer Evaluation\" Table 10 shows that the means of the degree of practicing \"peer evaluation\" strategy by mathematics teachers ranged from (2.47 -2.07). The table also shows that the overall mean of the axis reached (2.23) and a standard deviation of (0.48) with a medium degree of practice. Item (50) had the highest mean of (2.47) and a standard deviation of (0.66) with a high degree of practice. While the other items gained a medium degree of practice.\nThis may be attributed to the conviction of teachers that peer evaluation needs a great time and effort, both in terms of application and even in terms of training students. The greater the number of students, the more difficult, and this strategy is becoming increasingly difficult to implement. Also, mathematics teachers know that peer evaluation needs to design objective tools, all of which may feel pressure or increase in the study load. This may also be due to the teachers' perception that elementary school students don't have the capacity to observe, criticize and judge their classmates.\nThis result was agreed with the study of Adediwura (2012) which showed that the degree of teachers' practice of peer evaluation was moderate. However, it disagreed with the Al -Olayan (2015) study, which showed the weakness of teachers' practice of the peer evaluation strategy.\n10.1.7 The Seventh Axis \"Paper and Pen Evaluation\" Table 11 shows that the means of the degree of practicing \"paper and pen evaluation\" strategy by mathematics teachers ranged from (2.62 -1.69). The general mean of this axis was (2.41) with a high degree of practice. Most items gained high degrees of practice. The highest was item (59). Its mean was (2.62). While item (64) had the lowest mean of (1.69) with a medium degree of practice.\nThis is due to the experience enjoyed by mathematics teachers during their teaching years, which earned them the ability to activate and use the evaluation strategy of paper and pen until it became automatic practice in evaluating the work of students and their daily duties. This may also be due to the popularity of this strategy, its ease and is highly credible to parents. The control of all kinds of tests as a favorite tool of many teachers and their ability to empower teachers to quantify the performance of their students, no matter how many.\nThis result was in line with Ibrahim's (2017) study, which showed that teachers' practice of paper and pen evaluation was high."}, {"section_title": "Results of the Second Questions", "text": "Are there any significant differences in the degree of practicing alternative evaluation strategies by mathematics teachers in elementary stage attributed to experience and training courses in alternative evaluation?\nThis question was answered according to its variables as follows:\n1. Experience variable. To find out the significance of differences in the degree of practice of mathematics teachers in the elementary stage of alternative evaluation strategies according to the variable of experience, the Kruskal -Walls test was used. Table 12 illustrates this. Table 12 shows that there were no significant differences at (α ≤ 0.05) in the degree of practicing alternative evaluation strategies by mathematics teachers attributed to experience variable. Chi -square value of the total score was (0.762). The table also indicated that there were no significant differences at (α ≤ 0.05) on all axes. This indicates that the practices of mathematics teachers at the elementary stage of alternative evaluation strategies were similar regardless of their experience. Thus, the first hypothesis which states that there were no significant differences in the degree of practicing alternative evaluation strategies by elementary mathematics teachers attributed to experience variable was accepted.\nThis similarity is attributed to the fact that the duties and tasks assigned to the teachers of mathematics are the same, did not change according to teachers' experience, which created a pattern prevalent among the teachers of mathematics whatever their experience. This may reveal that the experiences of mathematics teachers have become frequent and undeveloped. This may also have attributed to the resistance of teachers with long experience using alternative evaluation strategies to get used to traditional evaluation methods. This indicates that teachers are affected by the prevailing educational traditions in the educational community, which explains why teachers are not convinced of the feasibility of alternative evaluation strategies.\nThis result differed with the Al -Marhabi (2013) study, which showed that there were significant differences in the degree of teachers' practice of alternative evaluation styles due to experience."}, {"section_title": "Training courses variable:", "text": "To find out the significance of differences in the degree of practicing alternative evaluation strategies by Table  13 shows that. Table 13 shows that there were significant differences at (α ≤ 0.05) in the degree of practicing alternative evaluation strategies as a whole by mathematics teachers attributed to training courses variable. The ranks' averages show that these differences in favor of teachers with three or more training courses. This means that the degree of practice of teachers of mathematics with three or more training courses for alternative evaluation strategies as a whole was higher than that of mathematics teachers with two or less courses. Thus, the null hypothesis is rejected and the alternative hypothesis which states that there were significant differences in the degree of practicing alternative evaluation strategies by mathematics teachers in the elementary stage attributed to training courses variable is accepted This result may be due to the effect of training courses on encouraging teachers to use alternative evaluation strategy. It may also be due to the role of these courses in raising the level of teachers' practice of alternative evaluation strategies and their effective impact in their knowledge, skills building and professional development in terms of raising awareness and change their convictions toward the importance of diversification in alternative evaluation strategy used in evaluating students' learning in the classroom.\nThe table also shows that there were no significant differences in the degree of practice of mathematics teachers for alternative evaluation in the two axes: (communication -based evaluation and paper and pen evaluation). This indicates the similarity of teachers' practices in these two axes, no matter how many courses are offered.\nThis may be attributed to the fact that the evaluation strategies based on communication and evaluation of paper and pen have gained a long experience by mathematics teachers during their teaching, because they are used daily on the level of the class.\nThis result was consistent with the studies of Al -Marhabi (2013) and Ibrahim (2017) which found that there were significant differences due to the variable of training courses."}, {"section_title": "Recommendations", "text": "In light of the result of this study, the researchers recommend the following:\n-Training mathematics teachers before and during the service on the use of alternative evaluation strategies through the provision of courses and training courses specialized in evaluation.\n-Conducting a study to determine the training needs of mathematics teachers in light of alternative evaluation strategies.\n-Studying the role of the educational supervisor and the principal in improving the use of mathematics teachers for alternative evaluation strategies in students' learning."}]