[{"section_title": "Introduction", "text": "The vestibular system is an evolutionarily ancient sensory system that detects head movement and drives primal reflexes which maintain balance, posture and stable gaze. The vestibular system also projects to integrative centers in the cerebellum, brainstem and cortex, to provide perceptions of gravity and orientation with respect to space. While the role of the vestibular system in balance and coordination is well known, growing evidence is highlighting its important role in cognition. Notably, the vestibular system has been found to be an important contributor to spatial cognitive ability [1,2,3]. A number of recent studies have found that vestibular impairment is significantly associated with cognitive deficits in older adults [4,5]. However, the exact pathways through which the loss of vestibular function may affect cognition is unknown. Functional neuroimaging studies in healthy subjects have shown that vestibular stimulation activates a large multisensory cortical and subcortical network, which primarily includes the insula, temporo-parietal junction, somatosensory cortex, hippocampus, medial entorhinal cortex (ERC), several thalamic nuclei, and basal ganglia [6,7,8,9,10,11,12,13,14,15,16,17]. One prior study found that poorer vestibular function in older adults was associated with significantly reduced hippocampal volumes [18]. However, it is unknown how vestibular impairment in older adults may impact the broader network of cortical and subcortical structures that receive vestibular input, both with respect to global volumes of brain structures as well as local shape changes. In this study, we investigated the relationship between vestibular function and sub-cortical and cortical structures known to receive vestibular input in healthy older adult participants in the Baltimore Longitudinal Study of Aging. Specifically, we used MRI images and vestibular physiologic data to detect volume and shape differences associated with variation in vestibular function. To the best of our knowledge, this study is among the first to examine the association between age-related variation in vestibular function and brain structure in multiple brain areas that receive vestibular input."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Data", "text": "The Baltimore Longitudinal Study of Aging (BLSA) is a long running study of aging among community dwelling adults started in 1958 [19]. While there are more than 1100 participants in the study; we chose a subset of participants who were ! 60 years old and underwent both brain MRI scans and vestibular testing in the same study visit between 2013 and 2015. The mean age (AESD) of the group was 77.5 years (AE8.9 years), and 80% were male. All participants provided written informed consent, and the BLSA study protocol (03-AG-0325) was approved by the National Institute of Environmental Health Sciences Institutional Review Board."}, {"section_title": "MRI testing", "text": "MRI scans were performed using a 3T Philips Achieva scanner at the National Institute on Aging (NIA) Clinical Research Unit. Sequences included a T1 volumetric scan magnetization prepared rapid acquisition with gradient echo (MPRAGE; TR ¼ 6.5 ms, TE 3.1 ms, flip angle ¼ 8 , 256 Â 256 image matrix, 170 slices, voxel size ¼ 1.0 Â 1.0mm, slice thickness ¼ 1.2mm, FOV ¼ 256 Â 240mm). T1-weighted volumetric scan images were acquired in the sagittal plane."}, {"section_title": "Vestibular testing", "text": "Vestibular function was evaluated using the cervical Vestibular Evoked Myogenic Potential (cVEMP), which is a measure of saccular function. The saccule is the vestibular end-organ involved in detecting the orientation of the head with respect to gravity, and in prior work has been shown to be the vestibular end-organ most associated with spatial cognition [20]. cVEMPs are potentials generated in the sternocleidomastoid muscles (SCM) following sound stimulation via a sacculo-collic reflex. In brief, participants sat on a chair inclined to 30 and qualified examiners placed electromyographic (EMG) electrodes on the SCM and sternoclavicular junction bilaterally [21,22,23]. A ground electrode was placed on the manubrium. Sound stimuli of frequency 500 Hz and 125 dB were given in bursts of 100 stimuli monoaurally through headphones. Myogenic potentials recorded were normalized for background EMG activity collected 10 ms before onset of the sound stimulus. A commercial electromyographic system (software version 14.1, Carefusion Synergy, Dublin, OH) was used to record the cVEMP signals. Electromyogram signals were recorded with disposable, pre-gelled Ag/AgCl electrodes with 40-inch safety lead wires from GN Otometrics (Schaumburg, IL). Signals were amplified and band-pass filtered using 20-2000 Hz. The higher cVEMP from either ear was used in the analyses. An absent response was defined by a response below a threshold level per published guidelines and the assessment was repeated for confirmation [22,23]. Both a continuous cVEMP amplitude variable and a categorical variable (present vs. absent cVEMPs) were considered in statistical analyses."}, {"section_title": "MRI processing pipeline", "text": "We followed a procedure similar to those described in previous studies investigating sub-cortical changes associated with mild cognitive impairment and Alzheimer's disease [24,25,26], Huntington's disease [27], attention deficit hyperactivity disorder [28], and schizophrenia [29,30]. An outline of the procedure is shown in Figure 1. The structures of interest were obtained from the parcellation of the MRI scans of the brain to yield binarized volumes. The binarized volume was triangulated to yield the associated 3D surface. Volumes were obtained from the surfaces. Shape descriptors were obtained as 'deviation' in the subject's shape from a mean shape, i.e. the population template. Statistical analysis was done through multiple regression, with vestibular function as the independent variable, and volume/shape descriptors as the dependent variables. Each step is further explained in the following subsections."}, {"section_title": "Segmentation and 3D reconstruction", "text": "T1 scans were automatically segmented by registering them to multiple atlases, using Large Deformation Diffeomorphic Metric Mapping (LDDMM) [31]. The parcellation of the scans was based on the Multiple-Atlas Likelihood Fusion (MALF) algorithm [32,33], with 286 defined structures. The parcellation was done through MRICloud [34], an online neuroinformatics platform that provides tools for automatic brain parcellation and surface registration (https://www.mricloud.org/). Surfaces were created from the binary segmentations using Restricted Delaunay triangulation [35,36,37]. Since the results critically depended on the quality of segmentations as well as the surface reconstruction, quality control was performed at every stage with manual editing where necessary."}, {"section_title": "Volume analyses", "text": "The volumes of the structures were obtained from the binary segmentations by counting voxels and multiplying with the voxel dimensions. In multivariate regression analyses, we controlled for known confounders, namely age [38,39,40], sex [38,41,42,43], and intracranial volume (ICV) [18,44,45,46] defined as the total volume within the skull including left and right hemispheres, brainstem, cerebellum and cerebrospinal fluid. The regression model used was: where c v ; c i ; c a ; c s are coefficients for cVEMP, ICV, age and sex respectively, and c 0 is the constant term. The left and right brain structures were processed separately. cVEMP was used both as a continuous and categorial variable. In its continuous form, we reported the relative difference with one standard deviation (SD) unit increase in cVEMP.\n"}, {"section_title": "Shape analyses", "text": "Statistical shape analysis is used [47] to study localised changes at a level of granularity finer than anatomical volumes. Using triangulated surfaces to represent the brain's geometry was established as a standard by Freesurfer [48]. Our LDDMM-based shape analysis methods have previously demonstrated shape differences in sub-cortical structures in neuroimaging studies of Alzheimer's Disease [49,50], Schizophrenia [51] and Depression [52]. These method show greater statistical power in detecting differences caused by disease than volumetric measure [28,51,53,54,55]. A schematic of the shape analysis pipeline is shown in Figure 2. The population of surface meshes was rigidly aligned and used to create a 'mean shape', which was called the template. Templates were created separately for the left and right sides, for each structure. The resulting template acts as a coordinate system that represents the population average, and is blind to labels/groups. Each subject surface was then registered to this template through surface mapping, first rigidly, and then using surface LDDMM. The algorithm computes a smooth invertible mapping of the triangulated surface template onto the target surfaces. This pipeline is available to the public through MriCloud.org [56]. These deformations were used to estimate the log determinant of the surface Jacobian at each vertex, which acts as a shape descriptor at the vertex. A positive surface log-Jacobian value implies expansion of the template around that vertex to fit the subject, while a negative value implies regional compression or atrophy. For computational efficiency, as well as to increase the power of the analyses, the surfaces were sub-discretized by clustering to k small segments on the template, through spectral clustering [27]. Subsequently, the number of models per structure was reduced from about 600 vertices to 10-20 clusters. Once we had the k shape descriptor variables attached with each subject structure, we fitted a model to each shape descriptor, thus giving k models for each subject, where k is the number of clusters in the population template. The null hypothesis is: (2) Figure 1. Overview of the analysis pipeline: The structures of interest were obtained from parcellation of the MRI images of the brain to yield a binarized volume, which was used for volume analyses. For shape analyses, the binarized volume was triangulated to yield the associated 3D surface. The population of surface meshes was rigidly aligned and used to create a 'mean' shape, which was called the template. Each subject surface was then registered to this template through surface mapping, first rigidly, and then using surface Large Deformation Diffeomorphic Metric Mapping (LDDMM). These deformations were used to estimate the log determinant of the surface Jacobian at each cluster of vertices, which acts as a shape descriptor at the cluster. The surface Jacobians were regressed on the vestibular variables. with the alternate hypothesis: where, the variables have the same definitions as above. We calculated the significance level or p-value through permutation testing (see Section 2.2.4). The relative difference was expressed in terms of presence/ absence, when the categorical form of cVEMP was used. In the case of continuous cVEMP, we report the relative difference with 1 SD increase in cVEMP, as mentioned above.\n"}, {"section_title": "Statistical testing", "text": "Fitting a linear model to each cluster gives rise to the multiple hypothesis problem, where the probability of making at least one false positive is higher due to multiple testing. We used permutation testing to control for the Family-Wise Error Rate (FWER), as FWER controls error at the desired level for each experiment. Permutation testing generates a distribution of a test statistic under null hypothesis, usually by permuting the group labels/variable of interest [57,58,59]. The test statistic from the real data was then compared to this distribution, and the p-value is the fraction of the population greater than the real test statistic. Here, the test statistic was chosen as a ratio of maximum square errors in the null hypothesis to maximum square error in the alternate hypothesis."}, {"section_title": "Anatomical definition of the regions of interest", "text": "High field atlases were used to zero in on clusters associated with the specific sub-fields of the hippocampus, amygdala and thalamus. For the hippocampus and amygdala, a high field isotropic 7T MRI scan of resolution 0.8 mm from a 42-year-old healthy male was used. The subject was scanned using a standard MPRAGE protocol in a Philips Achieva 7.0T scanner (TR ¼ 4.3 ms, TE ¼ 1.95ms, flip ¼ 7, FOV ¼ 220 Â 220Â180). The CA1, CA2 and CA3 were manually delineated to create a high field atlas as previously described [60]. For the ERC and trans-entorhinal cortex (TEC), the ERC was analyzed separately and as a single structure comprising the ERC þ TEC (collateral sulcus) since the boundaries between them are often ambiguous so the TEC was not analyzed on its own. Similarly, the amygdala was subdivided into four nuclei: lateral, basolateral, basomedial and centromedial nuclei using definitions based on the Paxinos Atlas of the Human Brain [61]. For the thalamus, the 27 sub-fields were based on a 3D reconstruction of high resolution digital images from the Allen Institute for Brain Sciences. For further details, please see https://caportal.cis.jhu.edu/atl ases.html."}, {"section_title": "Results", "text": ""}, {"section_title": "Demographical and clinical data", "text": "There were 80 participants who had cVEMPs measured and MRI brain scans completed on the same visit ( Table 1). The mean age (AESD) of the group was 77.5 years (AE8.9 years), and 80% were male. A majority of participants were white (67.5%) and had a college education or greater (83.75%). The mean ICV in the group was 1247.2 cm 3 (AE184.5 cm 3 ). Seventy-two and a half percent of the participants had a cVEMP response present in either ear, and the mean cVEMP amplitude was 1.32 (AE0.69). The mean level of background EMG activity was 98.2 μV (AE43.5 μV), mean rectified. There were no significant differences in proportion of present cVEMP responses or in cVEMP amplitude by sex or race (data not shown). No participant had a diagnosis of mild cognitive impairment or dementia. Table 2 shows the correlation coefficients between the regressors. There were no significant correlations between cVEMP and the other regressors. As expected, we found significant relationships between vestibular function (continuous cVEMP variable), adjusted for age, sex, and ICV, and the volumes of the hippocampus and the entorhinal cortex (Table 3). For each one standard deviation decrease in cVEMP, the mean bilateral hippocampal volume decreased by 0.420 standard deviations (p ¼ 0.0055), while the volume of the left entorhinal cortex decreased by 0.325 standard deviations (p ¼ 0.034). The likelihood ratio test suggests that the model with cVEMP (R 2 ¼ 0.47) significantly improves the prediction of mean bilateral hippocampal volume than does the model without cVEMP (R 2 ¼ 0.311) (p ¼ 0.0025). Similarly, the likelihood ratio test suggests that the model with cVEMP (R 2 ¼ 0.424) significantly improves the prediction of left entorhinal cortical volume than does the model without cVEMP (R 2 ¼ 0.329) (p ¼ 0.021)."}, {"section_title": "Relation to categorical cVEMP variable", "text": "For all analyses reported in Table 4 and Figure 2, multiple coefficients refer to multiple significant clusters. Red and blue colors refer to expansion and compression relative to the mean template, respectively. For the hippocampus (Figure 2E), cVEMP response was associated with an 11.7% relative compression in the dorsal region, and a 14.3% relative compression in the ventral region, both on the left side. With reference to the high field atlas, the cluster in the dorsal region mapped to the CA1 subfield, and the cluster in the ventral region mapped to the CA2 subfield. In the cortex, we found that the presence of a cVEMP was associated with a 15.8% relative compression of the left ERCþTEC ( Figure 2D), as well as with a 10.3% relative compression on the left ERC when considered alone ( Figure 2D). There was no significant association between cVEMP and shape in the insula and perirhinal cortex. Further, the presence of cVEMP was associated with a 5.5% relative compression clusters located in the basolateral and basomedial nuclei of the left amygdala ( Figure 2D). In contrast, the presence of cVEMP was associated with 10.5% regional expansion in the left caudate nucleus ( Figure 2E) and with a 6.4% relative expansion of clusters located in the right ventral lateral and reticular thalamic nuclei (Figure 2E)."}, {"section_title": "Relation to continuous cVEMP variable", "text": "Only the shape of the putamen showed significant correlation with cVEMP amplitude. One SD increase in cVEMP was associated with a 4.1% relative expansion of the left putamen (Figure 2E)."}, {"section_title": "Discussion", "text": "In this study, we combined volume analyses and shape diffeomorphometry to better understand the relationship between vestibular function and brain structure in an aging population. We specifically looked at the volume and shape metrics of nine structures considered important in vestibular pathways [8,11]: the hippocampus, amygdala, thalamus, caudate nucleus, putamen, insula, ERC, ERC-TEC complex (collateral sulcus) and perirhinal cortex. With respect to global volumes, we observed that the hippocampus and ERC were significantly related to vestibular function, both showing a relationship between reduced vestibular function and lower volumes. These findings are consistent with a growing body of literature in animals and humans demonstrating vestibular modulation of hippocampal function [6,11,12,62,63]. Interestingly, in the shape analyses, we observed that reduced vestibular function was associated with expansion of local surfaces in the hippocampus and ERC, as well as in the amygdala and the ERC-TEC complex. These seemingly contrasting results with respect to global volume and local shape in the hippocampus and ERC could occur because total volume reflects an array of constituent shapes. As such small local shape changes may be compensated for by shape changes in the other direction in the rest of the broader structure (even if these latter changes are each non-significant). Such discrepancies have been reported previously by our group and in other studies, for example in children with ADHD in whom basal ganglia volume changes in some cases conflicted with the direction of local shape changes [64,65,66]. Analyses of volume and surface area shape change provide distinct and complementary information about global and local brain structural change. Altogether, our data show a link between age-related reduction in vestibular function and variation in hippocampal morphology. Irrespective of the direction of the association, it is notable that the variation we observed in the hippocampus, ERC-TEC and amygdala was in the same direction, which could be explained by the extensive interconnections between these structures [67,68]. Most of the significant regions in the hippocampus were in CA1, followed by CA2. This is consistent with animal studies that have shown evoked field potentials, increased single neuron discharge, increased activation using fMRI, and c-Fos activationall in CA1following electrical activation of the peripheral vestibular system [6,12,63,69,70]. Moreover, several studies have shown that vestibular lesions result in loss of location-specific firing of place cells, which largely reside in CA1 [71,72]. Further, theta rhythm, an EEG rhythm important for the coordination of place cells, has also been shown to be disrupted in CA1 and the ERC after bilateral vestibular deactivation or lesions in rats [73,74,75,76,77]. In addition, the ERC projects strongly to CA3 and CA1 of the hippocampus [78]. Why these hippocampal and ERC regions that are interconnected and respond to vestibular input exhibit increased surface area in individuals with poorer vestibular function is unclear. It is interesting to note recent evidence in rodents that vestibular input can modulate hippocampal neurogenesis [79] and that newly generated neurons from the dentate gyrus can appear in CA1 and are functional [80]. In case of the amygdala, the significant region was localized to the basolateral and basomedial nuclei. Many studies report a strong connection between the basal nuclei of the amygdala and CA1, CA3 of the hippocampus and ERC [81]. The accessory basal nucleus projects substantially to three components of the hippocampal formation: the ERC, the CA1 subfield, and the parasubiculum [81]. The main projections from the lateral nucleus are directed to the ERC and the parasubiculum [67]. The amygdala-hippocampal connection is bidirectional, with the CA1 and ERC strongly projecting to the basolateral nucleus [82]. Another study reported substantial inputs to the amygdala, specifically the lateral, basal, accessory basal, and central nuclei, from the rostral half of the   entorhinal cortex and the temporal (ventral) end of the CA1 subfield [67]. The same study reported heavy projections from lateral, basal, accessory basal, and posterior cortical nuclei, to the rostral half of the entorhinal cortex and the temporal end of the CA3 and CA1 subfields. Although a functional link has been made between vestibular stimulation and fMRI amygdala activation [83,84], our study is among the first to our knowledge to report an association between vestibular function and the structure of the amygdala in humans. We observed that poorer vestibular function was associated with compression of the ventral lateral nucleus and a small part of the reticular nucleus of the thalamus. Many studies report that the superior and medial vestibular nuclei in the brainstem project to the thalamic ventral posterior lateral nucleus, nucleus ventralis intermedius, ventral posterior medial nucleus or ventral posterior inferior nucleus [16]. Several anatomical studies revealed vestibular pathways from the vestibular nuclei to the ventral lateral nucleus in the rat, the cat and the monkey [85]. The ventral lateral nucleus also receives vestibular inputs from the vestibular cerebellar nuclei [86]. An electrophysiological study in monkeys documented the responses from neurons in the ventral lateral nucleus to whole-body translations, which provides a similar stimulus to the VEMPs used in this study [86]. Vestibular projections to the ventral lateral nuclei are often considered a major vestibulomotor pathway from the vestibular nuclei to premotor and motor cortex [16]. In contrast to the well-described vestibular projections to the ventral lateral nucleus, there is less evidence of vestibular projections to the reticular nucleus in the cat [87] and the monkey [86], with several studies reporting negative findings [85,88]. Neuroimaging studies in humans have usually reported activations in the ventroposterior complex of the thalamus and failed to report consistent activations in the ventral lateral and reticular thalamic nuclei [14,16]. Future studies will be needed to investigate how changes in these specific thalamic nuclei may be part of a broader network of changes in central vestibular signals that traverse through these thalamic nuclei. Additionally, we observed that better vestibular function was related to expansion of regions of the striatum, specifically the caudate nucleus and putamen in the ventral and ventrolateral regions respectively. Many studies have demonstrated vestibular projections to the caudate and putamen [8,89]. A few studies report a vestibulo-thalamo-striatal pathway, in which the dorsolateral and ventrolateral regions of the striatum receive inputs from ventral and dorsal regions, respectively, of the parafascicular thalamic nucleus, which in turn receives input from the brainstem vestibular nuclei [90,91]. Moreover, it has been suggested that the representation of the head/face is located in the ventrolateral parts of the striatum [92,93,94] although few systematic mapping studies of vestibular inputs have been conducted [8,95]. Our findings contribute to a growing recognition of vestibular-striatal pathways; future studies will be needed to better understand the functional significance of these pathways. Notably, we did not observe a significant relationship between vestibular function and shape of the insula, which is thought to be a key region in the multimodal vestibular cortical network. The insular cortex has a highly convoluted surface anatomy, which presents a technical challenge for defining surfaces. Cortical thickness might provide a better measure of local variation in the insular cortex as a function of vestibular impairment."}, {"section_title": "Limitations", "text": "A key limitation of the study is that observable differences are limited by the resolution of the MRI scans. In addition, the results critically depend on the quality of the segmentations. While this is relatively straightforward for sub-cortical structures like the hippocampus, cortical structures like the entorhinal cortex, trans-entorhinal cortex and perirhinal cortex are notoriously difficult to segment automatically, due to faint and ambiguous grey matter-white matter boundaries. Diversity in cortical shapes, and a lack of consistent and commonly accepted protocols make the process even more difficult. There is an additional localization problem inherent in our shape analyses, in it being limited to only surface regions. Hence atrophy within a structure, like in the intralaminar thalamic nuclei, is likely to go undetected. The test statistic we used was a ratio between maximum squared errors of null and alternate hypotheses. Maximum squared error generally is less robust than summed square error. But this approach is typically used in our group because it is conservative, since it compares our results to the least favorable outcome under permuted group labels, rather than average outcomes. We note that in this nonparametric testing procedure, the level of the tests (i.e. the validity of our p-values) do not depend on our data following any particular distribution or on our choice of test statistic, but the power of the tests do. Another limitation is that with the shape analysis methodology, the population template is generated based on the particular sample. Our sample included 80 participants from the BLSA, a longitudinal study of the normative aging process. To the extent that BLSA participants may differ from the general population of that same age range, the BLSA template (and resulting analyses) may not be fully generalizable to the broader adult population. Additionally, it is unclear whether the changes in brain structures that we observed in this population occur in younger individuals with weakened vestibular function. Further confirmation of our analyses in other populations will be needed to confirm the robustness of our findings."}, {"section_title": "Future work", "text": "In this study, we have investigated the relationship between vestibular function and the volume and shape of structures in the brain. While such a cross-sectional study is useful to observe relationships within many structures, it does not provide definite information about causeeffect relationships. A next step would be a longitudinal study, where the hypothesis that vestibular loss precedes structural changes can be tested. Statistical techniques like structural equation modelling can be used with longitudinal data to investigate simultaneous or bidirectional relationships between vestibular function and structure. Additionally, changepoint analysis can be applied to longitudinal data to determine when non-linearities occur in trajectories of structural change. For cortical structures like the ERC and the insula, changes in thickness might also offer relevant insights, and can be similarly modelled. Furthermore, advanced analysis techniques such as network modelling can be used to evaluate how vestibular impairment in older adults may lead to a network of changes that occur simultaneously or in characteristic sequences, and how these changes relate to cognitive phenotype."}, {"section_title": "Declarations", "text": "Author contribution statement NIBIB R01-EB020062. Yuri Agrawal was supported by NIH/NIA AG057667, NIH/NIDCD DC015583, and NIH/NIDCD DC013056."}]