[{"section_title": "Abstract", "text": "Chronic pain is associated with brain atrophy with limited evidence on its impact in the older adult's brain. We aimed to determine the associations between chronic pain and a brain aging biomarker in persons aged 60 to 83 years old. Participants of the Neuromodulatory Examination of Pain and Mobility Across the Lifespan (NEPAL) study (N 5 47) completed demographic, psychological, and pain assessments followed by a quantitative sensory testing battery and a T1-weighted magnetic resonance imaging. We estimated a brain-predicted age difference (brain-PAD) that has been previously reported to predict overall mortality risk (brain-PAD, calculated as brain-predicted age minus chronological age), using an established machine-learning model. Analyses of covariances and Pearson/Spearman correlations were used to determine associations of brain-PAD with pain, somatosensory function, and psychological function. Individuals with chronic pain (n 5 33) had \"older\" brains for their age compared with those without (n 5 14; F[1,41] 5 4.9; P 5 0.033). Greater average worst pain intensity was associated with an \"older\" brain (r 5 0.464; P 5 0.011). Among participants with chronic pain, those who reported having pain treatments during the past 3 months had \"younger\" brains compared with those who did not (F[1,27] 5 12.3; P 5 0.002). An \"older\" brain was significantly associated with decreased vibratory (r 5 0.323; P 5 0.033) and thermal (r 5 0.345; P 5 0.023) detection, deficient endogenous pain inhibition (F[1,25] 5 4.6; P 5 0.044), lower positive affect (r 5 20.474; P 5 0.005), a less agreeable (r 5 20.439; P 5 0.020), and less emotionally stable personality (r 5 20.387; P 5 0.042). Our findings suggest that chronic pain is associated with added \"age-like\" brain atrophy in relatively healthy, community-dwelling older individuals, and future studies are needed to determine the directionality of our findings. A brain aging biomarker may help identify people with chronic pain at a greater risk of functional decline and poorer health outcomes."}, {"section_title": "Introduction", "text": "More than 1.5 billion people worldwide experience chronic pain, and more Americans are affected by chronic pain than by diabetes, heart disease, and cancer combined. 39 In particular, epidemiological evidence suggests an age-related increase in pain prevalence with back and knee pain as the most commonly reported pain in those older than 65 years. 38 Chronic pain in older individuals is a growing public health problem because effective treatments are lacking, and pain detrimentally impacts physical and cognitive function, ultimately decreasing quality of life and overall well-being.\nPain is associated with both direct (ie, the experience of pain) and indirect effects on the brain. 35 Neuroimaging studies have established the prominent role of the brain in pain perception and modulation and in the integration of sensory, motor, emotional, and cognitive components that give rise to the complex, individualized pain experience. Although most chronic pain conditions are associated with changes to brain structure and function, 1, 31, 35, 36 these structures are similarly impacted by normal and pathological chronological aging processes. Indeed, chronological aging has been associated with both global and spatially localized changes to brain structure and function, which may be very similar to brain changes reported in chronic pain states. In addition, several preliminary investigations in older adults with and without low back pain (n 5 8/group) suggest that chronic pain may negatively impact the brain above and beyond age-related effects (ie, accelerated brain aging). [2] [3] [4] Recently, multivariate methods have been developed to define statistical models of healthy brain aging. Using machine-learning analysis of structural neuroimaging data, chronological age can be accurately predicted in healthy individuals. 16 Using this method, older predicted brain age (as compared with chronological age) has been reported in Alzheimer disease, 15 mild cognitive impairment, 18 HIV, 9 schizophrenia, 29 and after traumatic brain injury. 7 Meanwhile, protective factors, such as years of education, physical exercise, and practicing meditation, have been associated with a positive influence on brain aging. 6 Sponsorships or competing interests that may be relevant to content are disclosed at the end of this article.\nFurthermore, recent work found that having an older predicted brain age was associated with weaker grip strength, poorer lung function, slower walking speed, lower fluid intelligence, higher allostatic load, and increased overall mortality risk measured prospectively. 8 In the present investigation, we used a neuroimaging-derived brain biomarker to investigate the association between brain aging and chronic pain in community-dwelling individuals aged 60 to 83 years. Consistent with previous work, 8 we estimated a brainpredicted age difference (brain-PAD, calculated as brain-predicted age minus chronological age) using structural neuroimaging (T1-weighted magnetic resonance imaging [MRI] ) processed through an established analysis pipeline. The pipeline included comparing voxelwise gray and white matter volume images with a statistical model that accurately predicts chronological age from neuroimaging data in healthy people (trained on 2646 independent healthy adults aged 18 to 90 years). The primary hypothesis of the present study was that older adults reporting chronic pain will have a greater brain-PAD (ie, older brain, accelerated brain aging) compared with older adults who did not report chronic pain during the past 3 months. In addition, we also tested exploratory associations between brain-PAD with clinical pain characteristics, as well as somatosensory and psychological function."}, {"section_title": "Methods", "text": ""}, {"section_title": "Participants", "text": "Community-dwelling individuals older than 60 years who were native English speakers were recruited as part of an ongoing project at the University of Florida studying the neurobiology of age-related differences in pain modulation and its impact on function (Neuromodulatory Examination of Pain and Mobility Across the Lifespan [NEPAL]). Potential participants were screened over the phone and again in person. Exclusionary criteria included the following: (1) Alzheimer, Parkinson, or other condition directly impacting the brain; (2) serious psychiatric conditions (eg, schizophrenia, major depression, bipolar disorder), (3) uncontrolled hypertension (blood pressure of .150/95 mm Hg), heart failure, or history of acute myocardial infarction; (4) systemic rheumatic disorders (ie, rheumatoid arthritis, systemic lupus erythematosus, fibromyalgia); (5) chronic opioid use; (6) MRI contraindications; (7) excessive anxiety regarding protocol procedures; (8) hospitalization within the preceding year for psychiatric illness; (9) HIV or AIDS; and (10) cognitive impairment (Modified Mini-Mental State Examination [3 MS] score # 77). 43 Participants were recruited through posted fliers, newspaper ads, and word of mouth referrals. As the NEPAL study aims to recruit older individuals with and without chronic pain representative of the aging population, individuals were not specifically recruited for the presence of a pain condition. All procedures were reviewed and approved by the University of Florida's Institutional Review Board, and all participants provided verbal and written informed consent. For the current study, data presented are from 3 separate laboratory visits: (1) a health assessment session (ie, demographic, general health, pain, and psychological information), (2) a quantitative sensory testing session, and (3) a neuroimaging session detailed below. Other measures including data from other study visits are not included in the present investigation."}, {"section_title": "Health assessment session", "text": "Upon verbal and written informed consent, participants completed questionnaires, which included general health and demographic information including all medications taken. Similar to our previous studies in older individuals, 11 a trained research coordinator assessed health and pain history, including detailed information regarding smoking, drinking, and exercise habits. The following instruments were also administered during this session to assess self-reported pain and psychological function:"}, {"section_title": "Self-reported pain", "text": "Participants were assigned to the pain group if they reported pain on most days during activities that included walking, using stairs, while in bed, sitting or lying, and standing on a daily basis during the past 3 months. This definition of chronic pain is consistent with the Task Force for the Classification of Chronic Pain consensus for the 11th version of the International Classification of Diseases of the World Health Organization (WHO). 44 Participants also completed a standardized pain history interview regarding the presence of pain across several body regions (ie, head/face, neck, shoulders, arms, hands, chest, stomach, upper and lower back, leg, knees, and feet) using a validated body manikin. 12, 34 Participants were asked to choose the location of their worst pain and asked about its duration, frequency during the past week, intensity on average, and how hard it was to deal with their worst pain. Participants were also asked if they received any treatments or tried any self-remedies (something they may have done at home) to relieve their worst pain during the past 3 months (Yes/No). Finally, all participants were queried regarding current medications."}, {"section_title": "Psychological and emotional function", "text": "The 20-item Center for Epidemiologic Studies Depression Scale questionnaire was used to measure the frequency of depressive symptoms during the past week on a 4-point Likert scale. 40 The Positive and Negative Affect Scale (PANAS) was also administered consisting of 20 items rated on a 5-point scale.\n10, 47 We asked the participants to report how they generally feel with high scores on positive affect reflecting enthusiasm, energy, and alertness, although higher scores on negative affect reflect distress and aversive mood states. The Ten Item Personality Measure (TIPI) is a brief 10-item measure of the Big Five (or FiveFactor Model) personality dimensions: Extraversion (E), Agreeableness (A), Conscientiousness (C), Emotional Stability (ES), and Openness to Experience (O). Each dimension is measured by 2 descriptors, one of each pair is reverse scored. Participants rate themselves on a 7-point scale ranging from 1 5 disagree strongly to 7 5 agree strongly. The TIPI was created to be finished within a minute. 22 "}, {"section_title": "Quantitative sensory testing session", "text": "Quantitative sensory testing (QST) was used to assess somatosensory function, similar to the method previously reported by our group in older individuals. 11 All QST procedures were performed in a quiet room with an approximate temperature between 21˚C and 23˚C. All subjects were seated in a comfortable chair with armrests and a semireclining back. Standardized testing was performed at the thenar eminence and on the first metatarsal head on all participants. An overview of the testing procedures was explained to the subject, and for each different modality, specific instructions were delivered immediately before beginning the test. Measurement of a particular type of threshold was first demonstrated, and at least one practice trial was conducted to ensure that subjects understood the testing procedures. Vibratory and thermal detection and pain threshold measurements were obtained with the TSA-II Neurosensory Analyzer and accompanying software (Medoc Ltd, Ramat Yishai, Israel). The method of limits was used to obtain all detection thresholds."}, {"section_title": "Vibration", "text": "The handheld VSA-3000 circular probe (contact tip 5 1.22 cm 2 ) of the Medoc system was used to measure vibratory thresholds for a 100 Hz stimulus frequency. Subjects were asked to indicate as soon as they felt the vibratory sensation. Three trials, separated by approximately 10 seconds each, began at 0 mm at a rate of 0.5 mm/second and increased until the subject indicated that the stimulus was felt or until the maximum amplitude of 130 mm was reached. The mean value across the 3 trials was calculated as the vibratory detection threshold for each site."}, {"section_title": "Thermal detection", "text": "A 30 3 30 mm thermode connected to the TSA-II Neurosensory Analyzer was used to deliver thermal stimuli. Each trial began at 32˚C, and the temperature decreased (for cool) or increased (for warm) at a rate of 1˚C/second until the subject perceived the stimulus or until the stimulus reached the cutoff value (0˚C for cool and 50˚C for warm). Each trial was separated by approximately 10 seconds. The average of threshold temperatures across 4 trials was calculated as detection threshold for each modality and test site."}, {"section_title": "Thermal pain", "text": "Subjects were instructed to indicate as soon as the sensation changed from \"just being cold to being painfully cold\" or from \"just being hot to being painfully hot.\" Each trial began at 32˚C and was either decreased (for cold pain) or increased (for heat pain) at a rate of 1˚C/second until pain threshold was reached or the cutoff value was reached (0˚C for cold pain and 50˚C for heat pain). Each trial was separated by at least 20 seconds. The mean across 3 trials at each test site was calculated as the pain detection threshold."}, {"section_title": "Pressure pain", "text": "Pressure pain thresholds were assessed on the quadriceps and trapezius muscles with the order of testing counterbalanced. For all test sites, a handheld digital pressure algometer (AlgoMed; Medoc) was applied at a constant rate of 30 kPa/second. Participants were instructed to press a button when the pressure sensation \"first became painful.\" Application was repeated 3 times on each site to create a mean pressure pain threshold for that site. The maximum application pressure was 1000 kPa based on safety considerations. For individuals reaching maximum pressure levels without reporting pain, a value of 1000 was assigned."}, {"section_title": "Conditioned pain modulation procedure", "text": "A subset of participants completed a conditioned pain modulation (CPM) paradigm as recommended by Yarnitsky et al. 50 For the test stimulus, heat was applied to the thenar eminence increasing at a rate of 1˚C/second and was discontinued by the subject at pain-40 (pain level of 40/100). The temperature required to produce pain-40 was recorded. The conditioning stimulus was cold-water immersion of the contralateral hand for 1 minute, which was reported by most participants as mild to moderately painful. The test stimulus was presented immediately after the conditioning stimulus. A pain inhibition score was calculated as a first minus last temperature divided by first temperature (3100) whereby inhibition was denoted by a negative value and pain facilitation by a positive value, as recommended by expert consensus. 50 "}, {"section_title": "Neuroimaging session", "text": "Magnetic resonance imaging data were collected at the University of Florida's McKnight Brain Institute on the Advanced Magnetic Resonance Imaging and Spectroscopy (AMRIS) facility's Philips (Best, the Netherlands) 3-Tesla scanner using a 32-channel radiofrequency coil. A high-resolution, T1-weighted, turbo field echo, anatomical scan was collected using the following parameters: repetition time 5 7.0 ms, echo time 5 3.2 ms, 170 slices acquired in a sagittal orientation, flip angle 5 8˚, resolution 5 1 mm 3 . Head movement was minimized via cushions positioned inside the head coil and instructions to participants."}, {"section_title": "Brain-predicted age biomarker", "text": "The brain aging biomarker used here was derived using a previously established \"brain-age\" framework. 6 This involved training a machine-learning model to accurately predict chronological age from neuroimaging data in a training cohort composed of 2646 healthy individuals (age mean 5 41.17 6 19.69 years; age range 5 18-90 years; men 5 1333; women 5 1313). This used segmented and spatially normalized T1-weighted MRI scans as the predictor variables in a Gaussian Processes regression, with chronological age as the outcome variable. As per previous reports, 8 model accuracy was high (assessed using 10-fold cross-validation), with a mean absolute error of 4.9 years and a correlation between chronological age and \"brain-predicted\" age of r 5 0.95. Then, using the regression model trained on the full-independent data set (n 5 2646), brain-predicted age values were generated for the n 5 47 participants in the current study. The individual participants' chronological age was then subtracted from this brain-predicted age value to generate a brain-predicted age difference (brain-PAD) score, which was used for further analysis. Neuroimaging data comprising the training data set were obtained via publicly available repositories 8 and were screened according to local study protocols to ensure that they were free of neurological and psychiatric disorders and had no history of head trauma and other major medical conditions. Ethical approval for each initial study and subsequent data sharing was verified for each data repository. "}, {"section_title": "Experimental design and statistical analysis", "text": "Data were entered by one experimenter and checked for accuracy by a blinded experimenter. Quantitative sensory testing data were z-transformed for each modality at each test site and then combined for analysis because of the multicollinearity within thermal and pain modalities. Thus, 4 standardized Z-scores were created for vibratory detection, thermal detection, thermal pain, and pressure pain thresholds that were used for further statistical analysis. The combination of these modalities is appropriate based on the physiological properties of sensory channels. controlling for chronological age and exercise. Sex was entered as a between-subject factor because of previously reported sex differences in predicted brain age 8 and sex-based differences in brain alterations across chronic pain conditions. 24 Chronological age was entered as a covariate because of the wide age range of our sample (60-83) and the known brain changes that occur in old age. Finally, there were significant differences between groups regarding regularly exercising; hence, the variable \"exercise\" was also included as a nuisance variable in all analysis. Because the current study was specifically aimed at comparing brain-PAD between individuals with and without chronic pain, only the main effect of pain group in the main ANOVA model was of interest with a probability of ,0.05 considered statistically significant. Partial eta squared was reported to assess effect sizes where small, medium, and large effect sizes are represented by 0.01, 0.06, and 0.14, 5 respectively, and are also included to assess the magnitude of the group differences. We used Pearson correlations for interval level variables, whereas Spearman correlations were used for ordinal level variables to assess associations between brain-PAD with pain, somatosensory, and psychological variables. Partial correlations were also used accounting for sex, chronological age, and exercise. Effect size magnitudes for correlations of 0.1, 0.3, and 0.5 are reflective of small, medium, and large effects, respectively. 30 For the additional exploratory analyses examining associations between brain-PAD and clinical pain characteristics, somatosensory function, and psychological function, we report both uncorrected (ie, P 5) and corrected probability values (ie, corrected P 5) accounting for multiple comparisons applying the HolmBonferroni method 26 using the calculator by Gaetano. 17 Data analyses were performed using IBM SPSS 25 software."}, {"section_title": "Results", "text": ""}, {"section_title": "Demographics", "text": "Forty-seven older adults ranging in age from 60 to 83 years (mean age 5 70.9 6 6.0; 74.5% female) participated in our study. Figure 2 shows the flow of recruited and enrolled participants in the NEPAL study. The majority of our sample (n 5 33, 70%) reported pain on most days during the past 3 months (ie, chronic pain), and 63% of those reported pain at multiple sites (40% reported pain at 2 different locations). Sample clinical and demographic characteristics are presented in Table 1 . There were no significant differences between the groups in relation to self-reported health and lifestyle characteristics except for exercise participation ( Table 2 ). Image preprocessing, applied to all images, used SPM12 software to segment T1-weighted MRIs into gray and white matter probability maps. These were then spatially normalized using DARTEL nonlinear registration to a custom template in MNI152 space, with 1.5 mm 3 voxels, using 4-mm spatial smoothing. These normalized 3-dimensional images were converted into 1-dimensional vectors, and the gray and white matter vectors concatenated. (C) Machine learning age prediction involved generating a linear kernel by calculating the dot-product of all pairs of image vectors across all participants, resulting in a similarity matrix. The similarity matrix was used as input into a Gaussian Processes regression to predict chronological from the image vectors. The model trained on the full training set was then applied to the 47 participants from the chronic pain study to generate a brain-predicted age value for each participant. (D) Statistical analysis was conducted to evaluate performance of the regression model performance using 10-fold cross-validation. Brain-predicted age difference (brain-PAD) was then calculated for the chronic pain study participants,; whereby chronological age was subtracted from brain-predicted age. Brain-PAD was then used for subsequent statistical analysis of pain-related variables. MRI, magnetic resonance imaging."}, {"section_title": "Brain-predicted age difference and presence of pain", "text": "A 2-way ANCOVA was used to compare brain-PAD between pain groups and sex, controlling for chronological age and exercise. Levene test and Shapiro-Wilks normality checks were performed, and the assumptions met. There was a significant difference in brain-PAD between older adults who reported chronic pain (1.5 6 1.6) vs those who did not (24.0 6 1.9; F [1,41] 5 4.9; P 5 0.033; partial eta squared 5 0.11, ANCOVA; Fig. 3) , which was our main proposed study hypothesis. There was no significant sex difference in brain-PAD (F [1, 41] "}, {"section_title": "Brain-predicted age difference and worst pain characteristics", "text": "Worst pain location within the participants who experienced pain (n 5 33) is depicted in Figure 4 . Brain-PAD significantly correlated with average intensity of the worst pain (r 5 0.464; P 5 0.011; corrected P 5 0.033). However, self-reported worst pain duration (r 5 20.100; P 5 0.606; corrected P 5 1.000) and worst pain frequency during the past week (r 5 0.039; P 5 0.842; corrected P 5 1.000) did not significantly correlate with brain-PAD. Adjusted partial correlations controlling for sex, chronological age, and exercise did not significantly change the results. We compared brain-PAD between individuals reporting receiving treatments (including self-remedies at home) to relieve their worst pain during the past 3 months using a 2-way ANCOVA (between-subject factors: treatment groups and sex, controlling for chronological age and exercise). Levene test and Shapiro-Wilks normality checks were performed, and the assumptions met. Brain-PAD was significantly lower for individuals who reported receiving treatments to relieve their worst pain (23.9 6 1.5) vs those who did not (5. P 5 0.252; Fig. 6 ). Brain-PAD did not correlated with Center for Epidemiologic Studies Depression Scale (r 5 0.122; P 5 0.414; corrected P 5 1.000), PANAS-Negative Affect (r 5 0.033; P 5 0.857; corrected P 5 1.000), TIPI-Extraversion (r 5 20.135; P 5 0.494; corrected P 5 1.000), TIPIConscientiousness (r 5 20.301; P 5 0.120; corrected P 5 1.000), or TIPI-Openness to Experiences (r 5 0.119; P 5 0.819; corrected P 5 1.000)."}, {"section_title": "Brain-predicted age difference and quantitative sensory testing", "text": "Pearson Moment correlations were used to determine associations between brain-PAD and QST variables. Greater vibratory detection thresholds were significantly associated with greater brain-PAD (ie, older brain) (r 5 0.323; P 5 0.033; corrected P 5 0.099; Fig. 7A) . Similarly, greater thermal detection thresholds were also significantly associated with greater brain-PAD (ie,"}, {"section_title": "Brain-predicted age difference and conditioned pain modulation", "text": "Across participants who underwent the CPM procedure (n 5 41), there were no strong correlations between brain-PAD and CPM scores (Pearson r 5 0.132; P 5 0.409). However, among individuals reporting chronic pain (n 5 27), brain-PAD correlated with CPM scores (Pearson r 5 0.346; Fig. 8 ), but this coefficient was not statistically significant (P 5 0.077; corrected P 5 0.148). Finally, we wanted to explore whether there was a difference in CPM depending on a participant's brain-PAD. Individuals with a lower brain-PAD exhibited significantly greater endogenous pain inhibition during the CPM procedure (20.06 6 0.01) compared with those who had a greater brain-PAD (0.01 6 0.02; F [1,25] 5 4.6; P 5 0.044; corrected P 5 0.132; partial eta squared 5 0.17, ANCOVA; Fig. 9 ). Adding sex to the model, decreased the statistical significance of this finding (P 5 0.074; corrected P 5 0.148)."}, {"section_title": "Discussion", "text": "We conducted the first examination of how chronic pain relates to a biomarker of brain aging in community-dwelling older adults. Several important contributions emerged from this investigation. First, older individuals with chronic pain had an \"older\" appearing brain compared with those without chronic pain, and greater average pain intensity was associated with an \"older\" brain. Second, among participants who experienced chronic pain, those who reported having pain treatments during the past 3 months had a \"younger\" appearing brain compared with those who did not report receiving any pain treatments. Finally, an \"older\" brain was significantly associated with decreased somatosensory perception, deficient endogenous pain inhibition, lower positive affect, having a less agreeable personality, and being less emotionally stable. As hypothesized, chronic pain was associated with an \"older\" brain relative to an individual's chronological age. Older pain-free control subjects had on average a brain that looked 4 years younger than their chronological age, whereas the chronic pain group had on average a brain that appeared 2 years older than their chronological age adjusting for important covariates. In a previous study, each extra year of brainpredicted age (ie, having a brain-PAD score of 11) resulted in a 6.1% relative subsequent increase in the risk of death between ages 73 and 80 years. 8 This is consistent with a recent meta-analysis suggesting that chronic pain increases the risk of mortality. 33 Our findings are also consistent with previous chronic pain research that used univariate methods to infer that pain is associated with altered brain structure in individuals aged 25 to 65 years with fibromyalgia 31 and aged 15 to 55 years with temporomandibular disorders. 36 Apkarian et al. 1 also reported global decreases in gray matter in people with chronic low back pain that were significantly greater than the expected age-related decreases alone. Although their sample's age ranged from 20 to 75 years, only 5 participants were between 60 and 75 years. Thus, the inclusion of younger and middle-aged individuals in these previous studies has hindered the direct examination of the interaction of pain with the aging brain, given the known age-related decrements in the brain's gray and white matter. However, our findings directly support several previous preliminary investigations in older adults with low back pain (n 5 8/group) where pain was significantly associated with significant changes in gray and white matter. [2] [3] [4] The variability in brain-predicted age in people with chronic pain was related to some characteristics of their pain experience. An older-appearing brain was associated with greater average intensity of a participant's worst pain, even after accounting for other potential confounders. In addition, individuals reporting they tried or received any pain-relieving treatments during the past 3 months had younger-appearing brains compared with those who did not. This is further supported experimentally, where those participants with \"older\" brains exhibited deficient endogenous pain modulation using a CPM paradigm. In combination, our findings suggest that chronic pain, when not sufficiently relieved, is negatively associated with brain structure above and beyond associations with chronological aging alone. Previously, Rodriguez-Raecke et al. 42 reported gray matter decreases that were reversed when pain was successfully treated in middleaged and older individuals. Future prospective studies including pain interventions should address these questions with greater statistical power. Better vibratory and thermal detection at 2 different body sites (ie, hand and foot) was also associated with a younger brain. Chronological aging is associated with a progressive decrease in vibratory and thermal perception. 23, 32 The presumed underlying causes include skin aging and subsequent reductions in receptor density and superficial skin blood flow. 27 However, animal and human studies also suggest that changes relating to fiber loss and decreased conduction velocity may also be involved. 21, 23, 37, 45, 46 Interestingly, our results suggest that chronic pain may also be associated with perceptual aging where even subclinical decrements in somatosensation may potentially impact the brain and vice versa. Although both vibratory and thermal systems have different components (eg, sensory receptors, spinal cord pathways, thalamic termination sites), they still require the brain for integration and ultimately perception. Future mechanistic studies are needed to determine peripheral vs central contributions of aging in the elderly.\nBrain-PAD was also associated with positive, but not negative, affect in those participants with chronic pain. This is consistent with the idea that positive affect may have a unique role in modulating the pain experience.\n14 Although not currently understood, it is likely that positive affect impacts the pain experience via multiple converging supraspinal mechanisms. First, increased positive affect and associated cognitions may translate into positive expectations for recovery and potential treatment success. 20 Thus, positive affect may also enhance motivation and treatment adherence, 48 which are important predictors of the success of exposure to treatments. 13 In addition, positive affect can enhance extinction learning or inhibitory learning processes, 51 which may further optimize the efficacy of existing treatments. Similarly, a personality characterized by greater emotional stability and agreeableness was associated with a younger appearing brain in those with chronic pain. In the Baltimore Longitudinal Study of Aging, larger orbitofrontal and dorsolateral prefrontal cortices and rolandic operculum were associated with greater emotional stability, and a larger orbitofrontal cortex with higher agreeableness. 28 Moreover, agreeableness was a significant positive predictor of attendance to a physical rehabilitation program after surgery. 25 In general, distinct personality traits are associated with stable individual differences in gray matter volumes. 41 Taken together, our findings underscore the idea that higher order traits, such as personality characteristics, are a feature of large-scale brain structure and function that may be negatively impacted by chronic pain and be sensitive to a brain aging biomarker. Our study has some limitations. Although the sample size for the training set was large, the NEPAL study cohort was relatively small. However, NEPAL participants are well-characterized across multiple characteristics relevant to the study of pain and aging within the biopsychosocial model of pain. 19 In addition, our groups were very similar regarding age-related health comorbidities and overall medication intake, which can make it hard to compare and isolate pain differences. Second, the current analysis was cross sectional; therefore, we cannot determine whether a specific brain-predicted age preceded or was subsequent to pain. From the present findings, directionality or causality cannot be inferred because it is equally possible that brain aging plays a central role for the sensitivity and resilience to many symptoms and disorders associated with biological aging, including chronic pain. Future studies are needed using longitudinal data to determine trajectories of brain aging and how they relate to pain and future health outcomes. Third, the NEPAL participants were high functioning community-dwelling older individuals, who were relatively healthy for their age. They were cognitively normal and free from overt disability and neurological disorders. Given that greater self-reported exercise was associated with positive brain aging in a previous investigation, it is possible that the true association between pain and brain-PAD was underestimated in our sample because everyone reported exercising regularly in our control group. Fourth, our brain aging measure does not provide the anatomical specificity to determine which brain regions are specifically \"aged\" because brain aging is not a uniform process. Future studies including participants with more severe pain and lower levels of physical function are required to further elucidate these associations. In addition, the development of region-specific aging biomarkers will help the field and ultimately clinical practice. Finally, many of our study findings became nonstatistically significant after correcting for multiple comparisons, which amplifies the probability of finding a false-positive result. Future studies are needed to replicate our findings and determine whether our reported associations were the result of chance alone.\nWe present evidence that a clinically relevant neuroimagingderived aging biomarker, previously associated with greater risk of general functional decline and mortality during aging, is similarly associated with the presence and severity of the complex experience of pain in older individuals. Brain-PAD could be a valuable marker of brain health requiring minimal manual training to implement at the individual level with the potential to be estimated in large numbers of people because structural MRI is collected routinely in clinical settings. Our findings also suggest that both pain treatments and psychological traits may significantly mitigate the effect of pain on the aging brain and could further decrease the risk of age-related deterioration and death."}]