[{"section_title": "Abstract", "text": "Objective To develop, replicate, and validate an MRI-based quantitative measure of both cerebrovascular and neurodegeneration in Alzheimer disease (AD) for clinical and potentially research purposes.\nWe used data from a cross-sectional and longitudinal community-based study of Medicareeligible residents in northern Manhattan followed every 18-24 months (n = 1,175, mean age 78 years). White matter hyperintensities, infarcts, hippocampal volumes, and cortical thicknesses were quantified from MRI and combined to generate an MRI measure associated with episodic memory. The combined MRI measure was replicated and validated using autopsy data, clinical diagnoses, and CSF biomarkers and amyloid PET from the Alzheimer's Disease Neuroimaging Initiative.\nThe quantitative MRI measure was developed in a group of community participants (n = 690) and replicated in a similar second group (n = 485). Compared with healthy controls, the quantitative MRI measure was lower in patients with mild cognitive impairment and lower still in those with clinically diagnosed AD. The quantitative MRI measure correlated with neurofibrillary tangles, neuronal loss, atrophy, and infarcts at postmortem in an autopsy subset and was also associated with PET amyloid imaging and CSF levels of total tau, phosphorylated tau, and β-amyloid 42. The MRI measure predicted conversion to MCI and clinical AD among healthy controls.\nWe developed, replicated, and validated an MRI measure of cerebrovascular and neurodegenerative pathologies that are associated with clinical and neuropathologic diagnosis of AD and related to established biomarkers."}, {"section_title": "", "text": "Among postmortem studies of confirmed late-onset Alzheimer disease (LOAD), investigators have frequently observed other types of pathology such as Lewy bodies and cerebrovascular disease. Although the contribution of cerebrovascular disease to LOAD has been debated, 1, 2 cerebrovascular disease is present in up to 70% of patients compared with only 15%-20% of healthy elderly at postmortem examination 3, 4 and mixed pathology is now considered a primary cause of Alzheimer-related dementia. 5 On MRI, LOAD is manifest by medial temporal lobe and cortical atrophy, but white matter hyperintensities (WMHs) and brain infarcts are also frequent. 4, 6 Structural MRI biomarker studies of LOAD often treat cerebrovascular disease and atrophy as distinct entities, but they coexist more frequently than not and the onset of clinical symptoms in LOAD may be jointly determined by both entities. Because there are no confirmed MRI manifestations of Lewy body pathology and because of the high frequency of cerebrovascular disease in patients with LOAD, the first goal of this study was to develop a quantitative MRI measure that combined aspects of neurodegeneration, including hippocampal volume and cortical thickness in several brain regions 7, 8 and cerebrovascular lesions, including WMH and infarcts 9, 10 based on their relationship with episodic memory function, a common presenting manifestation. The second goal was to determine whether this quantitative MRI measure was associated with the clinical and neuropathologic diagnosis as well as biomarkers related to LOAD."}, {"section_title": "Methods", "text": ""}, {"section_title": "Participants", "text": "The Washington Heights-Inwood Columbia Aging Project (WHICAP), a prospective, community-based longitudinal study of aging and dementia in northern Manhattan, 11 provided individuals recruited from Medicare recipients in 3 waves (1992, 1999, and 2009) followed every 18-24 months. Structural MRI scans were acquired in a total of 1,333 participants in 2 waves. The first wave (WHICAP-1) included 769 participants who were scanned beginning in 2005. The second wave (WHICAP-2) included 564 participants who were scanned beginning in 2011. Participants met the following criteria to be included in the current analyses: (1) available quantitative MRI data; (2) complete neuropsychological evaluations performed at the baseline and follow-up visit contemporaneous with the MRI scan; (3) no evidence of dementia at the clinical follow-up visit prior to the scan. All but 158 individuals met these criteria, yielding a sample of 1,175 participants (table 1) . Compared with WHICAP participants not scanned or included, those who underwent MRI were 3 years younger, but similar in sex and years of education; there were no differences in demographic features between participants in the 2 MRI waves. Forty-two WHICAP participants with MRI data died after the MRI and follow-up data had been acquired and underwent autopsy.\nData from 665 participants were also obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI-1) database (adni.loni.usc.edu) and used to test the observations from the WHICAP cohort in an independent sample."}, {"section_title": "MRI", "text": "In WHICAP-1 (n = 690), MRI were obtained on a 1.5T Philips (Best, the Netherlands) Intera scanner. T1-weighted (repetition time 20 ms, echo time 2.1 ms, field of view 240 cm, 256 × 160 matrix, 1.3 mm slice thickness) and T2-weighted fluid-attenuated inversion recovery (FLAIR) (repetition time 11,000 ms, echo time 144.0 ms, inversion time 2,800, field of view 25 cm, 2 number of excitations, 256 × 192 matrix with 3-mm slice thickness) images were acquired in the axial orientation. In WHICAP-2 (n = 485), MRI images were obtained on a 3T Philips scanner. T1-weighted (repetition time 6.6 ms, echo time 3.0 ms, field of view 256 × 256 × 165, 1.0 mm slice thickness) and T2-weighted FLAIR (repetition time 8,000 ms, echo time 332 ms, field of view 240 × 240 × 180, 0.43 mm slice thickness) images were also acquired axially.\nDescription of structural MRI and WMH analyses in ADNI were provided earlier. 12 Details of the validation procedures are provided in the e-Methods (doi.org/10.5061/dryad. m8s3r88) and elsewhere (adni.loni.usc.edu). We used the University of California, San Francisco, cross-sectional analysis (UCSFFSX_11_02_15) for cortical thickness and volumetric measurements."}, {"section_title": "White matter hyperintensities", "text": "In WHICAP, whole-brain WMH volumes were quantified from FLAIR images 13 ( figure 1 ). Briefly, images were skull stripped, and a Gaussian curve was fit to map voxel intensity values. Voxels at least 1.8 and 2.1 SD above the image mean intensity value for the WHICAP-1 and the WHICAP-2 imaging samples, respectively, were labeled. Labeled images were also visually inspected and corrected for false-positive and false-negative errors. The number of labeled voxels was summed and multiplied by voxel dimensions to yield total WMH volumes in cm 3 and log transformed."}, {"section_title": "Infarcts", "text": "T2-weighted and T1-weighted images were used to identify brain infarcts visually by 2 raters following a pathologyinformed algorithm that segregates chronic brain infarcts from perivascular spaces 14 (figure 1). Infarcts were coded if there was a discrete hypointense lesion ≥5 mm in axial diameter on T1-weighted images; confirmation required a discrete hypointense lesion with an associated hyperintense ring observed in FLAIR images in the same location. This algorithm follows the recommendations of the STRIVE criteria 15 to capture lacunes of presumed vascular origin, in addition to incorporating infarcts greater than 15 mm that are more likely superficial or cortical. When the raters disagreed, adjudication was provided by a stroke neurologist. Infarcts were coded as present if one or more were detected and absent if none was detected. Analyses were repeated with the number of infarcts rather than presence or absence of infarcts as the predictor variable, but the findings remained unchanged (data not shown). We did not consider infarct location."}, {"section_title": "Hippocampal volume and cortical thickness", "text": "Hippocampal volume and cortical thickness in Alzheimer disease (AD)-related signature regions 8 were quantified on T1-weighted scans with FreeSurfer. As previously described, 16 these measurements included the mean cortical thickness in the following regions of interest: entorhinal cortex, parahippocampus, inferior parietal lobe, pars opercularis, pars orbitalis, pars triangularis, inferior temporal lobe, temporal pole, precuneus, supramarginal gyrus, superior parietal lobe, and superior frontal lobe (figure 1). FreeSurfer segmentations were visually inspected and manually corrected if necessary by a trained operator.\nNeuropsychological evaluation and diagnostic procedures WHICAP participants were evaluated in either English or Spanish by their choice with validated neuropsychological tests. 17 The primary neuropsychological variable of interest was the memory summary score reflected as the average z scores of 3 indicators from the Selective Reminding Test 18 : immediate recall, delayed recall, and delayed recognition, adjusted for years of education. We focused on memory function because it is typically the cognitive domain most affected by AD.\nA diagnostic consensus panel including neurologists and neuropsychologists adjudicated dementia and its subtypes and used a published algorithm 19 to derive a diagnosis of mild cognitive impairment (MCI) based on standard criteria using neuropsychological, medical, and interview data. The panel was shielded from the MRI scan results."}, {"section_title": "Data analyses", "text": "The overall analytic steps are presented in table 2 and in figure e-1 (doi.org/10.5061/dryad.m8s3r88). Briefly, we first derived a quantitative MRI measure that linearly combined neurodegenerative and cerebrovascular variables based on their association with episodic memory in WHICAP-1. We next applied the same score to the independent WHICAP-2 group to replicate its association. Because of the longitudinal nature of the study, we were able to combine the 2 cohorts to examine differences in the scores among subsequent diagnoses (i.e., controls, MCI, LOAD) and to determine whether the score predicted future conversion to MCI or LOAD among healthy controls. We repeated this analysis after limiting the analysis to the WHICAP-2 cohort only.\nWe examined the association of the MRI measure with neuropathologic features of LOAD and cerebrovascular disease among the 42 participants who came to autopsy. Finally, we computed the MRI score in an independent study (ADNI-1) to test its association with LOAD-specific biomarkers not available in WHICAP and with clinical progression.\nIn the WHICAP-1 cohort (n = 690), multiple linear regression analyses were used with 2 MRI variables reflecting cerebrovascular disease (WMH volume and infarcts) and 2 neurodegenerative variables (hippocampus volume and cortical thickness) as predictors of the memory score (dependent variable). Each participant's raw neuroimaging variables were multiplied by the respective unstandardized β weights generated from the multiple regression analysis. The values were summed to yield a single value for each participant reflecting the linear combination of the cerebrovascular disease and neurodegeneration variables, weighted by their contributions to the memory score, with higher scores indicating more intact memory. The initial regression analysis was repeated with the neurodegeneration and cerebrovascular disease measures entered as separate variables to determine the extent to which inclusion of cerebrovascular disease improved model fit.\nThe newly derived quantitative MRI measure was then repeated in the WHICAP-2 independent cohort (n = 485) using the same β values derived in WHICAP-1. Subsequently, we combined data from the 2 imaging groups and examined differences in the MRI measure among individuals classified as normal controls, MCI, and LOAD at a subsequent clinical follow-up using analysis of variance.\nWe conducted multiple Cox proportional hazards models to examine the association of the MRI measure with clinical conversion from control to MCI or LOAD. Here, we compared models that used the derived MRI measure with those that tested each of its component parts separately (i.e., WMH volume, presence of infarct, hippocampus volume, cortical thickness). To define which model performed better, we compared the latter in terms of −2 log-likelihood. We also employed the glmnet R package 20 to fit an elastic-net regularization path for a Cox model that included all predictors (i.e., WMH volume, presence of infarct, hippocampus volume, cortical thickness, and the quantitative MRI score). The function was run 100-fold for cross-validation and the best value of lambda (such that error is within 1 standard error of the minimum) was used to identify the best set of predictors."}, {"section_title": "Autopsy validation", "text": "Forty-two WHICAP participants with MRI data came to autopsy. We examined the relationship between the quantitative MRI measure and key pathologic findings: neuritic amyloid plaques, neurofibrillary tangles, large and small vessel infarcts, and atrophy. Because measurements were made in several brain regions, the 2 regions with the greatest average severity ratings across participants were selected for the primary autopsy outcome. Multiple regression analysis, correcting for the time interval between MRI and date of death, were conducted to examine the relationship between the quantitative MRI measure and each pathologic outcome separately. We subsequently recalculated the quantitative MRI measure by including only neurodegenerative factors (hippocampal volume and cortical thickness), repeated the regression analyses with this score, and compared the variance explained (R 2 ) between models. We also repeated the analyses with each individual MRI variable entered separately to determine whether the weighted, linear combination in the MRI measure was more strongly associated with pathology than any of its component parts. Neuritic plaques were rated on a 5-point scale ranging from 0 (i.e., no plaques observed) to 4 (i.e., 20 or more plaques observed) regionally. Neurofibrillary tangles were similarly rated on a 5-point scale (0, 0 tangles noted; 4, ≥15 tangles noted). Regional atrophy was rated on a 4-point scale, ranging from absent to severe. The number of brain infarcts on gross examination was recorded.\nAlzheimer's Disease Neuroimaging Initiative ADNI has included data from over 50 sites across the United States and Canada. Study procedures and the follow-up duration for ADNI-1 have been described in the protocol (adni.loni. usc.edu) and in the e-Methods (doi.org/10.5061/dryad. m8s3r88). A standardized and validated MRI protocol for image acquisition was implemented across ADNI sites. 21 MRI data acquisition took place on 1.5T systems. T1-weighted volumetric sequences were acquired in the sagittal orientation. A proton density/T2-weighted fast spin echo sequence was acquired in the axial orientation. Sites included in the ADNI protocol passed rigorous scanner validation tests and scan acquisitions for each subject included a fluid-filled phantom (adni.loni.usc.edu). WMH quantification procedures have been described previously. 12 The T1-, T2-, and proton densityweighted MRI scans were coregistered and skull stripped. 22, 23 After bias field correction, 24 WMH were detected based on corresponding proton density, T1, and T2 intensities; the prior probability of WMH; and the conditional probability of WMH based on the presence of WMH at neighboring voxels. Total WMH volumes were derived by summing and multiplying the number of labeled voxels by voxel dimensions. The methods for infarcts assessment in ADNI are reported in ADNI_UCD_ MRI_Infarct_Assessment_Method_201130609, .pdf file downloadable at adni.loni.usc.edu.\nCSF β-amyloid 1-42 (Aβ1-42), total tau (t-tau), and phosphorylated tau 181 (p-tau181) concentration measurements were made with the microbead-based multiplex immunoassay, the INNO-BIA AlzBio3 RUO test (Fujirebio, Ghent, Belgium), 25 on the Luminex platform. Full procedures can be found within ADNI_UPENN_Biomarker_Master_ Overview_Shaw_Figurski_Waligorska_ Trojanowski_CSF_ 20160704a.pdf, downloadable at adni.loni.usc.edu.\nThe Pittsburgh compound B (PiB)-PET add-on study began its third year of ADNI-1 in May 2009. A total of 103 baseline PiB-PET studies were completed at 14 participating ADNI PET centers in 19 elderly cognitively normal controls (mean age 78 years), 65 individuals with MCI (mean age 75 years), and 19 patients with LOAD (mean age 73 years). 26 Regional assessment of the PiB-PET data involved sampling 13 different brain areas with an automated region of interest (ROI)\nwere defined when the standardized uptake value ratio exceeded a value of 1.50 in the average of the 4 ROIs. This PiB+ cutoff value was based on studies in a large group of cognitively normal controls studied at the University of Pittsburgh. 27 From the initial 871 ADNI-1 participants, data from 665 (76%) were available for analyses. Full demographics for the ADNI sample are reported in table e-1 (doi.org/10.5061/ dryad.m8s3r88). We selected the same 4 MRI variables and applied the β values derived from the WHICAP analysis to derive an identical quantitative MRI measure. We then tested the association between the quantitative MRI measure and the clinical diagnosis, CSF biomarkers, and amyloid-PET imaging measures for LOAD. First, we fit an ordinal regression model with the 3 diagnostic categories at baseline (i.e., healthy control, MCI, LOAD). We then restricted the analyses to participants with MCI, the largest diagnostic group in ADNI. We used generalized estimating equations (GEE) to examine the association between the quantitative MRI measure and rate of change in Clinical Dementia Rating 28 sum of boxes score. Finally, we used linear regression to examine the relationship of the quantitative MRI measure with PET and CSF biomarker values. All ADNI analyses were adjusted for sex, age at baseline, APOE e4 allele, and intracranial volume.\nStandard protocol approvals, registrations, and patient consents All participants provided written informed consent. Ethical approval for this study was obtained from the Columbia University committee.\nParticipants with lower quantitative MRI measures had more neurofibrillary tangle pathology in hippocampal subfields Abbreviation: WMH = white matter hyperintensity. a Unstandardized beta weights were generated based on the independent association of WMH, presence of infarct, hippocampal volume, and cortical thickness with a memory summary score (with education residualized out). b White matter hyperintensity volume was log transformed. "}, {"section_title": "Data availability", "text": "Data are available upon request along with analysis coding. Inquiries should be submitted to the WHICAP data request portal: cumc.co1.qualtrics.com/jfe/form/SV_6x5rRy14B6vpoqN."}, {"section_title": "Results", "text": ""}, {"section_title": "Derivation of the quantitative MRI measure", "text": "The overall model used to test the association between the quantitative MRI measure and memory was significant (R = 0.362, F 4,568 = 21.26, p < 0.001) with little evidence of collinearity between predictor variables (variance inflation factors ranged from 1.06 to 1.13). When each MRI variable was entered separately, the inclusion of WMH and infarcts significantly improved the model fit (R 2 change = 0.015, F = 8.97, p < 0.001). The results of this analysis and the independent relationship between each neuroimaging variable and episodic memory are shown in table 3. The resulting quantitative MRI measure was normally distributed (data not shown). Although the relationship between presence of infarcts and episodic memory was not statistically significant, we elected to retain the variable in the derivation of the MRI measure because it represents a characteristic cerebrovascular measure. However, the relatively weak association with memory still results in the small contribution of infarction to the overall score across individuals.\nRelationship of the quantitative MRI measure to memory and diagnostic outcomes Higher quantitative MRI measure was observed in those with better episodic memory performances in both WHICAP groups with moderate effect sizes (table e-2, doi.org/10.5061/ dryad.m8s3r88). On follow-up, compared with healthy controls, patients with MCI had lower scores, and those with LOAD had the lowest scores (F = 47.45, p < 0.001; all pairwise comparisons: p < 0.001; figure e-2)."}, {"section_title": "Survival analyses", "text": "Among the WHICAP-1 and WHICAP-2 participants, 896 were free of dementia or MCI at the time of the MRI scan. Subsequently, 175 (19.5%) of these participants transitioned to either MCI or LOAD. Full description of the subcohort used for survival analyses is reported in table 1. Lower hippocampus volume, lower cortical thickness, and higher WMH predicted conversion to MCI or LOAD. Presence of infarcts did not predict conversion. Finally, the MRI score predicted conversion to MCI or LOAD and showed the lowest likelihood test score across all the models tested (see table 4 for full results). Because the MRI measure was originally derived in the WHICAP-1 cohort, we repeated the analyses restricting the sample to the WHICAP-2 cohort. We confirmed that the MRI score significantly predicted conversion to MCI or LOAD and fits the best model, as compared with each predictor alone (table 4) .\nThe results from the glmnet analyses are reported in the e-Methods (doi.org/10.5061/dryad.m8s3r88). The optimal λ value (λ = 0.08) and a cross-validated error plot used for the evaluation of our model can be found in figure e-3. Only the quantitative MRI score was included in the final model at the optimal λ value. In figure e-4, we plotted each predictor as a curve that describes the path of its coefficient against the L1-norm of the whole coefficient vector at as λ varies."}, {"section_title": "ADNI-1 analysis", "text": "As in the WHICAP cohorts, participants with MCI or LOAD diagnosis had lower MRI measure scoring (β = −1.49; 95% confidence interval [CI] −1.70 to −1.27, p < 0.001).\nThose with higher MRI measure values also showed higher CSF-derived Aβ42 (β =\nIn the GEE model restricted to participants with MCI, those with higher MRI measures were characterized by slower rate of change of the Clinical Dementia Rating scale sum of boxes (β = −0.84, 95% CI −1.08 to −0.59, p < 0.001). Finally, the quantitative MRI measure was associated with PET-derived amyloid, as a continuous variable (β = −0.14, 95% CI −0.23 to 0.05, p = 0.003) or using a threshold for positivity (PiB+ vs PiB−: 30, 95% CI 0.13 to 0.69, p = 0.004; figure 3 ) Table e-3 (doi.org/10.5061/dryad.m8s3r88) summarizes these results."}, {"section_title": "Discussion", "text": "The main focus of this investigation was the development of a quantitative MRI measure reflecting the joint contributions of WMH, presumed to be an indication of small vessel cerebrovascular pathology, brain infarcts, and neurodegeneration to the clinical and pathologic diagnosis of LOAD. The quantitative MRI measure was derived in a community-based cohort and replicated. Validation of the quantitative MRI measure was completed using autopsy data and clinically proven biomarkers for LOAD. The MRI measure predicted conversion in controls to MCI or LOAD. These results confirm and augment the role of both neurodegeneration and cerebrovascular pathology in LOAD, and suggest the possibility of capturing both in a single valid and reliable MRI-based measure.\nThe MRI measure we developed combined quantitative measures of neurodegeneration, brain infarcts, and WMH, which can reflect cerebrovascular disease, each weighted by their contribution to episodic memory. Because the MRI measure comprised neurodegenerative changes such as cortical thinning and hippocampal atrophy, well-validated MRI biomarkers for LOAD, it is not surprising that it correlated with memory and measures of pathologic findings in LOAD.\nIt is important to point out that in all analyses, the addition of the WMH and brain infarcts also significantly increased the strength of association with episodic memory and with the clinical and pathologic outcomes. The goal here was not to develop a diagnostic biomarker for LOAD but rather a quantitative metric combing the weighted contributions of neurodegeneration and cerebrovascular disease. Despite the fact that the MRI measures were weakly correlated, there was no indication of statistical interaction among them, indicating that each was additive to the overall score. The area under the curve (AUC) for the MRI score and it components was similar (data available in figure e- placing the overall MRI score in the \"good\" category for biomarkers. The mean sensitivity at 89% and specificity at 55% in this article is also comparable to CSF measures of Aβ, tau, and p-tau. 29 In fact, a review of table 5 in that article indicates that each CSF measure (Aβ, tau, and p-tau) yielded similar AUCs as each MRI measure in our study.\nOur study indicated that the MRI measure was also associated with both LOAD neuropathology and related PET and CSF biological markers, an important validation step. These findings augment the observations showing a link between the presence of cerebrovascular vascular risk factors in midlife and LOAD-specific biological markers in later life. 30 While others have considered the contribution of cerebrovascular factors to LOAD risk and clinical presentation to be additive, our study is unique for several reasons. First, the derivation of the MRI score weighted each cerebrovascular and neurodegenerative factor by its relevance to a meaningful cognitive phenotype: episodic memory. Second, the MRI measure combines both cerebrovascular and neurodegenerative factors into a single conceptual framework that closely reflects the mixed pathology of LOAD. 31 Third, we were able to replicate our findings in independent datasets and validate the resulting MRI measure using direct pathologic measurements and LOADspecific PET and CSF biomarkers.\nWhile there is now substantial evidence that cerebrovascular disease plays a role in LOAD, there is considerable debate Figure 3 Scatterplot representing the distribution of the quantitative MRI measure in relation to the PET-Pittsburgh compound B (PiB) average uptake in the Alzheimer's Disease Neuroimaging Initiative-1 cohort about the mechanistic link. Atherosclerosis involving both large and small arteries is associated with a twofold risk of dementia. 32, 33 Endothelial and pericyte damage, inflammatory changes in vessels, atherosclerotic plaques, and microglial activation within endothelial cells can affect brain function and structure. An alteration of the blood-brain barrier, resulting from macrovascular and microvascular damage, can result in oxidative stress, inflammation, and cerebral hypoperfusion, 34 which have been implicated in AD. 35 A neurovascular hypothesis for LOAD has been proposed that posits the presence of cerebrovascular disease leads to a breakdown of the blood-brain barrier, altering the clearance of Aβ and p-tau, which results in neuronal dysfunction, neurodegeneration, and dementia. 36 However, it is also possible that cerebrovascular pathology may be secondary to an alteration in Aβ clearance with Aβ accumulation and neurodegeneration. Thus, a breakdown in the blood-brain barrier or other vessel changes results in cerebrovascular pathology and hypoperfusion, 37 which has been observed with multiple imaging modalities of LOAD. Our study was unable to establish causality between cerebrovascular factors and LOAD, but it does suggest the strong possibility that cerebrovascular factors contribute to the clinical manifestations and neurodegeneration in LOAD.\nWhile the prevalence of LOAD and related dementia has increased due to increase life expectancy, recent studies [38] [39] [40] [41] [42] indicate an inconsistent, but declining trend in incidence rates possibly related to a reduction in cardio-cerebrovascular risk factors. However, adjusting for such a reduction did not completely explain the change in incidence rates. 41, 42 Nonetheless, vascular risk factors and cerebrovascular disease could represent a potential avenue for LOAD risk modification.\nThe current study has limitations. The field strength for the MRI in the first WHICAP imaging group differed from that in the second group (1.5T vs 3.0T), but we were able to subsequently apply the MRI measure from the former group to the latter with good reliability, suggesting minimal effect on the outcome. Differences in field strength may affect measurement precision for the radiologic variables of interest, but should not alter the relationship between the variables and key outcomes. The MRI variables used in the study such as cerebrovascular disease, quantified by volume of WMH and infarcts, and as neurodegeneration, quantified by hippocampus volume and loss of cortical thickness, may lack specificity. For example, WMH could be a reflection of neurodegeneration, 43 although the vast majority of previous work would suggest a vascular origin, and cortical thickness can certainly be affected by cerebrovascular disease. Indeed, increased burden of WMH was associated with risk for familial early-onset AD, and progression of symptoms, and is elevated among individuals with autosomal dominant, fully penetrant mutations prior to symptoms. 13, [44] [45] [46] Our autopsy analyses were on 42 individuals. This limitation is somewhat mitigated by the use of biomarker data from the ADNI cohort. We included frequently used measures of cerebrovascular disease, including WMH and radiologic infarcts. We were unable to include others such as microbleeds and microinfarcts because they were only available in a few participants and we did not have sufficient spatial resolution to identify cortical microinfarcts reliably. The association of infarcts with episodic memory was weak, resulting in a relatively small weighting applied to presence of infarction in the final derivation of the MRI measure. Neurodegeneration and cerebrovascular disease can affect each other, making the 2 processes difficult to separate. However, this possibility does not detract from our work and, in fact, highlights the possibility of synergism between the 2 processes.\nIt is likely that the mixed pathologies of WMH and brain infarcts, reflecting cerebrovascular pathology, and the neurodegeneration manifest by focal atrophy and cortical thinning in LOAD are part of a continuum in which the onset and clinical manifestations of LOAD are jointly determined. This research approach might help to advance our understanding of this complex disease process and will help develop potential targets for treatments or preventive measures that are more precise for the individual patient. "}, {"section_title": "Author contributions", "text": ""}, {"section_title": "Study funding", "text": "Supported by NIH (P01AG007232, R01AG037212, RF1AG054023, R01AG034189, and R56AG034189) and the National Center for Advancing Translational Sciences, NIH, through grant UL1TR001873. The content is solely the responsibility of the authors and does not necessarily represent the official views of the NIH. Data collection and sharing for this project was also funded by the Alzheimer's Disease Neuroimaging Initiative (ADNI) (NIH grant U01 AG024904) and DOD ADNI (Department of Defense award W81XWH-12-2-0012). ADNI is funded by the National Institute on Aging, the National Institute of Biomedical Imaging and Bioengineering, and through contributions from the following: AbbVie; Alzheimer's Association; Alzheimer "}]