[{"section_title": "Introduction", "text": "There are a variety of databases that contain national data on a broad range of information related to higher education. Some are federal databases established to monitor and better understand educational policy and student outcomes. Others are housed at universities with research centers of national scope. While there are currently no databases focused specifically on college students with disabilities, several of the existing databases include datasets that provide information and perspective about the presence and experience of this population of college students. The information reflected in the databases discussed below reflect a variety of survey methods. They gather information from different respondents (e.g., students, parents, or institutions) on different constructs and variables of interest, depending on the purpose and focus of the data collection. Some databases have been revised over time; others are modified to conduct focused inquiries and reports to address current research questions and information needs. This brief highlights several national databases yielding datasets pertinent to students with disabilities enrolled in postsecondary education including technical and vocational schools, and 2-year or 4-year colleges. Information presented in this brief is intended to increase awareness of existing national data related to this population as well as help educators and researchers better understand current methods for tracking information concerning college students and graduates with disabilities."}, {"section_title": "National Databases", "text": "The 11 databases described below reflect data from different points in time for college students with disabilities. They are categorized in three groups: postsecondary education databases (data on current college students) longitudinal databases (data that are gathered at multiple points over time with college graduates), and transition and postsecondary-related databases (data on student outcomes including postsecondary education following high school). For each group of databases, a table is provided highlighting key features of the surveys. Following the tables, we provide a descriptive overview of each survey. Definitions of terms used in the tables include the following: • Target Population: The intended group of study. • Respondents: Individuals or institutions completing the survey instruments. • Record History: The dates of survey administration. • Disability Information: Description of content or items on the survey related to physical, cognitive, or psychological conditions or impairments. Terminology and disability labels vary widely across surveys. The disability types and descriptions included in the tables below come directly from the survey administrators. • Access to Data: Data is typically available in public and/or restricted form. The term public access refers to data that is available in multiple formats to anyone online including students, parents, faculty, researchers, media, or institutional representatives. Restricted access refers to the availability of data beyond what is available to the public and can be accessed by qualified personnel, typically researchers who have undergone specific training. An application for licensure is required to obtain restricted access. • Organization: The university or government agency responsible for managing the database. The population of interest for the BPS is first time students enrolling in higher education programs. The BPS measures student persistence, progress and other characteristics (e.g., work experience, transfer, etc.) at 3 points in time (i.e., end of first year, 3-year and 6-year periods). 1 Participants for the BPS are drawn from the NPSAS 1 (See description below). According to the National Center for Education Statistics, the BPS is used to examine trends such as the impact of financial aid on degree completion and other factors leading to exit from higher education programs. 1 "}, {"section_title": "Postsecondary Education Databases", "text": ""}, {"section_title": "Cooperative Institutional Research Program Freshman Survey (CIRP Freshman Survey)", "text": "The CIRP Freshman Survey is administered to students immediately prior to beginning their first year in college. The survey yields information about incoming students on a range of topics including general demographics, academic performance, student values, and decisions regarding college selection and financing education. 5 Surveys are administered in paper and online formats and commonly administered in large groups settings with a proctor. 5 The CIRP Freshman Survey often serves as a pre-test when combined with other surveys developed by the Higher Education Research Institute such as the College Senior Survey (CSS) and the Your First College Year (YFCY) survey. 4 Individualized reports are provided to universities interested in analyzing results while data from universities nationwide are pooled for broader reporting purposes. 5 Participating universities pay a fee for use."}, {"section_title": "Integrated Postsecondary Education Data System (IPEDS)", "text": "The Higher Education Act of 1965 mandated all institutions participating in federal financial aid programs to report various institutional characteristics. 6 The IPEDS replaced the Higher Education General Education Information Survey (HEGIS). 7 Items on the IPEDS cover 9 main content areas; Institutional Characteristics, Financial Aid, Admission, Human Resources, Graduation Rates, Completions, Enrollment, Finance, and Libraries. 6 Institutional representatives are responsible for reporting on various content areas at three different data collection periods per year. 6 Data is collected from 4-year universities, colleges, and technical and vocational schools. 6"}, {"section_title": "National Postsecondary Student Aid Study (NPSAS)", "text": "The NPSAS examines student characteristics (e.g., work, education, family, and demographic features) and how students finance postsecondary education. 10 Data collected from the NPSAS is used by the federal government to guide policy making regarding financial aid. 10 During the course of its use, the NPSAS has become a functional way to identify student subpopulations and therefore has served as a base of recruitment and establishment of baseline measures for other nationally administered longitudinal surveys including the Beginning Postsecondary Students Longitudinal Study (BPS) and the Baccalaureate and Beyond Longitudinal Study (B&B)."}, {"section_title": "National Survey of Student Engagement (NSSE)", "text": "Data obtained from the NSSE focuses on two main features of quality in higher education; student effort toward academics and student participation in university offered activities. 11 Administration occurs annually at 4-year colleges and universities in the United States and Canada. 11 To date, approximately 5.5 million students have completed the NSSE since its inception in 2000 11 . Following creation of the NSSE, Indiana University has developed other pertinent surveys (e.g., Faculty Survey of Student Engagement (FSSE) and Beginning College Survey of Student Engagement (BCSSE), which currently do not include disability data, but may evolve in terms of including disability related items in the future."}, {"section_title": "Postsecondary Education Quick Information System (PEQIS)", "text": "The PEQIS was designed to collect information quickly about emerging issues, such as planning or policy related questions, that cannot be retrieved in a timely manner by larger surveys administered by the National Center for Education Statistics. 13 A designated sample of predetermined institutions, ranging from 2 to 4-year institutions of higher education (IHEs), is used to collect PEQIS data. 13 Longitudinal Databases of College Graduates The B&B surveys graduates on employment and educational experiences after completion of a bachelor's degree. Particular focus is given to graduates entering the teaching profession in elementary and secondary levels. 14 B&B participants originate from the NPSAS. Content on the B&B includes general information about advanced degree attainment and employment, but also inquires specifically about teacher related trends such as preparation and persistence at employment within the field. 14 "}, {"section_title": "National Survey of College Graduates (NSCG)", "text": "The NSCG tracks a wide range of demographic information (e.g., age, race, citizenship status, disability status), professional and educational information (e.g., employment status, job satisfaction, salary, school enrollment status), and personal information (e.g., marital status, number of children, educationrelated loan debt) on students who have graduated from college with at least a bachelor's degree. 18 Although students representing all disciplines are surveyed, particular focus is given to the science and engineering professions. 16 The survey is administered by the U.S. Census Bureau every other year. 18 Data is used by IHEs to examine existing curricula in science-related fields and businesses to understand and monitor employment trends in various industries and professions. 18 National Survey of Recent College Graduates (NSRCG) The NSRCG targets students who completed a bachelors or master's degree within the prior two or three years of data collection in a science, engineering or health-related field. 20 The survey is conducted on a biennial basis. Sampling occurs in a two-phase process by which institutions are identified using the IPEDS. Then, individual participants who received a degree in the aforementioned fields are selected for participation. 20 Data is used to track trends at a pivotal transition point from college to employment. 20 "}, {"section_title": "Survey of Doctorate Recipients (SDR)", "text": "The SDR longitudinally tracks demographic and employment information about individuals who earned a doctorate degree in a science, engineering, or health field. 21 Data collection occurs every other year. 21 Survey items relate to occupation, education, and general demographic information. Although doctoral recipients must have earned the advanced degree at a U.S. institution, participants living in the U.S. and abroad since degree completion are included during data collection. Primarily, data serves to inform on doctoral level professional outcomes. 21 Transition and Postsecondary Outcomes Databases "}, {"section_title": "National Longitudinal Transition Study-2 (NLTS2)", "text": "The NLTS2 surveys students receiving special education services through the transition process from high school to employment or postsecondary education settings. Items on the NLTS2 focus on education, personal, and vocational experiences including academic achievement and participation in extracurricular or community activities. 22 The NLTS2 also tracks independent living for students transitioning to adulthood which includes residence in postsecondary dormitories or other university related housing. 22 According to the National Center for Special Education Research, surveys were administered and data collected at five different collection periods (referred to as waves) in the following formats; parent and student phone interview, student assessment using subtests of the Woodcock-Johnson III achievement test, survey of school characteristics, survey of school program, survey of teachers, and transcript review. 22 NLTS2 data is used to examine post high school outcomes for students with disabilities. The third version, the NLTS 2012, is currently being implemented. Similar to previous versions, data is collected in waves, with the latest wave occurring in 2014. Data include students with 504 Plans, as well as students without disabilities. For more information on the NLTS 2012 and upcoming reports, please visit http://ies.ed.gov/ncee/nlts/."}, {"section_title": "Conclusions", "text": "Although the list provided is not exhaustive, the databases presented in this brief illustrate that information is being collected at important points in time during a student's educational career. Current databases are examining trends for students with disabilities before entering, during, and after graduating from college. However, there are significant gaps in the size and scope of disability-related data that is gathered. This is likely due to the fact that disability inquiry is supplementary to the main objectives of the databases. For example, while the NPSAS database includes disability status of respondents, the purpose of the database is to report student aid information. Disability specific questions included on most surveys are typically limited to disability status and type. Definitions of disability and the types of disability reported vary widely across the various databases, making it difficult to interpret findings and examine trends across educational contexts. While current data collection provides intriguing snapshots of elements of college access and success for students with disabilities, the field needs more comprehensive information and a more coordinated effort to gather data that can be used to better understand how students with disabilities are faring in higher education."}]