[{"section_title": "Abstract", "text": "Die Dokumente auf EconStor dürfen zu eigenen wissenschaftlichen Zwecken und zum Privatgebrauch gespeichert und kopiert werden.\nSie dürfen die Dokumente nicht für öffentliche oder kommerzielle Zwecke vervielfältigen, öffentlich ausstellen, öffentlich zugänglich machen, vertreiben oder anderweitig nutzen.\nSofern die Verfasser die Dokumente unter Open-Content-Lizenzen (insbesondere CC-Lizenzen) zur Verfügung gestellt haben sollten, gelten abweichend von diesen Nutzungsbedingungen die in der dort genannten Lizenz gewährten Nutzungsrechte. www.econstor.eu The Institute for the Study of Labor (IZA) in Bonn is a local and virtual international research center and a place of communication between science, politics and business. IZA is an independent nonprofit organization supported by Deutsche Post Foundation. The center is associated with the University of Bonn and offers a stimulating research environment through its international network, workshops and conferences, data service, project support, research visits and doctoral program. IZA engages in (i) original and internationally competitive research in all fields of labor economics, (ii) development of policy concepts, and (iii) dissemination of research results and concepts to the interested public.\nTerms of use:\nDocuments in\nIZA Discussion Papers often represent preliminary work and are circulated to encourage discussion. Citation of such a paper should account for its provisional character. A revised version may be available directly from the author. In this paper, we analyze how the share of immigrant children in the classroom affects the educational attainment of native Dutch children. Our analysis uses data from various sources, which allow us to characterize educational attainment in terms of reading literacy, mathematical skills and science skills. We do not find strong evidence of negative spill-over effects from immigrant children to native Dutch children. Immigrant children themselves experience negative language spill-over effects from a high share of immigrant children in the classroom but no spill-over effects on maths and science skills.\nJEL Classification: I21, J15"}, {"section_title": "Introduction", "text": "The large inflow of immigrants to Europe in past decades has drawn considerable attention to the issue of the impact of immigrants on the labor market outcomes of both the immigrants as well as the natives. Now that immigrants are a substantial part of the population, research is shifting towards assessing educational performance of first and second-generation immigrant children sometimes in comparison to the native children. However, the question of whether immigrant children affect native children's educational outcomes remains largely unanswered. Our paper aims to fill this gap by analyzing whether the presence of immigrant children in the classroom affects the educational attainment of native Dutch children. In particular, this paper analyses the impacts on the reading/science/maths test scores as well as students' learning experiences at school (e.g. whether bullied by other students).\nStudying the impacts on multiple subjects separately allows us to measure potentially differential impacts of immigrant students across these three subjects. The theory of multiple intelligences proposed by Gardner (1983) highlights eight types of intelligences, three of which are likely to be of particular importance for the analysis in the present paper. These three include linguistic, spatial, and logical-mathematical intelligences. The linguistic intelligence concerns with the skill to handle speaking, writing and reading activities. The spatial intelligence, on the other hand, is the ability to process incoming information visually. Lastly, the logic-mathematical intelligence is regarding the ability to use logic, abstractions, reasoning, and numbers. Provided that the style of the reading test involves reading a long text and answering in writings, the reading test is likely to mainly measure the first type of intelligence. The science and maths tests are likely to measure all three combined abilities. Although students are typically required to read much shorter phrases in these subjects, answering the questions correctly involve understanding them in the first place. To what extent the linguistic intelligence is required for solving the problems depends on each question as some of them are presented with visual aids."}, {"section_title": "2", "text": "The Dutch experience presents an interesting case study, since the immigrant students in the Netherlands generally come from families with lower education. This is a feature shared by most European countries and as a result, this paper presents relevant findings to a wider European audience.\nStudying immigrant spill-over effects is helpful when exploring policy implications on how to allocate immigrant students to minimize negative impacts or maximize positive impacts of immigrant children on the educational attainment of native children. Similarly, results may highlight the potential importance of providing additional resources to schools or classes with large numbers of immigrant children.\nMoreover, in contrast to the existing literature that focus on students in high-schools and above, our paper studies the spill-over effects among primary school children, i.e. 4th graders (mostly 9 year old children). Investigating the impact among younger students is of an interest, since it allows us to evaluate how native students respond to an exposure to immigrants at a younger age. Moreover, immigrant students may find it easier to assimilate when faced with a new environment at a younger age. If this were the case, we may find a smaller effect compared to those reported in the existing studies. Moreover, the existing evidence is likely to reflect the accumulated impact from the exposure to the immigrant students in the past years. Studying young students allows us to reduce the extent of such an effect.\nAccording to Manski (1993) , association in behavior between two groups may come from exogenous, endogenous, and correlated effects. When we apply this to immigrant children and native Dutch students, we get the following possible associations. Firstly, immigrant students in the Netherlands typically come from families with lower socioeconomic and educational backgrounds (Van Ours and Veenman, 2003) . Dutch students, who are studying with immigrant students, may be negatively affected by the presence of such peers in the same classroom. Secondly, coming from such a disadvantaged background, immigrant students may be more or less motivated to acquire education. Studying with highly motivated peers would positively affect Dutch students, whereas studying with less motivated peers would have a negative effect. Lastly, being exposed to the same studying environment may lead to similar educational outcomes. For example, students are taught by the same teachers and have access to the same resources within the school.\nOur paper attempts to isolate the correlated effect from the exogenous and endogenous effects but does not attempt to establish the contribution of latter effects separately. Instead, it presents evidence of the combined effects.\nOur empirical analysis is based on two waves from two datasets. We and Science Study (TIMSS), which provide information on the maths and science abilities of students in the Netherlands. 1 The outcomes of all three subjects are studied, since differential levels of linguistic requirements across these subjects may lead us to observe varying degrees of peer effects if linguistic barriers experienced among the immigrant students are the cause of the negative peer effects.\nIf immigrant children are randomly allocated to schools across the country, the peer effects can be identified by exploiting the variation in the proportion of immigrant students across schools and classes. However, immigrant families are likely to settle in areas with more immigrants. In fact, Ladd and Fiske (2009) report a high concentration of immigrant students in the four large cities (i.e. Amsterdam, The Hague, Rotterdam, and Utrecht). Furthermore, parents of the native Dutch students are reported to choose schools with limited numbers of immigrant students (Ladd, Fiske, and Ruijs, 2010) . Since immigrant households in the Netherlands typically suffer from lower socioeconomic and educational backgrounds, estimates of negative impacts of immigrants on native students may simply reflect selective school enrollment of both immigrant and native students. To avoid this selectivity problem, our paper identifies the peer effects by controlling for the unobserved school characteristics by estimating a school fixed effects model. This identification strategy assumes that once school specific characteristics are controlled for, students are randomly allocated to a particular class within a school.\nThe remainder of this paper is organized as follows. Section 2 gives an overview of previous studies. Section 3 gives an overview of immigration into the Netherlands and discusses characteristics of the Dutch educational system in relation to immigrant children. Section 4 presents the data used for the analysis and discusses the set-up of the analysis. Section 5 describes the parameter estimates. Section 6 concludes."}, {"section_title": "Previous studies", "text": "There are several papers on the topic of educational spill-over effects between immigrant children and native children. Hoxby (1998) and Borjas (2004) present US evidence of immigrant crowding out effects on the native students in the graduate and postgraduate schools finding significant reductions in the native students' college and graduate school enrollment. Both studies investigate the influence of the immigrant students on the native students through increased competition for places in further education.\nOther US studies focus on peer effects due to interactions with immigrant students in the neighborhood and their impact on academic performance of native students (Betts, 1998; Betts and Lofstrom, 2000) . Using the 1980 and 1990 US Census data, Betts (1998) estimates the effect of immigrant students on the probability of high school graduation of American born minorities aged between 19 and 25. A related paper by Betts and Lofstrom (2000) studies the impacts on total years of schooling among both minority and native individuals aged 24 and 30. In addition to the 1980 and 1990 Census data, Betts and Lofstrom (2000) also include 1970 Census data to study a longer time span. In both papers, the impact of immigrants is estimated using the proportion of immigrants in each state at the time when the census was carried out. 2 After controlling for state and year fixed effects, these papers each report a significantly negative impact of immigrants on the high school completion probability and the years of education, respectively. Betts and Lofstrom (2000) address the potential problem of the measurement error caused by individuals moving across states after completing education by only using a subsample of individuals who claim to have stayed in the same state five years prior to the Census. Since their identification strategy exploits the exposure to the immigrant students within the state of residence, this is a valid concern. However, both Betts (1998) and Betts and Lofstrom (2000) are likely to face an additional measurement error. In particular, due to the choice of the age groups in these papers, American individuals are likely to have completed high school or college education up to 7 years prior to the selected Census years. Using the proportion of immigrants at the time of the Census involve making an implicit assumption that the proportion of immigrants in each state is fixed and relevant even for the periods prior to the Census years.\nThere are three papers from outside the US (Gould, Lavy, and Daniele Paserman, 2009; Brunello and Rocco, 2011; Jensen and Rasmussen, 2011) . Gould, Lavy, and Daniele Paserman (2009) use the large influx of Jewish immigrants from the former Soviet Union to investigate peer effects on the native Israeli students. They evaluate the impact of exposure to immigrants in the 5th grade on the final matriculation exam pass rate, which is a prerequisite for proceeding to the university level. They, therefore, study the long-term peer effects of immigrants on the native students. Although these immigrant students come from relatively highly educated families, they faced economic difficulties. As a result, they may have chosen a particular region for settling down where the living expenses were low. In order to combat the potential selection bias stemming from such self-selection of immigrants to particular regions of Israel, they exploit the random allocation of students to the 5th grade once the numbers of immigrants in the 4th and 6th grades are controlled for. They find that the strong negative impact of the exposure to the immigrant students diminishes once they address the selection bias, although the results remain marginally significant. Moreover, they show 6 that the negative impact is strongest among students attending in classes with lower concentration of immigrant students and attribute this result to potential ease that the teachers face in assisting immigrant assimilation once there are more immigrant students in the class. Brunello and Rocco (2011) present cross country evidence from 27 European and Anglo-Saxon countries by using the 2000, 2003, 2006 and 2009 Program for International Student Assessment (PISA). PISA assesses the cognitive abilities (reading, mathematics, and science) of the 15 year old students in OECD member countries. They aggregate the micro-level data to the country level in order to avoid the selection bias. They also include the country fixed effect to control for the selection bias at the country level.\nThey find a significant but small negative impact of immigrant students on native students. The main problem they face is the small sample size as a result of the data aggregation. Therefore, they pool test results from all three subjects. This requires an assumption that the test scores from all three subjects are comparable. However, such an assumption is unlikely to hold due to differential skills required in solving questions from the three subjects.\nFinally, one piece of evidence from Europe is given by Jensen and Rasmussen (2011) . They study the immigrant peer effects in Denmark using the 2000 and 2005 PISA and Danish administrative register data. They address the non-random allocation of immigrant families to certain regions by using the population size of the residence of children as an IV. They find that a high concentration of immigrant students in school negatively affect the reading and maths test scores of native Danish students even after controlling for the potential selection of immigrants to certain regions.\nOur paper contributes to the existing literature on immigrant spill-over effect on the educational attainment of native children in three ways. Firstly, we contribute to the relatively scarce European evidence on the issue. Unlike the Israeli experience presented by Gould et al. (2009) , the immigrant students in the Netherlands generally come from families with lower education. This is a feature shared by most European countries and as a result, 7 may provide more relevant findings for the European situation. Secondly, our paper uses two micro-level data, the Progress in International Reading Literacy Study (PIRLS) and Trends in International Mathematics and Science Study (TIMSS) in order to study the peer impacts on various subjects.\nOur paper addresses the endogenous selection problem of immigrant students by exploiting the data availability of multiple classes within the same school. In doing so, our paper avoids the small sample problem faced by Brunello and Rocco (2011) . Thirdly, in contrast to the existing literature, our paper investigates the peer effects among young students (i.e. fourth graders). Studying the impact among younger students is of an interest, since it allows us to evaluate how the native students respond to exposures to immigrants early on. Moreover, immigrant students may find it easier to assimilate when exposed to the native environment at a younger age. If this were the case, we may find smaller effect compared to those reported in the existing studies. Moreover, aside from the results in Gould et al.(2009), estimates in all the other papers are likely to reflect the accumulated impact from the exposure to the immigrant students in the past years. Studying young students allow us to reduce such influences. (Ersanilli, 2007; Lucassen and Penninx, 1997) . Finally, there has been a continuous flow of immigrants from the Netherlands Antilles over the past years.\nThe major hiring of guest workers from Southern Europe, Yugoslavia, and particularly from Morocco and Turkey started as a result of the boom of the Dutch economy in the 1960s and its subsequent shortages of unskilled workers in the labor market (Van Ours and Veenman, 1999) . The number of these immigrants reached up to approximately 235,000 in 1970 (Penninx, Schoorl, and Van Praag, 1994) . The recruitment stopped in 1973, but further migration from Morocco and Turkey continued even in 1980s, which were mainly for the purpose of family formation or unification (Ersanilli, 2007) .\nIn addition, political refugees and asylum seekers are another group of immigrants. After the fall of the Soviet Union, many immigrants from the eastern Europe moved to the Netherlands. In the more recent years, economic and political crisis has increased immigrants from diverse backgrounds such as Iraq, Iran, Afghanistan, and Somalia.\nThe number of immigrants in the Netherlands by country of origin in 1996 and 2011 is given in Table 1 "}, {"section_title": "The Dutch educational system", "text": "The highest concentration of immigrant households are found in the four largest cities, i.e. Amsterdam, the Hague, Rotterdam, and Utrecht. This has two important implications for the purpose of the analysis in this paper.\nFirstly, Dutch parents in large cities have more schools from which to choose. This implies that there is a higher probability of racial and socioeconomic segregations in these cities. Secondly, schools located in the four large cities were likely to have received more funding from the Dutch government, at least until 2006. The Weighted Student Funding (WSF) was in operation between 1985 until 2006 in order to promote equal educational quality among schools and also to assist schools with a larger number of disadvantaged students (Ladd and Fiske, 2009) . The scheme calculates a weighting index for each school by taking account of the number of immigrant students as well as disadvantaged Dutch students. This index ranges between 1 and 1.9, where schools with an index of 1 until 1.09 were not given any extra funding.\nSchools with the index above 1.09 were offered the extra funding, whose amount reflected the index. For example, those with 1.9 received 90 percent more funding per student. The system is made slightly more complex by the fact that money was not directly paid to each school but rather was given to school boards that had the control over the distribution of the allocated funding across the schools. Nonetheless, Ladd and Fiske (2009) show evidence that extra funding was allocated mainly to schools in the four largest cities. The implication of such a treatment is that school principals may have allocated additional resources towards classes with larger numbers of immigrant students. If this is the case, and classes with a high share of immigrant children were being taught by more able teachers or if these classes had better teaching resources, the size of the potentially negative peer The samples of students in both surveys were selected using a two-stage sampling design. In the first stage, at least 150 schools were selected from each country using a probability-proportional-to-size sampling scheme. In the second stage, one or multiple fourth grade classes were randomly sampled from each of the selected schools.\nThe dependent variable is the measure of students' abilities to read or solve mathematical and scientific questions. To ensure that the tests assess the students' full abilities without overburdening the participating students, IEA designed the test materials for all three subjects in the following manner. Firstly, the material was divided into 8 blocks. Each of these blocks lasted 40 minutes and they were distributed across ten test booklets. Every student was asked to complete one of these test booklets within 80 minutes.\nDue to the design of these tests, each student only completes a fraction of the assessment materials. As a result, the raw scores do not measure the full ability of the students. Instead, plausible values are reported in PIRLS and TIMSS, which use multiple imputation to reveal how the students would have performed should they complete the entire tests (see, for example, Gonzalez and Kennedy (2003) for more details on the calculation of the plausible values).\nA similar set of covariates are available from both PIRLS and TIMSS.\nFor example, available school characteristics from these two datasets include class sizes and the number of days spent for instructions of each subject, and the sizes of population of the regions in which schools are located. Teachers' years of experience and their age and gender are also available from both datasets. At the individual student level, PIRLS and TIMSS also hold information on age and gender of students and the number of books at home.\nThere are two differences in the information available from these datasets, however. More specifically, the highest educational qualifications of parents are only available in PIRLS. As a result, the information on the number of books at home is used as a proxy for the parental educational background. 4\nAnother concern with both datasets is that the participating schools were allowed to exclude some students with severe linguistic problems. Although they are asked to include at least 95 percent of the students in the survey, this selection is likely to eliminate the group of students who are most likely to negatively influence their peers. Our estimates are, therefore, likely to be positively biased. Additional estimates are presented as a sensitivity check to investigate the extent of this problem. (4)). Table 2 also shows the socioeconomic backgrounds of Dutch students by the proportion of immigrant students in the same classroom."}, {"section_title": "Preliminary analysis", "text": "The first four columns indicate that the Dutch students who attend schools with a limited number of first-generation immigrant students come from households with higher levels of education. This is reflected in all three measures of the socioeconomic characteristics (i.e. parental education, number of books at home, and percentage of disadvantaged students in each school).\nAs the proportion of immigrant students increases, however, the educational attainments of Dutch households decline. Interestingly, such socioeconomic segregation is not observed among the second-generation immigrant students (columns (5)- (8)).\nTo investigate whether there is a relationship between the share of immigrant children in a classroom and the educational attainment of Dutch children the graphs on the left-hand side in Figure 1 each present a scatter plot of reading, mathematics, and science test scores against the percentages of immigrant students in each class. Clearly for each of the educational skills there is a negative correlation with the share of immigrant children. However, this negative correlation may be driven by selective choice. It could be that parents of children with higher educational skills have their children going to schools with a low percentage of immigrants.\nThe identification strategy employed in our paper assumes that the allocation of students is random once school specific characteristics are con-trolled for. The graphs on the right-hand side of Figure 1 plot the differences in the relevant test scores against the percentage point differences of immigrant students across classes within the same school. Comparing the left-hand side plots to the corresponding plots on the right hand side of Figure 1 reveal that the negative spill-over effects of the first-generation immigrant students disappear once percentages of immigrant students are differenced across classes. This conclusion applies to all subjects and suggests that once school differences are taken into account there is no longer a correlation between educational skills and the share of immigrant children in the classroom."}, {"section_title": "Set-up of the analysis", "text": "If students are randomly allocated to schools, we can identify spill-over effects of immigrant studies by estimating the following equation using Ordinary Least Squares:\nwhere y ics denotes the test score for the ith Dutch student in cth class and sth school, x ics captures the Dutch students' individual and family characteristics and C cs represent classroom characteristics. The key variable for the identification of the spill-over effects is the M cs , which is the percentage of first or second-generation immigrant students in each class. The coefficient δ would capture both the immigrant students' influence on the native students due to the immigrant students' potentially unfavorable family background as well as their better/worse effort to learn during the class. ics = α s + µ cs + u ics , the error term is composed of three terms: α s reflects the school specific effect, µ cs captures any classroom specific characteristics that are not controlled in the model and u ics is the random error term.\nInvestigation of the immigrant spill-over effects, however, is more complex in the absence of the random student allocation assumption. As indicated before, immigrants in the Netherlands settle mainly in the four large cities. Moreover, native Dutch parents are also observed to place their children in schools with low concentration of immigrant children (Ladd, Fiske, and Ruijs, 2010) . These pieces of information suggest that the students are selectively allocated to schools. As a result, both α s and µ cs are likely to be correlated with the immigrant proportion variable M cs , leading the OLS estimator to be biased and inconsistent.\nIn order to overcome this endogeneity problem, the present paper controls for the school fixed effect. The main identification assumption requires that once school specific characteristics are controlled for, students are allocated to each class randomly within a school (i.e. µ cs = 0). The identification strategy used in this paper closely follows that of Ammermueller and Pischke (2009) . 5 This assumption, however, may be violated if school principals allocate more funding and resources to classes with large numbers of immigrant students. In such cases, the estimated impact will not only reflect the exogenous and endogenous effect but also part of the correlated effect.\nSection 5.2 conducts a sensitivity analysis that addresses the issue of the ability based class formation of students. However, before we move on to the main analysis, (1) and (2) show the impact on PIRLS reading test scores whereas the columns (3)- (4) and (5)- (6) Turning to the rest of the estimates in Table 4 , female students perform better in reading tests and worse in maths and science. The \"number of 6 Since there are at most 12 years differences between two years of datasets, the characteristics or the composition of immigrants may have changed over time.\n7 The impact on the reading test scores is estimated using 2001 and 2006 PIRLS data whereas 1995 and 2007 TIMSS datasets are employed for the estimation of the peer effects on the maths and science scores. Only the 2007 TIMSS datasets contain similar and more detailed school, and class-level characteristics.\nbooks at home\" variables, on the other hand, seems to capture the education background of parents rather well. More specifically, the more books they have at home, students perform better in their tests. The rest of the estimates generally present mixed results and are mainly insignificant. For example, older students sometimes perform better than their younger peers, and at other times, they perform worse. Teachers' teaching experiences seem to matter little in most years but for 2006 reading and 2007 science test scores. Older teachers enhance students' reading scores, but younger teachers seem to be better at teaching maths and science classes. Table 5 reports results from various sensitivity analyses. Row (a) presents the baseline estimates, which are taken from the first row of Table 4 One of the concerns discussed in Section 4.1 is that the immigrant students may be underrepresented in both PIRLS and TIMSS, since schools were allowed to exclude students who suffer from severe linguistic problems."}, {"section_title": "Sensitivity analysis", "text": "Although 95 percent of students from each school were requested to take parts in these surveys, such a measurement error problem is likely to cause the estimates to be positively biased. To check if this poses a severe prob-lem, an additional measure of immigrant proportion is calculated. More specifically, using the 'class size' variable available in PIRLS, the number of immigrant students are calculated to be the difference between the class size and the number of Dutch students in each class. 8 The estimates from row (g) suggest that the immigrant students positively and significantly affect Dutch students' reading scores in 2001, but not in 2006. The estimates, therefore, suggest a similar conclusion to that of the baseline estimates.\nThe potential grouping of classes by ability is another concern. This is likely to undermine the identification strategy employed in this paper, which requires that the students are randomly allocated to classes once the school The discussion in Section 3.2 highlights severer segregations of Dutch students from immigrants in larger cities. Row (i), therefore, presents estimates without schools located in cities with more than 500,000 residents to limit the size of the bias stemming from the segregation of students.\nThe presented results, however, do not alter our conclusions from earlier estimates.\nFinally, row (j) reports the peer effects of immigrant students on themselves. The results for the reading test scores indicate significant negative impacts of immigrant students on themselves. However, the same conclusion does not hold for the science and maths test scores. For these two subjects, more immigrant students have positive and sometimes significant impacts.\nSo far, we have focused on the test scores impact of studying with immigrant students in the same classroom finding no significant effects. Our data also allow us to investigate whether immigrant students affect school learn-ing environment of native students. Table 6 presents evidence on whether students encounter difficulties in learning places by looking at how the incidence of bullying is influenced by the share of immigrant students in a classroom. The dependent variables are dummy variables that denote negative experiences at schools reported by students. These experiences include whether students were ever bullied at school, if their possessions were ever stolen, if the students ever felt left out or made fun of, and if they were ever hit by other students. The estimates from the linear probability models show that the native Dutch students do not experience any influences of immigrant students, which is in line with the effects on test scores."}, {"section_title": "Conclusions", "text": "Many immigrants have entered European countries in the past decades.\nInitially, most immigrants were workers attracted by the favorable economic circumstance, entering the labor markets to fill vacancies that were difficult to fill by native workers. Later on, immigrants entered Europe because of family reunion, family formation or because they were seeking asylum. A major identification problem when establishing potential educational spill-over effects is related to student selection into schools. If schools with a relatively high share of immigrant children attract Dutch children of which the educational skills are different from schools with a relatively low share of immigrant children, we might erroneously conclude that the presence of immigrant children has negative spill-over effects on Dutch children. We solve this potential selectivity by investigating within school variation. We compare the educational attainment of Dutch children with different shares of immigrant children in classrooms within the same school. Although within the same school there may still be a selectivity issue because resource allocation across classes may depend on the share of immigrant children within each class, we do not find evidence for such within school resource allocation.\nOverall, we do not find strong evidence of significant negative spill-over effects on the test scores from immigrant children to native Dutch children.\nImmigrant children themselves experience negative language spill-over effects from a high share of immigrant children in the classroom but no spillover effects on maths and science skills. From our findings we conclude that for native Dutch students there is no urgent need to redistribute immigrant children more evenly across classrooms as their educational attainment is not affected by the presence of these children. However, immigrant children themselves might benefit from such reallocation as their language skills might improve once they can interact more intensely with the native Dutch children. Alternatively, more education resources might be used to stimulate language skills development among immigrant children. The samples of students in both surveys were selected using a two-stage sampling design. In the first stage, at least 150 schools were selected from each country using a probability-proportional-to-size sampling scheme. In the second stage, one or multiple fourth grade classes were randomly sampled from each of the selected schools.\nTables 7 and 8 each presents summary statistics for the observations from the Netherlands. Table 7 Table 8 do not reveal any systematic differences across schools with different proportions of first-generation immigrant students. Although evidence is somewhat mixed, further analysis is conducted in Section 5 by excluding schools from the large cities in order to eliminate the effect of a potentially greater degree of segregation as well as differential allocations of teaching resources. Table 6 : The peer effect of immigrant students on the school learning environment of Dutch and immigrant students Note: This table presents the estimated peer effects of immigrant students on the school learning environment. Columns (1)- (8) show the impacts on the Dutch students whilst columns (9)-(16) illustrate the effect on the immigrant students. The dependent variables are the variables that capture negative school experiences. The independent variables included are identical to those in "}]