[{"section_title": "Abstract", "text": "Cerebrospinal fluid (CSF) measures of Ab and tau, Pittsburgh Compound B (PIB) imaging and hippocampal atrophy are promising Alzheimer's disease biomarkers yet the associations between them are not known. We applied a validated, automated hippocampal labeling method and 3D radial distance mapping to the 1.5T structural magnetic resonance imaging (MRI) data of 388 ADNI subjects with baseline CSF Ab 42 , total tau (t-tau) and phosphorylated tau (p-tau 181 ) and 98 subjects with positron emission tomography (PET) imaging using PIB. We used linear regression to investigate associations between hippocampal atrophy and average cortical, parietal and precuneal PIB standardized uptake value ratio (SUVR) and CSF Ab 42 , t-tau, p-tau 181 , t-tau/Ab 42 and p-tau 181 /Ab 42 . All CSF measures showed significant associations with hippocampal volume and radial distance in the pooled sample. Strongest correlations were seen for p-tau 181 , followed by p-tau 181 /Ab 42 ratio, t-tau/Ab 42 ratio, t-tau and Ab 42 . p-tau 181 showed stronger correlation in ApoE4 carriers, while t-tau showed stronger correlation in ApoE4 noncarriers. Of the 3 PIB measures the precuneal SUVR showed strongest associations with hippocampal atrophy."}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD), the most common neurodegenerative disorder, is becoming increasingly prevalent among those 65 years and older. Confronted by the grim outlook of tripled AD prevalence by year 2050 (Hebert et al., 2001) , scientists are relentlessly working toward earlier diagnosis and disease-modifying strategies that could one day allow primary or secondary disease prevention.\nEarly and presymptomatic diagnosis can be established by the use of biomarkers. Biomarkers are complementary to the use of clinical outcomes in clinical trials and could one day be used as surrogate endpoints. Good biomarkers should accurately reflect disease progression, predict clinical measures, and demonstrate change with therapeutic interventions that correlate with clinical improvement (Cummings 2009) .\nCerebrospinal fluid (CSF) measures of amyloid beta protein (A␤) and CSF tau, as well as Pittsburgh Compound B (PIB) imaging and hippocampal atrophy are four established AD biomarkers. They all reflect different aspects of AD pathophysiology. A␤ made of 42 amino acids (A␤ 42 ) has been most clearly associated with AD pathogenesis. A␤ is an unstable peptide that tends to polymerize. In its monomeric form, A␤ is soluble and readily measured in the CSF. In AD, increased production, decreased clearance, or a combination of both cause significant increases in the total amount of A␤. After polymerization, A␤ is sequestered in the brain tissue in the form of amyloid plaques comprised of insoluble fibrillar amyloid. Presumably because of this sequestration, CSF A␤ 42 levels are low in persons with AD (Blennow and Hampel 2003) . Low CSF A␤ 42 has demonstrated 90%-96% sensitivity and 77%-80% specificity in discriminating AD from cognitively normal elderly (NC) (Andreasen et al., 2001; Galasko et al., 1998; Shaw et al., 2009 ) and 59%-79% sensitivity and 65%-100% specificity for predicting progression to AD dementia in subjects with mild cognitive impairment (MCI) (Hampel et al., 2004; Mattsson et al., 2009) . Also, the A␤ 42 /A␤ 40 ratio was recently reported to have 86% sensitivity and 60% specificity for detecting incipient AD in MCI (Brys et al., 2009) . Although low CSF A␤ 42 is a good indicator of AD pathology, CSF A␤ 42 levels do not correlate well with cognitive measures (Wallin et al., 2006) .\nTau is a microtubule-associated stabilizing protein which when hyperphosphorylated detaches from the microtubules and disrupts axonal transport. Similar to A␤, tau also tends to aggregate in AD and forms intraneuronal neurofibrillary tangle lesions. Presumably as cells die tau is released into the interstitium and is transported to the CSF. Phosphorylated tau (p-tau) is similarly released from tangles and appears in the CSF. CSF total tau (t-tau) and p-tau are significantly elevated in subjects with AD (Andreasen et al., 2001; Blennow et al., 1995; Clark et al., 2003; Galasko et al., 1998) . High CSF t-tau shows 70% sensitivity and 92% specificity in differentiating AD from normal controls (NC) and 83%-86% sensitivity and 56%-90% specificity for predicting progression to AD in MCI (Hampel et al., 2004 ). p-tau shows 68% sensitivity and 73% specificity in differentiating AD from NC and 73%-84% sensitivity and 47%-88% specificity in diagnosing incipient AD in the MCI stages (Brys et al., 2009; Mattsson et al., 2009) . Unlike A␤ 42 , t-tau and p-tau have been associated with cognitive decline (Buerger et al., 2002 (Buerger et al., , 2005 Riemenschneider et al., 2002; Wallin et al., 2006) . Research reports by several groups suggest that a combined biomarker measure based on both A␤ 42 and tau may improve diagnostic accuracy (Galasko et al., 1998; Hansson et al., 2006; Mattsson et al., 2009; Shaw et al., 2009; Visser et al., 2009) .\nRecent advances in molecular imaging have allowed us to visualize amyloid deposition in vivo, in subjects with AD, using positron emission tomography (PET). Of the available amyloid tracers PIB has been widely used as an AD biomarker although other compounds are also being simultaneously developed Small et al., 2006) . The scientific evidence for high cortical PIB retention in AD and low retention in the majority of NC subjects is compelling Mintun et al., 2006) . PIB retention in amyloid-rich regions has been reported to be high in postmortem specimens (Ikonomovic et al., 2008; Thompson et al., 2009) . A bimodal distribution has been described in MCI with some subjects showing AD-like and others NC-like PIB retention patterns (Kemppainen et al., 2007; Pike et al., 2007) . Compared with low PIB retention, high retention conveys substantially higher risk for progression from MCI to AD dementia (87% vs. 7%; Okello et al., 2009 ) and for cognitive decline in NC (hazard ratio ϭ 4.9; Morris et al., 2009 ). Although PIB binding shows the expected correlation with cognitive function (Jack et al., 2008b Mormino et al., 2009; Pike et al., 2007; Tolboom et al., 2009) , longitudinal PIB studies surprisingly have suggested that PIB retention levels off in the dementia stages (Engler et al., 2006) . Finally PIB PET has demonstrated better performance than conventional fluorodeoxyglucose (FDG) PET imaging with greater effect sizes and improved spatial resolution for differentiating AD from NC subjects (Ziolko et al., 2006) .\nHippocampal atrophy is the most established AD structural imaging biomarker. Hippocampal atrophy is seen in normal aging but is greatly accelerated and steadily progressive in AD (Jack et al., 1997 (Jack et al., , 1998 (Jack et al., , 2000 . Hippocampal atrophy shows a strong correlation with cognitive decline (de Toledo-Morrell et al., 2000; Fleischman et al., 2005; Mortimer et al., 2004) as well as with AD pathologic markers such as neuronal and neurofibrillary tangle counts and Braak and Braak pathological staging (Bobinski et al., 1995 (Bobinski et al., , 1997 Schonheit et al., 2004; Zarow et al., 2005) . Using an advanced 3-dimensional (3D) hippocampal mapping technique our group has demonstrated that hippocampal atrophy can predict which MCI subjects would progress to AD during 3-year follow-up (Apostolova et al., 2006b ) and that it can detect atrophic changes in cognitively normal elderly 3 years prior to diagnosis of MCI and 6 years prior to diagnosis of AD dementia .\nFurther advancing biomarker development several research groups have taken the next step toward surrogacy validation (Cummings, 2009 ) by investigating whether various biomarkers correlate with each other. Region of interest (ROI) studies have reported that CSF p-tau has a stronger association with baseline hippocampal volume and longitudinal volume change compared with CSF t-tau Henneman et al., 2009) , while CSF A␤ 42 shows either a weak (Henneman et al., 2009) or lack of an association ) with hippocampal volumetric measures. Negative associations between global PIB retention and ROI-measured hippocampal volume were independently reported in a large NC sample , in a relatively large pooled sample consisting of NC, MCI, and AD subjects (Jack et al., 2008b) and in small samples of MCI and NC (Mormino et al., 2009) , no association in AD subjects was also reported (Mormino et al., 2009 ).\nHere we aimed to uncover the 3D hippocampal regional associations between several CSF and 1 amyloid imaging biomarker in a large sample from the Alzheimer's Disease Neuroimaging Initiative (ADNI). As CSF tau is thought to be an indicator of neuronal injury we postulated that CSF tau measures will have stronger associations with hippocampal volume and radial distance than CSF A␤ 42 . We also hypothesized that the brain parenchymal amyloid measure-PIB PET-will show stronger association with structural hippocampal changes than the CSF amyloid measure-a peripheral measure that while being correlated with amyloid load in the brain shows an imperfect correlation. As previous studies have reported effects of ApoE4 genotype on hippocampal volume (Fleisher et al., 2005; Mueller and Weiner, 2009; Mueller et al., 2008; van de Pol et al., 2007) , CSF Abeta and PIB binding (Morris et al., 2010) in addition to examining the association in the pooled sample we also modeled the effects in APoE4 carriers and noncarriers separately."}, {"section_title": "Methods", "text": ""}, {"section_title": "Subjects", "text": "Data used in the preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (www.loni.ucla.edu/ADNI). The ADNI was launched in 2003 by the National Institute on Aging (NIA), the National Institute of Biomedical Imaging and Bioengineering (NIBIB), the Food and Drug Administration (FDA), private pharmaceutical companies and nonprofit organizations, as a $60 million, 5-year public-private partnership. The primary goal of ADNI has been to test whether serial magnetic resonance imaging (MRI), positron emission tomography (PET), other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of mild cognitive impairment (MCI) and early Alzheimer's disease (AD). Determination of sensitive and specific markers of very early AD progression is intended to aid researchers and clinicians to develop new treatments and monitor their effectiveness, as well as lessen the time and cost of clinical trials. The Principle Investigator of this initiative is Michael W. Weiner MD, VA Medical Center and University of California-San Francisco. ADNI is the result of efforts of many coinvestigators from a broad range of academic institutions and private corporations, and subjects have been recruited from over 50 sites across the US and Canada. The initial goal of ADNI was to recruit 800 adults, ages 55 to 90, to participate in the research-approximately 200 cognitively normal older individuals to be followed for 3 years, 400 people with MCI to be followed for 3 years, and 200 people with early AD to be followed for 2 years. For up-to-date information see www.adni-info.org.\nThe clinical description of the ADNI cohort was recently published . Diagnosis of AD was based on the National Institute of Neurological and Communicative Disorders and Stroke and the AD and Related Disorders Association (NINCDS-ADRDA) criteria (McKhann et al., 1984) . AD subjects were required to have Mini Mental State Examination (MMSE) (Folstein et al., 1975) scores between 20 and 26 and a Clinical Dementia Rating scale (CDR) (Morris, 1993 ) score of 0.5-1 at baseline. Qualifying MCI subjects had memory complaints but no significant functional impairment, scored between 24 and 30 on the MMSE, had a global CDR score of 0.5, a CDR memory score of 0.5 or greater, and objective memory impairment on Wechsler Memory Scale Ϫ Logical Memory II test (Wechsler, 1987) . NC subjects had MMSE scores between 24 and 30, a global CDR of 0 and did not meet criteria for MCI and AD. Subjects were excluded if they refused or were unable to undergo magnetic resonance imaging (MRI), had other neurological disorders, active depression, or history of psychiatric diagnosis, alcohol, or substance dependence within the past 2 years, less than 6 years of education, or were not fluent in English or Spanish. The full list of inclusion/exclusion criteria may be accessed on pages 23-29 of the online ADNI protocol (see http://www.adni-info.org/ Scientists/ADNIScientistsHome.aspx). Written informed consent was obtained from all participants.\nAs all ADNI subjects had serial 1.5 T MRI images, their inclusion in our analyses was largely determined by the availability of CSF and PIB biomarker data. CSF measures were performed in only a subset of the ADNI subjects while PIB scanning was added to ADNI after the project began, as its promise became more widely recognized. For the CSF/ hippocampal analyses we used all subjects with available baseline CSF A␤ 42 , CSF t-tau, and CSF p-tau 181 (i.e., tau phosphorylated at threonine 181) levels as downloaded from the ADNI web site in October 2008. The final CSF biomaker sample consisted of 111 NC, 182 MCI and 95 AD subjects. One hundred ninety-one subjects (49%, 27 NC, 99 MCI, 65 AD) were apolipoprotein E4 (ApoE4) carriers and 197 (51%, 84 NC, 83 MCI, 30 AD) were noncarriers.\nFor the PIB/hippocampal analyses we used all subjects with available PIB standard uptake volume ratio (SUVR) data from University of Pittsburgh on the ADNI web site in October 2008. The final PIB sample consisted of 19 NC, 62 MCI and 17 AD subjects. As ADNI PIB imaging was added in 2007, the PIB scans analyzed here were acquired at various time points relative to the start of the ADNI study-19 subjects had their PIB scan at the time of their ADNI baseline assessments, 70 subjects at the 12-month, 7 subjects at the 24-month, and 1 subject each at the 6-and 18-month follow-up assessments. The PIB scans were paired with the respective diagnoses and demographic variables in our analyses. Fifty-one subjects (52%, 5 NC, 35 MCI, 11 AD) were ApoE4 carriers and 47 (48%, 5 NC, 35 MCI, 11 AD) were noncarriers.\nThe study sample of subjects who had both CSF analyses and PIB imaging consisted of 11 NC, 31 MCI and 7 AD subjects. Although PIB was done later relative to the CSF biomarkers the diagnoses of the subjects at baseline and at the time of PIB scans were unchanged. Twenty-seven (56%, 4 NC, 18 MCI, 7 AD) were ApoE4 carriers and 22 (44%, 7 NC, 13 MCI, 2 AD) were noncarriers."}, {"section_title": "CSF biomarker data", "text": "We downloaded the baseline CSF A␤ 42 , t-tau and the p-tau 181 data from the ADNI web site (www.loni.ucla.edu/ ADNI) in October 2008. The CSF collection and transportation protocols and procedural details on CSF A␤ 42 , t-tau and the p-tau 181 measurements are provided in the ADNI procedural manual posted on www.adni-info.org and in a recent publication by Shaw et al. (2009) . Briefly, CSF was collected in the morning, after overnight fast, using a 20-or 24-gauge spinal needle, frozen within 1 hour of collection and transported on dry ice to the ADNI Biomarker Core laboratory at the University of Pennsylvania Medical Center. A␤ 42 , t-tau and p-tau 181 were measured using multiplex xMAP Luminex platform (Luminex Corporation, Austin, TX) with Innogenetics (INNO-BIA AlzBio3; Ghent, Belgium) immunoassay kit-based research-use only reagents containing 4D7A3 monoclonal antibody for A␤ 42 , AT120 monoclonal antibody for t-tau and AT270 monoclonal antibody for p-tau 181 . All CSF biomarker assays were performed in duplicate and averaged. CSF A␤ 42 , CSF t-tau, CSF p-tau 181 , as well as CSF t-tau/A␤ 42 and CSF p-tau 181 / A␤ 42 were used as continuous variables."}, {"section_title": "PIB PET data", "text": "We downloaded all available University of Pittsburgh PIB SUVR data from the ADNI web site (www.loni. ucla.edu/ADNI/) in October 2008. A detailed description of PIB PET acquisition may be found at www.adni-info.org. The detailed University of Pittsburgh PIB SUVR ROI (region of interest) measurement protocol may be found at www.loni.ucla.edu/twiki/pub/ADNI/ADNIPostProc/UPitt_ PIBPET_Analysis.doc. Briefly, ADNI PIB images were collected at 12 ADNI sites.\n11 C-PIB with minimum 90% radiochemical purity and minimum specific activity of 300 Ci/mmol was synthesized using 1 of 2 methods Wilson et al., 2004) . Subjects were injected with 15 Ϯ 1.5 mCi PIB. Dynamic acquisition frames were obtained on a PET scanner 50 -70 minutes post injection. A PIB SUVR image was obtained by averaging the individual 50 -70 minutes postinjection frames and normalized to the mean PIB retention value of the cerebellar cortex. Each subject's PIB SUVR image was sampled with an automated 14 ROI template including 9 cortical (anterior cingulate, frontal, sensorimotor, lateral temporal, mesial temporal, parietal and occipital cortex, the occipital pole, and the precuneus), 3 subcortical (anterior ventral striatum, thalamus, and subcortical white matter) ROIs as well as the pons and the cerebellum. In our analyses we used the lateral parietal, precuneal, and mean cortical PIB SUVR measures as continuous variables. We decided a priori to use only these regions based on the observed high regional PIB retention in AD subjects. Exploratory analyses with all PIB ROIs with statistical corrections for multiple comparisons could have unnecessarily limited our ability to find significant associations with hippocampal structural changes. The mean cortical PIB SUVR measure was derived by averaging of the 9 cortical ROI measures."}, {"section_title": "MRI preprocessing", "text": "All subjects were scanned with a standardized highresolution MRI protocol (www.loni.ucla.edu/ADNI/Research/ Cores/index.shtml) on scanners developed by 1 of 3 manufacturers (General Electric Healthcare, Siemens Medical Solutions, and Philips Medical Systems) with a protocol optimized for best contrast to noise in a feasible acquisition time Leow et al., 2006) . Raw data with an acquisition matrix of 192 ϫ 192 ϫ 166 and voxel size 1.25 ϫ 1.25 ϫ 1.2 mm 3 in the x-, y-, and z-dimensions was subjected to in-plane, 0-filled reconstruction (i.e., sinc interpolation) resulting in a 256 ϫ 256 matrix and voxel size of 0.9375 ϫ 0.9375 ϫ 1.2 mm 3 . Image quality was inspected at the ADNI MRI quality control center at the Mayo Clinic (in Rochester, MN, USA) . Phantom-based geometric corrections were applied to ensure that spatial calibration was kept within a specific tolerance level for each scanner involved in the ADNI study . Additional image corrections included GradWarp correction for geometric distortion due to gradient nonlinearity (Jovicich et al., 2006) , a \"B1-correction\" for image intensity nonuniformity , and an \"N3\" bias field correction, for reducing intensity inhomogeneity (Sled et al., 1998) . Both the uncorrected and corrected image files are freely available to interested researchers at www.loni.ucla.edu/ADNI."}, {"section_title": "Hippocampal segmentation and radial distance analyses", "text": "The postprocessed 1.5 3D T1 scans corresponding to the CSF biomarker and the PIB PET data were downloaded and linearly registered to the International Consortium for Brain Mapping (ICBM-53) standard brain template (Mazziotta et al., 2001 ) using the Minctracc algorithm and 9-parameter (9P) transformation (3 translations, 3 rotations, 3 scales) (Collins et al., 1994) . The aligned images were resampled in an isotropic space of 220 voxels along each axis (x, y, and z) resulting in a final voxel size of 1 mm 3 . The hippocampi were segmented with our automated machine-learning hippocampal segmentation approach (AdaBoost) which employs the statistical adaptive boosting approach originally proposed by Freund and Shapire (Freund and Shapire, 1997) . Using a small training set (in this case 21 subjects-7 NC, 7 MCI and 7 AD) of hippocampi manually defined by an expert (AEG; intrarater reliability: Cronbach's Alpha ϭ 0.98) as an input, AdaBoost develops statistical rules for classifying future data, i.e., for labeling each voxel in each new image as belonging to the hippocampus or not. The basis for the development of the classification rules are thousands of voxel-specific features, such as image gradients, local curvatures at image interfaces, gray or white matter classification, statistical information on the likely stereotaxic position of the hippocampus, etc. Based on the feature information contained in the positive and negative voxels of the training dataset, AdaBoost develops a set of rules and computes the optimal combination and weighting of these features for accurate segmentation of unknown images by estimating the likelihood that each voxel is inside or outside of the hippocampus. The AdaBoost algorithm has been extensively validated (Morra et al., 2008a (Morra et al., , 2008c and when labeling new data previously unseen by the algorithm, it agrees with human raters as well as human raters agree with each other (Morra et al., 2008a) . We have extensively used AdaBoost in several ADNI and non-ADNI publications Morra et al., 2008a Morra et al., , 2008b Morra et al., , 2008c .\nOnce a successful classification model as described above was created, the AdaBoost algorithm was applied to the 2 study imaging samples-the CSF (n ϭ 388) sample and PIB (n ϭ 98) sample. After converting each hippocampal segmentation into the 3D parametric mesh model, we first computed the medial core for each structure (a 3D medial curve threading down the center of the hippocampus). Next we derived the radial distance from each 3D hippocampal surface point to the medial core (Apostolova et al., 2006a (Apostolova et al., , 2006b Wilson et al., 2004) . This measure essentially represents the thickness of the hippocampal structure at each point on its surface. Hippocampal volumes were also extracted for future analyses."}, {"section_title": "Statistical methods", "text": "We used 1-way analyses of variance (ANOVA) with posthoc Bonferroni correction for multiple comparisons for continuous variables while examining for diagnostic differences in age, education, and MMSE scores. We used a chi-squared test to determine differences in gender distribution. Pearson's correlation analyses were used to investigate possible associations between hippocampal volume and each biomarker variable. Linear regression models with PIB SUVR as the dependent and mean hippocampal volume as the predictor variable was executed so that we could compare our results with a recent ADNI report relating PIB to hippocampal volume (Mormino et al., 2009) .\nThe 3D associations between CSF and PIB biomarkers and hippocampal radial distance were studied using linear regression. All studied biomarkers show a continuous change from cognitively normal aging to AD, so, to maximize statistical power, we employed linear regression analyses in the pooled sample. Next we investigated these associations separately in ApoE4 carriers and noncarriers. Our linear regression 3D statistical maps were further subjected to multiple comparisons correction by permutation analyses (permuting the predictor variable-in this case the CSF and PIB biomarkers). Using a set-level inference approach (Frackowiak et al., 2007) , we defined a final single corrected p-value for each map based on the number of points surviving a particular a priori threshold (set to 0.01 in our analyses). This approach tends to be more sensitive for detecting a distributed pattern of weak effects as opposed to the peak height of the maximum statistic, which is best for detecting a spatially highly concentrated effect.\nWe next applied map-wise false discovery rate (FDR) correction and derived cumulative p-value cumulative distribution function (CDF) plots from our 3D statistical maps resulting from the linear regression models described above. These CDF plots provide head-to-head comparisons of the strength of the tested associations (in this case between each CSF and PIB biomarker variable and hippocampal radial distance). In other words, the CDF plots essentially rank the statistical maps in terms of their effect sizes. In the CDF plots the x-axis represents any arbitrary p-value threshold that can be applied to the map (range between 0 and 1) while the y-axis displays the proportion of the statistical map (as a fraction from 0 to 1) that shows effects with significance value below the chosen p-value threshold. CDF plots that rise more steeply at the origin have a higher proportion of voxels with effect sizes exceeding the fixed threshold. An additional y ϭ 20ϫ line denotes the threshold that controls the allowed 5% FDR (i.e., the maximum proportion of false positives allowed, by convention, for a map to be declared significant overall). If a given CDF function curves above the y ϭ 20ϫ line and then crosses it again at a more distant point, it means that the corresponding regression map shows statistically significant effect after FDR correction. For maps with greater effect sizes, the CDF crosses the y ϭ 20ϫ line at a higher statistical threshold or critical value, t (i.e., greater extrapolated y value), meaning that a broader range of statistical thresholds can be applied to the data while still allowing greater than 5% of the voxels to remain significant. The critical value, t, represents the highest proportion of voxels that can be shown while still maintaining a certain prespecified FDR (set at the conventional 5% in our analyses); it occurs when the map is thresholded at the highest possible p-value that still controls the FDR. We used CDF plots to compare the strength of the associations between hippocampal radial distance, and (1) the 5 CSF biomarkers; (2) the mean cortical, parietal, and precuneal PIB SUVR; and (3) the 3 PIB SUVR measures and CSF A␤ 42 ."}, {"section_title": "Results", "text": ""}, {"section_title": "Demographic characteristics", "text": "The mean demographic characteristics of the diagnostic groups in the CSF (n ϭ 388), the PIB (n ϭ 98), and combined CSF/PIB (n ϭ 49) samples are shown in Table 1 . There were no significant age and education differences among the groups in any of the 3 samples. In the CSF (n ϭ 388) sample, the MCI group had significantly more males (66%; p ϭ 0.023) relative to both the NC (51%) and the AD groups (57%). Sex distribution was not significantly different between the diagnostic groups in the PIB or the combined PIB/CSF sample. As expected, AD subjects had the lowest mean MMSE scores and NC the highest in all samples. There were no subjects who had a change in diagnosis between CSF collection and PIB scanning."}, {"section_title": "CSF biomarker analyses", "text": "All 5 CSF biomarkers showed significant correlations with hippocampal volume (Table 2 ) and even more significant associations with hippocampal radial distance in the pooled sample (Fig. 1, Table 2 ). When split by diagnostic label, significant associations were observed between CSF p-tau 181 and CSF p-tau 181 /A␤ 42 and hippocampal volume on the right in the AD group (Table 2) . Trend level associations were seen between CSF t-tau and CSF p-tau 181 and right hippocampal volume and between CSF t-tau, CSF t-tau/A␤ 42 , and CSF p-tau 181 /A␤ 42 , and right hippocampal radial distance in the MCI group (Fig. 2, Table 2 ). CSF p-tau 181 showed a trend-level association with left hippocampal radial distance in NC (Fig. 2, Table 2 ). The correlations between the hippocampal measures and CSF p-tau 181 and CSF p-tau 181 /A␤ 42 were stronger in ApoE4 carriers relative to noncarriers (Fig. 3, Tables 3 and 4 ). In the ApoE4-genotype stratified diagnostic subgroup analyses we had restricted power to detect significant association due to small sample sizes (Tables 3 and 4) . Despite these limitations, we found significant associations between CSF p-tau 181 /A␤ 42 and right hippocampal volume in ApoE4-positive MCI and AD (Table 3) . The associations between right hippocampal volume and CSF p-tau 181 were significant on the right in ApoE4-positive AD and showed a trend on the right in ApoE4-positive MCI (Table 3) . These observations were confirmed in the 3D radial distance analyses. The ApoE4-negative diagnostic subgroup volumetric and radial distance analyses (Fig. 4) revealed only trend level association between CSF t-tau and left hippocampal volume in NC. We used CDF plots to objectively compare and rank the associations between the 5 CSF biomarkers and hippocampal radial distance after applying FDR correction for multiple comparisons. The CDF plots are presented in Fig. 5 "}, {"section_title": "PIB SUVR analyses", "text": "Significant correlations between hippocampal volume and PIB SUVR were seen bilaterally for the precuneal, average cortical, and parietal PIB SUVR (see Table 5 ). Similar to the ADNI PIB/hippocampal analyses reported in Mormino et al. (2009) with a sample consisting of 17 NC, 52 MCI, and 15 AD subjects we ran linear regression analysis with mean cortical PIB SUVR as the dependent measure and mean hippocampal volume (left ϩ right/2) as the predictor variable. This model showed a significant linear relationship between the 2 measures (t ϭ Ϫ2.55; p ϭ 0.012). The precuneal and parietal PIB SUVR linear regression models similarly showed that hippocampal volume is a significant predictor of cortical PIB binding (for precuneal PIB SUVR t ϭ Ϫ2.568; p ϭ 0.009) and for parietal PIB SUVR t ϭ Ϫ2.412 and p ϭ 0.018). After splitting the PIB sample by ApoE4 genotype, stronger correlations between PIB SUVR and hippocampal measures were seen in ApoE4 noncarriers (see Table 6 ).\nThe 3D significance and correlation maps between PIB SUVR and hippocampal radial distance are presented in Fig. 6 . Precuneal PIB SUVR showed significant negative association with the right but not left hippocampal radial distance (right p corrected ϭ 0.013). There was a trend level significant association between average cortical PIB SUVR and right hippocampal radial distance (p corrected ϭ 0.097). Parietal PIB SUVR failed to show significant associations with hippocampal radial distance. The ApoE4 genotypestratified 3D significance maps can be seen in Fig. 7 . The associations between precuneal PIB SUVR and hippocampal radial distance were significant on the right (p corrected ϭ 0.05) among ApoE4 noncarriers (n ϭ 46). A trend-level significant association was seen with mean cortical PIB SUVR also on the right in ApoE4 noncarriers (p corrected ϭ 0.095). While we found significantly higher PIB SUVR in ApoE4 carriers (n ϭ 51) versus, noncarriers (mean cortical PIB SUVR 1.75 vs. 1.54, precuneal PIB SUVR 2.12 vs. 1.74, and parietal PIB SUVR 2.0 vs. 1.75; p Ͻ 0.0001 for all 3), there were no significant associations between PIB SUVR and hippocampal atrophy in ApoE4 carriers. Next we used CDF plots to objectively compare and rank the associations between the 3 PIB SUVR measures and hippocampal radial distance. None of the PIB SUVR/ hippocampal associations in the pooled or the ApoE4 genotype-stratified analyses survived FDR-correction for multiple comparisons. Most different from the null line corresponding to complete lack of effect was precuneal PIB SUVR in the pooled sample but this should be interpreted with caution, as it did not survive FDR correction.\nOf the 3 PIB measures, strongest associations with hippocampal volume and radial distance were seen for precuneal PIB SUVR followed by mean cortical PIB SUVR. To our knowledge this is the first report of regional PIB binding (i.e., precuneal measures, for example, as opposed to mean cortical PIB binding) associations with hippocampal atrophy. It is not surprising to find that precuneal amyloid load has the strongest association with hippocampal structural changes as these 2 areas are strongly connected and functionally related to each other (Dorfel et al., 2009; Laurens et al., 2005; Teipel et al., 2009) . A recent study using resting state functional MRI documented decreased connectivity between the precuneus and the hippocampus in subjects with high mean cortical PIB binding (Sheline et al., 2009 ). Furthermore, the precuneus is also part of the default network, which has been repeatedly found to show abnormal activity in AD subjects (Buckner et al., 2005) .\nOnly a few studies have explored associations between PIB binding and hippocampal volume to date. The strongest \nKey: 3D, 3-dimensional; A␤, amyloid beta; CSF, cerebrospinal fluid; p-tau, phosphorylated tau; t-tau, total tau. Jack et al., 2008b) . Mormino et al. (2009) recently applied automated hippocampal segmentation using the Freesurfer package (Fischl et al., 2002) to the 1.5 T structural MRI data of 17 NC, 52 MCI, and 15 AD ADNI subjects (total n ϭ 84 compared with n ϭ 98 in our analyses). While the major focus of the analyses was to relate cortical PIB binding to episodic memory, the authors also investigated associations of mean hippocampal volume and mean cortical PIB binding. A univariate linear regression model with hippocampal volume as predictor and mean cortical PIB binding as dependent variable showed a significant association (t ϭ Ϫ2.21, p ϭ 0.047). We used a largely overlapping ADNI dataset but employed a different automated hippocampal segmentation technique. Using an identical univariate linear regression model we also found that hippocampal volume is a significant predictor of mean cortical PIB SUVR (t ϭ Ϫ2.364, p ϭ 0.02). We also found an even stronger effect for the precuneal PIB SUVR (t ϭ Ϫ2.578, p ϭ 0.011). Of the 2 studies reporting both PIB and structural hippocampal analyses, 1 did not investi- gate the direct correlations between these measures. The authors, however, compared mean hippocampal volume between subjects with high and low mean cortical PIB binding and found greater hippocampal atrophy in those with high cortical amyloid load ). The second study assessed the strength of the associations between regional gray matter atrophy and PIB retention using a voxel-by-voxel approach and reported significant correlations for the hippocampal and amygdalar but not for any of the neocortical regions (Frisoni et al., 2009a) . Further building upon this evidence we examined whether hippocampal atrophy associates with PIB retention of one remote region that is functionally connected with the hippocampus-the precuneus (or medial parietal cortex) and another that is not as heavily connected-the lateral parietal cortex. . The y ϭ 20ϫ line denotes the threshold that controls the allowed 5% false discovery rate (FDR) (i.e., the maximum proportion of false positives allowed, by convention, for a map to be declared significant overall).\nIn the ApoE4 genotype-stratified analyses, despite that higher cortical amyloid burden was observed in ApoE4 carriers, we found a stronger association between all 3 PIB SUVR measures and hippocampal atrophy in ApoE4 noncarriers. Hence it seems plausible that ApoE4 genotype while promoting cortical deposition of fibrillar A␤ does not exert an equally strong influence on hippocampal neurodegenerative changes. In fact the effect of ApoE4 genotype on age of onset of clinical symptoms could be a direct result of more severe cortical amyloidosis resulting in local neurotoxic effects and significant cognitive decline in nonmemory domains. One study reported that ApoE4-positive African American subjects show greater visuospatial deficits relative to ApoE4-negative subjects while the rest of the cognitive domains appeared to be similarly affected (Mount et al., 2009) and another reported an effect on nonmemory function in addition to accelerated memory loss in ApoE4 carriers (Caselli et al., 2009 )."}, {"section_title": "Combined CSF A␤ 42 /PIB analyses", "text": "These analyses were performed with a sample size of only 49 subjects, i.e., those who had both CSF and PIB examinations. Each biomarker variable was matched with the hippocampal data from the corresponding visit. Relative to the AD subjects from the n ϭ 388 CSF sample, AD subjects from the combined CSF/PIB sample were younger (p ϭ 0.043) and had lower MMSE scores (p ϭ 0.002). In the combined CSF/PIB sample, the NC group had trend level lower CSF A␤ 42 relative to the NC from the n ϭ 388 CSF sample (p ϭ 0.074).\nWe found a trend level association between PIB SUVR and right hippocampal volume (Table 7 ). The rest of the variables of interest did not show significant associations with hippocampal volume. Fig. 8 shows the 3D significance Table 2. and correlation maps between CSF A␤ 42 and each of the 3 PIB SUVR biomarkers and hippocampal radial distance. Following permutation correction for multiple comparisons, trend level associations were seen between right hippocampal radial distance and precuneal PIB SUVR (p corrected ϭ 0.056). Similar effects were seen for average cortical PIB SUVR (right p corrected ϭ 0.07). Neither parietal PIB SUVR nor CSF A␤ 42 showed significant associations with hippocampal radial distance. Similarly CSF t-tau and p-tau 181 showed no significant associations with hippocampal volume and radial distance in the CSF/PIB sample. After mapwise FDR correction, none of the variables showed a significant correlation with hippocampal radial distance."}, {"section_title": "Discussion", "text": "A recent expert position paper reviewed the current evidence on imaging and biofluid AD biomarkers and proposed a timely revision of the temporal order of biomarker abnormalities in AD . The authors posited that the first AD-associated abnormalities are CSF A␤ depletion and cortical amyloid deposition. These events, occurring largely during the cognitively normal stage, precede tau-mediated synaptic and neuronal injury, which are the substrate for hippocampal and cortical atrophy. In full agreement with this model we report stronger associations between hippocampal atrophy and CSF t-tau and p-tau 181 relative to CSF A␤ 42 and PIB SUVR."}, {"section_title": "CSF biomarkers' correlations with hippocampal volume and radial distance", "text": "All 5 CSF markers showed significant relationships to hippocampal volume and radial distance. Strongest associations were seen for CSF p-tau 181 and CSF p-tau 181 /A␤ 42 ratio, followed by CSF t-tau/A␤ 42 ratio and CSF t-tau. CSF A␤ 42 showed the weakest association with hippocampal volume but unlike the CSF tau measures this association did not hold once the sample was broken down by diagnostic category. These results nicely complement previously reported observations and are consistent with the current model of hippocampal atrophy as a measure of neurodegeneration reflecting neuronal loss secondary mostly to effects of neurofibrillary tangle formation .\nSeveral research groups have independently investigated the relationship between CSF biomarkers and hippocampal volume Hampel et al., 2005; Henneman et al., 2009 ) and the power of these CSF measures for differentiating cognitively normal elderly, MCI, and AD subjects (de Leon et al., 2006; Frisoni et al., 2009b) . Fagan et al. (2009) reported correlations between CSF t-tau and hippocampal volume of the same magnitude as the ones observed in our pooled sample analyses (NC, Pearson's r ϭ 0.22; MCI and mild AD r ϭ 0.32) but these failed to reach statistical significance with their study's sample size of 69 NC and 29 in the combined MCI plus mild AD group. While CSF A␤ 42 also showed no significant correlation with hippocampal volume (NC, Pearson r ϭ 0.03 and MCI and mild AD Pearson's r ϭ Ϫ0.004), subjects with low CSF A␤ 42 level had significantly smaller hippocampi relative to those with high CSF A␤ 42 . Similar to our study, Henneman et al. reported strongest correlations with hippocampal volume for CSF p-tau 181 . The strength of the associations were Pearson's r ϭ Ϫ0.29 for MCI and r ϭ Ϫ0.25 for AD (Henneman et al., 2009) . Tau phosphorylated at threonine 231 (CSF p-tau 231 ) was reported to correlate well with hippocampal volume and atrophy rate while CSF t-tau correlated with baseline volume only .\nVery recently the ADNI CSF Biomarker Core published the first detailed analyses of the baseline CSF ADNI data (Shaw et al., 2009) . They reported that a combination of CSF A␤ 42 , CSF t-tau, and the apolipoprotein E4 (ApoE4) genotype best predicted AD while CSF t-tau/A␤ 42 ratio best predicted MCI. Importantly, the same publication also reported an independent diagnostic predictive analysis of AD versus NC. For this classification the authors used the premortem CSF biomarker data of 56 AD subjects all of whom had postmortem examination and diagnostic confirmation and 52 NC. The CSF measure with best diagnostic accuracy of 87% was CSF A␤ 42 closely followed by CSF t-tau/A␤ 42 (accuracy of 85.2%), and CSF p-tau 181 /A␤ 42 (accuracy of 81.5%). The observed best performance of A␤ 42 however may also be due to the fact that only definite AD (i.e., with pathological confirmation) was allowed in this sample while in the ADNI and any other in vivo study we logically resort to diagnosis of probable AD (without pathologic confirmation) and thus inevitably include some subjects with dementia due to other etiologies.\nIn line with our hypotheses and in agreement with the studies above, we found that all CSF biomarkers correlated with hippocampal volume. Among the CSF biomarkers, phosphorylated tau showed the strongest association with hippocampal atrophy suggesting that it is a powerful biomarker for neuronal injury. We also found a stronger association between CSF p-tau 181 and hippocampal atrophy in ApoE4 carriers while a stronger association between CSF t-tau and hippocampal atrophy in ApoE4 noncarriers was present suggesting perhaps a modulating effect of ApoE4 genotype. Past research has also suggested that ApoE4 genotype (Cosentino et al., 2008 ) and higher CSF p-tau 181 levels (Ravaglia et al., 2008) are predictive of more rapid cognitive decline."}, {"section_title": "Combined CSF/PIB dataset analyses", "text": "The rationale behind this analysis was to compare the correlation between these 2 very different amyloid markers and hippocampal atrophy. Although both CSF Abeta and PIB are labeled \"amyloid markers,\" they measure 2 very different A␤ states: CSF A␤ 42 is a measure of this peptide in solution (i.e., the product from the cleavage of the amyloid precursor protein molecule by beta and gamma secretase), while PIB labels fibrillar amyloid contained predominantly in the more mature fibrillar plaques. It is not yet known which of these CSF-based markers correlates best with accepted structural measures of neurodegeneration such as hippocampal atrophy. Due to lack of significance, however, our results are inconclusive. As follow-up ADNI CSF biomarker data becomes available and more subjects are scanned with PIB, a consistent matching of the CSF and PIB values and analyses of larger sample sizes will be possible.\nTo our knowledge this is the largest study investigating the correlations between CSF and PIB biomarkers and hippocampal atrophy. Several strengths and limitations of this study should be acknowledged. Strengths of this study are its large size, the detailed subject assessment, the unified MRI, PIB, and CSF collection protocol across multiple sites and the meticulous data quality control. Additional strengths are the advanced preprocessing and 3D modeling techniques used to map regionally discrete biomarker correlations. As the ADNI was designed to inform decisions about future disease-modifying clinical trials, it uses the very rigorous exclusion criteria typical of clinical trials. As such, it does not represent the general elderly population and its findings should be generalized with caution. Another relative weakness is the etiologic/pathologic uncertainty in the MCI stage as at least 30% of amnestic MCI subjects have been found to harbor non-AD pathology (Jicha et al., 2006) although etiologic heterogeneity should not be expected to affect a direct biomarker to biomarker correlation across the pooled sample.\nAnother limitation of our study in terms of statistical rigor for hypothesis testing is that 5 markers for CSF is a relatively large number. These markers are somewhat redundant as the same measures are assessed both separately (amyloid, tau) and combined (ratios of amyloid and tau). Although a strict hypothesis testing approach would mandate that the number of comparisons should be kept to a minimum, essentially, this is a pilot study aiming to generate the maximum possible descriptive information on which of these 5 widely-studied biomarkers correlates best with hippocampal atrophy. In terms of hypothesis testing, the reported correlations are inevitably somewhat exploratory. In addition, there is a strong statistical correlation between all of these candidate biomarkers and some pairings (such as the ratios) are, by definition, derivable analytically from the others. Even so, it appears that p-tau better reflects the neurodegenerative aspects of AD pathology, while t-tau remains the better-studied measure. Some authors advocate using the ratio markers, as they may be most accurate . In this article, we report correlations between 2 well established amyloid measures and hippocampal atrophy in the pooled ADNI sample (combining patients with AD, MCI, and controls), yet we also report other correlations within groups split by diagnosis (\"disaggregated\" analyses). Both types of analysis are complementary, and each has limitations. The pooled analyses aim to determine the association between the chosen disease biomarkers (CSF and PIB measures versus hippocampal atrophy) across the full spectrum from normal aging to dementia. As the whole cohort is arguably a continuum, it is vital to look beyond the diagnostic categories and relate the observed level of atrophy to CSF or PIB biomarker levels. This same correlation may be missed if it is assessed within 1 group only (e.g., NC, MCI, or AD) due to a \"restricted range\" effect. By running split analyses only, many important correlations will be missed. For instance, the level of brain atrophy correlates well with CSF-derived measures of pathology across the continuum from aging to MCI to AD. But if one subselects a group such as MCI, for instance, or a group of subjects with a very narrow range of disease burden (for instance, AD or NC), it is possible that no such correlation will be detected, due to the restricted range. If the selection criterion (in this case disease stage) for the group correlates with the variable of interest, nearly all the maps would be false negatives due to the truncated range. Pooled analyses also have limitations. First, one could postulate that correlations between biomarkers in a pooled cohort will tend to show similar patterns to a direct comparison of diagnostic groups or to a correlation of cognitive measures used for making the diagnosis. However, taking together the findings reported in this paper and a previous report by our group , that seems to not be the case. The pattern of CSF and PIB biomarker correlations with hippocampal atrophy shown here are strikingly different from the between-group comparisons of hippocampal radial distance and the cognitive (MMSE, global and sum of boxes CDR) correlations with hippocampal radial distance in the same ADNI cohort . Second, if correlation analyses are performed across the full diagnostic continuum in a pooled cohort such as ADNI, any correlations detected may depend somewhat on the proportion of subjects with each diagnosis-in ADNI, this is approximately 1:2:1 for AD:MCI:NC. In other words, part of the range of cognitive decline may be oversampled. In ADNI, the oversampling of MCI is deliberate, but it may not reflect a representative sampling of all subjects of a certain age. As such, any correlations with the atrophy in ADNI may not be detected in the same degree in other population studies with different proportions of subjects, or within diagnostic subcategories. For that reason, both pooled and split analyses have value for understanding the cognitive and pathological correlates of atrophy.\nHippocampal atrophy is arguably the most established imaging biomarker in AD. It powerfully links with disease progression, correlates well with memory loss and global cognitive decline, as well as with AD pathologic burden. In this paper we have successfully documented significant correlations between CSF and PIB biomarkers and hippocam- pal atrophy in the expected direction. However, to establish hippocampal atrophy as a clinical trial biomarker and surrogate measure we will now need to demonstrate change in hippocampal atrophy rate under the influence of a successful therapeutic intervention and a strong correlation with clinical improvement or stabilization. The modulation effect of ApoE4 genotype on the association between hippocampal atrophy and PIB retention is another interesting finding and supports the hypothesis that ApoE4-positive subjects have a more aggressive amyloiddriven endophenotype with somewhat different morphologic expression compared with ApoE4-negative subjects."}, {"section_title": "Disclosure statement", "text": "GE Healthcare holds a license agreement with the University of Pittsburgh based on the PIB technology described in this manuscript. Dr. Mathis is a coinventor of PIB and, as such, has a financial interest in this license agreement. Dr. Petersen is consultant for Elan Pharmaceuticals, serves on the Safety Monitoring Committee for Elan Pharmaceuticals and Wyeth Pharmaceuticals and is a GE Healthcare consultant. The remaining authors have no potential financial or personal conflicts of interest including relationships with other people or organizations within 3 years of beginning the work submitted that could inappropriately influence their work.\nWritten informed consent was obtained from all study participants."}]