[{"section_title": "Abstract", "text": "Objective: To compare the use of water, energy, pesticides and fertilizer to produce commodities for two dietary patterns that vary in the content of plant and animal products. Design: A unique analysis using 'real-world' data was performed, in contrast to previous analyses which applied simulated data. Consumption data from the Adventist Health Study were used to identify two dietary patterns with a markedly different consumption of several plant and animal products. State agricultural data were collected and applied to commodity production statistics. Indices were created to allow a comparison of the resource requirements for each dietary pattern. Setting: California, USA. Subjects: None. Results: The diet containing more animal products required an additional 10 252 litres of water, 9910 kJ of energy, 186 g of fertilizer and 6 g of pesticides per week in comparison to the diet containing less animal products. The greatest contribution to the difference came from the consumption of animal products, particularly beef. Conclusions: Consuming a more plant-based diet could to an extent alleviate the negative environmental impacts related to food production. As a method to feed ourselves more sustainably, behavioural adjustments appear to be a very important tool."}, {"section_title": "", "text": "There is a direct link between dietary preference, agricultural production, resource use and environmental degradation (1) (2) (3) . At the global level, agriculture accounts for 70 % of water withdrawals; in North America this figure is 38 % (4) . Critical water issues exacerbated by agricultural practices include pollution of surface-and groundwater sources, over-drafting of aquifers and salinization of soils (5, 6) . Globally, agriculture is within the highest energyuse category (7) . In the USA, food-related energy use increased from 14 % of the national energy budget in 2002 to an estimated 16 % in 2007 (8) , of which agricultural production is estimated to account for 14·4 % (8) . Environmental impacts associated with the use of fossil fuels include acid rain, air pollution, soil and water contamination and greenhouse gas emissions. About 3 million tonnes of pesticides are applied globally every year (9) , containing approximately 1600 different chemicals, with a lack of complete toxicity data (10) . The environmental consequences of pesticide use include residues on food (11) , surface-and groundwater contamination (12) , persistence in the environment (13) , damage to non-targeted species and increased resistance in pests (14, 15) . Global fertilizer use was about 180 million tonnes in 2012, with the USA consuming about 20 million tonnes per annum, and is forecast to increase (16) . It is estimated that only about 30-50 % of the N from fertilizer application is absorbed, with the remainder entering the environment and causing numerous problems such as surface-and groundwater contamination, salinification of soils, oceanic 'dead zones', a decrease in plant species and a reduced production of biomass (10, 17, 18) . Food production faces serious challenges, exacerbated by a changing climate and future growth in urbanization, industrialization and population (19) . Therefore, considered together with the need to generate fewer overall environmental impacts, a more efficient use of resources for food production is crucial (20) . The production of animal products generally requires more resources and results in greater environmental degradation in comparison to plant foods, hence dietary choices have a very determining impact (21) (22) (23) . While technological options offer scope for increasing the sustainability of food production, it is improbable for technology alone to deliver sufficient changes (24) (25) (26) . Thus, adopting diets with a lower environmental footprint through behavioural modification is essential (24, 27, 28) . The research reported here aimed to explore the scope of impacts that behaviour change at the consumer level could offer by comparing the use of water, energy, pesticides and fertilizer to produce commodities for two different diets varying in the content of plant and animal products. Unlike previous analyses which have utilized simulated data (2, 21, 29) , the present research takes a novel approach through the use of original, 'real-world', non-simulated data sets. To our knowledge, the present analysis is also the first to simultaneously quantify energy, water, pesticides and fertilizer usage for a range of food groups."}, {"section_title": "Experimental methods", "text": "Estimating the water, energy, fertilizer and pesticides used for each dietary type involved a synthesis of 'real-world' empirical data. The analysis involved a number of stages which are detailed in the following sections."}, {"section_title": "Deriving dietary consumption", "text": "The dietary data resulted from responses to a lifestyle and dietary questionnaire administered in the Adventist Health Study 1 (AHS1) cohort, which captured a sample of 34 198 individuals of whom about 50 % consumed relatively small amounts of animal products. Details regarding the AHS1 methodology have been published elsewhere and will therefore not be repeated here. The study population has a variety of dietary patterns and has been identified as a low-risk group regarding the incidence of chronic disease (30, 31) . The AHS1 food survey data allowed for the identification of two dietary groups based on their consumption of meat (beef and poultry), defined as lower animal products (LAP) and higher animal products (HAP). The LAP group included all respondents who ate less than one serving of meat per week and the HAP group included all respondents who ate one or more servings of meat per week.\nThe AHS1 food survey data provided consumption frequencies and amounts for fifty foods. Given the wide diversity of ingredients in terms of geographic origin, complex/processed products such as doughnuts and beverages were removed as they were beyond the scope of the available commodity statistics, leaving thirty-one foods. This was further reduced to twenty-two by testing the statistical significance of differences between the number of servings for the LAP and HAP groups. Where the difference in the number of servings was less than 0·25 per week, such food items were also removed from the analysis, leaving twelve foods. The inclusion of fish was beyond the scope of the research given the lack of availability of commodity statistics. Hence, a total of eleven food groups were included in the analysis: dry fruit, canned fruit, winter fruit, seasonal fruit, citrus fruit, fruit juice, nuts, beans, eggs, chicken and beef. Weekly consumption quantities were calculated using portion size data from the Special Nutrition Sub-Study of the AHS1 (32) , with each food weighted according to the gender and age distribution of the AHS1 sample (33) . Table 1 shows a comparison of weekly consumption across the eleven food groups and two dietary patterns. *The conversion factor transforms food consumption weights back to food production weights. Weight changes from the farm gate to the consumer's plate were included, taking into account inedible yield, waste and cooking (93, 94) .\nCalculating environmental production costs of the eleven food items The geographical remit for food production was limited to California given this was the area of residence of the AHS1 respondents and also in consideration of the relatively higher reliance on local produce when the consumption data were collected during the mid-1980s. In addition, California is one of the most productive states in the USA in terms of food provision. For consistency with the time period during which the food consumption data were collected, the US Department of Agriculture Food Consumption, Prices, and Expenditures 1970-97 (34) were used to identify representative food items (defined as the most frequently consumed food item from each of the eleven food groups; see Table 1 ). The items included were raisins, canned peaches, apples, watermelon, oranges, orange juice, almonds, dried beans, eggs, chicken and beef. Items not produced in California in any appreciable quantity were not included (for example, bananas). To calculate the environmental costs relating to production, the food consumed was converted to production weights (see Table 1 for production weights and conversion factors). The 1997 Census of Agriculture was the key source of agricultural production statistics (35) . Data from the 1997 Agricultural Commissioners' Data (36) were used for production statistics for eggs. Grape production statistics were used to represent raisins. Primary data collected by other researchers were analysed and used in conjunction with the analysis of other data to produce values that were used to reliably calculate inputs of water, primary energy, fertilizer and pesticides."}, {"section_title": "Water use", "text": "Water consumption data for the production of almonds, apples, dried beans, grapes, oranges, peaches and watermelon were obtained from Cost and Return Studies (CRS) published by the University of California Cooperative Extension Service and the University of California Davis Department of Agriculture and Resource Economics (37) (38) (39) (40) (41) (42) (43) (44) (45) (46) (47) (48) (49) . For beef products, the water consumed by the animals (obtained from the National Academy of Science (50) ) and used in the production of their feed was accounted for. Approximate daily water intakes were 66 litres for a 454 kg nursing cow; 41 litres for a pregnant wintering cow; 22 litres for a 182 kg calf; 32 litres for a 273 kg stocker; and 48 litres for a 409 kg finishing steer. An average consumption was derived by summing the requirements for each class of cattle (25 468·80 litres) and dividing by the total weight of beef produced (477·27 kg), giving a ratio of 53·36 litres/kg beef produced. Data for the production of alfalfa (51, 52) and maize (53, 54) used for animal feed were obtained from CRS and were added to the direct water used by the animals using a net feed consumption rate of 5·62 kg maize/kg beef and 2·66 kg alfalfa/kg beef. A feed conversion efficiency of 7·0 was assumed (10) . Soya in the feed formulations for beef and poultry was excluded.\nWater consumed directly by chickens grown for meat consumption is generally about twice the weight of their feed (55) (56) (57) . Temperature, relative humidity, age of birds and type of watering system are also important (55, 57) . An estimated consumption of 0·23 kg/bird per d gives an average direct consumption of 227·12 litres water/1000 birds per d (55) (56) (57) . An estimated indirect use of 227·12 litres water/1000 birds per d relating to the production facility (evaporative cooling, facility sanitation and fire protection) was included (55) , giving a total of 454 litres water/1000 birds per d. The production of a 2·27 kg chicken in 49 (55) (56) (57) , giving a total water consumption of 465·60 litres/1000 birds per d. Assuming average figures (80·6 % hen-day egg production rate and a weight of 60·4 g/egg), each hen produces 48·7 g egg/d (55) . Therefore, each kilogram of eggs produced requires approximately 9·65 litres of water. Table 2 shows water use data involved in the production of each food item."}, {"section_title": "Energy use", "text": "Data for the production of almonds, apples, dried beans, grapes, oranges, peaches and watermelon were obtained from CRS. Original data were reported for gasoline and diesel fuel in gallons per acre and were converted to units of joules of energy used per kilogram of commodity produced using an energy value of 34 828 427 J/litre for gasoline and 38 657 950 J/litre for diesel fuel (58) . Data for the production of alfalfa and maize used for animal feed were obtained from CRS. Table 2 shows energy use data for each food item."}, {"section_title": "Fertilizer use", "text": "Average application rates for each crop produced in California were obtained from the US Department of Agriculture's Agricultural Chemical Usage, 1999 Fruit and Nut Summary (59) for the production of almonds, apples, grapes, oranges and peaches, and from the US Department of Agriculture's Agricultural Chemical Usage, 1998 Vegetable Summary (60) for beans and watermelon. Data for the production of alfalfa and maize used for animal feed were obtained from CRS. N, P and K were combined to give a value for total fertilizer input. Table 2 shows fertilizer use data for each food item."}, {"section_title": "Pesticide use", "text": "The Summary of Pesticide Use Report Data 1997 from the California Environmental Protection Agency provided pesticide use data for almonds, apples, dried beans, grapes, oranges, peaches, watermelon, and alfalfa and maize (used for animal feed) (61) . The use of listed pesticides (special concern due to environmental contamination and risk to human health) in California was available and therefore utilized. Pesticides applied to chickens for egg and meat production (Don Bell, personal communication) and beef (62) were considered inconsequential due to the limited quantities of listed pesticides applied per unit produced. Table 2 shows the total quantity of listed pesticides applied for each food item (the reported weight represents the weight of an active ingredient applied)."}, {"section_title": "Results", "text": "Efficiency rates, described as input requirements per unit of crop yield (63) , were derived for water, energy, fertilizer and pesticides by dividing the amount applied per hectare by the yield per hectare (see Table 2 ). The results show a range of water-use efficiencies with beef having the least efficient use rate across all food items. From the plant food items, almonds had the least efficient water use rate; however, they were still about 1·5 times more efficient than beef. Beef also had the least efficient energy and fertilizer use. Almonds had the least efficient pesticide use, followed by beef which was about three times more efficient. Table 3 shows the input requirements to produce each food item for each dietary pattern. Cumulatively, the HAP diet required 13 545 litres of water, 14 226 kJ of energy, 232 g of fertilizer and 32 g of pesticides and the LAP diet required 3293 litres of water, 4317 kJ of energy, 46 g of fertilizer and 26 g of pesticides per week. In relation to the absolute difference between the dietary patterns, the LAP diet required the application of approximately 4·1 times less water, 3·3 times less energy, 5·1 times less fertilizer and 1·2 times less pesticides compared with the HAP diet. The greatest contribution to the difference came from the higher consumption of animal products (beef, chicken and eggs) in the HAP diet."}, {"section_title": "Comparing the diets", "text": ""}, {"section_title": "Discussion", "text": "The present findings demonstrate that the production of a diet relatively higher in animal products requires significantly greater amounts of water, energy, fertilizer and pesticides than a diet containing lower amounts of animal products. The analysis focused on the absolute difference between two dietary patterns based on eleven food groups, using geographically and temporally specific food ‡Water use calculated by adding the product of maize water use (136·08 litres/kg) times net feed ratio of 1·37 kg/kg broiler or egg produced and direct consumption for broiler and egg production (9·69 and 9·65 litres/kg, respectively). §Water use calculated by adding the product of maize water use (136·08 litres/kg) times net feed ratio of 5·62 kg maize/kg beef produced and the product of alfalfa water use (131·35 litres/kg) times net feed ratio of 2·66 kg alfalfa/kg beef produced and direct consumption for beef (53·361 litres/kg). ||Energy supplied in joules per litre of gasoline is 34 828 427 and per litre of diesel is 38 657 950.\n¶Energy use calculated by adding the product of maize energy use (875 691 J/kg) times net feed ratio of 1·37 kg/kg broiler or egg produced and direct consumption for broiler and egg production (1 603 246 J/kg). **Energy use calculated by adding the product of maize energy use (875 691 J/kg) times net feed ratio of 5·62 kg maize/kg beef produced and the product of alfalfa water use (624 031 J/kg) times net feed ratio of 2·66 kg alfalfa/kg beef produced and direct expenditure for beef (1 299 636 J/kg). † †Fertilizer rate standardized by the percentage acreage applied because not all acres received fertilizer. ‡ ‡Fertilizer use calculated by adding the product of maize fertilizer use (N 0·024, P 0, K 0 kg/ha) times net feed ratio of 1·37 kg/kg broiler or egg produced. § §Fertilizer use calculated by adding the product of maize fertilizer use (N 0·024, P 0, K 0 kg/ha) multiplied net feed ratio of 5·62 kg maize/kg beef produced and the product of alfalfa fertilizer use (N 0, P 0, K 0·0048 kg/ha) multiplied by net feed ratio of 2·66 kg alfalfa/kg beef produced. |||||Average of the data points. ¶ ¶Pesticide use calculated by averaging the product of maize pesticide yield ratio (F 0·0018, K 0·0014, SJ 0·00030) times net feed ratio of 1·37 kg/kg broiler or egg produced. ***Pesticide use calculated by the product of the average maize pesticide yield ratio (F 0·0018, K 0·0014, SJ 0·00030) times net feed ratio of 5·62 kg maize/kg beef produced and the product of the average alfalfa pesticide yield ratio (F 0·00037, K 0·000061, SJ 0·00018) times net feed ratio of 2·66 kg alfalfa/kg beef produced.\nproduction and consumption data. Despite this specificity, the findings are consistent with more recent and geographically diverse analyses that have estimated the resource requirements and/or environmental footprint of food types and/or dietary patterns, in that animal products generally had higher resource requirements compared with plant foods and therefore resulted in greater environmental impacts (2, 3, 21, 23, (64) (65) (66) (67) (68) (69) (70) (71) (72) (73) (74) . Hence, from an environmental sustainability perspective, what a person chooses to eat matters.\nWhen considered over an extended time period the differences in the inputs required to produce the LAP and HAP diets become more pronounced. Over the period of one year, the LAP diet would require 515 273 kJ less energy, 9677 g less fertilizer, 294 g less pesticides and 533 102 litres less water compared with the HAP diet. These results are consistent with those reported elsewhere, for example Horrigan et al. (10) and Leitzmann (75) . Considered within a wider context of water use, the average daily indoor and outdoor water consumption per person in the USA is 333 litres (76) . Therefore, per day, the LAP diet conserves the equivalent water usage for just over four people in comparison to the HAP diet.\nThe potential savings could be much more substantial when considered in the national context. In comparison to the average consumption of animal products in North America (using consumption data for 1985), the LAP and HAP diets contained about 98 % and 50 % less beef, 99 % and 80 % less chicken, and 75 % and 45 % less eggs, respectively (34) . There is potential to attain further savings by reducing the animal product content towards 100 % plant-based or vegan diets, which have been estimated to incur less greenhouse gas emissions than diets including animal products (2, 68) ."}, {"section_title": "Implications on environmental factors", "text": "Rockstrom et al. (77) identify industrialized agriculture as a key contributor to exceeding three of the eight measured planetary sub-systems (climate change, biodiversity and the N cycle). The production of animal products has been identified as a key component to exacerbating nutrient losses, pollution levels and land degradation, while further threatening the quality of water, air and soils, and affecting climate and biodiversity (6, 17, 22, 66, 78, 79) . In addition, livestock production accounts for 70 % of agricultural land use and occupies 30 % of the global land surface (80) . Hence, given their large contribution to the agricultural sector, reducing the consumption of animal products has substantial implications when considered within a broad environmental sustainability context and also in terms of resource security and scarcity, including water, land, energy and food."}, {"section_title": "Implications on public health", "text": "Reducing the consumption of animal products offers substantial health benefits. Meat-based diets are intrinsically linked to poor health outcomes (81) (82) (83) (84) (85) (86) , while plantbased diets have positive impacts on human health and life expectancy (31, 74, (87) (88) (89) (90) (91) . The negative health impacts associated with intensive animal farming, such as zoonotic diseases, could also be reduced. In addition, the reduced exposure to environmental contaminants would provide health benefits. LAP  140·49  283·67  3·33  0·16  HAP  320·70  647·53  7·61  0·37  Chicken  LAP  11·64  23·51  0·28  0·01  HAP  288·29  582·09  6·84  0·33  Beef  LAP  330·50  314·14  5·90  0·28  HAP  10 590·55  10 066·27  188·94  9·03  Peaches  LAP  137·05  146·16  1·49  1·07  HAP  76·48  81·56  0·83  0·60  Apples  LAP  109·93  252·83  0·73  1·40  HAP  77·89  179·13  0·52  0·99  Watermelon  LAP  181·91  791·89  4·11  0·33  HAP  115·55  503·02  2·61 "}, {"section_title": "Future research", "text": "The scope of the research could be extended beyond food production to include inputs for the entire life cycle, including land, and outputs, such as greenhouse gas emissions. The geographical study area could be extended to allow the inclusion of more food items, such as complex products, and soyabeans used in the diets and for animal feed. A detailed analysis of varying dietary types, to include those which contain no animal products for comparison, would help to elucidate patterns in terms of resource requirements. The AHS1 sample had favourable health outcomes in comparison to the general population; therefore the use of a sample with different health characteristics could require more attention on the nutritional aspects of the diet(s). Due to the time of data collection, the AHS1 data may not represent current consumption patterns and hence use of current consumption data may show differences. To maximize the value of future research, a comprehensive approach including all relevant impacts and being inclusive of the full range of environmental, ethical, health, social and economic aspects would be most valuable."}, {"section_title": "Conclusions", "text": "The present unique analysis synthesized 'real-world' empirical data, which served to ground-truth previous analyses based on simulated data. Using dietary patterns that are considered to be nutritionally adequate, the results showed a clear relationship between dietary consumption and the expenditure of resources relating to production: the low animal product (LAP) diet required significantly less inputs to produce than the high animal product (HAP) diet. The amount of animal products in the diet, particularly beef, was the most significant contributor to the requirement for higher inputs. The results demonstrate that as a method for reducing resource requirements for food production or feeding ourselves more efficiently, dietary changes offer substantial scope. More specifically, and in line with other analyses (17, 21, 24, 68, 74, 78, 92) , the findings suggest that eating more plant foods and less animal products would increase the environmental sustainability of food production."}]