[{"section_title": "Abstract", "text": "We measured an array of biophysical and spectral variables to evaluate the response and recovery of Spartina alterniflora to a sudden dieback event in spring and summer 2004 within a low marsh in coastal Virginia, USA. S. alterniflora is a foundation species, whose loss decreases ecosystem services and potentiates ecosystem state change. Long-term records of the potential environmental drivers of dieback such as precipitation and tidal inundation did not evidence any particular anomalies, although Hurricane Isabel in fall 2003 may have been related to dieback. Transects were established across the interface between the dieback area and apparently healthy areas of marsh. Plant condition was classified based on ground cover within transects as dieback, intermediate and healthy. Numerous characteristics of S. alterniflora culms within each condition class were assessed including biomass, morphology and spectral attributes associated with photosynthetic pigments. Plants demonstrated evidence of stress in 2004 and 2005 beyond areas of obvious dieback and resilience at a multi-year scale. Resilience of the plants was evident in recovery of ground cover and biomass largely within 3 y, although a small remnant of dieback persisted for 8 y. Culms surviving within the dieback and areas of intermediate impact had modified morphological traits and spectral response that reflected stress. These morphometric and spectral differences among plant cover condition classes serve as guidelines for monitoring of dieback initiation, effects and subsequent recovery. Although a number of environmental and biotic parameters were assessed relative to causation, the reason for this particular dieback remains largely unknown, however."}, {"section_title": "Introduction", "text": "Coastal marshes from the Gulf Coast of the United States to New England may experience sudden losses of foundation plant species, which jeopardize valued ecosystem services. Brown marsh, marsh balding, salt marsh dieback, acute marsh dieback, sudden vegetation dieback and sudden wetland dieback are all terms that are used to describe rapid (within weeks) loss of marsh vegetation with what appears to be increasing in frequency (Alber et al. 2008; Osgood and Silliman 2009; Elmer et al. 2013) . During dieback, living, green culms are replaced by standing dead or bare ground. The area may be completely devoid of live culms or contain survivors at a continuum of densities. Often the loss is of Spartina alterniflora Loiseleur (smooth cordgrass), but other plant species may be involved. S. alterniflora is the dominant species within low marshes of the region and elsewhere and is considered a foundation species to marshes through fostering maintenance of elevation in the face of sea-level rise and by Electronic supplementary material The online version of this article (doi:10.1007/s11852-016-0445-9) contains supplementary material, which is available to authorized users.\nproviding food and habitat among other ecosystem services (Brinson et al. 1995; Proffitt et al. 2005; Peterson et al. 2008; Baustian et al. 2012 ). Short-term, after the fact studies are the most frequent, but long-term studies of plant condition before, during and after dieback are needed to understand processes of response to dieback and recovery (i.e., resilience) to potentially mitigate dieback events and effectively sustain marsh ecosystem services.\nSeveral causes of dieback have been considered. At least some of the events may be caused by a combination of factors associated with prolonged drought (McKee et al. 2004; Ogburn and Alber 2006; White and Alber 2009; Hughes et al. 2012) or inundation and waterlogging (Mendelssohn and McKee 1988; Webb and Mendelssohn 1996) . Elevated salinity has been suggested as important to dieback during these droughts (McKee et al. 2004) , but this has not been consistently found (Alber et al. 2008) . Also linked to elevated salinity, a dieback of 111,000 ha of fresh and 411,100 ha of saline marshes in Louisiana in 2008 exhibited moderate to severe dieback within three weeks of hurricane storm surge (Ramsey et al. 2012) . Pathogens and herbivory have also been posited as causes of dieback or mechanisms that foster its spread (Silliman et al. 2005; Schneider and Useman 2005; Bertness and Silliman 2008; Holdredge et al. 2008; Smith 2009; Elmer et al. 2012 Elmer et al. , 2013 Bertness et al. 2014) . Although dieback has been recognized for years (Alber et al. 2008) , the frequency and intensity of it may be increasing.\nMost dieback sites show signs of at least some level of recovery in subsequent years. An area of dieback in South Carolina studied by de Souza and Yoch (1997) showed over 90 % recovery in 2 y. The dieback that occurred in Louisiana in 2000 (>100,000 ha affected) demonstrated variable recovery. Anywhere from 0-58 % live cover regrew at separate sites 15 mo after the disturbance (McKee et al. 2004) . Three years after an initial dieback in Georgia, some areas had recolonized by way of rhizome extension (Ogburn and Alber 2006) . Sites in New England exhibited variable recovery with some marshes remaining bare for at least 7 y (personal communication by S. Adamowicz as cited in Elmer et al. 2013) . Thus, the degree of ecological resilience (sensu Holling 1996) of the plant populations is key to ecosystem recovery from the event.\nPrevious assessments of recovery involved the combination of in situ and remote observations (Smith 2009 ), experimentation with transplanting of both plants and animals (Ogburn and Alber 2006; Silliman et al. 2005; Holdredge et al. 2008) , and manipulations of surface elevation (Webb and Mendelssohn 1996; Schrift et al. 2008) . Observations based on leaf spectral measurements also provide plant condition indicators Rangoonwala 2005, 2006) . We focused on the condition of S. alterniflora within a dieback event and assessed ground cover, above-ground biomass, morphometrics, and leaf spectra.\nSpectral techniques are the bases of optical remote sensing monitoring. Plant-leaf level techniques provide estimates of changes in leaf pigment compositions and concentrations that are often among the first indicators of the plant response to external changes Rangoonwala 2005, 2010) . Leaf absorption most directly represents pigment concentrations (Kirk 1994; Carter and Knapp 2001) ; however, the best evidence of pigment changes offered by optical imaging systems is plant-leaf reflectance summed over the sensor view of the canopy. Although the plant-leaf reflectance is only one contributor to the canopy reflectance (Penuelas and Filella 1998) , spectral indicators at this level can be used to emphasize leaf spectral patterns in canopy reflectance (Ramsey and Rangoonwala 2006) . Ramsey and Rangoonwala (2005 , 2010 have shown that reflectance indicators of dieback onset and progression determined at the plant-leaf level can be successfully scaled upward to the marsh canopy, and ultimately to the satellite remote sensing platform.\nA dieback event occurred in the S. alterniflora salt marsh within the Virginia Coast Reserve Long-Term Ecological Research site (VCR-LTER), USA at the Upper Phillips Creek Marsh (UPC) in the summer of 2004. For over 25 yrs., UPC has been the center of ongoing studies that provide a continuous physiological and biophysical record before and after the dieback event (e.g., Blum 1993; Keusenkothen and Christian 2004; Kirwan et al. 2012 ). This paper focuses on the condition of S. alterniflora before, during, and after the dieback event. Our objectives were to: (1) classify ground cover of S. alterniflora as an index of marsh condition, (2) establish how selected biophysical and spectral variables of live culms and leaves reflect ground cover classification, (3) document potential environmental drivers of dieback initiation, and (4) determine plant condition before and during dieback and recovery as an indication of marsh resilience. The overall goal was to formulate a resource management basis for regional monitoring and remote sensing of marsh condition directly applicable to dieback onset and progression that characterizes resilience in S. alterniflora marshes."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study site", "text": "Upper Phillips Creek (UPC) salt marsh is an approximately 50-ha area on the seaward side of the Delmarva Peninsula (37°2 7'N, 75°50'W). It is part of The Nature Conservancy's Virginia Coast Reserve (VCR) and is surrounded by wetland and upland forests, wildlife preserve, and agricultural lands (Fig. 1a) . The marsh is dominated by S. alterniflora in the mineral low marsh with Spartina patens (Ait.) Muhl, Distichlis spicata (L.) Greene, and Juncus roemerianus Scheele in the neighboring organic high marsh. This study focused on the low marsh and short form of S. alterniflora. The elevation of low marsh is approximately 1 m above mean sea level and does not vary by more than a few cm over the platform. Phillips Creek is tidal and floods the marsh on higher high tides with salinities generally between 20 and 30 psu. The UPC marsh has been studied since the mid-1980's as part of the VCR-LTER program (Blum 1993; Brinson et al. 1995) . As a result, meteorological, water quality, groundwater and marsh condition variables have been monitored for numerous years along with periodic intensive studies (http://amazon.evsc.virginia.edu/home1/index.php).\nIn early summer of 2004, researchers observed that an area of the low marsh's vegetation had apparently not shown much spring growth, and patches of marsh were either devoid of Fig. 1 Upper Phillips Creek marsh with sampling sites. a Transects used for assessing condition class are at T1-T8. Recurring end of year biomass measurements are at S2A, S2B, and S2C. Spectral measurements were conducted at B1-B4. b Aerial photograph of the sudden dieback event. The photograph was taken in June 2004 and depicts the area that did not show much spring growth, with patches of marsh that were either devoid of plants or dominated by dead, brown S. alterniflora. Color was modified to enhance evidence of dieback plants or dominated by dead, brown S. alterniflora (Fig. 1b) . The overall area of low marsh most obviously affected by dieback was approximately 2 to 3 ha. At the center was an area of approximately 700 to 800 m 2 that was most severely affected with largely bare sediment. The dieback did not occur as a single circle of brown plants or bare areas, instead it was a mosaic of patches with different degrees of dieback radiating from a bare center."}, {"section_title": "Environmental drivers", "text": "Two environmental drivers were considered as factors that might explain the occurrence of dieback in 2004: decreased frequency of flooding and drought. The marsh elevations were compared to high tide water levels to determine potential frequency of tidal flooding. Marsh elevations were established by total station GPS with benchmarks within the marsh and referenced to NAVD88. Growing season (April-August) and annual flooding frequency was determined by establishing a relationship between the elevations at UPC, expected local sea-level variation, and the nearest (i.e., 35 km) NOAA tide gauge with a long-term and certified record (Kiptopeake, VA (37°10.0′ N, 75°59.3′ W)). The period of record was 1997 to 2012. Hourly precipitation measurements were obtained from the NOAA Climate Data Center (http://cdo.ncdc.noaa.gov/ ulcd/ULCD) for the Accomack County Airport (MFV) at Melfa, Virginia (37 o 38'57.48″N, 75 o 44'28.74″W); 22 km from UPC. These data were used to calculate rainfall for annual growing season (April through August) and annually for the period 1986-2012. The airport is approximately 22 km north of the study site, but precipitation results there are highly correlated to results from shorter term measurements on site."}, {"section_title": "Distribution of vegetation condition", "text": "Four 30-m transects (T1-T4) were established within the marsh in 2004, such that each transect included three condition classes of marsh: healthy, intermediate, and dieback yc=10?> (Fig. 1a) . In 2005, four more transects (T5-T8) were established to include all condition classes. To categorize and classify transect ground cover, observers walked parallel to, but 1 m offset, from transects and noted the condition class. This information was converted to proportions of transect length represented by each condition class and change in class from one year to another. Seven of the eight transects were revisited in June 2012 (all but T4) and were measured for condition class. Condition classes were categorized as 'dieback' if the ground cover of live and dead plants was 25 % or less and >75 % was bare soil. It was considered 'intermediate' from 26 % to 85 % live and dead plant cover. An area was considered 'healthy' at any plant ground cover over 85 %. S. alterniflora was near monoculture in these transects except for T4, which reached into a transitional zone with the high marsh containing S. patens and Salicornia virginica L.\nThe central area of the dieback was bare from the earliest observation. We estimated the area of the bare area in 2005, 2006 and 2012 by making multiple measurements of distances between the borders of vegetation across the bare area. These measurements were made at different angles and across different regions of the bare area. Angle and position were determined from stakes at fixed points outside the area. This information was graphed, and resultant areas of Bbare^portion calculated."}, {"section_title": "Elevation", "text": "Elevations were measured along the 8 transects in August of 2006 using a laser level and referenced to NAVD88. Three replicates were taken per condition class per transect totaling 72 measurements for all conditions. The 0-m and 30-m endpoints for each transect were also measured, totaling 16 additional measurements.\nThere were significant differences in measured elevations among the condition classes (p < 0.001) and also among transects (p < 0.001). There was no significant condition*transect (p = 0.210) interaction. Averaging all transects, the lowest average elevation relative to mean sea level was found in the dieback condition (0.966 ± 0.044 m) (mean and standard deviation) , and the highest in the healthy condition (0.996 ± 0.053 m). The average ± standard deviation of the intermediate condition fell between the two other conditions (0.980 ± 0.043 m). A Tukey's post hoc test showed that Transect 4, located in the high/low marsh transition, had significantly higher elevations than the other low marsh transects."}, {"section_title": "Recurrent end of year biomass", "text": "Annual harvesting for end of the year (i.e., end of growing season in mid-August) above-ground biomass of marsh plants (EoYB) have been collected at UPC since 2001 as part of the VCR-LTER long-term core observations. This information provided documentation of dieback effects beyond the transects. Three of the EoYB sampling sites were located in the low marsh, in (S2A, Fig. 1a ) or near the dieback area (S2B, S2C; Fig. 1a ). Dieback was not obvious at sites S2B and S2C. To collect an EoYB sample, one 0.0625-m 2 quadrat was tossed haphazardly approximately 5-10 m to either side of the three permanently marked sites (i.e., 2 quadrats per site). We included EoYB data through 2011, the most recent year processed. Aboveground plant material was clipped and returned to the laboratory for freezing (−20 C) until analysis. Plants were sorted by species and by live (i.e., any green on culm) or dead (i.e., all brown) status. Sorted materials were dried at~80-90°C to a constant weight and weighed to the nearest 0.01 g.\nIn the fall of 2004, 2005, and 2006 , EoYB harvests were also taken from each dieback transect. Samples were taken by haphazardly tossing a 0.0625-m 2 quadrat into an area designated as one of the condition classes. Two samples were taken per condition class per transect for a total of 48 clippings per year and processed as above. The density of culms from each category was also determined."}, {"section_title": "Plant morphometrics", "text": "The morphology of S. alterniflora culms was assessed using tagged plants to examine how surviving plants within affected areas may have had altered characteristics from those in healthy areas. Morphological traits were determined as the height of the culm measured to the tip of the inner most leaf, the total number of leaves and the number of dead leaves. Culms were tagged with labeled rings cut from numbered Tygon tubing. Morphological traits were determined on June 8, 2005, and re-evaluated on July 13 and August 18, 2005. Four live plants were tagged in each of the three condition classes along transects 5 to 8 (48 plants in all). All tagged plants were initially <30 cm tall.\nOn August 18, 2005, after field measurements, separate and representative culms were harvested and treated similarly. These culms were returned to the laboratory, measured for morphological traits, individually dried at 80°C and weighed to the nearest 0.01 g for biomass per culm estimates.\nPlant morphological traits changed with time over the growing season and condition class. As expected, plant height and leaves per tagged culm increased from June through August 2005. Across all classes, mean height (± standard deviation) increased with statistical significance (p = <0.001) from 18.3 ± 4.9 cm in early June to 25.3 ± 7.3 cm in mid-August 2005. Heights of live culms in healthy areas averaged slightly more than 3 cm of those in intermediate or dieback areas, although this pattern was not statistically significant (p = 0.083) ( Table 1) . Number of leaves per tagged culm increased significantly with both time (p < 0.001) and condition class. By August, healthy culms had about 3 fewer leaves per culm than culms from intermediate and dieback condition classes (p < 0.001).\nNon-tagged culms representative of each condition class were harvested in mid-August 2005 (Table 1) . As with the tagged culms, heights did not differ between classes (p = 0.444), although no trend of taller culms from healthy areas was found. Number of leaves per culm had the same pattern as with tagged culms with healthy culms having about 3 fewer leaves than from other condition classes (p < 0.001). Differences in biomass per culm among condition classes were statistically significant at p = 0.04 when biomass was cover. An area was considered 'healthy' at any plant ground cover over 85 %. In 2012, Transect 4 could not be located so no data is available for that year log transformed to stabilize variance. Healthy condition class culms were 0.46 ± 0.37 g per culm and weighed less than culms in both dieback (0.60 ± 0.48 g per culm) and intermediate (0.76 ± 0.53 g per culm) areas."}, {"section_title": "Collection strategy for spectral analyses", "text": "Spectral analyses were conducted each summer from 2004 until 2007. Sample collection entailed extracting 15 to 20-cm diameter plugs containing whole S. alterniflora plants. The strategy for developing the spectral indicators relied on collection and analyses of plant-leaf samples from two locations. The first location was within marsh that visibly retained full canopy cover although less than 50-m from heart of the dieback. Sites B2, B3, and B4 were on the marsh platform while B1 was situated at the apex of the tidal channel hydraulically connected to the marsh platform sites (Fig. 1a) . Analyses of samples collected at these non-dieback sites were used to determine whether the dieback event could be detected and changes monitored even though the dieback was not visually apparent. The second location was situated in the dieback area. Samples were collected at dieback, intermediate, and healthy marsh locations along transects T5, T6, T7, and T8 in 2005 when dieback was evident, and again along transects T5, T6, and T7 in 2007 at dieback recovery."}, {"section_title": "Plant-leaf spectral measurements", "text": "Spectral analysis of plant samples followed methods of Ramsey and Rangoonwala (2005) . At each site (B1-B4) and transect-condition class (transects T5, T6, T7, and T8), four to 8 groups of leaves were collected from plant samples, each containing 3 to 5 of the visibly greenest leaves for spectral analysis. Using a diffuse sphere, spectral measurements were obtained of the leaf adaxial surfaces immediately following the detachment of leaves from the plant (LI-COR 1984, Spectron Engineering, Inc. n.d.) (Electronic Supplemental Material). Replicate spectral measurements of each leaf sample were used to create individual sample averages and variance statistics that were subsequently combined to form a mean reflectance spectrum for each site or transect-condition per year (Ramsey and Rangoonwala, 2005) ."}, {"section_title": "Spectral broadband ratios and pigments", "text": "Spectral band ranges used in the comparison incorporated the visible (VIS) bands, 440-465 nm (blue), 548-554 nm (green), 669-675 nm (red), 698-702 nm (red-edge), and near infrared (NIR) 770-780 nm reflectance ranges, based on previous work Rangoonwala 2004, 2005) . Blue and red bands more represent changes at the peaks of the chlorophyll and accessory pigment absorptions, while green and red-edge bands reflect changes in the tails; thus, green and red-edge are most sensitive to early changes and blue and red to more sustained changes in pigment absorption or concentration (Gitelson et al. 1996; Ramsey and Rangoonwala 2005) . Changes in NIR dominantly indicate changes in the leaf internal structure and water content (e.g. Penuelas and Filella 1998) .\nSpectral band ratios were calculated to provide plant condition indicators that are amenable to most current remote sensing sensors. We applied two widely used spectral band ratios, also termed vegetation indicators (VI), the NIR to red VI reflectance ratio (e.g., Penuelas and Filella 1998; Huete 2012 ) and the green to red VI reflectance ratio (Gitelson et al. 2003; Rangoonwala 2005, 2006) to assess further green and red responses to dieback.\nTo most directly determine pigment concentration changes, we applied predictive relationships based on the plant-leaf reflectance spectra (Gitelson et al. 2003) . The pigments concentrations calculated were chlorophyll and carotene."}, {"section_title": "Statistical analyses", "text": "Differences within response variables among condition class, time and location were assessed using SPSS 19 software. We used general linear regression models with post-hoc testing of differences for conditions when sampling was considered at a single time. Data transformations were generally not necessary to control variance among conditions. We used repeated measures analysis when sampling occurred at multiple times: specifically mixed linear models and Bonferroni post-hoc tested differences in means between condition classes and years. EoYB sampling extended across 11 years, and we tested if the results from 2004 were different from those of other years.\nThe mean and standard deviation were calculated for the blue, green, red, NIR, NIR/red, NIR/green and estimated chlorophyll concentrations within each condition class across all transects. These univariate statistics did not include propagated error associated with each spectral band, ratio, or estimate. Each spectral band or index from transects during the 2005 sampling was analyzed for differences among condition class. We used two-way ANOVAs (condition class and transect) without replication with post-hoc LSD pairwise comparisons among condition classes.\nThe ability of each spectral index to discriminate condition classes was considered. We calculated the difference between index results for each pair of condition classes (e.g., dieback, intermediate, healthy) and divided the difference by the grand mean (mean across all conditions) for the index. We inferred that the discriminatory power of the index increased with larger percentage differences. The absolute values of the three calculated % differences were then summed for an indicator of overall discrimination."}, {"section_title": "Results", "text": "Weather and tide frequency One major weather event did occur in fall 2003, Hurricane Isabel (Hovis et al. 2004 ). This hurricane made landfall on September 18 approximately 300 km south of UPC near Beaufort, NC and moved northwest. Although it was a category 1 or 2 hurricane at the time of landfall, it produced considerable storm surge along the North Carolina and Virginia coasts. Storm surge overtopped the meteorological station at UPC, so no direct measures of water level were available. At the Chesapeake Bay Bridge Tunnel about 50 km south of UPC, maximum levels were 2.3 m above mean low low water and 1.41 m above mean high high water. A tide gage at Redbank, a few km from UPC and maintained by the VCR-LTER recorded levels of 2.7 m, the highest level for the month by at least 0.4 m. (http://amazon.evsc.virginia.edu/data/ metdata/tide/index.html)."}, {"section_title": "Tracking dieback progress through ground cover", "text": "Recovery was tracked through the changes in ground cover of condition classes along transects (Fig. 3) . Results from individual transects are provided in Fig. 3 because of unequal sample sizes over time, to highlight the similarities among transects and to allow comparison with transect-specific spectral data. End-of-year-biomass (EoYB)"}, {"section_title": "Recurring measures of low marsh EoYB", "text": "Three sampling sites of the routine EoYB study were near transects within the UPC low marsh, and one sampling site was directly within the dieback in 2004 (Fig.1a) . (Fig. 4) . Bonferroni comparisons with 2004 showed significant differences from other years at p < 0.05 for 2001, 2003, 2007 and 2011 , although significant statistical interaction with site is noted. Two observations from these data are that a decrease in live biomass occurred in areas close to but not obviously in the dieback region and the recovery to nominal conditions occurred within 3 years.\nLive EoYB was measured for each condition class within transects from [2004] [2005] [2006] (Table 1) . As obviously expected, there were differences reflecting condition class. There were statistically significant differences in the EoYB of live S. alterniflora among the condition classes (p < 0. There was an interaction between condition class*year (p < 0.001). However, the order of EoYB by condition class did not change over the years."}, {"section_title": "Spectral analyses", "text": ""}, {"section_title": "Spectral band analyses of 2005 dieback transects", "text": "Spectral response of green leaves was examined for surviving culms within condition classes (Fig. 5) . Blue, green, red, and red-edge spectral bands, representing the visible response, each demonstrated statistically significant (p < 0.05) differences among transect T5, T6, T7, and T8 condition classes (Table 2) . Just beyond visible wavelengths, NIR had no statistically significant differences in condition class (p = 0.067). In all bands leaves from the healthy condition class exhibited lower reflectance than leaves from the dieback class (p < 0.05, through LSD pairwise comparisons). Reflectance of intermediate condition leaves was between values for the other two condition classes. Intermediate class blue and NIR bands were not significantly different from other condition classes. Differences in reflectance bands among condition classes as a percentage of the grand mean indicated that the red band provided the largest discrimination ability (averaging 56.8 % of overall mean reflectance). Blue and green bands were next in their discrimination at approximately 40 %. Generally, there was good separation in visible reflectance between healthy and dieback with the largest differences being in the red band.\nA progressive decrease in VI with condition class was best exhibited in the NIR-red reflectance ratio, whereas the difference in NIR-green ratios was not significant at a = 0.05 (p = 0.074, Table 2 ). Leaves from the healthy condition class had significantly higher NIR-red ratios than those from both dieback and intermediate condition classes while the ratio for leaves from the latter two classes were not statistically Table 2 . These mean spectralcondition thresholds were used to validate and calibrate the relationship between spectral indicators and marsh condition in samples collected in 2007 at selected dieback transect sites and in marsh samples collected from 2004 to 2007 at sites B1-B4 located just outside the visually degraded dieback marsh extent. X-axis labels represent the transect number and condition class (e.g., 5-H). Condition class by ground cover is defined in Fig. 3 legend and text Table 2 Spectral characteristics relative to condition class. Condition class and transect p values are from two-way ANOVAs without replication. Bold values indicate statistically significant difference (p ≤ 0.05) from one other condition class using LSD pairwise comparison. Bold plus underlining indicates significant differences at p ≤ 0.01 with two other condition classes. Pair differences are differences between condition classes as a percentage of the overall mean value. Pair differences provide a measure of discrimination of reflectance between condition classes, and these are calculated as percentages of the overall mean reflectance across condition classes. Total discrimination was indexed as the sum of the absolute values of the pair differences for each reflectance different. The degree of NIR-red ratio discrimination based on differences as percentages of the grand mean was comparable to that found for the red band. Chlorophyll estimates progressively decreased from healthy to intermediate to dieback condition class with the dieback estimates ( Table 2 ). The degree of discrimination was similar to that of the red band and NIRred ratio."}, {"section_title": "Remeasurement at dieback transects in 2007", "text": "Spectral "}, {"section_title": "Spectral analyses of marsh platform sites", "text": "The red band, NIR/red VI, and chlorophyll pigment spectralbased indices had the highest discriminatory strengths in the 2005 spectral-condition. They revealed a marsh platform (B2-B4) that underwent dramatic changes from 2004 through 2007 (Fig. 7) . These sites were not obviously in the dieback area.\nAll platform sites (B2-B4) in 2004, but not the creekbank (B1), exhibited the lowest spectral-condition indices reflecting dieback to well below the dieback condition of the entire fouryear study (Fig. 7) . In contrast, marsh in 2004 near the apex of the flushing tidal channel (B1) displayed a healthy spectralcondition. In 2005, all platform marsh was healthy based on the spectral-condition indexes. In 2006, field observations and measurements documented a dramatic decrease in live/dead biomass at site B1. That biophysically degradation at site B1 was reflected in the spectral indexes. Red band and NIR/red VI indexes at site B1 changed from healthy in 2005 to intermediate condition in 2006. Even more substantial change was reflected in the 2006 chlorophyll decrease in both platform and creekbank marshes. By 2007, the condition at all sites (B1-B4) improved to healthy."}, {"section_title": "Discussion", "text": "Dieback events within salt marshes of the USA appear to be occurring with increased frequency during the last couple of decades (Alber et al. 2008) . We provide a case study of one dieback with an extensive array of measurements that accomplished the following: We classified three condition classes of ground cover that linked directly to both plant morphology and leaf spectral characteristics reflecting stress degree. Response variables are relevant to both in situ and remotely sensed monitoring programs. Potential environmental drivers of dieback initiation involving water availability were not obvious, and the influence of hurricanes potentiated. Evidence of stress in plants was seen beyond areas of obvious dieback. The associated spectral response offers opportunities for remote sensing of dieback potential. Resilience was documented at multi-year time and hectare spatial scales. Thus, we provide a broad perspective on the foundation species, S. alterniflora, affected by such an event. Environmental drivers and initiation of sudden dieback\nAs with many studies of dieback, most of our efforts occurred after the initiation of the dieback. However, because the UPC marsh is a component of the VCR-LTER program, we have pre-event and extended information on inundation frequency, precipitation and aboveground biomass for the area. One location for the routine EoYB study at the VCR-LTER serendipitously was the low marsh that was affected by the dieback. Other, but not all, marsh sudden dieback events have been ascribed to decreased water availability and associated edaphic modifications (McKee et al. 2004; Alber et al. 2008; Hughes et al. 2012) . In an intertidal salt marsh, water availability can be affected by drought conditions and low stages of sea level that reduce tidal flooding. We found that neither of these environmental drivers was particularly evident during 2003 or 2004 prior to the early summer dieback event. UPC is perched high in the tidal frame (Kirwan et al. 2012 ) and the frequency of tidal flooding is low (Fig. 2) . Thus, at UPC S. alterniflora is subjected to a lower frequency of tidal flooding than often found (Morris et al. 2002; Voss et al. 2013) . How this lower frequency may affect the resilience of S. alterniflora to stressors is unknown, although certainly there is evidence that the species can be productive with less than semi-diurnal flooding (Bertness 1991; Voss et al. 2013) .\nA regional environmental factor that may have had unexpected consequences on the VCR was Hurricane Isabel in September 2003. This storm produced a strong surge (Hovis et al. 2004 ). Inundation of seawater from Isabel deposited considerable particulate material in the low-to-high marsh transitional area, rapidly changed surface elevation on UPC marsh and killed trees neighboring the marsh (personal observation). Ramsey et al. (2012) found that high salinity associated with storm surge in Louisiana appeared to foster an immediate dieback but not necessarily a delayed one. We have no data on a specific mechanism for how the hurricane may have caused dieback in the subsequent year, but it is the only apparent, potentially significant environmental event preceding the dieback.\nOther potential causes of dieback have been advanced. Silliman and colleagues (Silliman et al. 2005; Osgood and Silliman 2009 ) have suggested that herbivory may be an important contributor to dieback. Blum and Christian have studied this salt marsh for 20 years or more. No detailed census of potential herbivores such as Littoraria irrorata (marsh periwinkle) and Sesarma spp. (mud crab) have been conducted. However, neither has been found at even modest densities in the specific region of the dieback, and no evidence of an outbreak of such herbivores occurred in 2004 (personal observation). Subsequent estimates of density of snails in the different condition classes found only Melampus bidentatus (Marsh 2007 ) This species has not been associated with dieback elsewhere. A study of dieback in Atlantic salt marshes found a pathogenic fungi (Fusarium) in Spartina alterniflora samples taken from UPC marsh after the dieback event, although it did not appear that the pathogenic fungi play a primary causal role in dieback (Elmer and Marra 2011) ."}, {"section_title": "Culms within condition classes", "text": "Almost all variables demonstrated a differential response based on condition class (Table 3) . Condition class was defined operationally with decreasing plant cover from healthy to intermediate to dieback areas. Thus, it is not surprising that aboveground S. alterniflora biomass per unit area tracks condition class. What is more interesting is the ways that condition class exhibited itself in other measurements.\nLiving culms were found in all three condition classes with differences among classes. Live culms in the healthy condition class tended to have the fewest leaves. And culms in Fig. 7 Spectral for each of the four sites (B1-B4) for 2004, 2005, 2006, and 2007 . The X-axis is labeled as the site and year (e.g., B1-4). Horizontal lines and condition labels are defined in Fig. 5 dense healthy areas were thinner (i.e., less mass per cm height) compared to those found in isolated clusters within dieback areas. S. alterniflora culms are well known to demonstrate morphological plasticity associated with different environmental conditions, such as flooding regime, nutrient supply and light penetration (Valiela et al. 1978; Wiegert and Freeman 1990; Proffitt et al. 2005) . We postulate that the thinner culms with fewer leaves in healthy areas were subject to more density dependence and related light limitation than the clusters of culms surviving in dieback and intermediate areas. Also, leaf absorbance of photosynthetically active radiation tended to be lowest in culms from the dieback condition (i.e., reflectance was greatest) even though the healthiest leaves on each sampled culm were selected. As with morphology, plasticity of spectral conditions in S. alterniflora has been recognized (Ramsey and Rangoonwala 2005) .\nS. alterniflora culms often represent ramets of clones (Shumway 1995) , although individual clones may be interspersed providing genetic diversity within a few meters distance (Proffitt et al. 2005) . Isolated clusters of culms within the dieback or intermediate classes may thus be part of the same clone. The connection of these ramets to each other or to dead ramets, however, was not determined. It is conceivable that the responses seen in the culms of the dieback and intermediate condition classes may not only reflect stress on the culms themselves. The responses may reflect the loss or stress of other ramets within the clone (Schwarzschild and Zieman 2008) ."}, {"section_title": "Recovery and resilience", "text": "Previous dieback studies have revealed various degrees of recovery and resilience over multiple years through the reestablishment of S. alterniflora in previously disturbed areas (de Souza and Yoch 1997; McKee et al. 2004; Ogburn and Alber 2006) . The variables that were followed through time , however, relatively small areas of standing dead S. alterniflora culms were scattered throughout the area, perhaps indicating a minor dieback. By 2012, recovery was almost complete, although an area toward the high marsh had a mottled appearance of bare patches and shallow pools that we associate with ongoing transgression of the marsh (Brinson et al. 1995) . By 2012, the primary evidence of the main dieback area was a small (approximately 4-m diameter) patch of bare soil near the center of the original dieback. EoYB within three years after 2004 returned to masses similar to those prior to 2004, with the exception of an unusually high biomass in 2003. Thus, the engineering resilience time was of the order of 3 years, while ecological resilience was demonstrated by return to the original ecosystem state of a S. alterniflora dominated low marsh within a similar time frame (sensu Holling 1996) .\nThe reduction in the central dieback area appeared to be the result of rhizomal ingrowth from edges adjacent to healthy and intermediate areas. Little growth occurred from within this dieback area. However, we did not assess the nature of reintroduction of culms into the dieback areas within transects. They could have arisen from clonal ingrowth, seeds or healthy rhizomes within the dieback areas (Proffitt et al. 2005) .\nLocal elevations (at m 2 scale) within transects decreased by centimeters from healthy to dieback condition classes by 2006. A negative influence of subsidence and elevation loss can be inferred during recovery after dieback in Louisiana, but on a larger scale than ours (Baustian et al. 2012) . The UPC marsh has little slope, and small changes in elevation may have localized impact on flooding duration. Further, the overall elevation is high in the tidal frame and frequency of flooding, even in the low marsh, is limited (Fig. 2a) . Even slight depressions within areas of the dieback condition class may allow water to pool locally and increase duration of submergence with tidal flooding. Increased duration of submergence can lead to a loss in vegetation due to changes in edaphic factors, including waterlogging and greater reduced conditions (Mendelssohn and McKee 1988) . It is unknown, however, if the dieback areas had lower elevations at the time of the occurrence or if the differences in elevation are a result of plant decomposition and subsequent erosion or loss of turgor within roots with concomitant peat collapse. DeLaune et al. (1994) showed that peat collapse rather than erosion caused the conversion of marsh to open water in an area of marsh that died. They posited that peat collapse following plant death may originate from an increase in the decomposition rate of root tissue and loss of root turgor. This is plausible for UPC."}, {"section_title": "Spectral responses to dieback and implications for remote sensing", "text": "Marsh condition classes based on ground cover were supported by spectral response (Tables 2 and 3 ). The most effective spectral-condition indicators reflected changes in the red wavelengths followed by the vegetation index (VI) based on the near-infrared and red ratio. The selection of the red-based spectral-condition indicators is consistent with the late stage of marsh dieback used in spectral calibration (e.g., Gitelson et al. 2003) . It also concurs with Ramsey and Rangoonwala (2005) who showed that later stages of marsh dieback were most reliably aligned with the chlorophyll absorption peak, which was correlated best with red reflectance. Red band, NIR/red VI, and chlorophyll indicators derived from leaf spectral measurements of marsh at different stages of dieback distinctly reflected changes in marsh condition as classified by biophysical measures. The alignment of biophysical measures and spectral indicators of marsh condition is a critical result of this study and confirms the direct relationship between marsh condition during a dieback event and spectral indices directly amenable to remote sensing. We used the three spectral indicators from dieback, intermediate, and healthy condition classes in 2005 to establish spectral-condition thresholds for marsh status (Table 2) . These thresholds were assessed in the following three ways. (Fig. 6) . The remaining three of the four changes were for all three indicators at one site. The indicators showed dramatic improvement in condition at a site in transect 7, which was classified as dieback in 2005 (Fig. 6) . Independent biophysical measurements confirmed that marsh at that site had improved from the dead class in 2005 to the healthy class in 2007, exactly tracking the spectral-condition indicator change.\nThe three spectral indicators were also calculated for plantleaf samples collected from three platform sites and one creekbank marsh site from 2004 to 2007 (B designated sites in Fig. 1a) . In 2004 none of the four sites visually exhibited signs of marsh dieback. However, the spectral indexes calculated for these non-dieback platform areas indicated stress. This supported the EoYB results in the area. The ability of the spectral indicators to document coordinated changes in marsh condition at multiple sites located in two separate marsh areas is a critical result of this study. The alignment of spectral results between dieback and non-dieback areas combined with the proven robustness of the thresholds in a 2005 to 2007 comparison demonstrates the effectiveness of the spectral thresholds to quickly assess marsh condition status. These spectral indicators are amenable to ground data gathering with new and small-size portable instruments and possibly extendable to satellite remote sensing data platforms.\nA third line of evidence corroborating the utility of the spectral indicators was the capture of conditions resembling a small-scale dieback in 2006, two years after the dieback peak. While the change in spectral indicator magnitudes did not revert to dieback levels, they suggested a downturn in marsh condition. In addition to the spectral indicators, field measures documented an increase in dead marsh composition at the head of the tidal flushing channel, and a decrease in endof-year biomass and new standing dead in transects. Thus, spectral indicators had independently detected the change in marsh condition, and provided a measure of degradation intensity. Measured against the thresholds, the decline to intermediate condition, while not yet reaching the dieback threshold, indicated the approach's potential to predict marsh decline.\nThe relationship of spectral indices applied in this study and the dieback progression was directly comparable to relationships found in the Louisiana dieback study using the same spectral indices (Ramsey and Rangoonwala 2005) . However, the overall spectral spectral indicator magnitudes of the Louisiana and of this study differed. A higher range of magnitudes was found for the red band reflectance and lower ranges tended to incorporate the NIR/red VI and chlorophyll pigment concentration in the Louisiana marsh dieback than found in this study. The Louisiana study encompassed more frequently flooded S. alterniflora marsh in contrast to the S. alterniflora marsh of the UPC. This suggests the functionality of the spectral indices as estimators of dieback condition is consistent; however, regional calibration of the spectralcondition index magnitudes may be needed to accommodate different regions."}, {"section_title": "Conclusions", "text": "The ecosystem services provided by salt marshes are jeopardized by sudden dieback events. Loss of services may be temporary if the marshes can recover or permanent should ecological resilience be overcome and a new ecosystem state, such as a mudflat, develop. S. alterniflora is a foundation species for many salt marshes. Its culms provide (1) baffling to reduce water flow and retain sediments, (2) photosynthetic products to promote belowground growth and subsequent peat, (3) food for the detrital food web, and (4) habitat for a variety of animals (Peterson et al. 2008) . Sudden dieback events are most readily evidenced by decline in live culms and aerial biomass. However, as we have shown, evidence of a problem can also be found in plants outside the obvious area of dieback. Further, some live culms often remain in dieback areas, and these are also affected. The scientific community does not have the understanding required to predict the onset, severity and recovery from sudden marsh dieback. In fact the dieback of marsh plants may be a general symptom of several potential stressors and facilitators (Alber et al. 2008; Osgood and Silliman 2009; Elmer et al. 2013 ). Understanding of this phenomenon needs to be built upon case studies of dieback across a range of locations, species and intensities. Our study provides one such case study and contributes significantly through the comprehensiveness of environmental, biophysical and spectral measurements and assessment of context through long-term studies.\nCondition class designations based on ground cover served as good representatives for a variety of dieback response variables. These relationships provide opportunities for effective monitoring for dieback and perhaps other stressor responses. Spatial patterns found in spectral variables coincide closely with those of morphological conditions and biomass distribution. Leaves of culms from dieback areas had clear patterns of stress within their spectra. We developed the spectral thresholds of condition class and found them useful in interpreting marsh condition beyond dieback, including the potential to predict marsh decline. The spectral indicators of condition may be especially germane to remote sensing.\nThe recovery process lagged for a year after initial dieback and proceeded in the second year to near nominal after 3 years. However, a small residual area remained 8 years after dieback. These patterns should provide expectations for the study of other dieback events. And temporal patterns support plant stress during 2004 (and to a lesser extent 2006), although no clear evidence of stress from drought or infrequent tidal flooding was seen. The only environmental anomaly was the occurrence of Hurricane Isabel in fall 2003, but the mechanisms of any relationship to dieback were not investigated. Thus, the dieback in UPC is characterized by the symptoms seen in other marshes but may not have a similar cause."}]