[{"section_title": "Abstract", "text": "INTRODUCTION: Genetic contributions to Alzheimer's Disease (AD) are likely polygenic and not necessarily explained by uniformly applied linear and additive effects. In order to better understand the genetics of AD, we require statistical techniques to address both polygenic and possible non-additive effects.\nMETHODS: We used partial least squares-correspondence analysis (PLS-CA)-a method designed to detect multivariate genotypic effects. We used ADNI-1 (N = 756) as a discovery sample with two forms of PLS-CA: diagnosis-based and ApoE-based. We used ADNI-2 (N = 791) as a validation sample with a diagnosis-based PLS-CA.\nRESULTS: With PLS-CA we identified some expected genotypic effects (e.g., APOE/TOMM40, and APP) and a number of new effects that include, for examples, risk-associated genotypes in RBFOX1 and GPC6 and control-associated genotypes in PTPN14 and CPNE5.\nDISCUSSION: Through the use of PLS-CA, we were able to detect complex (multivariate, genotypic) genetic contributions to AD, which included many non-additive and non-linear risk and possibly protective effects."}, {"section_title": "Introduction", "text": "Many genes have been linked to Alzheimer's disease (AD) such as SORL1 [1] , EPHA1 [2] , CLU, and PICALM [3] , all of which have shown effects in a variety of studies [4] . Though there are well-known genetic effects in AD [5] [6] [7] -there are still some controversial findings.\nFor example, the work reported in [8] showed effects of rare variants in PLD3, where follow up studies showed both replication [9] and no replication [10] of PLD3 effects. Overall, recent works suggest that the genetic contributions to AD are: polygenic [11, 12] , epistatic [13] , and non-linear or non-additive [14] . However, the routine analytical approaches for genetic and genomic data do not accommodate such complexities; but, if the genetics of AD are so complex why are we still using statistical methods whose assumptions are not suited to detect such complex effects?\nWith the advent of genome-wide studies, single nucleotide polymorphisms (SNPs) are almost exclusively analyzed with the additive model. The additive model transforms a SNP from base pair letters into a count based on number of minor alleles where usually a major homozygote is \"0,\" a heterozygote is \"1,\" and a minor homozygote is \"2.\" The additive model has become popular because it is viewed as both a practical approach [15] and a suitable model for complex traits [16] . However, the assumptions of additivity and/or linearity do not always hold (see [17, 18] ). Recent work (in cholesterol) has shown that the genotypic (\"full\") model is better than the additive model to detect genetic contributions to complex traits [19] . Furthermore, additive assumptions can be detrimental because the a priori choice of a model that does not match the true inheritance pattern causes a loss of power [20] . Additionally, the values of '0' and '2' are inherently ambiguous across samples, and this ambiguity could lead to misinterpretation or even the dismissal of effects because of the direction of genotypic effects. For possible examples in AD: in [21] the authors reported \"direction changes\" in their own replication analyses, whereas in [22] the authors report effects in the opposite direction in their attempt to replicate work in [8] . The additive model has been used in many AD studies even though the existence of non-additive effects is often acknowledged and expected [23, 24] . With resources such as the Alzheimer's Disease Neuroimaging Initiative (ADNI), researchers have had the opportunity to analyze genome-wide data in a variety of ways, yet the ADNI genome-wide data have almost exclusively been analyzed with the additive model (see, e.g., [25] [26] [27] [28] [29] [30] ).\nIn this study we investigated the ADNI genome-wide data with a technique tailored for complex and polygenic effects called partial least squares-correspondence analysis (PLS-CA, [31] ). PLS-CA is a multivariate technique that allows for a more general approach (i.e., genotypic model). Furthermore, PLS-CA was designed to address the complexity of genetic contributions (i.e., polygenicity, non-additivity) so that we can detect, rather than assume, specific genotypic effects. PLS-CA treats SNPs as categorical data where the genotpyes are levels within those SNP categories. Our study was designed to identify multiple specific genotypic effects for AD (possible risk factors) and for controls (possible protective factors); the specificity afforded by PLS-CA helps disentangle some of the complexities of genetic contributions to AD. Our goals with this study were two-fold: (1) apply the technique within AD in order to potentially reveal some of the genetic complexities of AD and (2) illustrate a novel approach to perform genetic and genomic association studies.\nOur paper is outlined as follows. In Methods, we describe the ADNI data used in this study, followed by descriptions of the SNP and genotype quality control, and statistical techniques. We then detail the two phases of our study: (1) \"Discovery\" (with ADNI-1) which includes two genome-wide association analyses (one based on diagnosis, and another based on APOE), and (2) \"Validation\" (with ADNI-GO/2) that used the genotypes identified in \"Discovery\" to create a candidate panel and then test group association in a new sample. In\nResults we present findings from each of the phases. In Discussion we emphasize the \"Validation\" phase followed by conclusions and limitations."}, {"section_title": "Methods", "text": "Data used in the preparation of this article come from the ADNI database and Canada. For up-to-date information, see www.adni-info.org.\nOur study included genomic, APOE, and diagnostic data from ADNI-1 and ADNI-GO/2 in the AD, MCI, and control (CON) groups. ADNI-1 used the Illumina Human610-Quad BeadChip while ADNI-GO/2 used the Illumina HumanOmniExpress BeadChip."}, {"section_title": "Participants", "text": "We obtained final totals of 756 participants from ADNI-1 (AD = 344, MCI = 204, CON = 208) and 791 participants from ADNI-GO/2 (AD = 203, MCI = 319, CON = 269). Table 1 includes overviews (e.g., demographics, cognitive measures) of the ADNI-1 and ADNI-GO/2 cohorts. Demographic, cognitive, and diagnostic measures were retrieved from the ADNIMERGE package (available via http://adni.loni.usc.edu/). Table 1 generally includes measures collected at baseline, though for this study we used the last available diagnosis. Not all measures were available at all time points, thus we characterize the sample by the baseline data and last available diagnosis. ADNI-GO/2 had additional recruitment groups: subjective memory complaints (SMC) and MCI was split into early and late. For the ADNI-GO/2 diagnoses in our analyses the two MCI groups were combined. The SMC category was not used as a diagnosis in later time points in the ADNI-GO/2 study, only as a recruitment group at baseline. See Table 1 for details. Note that ADNI-GO/2 included two subtypes of MCI (early and late) as well as the SMC category. (e) shows selfidentified race and ethnicity for both ADNI1 and ADNI-GO/2."}, {"section_title": "Statistical techniques", "text": "Preprocessing, analyses, and graphics were performed primarily in R [32] with the ExPosition, TExPosition, and TInPosition packages [33, 34] . Some in-house We used two forms of PLS-CA in our discovery phase: discriminant PLS-CA and seed PLS-CA. We used discriminant PLS-CA in the validation phase. For details on background, and notation on PLS-CA and its derivatives see [31] . We briefly describe our motivation to use these two techniques here. We expand on the motivation in Study design and overview. Discriminant PLS-CA is a technique that maximizes the separation between a priori groups of participants (see also [35] ). We used Discriminant PLS-CA to identify genotypes most associated with each group. In Seed PLS-CA, a \"seed\" is a specific genetic marker, where the seed analysis looks for distributions of genotypes similar to the seed (i.e., linkage disequilibrium). We used seed PLS-CA to identify other genotypes with distributions similar to APOE, which is the strongest contributor to non-familial AD [36, 37] ; thus we were trying to find additional candidate genotypes that have roughly the same pattern as APOE in the ADNI sample. Table 2 Nominal and disjunctive formats of data.\n(a) Nominal SNP1 (with minor homozygote > 5%) SNP2 (with minor homozygote < 5%)"}, {"section_title": "Note. Illustrative example of nominal (a and c) and disjunctive (b and d) coding of illustrative SNPs and diagnosis", "text": "(Dx) and APOE. For SNP 1, all genotypes have a sufficient frequency and are coded (à la genotypic model), but for SNP 2, the minor homozygote (CC) does not occur frequently enough and is thus combined with the heterozygote (à la dominant model). In all tables, a 1 indicates the presence of a particular level of a categorical variable while a 0 indicates absence (e.g., Subj.1 is an Alzheimer's Disease patient, with 2 ApoE E4 alleles, the AG genotype for SNP1 and either a CC or CA [presence of minor allele] for SNP2). Note that one subject has missing data (i.e., \"<NA>\"). This subject's data for SNP 1 is imputed to the mean of the sample for that SNP (SNP 1) where AA occurs in 70% of the sample, AG in 20%, and GG in 10%, therefore the missing data are imputed to those values."}, {"section_title": "SNP Quality Control & Preprocessing", "text": "For all analyses we excluded any SNPs in the X and Y chromosomes, the pseudoautosomal region (XY), and mitochondrial region (i.e., we analyzed SNPs in Chromosomes 1-22). All SNPs were preprocessed with PLINK (v1.07; [38] ) and in-house R code. SNP annotation was performed with the NCBI2R [39] , and biomaRt packages [40, 41] .\nWe used both because in some cases, one annotation package would have information the other did not.\nParticipant and SNP call rates (i.e., completeness of data) ≥ 90%, minor allele frequency ≥ 5%, Hardy-Weinberg equilibrium p ≤ 10 -6 . SNPs were then recoded into a disjunctive format (see Table 2a and b). Additionally, any genotype below a 5% threshold was combined with another genotype. In our study here, only the minor homozygotes were below the 5% threshold, and thus combined with the heterozygotes, which is analogous to a dominant model. Missing genotypes were imputed to the mean of the sample (see Table 2a and b)."}, {"section_title": "Study design and overview", "text": "We conducted a two-part study: Discovery and Validation. In the Discovery phase there were two analyses with ADNI-1 genome-wide SNPs. The results from the Discovery analyses in ADNI-1 were used to create candidate SNP panels for validation in ADNI-GO/2. In the validation phase there was one analysis with a specific subset of ADNI-GO/2 SNPs.\nData from ADNI-1 and ADNI-GO/2 were not combined or preprocessed together at any stage in this study, so that no contamination or influence occurred from one set on the other. The two samples were also kept separate in order to preserve statistical independence for the discovery-validation pipeline. Because ADNI-1 and ADNI-GO/2 have two different chip sets, we generated a candidate panel of SNPs for ADNI-GO/2 based on the SNPs and their associated genes identified in ADNI-1 (Discovery)."}, {"section_title": "Discovery study analyses", "text": "The goal of the diagnosis (Dx) × genotype analyses was to detect genotypes most associated with each diagnostic category. The seed PLS-CA used APOE E4 as the seed, and was performed on APOE (0, 1, or 2 E4 alleles) × genotypes. Both analyses were designed to identify candidate markers of AD: the discriminant analysis (henceforth referred to as \"Dx-GWAS\")\nidentifies genotypes most associated with each group, whereas the seed analysis (henceforth referred to as \"ApoE-GWAS\") identifies genotypes similar to APOE. All analyses used bootstrap resampling [42] to identify stable genotypes. The distributions around the genotype were tested with \"bootstrap ratios\" (BSR; [31] ). Significant genotypes in our two GWAS (in ADNI-1) were then used to create a new candidate panel of SNPs for validation (in ADNI-GO/2)."}, {"section_title": "Creation of SNP panels from Discovery for Validation", "text": "Because ADNI-1 and ADNI-GO/2 were used as independent data sets in our study, and because the data come from two different genome-wide chips, we used the significant genotypes from the discovery analyses (i.e., Dx-GWAS and the ApoE-GWAS) to generate candidate SNPs for validation. For all significant genotypes in the discovery analyses, we used their respective SNPs to: (1) compile a list of all SNPs within a 50kbase (25+/-) window of those SNPs, and (2) retrieve all stable ensembl gene (ENSG) IDs associated with those SNPs from the discovery analyses, and in turn retrieve all possible SNPs associated those ENSG IDs. All SNPs from the steps (1) and (2) were combined into a candidate set. We extracted all SNPs from the ADNI-GO/2 data that were from the discovery-derived candidate set for use in the validation phase."}, {"section_title": "Validation study analyses", "text": "Validation analyses were conducted on the ADNI-GO/2 data set with a discriminant PLS-CA on the validation SNPs based on diagnosis. The goal of the validation Dx × genotype analysis was to detect genotypes most associated with each diagnostic category. As in the discovery phase, we used bootstrap resampling and the BSR test to identify stable genotypes."}, {"section_title": "Results", "text": ""}, {"section_title": "Discovery (ADNI-1)", "text": "ADNI-1 genome-wide data contains 620,901 SNPs and 757 participants. After QC and preprocessing 756 participants (AD = 344, MCI = 204, CON = 208) and 517,441 SNPs (in chromosomes 1-22) remained, which produced a 756 participants × 1,332,455 disjunctive genotypes matrix (see Table 2 ). Only the first two MCA components showed stratification effects (race and ethnicity) and were thus removed from (i.e., regressed out of) the data.\nSubsequent components showed no apparent effects of stratification. For the discovery GWAS,\nwe used a cutoff of ± 5 for the BSR tests which is slightly below the traditional GWAS parametric threshold (p < .05 × 10 -8 would correspond to a BSR ≈ 5.33)."}, {"section_title": "Dx-GWAS", "text": "The discriminant PLS-CA produced two components. (MotH; like a city skyline and reflection on a river). Figure 1a shows the BSRs for all genotypes for Dx-GWAS Component 1 and Figure 1b shows the BSRs for all genotypes for Dx-GWAS Component 2. The majority of stable genotypes were more related to the AD group than the other groups (see Figure S1 and Table S1 )."}, {"section_title": "ApoE-GWAS", "text": "Because there were only 3 levels to the seed (\"0 E4,\" \"1 E4,\" and \"2 E4\" alleles), seed PLS-CA produced only two components. Component 1 explained 51.24% of the total variance and was driven by the presence (left) vs. absence (right) of E4 alleles (see Supplemental Figure   2 ). Component 2 explained 48.76% of the variance and separates the two E4 alleles group from the other two groups (see Supplemental Figure 2 ). Figure 2 shows the BSRs for all genotypes from this analysis in a MotH plot. Figure 2a shows the BSRs for all genotypes for ApoE-GWAS Component 1 and Figure 2b shows the BSRs for all genotypes for ApoE-GWAS Component 2 (see also Figure S2 and Table S2 ). also Table S1 and Figure S1 ). "}, {"section_title": "Candidate panel creation", "text": "All SNPs associated with significant genotypes in Discovery were used to create the candidate panel. A total of 105 genotypes from 96 SNPs exceeded the ± 5 BSR threshold (see Supplemental Tables 1 and 2 ). From these 96 SNPs, our candidate panel process identified 1,045,360 possible SNPs."}, {"section_title": "Validation (ADNI-GO/2)", "text": "ADNI-GO/2 genome-wide data contains 730,525 SNPs and 791 participants. We Table 2 ). Only the first two MCA components showed stratification effects (race and ethnicity) and were thus removed from the data. Subsequent components showed no apparent effects of stratification.\nA discriminant PLS-CA (Dx × genotypes) was performed on the 791 × 14,200 matrix.\nFor the validation analysis, we used a cutoff of ± 3.25 for the BSR tests (roughly equivalent to a Bonferroni cutoff for the number of unique genes). Discriminant PLS-CA produced two components: Component 1 explained 50.41% and was driven by the separation of the MCI group from the AD and CON groups (see Figure 3) ; Component 2 explained 49.59% of the variance and separated the CON group from the AD group (see Figure 3) . We denoted portions of this subspace as \"control\" associated (blue) or \"risk\" associated (red); anything outside the control or risk regions is ambiguous. Genotypes that fall in the \"control\" region are more associated with the control group than the other groups and genotypes that fall in the \"risk\" region are more associated with {MCI or AD} than the CON group. ‡ rs6859 previously associated with PVRL2. Significant genotypes for both components from the validation set. Component 1 primarily separated CON from AD, whereas Component 2 primarily separated AD from the other two groups. In the validation analysis, we used the asymmetric version of correspondence analysis (CA) to help visualize which genotypes are most associated with each group, and to create identify \"control\" (CON) and \"risk\" (RISK) regions within the CA components (see Figure 3) . Genotypes labeled as CON or RISK indicate which region they are in, otherwise their association is more ambiguous in terms of association with risk or control (\"protective\") factors. Table 3 lists all significant genotypes from Validation. In Figure 3 , we highlight boundaries to interpret genotypic effects. We focused specifically on two boundaries: (1) the boundary associated with the CON group (lower right, blue) and (2) the boundary associated with \"risk status\" (i.e., AD or MCI; upper middle to middle left, red). The relevant SNPs are highlighted in their boundary colors in Figure 3 and identified as part of the \"RISK\" or \"CON\" region in Table 3 ."}, {"section_title": "Discussion", "text": "There has been an increased interest in multivariate approaches for genetics [43] , especially for AD [44] . However, many studies in AD still only use the additive model contrary to: (1) known non-linear and non-additive effects (such as in [45] [46] [47] [48] [49] [50] ), and (2) the fact that the genotypic [19] or co-dominant [20, 51] models appear to be better suited for complex effects.\nBecause of our approach we easily identified more specific genetic contributions to AD than other approaches can. We emphasized genotypes instead of presumed additive effects within SNPs. Our Validation phase revealed many complex effects that highlight why a simple additive model (all in the same presumed direction, i.e., the minor allele), or any a priori model, may not be sufficient to characterize complex genetic effects (see also Figure 3 and Table 3 ); for examples: (1) rs769449 is approximately linear where the minor homozygote and the heterozygote are in the risk region, and the major homozygote in the control region, (2) rs4420638 is approximately dominant where the minor allele is in the risk region, (3) rs440666 is approximately recessive where the minor homozygote is in the control region, and (4) rs8052288 showed a heterozygous effect in the risk region."}, {"section_title": "Specific effects of well-known genes", "text": "Some of the strongest effects in all of our analyses were associated with genotypes in Chromosome 19 (Chr19). These effects included some well-known genes in AD: TOMM40, APOE, APOC, and NECTIN2. However, PLS-CA identified exactly which genotypes contributed to which effects (see Fig. 3 and Table 3 ). For examples, the 'AA' genotype of rs769449 (APOE) and the 'GG' genotype of rs2075650 (TOMM40) are at the extreme of our plot, directly opposite of the CON group, and almost exactly half way between AD and MCI (Fig. 3) . This means that 'AA' in rs769449 and GG in rs2075650 rarely occur in CON, but tend to occur roughly equally in both the AD and MCI groups. Most importantly for Chr19 effects: our Discovery phase identified 'AA' of rs6859 associated with the presence of APOE E4, whereas our Validation phase identified 'GG' of rs6859 associated with the CON group. While the \"direction\" of the effect is the same across both studies, the source of the effect was not (i.e., minor allele vs. major allele). Taken together, the Discovery and Validation analyses suggest that, depending on the genotype, rs6859 confers both a risk and a possibly protective factor. APP is also well-known in AD [52] . We found that APP was identified through the Dx-GWAS in Discovery and also showed effects in the Validation analyses (see Table 3 ). The\nValidation analyses show that various APP genotypes were associated with \"risk\" and \"control\" (Fig. 3 and Table 3 ). Given the findings across both our Discovery and Validation phases, our findings here suggest that APP is more related to diagnostic criteria than to APOE distribution, and that specific APP genotypes provide possibly protective effects (e.g., 'TT' in rs440666)."}, {"section_title": "Lesser-known and novel genetic effects", "text": "We found risk specific genotypes from SNPs in the GPC6 and RBFOX1 genes (Table 3 ; Fig. 3) . Both of these genes have been associated with pathological or cognitive phenotypes of AD. These two genes have shown associations with very different phenotypic or outcome measures in AD. RBFOX1 has been associated with pathological effects in the brain, such as neurofibrillary tangles [53] as well as neuroimaging phenotypes [54] and hippocampal volumes [55] in AD. In contrast, GPC6 has been associated with cognitive and behavioral decline in AD [56] .\nOur analyses also revealed several novel genetic effects. Some of these were \"control\" effects, and some were \"risk\" effects. Of the control-associated effects, we found contributions from genotypes in the PTPN14, CPNE5, and LINC00504 genes. Additionally, we also found contributions from genotypes in the ZYG11AP1 and LOC100421294 genes, where each had various genotypes associated with both \"control\" and \"risk\" effects. There are no reported effects of rs1501158 (LINC00504) and rs10990353 (ZYG11AP1 / LOC100421294) in AD, dementia, or the cognitive aging literature. CPNE5 has not been reported in AD but has been associated with other neurodegenerative diseases [57] .\nFinally, there were also several stable effects that were \"ambiguous\" (i.e., we could not classify as \"risk\" or \"control\" because they fall outside of our designated regions). However, these effects are of interest because (1) effects appear in both analyses and (2) of their associations in various neurodegenerative disorders or their interactions with other genes that play substantial roles in AD. PARVG has been associated with Parkinson's Disease [58] and neurodegeneration [59] . Furthermore, RAD51B, NCALD, and DISC1 are rarely reported in AD, but they have been associated with the amyloid precursor gene APP [60] . RAD51B has also been associated with macular degeneration [61, 62] . Furthermore, DISC1 has been associated with late-onset AD [63] , as well as Aβ production [64] ."}, {"section_title": "Conclusions", "text": "Like in our work here, [54] [55] [56] use the ADNI sample. However, these studies use more complex study designs or more complex methods, which, in some cases [54, 55] , demand vast computational resources. Other work, such as [56] , also have more data and larger samples.\nFurthermore, [65] also used the ADNI sample and have recognized the utility and power of the genotypic model. Yet, compared to all of these approaches, our much simpler and computationally less expensive approach (with a comparable or smaller sample size than these other studies) found some of the same effects reported in all of the aforementioned papers, such as the contributions of GPC6 and RBFOX1. PLS-CA also found a number of well-known genetic contributions to AD such as the effects across Chr19. The Chr19 effects were important because they highlight that our method can and does identify well-known and robust effects, and thus illustrates validity for the problems at hand. But more importantly, we identified many novel effects that otherwise could not be detected without a more general approach. Taken together, our study helps reveal some of the genetic complexities of AD, especially in that we have identified many genotypes from many genes that contribute in a variety of ways (e.g., minor allele as possibly protective, heterozygous effects).\nPLS-CA has many advantages over traditional and more recent approaches to GWAS.\nFirst, PLS-CA does not make assumptions about genotypic effects, rather, PLS-CA reveals the types of effects (e.g., additive, dominant) and the directions of these effects. More importantly, because PLS-CA is a multivariate technique, it actually provides estimates of the contributions of these genotypes to polygenic effects (see BSRs in Table 3 or component scores in Figure 3 ).\nTogether these features of PLS-CA are particularly suited for our problem. PLS-CA has identified and specified the expected complex genetic contributions to AD, and thus techniques such as PLS-CA help making clearer interpretations, as well as reduce false positives, nonreplications, conflicting reports, and otherwise problematic interpretations of genetic effects."}, {"section_title": "Limitations", "text": "The ADNI data sets are, by today's standards, relatively small samples for such a study.\nHowever, our study design emphasized our Validation step to help confirm effects identified in Discovery. Additionally, our Validation phase could have weighted the candidates based on bootstrap ratios from the Discovery phase to emphasize the strength of effects. However, we chose not to and opted for a more data-driven strategy. Ultimately this choice was beneficial: for example, if we had used weighted values in the Validation phase we may have missed effects such as those associated with rs6859 (i.e., rs6859 expressed different effects in Discovery compared to Validation). Furthermore, the individuals within these groups are heterogeneous, and could possibly have confounding factors (e.g., vascular incidents) or misdiagnoses. Because of the difficulty of diagnosing AD in vivo, we are limited in our claims to AD broadly, but have provided a clearer genetic landscape of the cohorts within ADNI-1 and ADNI-GO/2. Thus, the effects we have identified should be further verified in a predictive analysis wherein individuals could be genotyped for the specific markers we have identified; which may be possible through similar studies that are in progress (e.g., ADNI-3, the Ontario Neurodegenerative Disease Research Initiative [66] ). Note. Significant genotypes from ApoE GWAS Components 1 (a), 2 (b), and on both"}, {"section_title": "Supplemental Material", "text": "Components (c). Gene symbols via NCBI2R. Component 1 separated presence from absence of E4 alleles. Genotypes that have a negative bootstrap ratio (BSR) were more associated with the presence of an E4 allele. Component 2 separated, essentially, the 2 E4 alleles from the other (0 or 1) E4 alleles. In (b) all genotypes were more related to the absence of 2 E4 alleles. In (c) these genotypes contribute to both components and suggest that these genotypes are in very high linkage disequilibrium with ApoE (note that the GG genotype of rs2075650 strongly contributes to both components and in the same direction as the presence 2 E4 alleles).\nSupplemental Figure 1 . The component map from the Dx-GWAS (discovery phase). The component map shows significant genotypes and the group configuration to illustrate-as a biplot-the relationship between the genotypes and groups."}]