[{"section_title": "", "text": "T he nation's 39 federally funded research and development centers (FFRDCs) spent $17.4 billion on research and development in FY 2012, according to data from the National Science Foundation (NSF). 2 This was a slight decline from the $17.8 billion spent in FY 2011 (table 1). FFRDCs are privately operated R&D organizations that are exclusively or substantially financed by the federal government. 3 FFRDCs provide the sponsoring federal agencies with capabilities to meet special long-term R&D needs that cannot be met as effectively by existing in-house or contractor resources. They enable agencies to use private sector resources to accomplish tasks that are integral to the mission and operation of the sponsoring agency. FFRDC organization ranges from traditional contractor-owned/ contractor-operated or governmentowned/contractor-operated structures to various degrees of contractorgovernment control and ownership. Each FFRDC is operated, managed, or administered by a university or university consortium, a nonprofit organization, or an industrial firm, either as an autonomous organization or as a separate operating unit of a parent organization. FFRDCs perform R&D for both defense and civilian applications and across a broad range of science and engineering fields. Federal funding accounted for 97.5% ($17.0 billion) of the FFRDC's total expenditures in FY 2012 (table 2). Between FY 2010 and FY 2012, FFRDC's R&D expenditures were boosted by $2.2 billion in funding provided by the onetime American Recovery and Reinvestment Act of 2009 (ARRA). In addition to federal funding, many FFRDCs receive funding and perform work for nonfederal sponsors. However, nonfederal sources accounted for just 2.5% ($440 million) of the FFRDC total expenditures (table 2). In FY 2012, FFRDCs reported $184 million in R&D expenditures funded by businesses, $77 million funded by nonprofit organizations, $39 million funded by state and local governments, and an additional $139 million funded by all other nonfederal sources. The type of work performed across the FFRDCs was fairly evenly distributed between basic research (35.2% of total expenditures), applied research (30.7%), and development (34.1%) in FY 2012 (table 3). However, there was much greater variation in these proportions when looking at individual FFRDCs. Ten FFRDCs (8 of them university administered) reported that basic research expenditures comprised 70% or more of their total spending, 13 FFRDCs reported that over 70% of their spending was on applied research, and 8 FFRDCs classified at least 70% of their spending as development."}, {"section_title": "Data Sources, Limitations, and Availability", "text": "The statistics on FFRDC R&D presented in this report come from the FY 2012 NSF FFRDC Research and Development Survey. This annual survey is completed by FFRDC staff and administrators and collects data from FFRDCs on R&D expenditures by source of funds (federal, state and local, business, nonprofit organizations, or other), character of work (basic research, applied research, or development), and type of cost (salaries, software, equipment, subcontracts, or indirect costs). This survey has been a census of the full population of FFRDCs since FY 2001. The full set of detailed tables from this survey will be available at http:// www.nsf.gov/statistics/ffrdc/. Individual detailed tables from the FY 2012 survey may be available in advance of    NSF 14-308"}]