[{"section_title": "", "text": "mild upper respiratory tract disease with low mortality rates. (1) However, in 2003 and 2012, respectively, the emergence of highly pathogenic severe acute respiratory syndrome (SARS-CoV) (2) and Middle East respiratory syndrome (MERS-CoV) (3) revealed that this virus group may also cause severe respiratory illness in humans. In December 2019, in Wuhan, China, a novel coronavirus, member of the β coronavirus family, has been identified as the source of a pneumonia outbreak (4) and this novel virus was named as severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), by the International Committee on Taxonomy of Viruses (ICTV). (5) In Brazil, the four endemic CoVs circulate annually (6) (7) (8) (9) (10) (11) and the first case of coronavirus disease 2019 (COVID- 19) was reported on February 26, 2020 (https://covid.saude. gov.br) when SARS-CoV-2 was detected in a 61-year-old male traveller from Lombardia region, Italy, that returned to the São Paulo city, Brazil. Until the first reported case in Brazil, also the first in South American region, (12) there were 81,109 confirmed COVID-19 cases in 38 countries. After these first reported patient, cases in Brazil started to rise reaching 3,846,153 infected persons and 120,462 deaths on August 29 (https://covid.saude.gov.br).\nIsolation and propagation of new viruses in vitro represents an essential step and may generate important primary tools in early outbreak characterisation. In that way, isolation of the virus presently disseminating in Brazil will provide important information regarding diversity and molecular evolution of the pathogen, but also supply reference material in the struggle to control the rampant spreading of the pandemic SARS-CoV-2 in the country. Indeed, the availability of infective particles as well as inactivated genetic material as reference reagents are extremely necessary for the preparation of positive controls in molecular diagnosis, development of vaccine formulations, detection of neutralising antibodies, screening of antiviral compounds and for different basic research projects both for public health reference laboratories and the research community.\nIn this study, we describe the isolation of SARS-CoV-2 from the first two patients diagnosed with the novel coronavirus disease in Brazil. We describe its genomic sequence (SARS-CoV-2/SP02/human/2020/BRA) and in vitro replication characteristics. Virus stocks (infectious particles and lysates) were set available and distributed to the research community."}, {"section_title": "MATERIALS AND METHODS", "text": "Ethics declarations -All methods were performed in accordance with relevant guidelines and regulations. This work was approved by the Ethics Committee on Research with Humans from the Institute of Biomedical Sciences, University of São Paulo, Brazil (permission number 74683917.1.0000.5467). All specimens were handled under the Laboratory biosafety guidance required for the novel coronavirus (2019-nCoV) by the World Health Organization (WHO) (13) at BLS3 facilities at the Institute of Biomedical Sciences, University of São Paulo.\nClinical specimen collection -Nasopharyngeal (NP) swab samples were collected from symptomatic patients who had acquired COVID-19 during travels to northwest of Italy (Lombardia region) and returned to the São Paulo city in late February. These patients were treated in the same hospital and were the two first confirmed cases of COVID-19 in the São Paulo city. The specimens were collected on day 2-4 post-symptom onset, placed in 1-2 mL of saline medium and used for molecular diagnosis and virus isolation.\nNucleic acid extraction and real-time RT-qPCR for virus detection -In order to perform the identification of SARS-CoV-2, the extraction of total nucleic acid (RNA and DNA) from the collected samples (200 µL of initial material) were carried out using the semi-automated NucliSENS ® easyMag ® platform (bioMérieux, Lyon, France), following the manufacturer's' instructions. All specimens were handled under the laboratory biosafety guidance required for the novel coronavirus (2019-nCoV) by WHO (13) at BLS3 facilities at the Institute of Biomedical Sciences, University of São Paulo. The de-tection of viral RNA was carried out using the AgPath-ID One-Step RT-PCR Kit (Applied Biosystems Inc., Waltham, USA) on an ABI 7500 SDS real-time PCR machine (Applied Biosystems, Weiterstadt, Germany), using a published protocol and sequence of primers and probe for E gene. (14) RNA copies/mL was quantified by real-time RT-qPCR using a specific in vitro-transcribed RNA quantification standard, kindly granted by Christian Drosten, Charité -Universitätsmedizin Berlin, Germany, as described previously. (2) Virus isolation -We used Vero E6 cells for isolation and initial passages. We cultured Vero E6 in Dulbecco minimal essential medium (DMEM) supplemented with 10% of heat-inactivated foetal bovine serum (FBS) (Vitrocell Embriolife, Campinas, Brazil).\nWe used NP swab specimen for virus isolation. For isolation and first passage, we sow cells in a 25 cm 2 cell culture flask in a concentration of 5 × 10 5 cells/mL. After 24 h, we removed the culture medium, washed three times with FBS free-DMEM and inoculated aliquots (500 μL) of the clinical specimens into the flask. After 1 h of incubation (adsorption), we completed the volume for 5 mL with DMEM supplemented with 2.5% FBS and 1% of penicillin-streptomycin. We grew the inoculated cultures in a humidified 37°C incubator in an atmosphere of 5% CO 2 and observed for cytopathic effects (CPE) daily up to 72 h. Supernatant was collected daily, and virus replication was confirmed through CPE, gene detection and electron microscopy.\nVirus titration -Median tissue culture infectious dose (TCID 50 /mL) -Vero E6 and CCL-81 cells were seeded into 96-well plate (5 × 10 4 cells/mL), 24 h before the experiment. Virus was 10-fold serially diluted in medium (10 -1 to 10 -12 ). Medium was removed from plates, virus dilutions applied in sextuplicate and incubated at 37°C. Visualisations were performed daily in an inverted light microscope (Axiovert 100, Carl Zeiss Oberkochen) to observe the CPE. After 72 h, the last reading was performed, and the monolayers were fixed and stained with Naphthol Blue Black (Sigma-Aldrich Co., Deisenhofen, Germany) dissolved in sodium acetate-acid acetic. The viral titre was expressed in TCID 50 /mL and calculated using the Spearman & Kärber algorithm, as described by Hierholzer & Killington. (15) Plaque forming units (PFU/mL) -Virus titration was carried out in 24 wells plates seeded with Vero E6 and CCL-81 cells at a concentration of 1 × 10 5 cells/well. After 24 h and a cell confluence of 80-90%, dilutions 10 -1 to 10 -10 in DMEM 2.5% FBS of the virus was transferred in duplicate (100 µL/well) to the seeded plates. After 1 h adsorption at 37 o C 5% CO 2 , the wells were completed with an overlay of carboxymethyl cellulose (CMC) with DMEM, 2% FBS and 1% of penicillin-streptomycin, and plates incubated at 37 o C in 5% CO 2 and stained with Naphtol Blue Black dissolved in sodium acetate-acid acetic. Plates were observed and stained from 48 to 96 h post-inoculation (h.p.i.). Both virus titration (TCID 50 / mL and PFU/mL) were made after the third passage of the isolated virus (T2)."}, {"section_title": "Negative stain transmission electron microscopy -", "text": "Samples were adsorbed to glow-discharged carbon filmcoated copper grids (400 Mesh, CF400-Cu, Electron Microscopy Sciences). The grids were washed with ultrapure water treated with DEPC and negatively stained with uranyl acetate 2% (w/v) with blotting on filter paper after each step. A FEI Tecnai G20 200 kV transmission electron microscope (Department of Cell and Developmental Biology, Institute of Biomedical Sciences, University of São Paulo) was used for image acquisition.\nVirus growth kinetics in different cell lines -Three Vero cell lines (E6, CCL-81 and hSLAM) plus a human epithelial type 2 (HEp-2) cells, at concentration of 5 × 10 4 cells/mL, were tested for the propagation of the SARS-CoV-2 by inoculation at a multiplicity of infection (MOI) of 0.02. The culture medium consisted of DMEM supplemented with 2.5% of FBS. Aliquots of cell-associated and supernatants compartments were collected every 12 h up to 96 h.p.i. for virus quantification via TCID 50 / mL and RNA copy number quantification by reverse transcription-quantitative polymerase chain reaction (RT-qPCR). The assay was conducted in triplicate, reproduced in two independent experiments and expressed by standard error of the mean (SEM). Graphics and SEM were done using GraphPad Prism software version 8.1 (GraphPad Software, San Diego, USA).\nNext generation sequencing of viral full-length genome -We extracted total nucleic acid from the NP and oropharyngeal (OP) swab samples and cell supernatants isolates with the QIAamp Viral RNA Mini kit (QIAGEN, Hilden, Germany). The purification and concentration steps were carried out with RNA Clean & Concentrator kit (Zymo Research, Irvine, USA) with DNAse I treatment during the concentration process. Depletion of human ribosomal RNA was performed with the concentrated RNA product using the QIAseq Fast Select RNA Removal kit (QIAGEN). Finally, the RNA samples were submitted to random amplification following the methodology described in Greninger et al. (16) with few modifications.\nThe preparation of sequencing libraries for the Illumina platform was carried out with the Nextera XT Kit (Illumina, San Diego, USA) and multiplex testing, using the random two-step PCR amplification product as input, followed the kit's standard instructions. The libraries were quantified after fluorescence measuring with the Qubit instrument (Thermo Fisher Scientific, Waltham, USA) and loaded on the NextSeq 550 equipment (Illumina) for sequencing with MID 300 pairedend reads (Illumina).\nSequencing analysis -The sequencing data was analysed by a flow of bioinformatics analysis (pipeline) developed at Albert Einstein Hospital. In summary, raw sequencing data was subjected to sequence quality controls, removal of human contaminants by aligning against the HG19 reference genome, taxonomic identification of other pathogens and genome recovery through manual curing. Quality control was performed using cutadapt (17) to filter sequences by length (< 50 bp), average quality (Q p < 20) and trim options to remove low quality ends (9 bp to 5' end and 5 bp to 3' end). Passed QC reads were mapped to HG19 human reference genome using bwa (18) mem with default parameters. Not mapped reads were submitted to assembly using SPADES 1.13. (19) Contigs were inspected and manually curated using Geneious 2020.1 to generate a final assembly. Complete genome was compared to SARS-CoV-2 reference and close isolates by multiple sequence alignment. Final genome was deposited in GenBank (https:// www.ncbi.nlm.nih.gov/genbank/)."}, {"section_title": "Production of virus isolates (VIS) and lysate (VLS) stocks and national distribution network -", "text": "The preparation of VIS and VLS stocks was performed as described above for virus isolation. "}, {"section_title": "RESULTS AND DISCUSSION", "text": "Clinical specimen collection -Patient 1 (HIAE01), a 61-years-old male patient, and patient 2 (HIAE02), a 32-years-old male patient, had returned from northwest of Italy (Lombardy region) and presented respiratory symptoms including cough, sore throat, runny nose, fever, myalgia and headache. Patient 1 was initially diagnosed with a community-acquired pneumonia and received antimicrobial therapy. Both were confirmed for COVID-19 by Hospital Israelita Albert Einstein (HIAE), in the São Paulo city on February 26 (HIAE01) and 28 (HIAE02), 2020. A summary of clinical characteristics of the patients is described in Table. Lombardy is considered the centre of the COVID-19 outbreak in Italy (20) and has a high influence of the first wave of SARS-CoV-2 introduced in Brazil. (21) Virus isolation -Before isolation in cell cultures, we tested the samples using a one-step multiplex RT-qPCR for the detection of 18 additional different respiratory viruses (22) and tested for bacterial contamination using Fluid Thioglycolate Medium (Becton Dickinson, Franklin Lakes, USA). No other pathogens were detected.\nThe positive NP were inoculated on Vero E6 cells. The initial sample collected from HIAE01 was freezed and thawed before inoculation and no virus propagation was obtained. A second sample, from the same patient, was obtained \"fresh\" (conserved at 4ºC for no longer than 12 h) and we could successfully isolate SARS-CoV-2. Sample from HIAE02 was inoculated \"fresh\" from the first moment. The failure to isolate the virus from the first sample collected from HIAE01 may be attributed to a lower virus load and to the freeze-thaw cycle before cell culture inoculation. The schematic timeline of procedures is presented at Fig. 1 .\nThree days post infection, the isolation of SARS-CoV-2 from HIAE02 was confirmed by RT-qPCR, electron microscopy and whole genome sequencing (Fig. 1) . The cycle threshold (Ct) value and genome copy numbers (RNA copies/mL) of the pre-inoculated sample was Ct 17.49 and 8.46 × 10 6 (Fig. 2A) . RNA quantification of passages 2 and 3 after 72 h.p.i. gave values of 10.12 -1.19 × 10 9 copies/mL and 9.22 -2.18 × 10 9 copies/mL, respectively. Since virus isolation from HIAE02 (SARS.CoV2/SP02.2020.HIAE.Br) was faster, all the subsequent studies were carried out with this isolate after passage 3. Virus isolation (passage 0) from HIAE01 (SARS.CoV2/SP01.2020.HIAE.Br) was confirmed by RT-qPCR (Ct 15.02 -4.4 × 10 7 copies/mL) and whole genome sequencing, being stored at -80ºC.\nNegative staining transmission electron microscopy of the SARS.CoV2/SP02.2020.HIAE.Br, here after referred as SP02/BRA, permitted the observation of coronavirus-specific morphological structure, being possible to visualise the protein components of the viral envelope. The virus particle size ranged from 80 to 100 nm (Fig. 2B )."}, {"section_title": "CPE and virus titration -", "text": "The CPEs were characteristic of SARS-CoV-2: cell rounding, detachment of the cell monolayer and formation of loose cells on the surface, for both Vero E6 and CCL-81 cells and similar to previously observed effects. (23) (24) (25) (26) Nonetheless, the CPEs were more evident in CCL-81 cells. The virus isolate was titrated after two blind passages following isolation (T2) and the CPEs were more clearly observed in CCL-81 cells for TCID 50 /mL (2.11 × 10 6 ) and PFUs (1.5 × 10 6 ). For PFUs titration, effects were not clear for Vero E6 cells, and for Vero CCL81, only a few small plaques were visible at 72 h.p.i., being much larger and more visible at 96 h.p.i. (Supplementary data, Fig. 1 ). Hartcourt et al. (23) described effects more visible for Vero E6 cells when compared to CCL-81. Other successful SARS-CoV-2 isolation reports were based on Vero E6, Vero CCL-81 and Vero hSLAM (23) (24) (25) (26) (27) showing that the three cell lines are permissive for SARS-COV-2.\nVirus growth kinetics in different cell lines -We examined SARS-CoV-2 growth kinetics in three Vero cell lines (E6, CCL-81 and hSLAM) and compared with HEp-2 cells. All cells were inoculated with the SARS-CoV-2 isolate (SP02/BRA) and cultured under similar conditions. Virus titre quantification analysis of cell-associated and supernatants compartments indicated that similar levels of infectious SARS-CoV-2 were produced in all three Vero cell lines of Vero, but not in HEp-2 cells, that proved to be not permissive to virus replication. The peak of viral titre was detected 48 h.p.i. (10 7 TCID 50 /mL) after an initial eclipse phase. CPEs was not observed until 48 h.p.i. and reached a peak at 72 h.p.i. (Supplementary data, Fig. 2 ). Quantification of ribonucleic acid copy number (RNA cn ) indicated that virus was released into the supernatant with similar kinetics for all three tested Vero cell lines, with virus yielding slightly higher values on 72 h.p.i. (Fig.  3B) . RNAcp:TCID 50 ratios did not differ significantly (p > 0.05) among the tested Vero cell lines (Fig. 3C ). In addition, these cell lines appeared to release few noninfectious particles at early time points of the infection. The RNAcp:TCID 50 ratios appeared to increase discreetly over time, suggesting an increase in the release of noninfectious virus at later time points or an increase in virus particle degradation over time (perhaps as a consequence of cell culture proteases). Virus RNA was not detected in the cell-associated fraction and cell cultures supernatants of HEp-2 cells (Fig. 3A , B). Any clear-characteristic CPE of SARS-CoV-2 was observed in HEp-2 cells (Supplementary data, Fig.  2) . Similarly to other studies with SARS-CoV (28, 29) and SARS-CoV-2, (23, 26) our findings demonstrated that the three tested Vero cell lines release infectious virus particles and viral RNA copies at the same kinetics and efficient egress.\nWhole genome sequencing -Whole genome sequence of the SARS-CoV-2 Wuhan-Hu-1 (NC_045512) and INMI 1/ITA (MT066156) were compared with SP02/ BRA directly isolated from patient's sample (MT126808) and after cultivation in Vero cells (MT350282) using MAFFT multiple aligner tool (algorithm = auto and PAM = 1). Alignment shows only two mutations at the cultivated strain (> 99.993% similarity). Mutations occurred at the nsp2 and spike proteins (Fig. 4) .\nDistribution network -Until March 20, 2020, the sending of the material comprised 31 different research groups, in public and particular university/hospitals, at 10 different states in Brazil (Fig. 5) . The inactivated virus (VLS) was distributed according of request from the laboratories to testing clinical samples by RT-qPCR, using the VLS as positive controls, which was important, considering the difficulties -availability and price -to import synthetic RNA in Brazil. The criteria for distributing live virus (VIS) was based in the capacity of BSL3 facilities from the host institutions, experience of the principal investigator and the analysis of priority for development of vaccine, drug discovery and virus neutralisation diagnosis. This initiative is crucial to improve the study of SARS-CoV-2 and the development of methods and strategies for virus treatment and prevention. SARS- CoV-2 isolates were set available to the scientific community by different groups in other countries. (23, 27) The first delivery to the research community at the São Paulo state was set on March 13. The virus distribution by the Brazilian Mail Company was first set on March 18, 2020 and, in less than 13 h, the biological material was delivered to Rio de Janeiro (222.26 miles away from the São Paulo city), the state of Minas Gerais (304.28 miles) and the state of Rio Grande do Sul (815.94 km). Virus samples were sent following technical and biosafety requirements, in accordance with ANVISA recommendations.\nIn conclusion, in this work, we describe the successful isolation of SARS-CoV-2 from the first diagnosed patients in Brazil. The virus was propagated in Vero cell lines and replication features, CPE and growth kinetics were described. The experimental protocols described herein can be used for future attempts to isolate SARS-CoV-2 in different places in the world. The produced virus stocks were distributed to different research groups and hospitals in the country and are being used as a reference in diagnostic tests and for research, aiming the screening of antivirus drugs, testing the efficacy of vaccine formulations under experimental conditions. The VLS are been used as controls for molecular diagnosis and studies, eliminating the need of imported material in the first weeks of the pandemic in Brazil. The COVID-19 pandemic is unprecedent and the collaborative work is crucial to the efforts to understand and control the virus spread in the country.\nData availability -The complete genome sequences of SARS-CoV-2/SP02/human/2020/BRA from de clinical sample and SARS-CoV-2/human/BRA/ SP02cc/2020 from cell culture isolation have been deposited in the GenBank (accession MT126808 and MT350282, respectively). The version described in this paper is the first version."}]