[{"section_title": "", "text": "impairment), according to the degree to which independence is compromised, and downplays the requirement for memory loss (www.dsm5.org).\nUpdated NINCDS-ADRDA criteria for AD, 8 soon to be published, continue to acknowledge gradual onset and progressive memory loss as key, with other cognitive domains becoming increasingly affected over time, but also acknowledge atypical presentations and frequent concomitant pathology such as CVD. The NINDS-AIREN criteria for VaD, which have been most widely used for clinical trials of cognitive enhancers in VCI, specify: a) cognitive decline in memory and two other domains sufficient to impair functional abilities (attributable to cognitive decline, not just physical disabilities); and b) evidence for CVD, indicated by focal (i.e. sensorymotor) signs and relevant imaging evidence of stroke. 9 A temporal relationship between dementia and CVD, e.g. onset within three months of a stroke or stepwise decline, is required to diagnose 'probable' VaD; otherwise, if criteria a) and b) are met, but there is no abrupt onset or decline, it is called possible VaD. Different criteria for VaD vary in sensitivity and specificity against pathological verification (e.g. the DSM-IV 0.36 and 0.89, NINDS-AIREN 0.19 and 0.98, and ICD-10 0.19 and 1.00 respectively), so that diagnosis and prevalence can differ markedly depending on the criteria."}, {"section_title": "10", "text": ""}, {"section_title": "HeterogeneIty of VcI", "text": "Vascular cognitive impairment is quite a heterogeneous disorder, arising from vascular risk factors alone, such as hypertension, which can drive small vessel disease, manifesting as lacunar infarcts as focal or patchy white matter changes called leukoaraiosis. There can be large vessel infarcts, different types of haemorrhage and hypoperfusion syndromes, including cardiac arrest and postural hypotension. The resulting damage can destroy cognitively eloquent cortical-subcortical structures or it can be confined to the white matter and the deep basal ganglia nuclei, whereby brain circuitry is damaged, potentially interrupting vital large-scale cerebral networks that subtend different behavioural functions."}, {"section_title": "oVert cereBroVASculAr dISeASe", "text": "Given this heterogeneity, it has become useful to distinguish between what is called overt and covert CVD. Overt disease refers to cognitive impairment associated with a clinically evident stroke event, occurring in approximately 65% of stroke patients, making it almost as common as sensorimotor manifestations. In about 26-36%, this is severe enough to meet the criteria for dementia (compared with 3% in age-matched controls). 12, 13 Cognitive impairment increases the likelihood of dependence and long-term placement, and is associated with a higher mortality (61% vs 25%). 12, 13 Depressive symptoms also occur in 25-50% of patients after a stroke, and can adversely affect recovery as well as cognition. 14, 15 The probability of suffering post-stroke dementia depends on several factors: the size and location of brain damage, history of previous strokes and imaging evidence of multiple strokes. It is also associated with older age, ethnicity, lower education, vascular risk factors such as diabetes and atrial fibrillation, left-sided lesions and concomitant depression. 16 With respect to strategic location, damage to the anterior dorsomedial nucleus of the thalamus is particularly notorious as a cause of sudden onset dementia, especially if bilateral ( Figure 1A ). One study suggested that thalamic infarct volume >55 mm 3 represented a threshold for sudden cognitive decline, and that left thalamic infarcts are more likely to cause dementia, whereas right-sided lesions caused VCIND. 17 Other strategic locations include the angular gyrus, medial frontal region and posterior circulation strokes affecting the hippocampus, particularly if they are bilateral.\nMore commonly, post-stroke dementia is associated with multiple cortical and/or subcortical infarcts, which can occur simultaneously or in a staged fashion, especially when those infarcts involve cognitively eloquent cortical areas bilaterally. The example illustrated in Figure 1B shows bilateral watershed infarcts that caused dementia in a 39-year-old man with bilateral carotid occlusions, who survived 24 years with mild deficits characterised by forgetfulness, word-finding and comprehension difficulties, which prevented him from returning to work, "}, {"section_title": "coVert cereBroVASculAr dISeASe", "text": "The prototypical presentation of post-stroke dementia with sudden onset or stepwise decline is often associated with overt stroke events, verified on imaging, but this is only the tip of the iceberg. An important concept that has been emerging in the field of VaD is that the CVD contributing to cognitive decline may be otherwise clinically silent. 18 This insidious form of VCI arises from covert small vessel pathology, which is very prevalent with ageing, as revealed by large population imaging studies conducted over the past 15 years. Specifically, in individuals over 65, T1-weighted magnetic resonance imaging (MRI) frequently shows small infarcts, defined arbitrarily as lesions of at least 3 mm in diameter, that are hypointense black holes on T1 and hyperintense foci on proton density/T2-weighted (PD/T2) MRI (Figure 2A ). For example, in the Cardiovascular Health Survey of 3,660 individuals, 28% of seniors, average age 75, showed silent infarcts. 19 Their frequency depends on age, with numbers increasing with each decade. 20 In the Framingham study with mean age 62, 12% had silent infarcts. 21 In fact, silent strokes may be ten times as prevalent as overt strokes, and in the same Cardiovascular Health Survey, 18% of those without baseline silent strokes showed new infarcts at five-year follow-up. 22 Because these lesions are so common, it should not be assumed that they are benign. 23 As illustrated in the Rotterdam study -a longitudinal study of 1,000 healthy elderly between 60-90 years who were followed for four years -participants with baseline silent infarcts had more rapid cognitive decline, with twice the risk of emergent dementia and five times the risk of stroke (three times the risk after correcting for other vascular risk factors). 24 It is thought that silent strokes arise mainly from an occlusion of the small penetrating arterioles that plunge in a few centimetres from the surface into the deep white matter from the pial arteries or up into the basal ganglia and thalamus from the middle and posterior cerebral arteries. Hypertension and diabetes, in particular, exacerbate arteriolar disease, causing endothelial damage with increased resistance and decreased autoregulation, ultimately occlusion and obliteration, blood-brain barrier leakage and perivascular space widening. These arterioles also tend to become more tortuous with age, a process accelerated by hypertension. 25 The result is decreased perfusion in the periventricular white matter regions, which structurally is already relatively hypoperfused, particularly in watershed areas around anterior horns and posterior horns of the lateral ventricles. 26 This arteriolar vessel disease appears to be a system-wide manifestation of vascular risk factors and ageing affecting other bodily organs, such as the eye (ischaemic optic neuropathy and macular degeneration) and kidney. 27 However, there is another type of white matter disease that is hyperintense on PD/T2 or fluid attenuation inversion recovery MRIs, often referred to as periventricular or deep white matter hyperintensities (WMH), depending on location. An even more ubiquitous ageing phenomenon than silent strokes, WMH affect the deep intramedullary cerebral venules that drain toward the deep cerebral veins around the ventricles. With human ageing, the deep medullary venules begin gradually to lay down collagen concentrically within the lumen, 28 possibly in response to chronic hypoxic conditions, modulated by genetic factors. The lumen eventually occludes, resulting in back-up and leakage, causing chronic venous vasogenic oedema in the periventricular regions, particularly around the anterior and posterior horns of the lateral ventricles. 18 This venous insufficiency leads to poor interstitial fluid circulation in the brain, which may interfere with clearance of toxic amyloid beta fragments along the periarteriolar pathways towards the cortex, possibly exacerbating the pathological amyloid cascade in AD.\nIn the Cardiovascular Health Survey sample, 95.6% of 3,301 healthy volunteers had some degree of WMH. 29 In the 20% who had extensive confluent periventricular WMH, cognitive scores were lower and there were problems in gait and balance and dexterity ( Figure 2B ). Many other studies have likewise shown an association between WMH and impaired global cognition with slowed information processing and decreased psychomotor speed. 30 There may be a threshold effect in normal elderly with about 10 cc of periventricular WMH needed to see subtle cognitive effects. 31 Small vessel disease may be a final common pathway that expresses the adverse effects of vascular risk factors on the brain and may be one of the reasons that AD, stroke and VaD share common vascular risk factors, such as ageing, hypertension, 32,33 elevated cholesterol, 32 diabetes, 34 previous strokes and the apolipoprotein epsilon e4 allele. 35 Furthermore, stroke and AD commonly co-occur as highlighted by the Nun Study in which 102 sisters aged 76-100 years were prospectively followed cognitively and at autopsy showed that less AD pathology was needed for expression of clinical dementia if infarcts were also present. 36 In fact, in the 61 sisters who met full pathological criteria for AD, only 57% met clinical criteria for dementia at autopsy. If there were cortical infarcts, 75% were demented, and if there were concomitant small lacunar strokes, 93% were demented. Thus if small vessel strokes were present, there was 20 times the risk of dementia. 36 This has been replicated by other pathological studies which show that mixed AD and VaD appears to be the most common substrate of dementia. 37, 38 In the British population autopsy study (CFAS) (median age 85), 70% of subjects had AD and 78% had cerebrovascular pathology, with small vessel disease being most common (69%). 39 In fact, AD, VaD alone and mixed AD plus CVD account for about 80% of the dementias. To complicate matters further, Lewy body disease may also be co-morbid with AD in elder autopsies, tripling the jeopardy of human brain ageing. 40 Mixed neuropathologies including vascular degeneration, small vessel damage, haemorrhage and embolic infarcts are prevalent in ageing, making so-called 'pure' AD fairly uncommon in people in their 80s and 90s. Some researchers even suggest that sporadic late-onset Alzheimer's disease itself may be better conceptualised as a vasculopathy, suggesting that the vascular pathology may drive AD. 41 Importantly, AD in turn, through deposition of beta-amyloid 1-40 in the capillaries and arterioles, can be the cause of not only occlusive vascular disease but also micro-and macro-haemorrhages.\nAn illustrative case in point is a 61-year-old lawyer, who became confused at work, bumping into objects and appearing drunk. He was brought into the emergency department by concerned co-workers, where in the absence of headache, he was found to have a right hemianopia, hemineglect, sensory extinction, mild right pronator drift, transcortical sensory aphasia (fluent speech, problems in comprehension, and anomia with intact repetition) as well as alexia, apraxia and Gerstmann's syndrome (finger agnosia, right-left confusion, acalculia and agraphia). His computed tomography (CT) scan ( Figure 3A) showed a large left parietal-occipital lobar haemorrhage. There was no secondary cause found on angiography. A follow-up gradient echo T2* MRI sequence a few weeks later showed multiple microbleeds with haemosiderin deposits, not only at the site of the overt haemorrhage but scattered throughout the brain ( Figure  3B ). He was discharged to rehabilitation, where his apraxia and aphasia improved, but difficulties in reading, mental calculations and his right visual field deficit persisted. The patient had to give up his job as a successful corporate lawyer and could no longer drive, but managed his ADLs.\nHe was lost to follow-up until seven years later when he returned to the clinic because of gradual cognitive decline and severe short-term memory problems. His MMSE at this time was 16/30, but repeat MRI showed no major change except for more diffuse cerebral atrophy. After some initial stabilisation on a cholinesterase inhibitor, he showed a gradual progressive decline, and was placed in a nursing home where, nine years after his initial haemorrhage, he was found in his bed without vital signs. Autopsy confirmed the old haemorrhages and multiple microbleeds from amyloid angiopathy and stage 5/6 AD by Braak and Braak criteria. Amyloid angiopathy, manifest as cerebral microbleeds, on standard gradient echo on 1.5T T2* MRI, was evident in 29% of AD patients in one memory clinic sample, with multiple bleeds noted in 48% of the AD group, compared to 12% in normal controls (multiple in 33%). 43 Amyloid positron emission tomography imaging detects fibrillar amyloid whether deposited in plaques or around vessels, but there appears to be an occipital predominance in amyloid uptake in patients presenting with lobar haemorrhage from cerebral amyloid angiopathy (CAA). 44 In current clinical trials of monoclonal antibodies and vaccines as potential disease-modifying therapies for AD, cerebral microbleeds are screened for on gradient echo MRI to determine eligibility and for monitoring safety. A gradient echo sequence, preferably 5 mm or less slice thickness at 1.5 T takes about five minutes to acquire and should be included when using MRI to work up dementia and also for stroke. Location in the deep nuclei or brainstem suggests hypertensive aetiology, but lobar microbleeds are usually related to CAA from AD (assuming vascular malformations are ruled out by MR or CT angiography). 45 Microbleeds can present a diagnostic dilemma for clinicians managing elderly subjects with vascular risk factors. Their presence may increase risk of cerebral bleeding with the use of antiplatelet agents or anticoagulants. However, the evidence is still somewhat conflicting on this risk, and if there is an important need for vascular protection such as coronary artery disease or previous ischaemic stroke, it is recommended that antithrombotics be used with caution. 45 The use of anticoagulants may be more problematic, so the risks should be carefully weighed. The case of the 61-year-old lawyer highlights the grim vascular manifestations of Alzheimer's pathology and underlines that AD deserves to be included as a risk factor for stroke. Alzheimer's dementia can cause cerebral haemorrhage and small vessel infarction and, as part of this vicious cycle, ischaemic damage and haemorrhagic stroke can exacerbate the development and clinical expression of AD.\nGiven the prevalence and importance of vascular cognitive impairment, new best practice stroke guidelines have suggested that cognitive screening should be performed in any individuals considered at high risk for cognitive and perceptual impairments related to vascular disease. 46 This would include individuals with hypertension, hyperlipidaemia, diabetes, age over 65, history of clinical stroke or neuroimaging findings suggesting covert lacunar or white matter disease, damage to other target organs such as kidneys and eyes, and vascular patients who present with complaints of cognitive and functional decline as the primary cause of referral or as reported during history taking (www.strokebestpractices.ca). 46 In 2005, there was an international consensus conference sponsored by the National Institutes of Health and Canadian Stroke Network to harmonise and standardise clinical, cognitive and behavioural assessment, imaging, neuropathological examination and even experimental models of VCI. 47 The neuropsychological working group was asked to recommend 60-minute, 30-minute and five-minute protocols. It emphasised executive activation (timed tasks) and strategic memory processes, but included brief tests of naming and complex figure copying, and standardised mood and behaviour questionnaires. The five-minute protocol comprised fiveword registration, recall and recognition, a six-item orientation task and phonemic fluency, in which the subject is asked to generate as many words as possible in one minute beginning with a letter (e.g. 'F').\nThe group also endorsed the Montreal Cognitive Assessment (MoCA), a 10-15-minute test that probes executive function better than the traditional MMSE, 48 which was developed to discriminate dementia cases from other mental illnesses. The MoCA successfully discriminated mild cognitive impairment from agematched controls with a specificity of 81% and a sensitivity of 80%. 49 It is freely downloadable from the internet (www.mocatest.org), translated into more than 25 languages, available in multiple forms and is being used in the Alzheimer's Disease NeuroImaging extension trial (ADNI-2). It was also endorsed by the best practice Canadian guidelines mentioned above, and is being used in many stroke prevention clinics, as well as for cognitive assessment in other disorders such as Parkinson's disease and multiple sclerosis.\nSmall vessel disease as a primary cause of dementia can present as a distinctive syndrome called subcortical ischaemic vascular dementia (SIVD). 50 It may gradually develop in a manner that mimics AD, but memory complaints are less prominent and, although patients will show impaired short-term memory retrieval (i.e. spontaneous recall), their encoding is relatively intact: there is less severe forgetting, they benefit from cueing and recognition memory is relatively intact. The most prominent difficulties are with executive function tasks, thought to reflect disruption in subcortical circuitry interconnecting posterior and subcortical brain regions with the frontal lobes. This manifests as impaired goal formulation, initiation, planning, organising, sequencing activities, abstraction and conceptualisation, focused and sustained attention, as well as carrying out goal-directed behaviour and the ability to shift from one task to another.\nOther early clinical features include gait disorder and poor balance, and sometimes urinary frequency and incontinence. Some patients may show problems with dysarthria and dysphagia and demonstrate extrapyramidal signs suggestive of Parkinsonism with bradykinesia and mild rigidity. Bilateral pyramidal tract injury from lacunes in the internal capsules of both hemispheres, can cause pseudobulbar palsy, a feature of Subcorticol ischaemic vascular dementia can also be associated with problem behaviours including marked apathy and depression, stubbornness and irritability. Patients may perform relatively well on the MMSE, which is weighted for language and memory abilities and can be relatively preserved in SIVD. However, clock drawing can bring out difficulties, particularly in placement of the hands, such as indicating 11:10. To do this properly requires abstraction (recognising that the minute hand must point to the two and be longer than the hour hand), proper spacing of the numbers and placement of the minute and hour hands (Figure 4) ."}, {"section_title": "cognItIVe enHAncement", "text": "Evidence suggests that cholinergic markers can be decreased in patients with VaD 51, 52 and some recent studies have shown that subcortical ischaemic WMH often affects the cortical cholinergic projections emanating from the nucleus basalis of Meynert. 53 In fact, in a study of 60 AD patients, a rating scale for WMH involvement of the cholinergic pathways correlated better with executive function than overall WMH load. 54 Given that pivotal trials demonstrated some benefits of cholinesterase inhibitors in AD, clinical trials were undertaken to investigate safety and efficacy in VaD.\nBriefly, in the galantamine trial, which included both VaD (~40%), patients with possible AD related to vascular disease, and possible VaD, there was less decline in cognition, global function and ADLs over a six-month period in 396 patients treated with galantamine compared with 196 controls. 55 The pure VaD subgroup, in whom the placebo group did not decline over six months, showed improvement in cognition, but not in global or daily function. A larger galantamine study targeting 'pure' VaD patients (n=788) achieved significance for cognitive improvement, a trend for global functioning, but no difference in ADL measures. 56 Two parallel trials of donepezil in patients with VaD, in which patients with clinical features suggesting AD were excluded, demonstrated consistent modest improvement on the cognitive measures, compared with the placebo group, who did not decline over six months, but effects on global function and ADLs were less consistent. 57, 58 A problem with assessing function in this population is that concomitant physical deficits associated with stroke often confound determination that daily function changes are only attributable to cognitive factors. In a combined analysis of the two donepezil studies (n=1,219), there were modest but significant benefits in cognition, global and daily functioning, particularly in instrumental ADLs, which generally correlate with executive functions. 60 In a third large six-month trial of donepezil in VaD (n=974), there were again modest beneficial effects on cognition but not on global or ADL function. 60 Interestingly, post-hoc analysis of the subgroup with hippocampal atrophy using a centralised qualitative rating on baseline CT and MRI scans showed cognitive stabilisation with treatment versus decline in the placebo group, whereas in those without atrophy, cognition improved with treatment and was stable on placebo. This suggests that hippocampal atrophy may need to be taken into account when assessing response to cholinesterase inhibitors in VaD. 60 Overall adverse event rates were similar. No deaths occurred in the placebo group, which was less than expected, and 11 deaths occurred in the donepezil group, a death rate (1.7%) similar to both treatment groups in the previous donepezil trials in VaD.\nClinical trials of memantine in VaD also showed cognitive benefit, but global and functional scores did not differ from placebo. 61, 62 Of note, most of these VaD studies were randomised, double-blind, placebo-controlled sixmonth trials, only some of which had centralised neuroimaging evaluation for relevant CVD. However, they all used the Alzheimer's Disease Assessment Scale (ADAS-Cog), which is relatively insensitive to executive function as a primary outcome measure, even though additional executive tasks were added in some trials (called the VADAS-Cog). The difficulty of evaluating daily function outcomes in the presence of physical disability from stroke also remains a challenge to VaD trials. "}, {"section_title": "concluSIonS", "text": "In summary, best practice suggests screening for VCI in all phases of overt stroke disease in which a quarter of patients are at risk of dementia, but also when silent stroke disease is uncovered, and even if vascular risk factors are present, including age and evidence of organ damage in other target organs. Executive functioning and speed of processing are important to assess in patients with VCI. Standardised testing is recommended, for example, the MoCA for a quick screen because it is more weighted for executive function. More detailed standardised assessment tools have also been suggested.\nOf note are population autopsy studies suggesting that mixed Alzheimer's and cerebrovascular disease is the most common substrate for dementia, especially in those older than 75 years. Small vessel disease is ubiquitous in our ageing population, not only in the brain but also in the body, and often co-exists with Alzheimer's disease. It is not benign and represents an important risk factor for future overt stroke, for gait problems and falls, for urinary incontinence and for cognitive and behavioural decline. The cognitive enhancing agents can modestly enhance cognition in VaD, based on pivotal trials, but functional benefits are unproven and whether cognitive benefits are sustained in the longer term has not been evaluated. Potential side effects and benefits must be weighed as well as costs and, importantly, these agents have not been approved by most regulatory agencies for use in this condition, so their use remains off-label and is not usually covered by governmental healthcare formularies.\nA major conclusion from the research of the past 20 years in VCI is that a significant goal for vascular medicine is vascular risk factor control, not just to prevent heart attack and stroke, but also dementia. In addition to appropriate, evidence-based use of pharmacotherapy, ideally customised to each individual, public health measures are important, including efforts to reduce obesity, increase exercise, encourage heart-healthy eating (emphasising high fibre and reduction in dietary cholesterol and salt) and other healthy lifestyle choices in every age group."}]