[{"section_title": "Abstract", "text": "Plausible Values (PVs) are a standard multiple imputation tool for analysis of large education survey data that measures latent proficiency variables. When latent proficiency is the dependent variable, we reconsider the standard institutionally-generated PV methodology and find it applies with greater generality than shown previously.\nWhen latent proficiency is an independent variable, we show that the standard institutional PV methodology produces biased inference because the institutional conditioning model places restrictions on the form of the secondary analysts' model. We offer an alternative approach that avoids these biases based on the mixed effects structural equations (MESE) model of Schofield (2008) ."}, {"section_title": "Introduction", "text": "Latent variable models for measuring cognitive constructs (e.g., proficiency in a particular domain of mathematics) are ubiquitous in education research and institutional reporting.\nItem response theory (IRT) models (van der Linden & Hambleton, 1997; Fox, 2010) offer the machinery needed to handle sophisticated item-and person-sampling schemes in complex survey data. Even in simpler settings these models offer proficiency estimates with high reliability and precision, due to their efficient use of assessment data. Econometricians, policy analysts, and other social scientists increasingly rely on the results of latent variable measurement models for inputs.\nStudies that characterize students achievement under different curricula, compare students belonging to different social groups, or evaluate achievement differences across countries, use estimated proficiency as the dependent variable in their analyses. Studies that focus on downstream outcomes, such as earnings in the labor market, might assess the direct effect of academic proficiency on the outcome, or control for proficiency in trying to assess the influence of other variables of interest. In these latter cases estimated proficiency is an independent variable in the analysis.\nWhether latent proficiency variables play the role of dependent or independent variables, the issue of measurement error must be addressed. If the proficiency variables were estimated without error, they could be used directly with no adjustments. If, as is usually the case, proficiencies are estimated with some uncertainty, it will affect both the precision and bias of estimated effects. Precision can be accurately reported using appropriately adjusted standard errors or similar calculations. Bias must be dealt with by conditioning proficiency estimates on an appropriate set of covariates.\nThe appropriate conditioning model has been discussed at length by Mislevy (1991) , Mislevy, Beaton, Kaplan & Sheehan (1992) and others. A key motivating application is the release of data for secondary analysis by large institutional surveys, such as the U.S. National Assessment of Educational Progress (NAEP, Allen, Carlson & Zelenak, 1999) , or other largescale national and international surveys of education that have a similar structure (e.g., the National Adult Literacy Survey, NALS, Kirsch, et al, 2000; and Trends in International Mathematics and Science Study, TIMSS, Olson, Martin & Mullis, 2008) . In a data release that provides individual-level proficiency measures, a fixed number of multiple imputations (Rubin, 1987 (Rubin, , 1996 for each individual's ability are released. These imputations, known as plausible values (PVs) in this context, are adjusted to account for degraded precision and bias due to measurement error, in two ways. First, they are Monte Carlo draws from posterior proficiency distributions for each individual, and hence incorporate all sources of uncertainty (including measurement error). Second, the posterior distribution is conditioned not only on the individual responses to items on a cognitive assessment, but also on a set of demographic and other background variables. PV methodology provided in Mislevy (1991) , Mislevy et al. (1992) , and other sources allows secondary analysts to account for measurement error in subsequent analyses by employing PVs in appropriate ways (e.g., Mislevy, 1991 , and Von Davier, Gonzalez & Mislevy, 2009 ). Typically, agencies release five PVs for each individual, along with instructions for using PVs to estimate regression coefficients and other effects. (For more on current PV methodology see Li, Oranje & Jiang, 2009 ).\nGiven standard practice, there is a subtle but important question about the conditioning model used to generate PVs: What data, aside from the item response data themselves, should be incorporated in generating the posterior distribution from which PVs are drawn?\nBased on an argument developed by Mislevy (1991) , institutions that release PVs typically condition on a fixed but extremely large set of covariates to account for the large universe of studies that a secondary analyst might undertake. In particular, any contrast (such as a comparison between mean proficiencies in two social groups of interest) that a hypothetical secondary analyst might be interested in must be included, directly or by proxy, in the condi-tioning model used by the institution to generate PVs. In Section 2 and Section 3 we review this argument and see that when proficiency is a dependent variable the release of institutional PVs based on an extremely large conditioning model allows a secondary analyst to conduct estimation that is unbiased but perhaps statistically inefficient. When proficiency is an independent variable, however, we provide a disquieting result. In Section 4 we show that secondary analysis is susceptible to substantial wrong-model bias when using institutional PVs with the standard methodology prescribed for them. Because of the complex nature of the conditioning model, a secondary analyst has essentially no chance of specifying a model consistent with the survey institution's modeling choices. The wrong-model bias involves not only the regression coefficient for proficiency in the model, but also regression coefficients for other predictors, whether they are latent or not.\nAn immediate consequence of these results is that the use of institutional PVs based on a large, fixed conditioning model may introduce substantial bias when proficiency is not the dependent variable in a secondary analysis. More broadly, analysts who wish to use latent variables to predict other outcomes should use conditioning models that are customized to their particular prediction problem; in Section 5 we discuss workable machinery to do this.\nOur results are stated in considerable generality. Nevertheless we show an example in Section 6 to demonstrate the size and direction of the bias when the secondary analyst's model is not compatible with the institution's conditioning model. In the example, the structural model of interest is a linear regression model in which proficiency serves as an independent variable predicting weekly wages and the measurement model is a standard IRT model. We use data from the 1992 National Adult Literacy Survey (NALS) to show the wrong-model bias resulting from including Y in the conditioning set of the PVs. We demonstrate the bias that occurs when we do not include the covariates in the conditioning set in our model built from scratch."}, {"section_title": "Modeling Components for the Analysis of Education Surveys", "text": "Before discussing the key results of Mislevy (1991) and Mislevy et al. (1992) in Section 3 and exploring their extension to models that use proficiency to predict other outcomes in Section 4, it is important to describe and discuss the two sets of analysis that modern large scale education surveys are designed to serve, and to discuss, in abstract terms, the tools that they use to make inferences from the survey data.\nIn order to focus the discussion on these two sets of analysis and their inferential tools, we will ignore some complexities of education surveys, such as complex student-sampling designs (which are generally accounted for with design-based survey weights and jackknife or Taylor linearization variance adjustments), and complex item-sampling designs (which are generally accounted for with incomplete likelihoods in the measurement model, e.g., items not administered are missing completely at random or MCAR by design). All of these complexities, and the tools developed to address them, are crucial for practical inference from education survey data, and are well described in the technical documentation for these surveys (e.g., Allen, Carlson & Zelenak, 1999; Allen, Donoghue & Schoeps, 2001; Kirsch et al., 2000; NCES, 2009; and Olsen, Martin, & Mullis, 2009 ). But to review them in detail would distract from the essential structure of the inferential problems faced both by primary analysts working on behalf of the survey institution, and by secondary analysts who use public-use and restricted-use data to answer questions not envisioned in the reports published by the survey institution.\nIn Section 2.1 we review the survey institution's measurement model, a generative psychometric model that describes the relationships between particpants' proficiency in a particular cognitive domain, and their responses to particular cognitive items in the survey. In Section 2.2 we review the survey institution's population model, also known as the condi-tioning model, which describes variation in cognitive proficiency across groups defined by demographic, jurisdictional, and other background covariates. We then briefly discuss in Section 2.3 the kinds of inference made by primary analysts working on behalf of the survey institution. Finally, in Section 2.4, we discuss two basic classes of models used by secondary analysts to explore research questions not contemplated in the survey institution's reports."}, {"section_title": "The Measurement Model", "text": "For simplicity we suppose there are N participants (students or other respondents) in the education survey and J test items. We denote the response of participant i to question j as X ij , and the set of all responses as\n. We also denote the latent proficiency of the i th participant as θ i , and the set of all N proficiencies as θ = (θ 1 , . . . , θ N ). The measurement model\nis the generative model chosen by the survey institution to model the likelihood of observing response matrix X, given latent proficiencies θ. The measurement model may depend on other parameters, which do not concern our analysis here.\nThe formulation in (1) is intended to be quite general and cover a broad variety of possible stochastic models for measurement, including:\n• Classical unidimensional dichotomous item response theory (IRT) models, which take the form\nwhere X ij = 0 or 1, indicating a wrong or right response, θ i is a single real number indicating a level of proficiency, P (θ) is a standard item characteristic curve, such as the 2-parameter logistic (2PL) model, and γ j is a set of item parameters for item j, such as discrimination a j and difficulty b j , in which case γ j = (a j , b j );\n• Multidimensional IRT (MIRT) models, in which θ i is a vector of d real numbers,\n. . , θ di ), denoting proficiencies on d latent constructs, and P (θ) and γ j are modified accordingly;\n• Polytomous variations on the IRT or MIRT models above, in which X ij can take values in a discrete set of categories, and P (θ) and γ j are modified accordingly;\n• Cognitive diagnosis models (CDMs), in which X ij may take dichotomous or polytomous values, θ i is a d-dimensional vector of discrete indicators denoting the presence or absence of d specific skills or knowledge components, and P (θ) and γ j are modified to specify a specific CDM such as the DINA or DINO model;\n• Factor analysis (FA) models in which X ij are continuous responses, θ i is a vector of continuous factor scores, and p(X|θ) is a typical FA model;\n• Other models in which X ij is a more complex (multivariate, graphical, etc.) response, and/or θ i is a more complex proficiency variable, and/or the measurement model p(X|θ) may reflect violations of, or variations on, many standard assumptions such as local independence, monotonicity, experimental independence, complete data, etc.\nIn most modern large-scale education surveys, the measurement model (1) is some form of an IRT or MIRT model. Whatever the measurement model is, it is usually pre-calibrated so that any item parameters γ 1 , . . . , γ J can be thought of as fixed and known for all subsequent analyses. We will assume this in our development below. In the case that the γ j 's are estimated along with other quantities, however, there is no essential change in the message of our work."}, {"section_title": "The Population (Conditioning) Model", "text": "In a typical large-scale education survey, the survey institution is primarily interested in reporting on features of the population distribution\nThe subscript PA in (2) is intended to remind that this distribution is the focus of the primary analysis performed by the survey institution or its contractors. The variable Z denotes an entire set of conditioning variables that are of interest in the primary analysis.\nThese might typically include\n• Primary reporting variables;\n• Survey design variables;\n• Jurisdictional or institutional variables that describe the institutions (typically schools, school districts, governmental jurisdictions, etc.) that the individual participants (typically students) are members of;\n• Variables concerning participants' education contexts, such as teacher questionnaires;\n• Participant demographic variables, such as gender, race/ethnicity, age, SES;\n• Other background variables for individual participants, such as education experience, number of hours of TV watched, which might be collected through a background questionnaire administered to individual participants.\nThe conditioning variables Z in our setup subsume both the collateral variables Y and the design variables Z in the setup of Mislevy (1991) and Mislevy et al. (1992) . The distinction between design variables and collateral variables is not important for our development, and we wish to reserve Y for the (observable) dependent variable in a prediction model.\nThe model in (2) is highly multivariate in both θ and Z. Indeed, Z generally spans \"reporting variables\" that serve primary analyses and reports by the survey institution, other demographic, background and jurisdictional variables that may serve secondary analysts, and many interactions between them. Thus, (2) usually conditions on a large set of covariates Z, and so it is also known as the conditioning model for the survey."}, {"section_title": "Primary Analysis: Reporting and Plausible Values", "text": "It is typically not possible to do inference on small jurisdictional units or individual participants, for a variety of legal and technical reasons. Many education surveys, such as the National Assessment of Educational Progress, operate under laws that proscribe the public identification of individual students, schools, or organizations that participate in the survey.\nMore broadly, it is generally unethical to break confidentiality and privacy commitments typically made to survey participants. At a more technical level, the participant sample is usually not designed to provide reliable inferences at the level of a school or even a school district of moderate size (and would be prohibitively expensive if it were so designed), and the number of cognitive items asked of any individual participant is small enough (to manage time and fatigue constraints) that inference for an individual is usually not reliable either.\nInstead, the targets of inference for primary analysis by the survey institution are typically means, percentiles, and other summaries for major reporting groups, defined by reporting variables such as race/ethnicity, gender, age, region, larger jurisdictions, as well as some background variables.\nThe \"institutional model\" described by equations (1) and (2) is essentially a two-stage generative model for the cognitive data collected in the survey: first, θ is generated from its conditional distribution given Z, and then X is generated from its conditional distribution given θ. The objects of inference for primary analyses are features of the θ distribution, after collecting the survey data. This suggests a Bayesian, or at least empirical Bayes, approach. Indeed, the measurement model in (1) can be though of as a likelihood for θ, and the conditional model in (2) can be thought of as a prior distribution for θ. Then the posterior distribution of θ may be written as\nunder the assumption that X ⊥ ⊥ Z | θ, which is usually true by design of the measurement process producing X (if the measurement process is well-designed, X should be conditionally independent of any other variable, given θ). In typical settings, a great deal of X is missing The summaries (e.g., conditional means or percentiles) produced in primary reports by the survey institution are either functionals of the posterior distribution p P A (θ|X, Z)-that is, they can be obtained by computing the integral\nfor some appropriate function s(θ, Z)-or they can be derived from functionals of p P A (θ|X, Z).\nThe quantities in (3) and (4) may be estimated using Bayesian methods (Johnson & Jenkins, 2005) , or marginal maximum likelihood and other methods (Allen, Donoghue & Schoeps, 2001 ).\nFollowing the work of Mislevy (1991) , Mislevy et al. (1992) , and others, many survey institutions compute and publish plausible values (PVs) for θ in large scale education surveys.\nPVs, known in the statistics literature as multiple imputations (Rubin, 1996) "}, {"section_title": "The Secondary Analyst's Research Models", "text": "In addition to primary reports generated by the survey institution and its contractors, important substantive and methodogical work has been performed by secondary analysts (NCES, 2008; Robitaille & Beaton, 2002) , that is, researchers acting independently of the survey institution, investigating questions outside the scope of the primary reports. Substantive questions for secondary analysts often revolve around some feature of a distribution such as\nwhere the subscript SA is intended as a reminder that this is a model chosen by the secondary analyst. For example, if the components of θ = (θ 1 , . . . , θ N ) are continuous and unidimensional, andZ can be separated into participant-level piecesZ = (Z 1 , . . . ,Z N ), then p SA (θ|Z) might be expressed as a linear model\nIn generalZ i need not be univariate, in which case β 1 is a vector of regression coefficients.\nIn additionZ may or may not be identical to Z in (2). Indeed, the most interesting and innovative secondary analyses usually involveZ not contemplated by the survey institution.\nBecause θ appears as the dependent variable in the regression form of (5), we refer to models of the form (5) as θ-dependent models.\nThe object of inference in the θ-dependent case is typically some function s(θ,Z), which captures some feature of p SA (θ|Z) of interest. For example in the linear regression case, the secondary analyst might be interested in the least-squares estimate of β 1 ,\nwhere Cov(·, ·) and Var(·) denote sample covariance and variance calculations suitable for the design of the survey. More generally, the posterior distribution of β 1 ,\nand similar quantities, may also be of interest.\nAnother class of models considered by secondary analysts, especially those interested in using cognitive proficiency in predicting later outcomes Y , is of the form\nUnder suitable assumptions, this might also be expressible as a regression model such as\nwhere, once again,Z may or may not be identical to Z, and either or both of θ i andZ i might be multidimensional. Since θ appear as an independent variable in the regression form of (7), we refer to models of the form (7) as θ-independent models.\nThe object of inference in the θ-independent case is again some function s(θ, Y,Z), which now captures some feature of p SA (Y |θ,Z) of interest. In the linear regression case, the secondary analyst might be interested in the least-squares estimate of some regression coefficient(s) or the posterior distribution of the regression coefficient(s), for example."}, {"section_title": "The θ-dependent case", "text": "We consider first the θ-dependent case. Here the secondary analyst has a research model of the form of (5), i.e.\nin which θ appears as the dependent variable, and the object of inference is a function s(θ,Z) related to p SA (θ|Z). Because θ is completely missing, the most the secondary analyst can hope to learn is some feature of a marginal quantity such as\nWe can now state, in modern terms, the problem identified and solved by Mislevy (1991) and Mislevy et al. (1992) : What tool can the primary analysts provide to the secondary analyst, so that (a) an integral of the form of (9) can be calculated or approximated appro-priately, and (b) the results of the secondary analysis are numerically consistent with the primary survey reports? The answer is the publication of institutional PVs, as discussed above at the end of Section 2.3.\nWith institutional PVs the secondary analyst can approximate the quantity\nwhich is a functional of the form (4). The following theorem lays out conditions under which calculation of (10) leads to an unbiased estimate of s(X,Z), providing the underlying justification for the use of PVs as outlined by Mislevy (1991) and subsequent authors.\nis an unbiased estimate of s(X,Z).\nBy the notationZ ⊆ Z, we mean that the σ-field generated byZ is a subfield of the σ-field generated by Z (see Billingsley, 1986 , for definitions). Informally, this means thatZ is a deterministic function of Z.\nProof. We calculate\nby the \"telescoping\" property of conditional expected values, whenZ ⊆ Z (Billingsley, 1986, p. 470) . 2\nBiases arising whenZ ⊆ Z have been illustrated by Mislevy et al. (1992 ), von Davier et al. (2009 ), and Carstens & Hastedt (2010 .\nThe standard procedure for using institutional PV's, described by Mislevy (1991, pp. 181-182) , amounts to calculating\nfor each of M imputations θ m drawn from p P A (θ|X, Z), and then averaging. This produces\nthe Monte Carlo numerical approximation to s(X,Z, Z) in (10). A further between/within variance calculation (Mislevy, 1991, p. 182) approximates the posterior variance Var P A [s(θ,\nTheorem 3.1 works for any function s(θ,Z), but it is useful to know that the same result applies when computing formal posterior distributions of parameters of interest, such as the regression coefficient β 1 in (6). The corollary below extends Theorem 3.1 to this case, as well as any other case where β is some parameter (or set of parameters) of interest.\nCorollary 3.1. Let β be a parameter in the model p SA (θ|Z) and let s(θ,Z) = p SA (β|θ,Z).\nIfZ ⊆ Z and β ⊥ ⊥ X | θ,Z, then s(X,Z, Z) is an unbiased estimate of p SA (β|X,Z).\nThe condition β ⊥ ⊥ X | θ,Z is essentially guaranteed by design of the measurement process leading to X.\nProof. Observe that\nwhere the second to last line follows from the assumption that β ⊥ ⊥ X | θ,Z. 2 Theorem 3.1 gives a positive result, in the case that the secondary analyst'sZ is a function of the survey institution's Z. SinceZ is \"invented\" by the secondary analyst, however, there is a good chance thatZ ⊆ Z. In that case, the amount of bias is simply\nWe generally expect that this bias should decrease as the number of items J in X increases, or equivalently, as the reliability with which θ can be measured by X increases. Mislevy (1991) shows this in the case of a classical true score theory model, and Mislevy et al. (1992) illustrate the same point numerically with an application to SAT testing data. Here we give\nan informal argument that this should be true even more generally. Note that the term on the right in (11) is\nIn any measurement model for which there is a consistent estimatorθ(X) based on the response variables X, we expect that θ ⊆ X will become true as J grows (Ellis & Junker, 1997 , show a somewhat stronger result for general class of locally independent monotone latent variable models, for example); hence p(Z|θ, X)/p(Z|X) → 1. Moreover, as J grows, p(θ|X) should converge to a point mass at the participants' true θ values, θ T RU E . 2 Thus, as\nA similar line of reasoning, beginning with the inner expected value E P A [s(θ,Z)|X, Z] in the term on the left in (11), shows that this term too converges to s(θ T RU E ,Z) as J → ∞, and hence the bias (11) vanishes as J grows.\nSinceZ is determined by the secondary analyst long after the survey institution has done the primary analyses, survey institutions try to make Z as large as possible, to accomodate any possibleZ that secondary analysts may be interested in. A typical conditioning model (e.g., Kirsch et al., 2000; Mislevy et al., 1992; Dresher, 2006) will involve Z containing all of the variables listed in Section 2.2 as well as their two-way interactions. This generally produces a Z with many hundreds of columns. This is reduced by principal components analysis (PCA) to a Z with just a few hundred columns and this is used for all subsequent primary analyses, including the generation of plausible values. Such a large Z is thought to contain a good proxy for anyZ that a secondary analyst could define, so thatZ ⊆ Z nearly holds, and the bias (11) in s(X,Z, Z) is minimal, even when θ is not measured with high reliability.\nAlthough the construction of such a large Z may seem awkward, it represents an elegant solution to the problem of making primary and secondary analyses logically and arithmetically consistent. For both primary and secondary analysts, computation is simply a matter of summing over plausible values to approximate the functional in (4). If the primary and secondary analysts are using the same set of plausible values, based on a Z designed to contain good proxies for any possibleZ, then the primary reports are margins of the table of all possible secondary analysis results. If we are able to aggregate across secondary analyses to produce a reporting quantity such as the mean proficiency for female students, this must produce the same answer as the primary analysis did by calculating that mean directly, since it amounts to summing across plausible values in a different order. Thus any inconsistencies between primary and secondary analyses must be due to arithmetic errors, or conceptual errors in setting up the quantity to be computed, rather than differences in computational methods or tools.\nFinally we note in passing that making Z much larger thanZ causes some inefficiency, as can be seen from examining the variability of s(X,Z, Z) over random replications of the survey,\nwhere the last line follows directly ifZ ⊆ Z. However, since there are no replications of surveys in practice, this inefficiency is usually overlooked."}, {"section_title": "The θ-independent case", "text": "Suppose now that the secondary analyst has a research model of the form of (7), namely\nin which θ now plays the role of an independent variable, and again the secondary analyst is interested in a quantity of the form s(θ, Y,Z). Once again, θ is completely missing, and so it is natural to consider a marginal quantity like\nBy replacingZ with (Y,Z), we immediately obtain natural corollaries to Theorem 3.1 and Corollary 3.1. For these corollaries, stated below, we also define\nfor the institutional posterior distribution p P A (θ|X, Z), perhaps available to secondary analysts through the publication of plausible values. We then immediately obtain For ease of exposition, we consider the case in which Z = (Y,Z); as we see in Section 6 below, we can expect a similar behavior in the more general case Z ⊇ (Y,Z)."}, {"section_title": "Theorem 4.1. p(Y |θ,Z) is completely determined by p(θ|Y,Z) and the conditional distribution p(Y |Z).", "text": "Note that p(Y |Z) is entirely determined by the observable relationship between Y and Z; consequently p(Y |θ,Z) is completely determined once p(θ|Y,Z) is specified.\nProof. Observe that\nFor the denominator in (12), we note\nClearly, equations (12) and (13) Proof. We first observe that, as in the proof of Theorem 4.1,\nwhich again depends only on p(θ|U,Z) and p(U |Z). Then,\nIf Y ⊥ ⊥ U |θ,Z then the first term under the integral in (14) reduces to p(Y |θ,Z), and there is no constraint. However, if Y ⊥ ⊥ U |θ,Z, then (14) determines p(Y |θ,Z). 2\nTaken together, these results are pessimistic about the use of standard PV methodology to explore predictive inference using θ and other covariates: in order to ensure unbiased estimation of s(X, Y,Z) by s(X, Y,Z, Z), the variable to be predicted, Y , must be in the institutional conditioning model, and the secondary analyst's model p SA (Y |θ,Z) must be the one implied by the survey institution's conditioning model. The bias when these conditions are violated can be substantial, as we will show below in Section 6, and may lead to incorrect scientific or policy conclusions.\nAs survey institutions typically release only the plausible values and not the details of the model associated with them, it is unlikely that the secondary analyst can specify p SA (Y |θ,Z)\ncorrectly. Thus, for predictive inference using θ, the secondary analyst is better off building a model from scratch, not making use of institutional PVs. We turn to this process in the next section."}, {"section_title": "A Workable Approach to the θ-independent Case", "text": "In Section 4, we argued that the usual plausible values methodolgy, using institutional PVs generated from a large, fixed conditioning model in order to calculate unbiased estimates of \n(b) The secondary analyst's posterior distribution for β is\nThe condition X ⊥ ⊥Z, β|θ is essentially guaranteed by good measurement practice in constructing X as a measure of θ. The condition θ ⊥ ⊥ β|Z is quite innocuous in the θ-independent case, as we shall see after the proof.\nProof. For part (a), we observe\nwhere the second line follows from the law of total probability and the third line follows from the conditional independence assumptions.\nFor part (b) we observe that"}, {"section_title": "The result now follows by applying part (a). 2", "text": "Note that Y is forced to be in the institutional PV conditioning model in Corollary 4.1, but it does not appear in the secondary analyst's \"conditioning model\" p(θ|Z) in Proposi- (Schofield, 2008; Junker, Schofield, and Taylor, 2012 ).\nThe MESE model takes the form\nwhere θ i ,Z i , and Y i are defined as before.\nAlthough it is expressed in hierarchical Bayes form here, it is not difficult to see that the MESE model is a generalized structural equations model (SEM; e.g. Bollen, 2002) . In particular, it is an extension of the MIMIC model (Joreskog and Goldberger, 1975 ) that allows for general data types and additional observed covariates. The MESE model allows for examination of the conditional effect ofZ on the dependent variable Y after controlling for θ, through the parameter(s) β. It is a \"mixed effects\" model, because the latent variable is modeled as a random effect while the other covariates in (15) \nand with logistic regression components, in (15).\nEquation (16) Equation (17) is a prior for θ; it is the secondary analyst's \"conditioning model.\" But, as argued above, because the problem being solved now is different from the one that institutional PVs were designed to solve, (17) must have a form different from the institutional conditioning model. In the MESE model, the conditioning model plays the role of a prior on θ and it must condition onZ that appear as covariates in (15), but cannot condition on dependent variable Y .\nNote that (16) uses item response data, which the survey institution must make available to secondary researchers. While these responses are available for some surveys (NCES provides item responses for those researchers who have restricted use data licenses in many surveys), many other surveys (e.g., the 1979 and 1997 National Longitudinal Survey of Youth) do not publish item responses for all cognitive tests. Items need not be released, but rather item responses along with information about the construction and design of the test (e.g., item parameters and information on the model used to construct the test) are sufficient information for a MESE model to estimate the parameters in (15)."}, {"section_title": "Data Example: Racial Wage Gaps in the 1992 National Adult Literacy Survey", "text": "The wage regression literature in econometrics provides an important example of the analysis we have been discussing. A typical problem in this area examines wage gap between two social groups; the typical solution is to build a regression equation that accounts for different factors that could affect the wage differential, while controlling for cognitive proficiency through test scores.\nTo illustrate our theoretical results, we examine the issue of racial wage gaps with the hope of decomposing the gaps in order to understand the impact of the racial differences in cognitive proficiency on differences in labor market earnings. The model of interest is\nwhere wage i is weekly wage rate, θ is a measure of cognitive proficiency (in this case Englishlanguage prose literacy), Black and Hispanic are indicator variables for race/ethnicity identification (with non-Hispanic white serving as the omitted catagory), and W is a vector that includes potential labor market experience, region, and urban status. Here, the variables Black i , Hispanic, and W i compriseZ.\nOur analysis is a wage regression of the form seen in the literature (e.g., Neal and Johnson, 1996; Lang and Manove, 2006; and Junker, Schofield and Taylor, 2012) , though we use different data than Neal and Johnson (1996) and Lang and Manove (2006) . Of primary interest is in estimates of the regression coefficients in front of the racial indicator variables (β 2 andβ 3 ) as they provide information on racial differences in labor market earnings after controlling for differences in cognitive proficiency. Accurate estimates can inform policy with the goal of targeting appropriate resources to address the earnings differential.\nThe data come from the 1992 National Adult Literacy Survey (NALS; Kirsch et al., 2000) which includes an individually-administered household survey of 24,944 adults ages 16 and over. The NALS is comprised of two sets of questions-standard demographic questions (e.g., race, gender, labor force behavior, wages, age, etc.) and items that measure functional literacy in three domains: prose, document, and quantitative.\nThe NALS contains 165 items (41 prose literacy, 81 document literacy, 43 quantitative literacy) to test the literacy skills of the examinees. Because it was deemed impractical to administer every item to every respondent, each respondent was randomly administered a booklet designed via the Balanced Incomplete Block (BIB; Beaton and Zwick, 1992) spiral design which contained a representative sub-sample of approximately one-quarter to onethird of the full set of 165 items. On the prose scale, each individual received a booklet that contained between eight to thirteen prose items rather than the full 41 items.\nSince the primary purpose for conducting the NALS survey is to provide information on the literacy skills of U.S. adults, population estimates are of more interest than individuallevel literacy scores. Consequently, the NALS data set does not contain individual literacy proficiency estimates, but instead contains five PVs per content area and individual to aid in calculating population estimates through the marginal estimation procedures outlined in Section 3 (with further information available in Mislevy, 1991). Kirsch, et al. (2000) describe the conditioning model used in the production of plausible values for the NALS data. The NALS conditioning model is a \"a normal multivariate distribution . . . with a common variance, S, and with a mean given by a linear model with slope parameters, G, based on the first approximately 100 principal components of several hundred selected main effects and two-way interactions of the complete vector of background variables\" (Kirsch, et al., 2000, p. 180 If we were to use institutional PVs in our analysis, Theorem 4.1 and Corollary 4.3 suggest that the PV conditioning model will determine a unique form for p P A (Y |X, θ, Black, Hisp, W ).\nBecause of the complex nature of the conditioning model used by the survey institution, it is impossible for us to determine the functional form of p P A (Y |X, θ, Black, Hisp, W ). Additionally, it is highly unlikely that our wage regression shown in (19) will be compatible with Black, Hisp, W ) . For these reasons, we expect to see \"wrong model\" bias if we use the survey institution's PV's for an unbiased estimate of β in our secondary analysis.\nIn our empirical analyses, we restricted our attention to the 4950 men in the study who are between the ages of 25 and 65, work full time, report a wage, and who self-report as Black, Hispanic, or white. Sample characteristics are available in Table 1 . We note a few features of the data. On average, white men earn more than black and Hispanic men and white men have higher average prose literacy scores than black men or Hispanic men. We report estimates of the regression coefficients for four different model specifications in Table 2 . In the first specification, the explanatory variables include two indicator variables for racial identification-Black and Hispanic, potential experience entered as a quadratic where potential experience is defined as the number of possible years in the labor force (defined age − years of schooling − 6 ), and indicator variables for census regions (midwest, south, and west) and urban settings. Specification 1, shown in column (a), provides a \"baseline\" for the black-white and Hispanic-white wage gaps without controlling for prose literacy proficiency.\nThe next three specifications control for prose literacy proficiency but do so in different ways. In the second specification, shown in column (b), we include a measure of prose literacy proficiency using the plausible values provided by the survey institution with the saturated conditioning model. We follow Mislevy (1991) and Kirsch, et al. (2000) by estimating the regression five times (each with a different prose plausible value as the measure of θ). The best estimate of the regression coefficients is the average of the five regression coefficients obtained from the analyses using different sets of plausible values. We estimate the standard errors of the regression coefficients by using the between/within calculation recommended by Mislevy (1991, p. 182 ).\nIn the third and fourth specifications, shown in columns (c) and (d), we jointly estimate θ and the regression coefficients using the Mixed Effects Structural Equations (MESE) model described in Section 5. In column (c) we report estimates from a MESE model where we specify the conditioning model to include race, experience, census region, and urban setting and no other variables. For this example, the MESE model takes the form\n2 ), (20)\nwhere y i is log(wages) and W i are the additional variables we control for that include experience, census region and urban status indicator variables. In the fourth specification, we replace (22) with a conditioning model that does not condition on any covariates: θ i ∼ N (0, 1).\nWe use a Markov Chain Monte Carlo (MCMC) procedure to estimate the regression coefficients using WinBUGS software (Spiegelhalter, Thomas, and Best, 2000) . We use a 3-PL IRT model as the measurement model and fix the item parameters at the estimates reported in Kirsch, et al. (2000) . and who answered at least one prose literacy item. All regressions also control for potential experience entered as a quartic, census region (entered as dummy variables), and urban setting (entered as a dummy variable). PV estimates in column (b) employ the recommended procedure (Mislevy, 1991) for combining regression results for multiple imputations. PV estimates use the NCES saturated conditioning set which includes wage (the dependent variable) variables correlated with wages, race, experience, census region, and urban setting. The MESE model estimates (columns (c) and (d)) are posterior means reported from estimating a MESE model. In column (c), the conditioning set includes race, experience, census region, and urban setting. In column (d) the conditioning set includes no covariates. Literacy has been scaled such that it is the same in column (b) -(d) for comparison purposes. Table 2 shows significantly different results depending on the conditioning model used.\nBased on arguments made in Section 4 and Section 5, we have reason to suspect that there are biases in columns (a),(b), and (d). In column (b), the PVs generated by the survey institution include wages in their conditioning model, so there is likely a wrong-model bias in the estimation of regression coefficients using those PVs for our specification. In column The policy implications can vary greatly, depending on the set of parameter estimates used. For black wage earners, for example, specifications (b) and (d) suggest a significant wage gap on the job even after controlling for prose literacy. If estimates like these were used to inform policy, they might lead to a policy aimed at reducing on-the-job wage discrimination. When controlling for literacy with the proper conditioning model in specification (c), the coefficient on black is no longer statistically significant, suggesting that the wage gap observed in model (a) may be due to differences in the average accessibility and quality of educational experiences for black men rather than labor market discrimination. A similar phenomenon happens with Hispanic workers; here the MESE model with the proper conditioning set in specification (c) estimates about one-third of the marginal estimate in (a), although it remains significantly different from zero. Specification (d) which has a conditioning set that is too small, suggests that the Hispanic-white wage gap is almost twice that of the estimate in (c) leading once again to different conclusions about possible policy interventions.\nThis empirical exercise demonstrates the wrong model biases that can result from using institutional PVs in a secondary analysis that is not compatible with the conditioning model used to procure the PVs. Our secondary analysis is not a rigged example; regressions of the form (19) are used in many studies in labor economics (as well as in other areas of the social sciences). Using real data, we have demonstrated what we argued in Section 4 analytically: institutional PVs will produce biased estimates of regression coefficients when the secondary analysis is not compatible with the survey institution's conditioning model."}, {"section_title": "Discussion", "text": "Institutional plausible values (PVs) are multiple imputations from an institutional posterior distribution p(θ|X, Z) based on a large latent regression model known as a \"conditioning model.\" Institutional PVs were designed for, and are successful at, allowing secondary analysts to produce unbiased estimates of quantities associated with a \"small\" posterior distribution p(θ|X,Z) related to the secondary analyst's research questions, using machinery from the larger institutional posterior distribution. This situation, which we call the θ-dependent case, covers all primary and much secondary analysis of education survey data: characterizing θ in one or more subgroups of interest. In the first part of this paper, we have reformulated basic results for this case, going back to Mislevy (1991) , in modern and fairly general notation. We have shown that the utility of PVs is likely to extend across a much larger range of measurement and conditioning models than has been considered previously in studies of PV methodology.\nWe have also considered the θ-independent case, in which an outcome variable Y is predicted from θ and other covariatesZ. Such models are often expressed as regressions for Y onZ and θ, and can be found in many social science settings, from predicting end-of-year exams using progress in a tutoring system throughout the year (Ayers & Junker, 2008) to understanding social group-based gaps in wages after accounting for cognitive status (Junker, Schofield & Taylor, 2012) , to predicting post-secondary choice and success (Schofield, under review) .\nUnfortunately our results show-both theoretically and empirically-that standard institutional PVs cannot lead to the same sorts of unbiased estimates of posterior quantities in the θ-independent case. Indeed the only time that unbiased results are guaranteed using standard PV methodology in the θ-independent case is if the institution releases enough information that a secondary analyst could build a θ-independent model compatible with the conditioning model that generated the PVs.\nThere is, however, a fix at hand. Instead of trying to use PVs in the θ-independent case, secondary analysts can build the relevant model for their research questions, from scratch, largely ignoring the institutional machinery. One such model, the Mixed Effects Structural Equations (MESE) model, offers considerable flexibility, great initial success, and can account carefully for the latent structure and its unreliable measurement.\nIn order to use the MESE model or any related model, the secondary analyst must have access to the individual responses of survey participants to individual items on the cognitive portion of the survey, and ideally also the measurement model that the survey institution used to build the θ scale. The advantage of doing so is that secondary analyst can take advantage of the measurement model that the survey institution designed to characterize carefully and account for the measurement uncertainty in the θ-independent model. Other approaches-such as classical errors-in-variables or instrumental variables approaches-require additional, often untested and untenable, assumptions to account for the measurement error.\nFinally, while we focused our discussion and example on IRT models and linear regression models, there is nothing in our analysis that requires this structure. The points we raise here are issues for a wide class of models and a wide class of latent variables. The proper conditioning set for latent variables used as covariates is necessary for the consistency of estimates."}]