[{"section_title": "Introduction", "text": "The novel coronavirus disease 2019 (COVID-19) is an emerging epidemic responsible for infecting lots of people and killing lakhs globally since the first report till today, according to the World Health Organization (WHO). The WHO China Country Office has informed of cases of pneumonia unknown aetiology detected in Wuhan, Hubei Province of China, on 31 December 2019. A total of 44 case patients with pneumonia of unknown aetiology have reported to WHO by the national authorities in China since 31 December 2019 through 3 January 2020. Further, WHO received the information from the National Health Commission China that the outbreak is associated with exposures in one seafood market in Wuhan on 11 and 12 January 2020. The Chinese authorities identified a new type of coronavirus, which has been isolated on 7 January 2020. China shared the genetic sequence of the novel coronavirus for countries to use in developing specific diagnostic kits. During the period 13-20 January 2020, the Ministry of Public Health, Thailand, reported the first imported case of laboratoryconfirmed novel COVID-19 from Wuhan, China, and the Ministry of Health, Labour and Welfare, Japan (MHLW), reported an imported case of laboratory-confirmed COVID-19 from a e-mail: santoban@gmail.com (corresponding author) Particularly, some countries are in the process of measures public health and social processes based on local epidemiology, while others are considering shrink these interventions. Besides, countries have employed public health and social measures based on local risk assessments, such as full lockdown, restricted local movement, and educational institutes are implementing the virtual classes and industries are encouraging work from home, and regulated universal travel measures. Numerous papers have appeared modelling the forecasting the trends of epidemiology of the disease [1] [2] [3] [4] [5] , and many analyses have been done for the currently available epidemic data [6] [7] [8] . The analysis made by using practical data shows that the power law kinetics with fractal exponent provides a better fit to the current data for the number of deaths and spared rate compared than the classical epidemiological approach that assumes an exponential growth of the disease [9] [10] [11] [12] . The idea of fractal dimension is useful in the categorization and quantification of shape and texture which is used to describe systems with simple self-similarity and regular fractals [13] . However, it is not enough to characterize sets having heterogeneous scaling properties like growth of epidemic disease. For such a characterization Grassberger has generalized the analysis with the notion of multifractals which implies a continuous spectrum of exponents for the characterization of the system [14] . In this oversimplification, an inhomogeneous fractal is considered to be associated with countably many subfractal sets of dissimilar dimensions [13] [14] [15] [16] [17] [18] . We analyse the COVID-19 infection data from the top 15 affected countries in which we observed the growth and death patterns of the COVID-19 are heterogeneous. Hence, this paper applies the multifractal formalism on COVID-19 data with the notion that country-specific transmission rates follow a power law growth nature.\nHerd immunity is related to a scenario under which people develop immunity against contagious infectious disease that materializes when the people is immune either through vaccination or immunity developed through former infection and they become immune to that disease. This provides indirect protection or herd immunity to those people who are not immune to the disease, see for instance Fig. 1 .\nAs on 25 May 2020, India is under the top 10 most infected countries with over 6000 per day recorded cases for four consecutive days. Data from Johns Hopkins University [6] show that the total number of cases in India has surpassed that of Iran. After a sharp spikes of cases since the second week of May, it can be predicted that the scenario will continue till it can attain a maximum peak, may be in the month of June. After this intense period, herd immunity can occur by a natural course of infection. In this report, using a brief comparative analysis, we have shown that India can develop a significant mutation against the disease. We have restricted our data analysis till 22nd May. The work is organized as: In Sect. 2, necessary materials and method of multifractal formalism are presented. In Sect. 3, the COVID-19 infection data from the top 15 affected countries are described and discussed the heterogeneous nature of COVID-19 growth patterns. Further, multifractal formalism is applied on COVID-19 data with the notion of power law growth behaviour of virus. The generalized fractal dimension curves are estimated, and using these results comparison is made between India with other countries. Conclusions of the work are provided in Sect. 4."}, {"section_title": "Material and method of multifractality", "text": "This section presents the explanation of the material and method description applied in this paper.\nPrediction of the number of infected case for different diseases is the foremost task in the healthcare system. In general, epidemiological analysis models assume that the number of confirmed positive cases of COVID-19 grows exponentially with respect to fixed reproduction rate n. Each person infected by the COVID-19 transmits to n number of new persons when n > 1, and then the total number of COVID-19 cases grows as n t τ = e at (1) here τ is the incubation time which depends on the nature of COVID-19. The limitation of exponential approaches is that it assumes each person transmits to n number of new person without considering the inhibition due to the interaction with already infected people such as lockdown, quarantine, restricted local movement, distance-learning, teleworking, regulated travel, and other prophylactic measures. Therefore, in order to create short-term predictions to prepare for the extent of the global pandemic infection data from the top 25 affected countries have investigated in [9] . Also, all country-specific infection rates follow a power law growth behaviour and the scaling exponents per country are calculated in [9] . In this paper, the partition function of COVID 19 data for top 15 affected countries has been estimated to apply analogy of multifractal formalism with COVID-19 transition, since the partition function exhibits the power law distribution. A set S of points describing an object can be divided into boxes labelled by an index i such that the ith box has N i points of the total N points of the set. These points are sample points describing the content of the underlying measure. Let us use the mass or probability\nEur. Phys. J. Plus (2020) 135:526\nThe mass exponent τ (q) for the set depends on the moment\nof order q chosen. Like N (δ) of bare d-measure the partition function (if we may call) Z (q, δ) also often exhibits power law distribution\nwhere the exponent τ (q) is called the mass exponent not the fractal dimension if it is nonlinear in q. The mass exponent is more revealing than the simple fractal dimension as we shall soon find it out. It can equivalently be defined as\nThe generalized fractal dimension (GFD) D q can be defined as\nAs q −→ 1, D q converges to D 1 , which is given by\nwhere D 1 is the information dimension and D q is a monotonically decreasing function of q such that D 0 ≥ D 1 ≥ D 2 . Here D 0 and D 2 denote the fractal dimension and correlation dimension, respectively. The set S is a country and it can be divided into boxes labelled by an index i such that the ith box has N i number of person affected by COVID-19 of the total number of persons infected by every positive case N of the country S. Let us use the mass μ i = N i /N in the ith cell to estimate the generalized fractal dimension by using Eq. (6)."}, {"section_title": "Results and discussion", "text": "COVID-19 data have been downloaded from the publicly available JHU-CSSE (2020) data repository provided by the Johns Hopkins University Center for Systems Science and Engineering (JHUCSSE) [6] and Statistics and Research Coronavirus Pandemic (COVID-19) available in the website of our world in data [7] . We have selected the data sets with the 15 most infections as presented in [6] on 22-05-2020 11:00 p.m. IST. The countries and their infection counts and death counts are given in Table 1 . Figure 2a shows generalized fractal dimension result for the confirmed cases of 15 countries. For each country day zero is considered to be the day of the first confirmed case of COVID-19. In each day the confirmed cases are normalized by dividing them by the total number of case and obtained the partition function Z (q, δ) by Eq. (3) . Also, Fig. 2b reveals generalized fractal dimensions of confirmed deaths corresponding to the confirmed case of top 15 countries.\nIn Fig. 2a , a comparison of the 80 days of 15 different countries' case counts shows that India has ranked 7th spread rate higher growth than UK, Canada, France, Germany, Iran. Mexico, Russia and China, but lower growth than USA, Brazil, Turkey, Spain, Peru and Italy. It is important to note, however, that due to the discrepancies of COVID-19 testing, these 3.89, 3.657, 3.557, 3.547, 3.155 and 2.72, respectively, which are shown in subplot. We observed that the transmit rate of USA, UK, Spain, Brazil, Canada seems to follow the same patterns, whereas France transmit rate is irregular not gradually increasing. Figure 4 Figure 5 shows the daily confirmed cases and confirmed deaths of Italy, Turkey, India, and their generalized fractal dimensions are revealed in subplot. Figure 5c clearly shows that generalized fractal dimension of death rate of India is monotonically decreasing from 2.51, whereas Italy and Turkey have initial value 3.016, 3.002, respectively. It should also be noted that remaining all 14 countries initial mortality rate starts above the value 2.51; hence, death rate of India is lesser than any other countries. This discrepancy might eventually get decreased or increased when more data on the outbreak in India will become available. However, the empirical data available as on 22.05.2020 are evident that India has more immunity Eur. Phys. J. Plus (2020) 135:526 against COVID-19. This is likely to be connected with many culture-related behaviours and to the presumed diversity in health conditions of the people."}, {"section_title": "Conclusion", "text": "The analyses presented in this study demonstrated that India has less mortality rate of COVID-19 as its total infected population is concern. Across the world, countries have executed a number of control procedures to respond to COVID-19, with the aim of slowing down transmission and dropping mortality. Particularly, India is in the process of scaling up public health and social measures based on local epidemiology and on local risk assessments, such as continuously four full lockdown, restricted local movement, and educational institutes are implementing the distance-learning and businesses to teleworking, and regulated international and national travel measures. Finally, the death rate is likely to be connected with many culture-related behaviours and to the presumed diversity in health conditions of the people. Notice that mortality and transmit rate might eventually get decreased or increased when more data on the outbreak of all countries will become available."}]