[{"section_title": "Abstract", "text": "Abstract. Simulating images representative of neurodegenerative diseases is important for predicting patient outcomes and for validation of computational models of disease progression. This capability is valuable for secondary prevention clinical trials where outcomes and screening criteria involve neuroimaging. Traditional computational methods are limited by imposing a parametric model for atrophy and are extremely resource-demanding. Recent advances in deep learning have yielded datadriven models for longitudinal studies (e.g., face ageing) that are capable of generating synthetic images in real-time. Similar solutions can be used to model trajectories of atrophy in the brain, although new challenges need to be addressed to ensure accurate disease progression modelling. Here we propose Degenerative Adversarial NeuroImage Net (DaniNet) -a new deep learning approach that learns to emulate the effect of neurodegeneration on MRI by simulating atrophy as a function of ages, and disease progression. DaniNet uses an underlying set of Support Vector Regressors (SVRs) trained to capture the patterns of regional intensity changes that accompany disease progression. DaniNet produces whole output images, consisting of 2D-MRI slices that are constrained to match regional predictions from the SVRs. DaniNet is also able to maintain the unique brain morphology of individuals. Adversarial training ensures realistic brain images and smooth temporal progression. We train our model using 9652 T1-weighted (longitudinal) MRI extracted from the Alzheimer's Disease Neuroimaging Initiative (ADNI) dataset. We perform quantitative and qualitative evaluations on a separate test set of 1283 images (also from ADNI) demonstrating the ability of DaniNet to produce accurate and convincing synthetic images that emulate disease progression.\n*Data used in preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu). As such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data but did not participate in analysis or writing of this report. A complete listing of ADNI investigators can be found"}, {"section_title": "Introduction", "text": "Neurodegenerative diseases are strongly age-related, and the incidence of these diseases is expected to rise in the next few years due to increasing life expectancy. Creating tools that assist our limited understanding of neurodegeneration can help to answer some of the open questions in this field, e.g., What are the causes? How can we improve subtype classification?\nDisease progression modelling [7] analyzes clinical and image-based biomarkers to map out longitudinal changes during chronic diseases. However, modelling temporal neurodegeneration on full resolution MRI is still a major challenge. To tackle this problem, a few simulators have been proposed in the literature [3, 4, 8, 6] . The recent SimulAtrophy [5] uses a computational model based on fluid mechanics. This approach combines two deformation fields: one from a biophysical model and the other obtained by non-rigid registration of two real images. For a given baseline MRI, the combined deformation field is used to impose the desired level of atrophy and generate the simulated image. SimulAtrophy is extremely resource-demanding and is not scalable to high-resolution images. Exploiting the success of deep learning, Bowles et al. [2] proposed a framework based on Generative Adversarial Networks (GANs) to model and manipulate MRI directly through the technique of image arithmetic. Although the system is able to introduce or remove atrophy patterns from regions in the brain, it presents a few important limitations: disease progression is modelled linearly and morphological changes are the same across all patients. A more advanced deep learning framework developed to predict face ageing was proposed in [9] . Our idea is to use a similar framework to generate realistic images that also preserve biological/anatomical constraints associated with disease progression.\nIn this paper we present a new framework that overcomes the limitations of existing approaches. Firstly, similar to [9] we employ adversarial training to ensure a high level of realism in the synthetic MRI. Secondly, we avoid imposing predefined atrophy patterns, prefering to implement novel biological constraints that model neurodegeneration. These constraints control the MRI intensity in each brain region through a set of localised SVRs learnt directly from the data. Finally, we design DaniNet to handle non-imaging characteristics, which we employ here to condition upon age and diagnosis. Experiments evaluate the performance of the various components of DaniNet and demonstrate the ability to produce accurate and realistic synthetic images that emulate disease progression."}, {"section_title": "Methods", "text": "In this section we present the main blocks which compose DaniNet. A colourcoded work-flow of our system is depicted in Fig. 1 .\nThe first pre-processing block (shown in blue in Fig. 1 ) extracts a normalized slice x from the MRI I. The second component (shown in grey) is a Conditional Deep Autoencoder (CDA) composed of two deep neural networks: an encoder E that embeds x in a latent space Z, and a generator G that projects the vectors produced by E back to the original manifold. Before this projection, the latent vector z is conditioned with two variables: i) d -a numerical representation [0-3] of diagnosis (i.e. cognitively normal, subjective memory concern, early/late mild cognitive impairment, Alzheimer's disease); and ii) a ∈ [1, A] -an index describing age, binned into A=10 groups. This age discretisation is important for computing deformation loss (block in yellow) to learn morphological changes along the progression. The third component (shown in green), consists of two discriminator networks: i) D z that drives E to produce z with a uniform prior and smooth temporal progression; and ii) D b that drives G to produce realistic brain neuroimages. Finally, in the blocks coded in orange, we present the proposed biological constraints used to model disease progression. In the next sub-sections, we will describe each of these components in detail."}, {"section_title": "Pre-processing", "text": "The pre-processing block removes irrelevant variation on the data and ensures that intensity values in each voxel only decrease. In an ideal scenario, intensity of T1-weighted MRI decreases with age since tissue density (having high intensity) will reduce, while water content (having low intensity) will increase. However, due to scanner variability and other sources of noise, this may not be the case in practice. To handle these variabilities, each input image is normalised using the following pre-processing steps: i) linear co-registration to a 1mm isotropic\nAge ( MNI template using FLIRT-FSL, ii) skull-stripping using BET-FSL, and iii) intensity normalisation to zero mean and unit standard deviation. Images where pre-processing failed were not included in the training set."}, {"section_title": "Conditional Deep Autoencoder", "text": "A CDA is an extension of the Deep Autoencoder (DA) with the ability to integrate conditional variables inside the generator G. The advantage of training a single end-to-end CDA over training separate DAs is that it avoids overfitting individual groups when longitudinal data are missing. For the architecture of E and G we follow [9] . The output of the encoder E is a feature vector z ∈ R s that preserves the brain morphology of the current participant. The output of G are synthetic images defined as g a = G(E(x), a, d). The aim of G is to learn the mapping between the linear transition of the latent vector conditioned on a and d and the non-linear transition in the original manifold."}, {"section_title": "Adversarial Training", "text": "Again following [9] , DaniNet includes two discriminator networks that are trained adversarially with the CDA. The first discriminator D z guides E to generate z with a uniform distribution U to ensure temporal smoothness, as demonstrated in [9] . Specifically, D z is trained to distinguish the vector generated by the encoder E from samples extracted from U. On the other side, E is trained in a zero-sum game with the purpose to fool D z . The objective function used for this adversarial training is\nwhere E is the expectation operator, z * is a vector sampled from U, D z estimates the probability that a vector comes from U, and E(x) is the latent vector obtained from x.\nThe second discriminator D b guides the generator G to produce realistic brain images. This discriminator is trained to distinguish the synthetic images g a from the real images in the training set via the following objective function\nwhere D b estimates the probability that a slice is extracted from a real MRI."}, {"section_title": "Biological Constraints", "text": "To capture the patterns of image intensity changes that accompany disease progression, our framework uses two separate loss functions during training. These loss functions impose biological constraints that mimic neurodegeneration by ensuring decreased intensity (tissue density) that is consistent with disease progression. The first loss function operates at the voxel level. Given a synthetic output g a in age group a, we impose that corresponding voxels of each preceding image g i with i < a have higher-intensity values. Likewise, later images g j with j > a have lower-intensity values. We express this constraint as\nwhere M and N are the number of rows and columns in each slice, and sgn is the sign function. The second loss function operates at a regional level to improve spatial consistency across neighbouring voxels. We pre-train a set of SVRs to learn how to predict the rate of intensity progression in fixed, overlapping, data-driven regions mask obtained from hierarchical clustering of local intensity of the training images. On the considered axial slice the clustering algorithm detects 128 regions with an average size of 233 voxels. We train one SVR per region, where the input features are the age at baseline, the age at the follow-up, and diagnosis d. We restrict the SVR training to monotonically decreasing data by removing timepoints where regional intensity increases. The loss function used to constrain the image sequence g i (with i ∈ [1, A]) through the regional SVR predictions is\nwhere R is the number of regions, r i is the i-th region-mask, SV R i (p, a, d) is the prediction of intensity rate progression for the region i, and = 0.1 avoids division by 0. The pre-trained SVRs supply a set of constraints on the generator's outputs for ensuring accurate emulation of neurodegeneration. The process used to compute the rate of regional intensity progression is summarized in Fig. 2 ."}, {"section_title": "Deformation Loss", "text": "Our final loss function ensures consistency with the individual subject over time by minimising the difference between individual input image sequences and the corresponding output sequences. For each input image x, the difference is minimised between x and a weighted average of two outputs from the nearest age bins:\nwhere α reflects the distance between input age and the group a and a + 1. In summary, the loss functions L reg and L vox ensure monotonic intensity change to mimic neurodegeneration, and L def together with D b ensure realistic brain morphology."}, {"section_title": "Training Details, Parameters and Evaluation", "text": "Data used in the preparation of this article were obtained from the ADNI database (adni.loni.usc.edu). The ADNI was launched in 2003 as a public-private partnership, led by Principal Investigator Michael W. Weiner, MD. The primary goal of ADNI has been to test whether serial magnetic resonance imaging (MRI), positron emission tomography (PET), other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of mild cognitive impairment (MCI) and early Alzheimer's disease (AD).\nTraining data (MRI-slices: 9852; participants: 876) and testing (MRI-slices: 1283; participants: 179) are pre-processed T1-weighted MRI from the ADNI dataset. This includes data from multiple sites, scanners, and pre-processing pipelines. We included them all to improve robustness to such variability, and hence increase generalizability. The participants were aged between 63 and 87 years old, with the following distribution of clinical disease stage: 28% cognitively normal, 4% subjective memory concern, 54% mild cognitive impairment and 14% Alzheimer's disease. Each participant has on average 4.7 MRI spanning 3 years. We select participants in the test set having at least one follow-up visit two years after baseline, to allow sufficient time for observable neurodegeneration to occur. The architectures of each network E, G, D b , D Z are based on the implementation proposed in [9] . The size of the latent space Z is fixed to 200. The network's parameters of E and G are trained to minimize a total loss defined as (6) where E z is the cross entropy obtained by the discriminator D z on the generated latent vectors, and G b is the cross entropy obtained by the disctiminator D b on synthetic images g a . To train our system we use the stochastic gradient descent solver, ADAM (α = 0.0002, β1 = 0.5) on an NVIDIA GTX TITAN-X GPU card. The training procedure converged after 3000 epochs of random mini-batch of 100 slices with a size of 128×128. We also align each test individual to the model by baseline age and diagnosis, then personalise DaniNet with a transfer learning step (T component, see results section 3) that involves an additional 200 training iterations on the single baseline image. Personalisation is essential to tune the model for the specific morphology of the individual's brain, ready to simulate realistic, personalised followup MRI. To note, only a single MRI from each test subject's first visit is used to personalise the trained model.\nIn our evaluation, input x are from baseline visits. Follow-up data is the ground truth y against which we evaluate generated images g i using complementary quantitative and qualitative analysis. The quantitative analysis involves the use of the Structural Similarity Index matrix (SSIM). Since this matrix is not able to quantify the actual realism of the obtained images we also perform a complementary qualitative analysis via a survey of clinicians and medical imaging experts that evaluate the synthetic images based on their perception."}, {"section_title": "Results", "text": "Our first experiment is designed to show that DaniNet improves similarity between generated image and ground truth, with respect to the baseline approach developed for face ageing [9] . Specifically, we evaluate the contribution obtained by three components of DaniNet: i) P obtained exploiting L vox and L reg , ii) C obtained conditioning the system with the clinical diagnosis, and iii) T obtained when the learned model is transferred before testing on new data. For this purpose, the SSIM results obtained using different compositions of P , C, and T are reported in Table 1 . Clearly, the best results are obtained when the framework includes all three components. The baseline model produces inferior SSIM. Transfer learning T is the feature that provides the highest contribution. A moderate contribution is provided by P and C. These improvements were assessed statistically using a paired t-test and all p-values were less than 0.0001. Visual results for the configurations C-T , P -C-T and baseline [9] are shown in Fig. 3 . The error maps, shown in the last row of the figure, confirm our findings. A full simulation with the optimal configuration P -C-T is shown in Fig. 4 where neurodegeneration is apparent in the progression (left to right), most obviously in ventricular expansion and cortical thinning.\nOur second experiment tests the qualitative performance of DaniNet based on human visual perception. In a survey, we asked 25 medical imaging experts (neurologists and computer scientists) to evaluate on average 36 sets of three images each, randomly selected from the test set, generated using two different configurations of DaniNet (C-T and P -C-T ) and the baseline [9] . These were shown to the user in a random order. The input x and the related follow-up y were also displayed on the screen as references for the participants. For each set of images, the user was asked to select the closest synthetic image to y. Results from the survey confirm that DaniNet is a considerable improvement of the baseline approach. The medical imaging experts selected the configuration P -C-T 26 ± 5 (mean ± std) times (72 ± 14%), the configuration C-T 7 ± 4 times (19±11%), and the baseline 1±1 times (3±3%). For only 2±3 outputs (6±8%) the users were not happy with any of the generated synthetic images. "}, {"section_title": "Conclusion and Future Work", "text": "We have proposed and evaluated (quantitatively and qualitatively) a novel deeplearning framework that is able to learn how to emulate the effect of neurodegenerative disease progression on structural MRI. The framework produces personalised, realistic output images through a combination of biological constraints, transfer learning, and conditioning upon both fixed and variable non-imaging characteristics. To the best of our knowledge, we are the first to propose a simulator that imitates realistic neurodegeneration by imposing biological constraints. In future work we will extend the framework to simulate entire 3D-MRI with the aid of low-memory techniques [1] . Additionally, focal brain pathologies, such as glioma and white matter hyperintensities, are not currently modelled by our framework; future work will extend to consider such effects. Finally, although we have demonstrated our framework for modelling atrophy in MRI, we believe that this solution can be used with different image modalities (e.g. PET, CT, etc.) and to model disease progression on other organs (e.g lung, retina, etc. "}]