[{"section_title": "Introduction", "text": "Phosphorus is an important factor causing water pollution in freshwater systems (Schindler et al. 2008). Excessive P use can result in eutrophication or algal blooms which cause a lack of oxygen which then kills fish and other aquatic life. This reduced water quality influences not only the environment but also economic conditions, such as increasing drinking water treatment costs or reducing tourism or recreation demand (EPA 2015). Since the 1970s, P from point sources has decreased due to the Clean Water Act. However, P from non-point sources has changed little and now most P is coming from these sources (Maccoux et al. 2016). Forty-four percent of total P loading into the Great Lakes can be accounted for by agricultural activities (International Joint Commission 2014). Figure 1 shows trends in sources of P for Lake Erie. Since excess phosphorus (P) fertilizer applications can cause impairments in water quality, reducing fertilizer applications may help improve it while reducing fertilizer expenses. A cost effective way to reduce P would be influencing farmers' voluntary management efforts because non-point source pollution is not easy to track and control (Scavia et al. 2014). However, information on farmer's decision-making with respect to P is needed to facilitate these efforts. Over-application of nitrogen fertilizer has been studied (Leslie et al. 2017;Supalla et al. 1995) but there has been limited work on P. Farmers can obtain information about recommended fertilizer application rates for specific crops from soil tests. Soil test results can provide optimal P fertilizer rates based on nutrient levels in the soil and crop needs. In general, when farmers submit soil for testing they indicate their planned crops and yield goals. However, farmers tend not to follow the recommendations from soil tests (Osmond et al. 2015) and overapply fertilizer. Thus, it will be useful to identify factors affecting differences between recommendations and actual fertilizer use to achieve reduced fertilizer rates, which can improve water quality and also save farmers money. This study will contribute to understanding this aspect of farmers' behavior by using a comprehensive dataset, the USDA Agricultural Resource Management Survey (ARMS), which will enable regional comparisons. The study will examine the over-application of P, which has not received much attention in the literature compared to nitrogen. The crop examined, soybeans, is able to fix its own nitrogen so P is a relatively more important nutrient for this crop. This research is important because nutrient management is the key factor to reduce non-point source pollution from agriculture. The results of this research can also help improve the efficiency of policy design and educational campaigns by focusing on important farmer characteristics and identifying barriers to improved nutrient management. "}, {"section_title": "Background", "text": "Agricultural nonpoint sources have been pointed out as one of the factors that causes water pollution. N pollution is important for air as well as groundwater and surface water pollution (Ribaudo et al. 2011). Among nutrients in fertilizer, P is leading factor of water pollution and eutrophication in freshwater systems (Carpenter 2005). Soybean has a characteristic, nitrogen fixation 1 , which allows us focus on P fertilizer use. Figure 2 shows the sequence of decisions by soybean farmers. Before fertilizer application, it is recommended to take soil samples; the soil test results provide information on how much of which nutrients are needed. Soil can be tested anytime the ground is not frozen, but some studies recommend testing in the fall because of time flexibility and greater consistency than in the spring (Savoy 2013;Silva 2018; Illinois Soybean Association 2012). P fertilizer can be applied after harvest in fall or before planting in spring. Even though spring P application might reduce the possibility of P runoff that can potentially cause water pollution, farmers tend to apply P fertilizer in the fall since they have more time and fall applications may allow timely planting in spring (Bruulsema et al. 2012;Silva 2018). Generally, there are two common types of P fertilizer in the US fertilizer market. Monoammonium phosphate (11-52-0) 2 and diammonium phosphate (18-46-0; DAP) are produced by adding different ratios of ammonia to phosphoric acid (Kaiser 2018). Thus, even though soybeans can fix atmospheric nitrogen, we need to consider nitrogen fertilizer because of these fertilizer products. Some farmers believe that N top-dressing may increase crop yield, but studies have shown mixed results because additional use of nitrogen fertilizer can decrease nitrogen fixation ability. According to the Illinois Soybean Association (2012), soybeans could produce 50 bushels by only N fixation, but Gan et al. (2003) found nitrogen can help soybean yields increase if it is applied at the early flower growth stage. Cafaro La Menza et al. 2017found substantial yield increases, with potential yields of over 2.5 Mg/ha. However, Mourtzinis et al. (2018) found higher yield with additional N application, but the increases were statistically insignificant and highly variable. P is a one of the essential nutrients for plant growth. Plants can uptake phosphorus as phosphate (either H2PO4or HPO4 2-). P in fertilizer uses a form of phosphoric acid (P2O5) and it will react with water in soil and generate phosphate (McClellan, Deenik and Singleton 2007). Soybean generally requires 0.8 lb P2O5/bushel, which is the biological removal rate (Buchholz 2004;McGrath et al. 2013). Farmers' over-application of P fertilizer compared with either soil test recommendations or biological removal rates (BRR) could cause P accumulation in soil due to fixation. P fixation is a process by which forms of P are changed from soluble P to solid P; the speed of the process varies by conditions, such as temperature, moisture, pH level, etc. (USDA-NRCS 2014). Woodruff et al. (2015) found that there were higher median P levels in topsoil (0 to 5 cm) from agricultural regions (830 mg/kg P) than non-agricultural sites (535 mg/kg P) in 2007 (figure 3). This difference may be caused by P fertilizer or manure applications. Since P can accumulate if applications exceed uptake, soil tests can provide information on whether and how much P fertilizer farmers need to apply. Soil tests analyze soil by extracting available as well as potentially available P in soil. There are different methods of soil testing, Bray-1, Olsen, etc. For example, Bray-1 could be used for acid to neutral soils and the Olsen test for a mid-acidic to alkaline pH soil (Gavlak, Horneck and Miller 2005;Geisseler and Miyao 2016). Based on soil analysis, soil test recommendations are prepared. According to Buchholz (2004) in Missouri, the recommendations consist of two components: buildup and maintenance. The buildup component is \"P2O5 requirements to increase the soil test level to the desired level over a recommended number of years.\" The second component is given by multiplication of yield goal and P2O5 BRR (0.8 lb P2O5/bushel for soybean). Thus, if a soil test result is higher than the desired level, the first term (buildup) will be zero. Therefore, P biological removal rates by soybean combined with yield goal can be used as a criterion of P over-fertilization. However, Osmond et al. (2015) found that farmers did not fully follow soil test recommendations. The reason for over-application could be that farmers may be concerned with nutrient loss after application (Sharma, Bali and Zaeen 2017). This is because farmers may be concerned about precipitation or P fixation with other substances, like aluminum, calcium or iron, to form insoluble minerals which are not available to soybean, but this process proceeds slowly (van der Eijk 1997). Thus, to identify potential reasons for overapplication, it would be helpful to understand characteristics of farmers who applied excess P fertilizer in order to reduce input costs and improve water quality. The following section develops the conceptual framework for our model based on the literature on adoption of best management practices."}, {"section_title": "Conceptual framework", "text": "Farmers are assumed to make decisions to maximize their expected profit or utility, subject to their constraints. The factors affecting phosphorus fertilizer application rate can be divided into six categories: profitability, substitute or complementary inputs, uncertainty, related practices, environmental susceptibility, farmer's characteristics and regional factors. Since there are limited studies examining P over-fertilization, the studies that are examined to generate our hypotheses relate primarily to over-fertilization of N and nutrient management more generally. The data we use have some variables that relate to a selected soybean field rather than the entire farm, so our hypotheses will reflect that. Among profitability factors, farm size could be associated with over-fertilization, but the literature shows mixed results. A positive relationship may be related to financial flexibility (Coady 1995) or lack of a credit constraint. Leslie et al. (2017) and Supalla et al. (1995) found larger farms tend to apply more fertilizer than the recommendation. However, the size advantage can reduce fertilizer application due to increased efficiency (Zhou et al. 2010). We include farmed acres and expect larger farms will be more likely to over-use P fertilizer, but this may be diminishing because of increased efficiency. In addition, one of the major variable costs may be labor so we included labor costs and expect a negative relationship between labor costs and overfertilization since lack of labor may limit economically optimal fertilizer management by the farm operator. We also include an interaction term between size and labor. Prices 3 of soybeans and P fertilizer are important factors for profitability. Williamson (2011) found N fertilizer demand was own-price elastic but output (corn) price was not statistically significant. We include P fertilizer price and soybean price, which are expected to have negative and positive relationships, respectively. We note, however, that our dataset is cross-sectional for one year. For related inputs, manure can be a substitute for commercial fertilizer. Manure usually contains more P than N relative to plant requirements and unless the manure is tested, farmers may not be aware of the quantity of P being applied. In this case, over-application of P could happen with just manure use (Komiyama, Ito and Saigusa 2014;Sheriff 2005). However, while farmers, especially those with livestock, may over-apply total P, they may be less likely to over-apply commercial P fertilizer. We include whether farmers use manure or not and expect that farmers using manure will be less likely to over-apply commercial P fertilizer. For complementary inputs, nitrogen and water availability can complement P applications. Plants require nitrogen (N) and P in fixed ratios. Therefore, farmers will consider the ratio of both nutrients (Sheriff 2005). As indicated above, commercial P fertilizer sources contain N, so even though soybeans can fix nitrogen, some is applied with P. Also, water is another necessary input, so has a complementary relationship. For example, if farmers use irrigation extensively, they may apply more fertilizer. Vickner et al. (1998) and Williamson (2011) found that farmers using irrigation tended to use more nitrogen fertilizer because water and nitrogen fertilizer are complementary inputs. Thus, we included whether a farmer's N application rate was above the amount that would be in diammonium phosphate fertilizer for that level of P, and the percentage of the selected soybean field that was irrigated. We expect that farmers applying more nitrogen or using more irrigation are more likely to apply more P fertilizer. We also include whether a soil test for P was conducted for the 2012 crop year and expect that this would decrease overapplication. Information source is another important factor. Williamson (2011) found farmers apply more fertilizer if they get recommendations from fertilizer dealers than those who did not, and Weber and McCann 2015found these farmers were also less likely to adopt N mitigation practices. If farmers obtain information from crop consultants, it could be a factor increasing fertilizer application rate by farmers (Lawley, Lichtenberg and Parker 2009;Williamson 2011). Lawley et al. (2009) found that farmers following fertilizer dealers' and crop consultants' recommendations were more likely to increase fertilizer application rates than those getting information from Extension. We included information sources, getting N fertilizer recommendations from fertilizer dealers (alone or in conjunction with other sources), other sources of information, versus no information source for 2012, as a factor and expect a positive relationship with P application rate. Prior adoption of environmentally friendly management practices or technologies, could be interpreted as indicators of environmental awareness or concern (Prokopy et al. 2008). Supalla et al. (1995) found that farmers having a higher level of environmental concern tended to apply nitrogen fertilizer near the recommended level. We included rotation (corn or other crops the previous year versus soybean), variable rate application (VRA) and having a comprehensive nutrient management plan (CNMP) and expect that these variables will be negatively related to over-fertilization. Also, environmental susceptibility could be important for input decision making by farmers, e.g. highly erodible land (HEL) and wetland as classified by the Natural Resources Conservation Service (NRCS). Pimentel et al. (1995) found soil erosion causes nutrient loss and can reduce crop yield. However, USDA recommends that farmers having erodible land use a conservation plan (USDA 2017). We included whether the selected soybean field has highly erodible land and expect these farmers to be more likely to use more fertilizer since the soil may have lower natural fertility, but there is also the possibility of having a negative relationship if they recognize their off-farm impacts on water quality. Wetlands are known to have many environmental benefits and the Clean Water Act requires farmers having a wetland to protect the land. Thus, we included presence of a wetland in the selected field and expect a negative relationship with over-use of P fertilizer. For risk or uncertainty, level of risk aversion has been studied as an important indicator for over-fertilization. Isik and Khanna (2003) found a risk-averse farmer will apply more fertilizer under production uncertainty. However, other studies found mixed results, that risk-neutral farmers applied more nitrogen fertilizer than the recommendation but risk-averse farmers use less fertilizer than risk-neutral farmers (Just and Pope 1979;Rajsic, Weersink and Gandorfer 2009;Roosen and Hennessy 2003). Federal or private crop insurance is also related to the fertilizer decision. Goodwin, Vandeveer and Deal (2004) found farmers who signed up for crop insurance may be subject to moral hazard, so they use less fertilizer. We include federal or private crop insurance and expect that farmers who enrolled in either federal crop insurance or a private one is less likely to over-use fertilizer. Farmers' characteristics are important factors for fertilizer application decision-making. Williamson 2011found operator's age had a negative relationship with over-fertilization. Supalla et al. (1995) found that farmers who had a higher education level tended to follow the recommendation for level of nitrogen fertilizer application. Land tenure may influence the amount of fertilization because farmers can expect to receive future benefits, such as sustainability, by following recommendations or alternatively, nutrient stocking by over-application of P (Carpenter et al. 1998;Haygarth et al. 1998). We include age, level of education, and land tenure, and expect they will have negative relationships with over-fertilization. Off-farm work can be a factor affecting fertilizer application rate because it can give more financial capability or reduce time availability (Gedikoglu, McCann and Artz 2011). Goodwin and Mishra (2004) found farmers having more extensive off-farm work tend to have lower farm efficiency. We included operator's off-farm work days and expect a positive relationship with overuse of P fertilizer due to higher income and inefficiency. Lastly, we included regional dummies to control for climate and other differences. We used ERS farm resource regions because they were grouped by similar climate and crops (Chang and Boisvert 2009;McCann and Claassen 2016;USDA Economic Research Service 2000)."}, {"section_title": "Data and Methods", "text": "The USDA ARMS soybean dataset was used, which is managed by the National Agricultural Statistics Service (NASS) and the Economic Research Service (ERS). The survey selects different target crop(s) each survey year and we used the soybean data based on the 2012 crop year. This survey is multiphase. Phase 1 is a screening survey to know whether a farmer planted the target crop or not. In phase 2, USDA randomly selects farmers from the screening phase and asks about their chemical use, costs and management practices in relation to a specific field planted to the target crop. USDA gathers farm-level data and farmer demographic information in phase 3. For this study, our main independent and dependent variables relate to the single soybean field identified in phase 2, while the demographic information and farm size data comes from phase 3. In this study, we conducted analyses examining over-fertilization using two different criteria, the biological removal rate and the soil test recommendation. Soil tests can give information on the amount of P that needs to be applied. Therefore, we can directly compare farmers' actual P application rate and recommended rates. However, even for soil testers, we don't know the soil P status; only the recommended rate. For farmers who didn't test their soil, we used BRR based on their yield goal as the criterion of over-fertilization. As indicated earlier, soybean's P removal rate is 0.08 P2O5 lb/bushel. Thus, the P BRR can be calculated by multiplying yield goal (bushel/acre) by 0.08 P2O5 (lb/bushel) 4 . If farmers apply more than that amount, they are probably over-applying relative to plant needs. In addition to examining factors affecting over-fertilization compared to applying at the soil test recommendation or BRR, we also examined whether people applied less than the recommendation/BRR and whether they applied no P at all. For analyses, we used a multinomial logit model to identify factors affecting over/underfertilization with bases of 'applied at BRR with respect to yield goal' and 'followed soil test recommendation', respectively. In the first analysis, we defined application of P fertilizer as being at the biological removal rate if farmers applied P fertilizer within plus or minus 10% of BRR. In the second analysis, we categorized farmers as over-fertilized (or under-fertilized) if farmers applied P fertilizer more (or less) than the recommendation level and separated out farmers who applied zero P fertilizer and then used the same categories as in the second analysis."}, {"section_title": "Results and Discussion", "text": "Descriptive Statistics Table 1 shows summary statistics for the data used in the regressions. Focusing on soil testers compared to the BRR (whole sample), the mean farm size was 2330 acres (about 500 acres larger than the full sample) and the average labor costs were $25/acre, which was similar for the two groups. Average soybean and phosphorus price were $14/bu and $0.7/lb, (2.65 and -0.3 when taking the natural log) respectively, similar to the whole sample. Three percent of respondents used manure on the selected soybean field, which was lower than for the whole sample and the average nitrogen application above DAP 5 was 1.25 lb/acre (natural log 0.22), which was higher than the whole sample. This implies that more soil testers are side-dressing nitrogen. About 16% of the soybean field selected for Phase 2 was irrigated (higher than for the full dataset) and among the full sample, 19% of farmers took soil tests for the selected fields for 2012. About 17% of farmers planted soybean in 2011, lower than the full dataset. Fewer soil testers (63% versus 69%) planted corn in 2011 but more planted other crops (21% versus 11%). About 19% of soil testers indicated they had planted a crop in fall of 2011, i.e. had double cropping, which was higher than the full dataset. About 28% of soil testers used VRA (higher than for the full sample) and 14% of farmers had a CNMP (higher than the full dataset). About 15% of soybean fields for which detailed production data was collected consisted of highly erodible land and 3% of the fields contained a wetland (both higher than for the full dataset). Most farmers (93%) were enrolled in either federal or private crop insurance which was slightly higher than the full dataset. The average age was 55, similar to the full sample, and 60% of respondents had an education level higher than or equal to a college degree (higher than the full sample). Forty-seven percent of the sampled soybean field was owned, slightly more than the full sample, and about 18% of farmers had more than 100 days of off-farm work, which was lower than the full sample. Regarding information on nitrogen recommendations for this field for 2012, 69% of soil tester didn't get any information external sources, which was lower than the whole sample. This category serves as our base. Note that no questions were asked regarding their source of information for P fertilizer decisions. About 13% of farmers used fertilizer dealers as an information source, either alone or in combination with other sources, while 16% used other information sources (including plant tissue test, crop consultant, Extension Service and contractor recommendation), which were both higher than the whole dataset. (Given the small sample size for the soil tester regression, we combined the last two categories into an \"Anyone\" category for analysis, representing 29%, which was a higher percentage than the full dataset). In other words, those who tested their soil used nutrient information sources more than the dataset as a whole, in addition to the actual soil test information. Soil testers were somewhat less likely to be from the Heartland region (the base) or the Northern Crescent, were similar in the percentage from the Mississippi Portal and somewhat more likely to be from all the other regions. Summary statistics thus show that there are differences between the whole sample and the subsample who took soil tests. This may indicate that the soil testers may be different from the whole sample or those who do not test their soil. For those who did test their soil, about 33% of soil testers followed the recommendation for that field (data not shown), while 22% over-applied by this criterion, 25% under-applied and 21% of farmers didn't apply any P fertilizer for 2012 soybeans. For the biological removal rate model, 6% of respondents applied within +/-10% of biological removal rates, while 20% applied more than BRR, 11% applied less than BRR, and 64% of farmers didn't apply any P fertilizer on that field."}, {"section_title": "Regression Results", "text": "Prior to running regression models, we examined correlation coefficients and the variance inflation factors (VIF) for the explanatory variables. All the correlation coefficients were smaller than the recommended cutoff of 0.8 (Grewal, Cote and Baumgartner 2004) Table 2 shows the regression results for our preferred models. For the overfertilization model compared to soil test recommendations, the pseudo R 2 value was 0.216 and the AIC was 623. For the model with the whole sample using BRR as the criterion for overfertilization, the pseudo R 2 value was 0.194 and the AIC was 2739. The models predicting over-fertilization thus seem to have less explanatory power than the soil testing model. For the soil tester regression we had to drop the manure and wetland variables and also to combine N information sources because there were too few observations which resulted in statistical problems. As mentioned above, for the model examining determinants of over-fertilization for farmers who tested their soil, we categorized farmers into four groups: over fertilization (actual P applications higher than the recommended rate), applications at the recommended rate (base category), under-fertilization, and P=0 (table 2). Farmers who applied more than the recommended rate were more likely to have a higher soybean price, less likely to use irrigation and less likely to own the field than those who applied at the recommendation. Compared to those who followed the recommendation, those who over-applied were more likely to obtain N rate recommendations from a source compared to getting no information. Farmers who applied less P than the recommendation but more than zero were more likely to have planted corn than soybeans on the field in 2011, less likely to have a CNMP, and more likely to use a source for the N recommendation than those who applied P at the recommended rate. In other words, use of N information sources in addition to the actual soil test can result in both under and overapplication. Those who underapplied were more likely to be from the Northern Great Plains region than from the Heartland. Farmers who didn't apply P fertilizers at all in 2012 were less likely to use irrigation, similar to those that overapplied. Looking at this data in another way, those who did follow the recommendations exactly were more likely to have irrigation, and to not use any information sources for N fertilizer recommendations. The latter finding makes sense since they may see the soil test as a substitute for other information sources. Overall, the model does not seem to find many consistent explanatory variables regarding compliance with soil test recommendations. This needs to be seen in the context of the fact that soil testers are already larger, are more likely to have a CNMP, and to be from the Southern seaboard and Eastern uplands regions rather than the Heartland region (see results from the soil test adoption regression results in the appendix). For the analysis with whole sample, farmers having larger farms were more likely to over-use P fertilizer relative to BRR, but the effects were diminishing. Also, farmers who applied P fertilizer at more than 10% above BRR were less likely to apply N fertilizer at a rate higher than DAP than farmers who applied at +/-10% of the BRR. They were also less likely to use irrigation. This may be because those who irrigate have control of P that might be lost to runoff in regions with ample rainfall. Farmers in the Prairie Gateway region, which has substantial irrigation, were somewhat more likely to overapply. Examining those who applied at less than 10% of BRR, but more than zero, farmers who have higher labor costs were more likely to apply P at less than biological removal rates, contrary to expectations. In addition, farmers who applied P fertilizer at less than BRR were more likely to have planted corn versus soybean in 2011, which could imply that they apply P fertilizer when they apply other fertilizer to their corn crops. They were less likely to use VRA, in line with expectations and to have erodible land, which could have beneficial environmental effects. These under-fertilizers were less likely to have a college education compared to those who applied at the BRR and also less likely to have more than 100 days of offfarm work. Farmers in the Northern Crescent as well as the Prairie Gateway were more likely to apply P at less than BRR; the former result might reflect efforts to reduce water pollution by states near the Great Lakes. Farmers who didn't apply any P fertilizer in 2012, compared to the base of using +/-10% of removal rate, had a negative effect of the land/labor interaction term. Higher soybean prices were associated with being less likely to apply zero P than the BRR, as expected. They were less likely to apply N fertilizer at rates higher than DAP (which would be zero in this case), as well as being less likely to use irrigation and variable rate technology. They were also less likely than those applying the BRR to have taken a P soil test for 2012. This result might imply farmers take soil tests when they plan to apply P fertilizer. These farmers were also less likely to have followed fertilizer dealers or other information sources for N fertilizer recommendations. "}, {"section_title": "Conclusion", "text": "Water pollution caused by fertilizer use is not easy to control because it is a nonpoint source. In this case, farmers' management efforts to reduce nutrient pollution caused by excessive fertilizer use will be important to improve water quality. It is disappointing that even some of those who test their soil over-apply P fertilizer. Contrary to much of the literature that implies that farmers use soil tests to minimize fertilizer costs, those who want maximum production may use soil tests as the basis for high fertilizer use. Alternatively, those who plan to apply P that year may take soil tests. Educational efforts that highlight the cost savings involved with optimal fertilizer management may be helpful. There would be no increase in crop yield if fields already have high P levels (Webb, Mallarino and Blackmer 1992). One of limitation of this study is a lack of information about P application history. P is a more stable nutrient than N due to its physical characteristics (Bruulsema et al. 2012). Therefore, some farmers don't apply P fertilizer every year, however we don't know when they previously applied P and at what level. If we could consider historical applications, perhaps by using a panel data set, we could get a better picture of P application behavior. We also don't have information on P levels in the soil. The regression for soil testers accounts for this issue since it accounts for both yield goal and soil P levels, which are a function of previous applications. One recommendation from this research is thus to add questions to the ARMS dataset that reflect the stable nature of P such as previous P application history and soil testing history. For future studies, it would be better to use methods that integrate the soil test regression with that of the P application rate to examine the effect of soil testing on optimal fertilizer application rate. In addition, the comparison between soil testers and non-testers could give additional insights. The ARMS data does not provide information on previous soil tests so people who tested the previous year are combined with those who never test their soil. Lastly, prices were not significant in our study, perhaps because the data set was cross sectional and prices had little variation in one year. Again, a panel dataset might be useful in this regard. "}]