[{"section_title": "Abstract", "text": "High Medicaid nursing homes (85% and higher of Medicaid residents) operate in resource-constrained environments. High Medicaid nursing homes (on average) have lower quality and poorer financial performance. However, there is significant variation in performance among high Medicaid nursing homes. The purpose of this study is to examine the organizational and market factors that may be associated with better financial performance among high Medicaid nursing homes. Data sources included Long-Term Care Focus (LTCFocus), Centers for Medicare and Medicaid Services' (CMS) Medicare Cost Reports, CMS Nursing Home Compare, and the Area Health Resource File (AHRF) for 2009-2015. There were approximately 1108 facilities with high Medicaid per year. The dependent variables are nursing homes operating and total margin. The independent variables included size, chain affiliation, occupancy rate, percent Medicare, market competition, and county socioeconomic status. Control variables included staffing variables, resident quality, for-profit status, acuity index, percent minorities in the facility, percent Medicaid residents, metropolitan area, and Medicare Advantage penetration. Data were analyzed using generalized estimating equations with state and year fixed effects. Results suggest that organizational and market slack resources are associated with performance differentials among high Medicaid nursing homes. Higher financial performing facilities are characterized as having nurse practitioners/physician assistants, more beds, higher occupancy rate, higher Medicare and Medicaid census, and being for-profit and located in less competitive markets. Higher levels of Registered Nurse (RN) skill mix result in lower financial performance in high Medicaid nursing homes. Policy and managerial implications of the study are discussed."}, {"section_title": "Introduction", "text": "Nursing homes have to balance the delivery of high-quality care while ensuring financial viability in an increasingly challenging and competitive environment. Nursing home financial viability is an area of increasing concern due to increasing competition from alternative providers, declining occupancy rates, and a changing regulatory environment. Research suggests that facilities with sustained poor financial performance may face risk of insolvency and closure, potentially affecting access to long-term care in rural or underserved areas. [1] [2] [3] [4] Furthermore, inadequate financial resources may force nursing homes to make decisions that can negatively impact the quality of care delivered. For example, nursing homes may choose to alter their nursing skill mix as a cost-reduction mechanism, and such reductions have been found to negatively impact resident quality. 5 As such, nursing homes must be financially secure to ensure the viability of the organization and to maintain an adequate level of care to the residents."}, {"section_title": "INQUIRY", "text": "This imperative is particularly important in the case of nursing homes with a high proportion of Medicaid residents. Mor and colleagues have described the nursing home industry as a \"two-tiered\" system. 6, 7 The lower tier nursing homes operate in a resource-constrained environment given their high proportion of Medicaid residents (85% or higher), a lower percentage of private pay residents (10% or less), and a low percent of residents on Medicare (8% or less). Medicaid is the largest payer of nursing homes but its reimbursement rates typically lag Medicare as well as private pay. [8] [9] [10] Lower tier nursing homes are characterized by lower professional staffing and occupancy rates, and worse quality. 6 Such facilities have a higher proportion of minority residents and are generally located in communities with significant proportions of poor and minority residents, exacerbating the existing disparities in delivery of nursing home care. 11, 12, 6 High Medicaid nursing homes are more likely to encounter financial challenges due to lack of other revenue sources (eg, other payers or philanthropy) needed to overcome Medicaid shortfalls. 12 However, there are performance differences among high Medicaid nursing homes, with some facilities performing significantly better than others in regard to financial performance. 13 What may explain the superior performance of certain nursing homes that are operating in a similarly resource-constrained environment? Extant research has underlined the importance of contextual factors on nursing home financial performance.\n2, 14 These factors may include slack resources and environmental resource availability, which may be critically important in high Medicaid nursing homes.\nThe purpose of this article is to examine the organizational and market factors that are associated with financial performance variations among high Medicaid nursing homes. Our findings will provide insights into the barriers and facilitators of high performance among underresourced nursing homes.\nSize and occupancy rates matter when it comes to high Medicaid facilities, with larger facilities and those with higher occupancy rate having higher operating margin. Larger facilities may have lower average costs because of economies of scale. In addition, larger facilities may be able to attract more talented management and staff, which may provide competitive advantage. Similarly, facilities with higher occupancy can optimize the use of its existing assets. Lower occupancy rate implies the underutilization of existing fixed assets, which may affect the facility's ability to cover its fixed costs and as a result lower its financial performance. Prior research has shown that larger size and higher occupancy rate are associated with higher financial performance.\n2, 14, 41 In addition, payer mix can differentiate higher performers from lower performers among high Medicaid facilities, with higher Medicare census being associated with superior performance. Medicaid reimbursement rates are significantly less generous than Medicare; therefore, a higher proportion of Medicare residents may offset some of the Medicaid reimbursement shortfalls. In addition, increasing Medicare census can also result in economies of scope. Therefore, a strategy to increase Medicare census may be particularly important among high Medicaid nursing homes.\nInterestingly, we observed that a higher Medicaid payer mix was also associated with a higher operating margin. This suggests that increasing private payer mix may not be an optimal strategy for high Medicaid nursing homes. While generally, private pay residents have higher reimbursement rates than Medicaid, such a strategy may also increase costs as facilities attempt to increase the amenities and services to attract private pay residents. The additional costs may offset the benefits of additional reimbursement.\nWe also observe that high Medicaid nursing homes with better operating margins are located in less competitive markets. Markets with higher competition can be characterized as less munificent. As competition increases, high Medicaid nursing homes may lose market share to other betterresourced nursing homes. Furthermore, facilities in more competitive markets may face higher labor costs as a result of more competition for nurse staffing resources.\nWe hypothesized that chain affiliation would be associated with better financial performance. However, the results did not support our hypothesis. Chain-affiliated nursing homes may be burdened with additional expenses associated with chain-affiliated decisions like system-wide expansion or other larger investments which may obviate the other financial benefits of chain affiliation including economies of scale. 2 We also hypothesized that the SES of the nursing home community would influence financial performance; however, our findings did not support this hypothesis. One particular reason may be that high Medicaid nursing homes are located in lower SES communities compared with non-high Medicaid nursing homes; therefore, there may not be large variations in community SES among high Medicaid nursing homes. Another explanation may be that we focus on countylevel SES. However, there may be within county variations in SES, which are not accounted for when using county-level measures.\nAs far as organizational control variables, there were a few additional significant findings. For-profit, high Medicaid nursing homes had higher operating margins compared with not-for-profit. For-profit organizations have a responsibility to maximize shareholder wealth, so these organizations may focus on decreasing costs and increasing profitability. Also compared with not-for-profit, for-profit facilities pay taxes and may not have as much access to nonoperating sources of revenues (ie, endowments, charitable contributions). This may put greater pressure on for-profit facilities to maximize operating margins.\nResident's acuity was also negatively associated with total margin in high Medicaid nursing homes. Acuity reflects the resident's level of care needed. Given that resident acuity did not affect the operating margin, this suggests that reimbursement is at par with the higher cost associated with higher acuity of the residents. However, the higher acuity facilities may be incurring higher capital costs, such as technology, which may translate into higher interest payments, and as a result lower total margin. Further research is needed to explore the pathways by which resident acuity may be affecting total margin.\nStaffing patterns were also associated with financial performance among high Medicaid nursing homes. While having an NP/PA was associated with higher operating margin, RN skill mix was associated with lower operating margin. RN skill mix assesses the degree of RN supervision among nursing staff. While skill mix is important as it relates to the quality of care, there is a trade-off with increased cost. 38, 42, 43 Given the lower Medicaid reimbursement, high Medicaid facilities may not be adequately compensated for higher staffing beyond statutory requirements. Compensation also varies significantly among different nurse skill mixes. As such, an increase in skill mix may significantly increase costs, which can decrease profitability. However, our study focused on the direct effect of RN staffing mix on financial performance, whereas there may be a potential indirect effect of RN skill on financial performance through better quality. Quality of care has been associated with lower costs and ultimately better financial performance. 14 On the contrary, having an NP/PA is associated with better operating margin. The observed positive relationship may be the result of lower costs and/or increased revenues. Using NPs/PAs can be a strategy to increase the level of care provided within nursing homes. 44, 45 Research has found that NPs/PAs can increase access to primary care with comparable quality of care to that provided by physicians, resulting in fewer avoidable hospitalizations and other favorable outcomes. [46] [47] [48] [49] In addition, services provided by an NP/PA are billable services to Medicare and other insurance programs, which can increase revenues. The utilization and adjustment of staffing mix to include NPs/PAs offers a potential solution to the structural problem(s) facing nursing homes by improving quality while reducing costs."}, {"section_title": "Conceptual Framework", "text": "According to resource dependence theory (RDT), the key to organizational survival is \"the ability to acquire and maintain resources.\" 15 Resources are the inputs that organizations need to produce products or services. On the contrary, the organization's environment consists of other entities from which it procures resources and to which it sells products and services. RDT suggests that organizations engage in exchange relationships with other organizations and stakeholders, collectively termed as its environment, to acquire resources. Organizational factors can influence an organization's level of power in an environment, which in turn, will impact the ability of the organization to gain resources. Furthermore, these organizational resources represent enabling factors that allow the organization to respond to opportunities and threats in its environment, which can ultimately lead to better performance."}, {"section_title": "Organizational Factors", "text": "Size is an important structural factor that can influence organizational performance. 5 Applying the concepts of RDT, larger facilities can exert greater power within their exchange relationships. 16, 17 Larger facilities also benefit from economies of scale, which are expected to result in lower resident cost per day and can ultimately lead to better financial performance. 18 In addition, larger organizations command higher amounts of internal resources, which may help them survive periods of resource uncertainty. 19, 20 Therefore, we hypothesize that nursing home size will facilitate superior financial performance, among nursing homes with resource constraints, such as those with high Medicaid."}, {"section_title": "Hypothesis 1:", "text": "Among nursing homes with high Medicaid census, larger nursing homes will experience better financial performance.\nChain-affiliated nursing homes are likely to have greater access to financial resources and managerial talent. This may provide chain-affiliated nursing homes with the opportunity to adopt superior control mechanisms to monitor and decrease costs. For instance, Castle and colleagues found that chain-affiliated facilities had lower antipsychotic drug use, which suggests better care management. 21 Chainaffiliated facilities may also achieve economies of scale by sharing resources such as administrative staff and nurses among their facilities facilitating maximization of slack resources. 22 Chain-affiliated facilities are also likely to benefit from economies of finance, borrowing, and common stock issues, as well as economies of promotion (promotion of a single brand reduces consumer search for price and quality information).\n2 All these factors can positively impact financial performance, particularly for nursing homes with resource constraints, such as those with high Medicaid. Therefore, we hypothesize that among high Medicaid nursing homes, chain-affiliated nursing homes will have higher financial performance.\nHypothesis 2: Among nursing homes with high Medicaid census, chain-affiliated nursing homes will experience better financial performance.\nRDT suggests that variations in availability of resources may help explain differential organizational performance. 23 The availability of nursing home resources is not merely a reflection of size but also its occupancy rate. From 1991 to 2014, nursing home occupancy rate has fallen from 91% to 82%. 24, 25 Organizations that are operating at capacity or that have high levels or occupancy are producing at their optimal levels and fully utilizing their fixed assets. In contrast, facilities with lower occupancy rates may be unable to cover their fixed costs. The lack of financial resources may further impede their ability to invest in themselves, thus contributing to a spiraling vicious cycle of declining financial performance. Therefore, we hypothesize the following: Hypothesis 3: Among nursing homes with high Medicaid census, nursing homes with higher occupancy will experience better financial performance.\nThe payer mix of a nursing home can have a significant impact on its performance. Medicare reimbursement for post-acute services are an increasingly important source of revenue for nursing homes. 26, 27 Nursing homes that have a higher Medicare resident census typically have better financial performance because of its higher reimbursement for skilled nursing services compared with Medicaid. 28 These additional resources would be particularly valuable and significant in high Medicaid nursing homes as they operate in a resource-constrained environment and will allow the facility to invest in technology and quality improvement; therefore, we hypothesize the following:\nHypothesis 4: Among nursing homes with high Medicaid census, nursing homes with a higher Medicare payer mix will experience better financial performance."}, {"section_title": "Market Factors", "text": "As RDT suggests, the successful quest for resources is essential for organizational survival; an organization's ability to secure and maintain a consistent flow of resources is more challenging in more competitive environments due to increased competition for the shared pool of resources. 15, 29 High Medicaid nursing homes are particularly vulnerable to competitive forces. As competition increases, high Medicaid nursing homes may lose market share to better-resourced nursing homes. Therefore, we hypothesize the following:\nHypothesis 5: Among nursing homes with high Medicaid census, those located in more competitive markets will experience worse financial performance.\nOrganizations actively try to obtain critical resources from the environment to ensure continued existence and the achievement of their goals. 30 Nursing homes, like other organizations, depend on the availability of resources and the munificence of the environment. 10 An organization's ability or skill in acquiring resources may help explain variations in performance success. Nursing homes in more munificent markets may have greater access to the necessary resources required for organizational survival. 28 The munificence of the environment can be conceptualized as the socioeconomic conditions of a county, which can include per capita income, poverty level, educational level, and unemployment rate. Nursing homes operating in counties with higher socioeconomic status (SES) will have greater access to resources, such as a more skilled workforce and better community resources. This can in turn result in better financial performance. Therefore, we hypothesize the following: Hypothesis 6: Among nursing homes with high Medicaid census, those located in counties with higher SES will experience better financial performance."}, {"section_title": "Method", "text": ""}, {"section_title": "Data Sources", "text": "The study uses 4 secondary data sources for the years 2009 to 2015: Brown University's Long-Term Care Focus (LTCFocus) data set, Centers for Medicare and Medicaid Services' (CMS) Medicare Cost Reports, CMS Nursing Home Compare, and the Area Health Resource File (AHRF). LTCFocus provides data on facility characteristics, staffing, and operations. Medicare Cost Reports is a public access data set that captures cost report information for all CMS-certified nursing homes accepting Medicare residents. Nursing Home Compare data provide information on nursing home Stars Ratings. Finally, AHRF contains data on socioeconomic and demographic characteristics of markets where nursing homes are located.\nSimilar to prior work by Mor and colleagues, we define high Medicaid census nursing homes as facilities that have 85% or higher Medicaid census, 10% or less of private pay residents, and less than 8% of Medicare residents. 6 Hospitalbased and government nursing homes are excluded because their operating environment and strategic behavior are generally different from freestanding and private facilities.\n2 Our analytic sample consists of 7,754 nursing home year observations or an average of 1,108 nursing homes per year."}, {"section_title": "Measures", "text": "Dependent variable. Financial performance was conceptualized as operating margin and total margin. Operating margin is an indicator of operating efficiency, which focuses on core business functions and excludes the influence of nonoperating income like endowments and nonoperating expenses such as interest payments. Operating margin has frequently been used in the health care literature.\n14 It is calculated as follows:\nOperating margin = (operating revenueoperating expenses) ) / operating revenue.\nOn the contrary, total margin is an indicator of overall profitability and accounts for all revenues (operating and nonoperating revenues) and all expenses (operating and nonoperating expense):\nTotal profit margin = total revenue total expenses"}, {"section_title": "INQUIRY Independent variables.", "text": "Nursing home size (Hypothesis 1) is measured by the number of beds. Chain affiliation (Hypothesis 2) is a dichotomous indicator of whether the nursing home is a member of a chain or not (1 = yes, 0 = no). Occupancy rate of nursing homes is the percentage of occupied beds in the facility (Hypothesis 3). Percent Medicare is the proportion of residents in the facility whose primary payer is Medicare (Hypothesis 4). The Herfindahl-Hirschman Index (HHI) is used as a measure of market competition (Hypothesis 5) and is defined as the sum of the squares of market shares for nursing homes in each county. Scores close to \"0\" represent highly competitive markets, while scores of \"1\" represent a monopolistic market. SES (Hypothesis 6) of the county where the nursing home is located is measured using per capita income, percentage of population under the poverty level, percentage of persons with high school or higher, and percent unemployment rate. County was used to approximate the market for nursing home care, and this approach has been extensively used in the literature. 14, 16, 31 Control variables. We also control for other structural and market factors that have been found to be predictors of financial performance. 18, [32] [33] [34] [35] [36] Organizational/structural factors include the for-profit status (1 = yes, 0 = no), CMS Nursing Home Compare's Overall Quality Star Rating (1 to 5), use of nurse practitioner (NP)/physician assistant (PA) (1 = yes, 0 = no), RN skill mix [(RN FTEs + Licensed Practical Nurse (LPN) FTEs)], case mix (resident Acuity index), percent of residents that are minorities (% non-Hispanic Blacks, % Hispanics, and % other race/ethnicity), and percent of residents that are Medicaid. The Overall Quality Star Rating consists of 1 to 5 stars based on facility performance for 3 types of measures, each of which has its own 5-star rating: health inspections, nursing staff levels, and Minimum Data Set and claims-based quality measures. While the measures used in the skilled nursing facility (SNF) star ratings have come under scrutiny in recent years, 10,37-39 they still provide a useful summary of SNF quality and are also correlated with SNF costs. 40 Market factors refer to countylevel variables where the nursing home is located: Medicare Advantage (MA) penetration rate and urban area (1 = yes, 0 = no). MA penetration rate consists of the percent of Medicare beneficiaries enrolled in an MA plan. A county is classified as urban based on the Rural-Urban Continuum Codes (RUCC) for metro and urban areas (codes 1-7), whereas rural represents \"completely rural areas\" (codes 8-9)."}, {"section_title": "Analysis", "text": "Bivariate statistical analysis was conducted to compare high Medicaid to non-high Medicaid nursing homes on all variables used in the analysis. Given the longitudinal nature of the data, generalized estimating equations (GEE) were used to model the relationships between the two dependent variables (operating margin and total margin) and the independent and control variables. GEE accounts for the clustered nature of the data due to repeated nursing home observations over time. In addition, state and year fixed effects were included in the model. State fixed effects control for interstate differences in regulatory environment, while year fixed effects control for time trends. STATA 13 was used for the statistical analysis. Statistical tests were evaluated at the .05 level of significance."}, {"section_title": "Findings", "text": "The descriptive statistics in Table 1 \nTests of significance were conducted as appropriate (t tests for continuous variables and chi-square for categorical variables). As previously indicated, high Medicaid nursing homes are those facilities that have a high proportion of Medicaid residents (85% or higher), a lower percentage of private pay residents (10% or less), and a low percent of residents on Medicare (8% or less). Compared with non-high Medicaid nursing homes, high Medicaid nursing homes had lower operating and total margin, lower Star ratings, more beds and higher occupancy, lower percent of Medicare, and a higher percentage of Black, Hispanic, and Other race/ethnicity. High Medicaid nursing homes were more likely to be for-profit and non-chain affiliated. Finally, high Medicaid nursing homes were found in communities with higher levels of poverty and unemployment, and lower levels of education. Table 2 shows the GEE results for the 2 dependent variables (operating margin and total margin). Among organizational factors, Hypothesis 1 was partially supported. Larger high Medicaid nursing home were found to have a statistically significant higher operating margin (P < .001), but size was not significantly associated with total margin. Hypothesis 2 was not supported. Chain affiliation was not significantly associated with better performance. Hypothesis 3 was supported. High Medicaid nursing homes with higher occupancy rate were found to have statistically significant higher operating margin (P < .001) and total margin (P < .001). Hypothesis 4 was partially supported. Nursing homes with a higher percentage of Medicare residents were found to have higher operating margin (P < .05); however, a significant relationship was not found with total margin.\nAmong market variables, Hypothesis 5 was partially supported. High Medicaid nursing homes had higher operating margin (P < .05) when operating in less competitive markets. However, the relationship between competition and total margin was nonsignificant. Finally, Hypothesis 6 was not supported. Contrary to our expectations, education levels, per capita, percent poverty level, and percent unemployment rate were not significantly associated with financial performance.\nAmong the control variables, only a few variables were significantly associated with better performance. For-profit high Medicaid nursing homes had significantly (P < .001) higher operating margin. Resident acuity was significantly associated (P < .05) with lower total margin. Medicaid payer mix, even in high Medicaid nursing homes, was significantly (P < .05) associated with a higher operating margin. With respect to staffing, the results were mixed. The presence of an NP/PA was significantly associated with higher operating margin (P < .05). However, higher skill mix was significantly (P < .01) associated with lower operating margin. With respect to resident characteristics, there was no significant difference in financial performance for high Medicaid nursing homes as it related to race/ethnicity. Finally, there was no significant difference as it related to MA penetration, location (rural/urban), or Star ratings."}, {"section_title": "Discussion", "text": "Based on RDT, this study examined the contextual factors that may be associated with higher financial performance among high Medicaid nursing homes. As hypothesized, organizational factors such as facility size, occupancy rate, and Medicare census, as well as market competition were predictors of financial performance. On the contrary, organizational factors such as chain affiliation and community factors such as socioeconomic economic status were not significantly associated with financial performance. "}, {"section_title": "Policy and Managerial Implications", "text": "High Medicaid nursing homes on average had a negative total margin. As such, these nursing homes are at particular risk for financial distress and ultimately closure. Given that these nursing homes serve more racial/ethnic minorities and are located in lower SES communities, closure of these facilities can have a negative impact on access to long-term care for more vulnerable populations. Furthermore, lower financial resources can in turn affect the facility's capacity to properly staff or invest in quality improvement initiatives, with potential negative consequences for quality. As such, federal and state-level policymakers should monitor the financial health of these nursing homes and consider strategies that may shore up their finances.\nResults suggest smaller facilities and those with lower occupancy and operating in a more competitive environment may be at particular financial risk. Higher resident acuity may further compound the financial challenges of these facilities. These facilities should be particularly monitored for financial distress. Policymakers should also consider supplemental Medicaid payments for high Medicaid nursing homes with specific incentives to promote increased nurse staffing.\nResults also suggest implications for managers of high Medicaid nursing homes. First, a strategy to increase Medicare resident mix may serve as a competitive strategy. However, this may require increased staffing and quality improvement strategies to position themselves in an era of public reporting of quality/star ratings and value-based purchasing. Second, using NPs/PAs may be another strategy to achieve competitive advantage. Given the resource-constrained environment of high Medicaid nursing homes, these facilities may consider partnering with other facilities to share NPs/PAs, or using NPs/PAs on a part-time contractual basis."}, {"section_title": "Limitations", "text": "This study presents several limitations. First, this study is limited to high Medicaid nursing homes with a Medicare census, because Medicare Cost Reports does not capture data for facilities with no Medicare census. As such, our analysis may have excluded some of the most financially challenged INQUIRY nursing homes, eg, those with 100% Medicaid census. Second, the study relied on secondary data, which presents limitations on some of the variables used. For example, the variable on use of NP/PAs only indicates whether or not a facility uses NPs/PAs; it does not provide information on FTEs, or whether the provider is hired or on a contract basis. Third, while we used state fixed effects to control for statelevel unobserved invariant characteristics, there may have been state-level policy changes during the studied period that may have impacted financial performance and would not have been captured by our analysis. Finally, our study focused on high Medicaid nursing homes; therefore, our findings may not be generalizable to the industry as a whole. Despite these limitations, we believe this is an important study, given that it is one of the first articles to focus on high Medicaid nursing homes and the contextual factors affecting their performance."}, {"section_title": "Conclusion", "text": "The primary aim of this study was to improve our understanding of contextual factors associated with financial performance variations among high Medicaid census nursing homes. The findings from this study extends prior research that has explored contextual factors associated with nursing home performance. 50, 51 Furthermore, our study provides a more nuanced understanding of the performance of resourceconstrained facilities.\nIt is clear that nursing home performance remains a major policy challenge, which is only exacerbated in the case of high Medicaid nursing homes operating in a resource-constrained environment and disproportionately serving the disadvantaged including the poor and minorities. However, the presence of performance variations within this group, with some facilities performing significantly better, suggests there may be strategies that high Medicaid facilities may pursue to achieve competitive advantage. There is need for more research focusing on these facilities as they serve populations, which are of critical policy interest."}, {"section_title": "Declaration of Conflicting Interests", "text": ""}]