[{"section_title": "Abstract", "text": "Students' perceptions of their mathematics ability vary by gender and seem to influence science, technology, engineering, and mathematics (STEM) degree choice. Related, students' perceptions during academic difficulty are increasingly studied in educational psychology, suggesting a link between such perceptions and task persistence. Despite interest in examining the gender disparities in STEM, these concepts have not been considered in tandem. In this manuscript, we investigate how perceived ability under challenge-in particular in mathematics domains-influences entry into the most sex-segregated and mathematics-intensive undergraduate degrees: physics, engineering, mathematics, and computer science (PEMC). Using nationally representative Education Longitudinal Study of 2002 (ELS) data, we estimate the influence of perceived ability under challenging conditions on advanced high school science course taking, selection of an intended STEM major, and specific major type 2 years after high school. Demonstrating the importance of specificity when discussing how gender influences STEM career pathways, the intersecting effects of gender and perceived ability under mathematics challenge were distinct for each scientific major category. Perceived ability under challenge in secondary school varied by gender, and was highly predictive of selecting PEMC and health sciences majors. Notably, women's 12th grade perceptions of their ability under mathematics challenge increased their probability of selecting PEMC majors over and above biology. In addition, gender moderated the effect of growth mindset on students' selection of health science majors. Perceptions of ability under challenge in general and verbal domains also influenced retention in and declaration of certain STEM majors. The implications of these results are discussed, with particular attention to access to advanced scientific coursework in high school and interventions aimed at enhancing young women's perceptions of their ability, in particular in response to the potentially inhibiting influence of stereotype threat on their pathways to scientific degrees."}, {"section_title": "Introduction", "text": "Socially influenced beliefs about mathematics ability have been studied as possible explanations for the gender gap in science, technology, engineering, and mathematics (STEM) higher education. Nevertheless, there remains insufficient conceptual and empirical clarity about how beliefs influence gendered differences over time, specifically during upper secondary and postsecondary school-the primary years for attrition from pathways to science careers (Berryman, 1983; Morgan et al., 2013) . Notably, theories have emerged suggesting that persistence when encountering potentially negative or challenging situations is influenced by students' perceived ability to complete specific tasks (selfefficacy) (Bandura, 1977; Pajares, 1996) , beliefs about the malleability of their abilities (mindset) (Dweck, 2007 (Dweck, , 2008 , the alignment of their skills to the challenge presented by the material (flow) (Csíkszentmihályi and Csikszentmihályi, 1988; Shernoff et al., 2003) , and fear of confirming negative stereotypes related to their identities (stereotype threat) (Steele, 1997; Beilock, 2008) . Related, students' self-assessments of their mathematics ability appear to vary by gender and influence STEM degree choice (Correll, 2001; Parker et al., 2012; . These studies indicate a growing interest in examining the puzzling persistence of gender disparities in STEM. These concepts have not been considered in tandem however, to investigate how domain-specific and domain-general perceived ability under challenging conditions influence the gender gap in the most sexsegregated undergraduate degrees: physics, engineering, mathematics, and computer science (PEMC).\nThis study takes on this gap in the literature. Using the nationally representative Education Longitudinal Study of 2002 (ELS) data, we estimate the influence of mindset and self-perceptions of mathematics ability in challenging contexts on each subsequent step in the STEM pipeline: completing advanced high school science courses, persistence in a STEM major, and specific STEM major selection. Importantly, we compare and control for variation in students' response to challenge in verbal and mathematics tasks, while also controlling for more objective measures of verbal and mathematics ability. Moreover, this study uses the most recent and complete U.S. panel data available to examine how perceptions of mathematics ability on difficult tasks changes over time 1 , during the years that appear to be when most girls who exit the STEM pipeline conclude that they are more capable in other domains."}, {"section_title": "Previous Research", "text": "Empirical studies demonstrate a persistent gender gap in postsecondary degree attainment in certain mathematically-intensive STEM disciplines, both internationally (OECD, 2013) and domestically (NSF, 2013) . Students' perceptions in response to challenges and negative feedback may be particularly informative to enhancing our understanding of how to encourage women's persistence in these fields. Performance feedback is formally given to students through grades, which some have suggested can imply subject-field difficulty to students (Drew, 2011; Putman et al., 2014) . Research on the influence of STEM grades is mixed, however. For instance, in his longitudinal study of a single, elite research institution, Ost (2010) found that female physical science majors were more likely than their male physical sciences or female life sciences counterparts to change majors in response to lower grades in their STEM courses. In contrast, Griffith's (2010) findings from an analysis of multi-institutional datasets suggests that the positive effects of higher STEM GPAs on STEM persistence is likely more important for men. Such findings have led some scholars to conclude that grades cannot adequately predict students' responses to challenge, and instead suggest investigations of social psychological factors that may play an even larger role in student choice-making processes (Rask, 2010; Stearns et al., 2013) .\nThis study builds upon these efforts by looking specifically at the role of beliefs about difficult mathematics material, a vital competency area for success in postsecondary STEM fields. To frame our study, we discuss factors that have been shown to impact persistence in scientific fields. In particular, we focus on self-perceptions of ability in mathematics with difficult material, from tenth grade through university major selection."}, {"section_title": "How Demographic, Academic, and Schooling Contexts Influence Scientific Ambitions", "text": "Previous scholars have demonstrated links between family background, high school preparation, and environmental factors that have played a role in students' decisions to pursue degrees in scientific fields. Overall, female gender has been widely shown to differentially affect youths' preparedness for and persistence in certain STEM fields, both across and within racial-ethnic groups. In a qualitative study of prospective STEM majors at seven campuses in the early 1990s, Seymour (1999) found that women who entered college as potential STEM majors were less rigid in their choice of major than were men, with the exception of those most socioeconomically disadvantaged. Interestingly, Hanson (2008) finds that contemporary labor norms in the black community contribute to black girls' resilience in pursuing scientific careers. Moreover, black and Latina girls seem to take more advanced high school mathematics course sequences than their male peers (Riegle-Crumb, 2006) . In a study of Latino STEM majors, Cole and Espinoza (2008) found that participants' gender had the third largest positive impact on GPA, providing evidence that Latinas outperform Latinos in STEM postsecondary classrooms. A national longitudinal study using ELS data similarly found a nuanced relationship between gender and race/ethnicity in who chooses STEM majors in college, with Latino males being the group least likely to pursue STEM and black males being the most likely among those who had completed pre-collegiate STEM coursework (Perez-Felkner et al., 2014) .\nIn the later years of high school, students may elect to take advanced mathematics and science courses. Gendered patterns in completion of these courses have been found , as girls may be less inclined to pursue areas that have not been associated with female success. Notably, some gaps have closed in recent years. For example, the National Center for Education Statistics reported gender parity in high school calculus completion in 2009 (Kena et al., 2014) . While research on mathematics course taking is more extensive than that on science course taking (e.g., Davenport et al., 1998) , the latter may be more important given the persistence of gendered patterns in science. For example, this report also found that girls were less likely to complete high school physics (33% of girls as compared to 39% of boys).\nThese high school course decisions can influence postsecondary STEM major selection and degree completion, in particular in PEMC fields. Across three nationally representative cohorts attending high school in the 1980s, 1990s, and 2000s, completion of physics and calculus before H.S. graduation each increased students' chances of enrolling in physical science or engineering majors in college (Riegle-Crumb et al., 2012) . While completing advanced coursework increases girls' chances of going on to declare postsecondary majors in physical sciences, engineering, mathematics, and computer science, those girls who enrolled in more advanced mathematics and science coursework seemed to have more negative self-assessments of their ability and mindsets regarding mathematics ability . Holding these negative beliefs may contribute to struggles women might encounter as some of the comparatively few women majoring in these fields in college. Nevertheless, this body of research suggests that advanced coursework positions students-including young women-to choose PEMC majors.\nDecades of research have indicated that high school contexts contribute to variation in students' postsecondary outcomes (Coleman et al., 1982; Perez-Felkner, in press ), which may influence their preparedness for and persistence in scientific majors. Geographic proximity to college may influence where and in what type of college students enroll (e.g., Rouse, 1995) ; Latinos are especially likely to attend college closer to home (López Turley, 2009 ). Proximity to college seems to influence enrollment among both advantaged and low-income students, but is less of an issue among students in the northeast, which has both a greater density of post-secondary offerings, selective colleges, and urban areas (Griffith and Rothstein, 2009) . Some studies have suggested that students are less likely to select STEM majors if they attend selective postsecondary institutions (Griffith, 2010; Engberg and Wolniak, 2013) , while others suggest that institutional selectivity has no effect on women and underrepresented students' pursuit of degrees in scientific fields major (Smyth and McArdle, 2004; . At the secondary level, students attending urban schools have tended to have lower postsecondary outcomes (Niu and Tienda, 2013) . Moreover, girls in rural schools were found to be more likely than those in suburban or urban schools to choose STEM majors in college, irrespective of their high school preparation for these fields (Perez-Felkner et al., 2014) . Gendered differences in scientific degrees may then be partially explained by regional variation in both the density of 4-year colleges and the proportion of students living in cities vs. suburban and rural communities."}, {"section_title": "Beliefs about Mathematics", "text": "While some continue to argue that cognitive ability in mathematics varies by gender and drives the gap in the STEM labor force (Hedges and Nowell, 1995; Summers, 2005) , empirical evidence largely refutes this claim (Hyde and Linn, 2006) . Notably, a meta-analysis of U.S. state assessments of mathematics performance found that 2nd through 11th grade students did not significantly differ by gender; however limitations in these data did not allow for analyses of complex problem solving and advanced mathematics, areas in which extant research finds that gender differences may be more likely to emerge (Hyde et al., 2008) . Research spanning two decades' of nationally representative cohorts reveals gender gaps in some STEM majors are not fully explained by achievement in mathematics (Riegle-Crumb et al., 2012) . Many have theorized that individuals' understanding of themselves and mathematics can influence students' major choices. For instance, examined ELS data to show that subjective orientations to mathematics (operationalized as perceived mathematics ability as well as engagement in, valuing, and mindset toward mathematics ability) was positively and significantly correlated with selection of PEMC and Biological sciences majors. Similarly, but with a focus on selfconcept, Parker et al. (2012) analyzed large-scale datasets from both Germany and England. Their findings revealed that mathematics self-concept predicted students' entry into physical sciences, engineering, and mathematics. In addition, self-concept was found to be a more powerful predictor of major choice than standardized tests of ability, consistent with studies showing that ability does not explain the gender gap Riegle-Crumb et al., 2012) . Correll (2001) used National Education Longitudinal Study (NELS) 1988 data to show that girls underrate their abilities in mathematics, even after controlling for performance feedback and objective measures of their abilities. Also using NELS, but extending her research into postsecondary outcomes, Ma (2011) found that perceptions of mathematics ability predicted entry into a STEM field, and that those perceptions were least predictive of entry into life science majors. Consistent with this research, Sax (1994) analyzed Cooperative Institutional Research Program (CIRP) 1985/1989 data and found that mathematics self-concept at the beginning and end of college was significantly lower for women in her sample than men. Importantly, her research also showed that for women in particular, mathematics self-rating at the end of college was significantly and strongly predicted by confidence in mathematics ability before entering postsecondary environments.\nResearch also reveals that perceptions do not exist in a vacuum. For instance, Correll (2001) found that students compare their progress in mathematics and verbal domains, with higher scores and perceptions of ability in English predicting lower perceptions of mathematics ability and selection out of advanced mathematics courses. Wang et al. (2013) found evidence that ability in both mathematics and verbal domains might lead women to believe that they have a wider range of career choices. In particular, those with high ability in both mathematics and verbal domains were predicted to select out of STEM fields compared to women with high mathematics ability and moderate verbal ability.\nGiven the findings summarized above, this study considers beliefs about abilities in general, verbal, and mathematics domains. Further, we focus particularly on students' perceived ability to overcome challenging or difficult material. We hypothesize that variations in those perceptions predict selection of advanced science courses in high school, persistence in STEM fields, and selection of mathematics-intensive majors."}, {"section_title": "Conceptual Framework", "text": "Our research questions and design respond primarily to prominent social psychological theories, which also inform the interpretation of our results. Bandura's (1977) self-efficacy is perhaps the most widely applied educational motivation theory, especially in investigations of the gender and race/ethnicity variation in STEM fields (Pajares, 1996; Rittmayer and Beier, 2009) . Describing students' perceptions of their ability to complete specific tasks in particular domains (such as long division in mathematics), self-efficacy links beliefs, behaviors, and environments to explain students' choice making processes (Pajares, 1996; Zimmerman, 2000) . The theory's value arises in part from its wide application-it can be applied across disciplines, given the application is task-specific. In focusing on one's beliefs in their ability to do a specific task, self-efficacy measures may miss students' immediate and overall assessment of a domain: whether or not it presents an overwhelming challenge to the student to begin with, before they start contemplating their ability to complete specific tasks within that field of study. Therefore, our analysis focuses on domain-specific (rather than task-specific) perceptions of ability under challenge."}, {"section_title": "Self-Efficacy", "text": ""}, {"section_title": "Flow", "text": "In contrast to self-efficacy, Csikszentmihalyi's flow theory integrates people's perceptions of challenge and their corresponding perceptions of ability. Flow theory, at its heart, is about \"optimal\" experience (Nakamura and Csikszentmihalyi, 2002, p. 89 )-the moment when people become so involved in their tasks, that they lose their sense of self-consciousness and the passage of time. According to the theory, people arrive in this state of being when a task just meets the threshold of their abilities, and thus are perceived as challenging, but not overwhelming (Csíkszent-mihályi and Schneider, 2000; Nakamura and Csikszentmihalyi, 2002) . Additionally, people gain such satisfaction from moments when they are in flow, that they seek out tasks that will continue to provide them with such experiences (Csíkszentmihályi and Csikszentmihályi, 1988; Csíkszentmihályi and Csíkszentmihályi, 1991) . We propose that students who believe that they can overcome challenge in mathematics domains will continue to seek those experiences out, via selecting mathematics-related majors while in college. Dweck's (2000 Dweck's ( , 2006 mindset theory proposes that students do not have a universal response to challenge. Instead, their response to challenge is mediated by their mindset, or their belief that abilities can be developed or are innate. Those who believe that intelligence is innate-people with a fixed mindset-tend to be much less likely to select challenging tasks, because they do not want to disconfirm their intelligence in front of others. In contrast, those who believe that intelligence is malleable or can be developedgrowth mindset individuals-tend to take on challenging material because they do not believe the task at hand implies anything specific about their overall intelligence. Thus, fixed mindset individuals are thought to have helpless responses to challenging material, while growth mindset individuals are thought to have mastery responses to challenging material (Dweck, 2000 (Dweck, , 2006 . Importantly, girls have been shown to be more likely to hold a fixed mindset (Dweck, 2007) , suggesting that they may implement helpless behaviors when confronting a difficult task. Further, much of the research on this topic argues that adjustments to women's and underrepresented minorities' mindsets could help with gaps in STEM participation (Dweck, 2008; Good et al., 2012; Mangels et al., 2012) . If girls are more inclined to view their abilities as fixed rather than malleable, they may also be more likely to believe that they are not capable when they encounter setbacks on challenging mathematics tasks. How gender moderates perceived ability becomes particularly important, given the prevailing stereotypes that girls encounter regarding their mathematics ability."}, {"section_title": "Mindset Theory", "text": ""}, {"section_title": "Stereotype Threat", "text": "According to Steele (1997) stereotype threat occurs when an individual internalizes the stereotypes of a group with which they identify, such as women's perceived weakness in mathematics. Bielock and colleagues have proposed a link between stereotype threat and task success via working memory (Beilock, 2008; Rydell et al., 2009; DeCaro et al., 2010) . Importantly, these studies use experimental research design to establish that women's working memory is inhibited when they are reminded about the gender stereotype that women are less successful at mathematics, and propose interventions to help mitigate that effect (Good et al., 2003) . Therefore, we recognize that females' perceptions of ability to overcome challenge might be particularly important as they move into increasingly more gender-segregated academic environments while advancing toward STEM degrees, in which stereotypic beliefs may be more salient."}, {"section_title": "Research Questions and Hypotheses", "text": "We build upon the previous research presented above to examine the complex interplay between gender, perceptions, and participation in STEM, particularly under difficult or challenging conditions in mathematics and other domains. Specifically, four research questions guided our research: As emphasized in the research questions above, we hypothesize that gender moderates the relationships between perceived ability under mathematics challenge and outcomes for subsequent steps in the STEM pipeline. Therefore, our research questions build upon one another, leading to our primary focus: an examination of the relationships between perceived ability under challenge, gender, and selection of mathematics-intensive majors (see Figure 1 )."}, {"section_title": "Methods Data Source and Participants", "text": "We (Ingels et al., 2007) . For clarity, we discuss the data primarily in reference to participants' stage in education. For instance, \"10th grade\" refers to 2002 or base year data, \"12th grade\" refers to 2004 or first follow-up data, and \"2 years after high school\" refers to 2006 or second follow-up data. This study uses the high school (10th and 12th grades) and 2 years after high school student surveys, including some control variables (such as family income, education, and high school environment measures) gleaned from the accompanying parent and administrator surveys (see the Appendix in Supplementary Material for more details). Survey administrators reported an 88% weighted response rate for students participating in these first three waves: 10th grade (2002), 12th grade (2004), and 2 years after high school (2006) (Ingels et al., 2007) . Our analytic sample represents the college-going population of U.S. students who were tenth graders in the spring of 2002 and enrolled in college between 2004 and 2006. We include only students who attended either 2-and 4-year institutions by 2 years after high school, as our second and third research questions are related to college major choice. Any students who remained undecided or undeclared were coded as such but retained in our analyses. Therefore, of the 16,197 observations in the ELS dataset, we found that 10,534 had enrolled in a postsecondary institution by 2 years after high school. Because of our interest in race as well as gender, we additionally excluded respondents from groups with overly low representation in the sample 2 . We then used listwise deletion for any remaining missing observations on the independent and dependent variables, yielding a final analytic sample of 4450 cases. Lastly, we used response adjusted, calibrated bootstrap replicate weights (ELS variables f2byp1-f2byp200), and panel survey weighting (with f2bywt) to adjust for stratification in the sample design. Sample descriptive statistics are discussed throughout the measures section."}, {"section_title": "Measures", "text": ""}, {"section_title": "Outcome Variables", "text": ""}, {"section_title": "Science pipeline", "text": "First, we examined the most advanced science course students took in high school. We collapsed the original categories from eight to three to enhance the interpretability of our analyses, as those on the lowest end of the science pipeline tended not to attend nor complete college. Thus, the science pipeline variable focuses on the upper end of the scale and represents students' completion of three levels of science coursework: (1) chemistry I or physics I or less, (2) both chemistry I and physics I, and (3) chemistry II and physics II. Biology and other sciences were included in the science pipeline variable, but the ranking privileges chemistry and physics as indicators of having completed the \"science pipeline\" in high school. We report on the relationship between gender and completion of these science pipeline courses in Table 1 . Fewer women participated in the highest and middle level of science coursework compared to men (Table 1) . Correspondingly, there is a higher percentage of women (53.1%) who only completed the lowest level of science coursework (Chemistry I or Physics I and below) compared to men (45.4%)."}, {"section_title": "Major retention", "text": "Next, we were interested in what encouraged retention in STEM fields. To understand this, we compared participants' intended major to their declared major 2 years after high school. The intended major variable was retrospective, as students were asked 2 years after high school which field they intended on entering before starting their postsecondary educations. Further, due to the original coding of the intended major data, intended PEMC and biology majors could not be disaggregated (see the Appendix in Supplementary Material for more detail). Therefore, the major retention variable includes four categories: (1) abstainers (never intended or majored in PEMC and/or biology), (2) stayers (intended and majored in PEMC and/or biology), (3) leavers (intended but did not major in PEMC and/or biology), and (4) newcomers (did not intend but majored in PEMC and/or biology). Overall, a larger proportion of men (32.0%) in our sample participated in a PEMC and/or biology major in some way, compared to women (13.1%, Table 1 ). A full 86.9% of women in our sample abstained from PEMC and/or biology, neither intending nor enrolling in those fields by 2 years after high school. This high lack of engagement drives the lower percentages in the other major retention categories for women in our sample. For instance, only 3.7% of women persisted in a PEMC and/or biology field as intended compared to 16.6% of men. In addition, 4.0% of women left a PEMC and/or biology field, compared to 10.1% of men. Finally, a comparable proportion of men and women (5.3 and 5.4%, respectively) were considered newcomers, entering a PEMC and/or biology field by 2 years after high school, even though it was not their intended major."}, {"section_title": "Major type", "text": "The last outcome variable provides information on the specific type of major students selected 2 years after leaving high school. Because of the importance of disaggregating STEM majors by fields of study Ceci et al., 2014) , we looked specifically at students majoring in the physical sciences, engineering, mathematics, and computer sciences (PEMC) against other STEM majors; specifically, we compare PEMC to biology, health, social/behavioral and other sciences, and non-STEM majors. We additionally compare with undecided/undeclared students, to achieve a more representative set of analyses from high school through college. Full details (including the list of majors included in each category) are provided in the Appendix in Supplementary Material.\nLooking specifically at this outcome for our sample on Table 1 , we see that 2 years after high school, 24.0% of men and 20.6% of women had an undeclared or undecided major. A larger proportion of women (42.5%) had a non-STEM major, compared to men (39.7%). Consistent with the previous literature, a far smaller percentage of women majored in PEMC fields (4.0%) compared to men (17.1%), though these results are roughly mirrored when looking at health fields (15.9% of women vs. 4.0% of men). Men and women participated at comparable levels in biology fields (4.7% of men and 5.0% of women), with a slightly higher proportion of women (11.9%) declaring a social/behavioral and other science major compared to men (10.4%)."}, {"section_title": "Perceived Ability under Challenge in Domain-General and Verbal and Mathematics Domains", "text": "As noted above, this study is primarily concerned with students' perceived ability under challenge. We operationalized this concept by selecting ELS items that represented students' perceptions of their ability to use mastery-oriented behavior and comfort with complex or difficult material. A brief discussion of each measure of perception of ability to overcome challenge is discussed below, with full details in the Appendix in Supplementary Material. All perceived ability under challenge variables were mean-centered for interpretability. We report mean scores for men and women in the Results Section."}, {"section_title": "General index", "text": "Five items from the 10th grade survey were used to assess students' perceived ability under challenge in general, as opposed to within a particular subject domain. Original scores on each ranged from 1 to 4, with higher values representing higher agreement with each statement. From these five statements, we developed a mean item index to represent domain-general perceived ability under challenge (α = 0.865)."}, {"section_title": "Verbal index", "text": "Tenth graders were also asked to report their agreement with three statements related to their comfort with difficult verbal tasks and use of mastery behavior in that field. Similar to the items on the general index, each of these responses were originally coded 1-4; a score of 4 indicates the highest agreement with each statement. These variables were averaged into a mean item index (α = 0.881)."}, {"section_title": "Mathematics index (10th and 12th grades)", "text": "Three questions were repeated on the 10th and 12th grade surveys related to students' perceptions of ability to overcome challenge in mathematics domains. As with the questions on the other indices, responses to these questions were originally coded 1-4; a score of 4 indicates agreement with each statement and higher perception of ability to overcome challenge in mathematics. Scores on each set of questions were averaged into two separate mean item indices, one each for the 10th grade (α = 0.892) and the other for the 12th grade (α = 0.871)."}, {"section_title": "Growth mindset", "text": "Finally, one question from the base year survey asked students about their level of agreement with a statement related to Dweck's (2000 Dweck's ( , 2006 concept of growth mindset (whether or not people could learn to be good at mathematics). Because this is a question specific to one theory and not necessarily related to the other mathematics measures identified in the questionnaires, we let it stand alone. As with the other measures of perceived ability under challenge, this variable was coded such that 1 indicated less agreement and 4 indicated more agreement."}, {"section_title": "Control Variables Demographic characteristics", "text": "Demographic variables included dichotomous variables for gender, race/ethnicity (white, Asian/Pacific Islander, black, Latino, multi-race/ethnic), parents' education (high school degree or less, less than a 4-year degree, 4-year degree, more than a 4-year degree), and family income by quartiles ($0-$35,000 per year, $35,001-$50,000 per year, $50,001-$100,000 per year, $100,001 or more per year). Detailed information on the coding of these variables is available in the Appendix in Supplementary Material. Table 2 presents descriptive statistics for the sample and indicates that there are more women in the sample (57.4%) compared to men (42.6%) 3 . Additionally, white students constitute the majority of the sample (73.7%), while the rest of the sample consists of 5.0% Asian American/Pacific Islander students, 9.1% each for black and Latino students, and 3.2% multi-race/ethnicity students. About a quarter of the participants in our sample had parents that earned more than a bachelor's degree, and almost 60.0% of the sample had parents that attended some college or earned a bachelor's degree. 16.1% of the sample had parents with a high school diploma or less. Turning to family income, the largest percentage of our sample (40.7%) came from families that earned between $50,001 and $100,000 per year. 18.0% of the sample had families that earned $35,001-$50,000 per year. Finally, about 20.0% of the sample had families that earned either the lowest level of family income (up to $35,000 per year) or the highest level of family income (more than $100,000 per year). "}, {"section_title": "Student ability", "text": "Students' ability was measured through scores on the most complex standardized mathematics and reading questions and grade point average, both in the 10th grade. Scores on the most complex standardized mathematics and reading questions were measured using a continuous variable ranging from 0.0 to 1.0, representing the probability that students would respond correctly to three of the four questions in each category. We used this original form of the variable in our multivariate analyses for the sake of comparability to other studies on this data, but report a percentage form in Table 2 to meaningfully interpret the descriptive statistics. Tenth grade GPA was also a continuous variable ranging from 0.0 to 4.0. Because all of our student ability measures are continuous in nature, these scores are reported in means. Using a 0.0-100.0 point scale to increase the interpretability of our descriptive statistics, we can see that the mean probability that our sample could complete the most difficult standardized mathematics questions was 2.1%. This indicates that much of our sample had almost no probability of answering three of the four most complex standardized mathematics questions 4 . On the other hand, our sample fared better on the mean probability score of completing three of the four most difficult standardized reading questions, at an average of 16.0% on a 0.0-100.0 point scale. Finally, our sample had a mean 10th grade GPA of 3.0/4.0."}, {"section_title": "High school context.", "text": "To control for students' high school contexts, we included measures of their region and urbanicity. Region is based on high school location and corresponds to Census categories: Northeast, Midwest, South, and West. Urbanicity corresponds to NCES classifications: urban, suburban, and rural. Participants in our sample attending high schools across the U.S., with 30.9% concentrated in the South, 28.4% in the Midwest, and just over 20.0% each in the West and Northeast. 54.4% of our sample attended high schools in suburban areas, while 27.3% and 18.4% attended schools in urban and rural areas, respectively."}, {"section_title": "Institutional selectivity", "text": "We also controlled for the institutional selectivity of students' first attended postsecondary institutions as of 2 years after high school. Selectivity is split into four dichotomous categories:\n4 Restricted-use NCES data requires rounding these descriptive results to the nearest tenth.\n2-year college or less, 4-year institution (inclusive or not classified), 4-year institution (moderately selective), and 4-year institution (highly selective). 27.3% of the sample started at a 2-year institution, while 72.7% started at a 4-year institution. Of that 72.7% who started at a 4-year institution, 13.4% first attended an inclusive, 30.9% a moderately selective, and 28.4% a highly selective college or university."}, {"section_title": "Analytic Plan", "text": "Our first research question is primarily concerned with understanding if there are gendered differences in perceived ability under challenge. Therefore, we calculated the sample means for men's and women's scores on each of the perceptions of ability to overcome challenge variables and used Adjusted Wald Tests to provide us with information about significant differences between the two groups. To address the second research question related to the highest science course taken in high school, we used ordered logistic regressions. Finally, we used multiple logistic regressions to examine the third and fourth research questions related to STEM retention and specific major choice. More details regarding our analyses are presented with our results."}, {"section_title": "Results", "text": ""}, {"section_title": "Gender and Perceived Ability under Challenge in Mathematics", "text": "In light of previously cited research indicating differences in boys' and girls' assessments of their abilities, we used sample mean Wald tests to determine whether there were significant gender differences on our measures of perceived ability under challenge. Table 3 reveals that in fact young men and women rate themselves as similarly confident in their abilities under challenge in general (Wald = 1.5; p = 0.222) as well as in the verbal domain (Wald = 0.4; p = 0.555). In contrast, mean differences between women and men were highly significant for each measure of perceived ability under challenge in mathematics. Young men were between 0.1 and 0.4 points above the mean on each measure, while young women fell either at or just below the mean in their perceived ability under mathematics challenge in 10th and 12th grades. Notably, the gap between women's and men's Frontiers in Psychology | www.frontiersin.orgratings of their perceived ability under challenge is largest on the 10th grade mathematics index (diff = 0.4; Wald = 102.9; p = 0.000) and tapers slightly 2 years later (diff = 0.2; Wald = 58.7; p = 0.000). This change results primarily from a loss of confidence for young men, who see a 0.2 mean centered point decrease between 10th and 12th grades. Among young women, perceptions of their ability on difficult mathematics do not appear to fluctuate over time. Young women are less inclined to report a growth mindset than are young men (diff = 0.2; Wald = 30.5; p = 0.000). Together, these findings suggest that young men are better positioned psychologically to be resilient in the face of mathematics-related setbacks, as compared to their female peers."}, {"section_title": "Impacts on Science Course Taking", "text": "Next, we turned to the question of how advanced science course taking in high school might be distinctly influenced by perceptions of ability under challenge in general, verbal, and mathematics domains. Given that the lower science pipeline courses are pre-requisites of higher science pipeline courses, and thus are ordinal in nature, we used ordered logistic regressions. The first model included our outcome variable and student demographic characteristics. The second model added student ability, high school context, and institutional selectivity to the variables in the first model. Lastly, the third and final model included all of our predictor variables, including the perceived ability under challenge variables. For simplicity, we present the full model only in Table 4 . Proportional odds ratios (OR) represent the ratio of odds for completing the highest level of science coursework in high school as compared to the odds of the other combined outcomes (less rigorous courses). When interpreting OR, values under 1 represent negative relationships, values over 1 represent positive relationships, and values approaching 1 represent relationships with less meaningful significance. Taking all other factors into account, women have about 24.0% lower odds of completing both Chemistry II and Physics II (OR = 0.76; p = 0.001) as compared to men, all else being equal. Race/Ethnicity matters as well, as Asian/Pacific Islander students are considerably more likely to complete these more advanced science courses than are white students (OR = 2.44; p = 0.000). Conversely, black students are less likely to complete these courses than are their white peers, although this effect is less significant (OR = 0.70; p = 0.047).\nObjective measures of ability were also meaningfully significant. Students' academic ability with complex material-as measured by test scores-is highly related to completing the most rigorous science courses. Interestingly, this pattern holds for both mathematics and verbal domains. Recall that these scores refer to students' performance on the most challenging sections of the NCES-administered ability tests. A one percentage point increase in one's complex mathematics ability score-an area where most sample respondents struggled, as noted in Table 2 -corresponds to having 14 times higher odds of completing both physics II and chemistry II (OR = 14.32; p = 0.001). Moreover, the same magnitude of increase in complex reading ability (OR = 2.03; p = 0.000) notably enhances the likelihood of completing these courses, all else being equal, as does earning higher grades in school (OR = 2.18; p = 0.000). Although not a focal dimension of this study, the effects of students' high school institutional contexts are worth noting. Access to advanced chemistry and physics coursework is not uniformly available, as noted earlier in this paper. As such, it may not be surprising that students attending high school in Western states (OR = 0.69; p = 0.028) are less likely to complete these courses than are students in the Northeast. Correspondingly, students enrolled in rural high schools are less likely to complete these courses than are students in urban high schools (OR = 0.60; p = 0.006).\nTurning to our primary independent variables of interest, we were surprised that only one perceived ability under challenge measure significantly predicted completion of the most advanced science courses in high school. The 10th grade mathematics index predicts about a 30.0% increase in the odds of taking the highest science courses in high school, holding all other variables constant (OR = 1.30; p = 0.000). In contrast, the OR on the growth mindset variable did not reach significance, implying that students' mindset does not affect high school science pipeline completion. Neither verbal nor domain-general perceived ability under challenge significantly predicted completion of these courses.\nWe examined a model (not shown) including product-term interactions between each of the perceived ability under challenge variables and gender. None of the resulting interaction terms were significant, thus we chose not to display results in this paper due to space constraints. However, the lack of significance on these interaction terms is notable, and combined with the significant effect of the gender variable, indicates that women are less likely to take these courses, but are not affected differentially by perceptions of ability. Table 5 reports on the results of a multiple logistic regression analysis estimating the likelihood of retention in students' intended major. The reference group is comprised of those who neither intended nor declared PEMC and/or biology majors, compared to those who stayed, left, or were newcomers to PEMC and/or biology fields. As with the science pipeline analysis, we estimated four separate models to understand the movement between intended and declared major. Our first model included demographic characteristics only; the second included student ability, high school context, and institutional selectivity; and the third included the perceived ability under challenge indices. For simplicity, we only report the final model using relative risk ratios (RRR). RRR are interpreted as the ratio of the probability that one outcome category will occur compared to that of the reference category (Borooah, 2002; Vogt, 2005 Comparing PEMC and/or biology stayers, leavers, and newcomers with having never expressing interest in those fields (abstainers), there are two significant findings for women. All else being equal, women have an 80.6% lower risk than men of staying in PEMC and/or biology fields as intended before starting college (RRR = 0.19; p = 0.000) vs. not entering these fields at all. While the effect is smaller, gender also predicts attrition from PEMC and/or biology fields. Women have a 64.6% lower risk than men of leaving these fields vs. not entering those fields at all (RRR = 0.35; p = 0.000), holding all other factors constant. There was also a significant relationship for one race/ethnicity category. All else being equal, our results show that black participants' risk of staying in a PEMC and/or biology field was 3.2 times higher as compared to white participants (RRR = 3.20; p = 0.000), among those who intended to major in that field before enrolling in college."}, {"section_title": "PEMC and/or Biology Retention and Perceived Ability under Challenge", "text": "Lastly, there were notable significant results with respect to our student ability measures and science pipeline completion. While complex mathematics and verbal scores were highly predictive of completing advanced high school science coursework, they are no longer significant with respect to major retention, a more advanced step along the scientific pipeline. A 0.01 point increase in 10th grade GPA increased the risk of staying and entering a PEMC and/or biology field by 58.3% (RRR = 1.58; p = 0.001) and 42.7% (RRR = 1.43; p = 0.036), respectively, as compared to never entering these fields. Science course completion generated the second highest effect sizes in this model. Completing chemistry II and physics II in high school increased the likelihood of staying, leaving, and entering PEMC and/or biology fields by over 2.5 times each (all p < 0.001), as compared to never intending nor entering those fields. While the similarity of this effect on multiple outcomes may seem puzzling, it perhaps indicates the centrality of high school science course completion to students' entry to the natural sciences at some point early in college, even if it does not singularly predict persistence.\nLooking specifically at measures related to our third research question, we see that all perceived ability under mathematics challenge measures-growth mindset, 10th grade mathematics index, and 12th grade mathematics index-positively and significantly predict staying in PEMC and/or biology fields as intended before entering postsecondary education, net of all other factors. The 10th grade mathematics index has the largest effect size here, predicting a 61.7% increased risk of staying in PEMC and/or biology fields as intended (RRR = 1.62; p = 0.000) vs. never having entered those fields, compared to 56.1% for the 12th grade mathematics index (RRR = 1.56; p = 0.000), and 35.4% for growth mindset (RRR = 1.35; p = 0.021). Also consistent with the literature, there is a stronger negative effect on staying in PEMC and/or biology for the verbal index (RRR = 0.58; p = 0.000) vs. to leaving (RRR = 0.70; p = 0.001), compared to abstaining. However, surprisingly, the 10th grade mathematics index also predicts leaving these fields (RRR = 1.28; p = 0.045). Moreover, both the general index and the 12th grade mathematics index predict new entry to PEMC and/or biology fields 2 years after high school (RRR general index = 1.48; p = 0.017 and RRR 12th grade mathematics index = 1.33; p = 0.012). This finding suggests that either domain-general or mathematics-domain perceived ability to overcome challenge might actually encourage students to cross into mathematics-intensive fields of study from non-STEM fields.\nFinally, as with the analysis on science pipeline, we examined a model (not shown) including interactions between gender and each of the perceived ability under challenge variables. The resulting coefficients were not significant, so due to space constraints we decided not to show this particular model. Possible explanations for the lack of significance on gender and perceived ability under challenge interaction terms for the major retention variable will be unpacked in the Discussion Section of this paper."}, {"section_title": "Specific Scientific Major and Perceptions of Ability to Overcome Challenge", "text": "Finally, we examined the relationship between perceived ability under challenge and choice of major 2 years after high school. Since we are primarily interested in how ability-related beliefs might encourage or deter students to major in more mathematics-intensive fields, we disaggregated STEM majors and used non-STEM majors as our reference category. As with the analysis on the major retention variable, we report findings using RRR in Table 6 .\nFirst, we turn to the main effect of gender, which is strongest as a predictor of PEMC and health sciences majors, albeit in opposite directions. While only the third model is shown in Table 6 , tables reporting the earlier models are available by request. In the first model, including only demographic characteristics, women have a 0.78 times lower risk than men of majoring in PEMC (RRR = 0.22; p = 0.000) 5 and a 3.59 times higher risk than men of majoring in health (p = 0.000), as compared to non-STEM fields. When student ability and institutional effects are added in the second model, women's risk of majoring in PEMC declines slightly as the risk ratio becomes more negative (RRR = 0.20; p = 0.000), but their risk of majoring in health does not meaningfully change (RRR = 3.59; p = 0.000). The third model adds perceptions under challenge to the model and has a resulting decrease in the negative effect of female gender on the risk of majoring in PEMC (RRR = 0.26; p = 0.000) and an increase in the positive effect of female gender on the risk of majoring in health sciences (RRR = 3.69; p = 0.000). Adding perceived ability under challenge variables to our models therefore enhances women's chances (relative to men) of majoring in both PEMC and health fields. Race/ethnicity again plays a role, here influencing declared major 2 years after high school. Holding everything else constant, black students had a 3.19 times higher risk than their white peers of majoring in PEMC as compared to non-STEM fields (p = 0.000); they had a 3.39 times higher risk than their white peers of majoring in biology fields (p = 0.001). Latinos had a 2.09 times higher risk than their white peers of majoring social/behavioral or other science fields (p = 0.006), as compared to non-STEM majors. Asian/Pacific Islander students were at a 2.50 times higher risk than their white peers of majoring in biology (p = 0.012) and health (p = 0.001), respectively, as compared to non-STEM majors.\nResults on student ability and course taking were congruent with the previous analysis of major retention. Tenth grade GPA, net of all other effects, significantly and positively predicted the selection of PEMC majors (RRR = 1.45; p = 0.009) and biology majors (RRR = 1.41; p = 0.044) vs. non-STEM majors. In contrast, GPA negatively predicted the selection of undeclared/undecided majors (RRR = 0.75; p = 0.000), showing that high achieving high school students in our sample tended to select a major by 2 years after high school. Next, the single highest predictor of any major type, holding all other factors constant, was completion of chemistry II and physics II for selection of a biology major (RRR = 3.88; p = 0.000). Completion of chemistry II and physics II also increased the risk of enrolling in PEMC fields vs. non-STEM fields (RRR = 2.50; p = 0.000), compared to students who only completed chemistry I or physics I or less. Completing even the middle category of the science pipeline variable also benefitted students, predicting an 85.0% increase in the risk of selecting a PEMC major vs. a non-STEM major (p = 0.005), as compared to students who only completed chemistry I or physics I and below in high school.\nWith respect to institutional effects, high school region and college selectivity were the only notable factors influencing choice of major. Students attending high schools in the Midwest and the South were more likely than their peers in the Northeast to select health sciences majors, as compared to non-STEM majors (full table available by request). Attending a less selective institution decreases students' risk of declaring social/behavioral and other science majors, as compared to non-STEM majors. By contrast, their risk of majoring in health sciences increases, in comparison to non-STEM majors. Together, these results suggest that institutional contexts can influence choice of major, in particular health science fields.\nUsing the product-term regression method (Jaccard and Turrisi, 2003) , we can interpret the interactions between gender and perceived ability under challenge measures as slope differences between men and women. In contrast, the main effects for perceived ability under challenge represent the effects of these perceptions for the reference category on gender. Because this manuscript is primarily concerned with how these perceptions influence women's entry into scientific majors, we report the results for the case when the reference category for the gender variable is female, so that the main effects of perceived ability under challenge represent the effect for women in particular.\nWe now turn to the version of the full model shown in Table 7 , with women as the reference category and interactions between gender and the perceived ability under challenge variables. Because our perceived ability under challenge variables are mean-centered, a value of 0 refers to the mean value for each of these terms, for the reference category (in this case, women). In this multinomial logistic regression model then, men have a 3.60 times higher risk of majoring in PEMC than women with average perceived ability under challenge (p = 0.000) and a 0.74 times lower risk of majoring in health than women with average perceived ability under challenge (p = 0.000), again as compared to non-STEM fields. In sum then, holding all other predictors constant, gender strongly influences students' choice of PEMC and health sciences majors. Gender does not however notably influence choice of biological nor social/behavioral and other sciences majors, as compared to non-STEM majors.\nRecall how in Figure 1 , we show our intent to examine how gender moderates the relationship between perceptions of ability under challenge and major choice. Notably, the main effect of the 12th grade mathematics index is the most notable significant perceived ability under mathematics challenge predictor for women, increasing their risk of majoring in PEMC (RRR = 1.65; p = 0.004) compared to a non-STEM field 6 . The magnitude and significance of these effects may be somewhat muted, given that there are two indicators in the model for mathematics index (in 10th and 12th grades). This significant result is therefore likely a conservative estimate. To more meaningfully interpret this finding, we used the prgen command from SPost9 (Long and Freese, 2005) to estimate the predicted probabilities for women's selection of each of the major types, given their score on the 12th grade mathematics index. Figure 2 shows the predicted outcomes on a line graph, for each STEM major category. We see that an increase in perceived ability under challenge in mathematics domains meaningfully changes women's probability of declaring PEMC, biology, and social/behavioral and other sciences. Notably, as women's perceived ability increases, their chances of majoring in social/behavioral and other sciences decreases. The opposite is true for PEMC and biology. In particular, women's probability of majoring in PEMC increases in association with an increase in their 12th grade perceptions that they could understand and master difficult and complex mathematics material. Specifically, their probability of majoring in PEMC rises over and above that of majoring in biology by the point that their perceptions are one unit above the mean for women in our sample.\n6 The RRR for women, shown in Table 7 , is smaller than the result for men (RRR = 1.542; p = 0.004), when men are in the reference category (table available by  request) .\nRounding out our discussion of how perceived ability under challenge affects women's choice of major, there are two additional findings of note. Domain-general perceptions positively influence the selection of a STEM field in two other instances: biology (RRR = 1.75; p = 0.021) and health science fields (RRR = 1.35; p = 0.037). Perceived ability in verbal domains also negatively predicts women's entry into PEMC (RRR = 0.65; p = 0.019) and health sciences (RRR = 0.76; p = 0.020).\nThe interaction terms at the bottom of Table 7 examine the differential impact of gender on perceived ability under challenge. Only one of these interactions is significant in its effect. The male * growth mindset interaction term (RRR = 0.51, p = 0.003) indicates that gender moderates the effect of growth mindset on students' choice of health science majors as compared to non-STEM majors. This finding indicates that the belief that anyone can improve their mathematics ability through mastery-oriented behavior (growth mindset) differentially effects men and women in a way that promotes women's selection into health science fields. We again use prgen to estimate the predicted probabilities for women's selection of each of the major types, shown in Figure 3 , given their score on the growth mindset variable. Consistent with the discussion above, women have both a higher and increasing probability of selecting a health science field as their growth mindset score increases, as compared to the other STEM majors. While the effects are not significant, a sizeable enough increase in growth mindset (a half-point above the mean) appears to positively increase the probability such that-all else held constant-women would have a higher likelihood of majoring in PEMC than they would of majoring in biology. This finding further suggests that there are meaningful, tangible implications for enhancing women's perceptions of their ability under challenge. "}, {"section_title": "Discussion Limitations", "text": "Similar to all studies using secondary data sources, our interpretations are limited by the self-reported nature of the data. For instance, our analysis on major retention was limited because students were retrospectively asked the intended major question 2 years after leaving high school. This measure may be biased by their subsequent choice of major. Additionally, this question focused on students' intent, not their actual declared major upon entrance into the institutions. While this gives us some insight, declared major symbolizes commitment and would allow us to be reasonably sure that students participated in gateway coursework in the declared major. Further, the coding of the intended major variable did not permit us to disaggregate PEMC fields from biology in the measurement of students' intended majors. As noted by previous researchers, women tend to be overrepresented in biology fields (NSF, 2013 ), yet we cannot adequately separate out the effects of staying in biology from staying in PEMC fields. Finally, because we do not currently have information on degree completion, our analyses are limited to students' experiences up through 2 years after high school."}, {"section_title": "Conclusions", "text": "In response to our research questions, we found mixed support for our hypotheses that perceived ability under challenge in mathematics is related to our outcomes of interest: completing advanced science coursework, remaining in intended STEM major fields, and selecting mathematics-intensive science majors (PEMC). Importantly, both gender and perceived ability under challenge in mathematics influence our prediction of all three outcomes. In addition, 10th grade perceptions of ability under challenge in mathematics positively predict completion of the highest levels of high school science coursework. Moreover, all mathematics perceived ability under challenge measures predict both retention in PEMC and/or biology fields, holding all other factors constant. Finally, in some cases, perceptions of ability under challenge affect women's selection of PEMC and other STEM majors.\nTurning first to descriptive differences in high school, women and men's perceived ability under challenge differed, with young men in our sample outscoring young women in all perceived ability under mathematics challenge measures. Intriguingly, while the gender gap in perceived mathematics ability seems to taper during high school, this change seems driven by changes among boys rather than girls. Specifically, boys' perceived ability in mathematics decreased between 10th and 12th grade, while girls' perceived ability stayed constant. This finding suggests the need for further empirical and conceptual studies of boys' experiences in mathematics courses in high school, as their relative strengths in this area have been presumed undeserving of examination.\nNext, we turn to the predictions of high school course taking. Our results indicate that perceived ability under mathematics challenge in 10th grade matters, and in fact was the only predictive subjective measure (i.e., beyond demographics and ability test scores) of taking advanced science coursework. Female gender negatively predicts advanced science course taking. While recent research suggests that girls are increasingly successful in secondary and postsecondary education, including science course completion (Hill et al., 2010; DiPrete and Buchmann, 2013) , our results indicate that gender gaps in course taking remain. However, there were no significant findings for the interaction terms in this analysis, suggesting that something other than perceived ability is at work. Indeed, performance indicators of ability-not perceptions-appeared to particularly influence students' course taking.\nFuture research may be needed to investigate the mechanisms by which students-girls in particular-are advised into and choose to enroll in a second year of both chemistry and physics, which over 25% of our sample elects to do. These decisions have clear ramifications for entering and choosing PEMC and biology majors, as indicated in our findings reported above. Our negative findings for both western and rural measures of high school location suggest that access to higher-level science coursework is differentially distributed around the U.S. and likely varies by the profiles of students' high schools, not limited to region and urbanicity. For instance, Riegle-Crumb and Moore (2014) show how the density of female STEM professionals in the neighborhoods surrounding schools can mitigate the traditional negative relationship between gender and high school physics course taking. Moreover, recent work by Legewie and DiPrete (2014) on U.S. high school students in the early 1990s indicates that school-level curricular and extra-curricular offerings considerably explain the gender gap in intention to major in STEM at the end of high school. Extensive research and policy initiatives have examined increasing access to advanced mathematics courses. This study suggests that similar attention should be paid to increasing access to advanced science coursework in secondary school, physics in particular.\nDespite the number of adequately prepared women entering postsecondary education, we know that fewer of them persist in STEM fields (NSF, 2013) . Therefore, we turn next to the matter of how perceived ability under challenge might be related to majoring in PEMC and/or biology as intended at enrollment. As mentioned before, perceived ability under challenge in mathematics (growth mindset, 10th grade mathematics index, and 12th grade mathematics index) is positively related to staying in PEMC and/or biology fields, net of all other effects. This suggests that increasing students' confidence in their ability to deal with difficult mathematics material may lead to retention in those fields. However, there were no significant findings for the interactions between gender and these measures on any level of the retention variable, suggesting that gender does not influence the impact of perceived ability under challenge on retention in students' intended major. These modest results may be the consequence of our limited ability to parse out the PEMC and biology categories 7 , as these STEM fields currently have highly distinct patterns of sex segregation at the undergraduate level, as demonstrated in Table 1 . 7 Notably, George-Jackson's (2011) study found that while women persist in PEMC-related fields at lower rates than men, only 24.5% of those who initially chose these majors switched to non-STEM fields; 11.4% switched into biology, health, behavioral, and related science fields. There may be considerable movement among the PEMC and/or biology category that we are not able to observe because of limitations in the coding of the intended major variable.\nMathematics is not the only domain in which perceived ability influences choice of major. As reported in Table 5 , we see a significant and negative relationship between perceived ability under challenge in the verbal domain and persistence in PEMC and/or biology. Similarly in Table 7 (and corresponding  results in Table 6 ), perceived ability in verbal domains negatively predicts women's entry into PEMC and health sciences. These findings are consistent with previous literature suggesting that perceived high verbal ability may act as a stronger influence on major choice than actual mathematics ability (Correll, 2001; Wang et al., 2013) . Related, we also found that domaingeneral perceived ability under challenge has a more positive relationship with entering PEMC and/or biology fields than the 12th grade mathematics index, holding all other factors constant. Again, later results on declared majors show that domain-general perceptions positively influence women's selection of biology and health science fields. These results lead us to wonder how domain-general perceived ability may increase interest in certain STEM fields. Future studies, perhaps qualitative in nature, may unpack the mechanisms behind this perhaps puzzling finding.\nWe were able to disaggregate specific major types in our analysis of the relationships between perceived ability under challenge and declared major 2 years after high school. Results compared across models revealed the specificity of the relationship between gender and each STEM major category. The effects of perceived ability under challenge reported in Table 6 (without interactions) are robust and in the expected direction with respect to the effects on science majors. Also of note are our findings regarding high school region and college selectivity with respect to health fields. With respect to the latter, it is unclear whether it is the institutional context itself or selection into certain institutions that drives the negative relationship between selectivity and health science majors (and correspondingly, the positive relationship between selectivity and social/behavioral and other science majors). As previous research on this topic is inconclusive, this is again an area for potential further investigation.\nWith respect to the hypothesized moderating effect of gender, the gender-specific results reported in Table 7 did not neatly correspond to our hypotheses. Importantly, we did find an effect for women's selection of a PEMC field when looking at the main effect of the 12th grade mathematics index. Notably, an increase in women's perceived ability with difficult and complex mathematics material increases their probability of majoring in PEMC, such that they become more likely to major in PEMC than in biology. This is notable, as PEMC fields are those that have thus far been the most persistently sex segregated STEM disciplines. As biology and health fields have become more gender egalitarian, and even female-dominant in recent years, this result suggests that interventions aimed at enhancing secondary school girls' perceptions of their mathematics ability can have real effects on their participation in mathematics-intensive fields in postsecondary school, and preventing the loss of scientific talent among young women.\nExamining our results on gender moderation further, we found positive gender moderation on the effect of growth mindset for selection into only one STEM field: health sciences. It may be that the intensive and cumulative investment of girls and boys on the scientific pipeline may track those girls with more negative ability-related beliefs out of PEMC fields before they select college majors . Notwithstanding, the effects of perceived ability under challenge for women among mathematics, verbal, and general domains, as well as this finding regarding gender moderation on growth mindset, indicate that there are indeed notable effects to consider and continue to investigate.\nIntriguingly, the predicted probabilities shown in Figure 3 indicate that a positive enough mindset among women will increase their probability of majoring in PEMC, even over and above their probability of majoring in biology. Because we did not find significance on the interaction effects between gender and growth mindset on PEMC, we cannot be sure that women who believe that anyone can develop their mathematics ability will enter PEMC majors, a finding seemingly inconsistent with mindset theory (Dweck, 2008; Good et al., 2012; Mangels et al., 2012) . It could be that mathematics-intensive fields, such as PEMC, are losing growth mindset women as a result of environmental factors, such as messages that they would fit better or be happier elsewhere (such as the health science fields). These messages may foster stereotype threat.\nStereotype threat occurs when individuals with stereotyped identities fear that they will confirm negative stereotypes (Steele, 1997) , and has been widely discussed related to women's choices to leave STEM fields. It is possible that the null findings on most of our interaction terms are masked by the effects of stereotype threat-something we could not directly measure. Although gender did not consistently moderate the relationship between perceived ability under mathematics challenge and our dependent variables, there were strong gender differences in perceptions under challenge across our results, from secondary school through the early postsecondary years. Moreover, while gender did not show a consistent moderating effect, this may be the case for race/ethnicity-a topic beyond the scope of this paper, though no less important to the issue of increasing participation in STEM. Future studies using similar constructs would benefit from additional analyses on the interactive effects of race/ethnicity and perceptions of ability to overcome challenge in pathways to mathematics and science careers."}]