[{"section_title": "Abstract", "text": "Inhibitors of the enzyme 3-hydroxy-3-methylglutaryl-coenzyme A (HMG-CoA) reductase, commonly known as statins, are widely used in both primary and secondary prevention of occlusive cardiovascular disease. Statins are effective not only in improving total and low-density lipoprotein cholesterol concentrations in blood but also in decreasing morbidity and mortality associated with cardiovascular diseases resulting from underlying atheroma. There is, however, evidence that statins are underutilized in elderly patients, possibly due to concerns about safety/tolerability issues or potential drug interactions, including interactions with other lipid-modifying medications, or both. In this review, we summarize the major adverse events associated with statin use, with particular reference to the elderly patient, including factors which might increase the risk of adverse effects. Potential drug interactions between statins and other lipid-modifying medications including fibrates, ezetimibe, nicotinic acid, bile acid sequestrants and omega-3-acid ethyl esters (fish oils) are specifically discussed. Clinical management strategies to avoid these drug interactions are outlined."}, {"section_title": "Introduction", "text": "Statins are inhibitors of the enzyme 3-hydroxy-3-methylglutaryl-coenzyme A (HMG-CoA) reductase, which catalyses the rate-limiting step in cholesterol formation. Many studies have shown that statins not only reduce serum total and lowdensity lipoprotein (LDL) cholesterol concentrations, but are also highly effective in decreasing morbidity and mortality associated with occlusive cardiovascular disease [Delahoy et al. 2009 ].\nA number of clinical trials have investigated the use of statins in large cohorts and reported findings in elderly subgroups (defined as age 65 years or older); these include the Scandinavian Simvastatin Survival Study (4S) [Miettinen et al. 1997 ], Cholesterol and Recurrent Events (CARE) [Lewis et al. 1998 ], Long-term Intervention with Pravastatin in Ischaemic Disease (LIPID) [Hunt et al. 2001] and Heart Protection Study (HPS) [Heart Protection Study Collaborative Group, 2002] trials. In general, the elderly are usually under-represented in published clinical trials. The only large randomized statin trials that focused primarily on people aged >65 years are the Prospective Study of Pravastatin in the Elderly at Risk (PROSPER) [Shepherd et al. 2002] and the Study Assessing Goals in the Elderly (SAGE) [Deedwania et al. 2007 ]. In the PROSPER study, elderly men and women aged 70-82 years with a history of, or risk factors for, vascular disease were randomized to receive either pravastatin (40 mg/day; n = 2891) or placebo (n = 2913); clinical outcome and adverse events were monitored for an average of 3.2 years [Shepherd et al. 2002] . Compared with controls, patients receiving pravastatin were reported to have 19% less coronary events and 24% lower mortality due to coronary heart disease, whereas incidence rates of serious adverse events were similar in the two groups. In comparison, in the SAGE study patients with coronary artery disease aged 65-85 years were randomized to receive either pravastatin (40 mg/day; n = 447) or atorvastatin (80 mg/day; n = 446) and followed up for 12 months; there was no statistically significant difference in major cardiovascular events or myocardial ischaemia defined by electrocardiographic parameters between the two groups, but all-cause mortality after 12 months was lower in the atorvastatin group than pravastatin group (hazard ratio 0.33, p = 0.014). In the same study, abnormalities in liver function tests were reported to be more common in the atorvastatin group than pravastatin group (4.3% and 0.2%, respectively, p < 0.001) [Deedwania et al. 2007] . A recent meta-analysis of data from 9 randomized controlled trials including 19,569 elderly patients with coronary heart disease aged between 65 and 82 years concluded that multiple clinical outcomes were better in statin-treated patients than in placebo controls (pooled relative risks 0.70-0.78; Table 1 ) [Afilalo et al. 2008 ].\nThere is some evidence that cardiovascular risk is often undermanaged in elderly patients and they are less likely to receive statin treatment compared with younger patients [Jacobson, 2006; Gotto, 2007] . In a retrospective study on Canadian residents aged >65 years with a history of cardiovascular disease or diabetes, the likelihood of statin prescription decreased by 6.4% with each year of increasing age [Ko et al. 2004] . In two studies conducted in the UK on the prevalence of statin usage for secondary prevention of ischaemic heart disease, compared with patients aged <65 years, the odds of receiving statin treatment were 0.53-0.64 in patients aged 65-74 years and only 0.11-0.16 for those aged >75 years [Reid et al. 2002; DeWilde et al. 2003 ]. It is possible that clinicians overemphasize the potential adverse events associated with the administration of lipid-lowering medications in the elderly patient. Others may underestimate the benefits of lipid-lowering medications in the elderly, leading to a conservative hands-off approach to cardiovascular risk management.\nThis review is aimed at the prescribing general practitioner, physician, clinical lipidologist and cardiologist. It is anticipated that with a better understanding of the potential side effects of statins and other lipid-lowering medications as well as the measures that can minimize them, clinicians will be able to offer their elderly patients the optimal treatment with minimal adverse outcome."}, {"section_title": "Major side effects of statins", "text": ""}, {"section_title": "Muscle toxicity", "text": "The classification of muscle toxicity is inconsistent in the literature [Joy and Hegele, 2009; Pasternak et al. 2002; Sathasivam and Lecky, 2008; Thompson et al. 2003 ]. In this review, we use the terminology proposed in the ACC/AHA/ NHLBI Clinical Advisory on the Use and Safety of Statins [Pasternak et al. 2002] . In the latter classification, myopathy is a general term that refers to any disease of muscles. The term myalgia is used to describe muscle ache or weakness without serum creatine kinase (CK) elevation, whereas myositis refers to muscle symptoms associated with increased CK levels. Rhabdomyolysis is a clinical diagnosis based on muscle symptoms associated with markedly raised CK levels (typically substantially >10 times upper limit of normal) and creatinine elevation. This classification, however, does not cover increased CK levels in the absence of muscle symptoms.\nThe voluntary withdrawal of cerivastatin from the worldwide market in 2001, mainly due to reports of fatalities attributed to drug-related rhabdomyolysis and subsequent renal failure, has raised concerns about the safety of statins as a Table 1 . Summary of meta-analysis of clinical outcomes in the secondary prevention of cardiovascular disease in the elderly (age range, 65-82 years). Mean follow-up periods ranged from 0.8 to 6.1 years. Data adapted from Afilalo et al. [2008] . class of drugs, especially their muscle-related side effects. Myalgia is the most common side effect reported by patients receiving statins. Incidence of myalgia ranges from <5% in randomized clinical trials to >18% in clinical practice [Joy and Hegele, 2009 ]. The clinical presentation of myalgia can be subtle or nonspecific and clinicians may have difficulty in deciding whether myalgia is statin-induced or caused by other musculoskeletal conditions commonly seen in the elderly. In comparison, myositis is much less prevalent but comparison of incidence rates among studies proves to be difficult due to the inconsistent definition of myositis. The clinical features, underlying mechanisms and management of statin-related muscle toxicity have already been addressed by a number of reviews [Joy and Hegele, 2009; Sathasivam and Lecky, 2008; Thompson et al. 2003 ] and will not be repeated here. Many risk factors, including advanced age, have been found to be associated with statin-related muscle toxicity (Table 2) . High doses of statins are known to increase the risk of muscle toxicity; both the MHRA in the UK [Medicines and Healthcare Products Regulatory Agency, 2010] and the FDA in the USA [Food and Drug Administration, 2011] have recently issued recommendations on the use of high-dose (80 mg) simvastatin in relation to muscle toxicity. The prevalence of hypothyroidism was reported to increase with age [Empson et al. 2007 ] and undiagnosed hypothyroidism is also a risk factor for severe statininduced muscle toxicity such as rhabdomyolysis.\nConcomitant administration of medications that may interfere with the pharmacokinetic profiles of statins can also increase the risk of potential muscle toxicity due to statin therapy (see below).\nIn the PROSPER study on individuals aged 70-82 years with either increased cardiovascular risk or pre-existing vascular disease, there was no reported rhabdomyolysis or serum CK concentration >10 times the upper limit of normal in either the pravastatin 40 mg/day treatment group (n = 2913) or the placebo group (n = 2891) during an average follow-up period of 3.2 years [Shepherd et al. 2002 ]. In the same study, there was no statistically significant difference in the incidence of reported myalgia between the pravastatin and placebo groups (1.2% and 1.1%, respectively). In the SAGE study, incidence of myalgia was also not different between the atorvastatin 80 mg/day (n = 446) and pravastatin 40 mg/day (n = 445) treatment groups (3.1% versus 2.7%, p = 0.70), with only one individual found to have CK level >10 times the upper limit of normal in the pravastatin treatment group but none in the atorvastatin group (p = 0.32) [Deedwania et al. 2007 ]. However, in a retrospective study on statin monotherapy, patients aged 65 years or more were more likely to be hospitalized with rhabdomyolysis compared with those aged <65 years (relative risk, 5.4; 95% confidence interval [CI], 1.3-21.6), suggesting advanced age as a risk factor for statin-related rhabdomyolysis [Graham et al. 2004 ]. Taken together, the above studies demonstrate that myalgia is common among elderly patients on statin therapy, whereas myositis and rhabdomyolysis are relatively rare adverse events."}, {"section_title": "Hepatotoxicity", "text": "It is generally believed that elevations in serum concentrations of aminotransferases including alanine aminotransferase (ALT) and aspartate aminotransferase (AST) can be associated with the use of statins and that this association is a class effect of all marketed statins [Cohen et al. 2006 ]. The incidence of ALT and/or AST elevations >3 times the upper limit of normal is <1% in most studies on patients receiving statins but has been reported in some studies to reach 5% [Chalasani, 2005; Cohen et al. 2006; Tolman, 2002] . In the PROSPER study, increased ALT or AST concentrations (>3 times the upper limit of normal) were only detected in one patient in each of the treatment (pravastatin 40 mg/day) and placebo groups (prevalence <0.0005 in each group) [Shepherd et al. 2002] . In comparison, in the SAGE study raised ALT or AST concentrations (>3 times upper limit of normal) were more common in patients on atorvastatin 80 mg/day than those receiving pravastatin 40 mg/day (4.3% versus 0.2%, respectively, p < 0.001) [Deedwania et al. 2007 ].\nWhether isolated increases in aminotransferase concentrations associated with statin therapy are indicative of liver damage or dysfunction is not fully understood. It appears that many hepatologists no longer consider statins to have any significant hepatotoxicity [Bader, 2010; Tandra and Vuppalanchi, 2009 ]. Chronic liver diseases including non-alcoholic fatty liver disease (NAFLD), chronic hepatitis C, primary biliary cirrhosis and stable compensated cirrhosis are no longer regarded as absolute contraindications for statin therapy [Tandra and Vuppalanchi, 2009 ]. Although clinically significant hepatotoxicity caused by statin therapy is very rare, it is advisable for the prescribing clinician to check baseline liver biochemistry (including ALT) before initiation of statin therapy to exclude pre-existing liver diseases, and subsequently when clinically indicated. Routine monitoring of aminotransferases in asymptomatic patients on statin monotherapy is no longer considered essential [Cohen et al. 2006 ].\nThere is no current consensus on whether some statins are more likely to lead to elevations of aminotransferases than others [Cohen et al. 2006 ].\nTo date, there is not enough evidence to indicate that the incidence of hepatotoxicity or elevations of aminotransferases is higher in elderly patients receiving statins compared with younger patients. However, it should be borne in mind that statinassociated elevations of aminotransferases are more common with high-dose (80 mg) statin usage in the SAGE study [Deedwania et al. 2007] and in a pooled analysis of atorvastatin trials [Newman et al. 2006 ]."}, {"section_title": "Other side effects", "text": "Many other adverse effects have been attributed to statins such as cognitive decline, hyperglycaemia, increased risk of cancer, sleep disturbance and so on [Golomb and Evans, 2008] . The following discussion on statins and their interaction with other medications will concentrate mainly on muscle and liver toxicity, which are relatively common side effects. It is also important to bear in mind that adverse events due to statins and other medications may not have been reported in clinical trials and that safety and tolerability data from clinical trials may not apply to elderly patients encountered in routine clinical practice due to limitations in the recruitment of volunteers to clinical trials."}, {"section_title": "Drug Interactions", "text": "Overview Older people are more likely than the rest of the population to use multiple medications on a longterm basis. Polypharmacy (the simultaneous use of five or more medications) is relatively common in the elderly [Kennerfalk et al. 2002] and sometimes rather difficult to avoid in those who have multiple chronic conditions such as cardiovascular disease and diabetes. Clinical management of cardiovascular risk often involves lifelong therapy with a statin and clinicians should be aware of the potential interactions between statins and other medications frequently used in the elderly. The clinical indications for the combination of lipidmodifying medications and their efficacy are beyond the scope of this article; the reader is referred to other papers and clinical guidelines on this topic [Fazio, 2008; National Institute for Health and Clinical Excellence, 2010; Xydakis and Ballantyne, 2002; Fazio, 2008] .\nInteractions between medications can be either pharmacokinetic, pharmacodynamic, or both. Competitive inhibition of HMG-CoA reductase by statins results in reduced synthesis of cholesterol, upregulation of LDL receptor expression and increased clearance of LDL particles from bloodstream. Mevalonic acid, the product of the action of HMG-CoA reductase, is not only a precursor of cholesterol but also of other metabolites including isoprenoids, which have diverse physiological functions [Corsini et al. 1999; Williams and Feely, 2002] . However, pharmacodynamic interference with other physiological pathways by statins has not been fully established. In contrast, statins are known to interact with other medications at the pharmacokinetic level. Pharma cokinetic properties of currently available statins have been described elsewhere [Bellosta et al. 2004; Corsini et al. 1999; Eckel, 2010; Martin et al. 2003; White, 2002] and are summarized in Table 3 . The majority of statins are metabolized by one or more of the cytochrome P450 enzymes in liver. For example, atorvastatin, lovastatin and simvastatin are metabolized mainly by CYP3A4, whereas CYP2C9 metabolizes fluvastatin. In comparison, pravastatin undergoes extensive first-pass extraction in the liver and is mainly metabolized via hydroxylation; its interactions with other drugs in the liver are probably less common than other statins. Drugs that are known to be substrates, inducers or inhibitors of the two main cytochrome P450 enzymes involved in statin metabolism, i.e. CYP2C9 and CYP3A4, are summarized in Table 4 . As a general rule, inhibitors of CYP2C9 and CYP3A4 can increase the plasma peak concentrations and/or area under the concentrationtime curve (AUC) of some statins, and thus render statin-associated toxicity more likely, whereas enzyme inducers may increase the catabolism of statins resulting in less-effective lipid modification.\nAging is associated with reduction of liver size by 20-30% and blood flow to the liver by 20-50% [McLean and Le Couteur, 2004] . Although reduced hepatic metabolism of drugs can be attributed to decreased hepatic blood flow and mass, it is not entirely clear whether the expression levels and activities of all hepatic cytochrome P450 enzymes are altered with increasing age [George et al. 1995; McLean and Le Couteur, 2004; Parkinson et al. 2004 ]. There is, however, evidence that expression levels and activities of CYP3A are decreased in patients with active liver diseases such as cirrhosis [Chalasani et al. 2001] and nonalcoholic steatohepatitis [Weltman et al. 1998 ]. Current opinion suggests that statins can be used in patients with nonalcoholic fatty liver disease (NAFLD) and statin therapy should be considered in patients with NAFLD because of their increased cardiovascular risk [Chalasani, 2005; Cohen et al. 2006 ]. In our experience, standard dosages of statins are generally well tolerated by most patients with NAFLD but serum aminotransferases and other biomarkers of liver functions should be monitored in this group of patients while on statins, fibrates or other lipid-lowering medications. In the event that aminotransferases or other biomarkers of liver functions deteriorate during lipid-lowering therapy, consideration should be given to dose reduction or cessation of such lipidlowering medications, followed by further close monitoring of response.\nAdvanced age is also associated with decreased kidney size and mass, glomerular filtration rate (GFR) and renal clearance of certain medications, as well as histological changes in the kidney such as fibrosis and tubular atrophy [McLean and Le Couteur, 2004] . GFR in adults decreases by less than 1 ml/min/year after middle age but in healthy subjects it may not be affected by old age at all [McLean and Le Couteur, 2004] . In the Baltimore Longitudinal Study of Aging, the rate of reduction of creatinine clearance was reported to be 0.75 ml/min/year, though age-related decline in creatinine clearance was not detected in approximately one third of volunteers [Lindeman et al. 1985] . With regard to renal clearance, statins and their metabolites (except pravastatin) are not significantly excreted via the kidney (Table 3) . However, age-related reduction in renal drug clearance may result in higher plasma concentrations of other concomitantly administered medications such as fibrates and thus increase the possibility of their interactions with statins. Aging is also associated with decreased activities of CK and protein synthesis in skeletal muscle, changes in muscle fibres and a general reduction in muscle mass [Steinhagen-Thiessen and Hilz, 1976; Nair, 2005] . As a result of these agedependent changes, serum CK concentrations in the elderly should be interpreted using age-related reference ranges if possible."}, {"section_title": "Fibrates", "text": "Fibrates are activators of peroxisome proliferatoractivated receptor α (PPARα). Currently available fibrates include bezafibrate, ciprofibrate and fenofibrate. Although gemfibrozil is not a fibric acid derivative, it shares many of the properties of fibrates and has similar clinical indications; it is therefore discussed here together with the fibrates.\nFibrates alter blood lipids via several mechanisms including induction of lipoprotein lipolysis, induction of hepatic fatty acid uptake and reduction of hepatic triglyceride production, increased LDL removal from the bloodstream, and stimulation of high-density lipoprotein (HDL) production and reverse cholesterol transport [Staels et al. 1998 ]. Fibrates and gemfibrozil are metabolized by hepatic CYP3A4 enzyme and excreted primarily via the renal route [Miller and Spence, 1998 ]. In patients with severe renal impairment, half-lives and serum concentrations of fibrates can be increased [Miller and Spence, 1998 ] and drug interactions between fibrates and statins may be more likely.\nIn a retrospective study on 252,460 patients receiving lipid-lowering medications in the USA, incidence of rhabdomyolysis was not statistically different among patients on atorvastatin, pravastatin or simvastatin monotherapy and averaged 0.44 per 10,000 person-years, whereas incidence of rhabdomyolysis averaged 2.82 per 10,000 person-years in patients on fibrate monotherapy (fenofibrate or gemfibrozil) [Graham et al. 2004 ].\nIn the same study, the incidence of rhabdomyolysis increased to 5.98 per 10,000 person-years in patients on combination therapy of a fibrate with atorvastatin, pravastatin or simvastatin, suggesting that the risk of rhabdomyolysis is higher in patients taking a statin-fibrate combination than statin or fibrate monotherapy [Graham et al. 2004] .\nWith regard to the risk of rhabdomyolysis, the combination of gemfibrozil with a statin should be avoided. A retrospective study analysed data from the US FDA's Adverse Event Reporting System and found that the number of reports of rhabdomyolysis associated with gemfibrozil/statin combination therapy (8.6 per million prescriptions) was 15 times higher than fenofibrate-statin combination therapy (0.58 per million prescriptions) [Jones and Davidson, 2005] . Gemfibrozil not only inhibits the in vitro glucuronidation of statins in hepatocytes to a much larger extent than fenofibrate does [Prueksaritanont et al. 2002] , but also increases the plasma concentrations of lovastatin acid [Kyrklund et al. 2001] , pravastatin [Kyrklund et al. 2003 ] and simvastatin [Backman et al. 2000 ] in vivo.\nRisk factors that may predispose patients receiving statin-fibrate dual therapy to severe muscle toxicity include advanced age, female gender, renal or liver disease, hypothyroidism and excessive alcohol intake [Xydakis and Ballantyne, 2002] . In practice, before commencing a fibrate in an elderly patient who is already taking a statin (or vice versa), it is advisable to exclude potential risk factors for muscle toxicity such as hypothyroidism and reduced renal function, both of which are more common in the elderly than in younger patients. The addition of fibrate therapy to a patient already receiving a statin should be initiated at a low dose and then increased gradually if necessary. It is advisable that renal and liver function tests and CK levels be checked before and regularly after commencing the statin-fibrate combination or after increasing the dosage of either. Patients on statin-fibrate combination therapy should also be warned about the symptoms and signs of muscle toxicity such as muscle pain, muscle weakness and dark urine [Xydakis and Ballantyne, 2002] ."}, {"section_title": "Ezetimibe", "text": "Ezetimibe is a cholesterol absorption inhibitor that prevents intestinal absorption of dietary and biliary cholesterol without affecting the absorption of triglycerides or fat-soluble vitamins. It undergoes extensive glucuronidation in the small intestinal wall and liver via uridine 5'-diphosphoglucuronosyltransferase enzymes to form the active metabolite ezetimibe glucuronide; both ezetimibe and ezetimibe glucuronide are repeatedly delivered to the intestinal wall by enterohepatic recirculation, limiting systemic exposure [Kosoglou et al. 2005; Patrick et al. 2002] . Approximately 78% and 11% of an administered dose of ezetimibe is excreted in faeces and urine, respectively . There are no significant pharmacokinetic interactions between ezetimibe and statins including atorvastatin, fluvastatin, lovastatin, pitavastatin, pravastatin, rosuvastatin and simvastatin, consistent with the fact that ezetimibe does not affect cytochrome P450 enzymes and is primarily metabolized via glucuronidation [Kosoglou et al. 2005] .\nIn a study on healthy volunteers given ezetimibe 10 mg/day for 10 days, slightly higher plasma concentrations of ezetimibe and ezetimibe glucuronide were found in the elderly (>65 years of age) compared with younger (18-45 years of age) subjects; however, it is believed that these small differences are not clinically relevant and dosage adjustment is not necessary for elderly patients [Kosoglou et al. 2005 ].\nIn clinical trials, co-administration of statin and ezetimibe was well tolerated in all age groups and the overall safety profile of statin/ezetimibe combination was similar to that of statin monotherapy [Lipka et al. 2004] . In a pooled analysis of four clinical trials comparing statin monotherapy (atorvastatin, lovastatin, pravastatin or simvastatin) with ezetimibe-statin combination therapy in patients with primary hypercholesterolaemia, the incidence rates of adverse events, treatmentrelated adverse events, serious adverse events and discontinuations due to adverse events were not different between patients aged ≥65 years (n = 269) and those aged <65 years (n = 656) [Lipka et al. 2004 ]. In the same study, among patients aged ≥65 years overall treatment-related adverse events were more frequent in the ezetimibe-statin combination group than the statin monotherapy group (23% versus 15%, p < 0.05) but there was no difference in the incidence rates of serious adverse events or discontinuations due to adverse events between the two treatment groups [Lipka et al. 2004] . It is believed that ezetimibe has a low potential for causing clinically significant drug interactions when co-administered with all currently available statins [Kosoglou et al. 2005 ] and the safety profile of ezetimibe-statin combination treatment in elderly patients is similar to that in younger patients."}, {"section_title": "Nicotinic acid", "text": "Nicotinic acid, also known as niacin, beneficially modifies all traditional classes of serum lipoproteins including LDL and HDL. Various formulations of nicotinic acid have been developed but their widespread clinical use is limited mainly due to side effects. Cutaneous flushing due to nicotinic acid-induced, prostaglandin-mediated vasodilatation is the most commonly encountered (up to 80%) side effect in patients receiving nicotinic acid [McCormack and Keating, 2005] . Immediate-release (IR) or crystalline nicotinic acid, which is the original form of the lipidregulating drug, causes immediate cutaneous flushing in many recipients. In comparison, sustained-release (SR), also known as timed-release, controlled-release or long-acting, preparations cause less flushing but are associated with an increased risk of hepatotoxicity and are less effective in altering serum lipid parameters. Prolongedrelease nicotinic acid (PRNA), also referred to as extended-release niacin in the USA, has an absorption rate intermediate between IR and SR preparations; it is associated with less cutaneous flushing events than the IR formulation [Knopp et al. 1998 ] and has less hepatotoxicity than the SR formulation [McKenney, 2003] . Adverse effects associated with the administration of PRNA are usually transient and mild to moderate in intensity [McCormack and Keating, 2005] .\nMany studies have investigated the efficacy and safety of PRNA with or without additional statin therapy; these include the Coronary Drug Project [Guyton et al. 1998 ], ARBITER2 [Taylor et al. 2004] , COMPELL [McKenney et al. 2007] , SEACOAST [Ballantyne et al. 2008] , OCEANS ] and other studies. The adverse events associated with PRNA-statin combination therapy were essentially similar to those expected of the individual component in these clinical trials and serious adverse events were rare. Although muscle toxicity has been reported in patients receiving PRNA-statin combinations, addition of PRNA does not appear to increase the risk of myositis or myalgia compared with statin monotherapy [McCormack and Keating, 2005] . Severe hepatic adverse events occur rarely with PRNA and there is little evidence to support any increased risk of hepatotoxicity attributed to the addition of PRNA to statin therapy. Blood glucose and/or haemoglobin (Hb) A1c levels were slightly elevated in nondiabetic patients receiving PRNA in some studies but not others. In the ADVENT study, a small but statistically significant increase in HbA1C level from 7.21% to 7.50% was observed after 16 weeks in type 2 diabetes patients receiving PRNA 1500 mg/day . To date, no study has specifically examined the safety and tolerability of PRNA with or without statin in the elderly. In the OCEANS study on the safety of long-term (52 weeks) PRNA-simvastatin combination therapy, the incidence of adverse events was not different between patients aged <65 and ≥65 years ].\nTo minimize potential side effects, PRNA should be commenced at a low dose and gradually titrated up depending on tolerability. Aspirin taken 30 minutes before or concomitantly with PRNA can reduce the incidence, intensity and duration of flushing. Other strategies for improving compliance include consistent dosing with meals or at bedtime, and avoidance of alcohol, hot beverages and spicy food close to or after dosing.\nLaropiprant is a selective antagonist of prostaglandin D 2 and can reduce the cutaneous flushing often associated with nicotinic acid. A fixed-dose combination of laropiprant-PRNA has recently become available for routine clinical use and appears to have a safety and tolerability profile similar to that of PRNA monotherapy except for less flushing-related adverse experience and discontinuations Perry, 2009 ]. Long-term data on the safety of laropiprant-PRNA and statin combination therapy are awaited."}, {"section_title": "Bile acid sequestrants", "text": "Bile acid sequestrants (BASs) are anion exchange resins (often simply called 'resins') that bind bile acids in the gastrointestinal tract to form an insoluble complex. By reducing the intestinal reabsorption of bile acids, BASs promote hepatic conversion of cholesterol to bile acids and increase hepatic uptake of LDL from the bloodstream by upregulation of the hepatocyte LDL receptor (secondary to depletion of intracellular cholesterol diverted into bile acid synthesis). Both mechanisms result in lower serum total and LDL cholesterol concentrations.\nIn addition to binding to bile acids, BASs also have the potential to decrease the intestinal absorption of statins and other medications; it is usually recommended that statins be administered at least 1 hour before, or 4 hours after, the intake of BASs. The requirement to separate BAS administration from that of statins and other medications may have limited the use of BASs, especially in elderly patients who receive multiple medications. Old age is also associated with slowing of gastric emptying, decreased peristalsis and slowing of colonic transit due mainly to loss of neurons [McLean and Le Couteur, 2004] ; it is conceivable that transit time of BASs through the gastrointestinal tract is longer in older patients than younger individuals, leading to potential impairment in absorption of other concomitantly administered medications. The main adverse events associated with BASs are gastrointestinal disturbances such as constipation. At present, there is little evidence to suggest that BASs increase the side effects of statins."}, {"section_title": "Omega-3-acid ethyl esters", "text": "Omega-3-acid ethyl esters are indicated in secondary prevention after myocardial infarction and in patients with hypertriglyceridaemia. Commonly referred to as 'fish oils', omega-3-acid ethyl esters are administered as oral capsules containing high concentrations of both eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA) esters. Omega-3-acid ethyl esters were generally well tolerated in clinical trials [Durrington et al. 2001; Harris et al. 1997; Tavazzi et al. 2008 ] and associated adverse events were usually gastrointestinal such as nausea and belching, mild in intensity and self-limiting. Pharmacokinetic studies have shown that the steady-state concentrations of atorvastatin, rosuvastatin and simvastatin are not altered by simultaneous administration of omega-3-acid ethyl esters in healthy volunteers [Di Spirito et al. 2008; McKenney et al. 2006; Gosai et al. 2008 ]. Adverse events detected in patients receiving combination therapy of omega-3-acid ethyl esters and simvastatin [Davidson et al. 2007; Durrington et al. 2001] or atorvastatin were not different from statin monotherapy. There is no available evidence to suggest that the safety and tolerability profiles of omega-3-acid ethyl esters are different in elderly patients compared with younger patients."}, {"section_title": "Conclusion", "text": "Many studies have demonstrated that statins are well tolerated by most elderly patients but they are less likely to receive statin treatment compared with younger patients. There have been reports of serious adverse events in patients receiving statins with or without concomitant administration of other lipid-lowering medications. The paucity of safety/tolerability data in patients more than 85 years of age receiving statins and other lipid-lowering medications should also be taken into account when such medications are prescribed in this group of very old patients. It is in the interest of the prescribing clinician that risk factors for potential side effects of statins such as muscle toxicity are well recognized. Co-administration of other lipid-modifying agents is a risk factor that can be minimized by better understanding of their pharmacokinetics and potential drug interactions with statins. In older patients with low body mass indices or other risk factors associated with adverse events, it is advisable to 'start low and go slow' when a statin or fibrate is prescribed."}, {"section_title": "Funding", "text": "This research received no specific grant from any funding agency in the public, commercial, or notfor-profit sectors. "}, {"section_title": "Conflict of interest statement", "text": ""}]