[{"section_title": "3.", "text": "A, DEM of Dauphin Island representing restoration measure R2. B, DEM of Dauphin Island showing the elevation differences in restoration measure R2 compared to the no-action case........"}, {"section_title": "4.", "text": "A, DEM of Dauphin Island representing restoration measure R3. B, DEM of Dauphin Island showing the elevation differences in restoration measure R3 compared to the no-action case........"}, {"section_title": "5.", "text": "A "}, {"section_title": "Introduction", "text": "The forecasting of long-term evolution of barrier island systems is an emerging necessity for coastal managers aimed at increasing the resiliency of the system for future generations. The work of Mickey and others (2019) to develop a modeling technique to forecast evolution of barrier islands has provided coastal managers a way to inform decisions related to proposed island modifications and varying climatic changes. As part of the Alabama Barrier Island Restoration Assessment (https://coastal.er.usgs.gov/alabama-barrier-island-restoration-study), the coupled model framework methodology was used to forecast a range of potential outcomes for Dauphin Island, Alabama, over a decadal period under varying climatic changes related to sea level change (SLC) and storminess with varying proposed restoration scenarios. The modeling scheme U.S. Geological Survey."}, {"section_title": "U.S. Army Corp of Engineers.", "text": "The Water Institute of the Gulf. University of North Carolina at Wilmington. uses the numerical model Delft3D (D3D) and the empirical dune growth model (EDGR) from Mickey and others (2019) to simulate evolution of the barrier island shorelines and dune growth, then uses the numerical model XBeach to simulate storm induced erosion over the entire barrier island. The morphological output of the Dauphin Island forecast coupled model framework was linked to a model to predict the evolution of habitats (intertidal beach, dune, back barrier flat, etc.) at Dauphin Island for three target years (0, 5, and 10 year) throughout the decadal simulation (Enwright and others, 2020). Additionally, morphological output was linked to water quality modeling to inform how morphological changes over this decadal period could affect oyster reef and submerged aquatic vegetation (Wang and others, 2020a, b, respectively). The results of the combined model framework will be coalesced and integrated into a decision support framework. Dauphin Island, ( fig. 1) situated off the coast of Alabama, provides habitat for multiple species, is home to the community of Dauphin Island, is a popular tourist destination, and provides a barrier against storm waves for mainland coasts. The barrier island has eroded due to impacts from Figure 1. A, Location of Dauphin Island, Ala., with tide gauge locations (NOAA tide stations 8735180 and 8729840) indicated by green dots within the northern Gulf of Mexico. B, Dauphin Island, Ala., with locations of Katrina Cut, EDGR growth area, tide gauge (NOAA tide station 8735180) and Pelican Island (from Mickey and others, [2019]). Abbreviations: Ala., Alabama; EDGR, empirical dune growth model; Fla., Florida; km, kilometers; m, meters. major storms and was split by a breach following the passages of Hurricanes Ivan and Katrina in 2004 and 2005, respectively, which was closed by a rubble mound structure constructed in 2010 (Douglass, 1994;Froede, 2008;Froede, 2010;Martinez, 2012). To assess island evolution for the future, the present island configuration was modeled over a decade to determine morphologic changes and how those changes may affect different island and aquatic habitats, and how varying proposed restoration scenarios would affect habitat evolution under differing climatic changes (sea level change)."}, {"section_title": "Potential Restoration Measures Tested in Forecast", "text": "To evaluate the impact of a range of restoration actions on the long-term response of Dauphin Island's morphology, seven restoration measures were used to initialize model simulations (table 1). The simulation results can be compared to the no-action case (R0), which is the 2015 digital elevation model (DEM) with no restoration measure applied. The first model restoration measure (R1) was an initial sensitivity test for a design that replaced the Katrina Cut rubble mound structure, which was designated as non-erodible in the models, with an erodible sand berm of the same height and width; restoration measure R1 resembled the island configuration for a noaction measure ( fig. 2). The second restoration measure (R2) considered a Pelican Island sediment nourishment that extended the present southern tip of Pelican Island approximately 2.6 km to the southeast as seen in figure 3. The third restoration measure (R3) placed nourished sediments on the submerged Sand Island platform to increase the elevation to approximately 2 m below mean sea level. The Sand Island platform is a remnant sand shoal of what is now Pelican Island that has been migrating toward and appending to Dauphin Island over the past century (Flocks and others, 2018). This restoration measure included simulations of sand placement every 2 years, maintaining Table 1. Descriptions of restoration measures R1 to R7, and the associated figure for the alternate digital elevation model (DEM).   the current bed levels in the placement area roughly 5 m higher than the no-action case ( fig. 4). The fourth restoration measure (R4) nourished sediment on the beach that is east of the Katrina Cut and the shorefront area that is east of Pelican island to widen the beach and increase dune elevations to a maximum of 3.7 m above mean sea level ( fig. 5). The fifth restoration measure (R5) filled in sediment borrow pits present along the back-barrier regions (tidal flats) of Dauphin Island and restored back-bay marsh and island platforms behind Katrina Cut and within Graveline and Aloe Bays ( fig. 6). The sixth restoration measure (R6), similar to R4, had the beach area on the eastern narrow portion of Dauphin Island nourished with sediments and a dune feature placed further landward than the R4 measure to align better with locations of the dune fields that were observed in aerial photography from the 1950s with no sediment nourishment east of Pelican Island ( fig. 7). The seventh restoration measure (R7) was a modified version of R6, which extends the changes west to the front side of the Katrina Cut rubble mound structure ( fig. 8). Both measures R6 and R7 were designed to restore island width and dune alignments to conditions that were present in the 1950s based on georeferenced aerial photography from Smith and others (2018).  "}, {"section_title": "Sea Level Projections and Forecast Storm-Set Generation", "text": "The management and technical teams determined that each restoration measure (R1-R7) should be modeled under varying levels of storminess and sea level change (SLC) to quantify the uncertainty in alternative response under varying conditions. The model run time was selected as 10 years, which was chosen as being enough time to capture the variability in island response under varying storminess, sea level rise (SLR), and restoration action, while still being computationally feasible to execute. As such, the combinations of storms and SLC scenarios are meant to differentiate the response of restoration measures to a range of forcing rather than to explicitly model a specific 10-year time period. The following section describes the methods used to sample the variability in SLC and storminess for the Dauphin Island modeling framework.   "}, {"section_title": "Scenarios of Sea Level Variability", "text": "Predicted global and local SLR rates have variability and uncertainty associated with the underlying model assumptions (Intergovernmental Panel on Climate Change, 2014). Deterministically modeling the response of Dauphin Island to SLR over the 30-to 50-year time period of management interest while accounting for this uncertainty in SLR rate predictions is computationally unfeasible to conduct. Therefore, the modeling and management teams opted to capture the variability in restoration measure response (benchmarked against each other and the no-action case) by selecting three static sea-level increases (SL1-SL3) to apply as boundary conditions to 10-year model forecast runs. These increases are meant to provide a benchmark for comparing the response of the Dauphin Island restoration measures (R1-R7) and do not account for the dynamic effects of SLR at barrier islands (Passeri and others, 2015). The three static SLC cases (sea level case 1 [SL1], sea level case 2 [SL2], and sea level case 3 [SL3]) corresponded to increases of the modelled offshore mean sea level by 0.3 m, 0.5 m, and 0.96 m, respectively. These future SLC scenarios were derived by using the U.S. Army Corps of Engineers (USACE) SLC curve calculator ([version]  Future Sea-Level Projections USACE guidance ER 1100-2-8162, \"Incorporating Sea Level Changes in Civil Works Programs,\" (U.S. Army Corps of Engineers, 2013) was used for consideration of projected future sea-level changes on the various measures. Because future sea-level change rates are uncertain, planning and design should consider project performance for a range of rates. Historic rates are used as the lower bound sea-level change rate. Predictions of future sea level due to intermediate and high rates of sea level change were developed in accordance with USACE guidance by extension of rate Curve 1 and Curve 3, respectively, from the National Research Council's 1987 report \"Responding to Changes in Sea Level: Engineering Implications\" (National Research Council, 1987). Historic rates of sea level change are determined from tide gauge records. Long-term tide gauge records on the order of at least 40 years are preferred over shorter-term records because the estimated error for the rate of sea level change decreases as the total number of years recorded increases. There is one long-term (1966-2017) tide gauge at Dauphin Island, Alabama, the NOAA tide station 8735180 ( fig. 1). From this location, the relative rate of sea level rise was determined to be approximately 3.61 millimeters per year (mm/yr; 95 % confidence error is ±0.59 mm/yr). As stated previously, projections for the relative rise in SL for Dauphin Island was determined using the USACE SLC curve calculator ([version] 2017.55) for low, intermediate, and high curves and using the NOAA (1966-2017) local relative SL rise of 3.61 mm/yr reported for the Dauphin Island tide gage 8735180. As seen in figure 9, the projected relative rise in SL by 2070, which is equivalent to a roughly 50-year period, varies from 0.3 meters in 2070 (using the current low rate; see low curve on fig. 9) to 1 m in 2070 (using the current high rate; see high curve on fig. 9)."}, {"section_title": "Characterization and Representation of Storminess Bins", "text": "Decadal-scale variation in storm frequency and intensity, hereafter referred to as \"storminess,\" can result in significant variation in island geomorphic response (Timmons and others, 2010). The evolution and benefits of restoration measures will similarly be sensitive to storminess, with potentially varying relative impacts of different levels of storminess on specific management measures. Multiple levels of storminess were therefore used in predicting Dauphin Island's evolution and response to management measures, and a computationally efficient method for characterizing storminess and selecting representative storm sequences was required. To meet this need, we developed a method for characterizing storminess into bins based on Monte Carlo modeling of island response to multiple realistic sequences of storms using a 1D proxy model framework (CA1D). This approach differs from previous methods of characterizing storm recurrence intervals in that it characterizes multiple events based on the potential impact to a barrier island, which allow cumulative effects associated with frequency of occurrence to be considered in characterizing the magnitude of impact a storm sequence will have on an island. For each storminess bin, a single sequence of storms was then chosen and modeled with the full Dauphin Island assembly line approach with the variations in sea level rise (SLR) and restoration scenarios."}, {"section_title": "Generation of Storm Sequences", "text": "To evaluate the range of possible geomorphic response to varying levels of storminess, 1,000 possible realizations of different synthetic storm sequences were evaluated with CA1D. The synthetic storms (tropical cyclones) and their associated response originated from the Federal Emergency Management Agency (FEMA) Risk Mapping Region IV probabilistic coastal storm surge modeling effort for the Alabama and Florida Panhandle coasts (Federal Emergency Management Agency, 2014). These synthetic storms were developed in the context of a Joint Probability Method with Optimal Sampling (JPM-OS) approach, where the storms' probabilities are associated with their corresponding hydrodynamic modeling response. The storm sequences and realizations were generated following a Monte Carlo sampling method developed by the USACE in which random selection from a Poisson distribution (Grimmett and Stirzaker, 1992) is first used to identify what years a storm will occur over a given time interval. For Dauphin Island, this time interval was initially chosen as 20 years to capture the period of performance of potential management measures. Each storm was then assigned to a specific synthetic storm within the database of events landfalling within 200 kilometers (km) of Dauphin Island based on random selection weighted by the frequency of occurrence of each event (in other words, the storm probabilities). To account for the variation in tidal water levels, which is not included in synthetic storm water-level variations, the model start time for each storm was randomly matched to a 15-minute time step within the 24-hour morphologic tide (same as that used in D3D-mormerge climatology; Mickey and others, 2019), and the time-varying tide (starting with that time step) was then added to the storm surge ( fig. 10). The CA1D framework was ultimately applied to characterize the storminess of the first 10-years of each 20-year sequence based on input from the technical and management team regarding the time frame over which management measures should be evaluated."}, {"section_title": "Representative Island Profile Generation", "text": "Defining the varying sequences of storms that would be applied in the 10-year forecast period was determined through a modeling effort using XBeach and EDGR to evolve an idealized barrier island profile with characteristics representative of Dauphin Island. This profile consisted of a piecewise continuous model with a linear approximation of the beach and Gaussian approximations for the island base and foredune ( fig. 11D; red line). The equation for the elevation of the subaerial portion of the representative profile (z pr ) is given below. where x tr is the beach and dune transition point (derived from shoreline position plus the mean beach width); x is the cross-shore coordinates of profile; m is the beach slope; G is,pos is the island centroid location (position); G is,high is the island centroid height; G is,wid is the island centroid width; G D,pos is the dune location (position); G D,high is the dune height; and G D,wid is the dune width. A cross-shore profile was extracted from September 2004 light detection and ranging (lidar) data from the western end of Dauphin Island ( fig. 11A; magenta line) and run through 1sum-of-Gaussians fitting to get width and height values for the residual island Gaussian ( fig. 11D; black dotted line) (Mickey and others, 2019). The slope (0.02) and width (30.6 m) of the linear beach portion of the profile was taken from Doran and others (2017) as the beach slope at the location nearest to this profile. Average dune width (46.7 m) and dune height (2.09 m) were calculated from three lidar surveys to account for variability in the island state; pre-Katrina conditions (September 2004 survey), post-Katrina conditions (September 2005 survey), and somewhat recovered conditions (June 2008 survey). The offshore bathymetry portion of the idealized profile ( fig. 11C) was generated by averaging offshore bathymetry from the XBeach grid domain from about -0.5 m depth to ~15 m depth over an area of about 70 square kilometers (km 2 ) ( fig. 11A). This idealized profile was set as the initial topography and bathymetry for all 10-year simulations run for this investigation."}, {"section_title": "Modeling Framework", "text": "The CA1D methodology includes the components of XBeach, to predict the impacts of storms, and includes EDGR, to evaluate natural dune recovery between storm events. Because the model is operating in one dimension, Delft3D is not included. XBeach operated in 1D mode with the (1) topographic-bathymetric (topo-bathy) data coming from the idealized profile described above, (2) wave and water levels from the selected synthetic storm, (3) friction Figure 10. Wave and water level inputs for synthetic storm 136 from realization 133 (medium storminess bin) with morphological tide start index 94. A, H s at offshore boundary (blue line); B, surge at offshore boundary (blue line); C, original morphological tide at start index of 1 (blue line) with the 99 possible start points (blue dots) and morphological tide at start index of 94 (red line); and D, combined surge and morphological tide with start index 94 (blue line). Abbreviations: H s , significant wave height; m, meters; morph, morphological. coefficients derived by the Passeri and others (2018) method, and (4) all other parameters like those used in the hindcast 2D models (Mickey and others, 2019) except applied in a 1D setup. The EDGR model configuration for the CA1D run followed the setup used in the Dauphin Island hindcast (Mickey and others, 2019). Growth parameters for this setup were the dune height vs. dune width linear-fit slope (m dWdH ) and y-intercept (b dWdH ) taken as 27.56 and 2.95 m respectively, and growth rate (r) taken as 0.53 meters per year (m/yr). The terminal dune height, D high,F , was taken as the average terminal dune height of all Dauphin Island profiles (2.85 m). The initial dune height, D high,0 , was taken as the maximum elevation of the representative cross-shore profile (2.64 m), with the start of the run used as the dune growth initial time (t 0 ). Dune position (y D ) was initialized as the cross-shore location of the dune maximum in the initial profile. The CA1D XBeach-EDGR model was time-stepped on an annual basis for each storm sequence. Each year, EDGR was first run to grow the height of the foredune. If the sequence of storms did not contain an event within that year, the model time-stepped to the next year. In years containing a storm, the maximum total water level (TWL) predicted for the storm (calculated in the hindcast study for synthetic storm matching; Mickey and others, 2019) was compared to the current height of the profile's foredune (D high ). XBeach was run for storms in which overwash was predicted, given that TWL>D high . If multiple storms met this criterion within a given year, they were run sequentially without foredune growth before time stepping to the next year. After all storms within a given year were modeled, the resulting profile was evaluated to determine if EDGR needed to be reinitialized (for example, if y D , t 0 , and D high,0 needed to be reset according to Figure 11. Idealized profile (B) used in the CA1D analysis generated from observed island morphological characteristics (A) for the sub-aerial portion of the island. (D) The combined sub-aerial and offshore portion of the profile (C). Area in red box (A) illustrates bathymetry that was averaged to get the offshore portion of the idealized profile in C; magenta line in A represents extracted profile for B used to get the island base Gaussian for use with mean island morphological characteristics. Abbreviations: CA1D, 1-dimenstional proxy model framework; DEM, digital elevation model; km, kilometers. Elevation and depth, in meters the dune placement criteria described in Mickey and others, 2019). One modification was made to the EDGR model framework for use with the CA1D methodology. If the entire profile became subaqueous, y D was set to the location of the cross-shore maximum elevation and D high,0 was set to zero, resulting in incipient dune formation above the water level at the next annual time step. Table 2. Low, medium, and high storminess bins and representative scenarios. [The sequence of storms within each representative scenario are described in the Coupled Model Framework section. The percentage (%) of sequences within each bin are the total number of realizations, out of the 1,000 total, for which the number of storms fell within that storminess bin. The probability of occurrence represents the relative likelihood of that storminess bin, which is not identical to the percentage of sequences because of the method used to generate the storm sequences. In addition to the three storminess bins selected through CA1D analysis, an extreme storm-case end member was also chosen from the 1,000 realizations. "}, {"section_title": "Creation of Storminess Bins and Selection of Representative Scenarios", "text": "After each of the storm sequences were modeled, they were categorized into one of three storminess bins (low, medium, and high; table 2) based on the number of storms that the TWL exceeded D high (for example, those events that were estimated to result in overwash of the representative profile given the dune characteristics of the 1D profile at the time of the storm). The comparison of TWL to an evolving D high value in the CA1D approach allows for the influence of antecedent morphology to be considered in characterizing storminess, thereby realistically capturing the larger impact that a weaker storm (lower TWL) will have on an island that was recently degraded by a prior event. For each scenario, the response of the 1D profile was characterized based on four metrics of island response including (1) island maximum height (I high ), (2) island width measured from the Gulf to the Bay shoreline position (I wide ), (3) dune Gaussian width (G wide ), and (4) dune Gaussian height (G high ) (1-4, respectively in fig. 11D). Each of these metrics was calculated for each year in the CA1D simulation and then summed over the ten years as a metric of the integrated impact of the storm sequence (S) on the profile. For example, for island height: (2) Then, for each of the three storminess bins (B), the mean over all storm sequences within that bin (S B ) was calculated for each integrated island response metric: (3) Then, the offset of each integrated island response metric was calculated for each scenario within each bin and normalized by that metrics mean value: Lastly, the representative scenario for each storminess bin (R B ) was selected ( fig. 12) by minimizing the root of sum of squares (RSS) across the four island response metrics: 5Realizations wherein the profile became subaqueous were excluded from use in selecting the best-match realization for each bin due to the relatively unrealistic profile shape that results from growing a foredune atop a submerged island platform. Application of the CA1D approach resulted in the selection of one representative storm sequence (table 2) for the low, medium, and high storminess bins ( fig. 12). The time-evolution of each of the representative storminess bin scenarios ( fig. 13) illustrates that the CA1D mechanism could differentiate regimes of island response. For the low storminess bin, the island does not incur overwash and changes over time are confined to modest growth of the foredune. Figure 12. Storm sequences (blue = low storminess; green = medium storminess; red = high storminess) falling within each of the three storminess bin (dots). Vertical lines indicate the mean value for the island maximum height (x-axis), and the horizontal lines indicate the island width (y-axis) calculated as the distance from the Gulf of the Bay shoreline. The circled realizations are the representative scenarios for each bin (equation 5). Note, because the best match also includes dune height and width, the representative scenario in this plot is not necessarily the closest sequence to the mean of the two metrics shown. Abbreviations: m, meters; max, maximum. In contrast, medium storminess results in island overwash and the destruction of the foredune, which then regrows on the island platform. For the high storminess bin, the profile incurs multiple overwash and dune recovery cycles (for example, barrier island rollover). In addition to the low, medium, and high storminess bins, one storm sequence was chosen to represent an extreme storminess case. This realization consisted of six storms over the ten-year period for which TWL>D high , with four of those storms having a maximum total water level of over 4 m. This realization was included to provide an estimate of the maximum island loss that could be expected from a realistic, although improbable, sequence of storm events."}, {"section_title": "Probability of Occurrence of Each Storminess Bin", "text": "One thousand 20-year realizations of storms were sampled and modeled using CA1D. A 10-year period was eventually selected for the 1-D analysis by using the first 10 years of the 20-year period. If it is assumed that the realizations within the storminess bins are equally likely, the probabilities associated with the storminess bins are computed by dividing the number of storms in a storminess bin by the total number of storms (table 2, \"Percentage of sequences\"). Figure 13. 10-year time sequence of response of the 1D profile to the representative scenario for each of the storminess bins; the low storminess bin (A), the medium storminess bin (B), and the high storminess bin (C). The black horizontal line represents the 0-meter contour. Abbreviations: m, meters. The assumption that the storm realizations are equally likely holds true for the original sampled 20-year storm sequences. The storm sequence generation process is designed to retain the overall storm recurrence rate (SRR) for this location (0.385), therefore the generated storm sequences retain a total number of events that is consistent with this SRR. For the 20-year length realizations, each of the 1,000 realizations therefore have 7-8 storms (which, when divided by the 20-year length of the realizations, roughly approximates the SRR of 0.385). The assumption that each of the storm realizations is equally likely does not hold true in the case of only applying the first 10-year period of each storm sequence, because the number of storms within that time period was not constrained to be consistent with the overall SRR for this location (for example, 3-4 events). In addition, as previously mentioned, storm sampling was weighted by the frequency of occurrence of each event. Therefore, an additional analysis was required to calculate the true likelihood of occurrence for the low, medium, and high storminess bins. Storminess bins probabilities for 10-year life cycles. Occurrence of tropical cyclones (TCs) are often described as a Poisson process (Chouinard and Liu, 1997;Elsner and others, 2001;Sommers, 2003). The initial 20-year storm realizations were generated following a Monte Carlo sampling method using the Poisson distribution to obtain the year-to-year storm counts and to consider the storms relative probabilities in the sampling. The Poisson distribution is defined by the parameter λ (lambda), which is the recurrence rate of the TCs for the period analysis. The effect of selecting the first 10 years of the 20-year period is that each of the life-cycle realizations now have different numbers of storms, and therefore different recurrence rates. The 10-year life cycles may contain no storms, 4 storms, or even 8 storms, for example, depending on the sampled Poisson distribution sequence for the complete 20-years. Figure 14 contains histograms showing the number of TCs for the 10-year life cycles. These histograms were compared to the Poisson distribution by adjusting the lambda parameter for use of a 10-year period of analysis by multiplying the SRR by ten and obtaining a λ=3.85 storms/decade. Figure 14 shows, with red plus symbols, the distribution of life-cycle realizations based on the Poisson distribution. Figure 14 also shows the frequency of TC \"counts\" considering all the 1,000 life-cycle realizations without dividing by the storminess bin in the bottom right graph (fig. 14D). The shape of the histogram for all realizations in the bottom right of figure 14D follows the general shape of the Poisson distribution but it overestimates the frequency of 3 and 4 TCs per 10-year period and underestimates the tails. The data distribution of TC counts for all 1,000 realizations shown in the histogram results ( fig. 14D) in a maximum likelihood estimate of λ=3.71 storms/ decade. Since this approximates the SRR and the overall Poisson shape is maintained, the probabilities for the storminess bins were determined by computing the probabilities of each realization based on the storm count frequency of the 1,000 realizations, weighted by the relative probabilities of the storms within each realization. The storm count frequency for each number of storms bin is shown in table 3. The consideration of the storm relative probabilities accounts for the likelihood of a particular storm sequence being sampled. Otherwise, if two realizations sample three storms, but one realization samples high intensity storms and the other realization samples low intensity storms, the two realizations would have the same likelihood of occurrence; even though in reality the likelihood of occurrence would be different. The following steps in the process were followed: 1. Group the life-cycle realizations by the number of storms sampled or number of histogram bins (nine groups, from zero storms to eight storms). 2. Multiply the storms' probabilities corresponding to the storms within each realization. 3. Add the product of the storm probabilities for all realizations (step 2) for each group (step 1). 4. Compute the weight of each realization by dividing the product of the probabilities (step 2) by the total summation of the products for the corresponding storm grouping (step 3). 5. Multiply the relative weight for each realization (step 4) by the frequency of the corresponding bin (frequency column in table 3) to obtain the probability of each iteration. 6. Regroup all iterations by the storminess bin and add the probabilities of each iteration (step 5) within each storminess bin to obtain the probability of the storminess bin. The probabilities for the bins that consider the frequency of the storms and the storm relative probabilities can be seen in table 2 (\"Probability of occurrence\"). Storminess bin probabilities were also computed by using the probabilities from the Poisson distribution with λ=3.85 storms/ decade instead of the frequency of the storm count. This approach modifies step 5 above by substituting the frequency of the storm bin (frequency column in table 3) by the Poisson probability (fourth column of table 3) in the relative weight multiplication. The storminess bins probabilities resulting from step 6 need to be slightly adjusted proportionally to have the probabilities of the storminess bin add up to 1. The resulting probabilities of occurrence are 17 percent for storminess Figure 14. Histogram showing the distribution of number of tropical cyclones (for 10-year period) across the realizations for each storminess bin (A, bin 1; B, bin 2; C, bin 3), as well as the total distribution across all 1,000 realizations (D, bins 1-3). Abbreviations: JPA, joint probability approach, λ (lambda), Poisson distribution parameter; StormSim; storm simulation; TC, tropical cyclone; km, kilometers; YR, year. bin 1, 50.4 percent for storminess bin 2, and 32.6 percent for storminess bin three. These represent a difference in probabilities from the first approach of a 3.7 percent increase for storminess bin 1, a 6.8 percent reduction for storminess bin 2, and a 3.1 percent increase for storminess bin 3. "}, {"section_title": "Scenario Generation Summary", "text": "The coupled model framework for predicting the variability in Dauphin Island response to varying levels of sea level rise (SLR), storminess, and restoration measure was captured through 10-year model framework simulations under varying levels of sea level increase and storminess. Three offshore sea-level (SL1-SL3) increase values (0.3 m, 0.5 m, and 0.9 m) were chosen to represent the increase in sea level associated with varying SLR rate predictions. Storminess variability was captured by using a 1D proxy model (CA1D) to reduce the potential variability in storminess to four representative storm sequences. CA1D simulated the response of a representative profile to 1,000 different realizations of storm sequences with realistic recurrence rates for the Dauphin Island area. Four storminess bins were then identified based on the integrated island response over the 10-year period for each realization. These bins were chosen to capture potential regime shifts in island response. The lowest storminess bin was associated with limited change to the 1D island profile; the medium storminess bin was associated with overwash and dune recovery; the high storminess bin was associated with repeated island overwash and rollover; and the extreme storminess bin was associated with island inundation. A single representative storm sequence was chosen for each of the storminess bins. When combined with the three sea-level (SL) values, a total of 12 potential future combinations of sea level and storminess were generated to capture the range of future climatological forcing variability at Dauphin Island."}, {"section_title": "Coupled Forecast Model Framework", "text": "The same coupled model framework used in the Dauphin Island decadal hindcast was used for all forecast scenarios, thus references made to the hindcast going forward refer to Mickey and others (2019). The four storm simulation scenarios were convolved with the 3 varied rises in static SL to produce a total of 12 forecast scenarios (table 4) for the \"no-action\" case (no restoration measures added to the DEM configuration). A naming convention was developed for  Table 4. Forecast simulations of varied levels of storm activity. [All storm realizations were simulated with all sea level (SL) scenarios on the no-action case (R0) island configuration. Abbreviations: D3DMM, Delft3D with mormerge configuration; EDGR, empirical dune growth model; MM, mormerge; ST1-ST4, storminess bin 1-4; SS, synthetic storm; XB, XBeach] the simulations wherein the low-level storm scenario (ST1) and the low-level SL scenario (SL1) are referenced as ST1SL1, with higher level storm (ST2, ST3, ST4) and SL (SL2, SL3) scenarios following in the same format. For each of the forecast scenarios, the addition of the static SL cases was implemented by adding the SL value (0.3 m, 0.5 m, and 0.96 m; see section \"Scenarios of Sea Level Variability\") to the water-level boundary conditions during simulations of both quiescent periods and individual storm events. For the forecast simulation, D3D-mormerge (Deltares, 2019) was initiated using the same wave climatology and grid setup as that used in the hindcast validation to simulate long-term morphological changes associated with shoreline migration. The Empirical Dune Growth model (Mickey and others, 2019) was used to simulate dune building after each D3D-mormerge simulation and was set up identically to the hindcast using the same growth rate (0.53 m/yr), dune growth reset threshold (0.25 m), linear-fit slope of dune height versus dune width (4.2), and y-intercept (13.5 m) for both Dauphin Island and Pelican Island. Since the goal of the simulations was to evaluate the relative impacts of different restoration measures, the same alongshore distribution of terminal dune characteristics for EDGR used in the hindcast were used for each simulation. The various synthetic storms punctuated throughout the 10-year forecast (derived in the previous sections) were simulated in the sequence provided in table 4 using the numerical model XBeach (Roelvink, 2009). Wave and water-level boundary conditions were applied in the same manner as the hindcast and morphologic tide for the XBeach simulations and was randomly applied to the levels of synthetic storm surge in the same way as in the CA1D analysis presented in the previous sections. All 12 storm and SL scenarios were simulated for the no-action case using the coupled model framework. Model simulations for the restoration measures were performed using the ST2SL1 scenario, identified by the USACE partners as being the most representative of design conditions, and the ST3SL3 scenario, identified as being associated with island evolution under a more energetic or the \"worst case\" set of conditions. The feasibility study evaluated how six proposed restoration measures (R2-R7) that varied in scale, location, and design responded to a subset of the storminess and SL rise scenarios."}, {"section_title": "Results", "text": "The decadal modeling results of the coupled model framework of Dauphin Island for the no-action case are shown in figure 15 for all the storm and SL scenarios (ST1SL1-ST4SL3; model output DEMs can be found in Mickey and others, 2020). These results indicate that island degradation increases with storminess (frequency and strength) and increased SL. This full matrix of scenarios shows the possible conditions that could occur given the suite of storminess and SL scenarios ( fig. 15). The two scenarios chosen for simulation on the six restoration measures were ST2SL1 and ST3SL3. As stated previously, there was an initial sensitivity test run on a measure (designated restoration measure R1) that was not specifically designed for this study, which essentially changed the Katrina Cut rubble mound structure with an erodible sand berm of the same elevation and width. This restoration measure was simulated with only the ST3SL3 scenario and it resulted in complete erosion of the berm in this area leading to a breach approximately 3.5 km wide ( fig. 16). Areas adjacent to the Katrina Cut rubble mound structure were eroded in a similar pattern to the no-action case of this scenario, with an ebb tidal shoal that formed in the western portion of the breach (figs. 16B and 16C). The second restoration measure (R2) was a southeastern extension and sediment nourishment of Pelican Island on the eastern portion of Dauphin Island (fig. 17A). The post-scenario DEMs (ST2SL1, fig. 17B; ST3SL3, fig. 17D) illustrate that the ST2SL1 scenario resulted in minimal erosion along the nourished Pelican Island. Compared to the no-action case simulation, there are no noticeable differences in the patterns and magnitude of erosion or deposition around the main portions of Dauphin Island, but there are obvious differences in the areas surrounding Pelican Island where the sand nourishment was placed ( fig. 18B). The ST3SL3 scenarios also show a similar morphological response of Dauphin Island compared to the no-action case, with more notable effects on the restoration action locally on Pelican Island (fig. 18C). Specifically, breaching of the nourished Pelican Island is observed with greater erosion occurring further north along Pelican Island compared to the no-action case (fig. 17D). The third restoration measure (R3) was sand placement to build up the Sand Island platform offshore to the southeast of Pelican Island. One modification to the modeling framework was made for these simulations, namely the seabed elevation at the sediment placement site was reset every two years to the original nourished elevations in areas where erosion occurred. This modification was made to simulate the effects of multiple sand placements associated with placement of dredge material. Little to no effect of the offshore placement on the final elevations of the subaerial islands to the west was found. Sediment volume calculations were made at the sand placement area to inform stakeholders of the changes to the placed material that occur during the decadal simulation and to identify how much sediment material would be needed to maintain the initial seafloor elevation over time (table 5). These values indicate more sediment was needed for placement every two years in the ST2SL1 scenario than the ST3SL3 scenario, which is thought to be due to the differences in water levels between the scenarios, for example, larger SL in ST3SL3 reduced wave-bottom interaction in this area resulting in less erosion ( fig. 19C).  The results from restoration measure R4 scenarios show that beach nourishment east of Katrina Cut to Pelican Island and nourishment east of Pelican Island has a marked effect on subaerial island evolution, especially in the ST3SL3 scenario ( fig. 20). ST2SL1 results indicate there is more sediment deposition in front of the Katrina Cut rubble mound structure, which is likely from alongshore transport of eroded sediments that is east of this area where the nourishment was placed (figs. 20B and 20C). A more obvious effect was observed in the results of the ST3SL3 Figure 16. A, Initial elevation and depths, in meters, of R1 (similar to the no-action case [R0]). B, final elevation and depths, in meters, after the ST3SL3R1 scenario. C, Difference in final and initial elevation and depths, in meters, after the ST3SL3R1 scenario. Abbreviations: R1, restoration measure 1; ST3SL3, storminess bin 3 with sea level change 3; km, kilometers. Restoration measure R5 had nourishment of the back-barrier borrow pits (marsh areas) in Graveline and Aloe Bays and the island flat behind Katrina Cut (fig. 22A). The results of both scenarios (ST2SL1 and ST3SL3) for restoration measure R5 illustrate minimal difference compared to the no-action case (R0) (figs. 22 and 23), with only minor reworking by tidal action of the placed material. This is not surprising given the caveats of this modeling framework described in Mickey and others (2019), namely that back-barrier evolution of the island is limited due to the absence of localized winds in the model framework. Restoration measure R6 is similar to restoration measure R4, in that the area east of Katrina Cut was restored but it differs because the R6 measure is further landward than R4 ( fig. 24), which includes a restored frontal dune feature that is landward of the existing Gulf front infrastructure ( fig. 28). Results from both scenarios (ST2SL1R6 and ST3SL3R6) were similar to those of restoration measure R4 where there was increased sediment deposition in front of the Katrina Cut rubble mound for ST2SL1R6 and there was no breach east of the rubble mound for ST3SL3R6 (figs. 24B and 24D). The seventh restoration measure (R7) is a modified version of R6 that extends the beach and dune sediment nourishments west to the front side of the Katrina Cut rubble mound structure ( fig. 26). The results from ST2SL1R7 show that there are no major Figure 17. A, Initial elevation and depths, in meters, of R2. B, Final elevation and depths, in meters, after the ST2SL1R2 scenario. C, Difference in final and initial elevation and depths, in meters, of the ST2SL1R2 scenario. D, Final elevation and depths, in meters, after the ST3SL3R2 scenario. E, Difference in final and initial elevation and depths, in meters, of the ST3SL3R2 scenario. Abbreviations: R2, restoration measure 2; ST2SL1R2, storminess bin 2 with sea level change 1 and restoration measure 2; ST3SL3R2, storminess bin 3 with sea level change 3 and restoration measure 2; km, kilometers.  Figure 18. A, Difference in initial elevation and depths, in meters, between R2 and the no-action case (R0). B, Difference in final elevation and depths between the ST2SL1R2 and ST2SL1R0 scenarios. C, Difference in final elevation and depths between the ST3SL3R2 and ST3SL3R0 scenarios. Abbreviations: R0, no-action case; R2, restoration measure 2; ST2SL1R2, storminess bin 2 with sea level change 1 and restoration measure 2; ST3SL3R2, storminess bin 3 with sea level change 3 and restoration measure 2; km, kilometers. differences in the evolved island compared to the no-action case (R0) aside from the changes of the restoration itself ( fig. 27B). In contrast, the final DEM of the ST3SL3 scenario with restoration measure R7 in place illustrates how nourishment of the areas adjacent to and in front of the Katrina Cut rubble mound structure mitigated the occurrence of island breaches observed in the no-action case (R0) (figs. 26D and 27C). End-point erosion rates were calculated for both scenarios of restoration measures R4, R6, and R7 to determine the amount of sediment volume lost from the subaerial placement areas, as well as for combined subaerial and subaqueous volumes (table 6). Initial subaerial volumes within the design footprint were calculated as the volume of sediment above the 0-meter contour with increases in sea level (SL) accounted for in the different scenarios, which is why these values are different in the R4, R6, and R7 scenarios. For restoration measure R4 the values indicate that about 25 percent of the combined subaerial and subaqueous placement sediment was lost from the measure's footprint over the 10-year period for the ST2SL1 scenario, while about 37 percent of combined placement sediment was lost for the ST3SL3 scenario. End-point erosion rates calculated for restoration measure R6 reveal that 50 percent of the subaqueous and subaerial placement sediment was eroded out of the measure's footprint over the 10-year period in the ST2SL1 scenario, while almost 73 percent of the combined placement sediment was eroded out of the footprint during the ST3SL3 scenario. Restoration measure R7 had about 23 percent of the combined subaerial and subaqueous placement sediment eroded from the measure's footprint over the 10-year period in the ST2SL1 scenario, and 30 percent of the combined placement sediment was eroded out of the footprint during the ST3SL3 scenario.  Table 5. Sediment volume placement for restoration measure R3 for the ST2SL1R3 and ST3SL3R3 scenarios. [Abbreviations: R3, restoration measure 3; ST2SL1R3, storminess bin 2 with sea level change 1 and restoration measure 3; ST3SL3R3, storminess bin 3 with sea level change 3 and restoration measure 3; m 3 , cubic meters]  Figure 19. A, Difference in initial elevation and depths, in meters, between R3 and the no-action case (R0). B, Difference in final elevation and depths between the ST2SL1R3 and ST2SL1R0 scenarios. C, Difference in final elevation and depths between the ST3SL3R3 and ST3SL3R0 scenarios. Abbreviations: R0, no-action case; R3, restoration measure 3; ST2SL1R3, storminess bin 2 with sea level change 1 and restoration measure 3; ST3SL3R3, storminess bin 3 with sea level change 3 and restoration measure 3; km, kilometers.   A, Difference in initial elevation and depths, in meters, between R4 and the no-action case (R0). B, Difference in final elevation and depths between the ST2SL1R4 and ST2SL1R0 scenarios. C, Difference in final elevation and depths between the ST3SL3R4 and ST3SL3R0 scenarios. Abbreviations: R0, no-action case; R4, restoration measure 4; ST2SL1R4, storminess bin 2 with sea level change 1 and restoration measure 4; ST3SL3R4, storminess bin 3 with sea level change 3 and restoration measure 4; km, kilometers.  Figure 23. A, Difference in initial elevation and depths, in meters, between R5 and the no-action case (R0). B, Difference in final elevation and depths between the ST2SL1R5 and ST2SL1R0 scenarios. C, Difference in final elevation and depths between the ST3SL3R5 and ST3SL3R0 scenarios. Abbreviations: R0, no-action case; R5, restoration measure 5; ST2SL1R5, storminess bin 2 with sea level change 1 and restoration measure 5; ST3SL3R5, storminess bin 3 with sea level change 3 and restoration measure 5; km, kilometers.  Figure 25. A, Difference in initial elevation and depths, in meters, between R6 and the no-action case (R0). B, Difference in final elevation and depths between the ST2SL1R6 and ST2SL1R0 scenarios. C, Difference in final elevation and depths between the ST3SL3R6 and ST3SL3R0 scenarios. Abbreviations: R0, no-action case; R6, restoration measure 6; ST2SL1R6, storminess bin 2 with sea level change 1 and restoration measure 6; ST3SL3R6, storminess bin 3 with sea level change 3 and restoration measure 6; km, kilometers.  Figure 27. A, Difference in initial elevation and depths, in meters, between R7 and the no-action case (R0). B, Difference in final elevation and depths between the ST2SL1R7 and ST2SL1R0 scenarios. C, Difference in final elevation and depths between the ST3SL3R7 and ST3SL3R0 scenarios. Abbreviations: R0, no-action case; R7, restoration measure 7; ST2SL1R7, storminess bin 2 with sea level change 1 and restoration measure 7; ST3SL3R7, storminess bin 3 with sea level change 3 and restoration measure 7; km, kilometers. "}, {"section_title": "Restoration Measure Comparison", "text": "The results above illustrate the morphological response of Dauphin Island to the different 10-year scenarios and the varied restoration measures proposed. A comparative analysis of changes in island width along the narrow part of Dauphin Island show that both cross-shore processes and alongshore process contribute to island widening in different areas along the narrow portion of the island. For the ST2SL1 scenario simulated on all restoration measures there was a persistent increase in island width at the area where Pelican Island connects to the main Dauphin Figure 28. Initial elevation profiles from the no-action case (R0) and restoration measures R4, R6, and R7 for comparison of cross-shore differences. Note that the 0-meter (m) elevation (dashed black line in B through J) is based on the current mean sea level (in other words, no static rise). Abbreviations: No-Action, no-action case; mid, middle; R4, restoration measure 4; R6, restoration measure 6; ST2SL1, storminess bin 2 with sea level change 1; ST3SL3, storminess bin 3 with sea level change 3; km, kilometers; m, meters. Table 6. Initial placement volumes and endpoint erosion rates for the ST2SL1 and ST3SL3 scenarios simulated on restoration measures R4, R6, and R7. [Abbreviations: R4, R6, R7, restoration measures 4, 6, and 7, respectively; ST2SL1R4, ST2SL1R6, and ST2SL1R7, storminess bin 2 with sea level change 1 and restoration measures 4, 6, and 7, respectively; ST3SL3R4, ST3SL3R6, and ST3SL3R7, storminess bin 3 with sea level change 3 and restoration measure 4, 6, and 7, respectively; m 3 , cubic meters; m 3 /10 yrs, cubic meters per 10 years]   Figure 29. A, Alongshore profiles (red lines) measured to calculate the difference in the pre-and postscenario island width; profiles are spaced approximately 240 m apart. B, Difference in the final pre-and post-scenario island widths for all restoration measures (R2-R7) simulated with the ST2SL1 scenario. C, Difference in the final pre-and post-scenario island widths for all the restoration measures (R2-R7) simulated with the ST3SL3 scenario. D, Difference in the final post-scenario island widths of restoration measures R4, R6, and R7, and the post-scenario island widths of the no-action case (R0) simulated with the ST2SL1 scenario. E, Difference in the final post-scenario island widths of restoration measures R4, R6, and R7, and the post-scenario island widths of the no-action case (R0) simulated with the ST3SL3 scenario. Abbreviations: R0, no-action case; R2-R7, restoration measure 2-7; ST2SL1, storminess bin 2 with sea level change 1; ST3SL3, storminess bin 3 with sea level change 3; km, kilometers; m, meters. Island ( fig. 29B). Moving west, there is a trend of island narrowing likely related to the erosion and alongshore transport of beach sediment, which results in deposition at the area in front of the Katrina Cut rubble mound as indicated by a marked increase in island width at this location. Comparably, there is a substantial difference in island response relative to the area surrounding Katrina Cut ( fig. 29C) for the ST3SL3 scenario. As indicated in the previous section, the area adjacent to the eastern side of Katrina cut had a breach for all restoration measures except for R4, R6, and R7, which built up this area with a larger beach area and foredune structure. The R7 restoration measure was the only one not to breach on the western side of Katrina Cut as this restoration measure was extended further west compared to restoration measure R6. The western side of Dauphin Island had noticeable increases in island width in the ST3SL3 scenario than the ST2SL1 scenario for all restoration measures, which is due to the greater frequency of overwash in the higher magnitude scenario. These patterns of overwash and backshore sediment deposition can be observed in the various pre-and post-scenario plots of each restoration alternative in the previous section. The frequency of island overtopping has been found to be an important driver of morphological evolution for Dauphin Island in the past (Smith and others, 2018). Therefore, it is important to account for differences in overtopping as it relates to the proposed measures that restore the beach area and foredune features. Overtopping occurrence was taken from the XBeach model output by calculating the total number of hours that water levels were greater than the maximum island elevation at various areas around Dauphin and Pelican Island ( fig. 30). This analysis was performed for different areas depending on the restoration measure applied and included buffer zones east and west of restoration measures R4, R6, and R7. Calculations were performed on profiles along Pelican Island; on six profiles to compare R4, R6, and R7; and an additional eight profiles for restoration measure R2 that extends Pelican Island."}, {"section_title": "Scenario", "text": "The occurrence of overtopping for restoration measure R2 that extended the Pelican Island spit offshore varied alongshore ( fig. 31). For the ST2SL1 scenario compared to the no-action case (R0) there were only slight decreases in overtopping in the northern section, and only a few Figure 30. Indicated areas of overtopping analysis for restoration measures R2, R4, R6, and R7. All cross-shore profiles within the red and black lines were measured for overtop occurrence. Magenta lines indicate cross-shore profiles, relative to Pelican Island, measured for overtop occurrence. Abbreviations: R2, restoration measure 2; R4, restoration measure 4; R6, restoration measure 6; R7, restoration measure 7; km, kilometers. profiles with overtopping (although more hours of overtopping, potentially suggesting focusing of flow at these locations) in the restored portion ( fig. 31A). The ST3SL3 scenario had significantly higher occurrences of overtopping along the entire stretch of Pelican Island with higher frequencies in the northern, unrestored section and then decreasing south into the restored area ( fig. 31B). Figure 32 illustrates the occurrence of overtopping for restoration measures R4 and R6 throughout the ST2SL1 ( fig. 32A) and ST3SL3 (fig. 32B) scenarios. The figure highlights the areas that had less overtopping compared to the no-action case (R0). The results indicate that both restoration measures R4 and R6 had similar occurrence of overtopping in the lowlevel scenario compared to the no-action case (R0) for the alternative measure footprint and along Dauphin Island (note that the missing colored circles on 32A and 32B indicate 0 hours of overtopping). The ST3SL3 had many more hours of overtopping along the length of restoration Figure 31. A, Alongshore distribution, relative to Pelican Island, of the overtopping occurrence throughout the ST2SL1 scenario for the no-action case (R0) (left colored circles) and restoration measure R2 (right colored circles); black island outline (in A and B) reflects the 0.23-meter mean-high-water contour of restoration measure R2. B, Alongshore distribution of the overtopping occurrence throughout the ST3SL3 scenario for the no-action case (R0) (left colored circles) and restoration measure R2 (right colored circles). Note the difference in the occurrence (colored bar, at right) when comparing colored panels. Abbreviations: R2, restoration measure 2; ST2SL1, storminess bin 2 with sea level change 1; ST3SL3, storminess bin 3 with sea level change 3; km, kilometers. shows fewer hours of overtopping compared to the restoration measure R6, which is likely due to the configuration of the restoration measure having a higher foredune ( fig. 28). Similarly, both measures had more hours of overtopping on the southern portion of Pelican Island. Additionally, the occurrence of overtopping of restoration measures R3 and R5 were similar to those of the noaction case (R0) for all areas analyzed. The overtopping of restoration measure R7 throughout the ST2SL1 scenario was mitigated drastically by the extension of R7 past the Katrina Cut area ( fig. 33A). There was only one profile that experienced overtopping throughout the ST2SL1 scenario compared to restoration measure R6 where overtopping occurred over more hours at the Katrina Cut area. For the ST3SL3 scenario, there was a very similar pattern of overtopping along the narrow stretch of Dauphin Island east of Katrina Cut, with reduced overtopping for the Katrina Cut area compared to that of restoration measure R6 ( fig. 32B and 33B). These results indicate that the presence of the beach and foredune area seaward of the Katrina Cut rubble mound decreased the wave overtopping for both the simulated scenarios (ST2SL1 and ST3SL3). Again, overtopping of Pelican Island was similar to the results of restoration measures R4 and R6 for both the ST2SL1 and ST3SL3 scenarios. Figure 32. A, Alongshore distribution of the overtopping occurrence throughout the ST2SL1 scenario for the no-action case (R0) (bottom colored circles), restoration measures R4 (middle colored circles), and R6 (top colored circles); black island outline (in A and B) reflects the 0.23-meter mean-high-water contour of the no-action case (R0). B, Alongshore distribution of the overtopping occurrence throughout the ST3SL3 scenario for the no-action case (R0) (bottom colored panels), restoration measures R4 (middle colored panels), and R6 (top colored panels). Note the difference in occurrence (colored bar, at right) when comparing colored panels; additionally, gaps or missing circles indicate no overtopping occurred. Abbreviations: R4, restoration measure 4; R6, restoration measure 6; ST2SL1, storminess bin 2 with sea level change 1; ST3SL3, storminess bin 3 with sea level change 3; km, kilometers. "}, {"section_title": "Forecast Model Framework Summary", "text": "The decadal-scale coupled model framework developed using Delft3D, EDGR, and XBeach was applied to forecast the evolution of Dauphin Island, Alabama, with and without restoration measures (R2-R7) applied to the island configuration. The suite of storminess bins (1-4) generated along with sea level (SL) cases (1-3) were applied for 10-year simulations and all were initialized with the 2015 Dauphin Island configuration to determine the extent of island evolution over the range of conditions. Two scenarios, ST2SL1 and ST3SL3 were chosen for simulation of the six varied island restoration measures (R2-R7) to determine how these proposed changes would affect the island's evolution over the decadal timespan. This report has presented the decadal-scale framework and how each simulated scenario evolved Dauphin Island over a period of 10 years. Information on model input and output digital elevation models (DEMs) is available for download in Mickey and others (2020). Each restoration measure simulation's final DEM was passed on to habitat modeling specialists to describe habitat classes and model water quality for use in the habitat suitability for oysters and submerged aquatic vegetation (Enwright and others, 2020;Wang and others, 2020a, b). By using the coupled model framework that connects DEMs through the various models for long-term shoreline and subaqueous bathymetry change (Delft3D), dune recovery (EDGR), and tropical Figure 33. A, Alongshore distribution of the overtopping occurrence throughout the ST2SL1 scenario for the no-action case (R0) (bottom colored circles) and restoration measure R7 (top colored circles); black island outline (in A and B) reflects 0.23-meter mean-high-water contour of the no-action case (R0). B, Alongshore distribution of the overtopping occurrence throughout the ST3SL3 scenario for the no-action case (R0) (bottom colored circles) and restoration measure R7 (top colored circles). Note the difference in the occurrence (colored bar, at right) when comparing colored panels; additionally, gaps or missing circles indicate no overtopping occurred. Abbreviations: R7, restoration measure 7; ST2SL1, storminess bin 2 with sea level change 1; ST3SL3, storminess bin 3 with sea level change 3; km, kilometers. storm impacts (XBeach), this study has illustrated that island elevations and configurations can be evolved over a timescale appropriate for a variety of restoration projects and management decisions."}]