[{"section_title": "Abstract", "text": "The present paper aims to discuss how data from international large-scale assessments (ILSAs) can be utilized and combined, even with other existing data sources, in order to monitor educational outcomes and study the effectiveness of educational systems. We consider different purposes of linking data, namely, extending outcomes measures, analyzing differences over time or across cohorts, and supplementing context information. These linking strategies are illustrated by a non-exhaustive selection of studies that exploited ILSAs to investigate a wide range of educational topics. We conclude that the main contribution of ILSA to educational research lies in the ways they facilitate analyses of educational policy and policy-related issues at the institutional level by means of cross-country analyses.\nHowever, the scope of these studies also covers high-quality data on lower levels of the educational system."}, {"section_title": "Introduction", "text": "International large-scale assessments (ILSAs) generate data that can be used to make generalized descriptions of educational outcomes across countries. ILSAs also collect context information at different stages and levels of educational systems. In this context, \"stages\" refer to educational stages such as early childhood education, primary education, lower secondary education and so forth, and \"levels\" describe the multilevel structure of educational systems where, for example, children are nested within classrooms that are in turn nested within schools and so forth. This data can be used to investigate the determinants (e.g., class size effects on educational outcomes) and consequences (e.g., economic returns to educational outcomes) for the observed differences in educational outcomes. Against this backdrop, the purpose of the present paper is to review how different ILSA data sources can be combined to investigate educational research questions. Notice that we will not discuss ILSA's impact on policy-making in this paper (e.g., Breadspear, 2012; Grek, 2009; Meyer & Benavot, 2013) , but the kinds of research questions that can be addressed based on the combination of different ILSA data sources. The combination of data may not only be based on data from within ILSAs (i.e., test scores and survey data), but may involve external data sources that provide additional information on educational systems and other societal issues (e.g., GDP).\nIn particular, we argue that combinations of the data from different sources provide opportunities to address research questions that cannot be assessed without the data from ILSAs. To illustrate such studies, we will present a selection of studies and describe how they exploited the potential of ILSAs to address questions in the context of education research."}, {"section_title": "The Origin of International Large-scale Assessments", "text": "To understand how international large-scale assessments contribute to educational research, it is worthwhile remembering the origin of the first international assessments. In the last century, international comparative research has become increasingly popular in social policy analysis. Although education has not been central to this field, its role for economic development and social mobility was studied extensively (e.g., Barro, 1991; Shavit & Blossfeld, 1993) . For this purpose, scholars relied on measures that quantified participation in education such as the number of years of schooling or the proportion of an age group enrolled at various levels of the educational system. Internationally comparable data on these measures were already available through policy documents or national statistical institutes in many countries. Over the years, however, it has increasingly been recognized that what students learn within countries might be quite different across countries (e.g., Anderson, 1961; Postlethweight, 1995) . In 1958, a group of researchers met at the UNESCO Institute for Education (UIE) in Hamburg to discuss the possibility to extend the existing comparative research on education by measures of learning outcomes. The basic ideas were to conduct a study with some 'objective indicators' of educational outcomes measured by means of internationally comparable tests and questionnaires, and to use these quality indicators to investigate which institutional features of educational systems facilitate student learning. The researchers decided to undertake an international pilot study in different regions and languages around the world in order to explore if an ILSA is feasible. As the international administration proved to be practicable, and the study produced meaningful results, the same group of researchers conducted a full-scale study with rigorous sampling criteria and refined procedures for the development of the survey and test instruments (Foshay, Thorndike, Hotyat, Pidgeon, & Walker, 1962; Husén, 1967) . Design and procedures of ILSAs have been further developed since then; more than 50 studies with up to 70 participating countries followed the pilot (Hanushek & Woessmann, 2011; Papanastasiou, Plomp, & Papanastasiou, 2011) . The largest assessments cover mathematics, reading, and science; fewer and smaller focus on civic and citizenship education, computer and information literacy, and foreign language education; some areas of history, literature education, arts, religious studies, and social science are (currently) not well represented (see Meyer, Strietholt, & Hal-Levi, forthcoming) ."}, {"section_title": "Comparability is the Heart of the Studies", "text": "The core feature of ILSAs is that they are designed to establish comparability across countries. Comparability refers to the population under investigation and the cross-cultural validity of the instruments. International comparisons are biased if the respective samples are not balanced in terms of both age and schooling (Strietholt, Rosén, & Bos, 2013) . For this reason, these studies define the target population precisely, apply a rigorous sampling strategy, and synchronize the months of test administration to ensure a high degree of comparability. Further, ILSAs have comprehensive quality monitoring, carefully developed assessment frameworks that are meaningful in a wide range of countries, translation verifications, and standardized administration procedures to ensure a cross-cultural validity of the instruments and measurement procedures.\nBefore we elaborate on the potential ILSAs provide for educational research, we briefly bring to attention the different sets of measures these studies collect (see also McDonnell, 1995; Strietholt, Gustafsson, Rosén, & Bos, 2014; Travers & Westbury, 1989) .\nInformation on the different levels of the educational systems is collected from students, their parents, teachers, and principals, as well as from the national research coordinators by means of standardized achievement tests, questionnaires, and reports. National research coordinators prepare country reports and complete contextual questionnaires on the contents of test items included in national curricula, the structure and organization of the school system, national examinations, teacher certification etc. Further, aggregated data from lower levels can be used to describe, for example, the social structure in a country. Principals and teachers complete questionnaires on educational settings to survey information on school and classroom conditions and processes including school features such as leadership, public or privately operated, what is actually taught in individual classrooms, who teaches it, and how it is taught. Aggregated data from students or their parents can be used to describe, for example, the social composition of schools. Students and their parents are surveyed about the socioeconomic status, migration background, parental support, and other home factors that affect student learning. Lastly, students are tested to gather information on what they have actually learned and what they think about it.\nThe development of the achievement tests and scores has received special attention to ensure high psychometric quality standards for valid comparisons of educational systems worldwide (e.g., Davier, Gonzalez, & Mislevy, 2009 ). However, educational outcomes and contexts for learning are not only measured by achievement tests, they are also measured by background questionnaires. Given that researchers have pointed to the lack of standardization in the assessment instruments used in different studies in educational research (e.g., Breen, Luikx, Müller, & Pollack, 2009; Klieme, 2013) , ILSAs use the same scales or items across countries. This is in fact an attractive feature because they facilitate comparable measures of complex constructs such as socioeconomic status, instructional quality, or school autonomy.\nInternational assessments have traditionally administered paper-based assessments; however, since recently, PISA provided opportunities to take computer-based tests. These tests enable the collection of process (or log file) data and therefore provide another rich data source for educational studies, for example, on response times or processes (Greiff, Niepel, Scherer, & Martin, 2016) ."}, {"section_title": "ILSAs as Sources of Research Data", "text": "ILSAs assemble a wide range of information on educational outcomes and contexts for learning, yet no single study captures all educational measures. For this reason, the combination of the data from different sources promises interesting research designs that allow researchers to approach educational issues that cannot be addressed within a single study. To explore the scope of research questions that can be studied based on the data from ILSAs, we first propose that it is possible to identify at least three different purposes of combining different data sources. Thereafter, we use Bray and Thomas' (1995) "}, {"section_title": "Purposes of Linking", "text": "Study differences over time or across cohorts. Some studies focus on multiple grades and/or are conducted repeatedly, such that is it possible to combine data from the same 'source study'. For example, the Trends in International Mathematics and Science Study (TIMSS) was introduced in 1995 to assess educational outcomes in primary, secondary, and upper secondary school, and it is repeated in a four-year cycle. With such complex study designs, researchers can exploit variation across multiple educational stages (e.g., Hanushek & Woessmann, 2006) and over time (Rosén & Gustafsson, 2016) . Moreover, they allow researchers to apply so-called \"fixed-effects models\" to make causal claims about the effects of certain features of the educational system on educational outcomes (see Schlotter, Schwerdt, & Woessmann, 2011 , for a discussion of the methodological advantages of such research designs). It is also possible to combine the data from different ILSAs. A recent study linked the achievement tests of the Progress in International Reading Literacy Study (PIRLS 2011 (PIRLS /2006 (PIRLS /2001 , the Reading Literacy Study (2001/1991) , and the Reading Comprehension Study (1971) in order to measure international trends in students' reading achievement at the end of primary school over 40 years (Strietholt & Rosén, 2016) ."}, {"section_title": "Extend outcome measures.", "text": "Information from ILSAs on different domains can be combined to capture a more comprehensive picture of educational outcomes. For example, Martin, Foy, Mullis, and O'Dwyer (2013; see below) combined TIMSS and PIRLS data to compare the relationships between student achievement and a set of covariates in reading, mathematics, and science. On the basis of these data, they were able to disentangle the degree of domain specificity in these relationships. Besides this, the availability of multiple outcome domains is also attractive from a methodological standpoint, because it is possible to relate within-student between-outcome differences to instructional practices in order to overcome bias from unobserved student variables. Schwerdt and Wuppermann (2011) provided an example for this analytical strategy. They compared how well students perform in mathematics and science and combined this information with survey data on the instructional practices of their teachers in both domains."}, {"section_title": "Supplement context information.", "text": "Another purpose of combining different data sources is to supplement outcome measures from ILSAs with context information from other sources such as international databases (e.g., UNESCO, World Bank) or surveys. For instance, some ILSAs primarily focus on the assessment of student achievement without administering questionnaires to teachers; in the cases where they administer them, these questionnaires may not necessarily capture teacher constructs that are highly relevant for student learning. In this regard, further international studies on teachers and teacher education such as TALIS (Teaching and Learning International Survey) and TEDS-M (Teacher Education and Development Study in Mathematics) come into play, because they facilitate such information, and-combined with student data-extend the scope of ILSAs. Hanushek and Woessmann (2012) provided another example on the association between student achievement and economic growth. The authors combined various ILSAs with external data on growth in gross domestic product (GDP).\nThese and other combinations of individual and institutional data from various sources will be illustrated in a collection of example studies in the following section."}, {"section_title": "Topics of Investigation", "text": "The vast amount of data that has been amassed in ILSAs makes it possible to address a wide range of educational issues including descriptions of differences in educational outcomes within and between countries, as well as studies on the determinants and consequences of the observed differences. Bray and Thomas (1995) provide a useful framework to organize this research in comparative education analyses. They propose a threedimensional classification of comparative, educational research with regard to (a) geographical/locational levels, (b) nonlocational demographic groups, and (c) aspects of education and society. Figure 1 shows an adapted version of the cube that was originally presented by Bray and Thomas (1995) . Comparative research projects that make use of ILSA data concern all three dimensions, and can therefore be located in at least one cell of the cube.\nAs an example of how a research project can be located in this cube, the shaded cells refer to a study that compares how instructional practices in Norway and Sweden impact student achievement.\n<Insert Figure 1 about here> It is worth noting that educational systems have a multilevel structure-students are nested within classrooms, classrooms are nested within schools, and so forth. Although educational policies are typically located at higher levels, they also manifest on lower levels.\nIn other words, educational outcomes result from complex interactions between different educational actors such as policy makers, principals, teachers, parents, and students on the one hand, and different contexts such as families, classrooms, schools, and governments on the other hand (Klieme, 2013) . For this reason, multilevel analyses are required to study direct, mediating, and moderating effects at the various levels to understand the complex mechanisms in effect between educational policies, learning processes, and outcomes, or, in other words, to understand what works for whom in what circumstances (see Pawson & Tilley, 1997) . In this context, it is clear that any comparative study has to limit their scope, but the distinction between geographical/locational levels, nonlocational demographic groups, and different aspects of education and of society provides at least a framework to recognize limitations of the phenomena a study addresses and to identify the mutual influences of other layers and levels (Bray & Thomas, 1995; Bray, Adamson, & Mason, 2007) ."}, {"section_title": "Examples of Studies Based on ILSA Data", "text": "In this section, we illustrate the potential of combining data that were obtained from different large-scale studies or different cycles of the same studies. We will showcase a selection of studies and describe how they exploited the potential of ILSAs to address relevant research questions in the contexts of school effectiveness, students' performance and behavior in achievement tests, and effects of home background variables on achievement. Specifically, we classify the data sources, purposes of linking, and topics of investigation according to Bray and Thomas' framework.\nBibliographic analyses of the representation of PISA (Domínguez , Vieira, & Vidal, 2012) and PIRLS (Lenkeit, Chan, Hopfenbeck, & Braid, 2015) in scientific journals indicate that ILSA data are increasingly utilized by researchers from different countries and diverse disciplinary backgrounds for methodologically as well as substantively oriented studies. Our research adds to this research in that we emphasis on the combination of data source and classify the topics based on a predefined framework. In this respect, we chose seven recent studies -published between 2012 to 2016 -that represent different linking strategies and diverse research topics. It is important to note that our selection of studies is by no means exhaustive. We rather aim to identify a set of studies we consider suitable to exemplify the range of linking strategies and areas of investigation that can be addressed with ILSA data.\nBesides, this section is aimed at encouraging researchers to combine different data sources on the one hand and different data levels of educational systems on the other hand. To this end, we provide a somewhat more extended description of the respective studies. Table 1 shows that secondary analyses of ILSAs made use of the data to address a quite diverse range of research topics. The studies utilized not only data from recent assessments such as PIRLS, PISA, and TIMSS but also data from previous studies that have been conducted in the 1960s, 70s, 80s, and 90s. With regards to the different purposes of linking, our selection of studies covers examples that combine data from different sources to extend outcome measures, study differences over time and across cohorts, and supplement contextual information. Furthermore, our overview shows that ILSA data have been used to study learning processes, management and organization, and society and labor market related issues for different social, ethnic, and gender groups as well as for entire populations, and are located on individual, classroom, school, country, and world region levels. In other words, the few studies listed in Table 1 demonstrate that ILSA data have the potential to study all geographical/locational levels, nonlocational demographic groups, and aspects of education and society, as proposed by Bray and Thomas (1995) . In the remaining part of this section, we will encapsulate research goals, processes of data combination, methodological approaches, and main findings of the seven studies.\n<Insert Table 1 There is no ILSA that captures the three core-subjects mathematics, reading, and science simultaneously in primary school. The combination of TIMSS and PIRLS data, however, provides a unique opportunity to extent the outcome measures of the respective studies to not only examine the relations among achievement in three domains but also to study whether or not differential effects of school-related learning processes can be identified across domains. Information on learning processes was surveyed from principals, teachers, and students; student and teacher data were aggregated at the school level. The study shows how ILSA data can be used to examine the whether research findings can be replicated across countries and domains.\nResearch goals. The goals of this study were to examine how school variables relate to student achievement across the three domains for all countries participating in PIRLS and TIMSS jointly.\nProcess of data combination. In 2011, 34 countries and three of the sub-national entities agreed on participating in both TIMSS and PIRLS jointly and to administer the corresponding test material to the same students . As a consequence, for these fourth-grade students, data on their achievement in three domains -mathematics, science, and reading -and information on their motivation, self-perceptions, and perceptions of classroom instruction were available (Scherer & Gustafsson, 2015) . The fact that the same student participated in both studies ruled out major, alternative explanations for differences across outcome domains that were related to person characteristics or sampling error. Since both large-scale studies were administered to the same students, the process of data combination was based on the student level; data linking was finally conducted with the help of unique student identification numbers that reoccurred in both TIMSS and PIRLS 2011.\nMethodological approach. In order to achieve the above mentioned research goal, multilevel modeling was conducted to account for the hierarchical data structures in TIMSS and PIRLS with students as individual units of analysis and schools as aggregated units of analysis. Martin, Foy, Mullis, and O'Dwyer (2013) chose factors describing the school environment (e.g., safety in schools, emphasis on academic success), school instruction (e.g., teacher support), and students' home background (e.g., home resources for learning). These country-by-country analyses resulted in contextual effects. Achievement scores in the three domains served as outcome variables."}, {"section_title": "Main findings. Exploiting the potential of the TIMSS & PIRLS 2011 link, the authors", "text": "found large country differences in the relations among home and school contextual variables and achievement. For example, the home background explained between less than 10% and more than 40% in the total variation of the achievement scores. Interestingly, there was a considerable degree of stability across the domains of mathematics, science, and reading within countries.\nLinking different study cycles and levels of analysis to study change: Relations between schools' emphasis on academic success and changes in science performance in Norway (Nilsen & Gustafsson, 2014) Particularly for countries that do not conduct national assessments, ILSAs sometimes provide the only databases to trace developments in educational outcomes and learning contexts. Although this is not necessarily the case for Norway, this study investigated if change in schools' emphasis on academic skills caused the recent rise in science performance of Norwegian students, and illustrates how different cycles of the same study can be combined at the item level, thereby treating the cycles as groups. This approach allows researchers to investigate differences in relations among constructs or their means within a country. In this context, it is worth mentioning that this study ensured the comparability of the measures used in these cycles by examining specific levels of measurement invariance (see also Millsap, 2011) .\nResearch goals. This study fed into research on school effectiveness by examining:\n(a) the differences in aspects of teachers' perceived school emphasis on academic success (SEAS) between the TIMSS cycles that were conducted in 2007 and 2011; (b) the relation between these SEAS and differences in students' science achievement; (c) the relations described under (b) after controlling for students' background variables.\nProcess of data combination. In order to address the aforementioned research agenda, Nilsen and Gustafsson (2014) Main findings. The authors found that differences in students' science performance were fully mediated by SEAS, thus suggesting that SEAS and changes in science performance were associated.\nAnalyzing log files to understand how children solve complex problems (Greiff, Wüstenberg, & Avvisati, 2015) Greiff et al.'s (2015) study points to the potential of log file data, made available by computer-based assessments, that can be exploited to inform analysts about the processes of solving a task beyond students' performance. Their study showcases how different kinds of individual, computer-derived assessment data can be combined within a single study. Given the richness of such log-file data, future large-scale assessments may benefit from the additional information on students' behavior to better understand and describe students' performance (Quellmalz et al., 2012) .\nResearch goals. This study demonstrates how data on students' performance can be enhanced by behavioral data obtained from log files. Specifically, the authors sought to describe the processes and strategies of solving complex problems in a computer-based assessment in addition to the mere performance measures such as overall proficiency scores and single item scores. In this respect, Greiff et al. (2015) focused on one of the most prominent strategies of vary-one-thing-at-a-time (VOTAT), with which the specific relations among variables could be disentangled systematically (Schwichow, Croker, Zimmerman, Höffler, & Härtig, 2016; Tschirgi, 1980) ."}, {"section_title": "Process of data combination. The OECD Programme for International Student", "text": "Assessment (PISA) 2012 administered computer-based assessments of creative problem solving to about 85,000 15-years old students in 44 countries. Students' individual performance data on a specific problem solving item, Climate control, and the corresponding log files on their behavior within the computer-based assessment were used in this study. The latter contained all information on observable behavior, such as the VOTAT strategy, the number of clicks, response times, and the sequence of actions. Greiff et al. (2015) examined these data at both the individual and the country level. Data from the different sources were directly combined at the individual (student) level. The OECD provided separate data files on students' performance and their log file data, which were linked via students' unique identification numbers in the data sets.\nMethodological approach. The authors tracked the application of the VOTAT strategy for each student and generated further dichotomous indicators to categorize whether or not students mastered the Climate control task. The correlations between these indicators to students' performance on the task (0 = incorrect, 1 = correct) and the overall, creative problem solving performance, as indicated by plausible values, were estimated. Frequencies and percentages were transformed and subsequently aggregated to the country level.\nMain findings. Greiff et al. (2015) found that the individual students' performance of the VOTAT strategy was significantly and positively related to performance on the Climate control item and the overall problem solving score. Moreover, the authors were able to identify different mastery levels that described students' performance on the selected item on the one hand, and the successful or unsuccessful application of VOTAT in order to solve this item on the other hand. At the country level, high correlations between the frequency of VOTAT and the overall problem solving performance were found."}, {"section_title": "Consequences of technological change for reading achievement: Country-level longitudinal evidence (Rosén & Gustafsson, 2016)", "text": "This study shows how the trend design within a study can be exploited in order to draw causal inferences on differences in variables over time (Gustafsson, 2007) . Using a difference-in-differences approach and controlling for cofounding variables at the same time provided strong support for the causal claim. Besides the opportunity to study causality with observational data to some extent, the repeated and linked design of PIRLS allows researchers to investigate research questions longitudinally at the country level. Nevertheless, this design does not permit inferences about intra-individual change, but rather changes over time within a country. The latter has the potential to inform researchers and policy-makers about changes in student achievement and possible explanatory variables thereof.\nResearch goals. The goal of this study was to examine the causal effect of computer availability at home and reading achievement for fourth grade students. Specifically, Rosén and Gustafsson (2016) investigated the relation between changes in computer availability and changes in students' reading achievement between 1991 and 2006 in order to disentangle causal effects and interaction effects with students' background.\nProcess of data combination. Rosén and Gustafsson (2016) Nilsen and Gustafsson (2014) study, the data obtained from the different studies were combined at the item and construct level, resulting in datasets that considered the different studies as grouping variables. This process of data combination was conducted for each country which participated in either of the two study cycles. Each of the achievement scores were considered to be comparable between the cycles of the Reading Literacy Study and PIRLS. In fact, similarly to TIMSS, the latter followed a common item design and allowed for a concurrent calibration of items between PIRLS 2001 and PIRLS 2006 (Martin, Mullis, & Kennedy, 2007) .\nMethodological approach. The analyses mainly focused on the country level.\nSpecifically, Rosén and Gustafsson (2016) were aimed at relating changes in computer availability at home to changes in students' reading achievement across all participating countries. Hence, they took a difference-in-differences approach, and specified it as a regression model with fixed country effects.\nMain findings. The authors found a negative effect of home computer availability on student achievement in reading for the two types of studies across countries. They concluded that this effect can be, at least to some extent, interpreted causally."}, {"section_title": "Linking different studies and levels of analysis: Examining the school context and its influence on teachers (Austin et al., 2015)", "text": "Austin et al.'s (2015) study shows how two large-scale assessments that provided information on different actors and levels of education (i.e., students and teachers) can be combined in order to disentangle factors determining teacher variables. The major strength of this link is that both the teacher and the student samples were representative for the participating schools. This study further shows how contextual and climate effects can be studied with teachers in the main focus. Nevertheless, although an almost direct link between the two samples could be established at the school level, findings relevant for educational effectiveness -for example, with respect to how teaching practices and beliefs relate to student achievement and motivation -must be interpreted with caution, given that teachers and students did not necessarily belong to the same classrooms (Klieme, 2013) . But clearly, the TALIS-PISA link allows researchers, school developers, and other relevant stakeholders to examine school contexts from the perspective of both teachers and students.\nResearch goals. The authors of this OECD working paper combined data from the two international large-scale assessments, the Teaching and Learning International Survey (TALIS) 2013 and PISA 2012. Their main goal was to explore the extent to which school context variables relate to various teacher variables such as their professional development, teaching practices and beliefs, teacher cooperation, teacher self-efficacy, and job satisfaction.\nMoreover, Austin et al. (2015) intended to describe profiles of schools and teachers with respect to the above mentioned variables.\nProcess of data combination. In total, the teacher sample comprised about 26,600 teachers who participated in TALIS 2013 and about 103,000 students who participated in PISA 2012. Teachers and students belonged to the same schools in nine countries. It is noteworthy that this linking study focused on mathematics teachers only, as PISA 2012 chose mathematics as the major domain. Both the teacher and student samples were representative of teachers and students within schools. The TALIS-PISA linking was conducted already in the design and administration of the study; teachers and students in the same schools were assigned to the same school identification number, such that a direct link at the school level could be established.\n1 As a consequence, Austin et al. (2015) catered their analytic approach to the school level.\nMethodological approach. Student data obtained from PISA 2012 were aggregated to the school level; hence, all analyses were conducted for schools within a country. The authors specified multilevel regression models (individual level: teachers, aggregated level: schools) and quantified cross-country variation in the resultant regression coefficients.\nMain findings. Austin et al. (2015) identified considerable variation in the extent to which teacher and student variables were related. For instance, they found a significant relation between students' average economic, social, and cultural status (ESCS) and teachers' engagement in professional development activities with varying directions of this relation.\nNevertheless, a number of relations and profiles could be identified that were by and large consistent across countries. For instance, teachers' domain-specific self-efficacy in teaching mathematics was lower than their domain-general self-efficacy. Austin et al. (2015) concluded their presentation of results with the finding that teachers in schools in which a high variability of PISA scores existed showed higher domain-general self-efficacy in teaching than those in schools with less variability. Further results were presented and discussed in the working paper."}, {"section_title": "Education and economic growth (Hanushek & Woessmann, 2012)", "text": "How can ILSAs be combined with other (non-educational) international databases?\nThe example presented here goes back to a classic issue in comparative research, that is, the role of education for economic development. Economists observed a considerable international variation in economic growth during the second half of the last century. Most previous cross-country research regressed economic growth on the number of years of schooling. Unlike this research, Hanushek and Woessmann's (2012) study demonstrated how ILSA data supplement information from other data sources on economic development.\nidentification of schools which participated in both studies. For a more detailed discussion on data fusion approaches, we refer the reader to Kaplan and McCarty (2013) .\nResearch goals. The study aimed at estimating the effect of education on economic growth. It recaptured the idea that students within countries might be quite different across countries, and replaced the number of years of schooling by how well countries perform in various ILSAs.\nProcess of data combination. The Penn World Table ( PWT) is a database that has provided information on annual growth in real per capita gross domestic product (GDP) since the 1950s for more than 150 countries (Feenstra, Inklaar, & Timmer, 2015) . Information on student performance was taken from not less than twelve ILSAs that have been conducted between 1964 and 2002 (see the overview in Table 1 ). A very interesting feature of Hanushek and Woessmann's study is that the achievement scales of the respective ILSA were linked through a linear equating approach which was based on the National Assessment of Educational Progress (NAEP) in the US. Data on performance and growth was combined at the country level using the country names for the linking. The authors identified 50 countries with information on both student achievement (ILSAs) and economic growth (PWT). In further analyses, the authors aggregated the country level data on world region level such as Central Europe, Latin America, the Middle East, and North Africa.\nMethodological approach. The basic analysis model was a regression model at the country level with a sample size of 50. Specifically, the authors regressed the average annual growth rate in GDP on the average performance level across the different ILSAs. Extensive sensitivity analyses included the number of years of schooling and other covariates.\nMain findings. The study showed that student achievement was a strong predictor of economic growth at the country level and an even stronger predictor at the level of world regions. The effect of years of schooling became insignificant after accounting for student achievement. This finding indicated that a mere quantitative extension of schooling is ineffective for boosting economic growth."}, {"section_title": "Early tracking and the migrant-native achievement gap (Ruhose & Schwerdt, 2016)", "text": "Our final example refers to a study that supplements ILSA data on inequality in educational outcomes by UNESCO data on school structure, with the aim of examining if early educational tracking affects the emergence of the migrant-native achievement gap.\nFurthermore, the study highlights an interesting methodology, because it combines the data from various ILSAs to capture educational outcomes at different educational stages. The basic idea was to observe two samples of the same cohort of students in primary and secondary school in order to analyze differences in the achievement gap across educational stages.\nResearch goals. After primary education, some countries select students into schools according to their abilities (i.e., ability grouping), others have a comprehensive secondary school system. This study aimed to identify the causal effect of tracking on the achievement gap between migrant and native students.\nProcess of data combination. Achievement data from all previous PIRLS, PISA, and TIMSS cycles were used to trace changes in the migrant-native achievement gap at different educational stages in 45 countries. These studies were linked in such a way that they covered the same outcomes measure in primary and secondary education. Methodological approach. Because the size of the migrant-native achievement gap may vary across countries for multiple reasons, Ruhose and Schwerdt employed a differences-in-differences strategy to identify the causal effect of early tracking. Their analytical approach was based on the observation that no country tracks students in primary school. Thus, information on the size of the achievement gap prior to and after tracking was available for all countries. A differences-in-differences model addressed whether change in the achievement gap was related to different tracking policies, while eliminating bias from time-invariant confounding variables.\nMain findings. The study suggested that early tracking does not significantly affect migrant-native achievement gaps. Several robustness checks confirmed this overall pattern.\nThe authors concluded that the differences-in-differences analyses that were based on different educational stages allowed them to draw causal inferences."}, {"section_title": "Conclusions Exploit Variation in Institutional and Societal Features", "text": "Our reflections on ILSAs and the studies that utilize their data illustrated how international assessments contribute to educational research. It is worthwhile emphasizing that the contributions of ILSA to educational research are related to the research opportunities of international comparative research in general, and that is that such studies facilitate the analyses of variation as well as similarities across countries. Henceforth, an important contribution of international comparative studies to the research on education is the possibility to observe and exploit variation in educational and societal features at the level of countries or world regions. The analyses of the effect of educational outcomes on economic growth, the consequences of technological change and reading performance, and the impact of tracking on educational inequality are three examples for such studies."}, {"section_title": "Investigate Generalizability Across Different Countries", "text": "A second contribution of ILSA is the opportunity to test hypotheses about the relations between variables observed at lower levels of the educational system for different countries.\nThe set of home background variables Martin, Foy, Mullis, and O'Dwyer (2013) considered in their study explain between less than 10% and more than 40% of the variance in student performance in the respective countries. This huge variation points to the limited generalizability of the findings from individual countries. At the same time, this variation raises new questions about the role of variables on higher levels of the educational systems, that is, for multilevel analyses on moderation and cross-level interaction effects. These are important pieces of information in the process of theory development. For example, Coleman et al. (1968) argued that the effect of schooling on academic achievement is less than that of family background. Heyneman and Loxley (1983) replicated these analyses for a diverse set of countries with ILSA data from outside the United States. They found that schooling outweighs the impact of family background in low-income countries. Subsequent research hypothesized that increasing access to school though mass schooling has diminished the impact of schooling on achievement because there is little variation in schooling within countries (e.g., Baker, Goesling, & LeTendre, 2002) ."}, {"section_title": "Wide Range of Research Topics", "text": "The value of international assessment for educational research may also be evaluated with respect to the educational issues addressed in studies based upon data from ILSAs. In this regard, we presented seven illustrative examples; interestingly, however, even these few studies cover all the geographical/locational levels, nonlocational demographic groups, and aspects of education and society proposed by Bray and Thomas (1995) . As mentioned in the previous section, we believe that the true value of international studies is that they enable comparative research that incorporates the country level to understand effective learning conditions and educational policies. The wide coverage of educational issues addressed in secondary analyses of their data, however, further underlines the capacity of ILSA. "}, {"section_title": "Combined Data from Different Sources Facilitate Innovative Research Designs", "text": ""}, {"section_title": "Address Methodological Limitations", "text": "The described potential of ILSA as research data may create the impression that sophisticated and meaningful analyses are unproblematic and firmly established. Yet, it is important to highlight the limitations of the usage of ILSA. International comparisons and trend studies derive from the assumption that there are comparable groups of students in the respective samples. However, due to differences in the school entry ages across countries, the samples in ILSA typically cover students that differ either in terms of age, grade, or both (e.g., Strietholt, Rosén, & Bos, 2013) . Such differences can be even larger with the combined data from different studies (e.g., age-based PISA and grade-based PIRLS samples).\nParticipation and exclusion rates represent further issues (L. Rutkowski & D. Rutkowski, D, 2016) . With regard to the measures used in ILSAs, meaningful comparisons across countries also presume that the measurement of the tertium comparationis--that is the quality that countries which are being compared have in common--is reliable and valid across countries.\nCritics have argued that the social and cultural pluralism in the construction of education is compressed into a single point in ILSA (e.g., Meyer & Benavot, 2013; Torrance, Lauder, Brown, Dilabough, & Halsey, 2006) and that these scores are subject to methodological limitations (e.g., D. Rutkowski and L. Rutkowski, 2010) . These limitations are contentious issues in the literature based on ILSA (Domínguez, Vieira, & Vidal, 2012; Lenkeit, Chan, Hopfenbeck, & Braid, 2015) and we recommend that researchers recognize them when analyzing ISLA data and conduct, if possible, robustness checks."}, {"section_title": "Scope of the Present Paper and Outlook", "text": "A limitation of the present paper concerns the selection of studies we presented here to illustrate how ILSAs are used as research data. Our selection of studies may to demonstrate that meaningful combinations of data from ILSA and other sources are possible and that a wide range of topics can be addressed based on this data. However, this selection is not representative for all secondary analyses of ILSA. Although existing research in this area already provides detailed bibliographic information such as publication year, journal, authors' affiliation, the classification of specific topics is rather broad and based on ad hoc developed classification schemes (Domínguez , Vieira, & Vidal, 2012; Lenkeit, Chan, Hopfenbeck, & Braid, 2015) . In addition to this research, it would be interesting to classify a representative set of studies based on an existing classification scheme-such as the one presented by Bray and Thomas (1995)-to understand not only how frequent specific topics have been addressed but also to identify areas that are not well represented. "}]