[{"section_title": "Abstract", "text": "Neuroimaging studies in schizophrenia have linked elevated glutamate metabolite levels to non-remission following antipsychotic treatment, and also indicate that antipsychotics can reduce glutamate metabolite levels. However, the relationship between symptomatic reduction and change in glutamate during initial antipsychotic treatment is unclear. Here we report proton magnetic resonance spectroscopy (1H-MRS) measurements of Glx and glutamate in the anterior cingulate cortex (ACC) and thalamus in patients with first episode psychosis (n = 23) at clinical presentation, and after 6 weeks and 9 months of treatment with antipsychotic medication. At 9 months, patients were classified into Remission (n = 12) and Non-Remission (n = 11) subgroups. Healthy volunteers (n = 15) were scanned at the same three time-points. In the thalamus, Glx varied over time according to remission status (P = 0.020). This reflected an increase in Glx between 6 weeks and 9 months in the Non-Remission subgroup that was not evident in the Remission subgroup (P = 0.031). In addition, the change in Glx in the thalamus over the 9 months of treatment was positively correlated with the change in the severity of Positive and Negative Syndrome Scale (PANSS) positive, total and general symptoms (P<0.05). There were no significant effects of group or time on glutamate metabolites in the ACC, and no differences between either patient subgroup and healthy volunteers. These data suggest that the nature of the response to antipsychotic medication may be related to the pattern of changes in glutamatergic metabolite levels over the course of treatment. Specifically, longitudinal reductions in thalamic Glx levels following antipsychotic treatment are associated with symptomatic improvement.\nnpj Schizophrenia (2019) 5:12 ; https://doi."}, {"section_title": "INTRODUCTION", "text": "In around one-third of patients with schizophrenia, treatment with antipsychotic medication is ineffective, 1-3 but the underlying neurobiological mechanisms of treatment response are not well understood. Schizophrenia is associated with disruptions in brain glutamatergic neurotransmission, 4, 5 and recent neuroimaging studies have indicated that the nature of the antipsychotic response may be related to brain glutamate levels. [6] [7] [8] [9] [10] [11] In patients with first episode psychosis prior to treatment, elevated glutamate in the anterior cingulate cortex (ACC) have been associated with a lower likelihood of reaching remission after 4 weeks of amisulpride. 8 Similarly, in established schizophrenia, higher levels of Glx (the combined signal from glutamate plus glutamine) in the medial frontal cortex have been associated with a poor response after restarting antipsychotic medication. 10 Elevated ACC glutamatergic metabolites have also been reported in first episode patients who had failed to achieve remission following antipsychotic treatment, 7 in patients who were treatment resistant 6, 9 and in patients resistant to clozapine. 12 Elevated glutamate metabolites in treatment-resistant schizophrenia have also been described in the caudate nucleus. 11 While brain glutamate metabolite levels have thus been related to antipsychotic response, 8 levels of these metabolites may be reduced by antipsychotic medication. 13 In patients with first episode psychosis, longitudinal reductions in glutamate in the ACC and left thalamus have been observed over 4 weeks of antipsychotic treatment, 8 and longitudinal reductions in glutamine and Glx in the left thalamus have been reported after 30 and 80 months of treatment. 14, 15 Glutamate reductions have also been reported in the frontal cortex, following 4 and 6 months of antipsychotic treatment, [16] [17] [18] and in the striatum following 4 weeks of antipsychotic treatment. 18, 19 However, reductions in glutamatergic metabolites in the thalamus 20 or ACC 20, 21 have not been detected by other studies. Studies in patients with chronic schizophrenia have produced mixed findings, some reporting reductions in glutamate levels following antipsychotic treatment in the frontal 22 and temporal cortex, 23 but others finding no change (in frontal cortex, [23] [24] [25] temporal cortex 25 and thalamus 23, 25 ).\nIf there are longitudinal reductions in glutamate levels with antipsychotic treatment, we hypothesised that these may be related to symptomatic improvement. The present study aimed to test this by examining the relationship between glutamate metabolites in the ACC and thalamus and remission status at three timepoints over the first 9 months of antipsychotic treatment in patients with first episode psychosis. The present dataset is an extension to our previous study, which investigated the relationship between glutamate and treatment response over 4 weeks, reporting that elevated glutamate in the ACC at first presentation predicted poor antipsychotic response. 8 Here we extend to a longer follow-up period of 9 months in a subset of this cohort. This duration of treatment corresponds to that in our previous cross-sectional study, which found that after 9 months of treatment, first episode patients who had not achieved remission had higher ACC glutamate levels than those in remission. 7 To aid interpretation of our findings, we also assessed a sample of healthy volunteers over the same time period."}, {"section_title": "RESULTS", "text": "At 9 months, 12 patients met Remission criteria and 11 patients met criteria for Non-Remission. There were no significant differences in demographic variables between the Remission and Non-Remission subgroups, in substance use ( Supplementary  Table 1 ) or in duration of or adherence to antipsychotic medication at any timepoint (Table 1 and Supplementary Notes). At the time of the baseline scan, 4 patients were medication naïve, and all but one of the remaining patients were receiving amisulpride. At the 6 weeks and 9 month timepoint the Remission and Non-Remission groups were taking a similar set of antipsychotic drugs, and did not differ in chlorpromazine equivalent dose (Table 1) . Please see Table 1 and Supplementary Notes for group differences in PANSS scores at each timepoint.\nVariables relating to 1H-MRS data quality are provided in Supplementary Table 2 . For one patient Glx and glutamate data from the thalamus were below 20% CRLB, reducing the sample to n = 22, and for one healthy volunteer Glx data from the thalamus were below 20% CRLB, reducing the sample to n = 14. There were no significant group differences for spectra quality (Supplementary Table 2 ) or voxel tissue content ( Table 2) .\nFor both Glx and Glutamate in the ACC, there were no significant main or interaction effects of remission status or time ( Fig. 1 , Supplementary Table 3 ). This was also the case when time to follow-up was included as a covariate, and when analysis was restricted to patients who were adherent to antipsychotic medication at least 75% of the time. There were no significant relationships between the longitudinal percentage change in ACC glutamatergic metabolites and the percentage change in symptoms over time ( Supplementary Table 4 ). There was also no significant difference in ACC glutamate metabolite levels over time in healthy volunteers compared to the overall patient sample (Fig. 2) .\nGlx levels in the left thalamus showed a significant interaction between remission status and time (F(2,40) = 4.337, P = 0.020, repeated measures ANOVA, Fig. 1 ). The main effects of remission status (F(1,20) = 0.121, P = 0.731) and time (F(2,40) = 2.541, P = 0.091) were non-significant. At 9 months, Glx levels in the thalamus were significantly higher in the Non-Remission compared to Remission group (F(1,20) = 5.244, P = 0.033, Cohen's d = 0.98, one-way ANOVA). This was related to a significant effect of time in the Non-Remission group (F(2,20) = 6.183, P = 0.008, repeated measures ANOVA), which reflected an increase in Glx concentration between 6 weeks and 9 months (P = 0.031, Cohen's d = 1.24, Bonferroni-corrected pairwise comparisons). Within the Remission subgroup, Glx levels did not vary significantly over time (F(2,20) = 1.849, P = 0.183, repeated measures ANOVA). Similar results were obtained when the analysis was restricted to patients who reported being medication adherent at least 75% of the time (Supplementary Figure 2 ). There were no significant differences in thalamic Glx levels over time in the healthy volunteer group compared to the overall patient sample ( Fig. 2 , Supplementary  Table 3 ).\nGlutamate levels in the left thalamus showed a significant effect of time (F(2,40) = 7.306, P = 0.002, repeated measures ANOVA), while the main effects of remission status (F(1,20) = 0.036, P = 0.852) and the remission status x time interaction were not significant (F(2,40) = 1.310, P = 0.281, Fig. 1 ). The effect of time reflected a significant decrease in thalamic glutamate across both patient subgroups between baseline and 6 weeks (P = 0.005, Bonferroni-corrected pairwise comparisons), and a significant increase between 6 weeks and 9 months (P = 0.010, Cohen's d = −0.67). The results remained the same when the analysis was restricted to patients who were adherent to antipsychotic medication at least 75% of the time. When the entire patient sample was compared to the healthy volunteer sample, the effect of time on glutamate in the thalamus was apparent across all subjects (healthy volunteers and patients) (F(2,70) = 3.753, P = 0.028, repeated measures ANOVA), and was related to a significant decrease in glutamate between baseline and 6 weeks (P = 0.045, Cohen's d = −0.52, Bonferroni-corrected pairwise comparisons, Fig. 2 ). No significant effect of diagnostic group, and no interaction were found (Supplementary Table 3 ).\nThere was a positive correlation between the percentage change in Glx levels in the thalamus and the percentage change in PANSS positive score between baseline and 9 months (r = .512, P = 0.015, Pearson's bivariate correlation): the greater the longitudinal reduction in thalamic Glx, the greater the improvement in positive symptoms over the course of treatment (decrease in PANSS positive score). This correlation remained significant when one outlying value identified using Cook's D was excluded (r = .493, P = 0.023, Fig. 3 ). Secondary analyses found positive correlations between the percentage change in Glx in the thalamus and the percentage change in PANSS general (r = .446, P = 0.037) and PANSS total (r = .501, P = 0.018) scores, but not the PANSS negative score (r = -.053, P = 0.815, Fig. 3 ) or PSP score (r = -.135, P = 0.550). Relationships remained significant when partial correlations were conducted to control for time to followup.\nIn contrast, there were no significant relationships between the percentage change in glutamate in the thalamus and percentage symptom change ( Supplementary Table 4 ).\nRepeated measures MANOVA analyses assessed metabolite changes over time for N-acetyl-aspartate, creatine, myo-inositol, and choline (Supplementary Table 5 ). There were no significant main effects of group, time or interaction in remission versus nonremission groups in the ACC or left thalamus, or in patients versus healthy volunteers in the ACC. In the thalamus, there was a significant interaction between group (patient vs healthy volunteer) and time (F(2,70) = 3.520, P = 0.010). Post-hoc tests did not find significant effects when groups and timepoints were analysed separately."}, {"section_title": "DISCUSSION", "text": "This study investigated the relationship between brain glutamatergic metabolites and the response to antipsychotic medication over the first 9 months of treatment for psychosis. The main finding was that Glx in the thalamus increased over time in Non-Remitters, such that after 9 months Glx levels were higher in patients who were not in remission than in those who were. Furthermore, symptomatic improvement over the course of treatment was associated with a longitudinal reduction in thalamic Glx levels. These results extend our previous observations over shorter periods of treatment 8 to indicate that longer-term symptomatic response may be linked to the level of glutamatergic metabolites.\nIn a recent longitudinal study over 4 weeks of antipsychotic treatment (containing an overlapping sample of the participants to the current study) we also found that glutamate levels decreased over time in the thalamus, but there was no significant relationship between the reduction over this timeframe and symptomatic improvement. 8 In this extended study, the treatment period was 9 months, which suggests that longitudinal differences in relation to symptomatic response may emerge after longer periods of treatment. This 9 month period is comparable to the time since presentation in an earlier cross-sectional study in first episode psychosis, in which we also observed numerically but non-significantly higher thalamic Glx in the Non-Remission compared to Remission group. 7 The results of the present study are broadly consistent with a previous report in patients with schizophrenia showing that higher social and occupational functioning scores 80 months after diagnosis are associated with a greater degree of thalamic Glx reduction over those 80 months. 14 Together these findings suggest that thalamic Glx levels may be more related to symptomatic outcome after a period of several months, rather than the initial period of treatment. A recent study observed a trend for an increase in thalamic Glx levels over 5 years in first episode psychosis patients, although the relationship with treatment response was not investigated. 26 At 9 months, there were no group differences in substance use or spectral quality. However, there was a numerically higher percentage of cannabis users in the non-remission group, with a higher frequency of use. It is possible that cannabis use or other unknown external factors may have contributed to the observed increase in thalamic Glx in non-remitters. 27 Thalamocortical dysconnectivity is thought to be a key pathophysiological feature of schizophrenia, 28 and may be mediated by alterations in thalamic glutamatergic transmission. 29, 30 Human neuroimaging studies have demonstrated that antipsychotic administration can modify thalamic activity and metabolism, [31] [32] [33] [34] but there are fewer data on the role of the thalamus and its cortical connectivity in mediating clinical outcome, with some studies [35] [36] [37] but not others 34, 38 suggesting an association. This could be explored in future work combining serial 1H-MRS glutamate and functional connectivity measurements in relation to early and longer-term clinical outcomes.\nContrary to our expectations, we did not detect any significant relationships between remission status and glutamatergic metabolite levels in the ACC. This is inconsistent with most previous reports linking antipsychotic non-response to elevated glutamate in the ACC, [6] [7] [8] [9] [10] 12 although one other study did not detect differences in ACC glutamate in relation to response. 11 In our recent study that involved a larger sample (n = 46) overlapping with the present cohort, 8 non-remission at 4 weeks was associated with elevated ACC glutamate prior to treatment with amisulpride. The lack of significant difference in the current smaller sample (n = 23) may reflect limitations of sample size. In addition, compared to our larger study, 8 a greater proportion of participants in the present study had received antipsychotics prior to baseline, which may have affected ACC glutamate metabolite levels. 13 In line with data from previous studies, 5, 8, 21 we did not detect significant differences in thalamic or ACC Glx or glutamate concentrations between the total patient sample and healthy volunteers. Although a recent meta-analysis of the literature suggests that there may be differences between first episode patients and healthy volunteers in glutamine levels in the thalamus and ACC, 5 the acquisition parameters we used at 3 Tesla did not allow reliable quantification of glutamine. While Glx in the thalamus increased over time in Non-Remitters, this effect did not reach significance for the glutamate signal alone. This may relate to differences in the Glx versus glutamate measurement, or could indicate that glutamine is contributing to this effect.\nA strength of this study is the relatively long follow-up period of 9 months in comparison to most previous studies 16, 19, 22, 23, 25, 39 which, together with scanning early in treatment permitted investigation of the relationships between brain glutamate and short and longer-term outcome under antipsychotic treatment. A further strength is sample homogeneity, through the inclusion of participants in their first episode of psychosis who had received minimal prior antipsychotic medication.\nOne limitation of the study was that the majority of participants were not antipsychotic naïve at baseline and may have already experienced initial symptomatic improvement. Even short-term antipsychotic exposure may reduce glutamate levels 8 and may have reduced our ability to detect subsequent reductions. The 52% response rate in the present sample is slightly lower than that reported in the literature in first episode psychosis (approximately 60% [40] [41] [42] [43] ), which may be accounted for by prior medication exposure, or by the longer follow-up time period. Other limitations include controlling for the potential effects of medication adherence, which was estimated through self-report and clinical notes. Although the findings remained significant when the analysis was restricted to participants who reported being medication adherent at least 75% of the time, inclusion of more accurate measures of adherence, such as antipsychotic plasma levels, would have been helpful. The majority of patients initially received the same antipsychotic medication, amisulpride, which is a relatively selective D2 dopamine receptor antagonist. 44 However, subsequently there was more variation in the particular antipsychotic medications used. Differences in the pharmacological profile of antipsychotics could have differential effects on glutamatergic neurotransmission, 45 which may have increased variability over the observation period. Nevertheless, at the 9 month timepoint, the Remission and Non-Remission groups were taking a similar set of antipsychotic drugs, the levels of medication adherence were comparable, and a similar proportion of patients were no longer taking medication. The data also showed a reduction in thalamic glutamate across all participants between baseline and 6 weeks, which may reflect a methodological factor impacting on the measurement. This indicates the utility of including a healthy volunteer or other non-intervention group for interpretation of longitudinal studies. Lastly, this study used adapted Andreasen's criteria for remission, consistent with previous studies. 7, 40 Therefore our study did not account for fluctuations in symptoms or remission status that may have occurred over the 9 month period, which would require regular symptom monitoring.\nIn summary, the findings of the present study extend the literature linking ACC glutamate to antipsychotic response 6-10 by indicating that response to antipsychotic medication over the first 9 months of treatment may be related to longitudinal changes in glutamatergic metabolites in the thalamus. The association between elevated thalamic Glx levels and Non-Remission is consistent with the notion that brain glutamate transmission is a potential therapeutic target for novel treatments for psychosis."}, {"section_title": "METHODS", "text": "The study included participants recruited in two studies: OPTiMiSE (Optimisation of Treatment and Management of Schizophrenia in Europe; www.optimisetrial.eu; EudraCT-Number: 2010-020185-19; clinicaltrials.gov identifier: NCT01248195 40 ) (n = 34, using the London sample from the OPTiMiSE study 8 ), and TRFEP (The neurobiological determinants of treatment response in psychosis 46 ; reference number 12/EE/0220) (n = 6, with an additional n = 3 taking part in both studies). Both studies were granted ethical approval by the South London and Maudsley NHS Trust Ethics Committee, and all participants provided written informed consent. Patients were recruited from early intervention community teams and wards. We aimed to recruit 24 participants to detect a change in Glx levels with antipsychotic treatment, according to power calculations reported in a recent meta-analysis. 13 Of 43 patients who agreed to participate in the study, a total of n = 23 patients completed all 3 scans (n = 14 from the OPTiMiSE study, n = 6 from the TRFEP study, and n = 3 taking part in both studies) ( Supplementary Fig. 1 ). In the patient group, inclusion required presentation with a first episode of psychosis within the past 2 years, aged between 18-40, and a diagnosis of a psychotic disorder according to ICD 10 criteria or DSM-IV criteria. Inclusion required previous antipsychotic exposure of <15 days (OPTiMiSE study), or no exposure to antipsychotic medication within the past 6 weeks (TRFEP study). Exclusion criteria included being unable to provide written informed consent, being coercively treated or being under legal custody. Healthy volunteers (n = 36) were recruited through online advertisements, with n = 15 completing all three MRI sessions. Healthy volunteers were 18-40 years old with no history of psychiatric illness. All subjects had no history of head injury or contraindications to MRI scanning.\nIn the patient sample, symptoms were assessed using the Positive and Negative Syndrome Scale (PANSS), 47 and functioning was assessed using the Personal and Social Performance (PSP) scale at each MRI scan visit. Medication adherence and illicit drug use was determined using clinical notes and self-report of dates when medication was taken. Chlorpromazine Equivalent Doses were calculated. 48 The primary clinical outcome measure was remission at 9 months, based upon adapted Andreasen criteria, 49 consistent with our larger study, 40 and previous cross-sectional study in first episode psychosis. 7 MRI scans were conducted at baseline and repeated after a mean of 6 weeks and 9 months. All data were acquired at 3-Tesla on a General Electric Healthcare (Chicago, USA) HDxt MR system. The same sequences were acquired at each time-point. Whole brain sagittal T1-weighted images were acquired using a modified ADNI GO protocol (See http://adni. loni.usc.edu/methods/documents/mri-protocols/) with an echo time (TE) 2.848 ms; repetition time(TR) 6.984 ms; inversion time 400 ms; flip angle 11°, Field of view 260 mm, slice thickness 1.2 mm, matrix size 256x256 mm. The structural images were reformatted to axial orientation for 1H-MRS voxel positioning in the bilateral ACC and left thalamus. The centre of the ACC voxel (20 x 20 x 20 mm) was positioned 16 mm superior to the anterior portion of the genu of the corpus callosum on the midline sagittal localiser, avoiding the corpus callosum. The voxel in the left thalamus (15 x 20 x 20 mm) was also positioned from the axial image, using the coronal and sagittal localisers to minimise cerebrospinal fluid (CSF) content in the voxel (voxel placement and example spectra previously published 8 ).\n1H-MRS spectra were acquired using PRESS (Point RESolved Spectroscopy), at TE = 30 msec; TR = 3000 msec; 96 averages; bandwidth/sample frequency = +/-2500Hz; number of complex points = 4096. Data were acquired using the standard GE PROBE (PROton Brain Examination) sequence, which includes acquisition of unsuppressed water reference spectra (16 averages). The target water line-widths after shimming were < 7Hz in the ACC and < 10Hz in the left thalamus. For follow-up scans, radiographers referred to the baseline scan voxel position to reduce variability in voxel placement.\nSpectra were analyzed using LC Model version 6.3-0I 50,51 using a standard LC Model basis set acquired using PRESS at 3-Tesla and a TE of 30msec containing 16 metabolites. Poorly fitted metabolite peaks (Cramer-Rao lower variance bounds (CRLB) >20% as reported by LCModel) were excluded from further analysis. All metabolite values are reported in institutional units.\nTo correct metabolite concentration estimates for voxel CSF content, T1weighted images were segmented into grey matter, white matter and CSF images using Statistical Parametric Mapping 8, version 6313 (SPM8; Wellcome Department of Imaging Neurosciences, University College London, UK). Voxel coordinates were obtained from spectra file headers using General Electric's spectroscopy processing tool SAGE and mapped against the T1-weighted structural images using in-house software, to calculate the percentage tissue content of the individual 1H-MRS voxels. Metabolite values were then corrected using the following equation 51 The main 1H-MRS metabolites of interest were Glx and glutamate, corrected for voxel CSF content. Repeated measures ANOVA assessed the effects of time, group and group*time on voxel Glx and glutamate levels. A significant effect of time was followed up with Bonferroni-corrected pairwise comparisons (to determine significant differences between timepoints). A significant effect of group was followed up by one-way ANOVA tests (to determine group differences at separate timepoints). A significant interaction was followed up with one-way ANOVA tests, and also a repeated measures ANOVA in the remission and in the nonremission groups separately, with Bonferroni-corrected pairwise comparisons (to determine significant differences between timepoints in each group seperately). The primary analysis compared the Remission and Non-Remission patient groups. Subsequent analyses compared the healthy volunteer group to the total patient group. Relationships between the percentage change in PANSS score (minus minimum possible scores) 52 or PSP score, and the percentage change in Glx and glutamate over 9 months were assessed using Pearson's bivariate correlations (2 tailed). Outliers were identified using Cook's distance estimates, excluding values higher than 4/n. Repeated measures MANOVA assessed metabolite changes over time for other metabolites. The data that support the findings of this study are available from the corresponding author upon reasonable request."}]