[{"section_title": "Abstract", "text": "Abstract-This paper presents registration via embedded maps (REM), a deformable registration algorithm for images with varying topology. The algorithm represents 3-D images as 4-D manifolds in a Riemannian space (referred to as embedded maps). Registration is performed as a surface evolution matching one embedded map to another using a diffusion process. The approach differs from those existing in that it takes an a priori estimation of image regions where topological changes are present, for example lesions, and generates a dense vector field representing both the shape and intensity changes necessary to match the images. The algorithm outputs both a diffeomorphic deformation field and an intensity displacement which corrects the intensity difference caused by topological changes. Multiple sets of experiments are conducted on magnetic resonance imaging (MRI) with lesions from OASIS and ADNI datasets. These images are registered to either a brain template or images of healthy individuals. An exemplar case registering a template to an MRI with tumor is also given. The resulting deformation fields were compared with those obtained using diffeomorphic demons, where topological changes are not modeled. These sets of experiments demonstrate the efficacy of our proposed REM method for registration of brain MRI with severe topological differences."}, {"section_title": "", "text": "various forms of morphometry [2] [3] [4] , and have been widely used to study structural differences among brains and brain regions due to genetics, environment, and disease (see [5] and the references therein).\nImage models of intact brains (excluding surgical resection) typically assume that the brain is a collection of shapes with a fixed topology representing distinct tissue types, gray matter (GM) and white matter (WM), modulated by a bias field and corrupted by additive noise (e.g., [6] , [7] ). This model holds reasonably well in the cortex of healthy young (postadolescent) subjects with limited shape variation (a small deformation model).\nHowever, in the case of older subjects, both with and without manifest disease symptoms, the tissue shape and composition is much more complex. In these subjects, the changes most often seen in the clinic are large variations in the size and shape of ventricles, most likely because of tissue loss in the adjoining WM, as well as more subtle variations in subcortical shape, and cortical thickness (a large deformation model) [8] . Accompanying this increase in shape variation are changes in tissue composition that manifest as both diffuse and focal intensity differences. These intensity changes need not be accompanied by symptoms. For example WM hypo-and hyper-intensities have long been noted in T1 and T2 weighted images of older subjects (Leukoaraiosis) [9] .\nIntensity changes between images that cannot be modeled as bias or noise adversely influence registration algorithms. Such topological changes can cause false deformation in the resulting dense vector fields of existing deformable registration algorithms [10] . Consequently, in subsequent analysis such as deformation based morphometry (DBM), false deformation will be wrongly associated with local growth or shrinkage [11] . Prior work using morphology largely neglects this complication. In some studies, subjects with gross structural abnormalities are excluded (e.g., [12] ), which may or may not exclude abnormal appearing tissue but likely does exclude widespread Leukoaraiosis or focal lesions. However, in clinical populations such changes of tissue contrast are common. Thus, image-based assessment tools must be able to account for tissue with abnormal appearance. The necessity of isolating the impact of topological changes in deformable registration has been demonstrated in previous works [13] , using Cost Function Masking (CFM) [14] . CFM has been applied to parametric registration methods, for example, on cosine transform bases. The extension of CFM to nonparametric methods is not straightforward due to the severely increased dimensionality of the optimization space. However, some ongoing work is exploring this approach [15] .\nAssuming that such regions can be identified ahead of time (lesion segmentation), then their influence can be reduced. This 0278-0062/$26.00 © 2011 IEEE can be accomplished by registering topology corrected images rather than the original images, either through semi-manual labeling of the lesions [16] or through detecting and removing topological changes automatically [10] . However, since segmentation and registration are intimately connected, any issue that confounds segmentation and registration is problematic. Diffuse intensity changes are such a confound since defining a criteria for what constitutes a lesion, as required by segmentation, is arbitrary. Furthermore in WM regions near the cortex, abnormal WM may be classified as cortical GM. This misclassification propagates to the topologically corrected segmented image, which can lead to artificially increased cortical thickness.\nIn some applications, precomputed pathology models obtained from a group of training data can be used to account for topological changes, for example, in tumors [17] . However, the requirement for having such training data limits their application. Further, the precomputed model is specific to certain pathology and must be adapted on a per-case basis. In addition, several other methods have been developed to register brain images after surgical resection by matching subvolumes [18] , [19] , landmarks [20] , segmentation surfaces [21] , and adapting the EM framework [22] , [23] . However the EM-based methods are generally limited to lower degree-of-freedom transformations due to the computational complexity involved.\nAnother approach is to model each topological change as a diffusion source or sink. Cuzol et al. used this approach in 2D to register images of Multiple Sclerosis patients [24] by using vortex particles to represent divergence of the deformation field. In a similar vein, the work by Risholm et al. [25] used anisotropic diffusion instead of Gaussian smoothing in a Demons registration framework regulated by diffusion sinks to generate a deformation field that was free of resection effects. Since each lesion must be modeled as a source or sink this approach introduces a heavy computational burden. Alternatively, a shape deformation and an intensity correction can be computed using the active appearance models [26] . The challenge with such method is that it needs a comprehensive training set, which properly covers a large variety of topological changes, for the construction of an appearance model.\nPrevious work most closely related to that presented here is that of metamorphosis theory [27] . A metamorphosis is a Riemannian metric defined on the space of images that measures both geometric deformation and intensity changes. Computation of a geodesic for this metric in the space of images leads to a partial differential equation (PDE) whose solution provides a diffeomorphism optimal up to an image residual error. The magnitude of the residual error is controlled via a spatially homogeneous parameter. This approach has been used in medical image averaging [28] and recently for brain atlas estimation [29] . However, because the allowed residual is spatially homogeneous, metamorphosis is not designed to minimize false deformation.\nIn previous work we developed a registration algorithm via embedding images into higher dimensional Riemannian space [30] , [31] . The algorithm was used to register 2-D images without specifically suppressing false deformation. In this paper we extend this approach, named registration via embedded maps (REM), to handle topological changes by suppressing their impact on the deformable registration process for 3-D brain MRI. Specifically, images in Euclidian space are embedded as surfaces in an Riemannian space. The registration process is then conducted as surface deformation, where the first three dimensions of the resulting deformation field correspond to the spatial grid deformation in the Euclidean space, and the fourth dimension corresponds to the intensity displacement. The contribution includes two aspects. First, compared with metamorphosis, our embedding models the two types of deformation in a metamorphosis, i.e., a spatial deformation and a template evolution, with a single PDE evolution in a higher dimensional space. This guarantees a smooth convergence of the diffusion to a local minimum. Second and more importantly, by carefully choosing a feature-space in the embedding, we are able to control the distribution of the deformation energy in a way that topological changes are mainly attributed to intensity displacement, while brain structural changes are mostly captured by spatial grid deformation. In doing so, topological changes do not impact the spatial deformation and thus false deformation is effectively suppressed. The resulting spatial deformation is a diffeomorphism, evolved using the intrinsic update step, as proposed in [32] . Note that, using our proposed algorithm, the structural shape difference of the brain anatomy is fully captured by the spatial deformation field, free from the impact of topological changes. Therefore, the resulting spatial deformation field can be independently used in CA methods on brain shape analyses, such as DBM.\nDuring the preparation of this manuscript we became aware of a very similar approach by Zosso et al. [33] , named Geodesic Active Fields, where 2D images are also registered in a Riemannian space and the deformation field is solved through a minimal surface flow corresponding to the harmonic map. The focus of that work was on general 2D imaging applications, where the work described in this paper was focused on using a similar approach for handling topological changes in 3-D brain MRI. Thus, although developed independently, the papers are complementary.\nThe rest of this paper is organized as follows. Section II provides relevant background. In Section III, we describe each component of our registration method and then summarize it into a registration algorithm. Experiments and results are given in Section IV. Section V discusses the limitations of, and alternatives to, the registration approach and concludes the paper."}, {"section_title": "II. BACKGROUND", "text": "In this section, we explain several key concepts adopted by our proposed method, as well as give a brief introduction to the nonlinear diffusion framework."}, {"section_title": "A. Topological Change and False Deformation", "text": "Healthy brains include normal classes of WM, GM, and CSF. In constrast, aging-and disease-induced brain MRI intensity changes can be referred to as topological changes. The new intensity class associated with such topological changes, together with the normal brain structural difference, drive deformation during deformable registration. In the resulting deformation field, part of the deformation that is caused by the altered intensity, rather than the brain structural shape difference, is referred to as false deformation [10] . This definition of false deformation is somewhat ad hoc since topological changes result from various types of pathologies and associated tissue alterations. For example, space occupying lesions, such as a tumor, are associated with local deformation of surrounding tissue. However, this is not the case for tissue characteristic changes, such as multiple sclerosis, which do not cause local deformation. Without knowing their nature, we simply refer to all topological change-induced deformation as false deformation, which can be alternatively considered as uncertain deformation or deformation with unknown causes.\nFalse deformation cannot be directly handled by typical registration methods. The reason is two-fold. First, it is hard for a registration algorithm to handle topological changes without predetermining their pathological nature. Hence, some local deformation around topological changes is always expected to occur as their efforts to minimize intensity profile difference between images. Second, it is well known that the correctness of a deformation between two clinical images is in general not accessible due to the lack of a ground truth. It is therefore similarly difficult to distinguish false portion from an otherwise true deformation field. If images are registered using typical methods without properly handling topological changes, false deformation can no longer be separated from the overall deformation field in the postprocessing.\nDue to these reasons, we adopted a new methodology in this work, where lesion segmentation is taken as part of the input, such that registration is performed as if the lesion had not been present. This idea is illustrated in Fig. 1 . Assume we are trying to register the shape in Fig. 1(a) and (b), and the pathology of the topological change (big black dot) presented in Fig. 1(b) is unknown. If the two images are directly registered using a typical registration method, we will end up with a deformation field similar to the one shown in Fig. 1(c) . The deformation represented by blue arrows corresponds to the structural difference between the circle and the square, and thus represents relatively true deformation. However, deformation represented by red arrows attempt to shrink the black dot in Fig. 1(b) to match the intensity profile in Fig. 1(a) . As we mentioned above, this is regarded as false deformation. If the black dot had been caused by tissue characteristic change, the deformation represented by red arrows should ideally not exist. If space occupying lesion had been the reason for the black dot, it is possible that the deformation energy is asymmetric in the case where one side of the lesion grows faster than the other. One universal way of handling these cases is to not allow topological change to cause any deformation, which in this example leads to a deformation field as shown in Fig. 1(d) . This resulting deformation field is useful in clinical applications since it registers all nonlesion tissue. For instance, images of different dementia patients can be registered to the same template without being affected by the hyperintensity lesions, which enables the subsequent analysis of shape difference of cortex. Another example is that the structural shape of a series of images with progressing tumor can all be registered to an image at a healthy stage, after which the relative volume of tumor can be assessed. After this registration step, if necessary, a tumor progression model can be further applied to reveal how its surrounding tissue deforms. This idea is demonstrated in Fig. 1(e) , where we see that if the tumor progression model suggests that one side of the tumor grows faster than the other, the red arrows of the reigstration result should reveal this model and look like the ones shown in Fig. 1(e) ."}, {"section_title": "B. Sochen-Kimmel-Malladi General Nonlinear Diffusion", "text": "Our algorithm is derived from the Sochen-Kimmel-Malladi general nonlinear diffusion [34] , by choosing a particular embedding for our specific problem. The surface evolution follows the Euler-Lagrange equation that minimizes the surface weight measured by the Polyakov functional. Specifically, an image manifold in is embedded as an feature-space manifold , where and are the metric tensors on and , respectively. The map is chosen as (1) where are the local image Cartesian coordinates in , and is the intensity of the voxel at in the image to be registered, referred to as the moving image, , in the registration process. Based on a chosen map and a metric , the metric is determined through the pullback procedure (2) Note that (2) and subsequent equations use the Einstein notation (matching subscript and superscript variables are summed over), with , for the given embedding. In (2) , represents the element of and stands for the element of . Using the above definitions, the surface area , sometimes referred to as the weight of the map , is calculated as (3) where is the element of , is the square root of the determinant of the metric , and is the dimension of .\nThis measure of the surface area is referred to as Polyakov functional in Riemannian geometry. 1 The variation of the Polyakov functional with respect to the embedding can be found by the Euler-Lagrange equation (4) where are the elements in the Levi-Civita connection, given by (5) Note that the factor multiplied before is to simplify the mathematical expression and does not change the minimization solution. Equation (4) defines the gradient descent direction that minimizes the Polyakov functional, which shrinks the embedded surface area most rapidly. Therefore, (4) is referred to as a minimal surface flow. It has been shown that many image processing tasks can be accomplished via minimizing the Polyakov functional, e.g., image smoothing and segmentation [34] ."}, {"section_title": "III. REGISTRATION METHOD", "text": "In this work, we propose a registration algorithm via the minimization of the Polyakov functional. Our proposed algorithm differs from existing methods in the sense that it uses a segmentation of the topological changes as an input and is capable of registering brain MRI, while eliminating false deformation. The following describes the three major components of the proposed algorithm and then summarizes them into a registration algorithm."}, {"section_title": "A. Choice of Embedding", "text": "To establish a proper registration objective, we define the metric in the following form: (6) where is a positive function that influences the shape of a harmonic map by changing the physical meaning of the surface weight. While for a metric tensor, it is merely required to be positive-definite and symmetric, this diagonal matrix holds the simplest mathematical form while maintaining the three coordinates of physical space uncorrelated. Additionally, using this diagonal form, the length measure on the surface will be simply scaled by function . Thus, function provides us with the flexibility of intuitively adjusting the path of diffusion, similar to geodesic surfaces [35] , and enables the minimal surface flow to achieve the desired objective. The term defines the feature-space of the embedding, which is the relative magnitude between image features and spatial domain.\nTaking inspiration from geodesic active contours [36] , we note that for a specific choice of metric, the Polyakov function measures the area of the surface in the space . This gives us the freedom to use the fixed image of the registration to define the metric and thus influence the shape of the harmonic map. In this work, we choose , where and are the moving and the fixed images, respectively. The squared image difference given by is the most commonly used error measurement in intensity-based registration. The difference between our work and existing registration methods is that in our work, is not directly minimized, rather it is used to modulate the metric . Intuitively, consider an infinitesimal region on the embedded surface of the moving image, the value of at this location scales the magnitude of the surface tensor, which in turn modulates the distance measure, and thus scales the surface area (surface weight) of this region. As a result, when using the error measure between the moving and the fixed images for the value of , such as , the embedded surface will have larger surface areas at locations where there are bigger differences between the two images. Consequently, when minimizing the surface area, the embedded surface of the moving image will shrink its area most rapidly at such locations. Eventually, the surface area, measured by the Polyakov functional, will achieve its minimum, where has minimal-value everywhere, i.e., the moving and the fixed images are perfectly aligned. In other words, during the diffusion, the surface area is attracted by a potential well formed by , and our particular choice of transforms the Polyakov functional into a registration objective.\nThe factor defines the relative magnitude between the feature and the geometric space. The choice of impacts the distribution of deformation energy. This is illustrated in Fig. 2 , where we use red and blue curves to represent surface cut profiles of a moving and a fixed image, respectively. The arrows denote the gradient directions evolving the moving surface to the fixed surface. In Fig. 2(a) , is set to a small value, and thus image intensity is weighted less in the pullback. When the moving image is evolved to the fixed image, the gradient direction will be better co-aligned with the intensity axis, and the deformation energy will be concentrated on intensity displacement. Alternatively as shown in Fig. 2(b) , if is set to a large value, the gradient direction of evolving the moving image to the fixed image will be better co-aligned with the spatial grid axis, and the deformation energy will be more distributed to the spatial deformation. Based on this intuition, if we have a function , whose value indicates the probability that the voxel at lies within a region of topological change, we can construct the function as (7) where is a small positive value to avoid division-by-zero. With this function, for image regions with normal local topology, will have small values and will have large values accordingly. We choose to use the inverse function instead of some other functions, for example , since it leads to a sharper contrast between lesion and nonlesion regions, in terms of the values in . Then the deformation in these regions will concentrate on the spatial grid to capture the structural difference between the moving and the fixed images. On the other hand, for image regions that do have topological change, will have large values and small values, so that the intensity displacement is favored during the registration process to correct the tissue appearance."}, {"section_title": "B. Computation of Surface Variation", "text": "In the following, we use a single subscript to denote first order derivative, e.g., is the partial derive of function with respect to coordinate. Note that is the partial derivative of with respect to the moving image. Double subscript means second-order partial derivative, e.g., is the second order partial derivative of the moving image with respect to coordinate. Using the map given in (1) and the metric in (6), we can obtain the metric through the pullback procedure, (2) (8) After the embedding, the registration is to be carried out by minimizing the conformal area given in (3) . This leads to the following objective function: (9) where is given by (3) . and are given in (6) and (8), respectively. Further, (10) with a spatial deformation and an intensity displacement . Again, we emphasize that, the optimization over the search space is achieved jointly over in a single optimization framework. In other words, we are not solving the problem by separating and and seeking for their individual optima in an iterative back-and-forth manner. This is a key point that differs our method from existing ones. Using the result from Sochen-Kimmel-Malladi diffusion in (4), the gradient direction of the above minimization is given by (11) Here, is the time variable that represents a step in the diffusion process. Note that in (11), the Euler-Lagrange equation is multiplied by to simplify the expression. Since it is a strictly positive function, the multiplication will not affect the solution.\nCollecting the above terms, we obtain the registration updating rule (12) where Note that in (12), we intentionally assemble all the terms that are related to the partial derivatives of in . The first three dimensions in (12) define the spatial grid deformation that captures the structural differences between the moving and the fixed images. The fourth dimension in (12) defines the intensity displacement, which concentrates on the preidentified topological changes. The detailed derivation of (12) can be found in the Appendix. We want to emphasize that using (12) , the distribution of the deformation energy in the intensity displacement and the spatial grid deformation can be directly controlled by the function . This is the major reason that false deformation can be eliminated from the resulting deformation field. To better understand this, if we set to extreme values of and , we can obtain the following two equations: (13) where the common term 2 and (14) where the common term It is easy to observe that (13) and (14) agree with our expectation (refer to Section III-A). In particular, when has a very Fig. 2 . Influence of on the deformation field. Red and blue curves represent surface cut profiles of a moving and a fixed images, respectively. The arrows denote the gradient directions evolving the moving surface to the fixed surface. (a) is set to a small value, and thus image intensity is weighted less in the pullback. When the moving image is evolved to the fixed image, the gradient direction will be better co-aligned with the intensity axis, and the deformation energy will be concentrated on intensity displacement. (b) is set to a large value, the gradient direction of evolving the moving image to the fixed image will be better co-aligned with the spatial grid axis, and the deformation energy will be more distributed to the spatial deformation.\nlarge value, the spatial grid deformation contains the most energy, whereas when has a very small value, the intensity displacement dominates the deformation energy. Note that we do not require a precise lesion segmentation to form the function. It can be based on any estimated probability function . In real applications, can be constructed from some lesion-likelihood measurements, or a smoothed version of a rough lesion segmentation, for example (15) where is a Gaussian kernel and is the segmentation label map of topological changes. In most cases, after intensity displacement, the spatial deformation of the areas affected by topological changes will be filled by the interpolation of the deformation from their neighborhood, due to the smoothness constraints of the deformation field. Thus, when we construct from a smoothed rough segmentation of the topological change, over-or under-segmentation have limited effects."}, {"section_title": "C. Diffeomorphic Constraint", "text": "In medical image registration, regularization of the spatial transformation ensures a physically meaningful registration result. Most registration algorithms constrain the resulting deformation field to be in the group of diffeomorphisms [32] , [37] . Diffeomorphisms are smooth invertible transformations with smooth inverse, which causes no tearing or folding of the physical space when being applied. Constraining the evolution of a deformation field to be within the group of diffeomorphisms also ensures a stable diffusion process by avoiding spikes when solving the associated PDE.\nIdeally, in diffusion based methods, diffeomorphism can be obtained by physically constraining a positive Jacobian determinant, using a constrained optimization [37] . However, in our method, only the first three dimensions of the surface variation correspond to spatial deformation and are required to be diffeomorphism. The fourth dimension, on the other hand, is intensity change and should not be confined in the group of diffeomorphism. This can be illustrated by a simple example. Imagine that, we have two pixels, the left and the right, on an input image. If the left pixel has a smaller intensity than that of the right one, diffeomorphism essentially ensures that after intensity displacement, the left pixel cannot change to a larger intensity than the right pixel, i.e., it maintains the \"order\" of the intensities of the two pixels. This is obviously not desirable in our algorithm. On the other hand, adding constraint only to some of the dimensions in a diffusion process is difficult, and to the best of our knowledge such a mathematical solution is not directly available. An alternative method, is to perform spatial deformation within a Lie group of diffeomorphism, as proposed in the work of diffeomorphic demons [32] . Then, the diffeomorphic registration can be performed under unconstrained optimization routines. Following this idea, we adopt the intrinsic updating rule (16) for the evolution of the spatial deformation field. Here, is the vector field of the overall spatial deformation and contains the first three components of the surface evolution in (12):\n. In the update rule, stands for the vector field exponential operation, which can be efficiently computed through iterative composition [32] . The intensity displacement, on the other hand, is directly accumulated as (17) where is the overall intensity displacement, and is the last component of the surface evolution in (12) :\n. The intensity displacement is applied to the fixed image as (18) where is the time variable. Because the intensity difference caused by topological changes is reduced during this step, we refer to it as intensity correction."}, {"section_title": "D. Registration Algorithm", "text": "To summarize, we have the following registration algorithm:"}, {"section_title": "Algorithm: Registration via Embedded Maps (REM)", "text": "• Initialization:\n1) set image with normal topology as moving image ; 2) set image with topological changes as fixed image ; 3) construct using a segmentation label map using (15) and (7); 4) set deformation field and intensity displacement .\n• Iteration :\n1) Solve the optimization in (9) through surface evolution given in (12):\n2) apply fluid-like regularization on ; Fig. 3 . Images used in this demonstrative experiments. First row, an elderly subject, referred to as old; second row, a young subject, referred to as young; third row, the young subject with a manually created resection, referred to as resectioned.\n3) update deformation field: ; 4) apply diffusion-like regularization on ; 5) update intensity displacement: ; 6) apply spatial deformation: ; 7) apply intensity displacement: ; 8) if break;\nIn the algorithm, , , and are all Gaussian smoothing kernels. The variances for , are selected in the same way as in Diffeomorphic Demons, where typical value is within [0.8, 1.2]. The variance of has no direct impact on the convergence of the diffusion, and it only controls the spatial smoothness of the intensity displacement. We use a variance of 0.4 for in all experiments. We choose to set a maximum number of iteration as the stopping criteria, following the convention in Diffeomorphic Demons. Note that under the intrinsic updating rule, the registration error typically begins to oscillate when the diffusion tends to become stable. This oscillation effect is a detectable pattern and can also be used as a stopping criteria. and are both normalized and multiplied by a chosen step size as typical in registration methods. The step size of is related to the variance of and , where larger step size can be used with larger smoothing kernels. Experimental setting of is around 5% of estimated maximum intensity displacements."}, {"section_title": "IV. EXPERIMENTS AND RESULTS", "text": "In this section, the proposed registration algorithm REM was tested under multiple sets of experiments as commonly used Fig. 4 . Registration performance on images without topological change. The upper row shows the checkerboard image of old and young, before registration; the second row shows registration result using REM, which is the checkerboard image of the young and the deformed old, i.e., after applying spatial deformation to old; the third row shows the checkerboard image with registration result using diffeomorphic demons.\nfor structural brain MRI analysis. The resulting deformation fields were compared with those obtained using diffeomorphic demons [32] , where topological changes are not modeled. Some additional results were provided to demonstrate the impact of false alarm and misdetection of topological changes in the construction of . Experiments were also conducted for the cases where both moving and fixed images have topological changes to show limitations of the current algorithm."}, {"section_title": "A. Registering Images of With Synthetic Topological Change", "text": "In this subsection, we conduct a series of demonstrative experiments to highlight several key features of our registration algorithm. Specifically, we register the brain image of an elderly subject (referred to as old, shown in the first row in Fig. 3 ) to a pair of images of a young subject with and without a manually created resection (referred to as young and resectioned, shown in the second and third rows in Fig. 3, respectively) , to get a direct and quantitative evaluation of the algorithm performance. Both young and old are T1 MRI from OASIS dataset, where young is taken for a healthy male at age 21, and old is from a healthy female at age 77.\nFirst, we use our algorithm to register old and young. The purpose is to show that although our algorithm is motivated by the need for accurately registering images with topological changes, it can still be used to register images with normal topology, i.e., without topological changes. The spatial deformation, in this case, carries all the deformation energy, achieved by setting the lesion probability map to zero everywhere and not allowing intensity to deform. In the experiment, old is used as the moving image and young is used as the fixed. We used Gaussian kernels with for and . 3 For comparison purposes, we used diffeomorphic demons algorithm [32] to perform the same set of experiments. Three resolutions are used in the diffeomorphic demons, and 10, 20, and 100 iterations were performed in each resolution, respectively. The variances used in the Gaussian smoothing kernel for fluid and diffusion regularization are both set to 0.8, the same as in our algorithm. With this experiment setting, the computational load of the two algorithms is comparable. Fig. 4 shows the registration results of both methods. The upper row shows the checkerboard image of old and young, before registration. The middle row gives the registration result using our proposed REM, which is the checkerboard image of young and the deformed old, i.e., after applying spatial deformation to old. The lower row shows the checkerboard image of the registration result obtained by diffeomorphic demons. The three columns give the axial, sagittal and coronal views of the images, respectively. Note that, due to the large age difference, the two subjects used in this experiment have significant structural difference, which can be seen at the locations pointed out by the red arrows. From  Fig. 4 , it can be observed that both algorithms well aligned the two images after registration. The image residuals of the original images and those registered ones using the two algorithms are shown as the first three bars in Fig. 5 . We can see that there is a large image residual between young and old before registration (bar 1), and this is minimized to approximately the same amount when the two registration algorithms are applied (bars 2 and 3, respectively). 3 All the parameter settings are in voxel units. All the images from OASIS dataset have a spatial resolution of . Those from ADNI dataset used in this work have a spatial resolution of .\nThe glyph views of the deformation fields obtained via REM (the left) and diffeomorphic demons (the right) are shown in Fig. 6 . 4 We find that although the two algorithms converged to comparable image residuals, the shapes of the two deformation fields are different, due mainly to their respective optimization objectives. For REM, the spatial deformation energy mainly concentrates around the ventricle and several areas in the temporal lobe and occipital lobe. For diffeomorphic demons, however, the deformation energy is much more dispersed.\nSecond, we register old to resectioned. The image with resection is created by manually removing a large region of cortex from the healthy brain of young used above. The manually created image is then used as a probe, similar as the approach taken in [38] , to conduct the same registration experiments. The same parameters as before are used, except that was constructed with for in (15) and in (7) . The manual mask used to create the resection is taken to form function. The checkerboard images of the original images and after-registration ones using the above-mentioned parameters are given in the first two rows of Fig. 7 . Using the registration results given in Fig. 4 as a reference, we see that for all the nonresection parts of the brain, our algorithm converges to an accurate alignment, i.e., visually almost identical to that obtained in Fig. 4 and unaffected by the big resection area.\nIn addition, we include another experiment to demonstrate how function is used to selectively deforme intensity only in regions with topological changes. Specifically, we substitute the function with a uniform positive value , and perform the registration with all other parameters being the same. The third row of Fig. 7 gives the checkerboard image of using this parameter setting. In this case, spatial and intensity deformation will evolve simultaneously over the entire image. Conceptually, under this setting, our algorithm will behave similarly as . Checkerboard image of registration results from old to resectioned. First row, before registration; second row, after REM registration, when resection mask is used to construct ; third row, after REM registration, when uniform value is used; fourth row, after diffeomorphic demons registration.\nthe metamorphosis approach, or more generally speaking, similarly as all other methods with a spatial deformation evolution specified by and an intensity update given as . With a close examination of the areas pointed out by the red arrows, we notice that there is certain mis-aligment, indicating that for some non-resection areas the spatial deformation does not converge to an accurate registration. This part of image profile difference, is in turn captured by intensity deformation. Finally, Diffeomorphic demons is also used to register old to resectioned, with the same set of parameters as used before. The fourth row of Fig. 7 gives the checkerboard image of the result. As expected, the moving images is severely deformed around the resection area.\nThe residuals of the original images and registered ones are again plotted as bars (bar 4 to bar 8) in Fig. 5 . Bar 4 represents the image residual between old and resectioned. The residual is large, which is a mixture of the image profile change caused by resection and the structural difference between the young and old brain. Bar 5 is the image residual between young and resectioned, which equals to the value difference between bar 4 and bar 1. Bar 6 and 7 plot the image residuals after only applying the spatial deformation obtained using REM to the moving image, when and are used, respectively. We notice that bar 6 roughly equals to the summation of bar 5 and bar 2, which is one evidence that the nonresection areas are well registered as in the case without the resection. Bar 7 shows a larger residual than bar 6, which agrees with our observation in Fig. 7 that with , the nonresection area does not converge to an accurate registration. Finally, Bar 8 plots the image residual after diffeomorphic demons registration, we see that the residual in this case is even smaller than the image profile change caused by resection, i.e., bar 8 is even shorter than bar 5. This clearly demonstrates the existence of false deformation in the result of diffeomorphic demons.\nTo further visualize the experiment results, in the upper row of Fig. 8 , we use glyph plots to compare the deformation fields in the above experiment. Fig. 8(a) shows the result of REM registration with function. We see that the deformation field on the nonresection areas appears to be very similar as in the left subfigure in Fig. 6 . The region with resection still carries some deformation energy, which is basically the accumulation of the energy dispersed from its spatial neighborhood. Fig. 8(b) shows the result of REM registration with , we notice that there exists abnormally increased deformation energy around the area with resection, which is in fact false deformation. Fig. 8(c) shows the deformation field obtained using diffeomorphic demons. Note that this vector field has to be plotted in a much larger scale, where we see a severe concentration of false deformation energy around the resection area. In the corresponding columns of the lower row in Fig. 8 , the intensity deformations of the two REM registration experiments are plotted. When function is used, despite that we can still observe a very weak intensity change in the nonresection brain regions, which may be caused by local intensity histogram mismatch and the smoothing effect along edges of intensity change, the intensity deformation mainly occurs at the resection area. In contrast, with being used, beside the resection area, a strong intensity change happens to the entire brain, which explains the observed misalignment after applying the spatial deformation only."}, {"section_title": "B. Registering Template to Brain MRIs With Lesions", "text": "In the first set of experiments, we registered a brain template to a set of 20 brain MR images containing white matter lesions. The moving image is a template constructed for one of our early studies [39] , and was obtained by unbiased aligning and averaging a set of 130 MR images for healthy elderly subjects age from the OASIS dataset [40] . The testing set of 20 brain MR images with lesions were also from OASIS dataset, but none of them were used in the template construction.\nThe template is affinely registered to the fixed images before applying our deformable registration algorithm. Compared to MR images of individual subjects, brain templates are smooth. As a result, in the experiments, we used small Guassian Kernels for the smoothing of deformation fields: for and , respectively. Lesions were segmented using the FreeSurfer tool [41] (segmented with the label white matter hypointensity lesion), and was constructed with for in (15) ; in (7) and for . In all of the 20 registration experiments, the image residual stopped dropping and began oscillating within 15-25 iterations, so we terminated all registrations at the 30th iteration. Sample curves plotting the registration residual during the registration process for one of the experiments are shown in Fig. 9(a) , where the solid line plots the image residual after the spatial deformation field of the current iteration is applied to the moving image, and the dashed line plots the image residual after the intensity displacement is additionally applied. From these curves, we observe a smooth diffusion process both on the evolution of spatial deformation and on that of the intensity displacement. The image residuals before and after the registration for all the 20 experiments are shown in Fig. 9(b) . The blue bar shows the residual between the moving and the fixed images before applying our deformable registration. The red bar shows the residual between the spatially-deformed moving image and the fixed image, where we can see a significant drop of residual values compared to the corresponding blue bar. We also observe a further drop of residual values on the green bars, which are the residuals after the intensity displacement is applied to the fixed image, in addition to spatial deformation. In other words, the green bar shows the registration residual after removing the contribution from the intensity difference caused by topological change.\nA sample of the registration results is given in Fig. 10 . The first row of Fig. 10 shows the checkerboard image of the template and the fixed image. The second row shows the checkerboard image of the fixed image and the registered template, i.e., after spatial deformation. The fixed image that contains lesions is given in the third row, where the segmentation result using the FreeSurfer are marked out using blue contours. The fourth row gives the fixed images after intensity displacement is applied. The three columns in Fig. 10 show the axial, sagittal, and coronal views, respectively. By examining the areas pointed out by red arrows, we see that the anatomical structures of the template are well aligned with those on the fixed images and the intensity within lesions in the fixed image is corrected to that of healthy white matter. Fig. 11 provides some samples of the resulting deformation vector fields using a glyph view. The template image (the leftmost column) was registered to two subjects with severe lesions (the second column). After the registration, the template image is deformed to align with the subjects, as shown in the third column. In the last column, we show a zoom-in view where the deformation fields are plotted as glyph fields on top of the fixed image. For the first subject (the upper row), we focus on the lesions around the first ventricle, and for the second subject (the Fig. 10 . Sample of registration results from a template to a subject with lesion from OASIS dataset. The first row shows the checkerboard image of the template and the fixed image. The second row shows the checkerboard image of the fixed image and the registered template, i.e., after spatial deformation. The third row shows the fixed image that carries lesions, which are marked out by blue contours. The fourth row gives the fixed image after intensity displacement is applied. The columns are for the axial, sigittal, and coronal views of each volume, from left to right, respectively. Fig. 11 . Samples of the resulting deformation vector fields from a template to subjects with lesion from OASIS dataset. Vector fields are shown in glyph views. Left-most column: the template image. Second column from left: two subjects with severe lesions. Third column from left: the spatially deformed template image after registration. Right-most column: zoom-in view of the deformation fields on top of the fixed image. For the first subject (upper row), zoom-in view focusing on the lesions around the first ventricle. For the second subject (lower row), zoom-in view focusing on the lesion around the lateral ventricle.\nlower row), we focus on the lesion around the lateral ventricle. From both cases, we found no false deformation around the lesion areas."}, {"section_title": "C. Registering Brain MRIs of Healthy Subject to Those of Alzheimer's Patients", "text": "In this set of experiments, we registered an old subject (the same one used in Section IV-A) to a set of 20 brain MR images with lesions in the ADNI dataset. 5 The images from ADNI dataset were skull-stripped using the FSL (BET) tool [42] .\nIn these experiments, because we were conducting subject-tosubject registration, the moving image had lower SNR and was sharper compared to the template image used in Section IV-A. As a result, we used larger Gaussian kernels for the smoothing of deformation fields, compared with those used in the previous set of experiments. Specifically, we used for and , respectively. Other parameters were: for in (15) ; in (7) and for . In the registration experiments, the moving image was first affinely registered to the fixed images. During registration the image residual stopped dropping and started oscillating after 50-80 iterations, so we terminated the registration for all experiments at 100 iterations. Sample curves plotting the registration residual during the registration process for one of the experiments are shown in Fig. 12(a) , with the same configuration as that used in Fig. 9(a) . The image residuals before and after the registration for all the 20 experiments are shown in Fig. 12(b) , in the same fashion as in Fig. 9(b) . A sample of registration results is given in Fig. 13 , which is organized in the same fashion as in Fig. 10 . We can see that the moving image are spatially deformed and well aligned with the fixed image, and the lesions in the fixed images are corrected to the appearance of healthy white matter after the intensity displacement is applied.\nAgain, we used diffeomorphic demons algorithm [32] to perform the same set of registration experiments as comparison. Three resolutions are used in the diffeomorphic demons registration, and 50, 50, and 200 iterations were performed in each resolution, respectively. The variances used in the smoothing Gaussian kernel for fluid and diffusion regularization are both set to 1.2, the same as in our algorithm. In Fig. 12(b) , in addition to the residuals plotted as in Fig. 12(a) , the magenta bars show the registration residual after applying the diffeomorphic demons registration. We can see that in all the cases, the residuals after applying diffeomorphic demons have values in between the residuals before and after the intensity displacements (the red and green bars, respectively). Intuitively, in diffeomorphic demons, part of the spatial deformation attempted to minimize the error caused by the intensity difference of the lesions. This in turn caused false deformation. Now we demonstrate the efficacy of our algorithm in eliminating false deformation. Fig. 14(a) and (b) shows the registration 5 Data used in this paper are selected from the Alzheimer's disease Neuroimaging Initiative (ADNI) database (http://www.loni.ucla.edu/ADNI). The ADNI was launched in 2003 by the National Institute on Aging (NIA), the National Institute of Biomedical Imaging and Bioengineering (NIBIB), the Food and Drug Administration (FDA), private pharmaceutical companies and non-profit organizations, as a $60 million, five-year public-private partnership. The primary goal of ADNI has been to test whether serial magnetic resonance imaging (MRI), positron emission tomography (PET), other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of mild cognitive impairment (MCI) and early Alzheimer's disease (AD). Determination of sensitive and specific markers of very early AD progression is intended to aid researchers and clinicians to develop new treatments and monitor their effectiveness, as well as lessen the time and cost of clinical trials. results using our proposed algorithm and diffeomorphic demons. In both (a) and (b), the subfigures in the upper rows, from left to right, show axial views of the moving image, the fixed image, the registered moving image (after spatial deformation) using our algorithm, and the registered moving image (after spatial deformation) using diffeomorphic demons. In both cases, we find that the diffeomorphic demons algorithm tries to deform the lateral ventricle into the white matter areas with lesions, which leads to an incorrect registration result. In contrast, these errors are not seen in our registration results. Furthermore, in both (a) and (b), the left most subfigure in the lower row shows a zoomed region in order to visualize the deformation field. The second and third subfigures in both lower rows of (a) and (b) give the glyph views of the deformation field obtained using our method and diffeomorphic demons,respectively.Fordiffeomorphicdemons,wecanobserve a dense deformation energy concentration (abnormally long vectors) around the lesion-affected areas in the resulting deformation field, which is obviously false deformation. On the other hand, such false deformation is successfully removed in the results obtained using our algorithm. We need to point out that, despite the advantages of our algorithm shown by these results, keep in mind that our algorithm does take lesion segmentation as an additional input which is important prior knowledge."}, {"section_title": "D. Impact of False Alarm and Mis-Detection of Lesions", "text": "To eliminate false deformation, our registration method relies on an a priori lesion estimation. However, the lesion segmentation obtained from automatic segmentation tools is imperfect. Here, we provide some examples to demonstrate the impact these errors have on our algorithm.\nAs explained in Section III-B, is a function of a smoothed lesion segmentation. Fig. 15 shows such a case in our second Fig. 13 . Sample of registration results from the image of a healthy subject from OASIS dataset to an image with lesion from ADNI dataset. The first row shows the checkerboard image of the template and the fixed image. The second row shows the checkerboard image of the fixed image and the registered template, i.e., after spatial deformation. The third row shows the fixed image that carry lesions, which are marked out by blue contours. The fourth row gives the fixed image after intensity displacement is applied. The columns represent the axial, sigittal, and coronal views of each volume, from left to right, respectively.\nset of experiments (Section IV-B). From Fig. 15(a) , we notice that FreeSurfer underestimated the lesion-affected areas (inside the blue contours), especially the lesion region to the left of the ventricle. Fig. 15(b) shows the smoothing effect of the constructed function. All the lesions in the fixed image are successfully removed after intensity displacement, as shown in Fig. 15(c) . Finally, in Fig. 15(d) , we can see that the deformation field was not affected by the presence of lesions, i.e., no false deformation was observed. This result demonstrated that slightly over-or under-segmentation is tolerated by our algorithm.\nHowever, if a lesion-affected area is completely mis-detected, the registration performance will be affected. An example is shown in Fig. 16(a) , which gives the coronal view of a moving image, a fixed image, and a registered moving image after applying the spatial deformation, from left to right, respectively. We find that the skull stripping of the fixed image obtained by FSL (BET) is not perfect, and some extracranial tissue was kept as part of the brain. This tissue does not have matching anatomy in the moving image, and thus, it can be regarded as a topological change. In fact, such errors are commonly seen in large scale Comparison of our algorithm with diffeomorphic demons by registering a healthy subject from OASIS dataset to images with lesion from ADNI dataset. In both (a) and (b), the subfigures in the upper row, from left to right, show an axial view of the moving image, the fixed image, the registered moving image (after spatial deformation) using our algorithm, and the registered moving image (after spatial deformation) using diffeomorphic demons. Also, in both (a) and (b), the left most subfigure in the lower row indicates a region that we zoom-in to visualize the deformation field. The second and third subfigures from the left gives the glyph view of the deformation field obtained using our method and diffeomorphic demons, respectively. studies. Fig. 16(b) shows the deformation field around this area, where we observe some false deformation. Ideally, if this area was modeled in , it will be corrected by intensity displacement and should not cause any spatial deformation.\nUnderestimation or even misdetection is common in automatic lesion segmentation algorithms, due to the minor intensity differences of some lesions. However, it is relatively uncommon to see false alarms during lesion detection, since it is expected that there always exist some intensity difference. Thus, in the two sets of experiments, we do not have results to show the impact of false alarm. However, it is reasonable to expect that if false alarm happens to regions with no or minor intensity difference between the moving and the fixed images, our registration algorithm would perform normally. The reason is that if the intensity of certain region on the moving and the fixed images are very close, will have small values for these regions and no spatial deformation or intensity displacement will be exerted, even though has large values. On the other hand, if the region of false alarm covers mis-aligned boundaries between the moving and the fixed images, the deformation energy will be concentrated on intensity deformation.\nFinally, we point out that the current version of our algorithm only deals with lesions in the fixed image and a normal anatomical topology of the moving image is required. Fig. 17 shows the registration results when both the moving image [ Fig. 17(a) ] and the fixed image [ Fig. 17(b) ] have lesions (from the ADNI dataset). Only the lesion segmentation for the fixed image is modeled in . We observed that around the left side of lateral ventricle, the deformed moving image [ Fig. 17(c) ] is not well aligned with the fixed image after registration, and false deformation is present, as shown in Fig. 17(d) ."}, {"section_title": "E. Register Template to a Brain Image With a Tumor", "text": "In this experiment, we registered a brain MR image template, as shown in the first row of Fig. 18 , to a fixed image that carries a brain tumor of considerable size, as shown in the second row of Fig. 18 . 6 The template image was constructed using 233 healthy young subjects mean age from OASIS dataset in our previous study [39] . The subject brain image with a meningioma was obtained from the testing data distributed within the Slicer3 [43] package. It was skull-stripped using the FSL (BET) tool [42] . As shown in the second row of Fig. 18 , instead of a precise segmentation of the tumor, our interface allowed a physician to draw 3 profile lines on the fixed image to indicate the location and size of the tumor (with orange line), which gives us an ellipsoid containing the tumor region (blue contours).\nThe registration process and results are shown in Fig. 18 . Due to the large size of the topological change, we use a large Gaussian kernel for , for in (15) , and all the other parameters are set to the same as in Section IV-B. The third row of Fig. 18 gives the checkerboard image of the fixed image and the template; where the fourth row gives the checkerboard image of the fixed images and the registered template, after applying spatial deformation. We find that after registration, the template is well aligned with the fixed image. The fifth row shows the fixed image after applying intensity displacement, where we see the intensity of the tumor region is corrected by that of the co-aligned template image. This step essentially provides us with a \"tumor-repaired\" version of the fixed image, which is an estimation of the brain anatomy had the tumor not existed. We notice that in the fixed image, the growth of tumor pushes the surrounding tissue aside and squeezes the ventricle. After intensity correction, the healthy tissue is moved back to the normal location and the ventricle is lifted. In Fig. 19 , we plot the resulting deformation field using glyphs. Clearly, the tumor does not induce local deformation, despite the strong intensity gradient between the tumor region and the surrounding healthy tissue."}, {"section_title": "F. Impact of Diffeomorphic Constraint", "text": "In this section, we conduct an experiment to demonstrate the impact as well as the importance of the diffeomorphic constraint. In Fig. 20 , we show the resulting deformation field when the experiment in Fig. 13 is conducted with the exact same set of parameters, except that we replace the deformation updating rule given in step 3 of REM registration algorithm with the following:\n3) update deformation field: , i.e., we remove the diffeomorphic constraint by replacing the intrinsic updating rule with a simple additive updating. In these plots, we keep the original scale of the glyph lengths in voxel unit. A zoom-in view is given in the right figure, where we can observe that regions with the head of glyphs overlap, as pointed 6 Note that in the second row and in the checkerboard images in the third and fourth rows, the fixed image appears to be much darker compared to the template. The appearances of the fixed image before and after intensity correction, as shown in the second and fifth rows, are also very different. This is due to the fact that the fixed image has a very different intensity profile because of the bright tumor. As a result, the contrast of the whole image is not good, where CSF appears to be dark and not really visible. However, if we pay some close attention, it is easy to notice that major features, such as the separation between gray matter and white matter and the boundary of ventricle are all well aligned after the deformable registration. Also, as shown in the fifth row, after the intensity of the tumor region is repaired, brain regions other than the tumor can be visualized with a proper intensity contrast. Fig. 18 . Sample registration of a brain template to the MRI of a meningioma patient. First row: a brain template, the moving image. Second row: fixed image, MRI of a meningioma patient. The blue ellipsoid marks out the tumor region. Third and fourth row: checkerboard image of the fixed and the moving image, before and after spatial deformation, respectively. The fifth row: the intensity corrected fixed image after intensity displacement. The three columns show the axial, sagittal, and coronal views of the same image. out by the yellow arrows. The overlapping means that there exists flipped ordering of adjacent voxel after the deformation.\nAn important property of diffeomorphism is its invertibility, which means if we have a diffeomorphism that maps the moving image to the image space of the fixed image, it can be uniquely inverted to map the fixed image to the image space of the moving image. The inverse of a diffeomorphism can be robust and efficiently computed by many existing methods, such as describe in [44] . In our algorithm, we intentionally set the image with topological change as the fixed image to avoid the additional warping of the function in each iteration, which considerably decreased the computational load. However, in clinical applications, there are many cases when images of individual patients need to be mapped into the image space of a common template. The invertibility of diffeomorphism enables the application of our algorithm in these cases. To illustrate this, we used the tool developed by Luethi et al. [45] to invert the deformation fields shown in Figs. 13 and 18. Fig. 21(a) shows the result corresponding to Fig. 13 , where the first row shows the healthy subject, the second row shows the image with topological change and the third row shows result when the images with topological changes is mapped to the image space of the healthy subject. Similar result corresponding to Fig. 18 is given in Fig. 21(b) , where the third row shows the result when the image with tumor is mapped to the template image space."}, {"section_title": "V. CONCLUSION AND FUTURE WORK", "text": "In this work, we present a new deformable registration algorithm for images with topological changes. The proposed algorithm is capable of incorporating a segmentation as an additional input and eliminating false deformation in the resulting deformation field. The registration is performed by embedding images in Euclidian space into surfaces in an Riemannian space. Then the image registration is modeled as a surface evolution process. The proposed algorithm was extensively tested on different brain MR image datasets carrying minor to severe pathology. The registration results are compared with those obtained from diffeomorphic demons, which demonstrate the efficacy of our proposed algorithm in terms of converging to correct registration in the presence of lesion. Thecurrentversionofourimplementationonlyallowsthefixed image to contain lesion. A direct extension would be to symmetrize the energy function and allow lesions present in both the moving and the fixed images to be modeled by separate probability maps. Other potential improvements include a multiscale implementation and more automated stopping criteria. Mutual information might also be used instead of the image residual in the embedding function , which will further allow our proposed algorithm to register images across different modalities."}, {"section_title": "APPENDIX", "text": "From (6), we get (19) Thus, we can compute the Levi-Civita connections using (5) (see (20) - (23) on the next page). The inverse of the metric Fig. 13 , where the first row shows the healthy subject, the second row shows the image with topological change and the third row shows result when the images with topological changes is mapped to the image space of the healthy subject. (b) Shows a similar result corresponding to Fig. 18 , where the third row shows the result when the image with tumor is mapped to the template image space.\nhas the following form: "}]