[{"section_title": "Abstract", "text": "Background: Semantic variant primary progressive aphasia (svPPA) is a subtype of primary progressive aphasia characterized by two-way anomia and disturbance in word comprehension, with focal atrophy in the left temporal lobe. 18 F]THK-5351 PET imaging is more sensitive to neurodegenerative lesions than conventional imaging modalities such as magnetic resonance imaging (MRI) and cerebral blood flow (CBF)-single photon emission computed tomography (SPECT). Case presentation: Two patients, 64-and 79-year-old men, without notable medical or family history, exhibited disturbances in word comprehension and mild anomia with fluent speech and spared repetition. In both cases, surface dyslexia was observed but prosopagnosia was absent. Although mild depression was detected in 1 of the 2 patients, no behavioral disorders were present in either case. In both cases, MRI revealed atrophy in the anterior and inferior portions of the left temporal lobe. Technetium-99-ethyl cysteinate dimer ([ 99m Tc]ECD) SPECT revealed hypoperfusion in the left temporal lobe. Alzheimer's disease was ruled out by [ 11 C]Pittsburgh Compound-B (PiB) PET scan. Both patients fulfilled the diagnostic criteria for svPPA. Because of mild language deficits and lack of right temporal atrophy, they were considered to be at an early stage of the disease. In both cases, [\n18 F]THK-5351 retention was observed in bilateral temporal lobes, predominantly on the left side. Comparison of different imaging modalities suggested that [\n18 F]THK-5351 was more sensitive in detecting neurodegenerative change in the right temporal lobe than MRI and ["}, {"section_title": "Background", "text": "Semantic variant primary progressive aphasia (svPPA) is a subtype of primary progressive aphasia that is characterized by anomia, disturbance in word comprehension, and other impairments, and presents with atrophy in the anterior area of the left temporal lobe [1] . Although this disorder is pathologically caused by frontotemporal lobar degeneration (FTLD) with inclusion bodies positive for transactivation responsive region DNA-binding protein of 43 Kda (TDP43) in most cases, it was reported that some cases could be attributed to a tauopathy, such as Pick's disease or Alzheimer's disease (AD) [2] .\nIn tauopathies, such as AD or progressive supranuclear palsy, [ 18 F]THK-5351 has been reported to be well retained [3] [4] [5] . However, it was recently indicated that [ 18 F]THK-5351 may bind to monoamine oxidase B (MAO-B), which reflects astrogliosis [6] .\nAlthough few reported studies have used [\n18 F]THK-5351 positron emission tomography (PET) imaging in svPPA patients, in whom tauopathy is supposedly rare, [\n18 F]THK-5351 retention was observed in all studies [7] [8] [9] . Results of these studies supported the hypothesis that [ [10] . In the present article, we present two cases of early-stage svPPA without right temporal atrophy. We examined whether [ 18 F]THK-5351 PET imaging could detect neurodegenerative lesions with more sensitivity than conventional imaging techniques such as magnetic resonance imaging (MRI) and CBF-single photon emission computed tomography (SPECT)."}, {"section_title": "Case presentations", "text": ""}, {"section_title": "Case 1", "text": "The patient was a 64-year-old, right-handed man. He graduated from a junior high school at 15 years of age, and worked in a supermarket. There were no notable issues in either his medical or family history. At 60 years of age, he exhibited symptoms including the inability to name products and to comprehend in-store announcements. He visited the authors' hospital for the first time in 2016, as his symptoms gradually interfered with his work. Proper conduct was maintained, and his spontaneous speech was fluent. However, word-finding difficulty was detected. According to the Neuropsychiatric Inventory (NPI), he had mild depression, possibly caused by his inability to understand the meaning of words, but did not exhibit any behavioral disorders or other findings. Neuropsychological assessment revealed mild anomia, disturbance in word comprehension, and spared repetition (Table 1 ). In the object-naming subtest of the Western Aphasia Battery "}, {"section_title": "C]Pittsburgh", "text": "Compound-B (PiB) PET scans, based on the Japanese Alzheimer's Disease Neuroimaging Initiative (J-ADNI) protocol [11] , yielded negative results. His apolipoprotein E phenotype was E3/5 or E3/7. He was diagnosed with svPPA based on the diagnostic criteria developed by Gorno-Tempini et al. [1] . His naming impairment and word comprehension deficits were mild. Moreover, he presented no atrophy in the right temporal lobe. Accordingly, this patient was considered to be in an early stage of the disease. [ . Z-score maps of CBF-SPECT and voxelbased morphometry (VBM)-MRI were also created using easy Z-score imaging system (eZIS) software (Fujifilm RI Pharma., Tokyo, Japan) and voxel-based specific regional analysis system for AD (VSRAD) software (Eisai, Tokyo, Japan) [12, 13] . In the right temporal lobe, the Z-score of [ 18 F]THK-5351 PET (Z = 3.70) was greater than that of CBF-SPECT (Z < 1.0) and VBM-MRI (Z < 1.0)."}, {"section_title": "Case 2", "text": "The patient was a 79-year-old, right-handed man with 16 years of education. There were no notable issues in either his medical or family history. When he was 77 years of age, his wife noticed that he became unable to name objects used in daily life. During the next two years, his language symptoms had gradually worsened, and he visited the authors' hospital in 2017. Although his spontaneous speech was fluent and proper conduct was maintained, word-finding difficulty was evident, and his episodic memory in daily life was preserved. According to the NPI, there was no behavioral disorder. Neuropsychological assessment revealed mild anomia, disturbance in word comprehension, and spared repetition (Table 1 ). In the object-naming subtest of the WAB, some tasks revealed anomia, which was not improved after the cues of the initial sound of the words. In the vocabulary subtest of the WAIS-III, he was unable to provide the definitions of low-frequency words. In the Kanji (Japanese morphogram) reading task, surface dyslexia was detected. He was unable to understand the meanings of idioms and proverbs. Because auditory word recognition was preserved in SLTA, semantic aphasia was considered to be mild. In the face-recognition subtests of the VPTA, prosopagnosia was not detected. Additionally, there was no impairment in recognizing the faces of family members and acquaintances in daily life. No abnormalities were detected on the neurological examination. MRI revealed atrophy in the anterior and inferior portions of the left temporal lobe. [ "}, {"section_title": "Discussion and conclusions", "text": "In the present study, patients with svPPA exhibited [ 18 F]THK-5351 retention in the bilateral temporal lobes, predominantly on the left side. This finding is consistent with previous observations in a total of 7 cases (Table 2) . Because the 2 cases in the present study exhibited no remarkable amyloid deposition on PiB-PET scan, it is unlikely that paired helical filament (PHF)-tau was highly accumulated in the neocortex of these individuals. Therefore, [ 18 F]THK-5351 retention in the temporal lobe of these patients may be explained by the binding to non-PHF tau or TDP43. Takaya et al. interpreted the results of negativity for PiB and positivity for [ 18 F]THK-5351, which were also found in the present study, as FTLD with tau-positive inclusion bodies (FTLD-tau) [7] . However, svPPA is frequently associated with TDP43 proteinopathy and weakly associated with tauopathies such as Pick's disease [14] . An in vitro study [15] ]THK-5351 retention in autopsy-confirmed AD cases correlated with the density of tau aggregates and MAO-B, and that there was a significant association among tau aggregates, MAO-B, and glial fibrillary acidic protein [6] . Based on these results, they proposed that [ 18 F]THK-5351 PET imaging could be used for monitoring the neuroinflammatory processes, although [ 18 F]THK-5351 has limited utility as a biomarker for tau pathology in AD [6] . It was also reported that [ PET and atrophy on MRI in svPPA [8] . In light of these previous findings, we believe that [ Advanced svPPA presents with atrophy in the temporal lobe, and not only on the left side, but also on the right side, causing prosopagnosia resulting from right temporal lobe damage, and stereotype disorders and other behaviors [17] . In previous studies, five patients with advanced svPPA exhibited left-predominant temporal lobe atrophy and also exhibited marked atrophy in the right temporal lobe. Moreover, in two patients with right-predominant temporal lobe atrophy, it was shown that left temporal lobe atrophy was as remarkable as it was on the right side. In all patients, [ 18 F]THK-5351 retention was more pronounced on the predominant side of atrophy, while it was also observed in the contralateral temporal lobe [7] [8] [9] . The present study was the first to report [ 18 F]THK-5351 PET imaging performed in patients with early-stage svPPA without right temporal lobe atrophy, accompanied by mild anomia and disturbance in word "}, {"section_title": "Availability of data and materials", "text": "All data generated or analyzed during this study are included in this published article. "}]