[{"section_title": "Measurement Invariance of an Instrument Assessing Sustainability of School-based Universal Behavior Practices", "text": "The process of implementing new practices in schools and other agencies has been conceived as occurring in a set of predictable stages of implementation (Fixsen, Blase, Duda, Naoom, & Van Dyke, 2010) . Adelman and Taylor (1997) identified these stages as (a) creating readiness, (b) initial implementation, (c) institutionalization, and (d) ongoing evolution, with creating readiness occurring before actual use of the intervention with the intended recipients, and initial implementation, institutionalization, and ongoing evolution occurring as the intervention is used. Across the literature, each of the various conceptualizations of these phases places sustainability as the final phase and ultimate goal of implementation (Adelman & Taylor, 2003; Coburn, 2003; Fixsen, Naoom, Blase, Friedman, & Wallace, 2005) . Assessing and predicting sustainability are important goals for research and practice because of its positive effects not only on students (e.g., improved student functioning and long term outcomes; Cook & Odom, 2013; Sanford DeRousie & Bierman, 2012) , but also on systems and educators (e.g., improved teacher self-efficacy, organizational health; Baker, Gersten, Dimino, & Griffiths, 2004; Bradshaw, Koth, Bevans, Ialongo, & Leaf, 2008) . The purpose of this study is to advance the assessment of school practice sustainability by investigating the measurement invariance of an established sustainability measure across schools at varied stages of PBIS implementation and with varied student ethnic composition and socioeconomic status (SES) levels."}, {"section_title": "Conceptualization of Sustainability", "text": "Sustainability is an elusive concept to measure because the construct is not as straightforward as is often considered (Vaughn, Klingner, & Hughes, 2000) . Although sustainability has sometimes been viewed as synonymous with maintenance because it seems on the surface to be characterized as achieving the same result with the same practice, the actual process of sustainability involves iterative changes over time to make the practice more effective, efficient, and relevant to the context (Castro, Barrera, & Martinez, 2004; McIntosh, Filter, Bennett, Ryan, & Sugai, 2010; McLaughlin & Mitra, 2001 ). In addition, sustainability is to some extent an outcome in of itself (i.e., continued adherence over time; Han & Weiss, 2005) , but it can also be considered to be the potential for a practice to be sustained over time, a constellation of factors that make continued adherence more likely (McIntosh & Turri, in press ). This latter conceptualization is more useful for practice because it allows for assessment, prediction, and systems-level interventions for sustainability at the start of implementation, rather than waiting until it has been achieved (Pluye, Potvin, Denis, Pelletier, & Mannoni, 2005) ."}, {"section_title": "McIntosh and colleagues (2009) developed a model of sustainability of school-based", "text": "practices that identifies hypothesized factors and mechanisms by which these practices can be sustained. For example, practice priority (including staff buy-in, administrator support, and integration into daily responsibilities) provides the stimulus to continue implementation, even when considering competing initiatives that are alternatives to the practice. Another factor, collection and use of data for decision making is the mechanism by which school teams engage in ongoing evolution that results in adaptations that improve practices, rather than those that remove their effective components (McLaughlin & Mitra, 2001 )."}, {"section_title": "Assessment of Sustainability", "text": "To assess the contextual features most closely related to sustainability in the model, McIntosh and colleagues developed a measure, the School-wide Universal Behavior Sustainability Index: School Teams (SUBSIST; McIntosh, Doolittle, et al., 2009) . The SUBSIST was developed as a self-administered measure of contextual and practice variables predicting implementation and sustainability of school-wide behavior support practices (e.g., programs, curricula) delivered to all students. Development included review of the items and response process by an expert panel and piloting with school teams (McIntosh et al., 2011) , a large-scale study of perceived importance of items by practitioners (McIntosh et al., 2014) , a cluster analysis and construct validation (Hume & McIntosh, in press) , and large-scale factor analysis with prediction of fidelity of practice implementation (McIntosh et al., 2013) . Although developed for use with any universal practice, to date the measure has been validated with School-wide Positive Behavioral Interventions and Supports (PBIS; Sugai & Horner, 2009), a framework for implementing school-based interventions to increase prosocial behavior and decrease problem behavior through environmental redesign, explicit instruction, acknowledgement of prosocial behavior, and team-based use of fidelity of implementation and student outcomes data for continuous improvement. This approach has been implemented in over 18,000 schools in the US and schools in over a dozen countries (Sugai, 2012, October) .\nDespite this recent research validating the SUBSIST with schools adopting PBIS, additional validation is needed for the measure to contribute to important research in predicting and promoting sustainability. First, examining the measure's factor structure in a larger sample would be helpful in determining the extent to which prior findings (McIntosh et al., 2013) are replicated in an independent, cross-validation sample. Additionally, because the definition of sustainability implies implementation over long periods of time (Lucyshyn et al., 2007) , any measure assessing sustainability must have a consistent factor structure at differing periods of time of implementation. Of theoretical and practical interest, sustainability can be assessed for schools at different stages of implementation to identify whether the SUBSIST factor structure holds across initial implementation, institutionalization, and ongoing evolution. Theoretically, it would be expected that as schools continue with successful implementation and weather various barriers to sustainability, sustainability scores would increase over time, as has been shown with a smaller sample (Hume & McIntosh, in press ). Prior to investigating factor score differences across stages of implementation, though, establishing measurement invariance of the SUBSIST is necessary to ensure that observed differences are not artifacts of measurement-related differences (Wu, Li, & Zumbo, 2007) .\nMeasurement invariance of the SUBSIST across stages of implementation may not hold because staff in schools with varying durations of PBIS implementation could interpret or value SUBSIST items differently. Prior research has indicated that school personnel rate perceptions that PBIS is part of systems already in use, integration into new initiatives, family engagement, and staff support as more important for schools in the sustainability phase than initial implementation (McIntosh et al., 2014) . Because these particular variables are viewed as more important for schools in the sustainability phase, it is possible that items assessing these areas on the SUBSIST could be differentially related to the School Priority factor, resulting in noninvariance across stages of implementation. Without assessment of invariance based on stage of implementation, any observed differences in scale scores could be due to actual differences or variations in scale psychometrics across implementation stages (Wu et al., 2007) . Similarly, in the context of future longitudinal research, it is important to establish measurement equivalence to ensure that differences observed over time are not measurement-related artifacts.\nIn addition to investigating measurement invariance across groups with varying duration of PBIS implementation, it is important to consider the extent to which SUBSIST measurement invariance holds across schools with varied student populations. The impact of school ethnic composition and culture on the effectiveness of PBIS and the specific practices and interventions included in local implementations of the PBIS framework has received increased attention in the research literature (Sugai, O'Keeffe, & Fallon, 2012; Vincent & Tobin, 2011) , and similar efforts could be observed in the area of sustainability of PBIS. Prior to investigating variability in SUBSIST scores across schools with varied student populations, however, it is important to investigate the extent to which measurement of factors related to sustainability is consistent across these schools."}, {"section_title": "Purpose of the Study", "text": "The purpose of the study was to cross-validate the initial factor structure of the SUBSIST in a larger, independent sample and assess measurement invariance across three periods of time, corresponding theoretically to three stages of implementation: initial implementation, institutionalization, and ongoing evolution. Invariance across time would provide both evidence of the measure's psychometric adequacy for assessing longitudinal sustainability, as well as provide insight regarding how sustainability changes based on the phase of implementation. In addition, measurement invariance across groups of schools that differed in student ethnic composition and SES was assessed. The specific research questions tested were as follows:\n1. To what extent is measurement with the SUBSIST invariant across three stages of practice implementation and schools with varied student ethnic composition and SES?\n2. Are there mean differences on the subscales of the SUBSIST across stages of implementation and groups of schools with varied student ethnic composition and SES?"}, {"section_title": "Method", "text": ""}, {"section_title": "Participants and Settings", "text": "School PBIS team members and district coaches representing a total of 860 schools implementing PBIS participated in the study. Of the 860 participants, 61% were school PBIS team leaders, 24% were school administrators, 9% were other faculty or staff on the school PBIS team, and 5% were external (e.g., district-level or regional) PBIS coaches. Of the 860 schools, 212 schools (in 149 districts) were in year 0 (planning year) or year 1 (first year of implementation with students), representing the initial implementation stage of the model from Adelman and Taylor (1997) . In addition, 410 schools (in 189 districts) were in years 2 to 4 of implementation, representing institutionalization. Finally, 238 schools (in 88 districts) had been implementing PBIS for 5 or more years, representing the ongoing evolution (sustainability) phase. The schools were located in 14 states and represented all 4 U.S. Census Bureau regions.\nNational Center for Education Statistics (NCES) demographic data were available for 98% of schools and are presented by implementation stage group in Table 1 .\nIn addition to implementation stage, schools were divided into groups based on ethnic composition of students and school-level socioeconomic status (SES). For ethnic composition, the NCES Common Core of Data mean school-level percentage of students of color (i.e., nonWhite) was used to assign schools to groups: 534 schools had fewer than 45% students identified as non-White and 326 schools had 45% or more students identified as non-White. For SES, eligibility for federal Title I funds, an indicator of high numbers or percentages of students from low-SES families, was used to define groups: 335 schools were not eligible and 513 schools were eligible for Title I funds. Title I eligibility was unknown for 12 schools (1% of sample), and these schools were excluded from analyses of measurement invariance across school-level SES."}, {"section_title": "Measure", "text": "The "}, {"section_title": "Procedure", "text": "After obtaining Institutional Review Board approval for the study, the authors worked with several state-level PBIS teams to recruit a large sample of schools at varying years of PBIS implementation to complete the SUBSIST. State PBIS teams recruited any schools implementing or preparing to implement PBIS to participate during existing PBIS training events (either initial or ongoing trainings) and through email contacts. Participation consisted of one member from each school PBIS team actively consenting to complete the SUBSIST through a secure, online survey program."}, {"section_title": "Data Analyses", "text": "Measurement invariance was investigated by fitting a series of multiple-group confirmatory factor analysis (CFA) models. Because items on the SUBSIST have too few response options and exhibited too much negative skew to be considered normally distributed (Lubke & Muthén, 2004) , items were specified as ordinal indicators in the CFA models using the theta parameterization and the mean-and variance-corrected weighted least squares (WLSMV) estimator in Mplus 7 (Muthén & Muthén, 2012) . In addition, because schools were nested in districts, standard errors and chi-square tests of model fit were adjusted to account for districtlevel clustering using the COMPLEX option in Mplus (Asparouhov, 2005) . On several items (ones with only two estimated thresholds in Table 3 or two df in Table 4 ), the full range of response options was not used across all groups. For these items, responses on the lowest two options were combined. Individual SUBSIST items had an average of 6.4% missing data due to participants endorsing items as unknown or not applicable; all available item responses were analyzed using the WLSMV estimator (Asparouhov & Muthén, 2010) and allowed to inform parameter estimates.\nTo investigate configural invariance, which is the extent to which items load on the same factor across groups, two sets of models were estimated. In the first set, fit of the 4-factor SUBSIST model in each group was investigated separately (e.g., initial implementation, institutionalization, and sustainability for analyses of invariance by implementation stage). In the second set, the fit of multi-group models was investigated, with factor loadings (excluding the first item in each factor that was constrained to equal one) and thresholds freely estimated in each group and all item residuals constrained to equal one and all factor means constrained to equal zero in all groups for model identification. In both sets of analyses, model fit was evaluated based on conventional criteria (Mueller & Hancock, 2010) : Comparative Fit Index (CFI) > .95\nand Root Mean Square Error of Approximation (RMSEA) and its 90% confidence interval < .05.\nTo test strong measurement invariance, the multi-group models from the tests of configural invariance were compared to models with loadings and thresholds constrained to be equal across groups, with all item residuals constrained to equal one and all factor means constrained to equal zero in one group for model identification. Model fit was compared using the likelihood ratio (LR) chi-square difference test calculated using the DIFFTEST option in Mplus. Following this global test of strong invariance, possible sources of non-invariance were explored using a backward selection procedure (Kim & Yoon, 2011) . Specifically, we fit baseline models with factor loadings and item thresholds constrained to be equal across groups and then freed the factor loadings and thresholds across groups for one item at a time in comparison models. For model identification purposes, the residual variances of the item with freely estimated loadings and thresholds were constrained to equal one in all groups in the comparison models. "}, {"section_title": "Results", "text": "Results are organized in three main categories: tests of configural invariance, strong measurement invariance, and latent mean differences and factor correlations."}, {"section_title": "Configural Invariance", "text": "Fit indices for the models testing configural invariance are presented in Table 2 . In general, model fit of the four-factor SUBSIST model was quite similar across stages of implementation (i.e., initial implementation, institutionalization, or sustainability), school student ethnic composition (i.e., < 45% non-White or > 45% non-White), and school SES (i.e., eligible or not eligible for Title I "}, {"section_title": "Strong Invariance", "text": "To investigate strong measurement invariance, the fit of the multi-group configural invariance models was compared to models with factor loadings and item thresholds constrained to be equal across groups. Results are presented separately for analyses by implementation group, school ethnic composition, and school SES.\nStage of PBIS Implementation. Across implementation groups, the configural model fit better than the strong invariance model, were negligible and suggested better fit for the strong invariance model. To further investigate potential sources of non-invariance, factor loadings and thresholds were freed one item at a time. "}, {"section_title": "Latent Variable Correlations and Means", "text": "Correlations among the latent variables, factor means, and factor standard deviations in the partially-invariant implementation group model and the strong invariance ethnic composition and SES models are presented in Table 5 . In general, all factors were positively and strongly correlated (rs = .53 to .85, p < .001) in all groups. Regarding the PBIS implementation model, none of the factor means in the institutionalization group significantly differed from means in the initial implementation group. In contrast, means for School Priority and Team Use of Data were higher (p = .008 and .001, respectively) in the sustainability group compared to the initial implementation group, and these differences were of small to medium magnitude (d = .36 and .52, respectively). In the school ethnic composition model, the mean of the Team Use of Data factor was lower in schools with 45% or more non-White students (p = .04), but the difference was of small magnitude (d = .24). In the school-level SES model, the mean of the School Priority factor was higher in schools eligible for Title I funds (p = .02), and the difference was also of small magnitude (d = .20) . No other latent means differed statistically from reference group means in the models."}, {"section_title": "Discussion", "text": "Overall, results provided additional support for the two school-and two district-level factor structure of the SUBSIST in a sample independent from the one used in McIntosh et al. (2013) . In addition, the results supported the four-factor solution across groups of schools that differed in duration of PBIS implementation, student ethnic composition, and student SES.\nConfigural invariance of the SUBSIST was supported by adequate fit of the four-factor model in each group and the multi-group models.\nResults also supported strong measurement invariance across implementation groups for all items except one on the SUBSIST and for all items across school-level ethnicity and SES groups. Although change in approximate fit indexes from the configural to strong measurement invariance model was below the commonly-used criterion of change less than .01 on the CFI (Cheung & Rensvold, 2002) , use of the backward selection procedure described in Kim and Yoon (2011) with Bonferroni and Oort (1998) adjustment of critical values for the LR test indicated that the item \"SW-PBIS is considered to be a typical operating procedure of the school (it has become \"what we do here/what we've always done\")\" had different factor loadings and/or item thresholds across implementation groups. Logically, one would expect that schools that have been implementing PBIS longer would be more likely to perceive PBIS as a typical practice, and indeed, the item means increased across implementation groups (initial implementation: 2.96, institutionalization: 3.34, sustainability: 3.66) with more pronounced negative skew in groups with greater implementation time. In a related study with the original validation sample, this item was not perceived as important for initial PBIS implementation, but considering PBIS to be a typical operating procedure was rated by school and district PBIS team members as among the most important factors related to sustained implementation (McIntosh et al., 2014) . Consequently, it is not surprising that as implementation time increased, it became easier for school teams (i.e., required less School Priority) to rate the item as more true of the school.\nSimilarly to the results of McIntosh et al. (2013) , strong positive correlations were found among the four SUBSIST factors, and the magnitude of correlations appeared to be similar across implementation groups in the final, partially-invariant model that freed factor loadings and thresholds for the \"typical operating procedure\" item and across groups in the fully-invariant school-level ethnicity and SES models. Inspection of latent factor mean differences indicated no statistically significant differences between the initial implementation and institutionalization groups; however, levels of School Priority and Team Use of Data were greater, with small to medium size differences, in the sustainability compared to the initial implementation group.\nThese findings are consistent with perceptions of school and district PBIS team members that school-level factors, particularly administrator priority, are more important than district-level factors for sustained implementation (McIntosh et al., 2013) . In addition, the current finding that the largest mean differences were on Team Use of Data is consistent with prior research indicating that this factor had the largest independent association with PBIS implementation fidelity while accounting for the other factors on the SUBSIST (McIntosh et al., 2013) . Small and statistically significant latent mean differences were also found in the school-level ethnicity and SES models. Schools with 45% or more students identified as non-White had lower scores on Team Use of Data compared to schools with fewer non-White students, and schools eligible for Title I funds had higher scores on School Priority than schools not eligible for funds.\nAlthough sometimes poverty is viewed as a strong barrier to sustainability, due to reduced access to resources (Rogers, 2003) , staff in schools serving more students in poverty may view preventive practices such as PBIS as more valuable, and thus would rate it as a higher priority.\nThese findings should be considered in light of several limitations. First, the SUBSIST is a survey measure of perceptions completed by school or district PBIS team members, and it is possible that team member perceptions may not be representative of all team members in the school. This concern is partially tempered by findings of high inter-rater reliability for the SUBSIST in a prior investigation (McIntosh et al., 2011) ; however, results of the current study would be strengthened by inclusion of reports from multiple school team members and/or the addition of direct observation measures of factors related to sustainability. In addition, although groups that varied in terms of years of PBIS implementation were included in the study, the study was cross sectional. Consequently, the extent to which longitudinal invariance would hold as the same schools continue to implement PBIS is unclear.\nThe current findings of strong measurement invariance, excluding one item, across implementation groups for the SUBSIST is an important first step toward inclusion of the SUBSIST in a longitudinal investigation examining the dynamic interrelation of factors related to sustainability and fidelity of PBIS. Although Team Use of Data was found to be the most important factor in relation to implementation fidelity (McIntosh et al., 2013) , the predictive power of the SUBSIST factors has not been examined prospectively. In addition to the predictive strength of each SUBSIST factor, future research should also examine the extent to which these associations change across stages of implementation. It is possible that the SUBSIST factors most predictive of sustainability during initial implementation differ from the factors predicting continued implementation after several years of institutionalization. We hope that by setting the stage for future longitudinal research, the current study will contribute to rigorous examination of factors that promote the sustained implementation of evidence-based school initiatives.\nStark, S., Chernyshenko, O. S., & Drasgow, F. (2006) . Detecting differential item functioning with confirmatory factor analysis and item response theory: Toward a unified strategy. Psychology, 91(6), 1292 -1306 . doi: 10.1037 /0021-9010.91.6.1292 Sugai, G. (2012 . School-wide PBIS: An effective framework for teaching and learning."}, {"section_title": "Journal of Applied", "text": "Paper presented at the National Forum on School-wide Positive Behavior Support, Chicago, IL. "}]