[{"section_title": "Abstract", "text": "Abstract. Models of misfolded proteins (MP) aim at discovering the bio-mechanical propagation properties of neurological diseases (ND) by identifying plausible associated dynamical systems. Solving these systems along the full disease trajectory is usually challenging, due to the lack of a well defined time axis for the pathology. This issue is addressed by disease progression models (DPM) where long-term progression trajectories are estimated via time reparametrization of individual observations. However, due to their loose assumptions on the dynamics, DPM do not provide insights on the bio-mechanical properties of MP propagation. Here we propose a unified model of spatio-temporal protein dynamics based on the joint estimation of long-term MP dynamics and time reparameterization of individuals observations. The model is expressed within a Gaussian Process (GP) regression setting, where constraints on the MP dynamics are imposed through non-linear dynamical systems. We use stochastic variational inference on both GP and dynamical system parameters for scalable inference and uncertainty quantification of the trajectories. Experiments on simulated data show that our model accurately recovers prescribed rates along graph dynamics and precisely reconstructs the underlying progression. When applied to brain imaging data our model allows the bio-mechanical interpretation of amyloid deposition in Alzheimer's disease, leading to plausible simulations of MP propagation, and achieving accurate predictions of individual MP deposition in unseen data."}, {"section_title": "Introduction", "text": "A peculiarity of neurodegenerative diseases (NDs) is the misfolding and subsequent accumulation of pathological proteins in the brain, leading to cellular Data used in preparation of this article were obtained from the Alzheimers Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu). As such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data but did not participate in analysis or writing of this report.\ndysfunction, loss of synaptic connections, and neuronal loss [1] . Misfolded protein (MP) aggregates can self-propagate and spread the pathology between cells and tissues, along functional or structural brain networks [2] .\nWith the aim of describing such processes, a variety of mathematical models has been proposed for providing better insight into the microscopic kinetic dynamics governing the processes of proteins propagation [3] . Complementarily, another class of models relies on macroscopic measurements from molecular and structural imaging for describing the effects of MP propagation along brain networks [4, 5, 6, 7, 8] . Such MP kinetics models are of strategic relevance, as they may provide new understanding of the mechanisms involved in NDs, and thus allow identification of novel strategies for treatment and diagnosis. These models usually define the propagation dynamics through diffusion equations. This modelling choice allows to reduce the number of parameters to be estimated, but comes at the expenses of an oversimplification of the dynamics governing the MP process. First, while the pathological kinetics may be assimilated to diffusive processes in short term observations, the long term evolution of NDs are unlikely to have diffusive properties. For example, the asymptotically constant behaviour of NDs may not be described by the stationary and constant rate of change specified by diffusion equations. Second, such models require a precise definition of the time axis, which is typically not well defined in clinical data sets. To address this issue, several alternative disease progression models (DPM) have been proposed [9, 10, 11, 12] . These approaches allow to reconstruct biomarkers trajectories along the long term disease progression by \"stitching\" together short term individual measurements. Each subject is characterized by specific time parameters quantifying their pathological stage with respect to the estimated global group-wise evolution. However, these models provide an \"apparent\" description of biomarkers dynamics, without in fact elucidating the kinetics and relationships across biomarkers.\nTo date, no modelling framework allows for joint MP kinetics modelling and reconstruction of the biomarkers dynamics across the whole disease long term evolution. The problem is challenging since it requires to simultaneously account for short term observations to reconstruct the long term disease progression, and to estimate group-wise dynamics parameters specified by high-dimensional dynamical systems.\nIn this paper we solve this problem by formulating a model for the dynamics of MP accumulation, clearance and propagation (ACP) across structural brain networks, which includes data-driven estimates of the long term protein trajectories from short term data. Figure 1 shows a schematic representation of our framework. The ACP model is formulated as a constrained regression problem in a Bayesian non-parametric setting, where the MP progression is modelled by a Gaussian Process (GP), and constraints on the MP dynamics are imposed through systems of non linear ordinary differential equations (ODEs). The Bayesian setting allows for uncertainty quantification of the MP dynamics while, to achieve tractability, the inference problem is solved via stochastic variational inference. The constrained regression framework provides a complete Fig. 1 . Schematic representation of our framework. Here we have two brain regions whose MP concentrations c1 and c2 are collected for many subjects over a short term time span (A). The dynamics of such concentrations is described in terms of the accumulation, clearance and propagation processes, with unknown parameters (B). The proposed Bayesian framework estimates the distribution of such parameters (here plotted against their ground truth values -the vertical black lines in the distributions subplot), and the long term trajectories with respect to the estimated disease time axis (C).\ndescription of the MP dynamics, which can be subsequently used for simulating and predicting MP changes over time through forward integration of the estimated dynamical systems. The estimated MP dynamics also provide an instrument to investigate different hypotheses of MP propagation.\nWe test our framework against synthetic data and compare its performances in recovering the simulated evolution and the time reparameterization as compared to standard disease progression models based on monotonic constraints. Finally, we demonstrate our framework on AV45-PET data of Alzheimer's Disease (AD) subjects from the ADNI data set. We show that it allows to compare different hypothesis of MP kinetics: diffusive vs non-linear and time-varying dynamics properties (ACP). We show that the ACP model outperforms diffusive ones in terms of prediction of amyloid deposition in unseen follow-up data."}, {"section_title": "Methods", "text": ""}, {"section_title": "Non-linear and time-varying MP kinetics model", "text": "We consider the brain as a system of N interconnected regions, where each region i (i = 1, ..., N ) is characterized by its concentration c i (t) of MP proteins along time. Standard MP kinetics models are based on the definition of dynamical systems of the formċ (t) = βAc(t),\nwhere c(t) is the vector of concentrations of MP across brain regions, A is a diffusion matrix and β is the parameter describing MP propagation. The operator A is usually defined as the graph Laplacian of the brain connectome, while β is typically assumed to be constant throughout the whole disease progression [4] .\nHere we introduce an extension of this paradigm which accounts for the dynamics characterized by the time-varying and non-linear parameters of MP accumulation, brain response via MP clearance, and long term propagation across neighbouring neuronal cells: the ACP model. Within this setting, equation (1) is reformulated asċ\nwhere the matrix M ACP is factorized into (dependence on t is omitted but implied):\nHere, M AC (c) accounts for the total aggregation of MP plaques, i.e. sum of accumulation and clearance, while the remaining two matrices describe long-range propagation from (M out (c)) or to (M in (c)) for each region. Our assumptions on the MP dynamics are the following:\n-no aggregation nor propagation occur in healthy conditions. MP plaques aggregation develops when the accumulation-clearance equilibrium breaks. This can be modelled with the assumption thatk a −k c > 0, wherek · are the maximum rates of accumulation and clearance and are assumed to be constant across regions. We definek t :=k a −k c as the maximum rate of total aggregation. -We hypothesize a region-dependent critical threshold η i above which the aggregation process reaches a plateau. This is modelled by a sigmoid function\n-When passing a critical threshold γ j the MP concentration in each region j saturates and triggers propagation towards the connected regions. Also, it reaches a plateau when passing a threshold η j . Again this can be modelled by a function asymptotically dropping to zero:\nrepresenting the non-linear rate of propagation from region j to region i. Herek ij is the maximum rate of propagation between the two regions, and we assumek ij =k ji . We combine the propagation coefficients in a matrix describing the global brain-scale propagation process: K(c) = (k ij (c j )) ij . -The substrate for propagation is the structural connectome, here represented by the symmetric and normalized adjacency matrix of connections between brain regions A = (α ij ).\nSuch assumptions are formalized into the following functionals:\nOverall, the ACP model depends on 1+2N +"}, {"section_title": "Extending MP dynamics modelling to account for time reparametrization", "text": "Once defined our dynamical system as the one described in (2), we need to incorporate it within a regression framework for short term data. Let us assume to have S subjects for which we have measures of MP concentrations C in N brain regions at different time-points, encoded in a vector t: C is therefore the realization of c(t) at times t. For notation simplicity we assume here t to be the same for every subject, but computations extend easily to more general cases. The observations C for subject k at a time points t can be modelled as a random sample from the following generative model [10] :\nHere f is the fixed effect function modeling the concentrations' longitudinal evolution and is modelled as a GP; τ k (t) is the individual time reparametrization with respect to the global group-wise evolution, and is modelled as a linear shift τ k = t k + d k ; ν k is the individual random effect, assumed to be Gaussian correlated perturbations N (0, φ k N ); is the observational noise. We introduce constraints on the dynamics of the model f enforcing the concentrations' evolution to the ACP model. This means specifying a family of admissible functions whose derivatives evaluated at the inputs t satisfy the ACP constraint:\nWe note that the constraints are imposed only on the group-wise dynamics f and not on the random-effects. This is done to reduce complexity and the model's parameters. Relaxing the constraints at individual level is also meaningful, as some subjects may be characterized by potentially different dynamics due to specific clinical conditions."}, {"section_title": "The inference scheme", "text": "We define as F k the realization of f at τ k (t), and asḞ k the set of realizations of f and of its derivatives at τ k (t). We also indicate by F , ν, andḞ the collections\nfor all the subjects (k = 1, ..., S). Similarly, we define τ as the collections of τ k . We denote by θ the set of parameters for the MP dynamics, and by φ N the parameters associated to ν. Our framework is formulated as the constrained regression defined through two likelihood elements: a data fidelity term p(C|F , φ N , τ , ) and a constraint term p(A|Ḟ , θ, τ , ζ), where and ζ are the associated noise parameters.\nFollowing [13] we solve the constrained regression problem by determining a lower bound for the marginal function\nwhere\nWe assume the likelihood for data and constraints to be respectively Gaussian and Student-t with parameters and ζ [13] , and we approximate the GP via random features expansion, as shown in [14] . Specifically, the GP realizations can be expressed as F ≈ h(tΩ)W , where Ω is a linear projection of the input t into the random feature space specified by the trigonometric activation functions h(·) = (cos(·), sin(·)), and W are the regression parameters. Such approximation extends to the derivatives of the GP thanks to the chain rule [13] . As a result, the GP function and its derivatives can be both identified by the parameters W and Ω. Solving (10) amounts at doing inference on F , which in this setting means inference on W and Ω. Following [14] , we optimize (10) through variational inference of W , Ω and θ. This leads to the optimization of the evidence lower bound (ELBO):\nHere DKL(q|p) is the Kullback Leibler divergence between p and its variational approximation q; we assume q(W ) and q(θ) to be Gaussian. Details on the implementation setting are in Supplementary Material."}, {"section_title": "Simulation Results", "text": "We test the ability of our framework in reconstructing the long term trajectories of the ACP dynamical system from noisy samples of short term data (Figure 2 ).\nResults are compared to the ones obtained by using the GP Progression Model [10] , which includes a monotonicity constraints on the trajectories. We also test the model with data generated from a single subject and with known time-axis (Supp. Mat.). Synthetic data are generated according to the parameters specified in Table 1 . Figure 2B )-top shows the reconstructed MP trajectories from short-term data in 2A), for a two-dimensional test set. We run synthetic tests N subjects N regions time interval time-points per subject noise 50\n), max(C)) Table 1 . Synthetic data generation parameters. varying the initial values of the MP parameters, the noise and the number of regions. Then, we compared our estimates of the GP and time-shift parameters with results obtained using the GP Progression Model in [10] . Table 2 shows results in terms of distributions of root mean squared errors (RMSE), for increasing number of regions. Distributions of RMSE were obtained by sampling 200 times from the estimated distributions. The ACP model generally provides better estimates for the reconstruction of the long term trajectories, as well as for the estimation of the individual time-shift as compared to the standard DPM provided by the monotonic GP. Moreover, while our framework allows the identification of the prescribed dynamical system parameters with high degree of accuracy ( Table 2 , last row), the monotonic DPM does not allow the estimation of these quantities. Table 2 . RMSE results for GP fit, time-shifts estimates and dynamical parameters for both the GP Progression Model with monotonicity (GP) and the ACP model. The error for the dynamical parameters is expressed, in percentage, relatively to the ground truth parameters."}, {"section_title": "Modeling amyloid deposition from imaging data", "text": ""}, {"section_title": "Data Acquisition and Preprocessing.", "text": "ADNI data This study used 1091 individual data from ADNI, with a total of 2380 longitudinal data. We collected clinical, demographic and AV45-PET SUVr data. All the subjects with either \"Dementia\", \"Mild Cognitive Impairment\" or \"Cognitively Normal\" clinical diagnosis were selected. The ADNI was launched in 2003 as a public-private partnership, led by Principal Investigator Michael W. Weiner, MD. The primary goal of ADNI has been to test whether serial Magnetic Resonance Imaging (MRI), Positron Emission Tomography (PET), other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of MCI and early AD. For up-to-date information, see www.adni-info.org. ADNI AV45-PET SUVR data are already computed on Freesurfer-defined regions, and normalized against the reference region (cerebellum); for full information please see: https://adni.bitbucket.io/reference/docs/. We constructed a regression model for each region separately with normalized SUVr as dependent variable and gender, age, APEO4 genotype and education as independent variables. The residual of the fit is the new value associate to each region. This was done for both patients (AD+MCI) and control (CN) groups separately. Then we discarded white matter, ventricular and cerebellar regions, remaining with 82 regions. we averaged SUVr of each region from both hemispheres; among the 41 remained regions, we averaged together the ones belonging to the same lobe/the same subcortical region. We selected 11 macro-regions, i.e. frontal, temporal, parietal, cingulate, thalamus, caudate, putamen, pallidum, hippocampus, amygdala, accumbens, and averaged together all the values of ROIs mapped to the same macro-region. The macro-region definition was done to reduce computational expenses and aid interpretability of the resulting MP parameters. Demographic and clinical details are shown in Table 3 . We split the data set in two parts: the D1 data set contains all the longitudinal data for each subject up to the second-to-last time points. The remaining time-points were included in a second data set D2. Subjects with one measurement only were included in D1. Data set D1 includes 1651 longitudinal data of 1091 subjects; D2 contains 731 cross-sectional data. We run the models on D1, estimating MP dynamics, GP parameters and individual time-shifts, and used D2 to validate model predictions. HCP data. Data used in the preparation of this work were obtained from the MGH-USC Human Connectome Project database. We collected 3D T1w and DTI of 24 age and gender-matched subjects. The pipeline for structural connectome generation is described in [5] . We averaged the 24 connectomes together and obtained an average young, healthy connectome. Finally, we averaged together the regions belonging to the same lobe or subcortical area (to obtain 11 macro-region) and we set to 0 all the weights below the average weights across nodes, and to 1 the weight above. This last step was performed in order to remove the weak connections."}, {"section_title": "Estimated long term dynamics.", "text": "We analyzed the AV45-PET data with two different models of MP kinetics: the ACP model of equation (2) -which has non-linear and time-varying dynamics, and a full diffusive model. The diffusion dynamics were prescribed by the systemċ(t) = Bc(t), where the coefficients b ij of B are estimated (along with individual time parameters) with our framework. Figure 3A) shows the long term trajectories estimated with both models, for four regions. Full results are in the Supplementary Material. Figure 3B) shows the time associated to each regional trajectory at which maximal separation between \"Cognitively Normal\" and \"Alzheimer's disease\" subjects was measured. The time distribution is inferred from the trajectory distribution associated to each region. The dynamics and orderings of ACP and diffusion provide plausible description of the pathological evolution of amyloid deposition, compatible with previous findings in histo pathological and imaging studies in AD [15, 16] . Figure 3C ) shows the estimated vector fields for the relative dynamics of the frontal and parietal lobes. This vector field is obtained by integrating the dynamical system estimated for respectively ACP and diffusion models. Therefore it does not correspond to extrapolation of the curves in Figure 3A) . Here the other biomarkers are set constant to their mean values. We can appreciate the non-linear dynamics of the ACP model, as well as the linear dynamics of the diffusive model. The resulting vector fields provide a tool for interpreting and comparing mechanistic hypotheses. Indeed, Figure 3C) shows that the ACP model estimates an initial fast propagation, which slows down with time. The opposite behaviour is observed by analyzing the dynamics of the diffusion model, with an acceleration in the propagation along with the progression. This behaviour is unlikely to reproduce real-case scenarios, where amyloid aggregation eventually slows down and does not accumulates indefinitely. This result points to the higher biological plausibility of the proposed ACP model. For each subject in D1 with follow-up measurements in D2, we computed the streamline associated with their individual dynamics (in the whole 11-D space), and estimated the values of each biomarker at the corresponding follow-up time. We computed the RMSE for each estimate, and bootstrapped over the MP dynamic parameters 200 times, obtaining RMSE distributions (Table 4 ). Figure 4 shows the connectomes where the edges' colors are set to be proportional to the values of the estimated MP parameters for the ACP model (plot on the left hemisphere), or to the values of the propagation parameters for the diffusive model (plot on the right hemisphere). The parameters were normalized to [0, 1] to aid comparison. The paths appear to be different for the two models and the ACP model seems to better describe the frontal-posterior pathway known to characterize amyloid deposition in AD [15, 16] . Table 4 . RMSE (mean, sd) for the ACP and the diffusion models estimates. The ACP model generally provides predictions closer to the observed follow-up values. "}, {"section_title": "Predictions performances of the models.", "text": ""}, {"section_title": "Misfolded proteins propagation pathways.", "text": ""}, {"section_title": "Discussion", "text": "We presented a spatio-temporal model of MP dynamics over brain networks. The model is based on the joint estimation of long term MP dynamics and time reparametrization of individuals observations, and is expressed within a GP regression setting, where constraints on the MP dynamics are imposed through non-linear dynamical systems, which account for accumulation, clearance and propagation of MP. Experiments on simulated data show that our model accurately recovers prescribed rates along graph dynamics and precisely reconstructs the underlying progression. When applied to AV45-PET brain imaging data our model allows the bio-mechanical interpretation of amyloid deposition in Alzheimer's disease, leading to plausible simulations of MP propagation, and achieving accurate predictions of individual MP deposition in unseen data.\nThe method has some limitations: first of all, structural connectome estimation using tractography is known to be prone to false positive and negative connections. Nevertheless, here we take an average connectome over multiple young and healthy subjects, which we believe provides a reasonable anatomical reference. Another limitation of the model is that it assumes that all subjects follow the same disease progression pattern, which might not be the case in heterogeneous data sets such as ADNI.\nThe ideas we propose here extend to a much larger range of diseases and alternative models of propagation, such as propagation via functional networks [6, 8] , or different kind of tractography to represent intra-and extra-axonal propagation [5, 7] ."}, {"section_title": "Supplementary Material", "text": ""}, {"section_title": "Details on the implementation", "text": "The optimization is performed with stochastic gradient descent with adaptive moment estimation (Adam), through the alternate optimization of i) the approximated posterior over W , the likelihood parameters for the GP and for the random effect, ii) the individual time-shifts parameters, and iii) the approximated posterior over the MP parameters and the likelihood parameters of the constraints. Also, for the MP parameters scheme, we split optimization overk ij andk t , and over η i and γ i . This is done to reduce the variability of their gradients, as such parameters have values in different ranges. Further, we first run the optimization scheme for estimating values of the two brain-level parameters η and γ, and then estimate η i and γ i using as starting points the estimated values of η and γ and lowering the learning rate.\nSimulation on single-subject Figure 5 shows examples of long term trajectories that is possible to obtain by varying the MP parameters of the ACP model, on a specified time interval, for a two-region problem. Figure 6A ) and 6B) show the results of the fit for the example data in Figure 2 top left in term of the concentration evolution over time of the MP dynamics and of the MP parameter.\nIn order to evaluate the accuracy of the model in reconstructing the parameters for increasing number of regions, we generated other five two-dimensional problems varying the MP parameters and the noise (as in Figure 5 ), and repeated the procedure for increasing number of regions: 3, 5, 11 and 42. Table 5 shows the distributions of the rooted mean square errors (RMSEs) for each MP parameter and for the GP parameters (estimated VS ground truth parameters), at increasing number of regions. We note that the RMSEs are always close to zero, with the smallest error consistently on k t and the biggest on η or γ. Full results for the real data scenario Figure 7 shows the estimated long term trajectories for all the 11 macro-regions, in the time interval [-10, 15] , for both the models. "}]