[{"section_title": "Abstract", "text": "Abstract This report presents pilot-test results for a science professional development program featuring online, on-demand materials developed by the National Science Teachers Association. During the spring 2006 semester, 45 middle school teachers from three different school districts across the United States participated in a professional development program designed to facilitate content knowledge and skills in the area of Newtonian force and motion. Participants from one of the school districts experienced a full-day instructor-led workshop along with two web-based seminars with a content-area expert. This was followed by a 4-week period of time in which they had access to self-directed, online, on-demand instructional materials that included activities, information, simulations, examples, and practice with immediate feedback over the targeted outcomes. Participants from the two other school districts only had access to the online materials with no instructor-led experience. This report documents positive gains in achievement as well as levels of confidence in teaching the material within all of the professional development groups. Data about the use of specific features within the online material are included, as well as completion rates and attitude survey results. Recommendations for future study are also included."}, {"section_title": "Introduction", "text": "By their own admission, many K-8 professional educators in the United States have recognized a need for professional development in specific science content areas. Responding to the National Survey of Science and Mathematics Education (Horizon Research 2000), 77% of 665 K-5 teachers who participated in the survey indicated that they were ''Very Well Qualified'' to teach reading/ language arts, while only 14% indicated they were ''Very Well Qualified'' to teach physical science. Similarly, 529 middle school teachers (grades 5-8) indicated that they did not generally feel well qualified to teach physical science subjects. Only 10% of these middle school respondents reported that they felt ''Very Well Qualified'' to teach modern physics concepts, 23% felt they were ''Very Well Qualified'' to teach about light and sound, and 29% felt ''Very Well Qualified'' to teach concepts related to force and motion.\nWhen asked about the need for professional development in science, 72% of the elementary school teachers and 56% of the middle school teachers responded that they perceived a moderate or substantial need for professional development within the preceding 3 years in the area of ''deepening my own science content knowledge'' (Weiss et al. 2001) .\nIn additional to teacher self-reporting, the need for continued professional development in science content areas is suggested in current revisions made to President Bush's No Child Left Behind Act education plan. These revisions address the need to hold school divisions more accountable for their teachers' science content knowledge preparation, and the revisions also describe changes to student achievement accountability that will include science test results as well as existing math and reading scores. Beginning in [2008] [2009] , disaggregated results from science assessments at three grade levels will factor into state accountability calculations (US Department of Education 2007).\nThe National Science Teachers Association (NSTA) has recently responded to the tremendous need for science content professional development opportunities by creating an online learning center for K-12 educators. Integral to this online learning experience are on-demand science content instructional modules called SciPacks. Each SciPack addresses a specific science content area and is composed of web-delivered interactive instructional subcomponents called science objects. Science objects include information, interactive examples, practice with immediate feedback, and a short interactive quiz over the skills associated with the subtopic. These skills are aligned with the National Science Education Standards (NRC 1996) and Benchmarks for Science Literacy (AAAS 1993). In addition to the instructional material, each SciPack includes a posttest requiring the learners to score 70% or higher in order to be credited with ''passing'' the professional development experience.\nDuring the fall of 2005, the NSTA contracted with a variety of agencies and consultants to begin the SciPack development process. The plan included working with subject matter experts and software design specialists to create the first few SciPacks addressing critical content needs in the area of physical science and Earth science. These two general areas were targeted for initial development because they represented two content areas in which elementary, middle, and secondary science teachers reported the least college coursework preparation (Weiss et al. 2001) .\nThe initial SciPacks were developed as web-delivered, on-demand instructional experiences that could be used by individual teachers or by entire school districts as part of a comprehensive professional development program to address content skills in both physical and Earth science. The procedures for developing the SciPack instructional materials were based on steps common to many systematic models of instructional design, including those described by Dick et al. (2001) , Gagne et al. (1992) , and Merrill (1994) . The process began with the identification of overall key ideas associated with a specific scientific topic. These key ideas were generated from the National Science Education Standards (NRC 1996) and the Benchmarks for Science Literacy (AAAS 1993), as well as from conversations with scientists practicing in a scientific field associated with the selected topic. Once key ideas were established, instructional goals and subordinate evidences of understanding (instructional objectives) related to each specific science content topic were generated. These were then used to generate assessment items and guide the content developers in the writing of the material that would become the web-based SciPack experience. Content and teaching experts, graphic designers, and web programmers were included in the development team; instructional design and evaluation experts also provided feedback throughout the development process. The design approach of the SciPacks was based on the principle that learners must struggle with some problem, observation, data, etc., so that they might develop the intended scientific ideas themselves. The SciPacks were designed to present problems, phenomena, demonstrations, and simulations using the following five experiential phases: Engage, Explore, Explain, Elaborate, and Evaluate. This is the basic learning cycle derived from Roger Bybee's 5E instructional model (Trowbridge and Bybee 1990) . The design of simulations and interactive demonstrations incorporated the current body of literature related to cognitive load theory (see van Merrienboer and Sweller 2005) .\nThe NSTA has been involved in designing and facilitating science content professional development experiences for many years, but the development of selfdirected, web-based instruction represented a relatively new model of professional development delivery for the organization. As the initial SciPacks were in development, the design team carefully reviewed different ways in which this material could-and perhaps should-be made available and implemented as part of individual, school, or districtwide professional development plans. After consulting with a number of professional development experts from different school districts, it was decided that initial field trials for the new SciPacks would occur within existing professional development frameworks for schools willing to participate in testing the material.\nBy the end of the spring 2006 semester, the first SciPack was completed and ready for pilot testing. The content for this SciPack addressed Newtonian force and motion concepts. Arrangements were made to implement the professional development experience with teachers in three separate school districts in three different states. Because the school districts had their own professional development program procedures in place, NSTA worked with the science curriculum coordinators for each district to develop an implementation plan that would meet the needs of the participants within the parameters of their districts' professional development policies. In the end, one of the school districts requested that their participating faculty members meet together and experience a full day of faceto-face, instructor-led training with a content-area expert, followed by access to the SciPack material to be experienced on their own time. The other two participating school districts adopted a model of no face-to-face instructor-led meetings, with participants having access to the online SciPack material on their own time. However, both of these districts did request that some mechanism be implemented that could enable participants to ask questions about the material if needed. It was decided that the webbased material would include a button that, when selected, would produce an e-mail form enabling the learner to ask specific questions about the instructional material. A cadre of content experts were enlisted to be ''on call'' for the duration of the implementation, providing clarification as well as motivational and probing question support for the learners. This type of instructional resource has been demonstrated to add value as well as increase achievement for learners who otherwise would not have ready access to such ''cognitive apprentice'' support mechanisms (Collins et al. 1991) .\nThis report presents the results of the pilot-test evaluation that was conducted during the implementation of these two different approaches to the SciPack professional development material. This evaluation was both formative and summative in nature, with performance data and attitudes about the experience recorded and analyzed. Interviews with key stakeholders were also conducted at the conclusion of the evaluation period. Performance data, attitudes, and interview summaries are reported for each of the districts participating in the evaluation. Where possible, tabulated data are grouped by type of implementation model."}, {"section_title": "Description of the Spring 2006 Pilot-test Program", "text": "A total of 45 middle school teachers from three different school districts across three states participated in the complete spring 2006 pilot-test experience. Table 1 presents basic information about the three participating school districts.\nIn all three school districts, the professional development coordinator or science curriculum specialist solicited middle school teacher volunteers to participate in the professional development experience. Participants in the completely web-based, on-demand program were informed that the materials would take *6-10 h to complete. Those participating in the instructor-led plus web-based, ondemand (blended) program were informed that, in addition to the 6-10 h of web-based materials, they would also need to attend a 6-h workshop conducted by a force and motion subject matter expert. Incentives for participation included earning hours toward professional development requirements and/or earning recertification credit, and receiving a gift certificate to be used for the purchase of science materials from the NSTA bookstore."}, {"section_title": "Program Objectives", "text": "The Force and Motion SciPack was designed to facilitate the learning of content knowledge and skills associated with Newton's three laws of motion. The practice items, science object quiz items, the final SciPack assessment items, and the pretest/posttest application items were aligned with the following outcomes, derived from the National Science Education Standards (NRC 1996) and Benchmarks for Science Literacy (AAAS 1993):\n1. Position and motion 1.1 The learner will be able to identify the position of one object relative to the position of another object by providing the approximate distance and angles between the objects, the angles being measured from some reference line. 1.2 Given necessary information, the learner will be able to define the concepts of speed and velocity and will be able to determine the average speed of an object. 1.3 Given magnitude and direction, the learner will be able to describe, draw, or otherwise detail an object's velocity. 1.4 The learner will be able to define acceleration, recognize examples of acceleration, and develop his or her own examples of acceleration. 1.5 The learner will know that the term acceleration means a change in velocity, be that speeding up, slowing down, or changing direction. 1.6 The learner will be able to distinguish between constant and changing motion. 2. Newton's first law 2.1 The learner will be able to recognize and give examples of forces. 2.2 The learner will be able to recognize and give examples of balanced and unbalanced forces. 2.3 The learner will be able to equate the term unbalanced force with ''a net force that does not equal zero.'' 2.4 The learner will be able to apply, in an informal way, Newton's first law. 2.5 The learner will be able to explain the role of the force of friction in determining how well Newton's first law applies (or if it does not apply) to a given physical situation. 2.6 The learner will be able to explain the reasoning Galileo used to justify the second part of Newton's first law and will be able to explain how the force of friction applies to this situation. 2.7 The learner will recognize the concept of inertia (as opposed to a force, momentum, etc.). 3. Newton's second law 3.1 The learner will understand that the ''F'' in F = ma stands for the net force acting on an object, ''m'' stands for the mass of the object, and ''a'' stands for the resultant acceleration of the object. 3.2 The learner will be able to demonstrate the causeeffect relationship that net force causes acceleration and not the other way around. If the learner sees an acceleration, he or she should know that there was a net force applied; and, if he or she sees a net force applied, he or she should know that there will be a resultant acceleration. 3.3 The learner will be able to state and apply (in simple, straight-line situations) Newton's second law. 3.4 The learner will be able to distinguish between the role of ''F'' and the role of ''m'' in Newton's second law. 3.5 The learner will recognize that an object can apply a force to another object, but an object cannot carry a force with it. 4. Newton's third law 4.1 The learner will be able to explain that when object A exerts a force on object B, object B exerts an equal and opposite force back on object A, regardless of the mass or motion of either object. 4.2 Given a force that A applies on B, the learner will be able to identify the force that B applies on A. 4.3 The learner will recognize that these forces are exerted simultaneously. 4.4 The learner will be able to apply this concept in a variety of situations. 4.5 The learner will be able to use Newton's third law to explain how an inanimate object can exert a force on another object.\nIt is important to note the overall purpose of the SciPacks is the facilitation of specific content-area knowledge and skills. The SciPacks are not intended to focus specifically on student impact in the classroom; that is, the manner in which a better understanding of particular content knowledge and skills translates into more effective science pedagogy. The NSTA's content approach to the SciPacks is consistent with current research indicating that a key variable affecting student achievement in science is the teacher's understanding of the content knowledge they teach (see Cochran-Smith and Zeichner 2005; DarlingHammond and Bransford 2005; Goldhaber and Brewer 1998, 2000; Monk 1994; Wenglinsky 2002; Wilson et al. 2001) . A cursory search of available online professional development resources available to professional educators today reveals that most of the opportunities available to teachers via online modalities focus on science pedagogy rather than increasing science content knowledge. The NSTA's SciPacks have been designed to address this current deficiency. SciPacks have not been designed to completely supplant or replace existing, comprehensive professional development experiences for teachers; rather, they are specific to the needs of teachers assigned to particular grade-level science subject areas. By enriching their basic understanding of fundamental scientific concepts, teachers can continue to improve their abilities to facilitate the learning of science outcomes among their students. Through web-delivered SciPacks, the NSTA seeks to leverage the value and convenience of e-learning to provide affordable, on-demand access for teachers desiring remediation (or introductions) to assigned science content areas without the need to spend the time and money associated with full-semester courses."}, {"section_title": "Evaluation Questions", "text": "In addition to improving achievement gains associated with the content knowledge and skills, the program developers also intended that the professional development experience would have a positive impact on the professional practice of the participants. It was beyond the scope of the initial pilot test to examine the effects of participation in the SciPack professional development experience on actual changes in professional practice (i.e., lesson design and consequent student achievement), but factors such as level of satisfaction with the overall experience, as well as confidence in teaching force and motion concepts, were measured.\nPerhaps one of the most important evaluation questions asked during the planning of the different professional development experiences was whether there would be any noticeable differences in overall results between participants from the different school districts. In the face-to-face model of implementation the learners had an opportunity for significantly more guidance, support, and direction regarding the content and the SciPack material used to help teach skills associated with the content compared with the model in which the participants only interacted with the web-based material on their own. In this 100% web-based implementation model, the participants were given a deadline, and it was up to them to contact support if needed before they completed the assigned material. Because this type of implementation model represents a more affordable (time and money) model of web-supported professional development instructional delivery, any major achievement, and attitude differences observed between the groups of participants experiencing the different implementation models were of particular interest to the program developers."}, {"section_title": "Program Components", "text": "The SciPack material represented an on-demand learning experience because the participants were free to access the content at any time and navigate the materials in any order they desired. After signing onto the web-based system, each participant was presented with a menu that included a listing of all the available science objects for the SciPack. Links to each science object allowed access to specific subtopics within the science object, including a glossary of terms and the evaluation quiz for the science object. The menu also displayed information about the last time content was accessed and the level of completion for each science object. Figure 1 presents the menu for the Force and Motion SciPack.\nThe menu presented in Fig. 1 also includes a link to orientation material that the pilot-test participants were encouraged to access before beginning the force and motion science objects. Figure 1 also depicts links to the four science objects (Force and Motion, Newton's First Law, Newton's Second Law, and Newton's Third Law) as well as the final assessment for the SciPack.\nEach science object in the Force and Motion SciPack includes an introduction designed to motivate the learners and a brief description of the skills to be learned. Most of the science objects then present the learners with some type of simulation that promotes involvement in activities associated with the content. Figure 2 presents an example of one such activity that engages the learners by having them use a simulated helicopter to measure the positions of a tortoise and a hare throughout different periods of their fabled race. Following the introduction, specific content information-including concepts and examples-is presented. Throughout the information presentation screens, the learners are provided with opportunities to practice the skills being facilitated through a variety of interactive assessment items. Instructional design experts reviewed the types of instructional strategies developed to ensure that they met the requirements for effectively facilitating the targeted outcomes, which primarily represent intellectual skills (see Gagne 1985) . A variety of practice items needed to be included in order for the learners to monitor their understanding of the content and concepts presented. Multiplechoice, fill-in-the-blank, drag-and-drop, and matching items are some of the more common types of assessment items used throughout the SciPack. Figure 3 presents an example of a multiple-choice item presented within one of the science objects.\nIn addition to embedded practice items and some type of introductory activity, each science object in the Force and Motion SciPack also includes a variety of simulations designed to provide the learners with opportunities to perform tasks within investigations in an effort to discover specific physical science concepts. For example, Fig. 4 presents a picture of a simulation in which the learners test the effects of balloon numbers and weights on the motion of a horizontal-moving object.\nIn some cases, the learners are asked to perform simulated tasks and take measurements that are used in subsequent information presentation experiences. Figure 5 presents a screen shot of an activity in which the learners must accurately measure the amount of time an object takes to move a particular distance.\nEach science object includes an interactive quiz at the conclusion, following the information presentation, practice, and activity/simulation experiences.\nAfter the participants experienced all of the science objects within the SciPack, they took a final assessment that consisted of 15 interactive exam items. The participants were provided with feedback about their final assessment performances, and they had opportunities to correct any mistakes or incorrect answers through three attempts to pass the final assessment.\nAs previously indicated, the pilot-test procedures also included the administration of a word problem application pretest/posttest designed by a third-party assessment consulting firm, as well as an attitude survey. The pretest/ posttest included 16 multiple-choice items designed to measure how well the participants could apply the following Newtonian force and motion principles within application word problems:\n• A force is a push or pull interaction between two objects, and has both magnitude and direction.\n• All of the forces acting on an object combine through vector addition into a net force; they either balance each other out (net force is zero), or act like an unbalanced force (net force is not zero).\n• If the sum of forces exerted on an object in one direction is the same strength as the sum of forces exerted on the object in the opposite direction, then the forces on the object are balanced (i.e., the net force is zero).\n• If the sum of forces exerted on an object in one direction is greater than the sum of forces exerted on the object in the opposite direction, then the forces on the object are unbalanced (i.e., the net force is not zero).\n• If an object is moving faster and faster, then there is a net force acting on the object in the same direction as the motion.\n• If an object is moving slower and slower, then there is a net force acting on the object in the direction opposite to the object's motion.\n• If there is an unbalanced force acting on an object, the greater the strength of the unbalanced force, the greater the change in the object's velocity.\n• If there is an unbalanced force acting on an object, the more massive an object is, the smaller the change in the object's velocity.\n• If an object has constant speed in a straight line (or zero speed), then there is no net force acting on the object. This can occur either when the forces on the object are balanced or there are no forces exerted on the object.\n• The force of friction acts to oppose the relative motion of two objects in contact. Friction acts on both objects along the surfaces in contact with each other. The magnitude of friction depends upon the properties of the surfaces and how hard the objects are pushed together.\nUnlike the online final assessment, the learners did not receive any feedback or have the opportunity to correct any mistakes after competing the application exam. "}, {"section_title": "Implementation Models", "text": ""}, {"section_title": "Web-based On-demand Implementation Model", "text": "The teachers participating in the 100% web-based, ondemand SciPack professional development model began the experience by meeting together as a group to receive orientation instructions on the procedures for accessing the material. These teachers also took the word problem content application pretest. During the orientation session, the participants were informed about a feature in the SciPack called the Content Wizard. This SciPack feature enabled the participants to click on a button at the bottom of every screen and send an e-mail message to a content expert. Participants were assured that their messages would be returned within a 24-h period. A suggested timeline of activities was presented to the participants, and a deadline of 4 weeks was imposed for the completion of all science objects as well as a passing score on the final SciPack assessment. At the end of the 4 weeks, the participants met again and completed the content posttest as well as an attitude survey."}, {"section_title": "Instructor-led and Web-based Seminar and On-demand ''blended'' Implementation Model", "text": "The model of implementation for one of the three participating school districts included an additional face-to-face instructional component. In addition to the web-based, ondemand SciPack instructional materials, the participants from this school district also experienced a full-day instructor-led workshop involving an overview of the Newtonian force and motion content addressed in the SciPack, as well as numerous demonstrations and hands-on activities associated with the concepts addressed. In fact, the workshop was facilitated by the primary author and content expert of the Force and Motion SciPack material. In addition to the full-day workshop, the participants received identical information, SciPack resources, timeline, and assessment experiences as the other participating school districts, with one notable exception. These participants did not have access to the Content Wizard feature throughout their web-based experience.\nIn addition to the face-to-face workshop, participants in the blended model also took part in two separate web-based seminars in which the subject matter expert reviewed the instructional material addressing topics being studied, and the participants had opportunities to ask questions and respond to the material presented in real time (synchronous). Each web seminar lasted *1 h.\nWithin this report this model is called the ''blended'' model of implementation because it combined the more traditional face-to-face instructional experience with the web-based, self-paced, on-demand SciPack materials."}, {"section_title": "Evaluation Method", "text": "The methods employed for this evaluation were fairly simple. The content application pretest and posttest were administered online by a third-party assessment consulting firm, and debrief interviews with the science specialists for each district were conducted via telephone. Results were returned to the NSTA program evaluators. In addition to the content pretest, a few attitude items were also measured during the orientation session.\nEn route data was collected by the web-based content delivery system itself. For the purposes of this evaluation, the only en route data examined included the percentage of participants who completed the science objects and passed the final assessment.\nThe attitude survey included various Likert-type scale items asking the participants to report levels of agreement with statements about (1) confidence in teaching force and motion content, (2) specific items relating to the material itself, and (3) relevancy and satisfaction. A sampling of these items is included in Table 5 . Open-ended items soliciting perceived strengths and areas for improvement were also included on the survey.\nIn addition to participant data, the evaluators also interviewed the professional development or science curriculum specialist from each school district who helped oversee the implementation of the program. These interviews were conducted via telephone and e-mail, with openended questions regarding the materials, the process, and the future plans for increasing access to online, on-demand professional development experiences."}, {"section_title": "Results", "text": ""}, {"section_title": "Participants Completing the Program", "text": "Out of the 45 participants who started the program, 41 (91.1%) completed all the science objects and passed the final assessment with a score at or above 70%. Table 2 presents a breakdown of the number of participants who completed the program and passed the final SciPack assessment by school district program site."}, {"section_title": "Pretest/Posttest", "text": "Nearly all the program participants were able to complete the program and attend the final wrap-up session that included the word problem application content posttest. Out of the 45 participants who took the content pretest, 43 completed the posttest (95.6%). Collectively, the participants who did complete the entire program, including the pretest and posttest, made significant gains in achievement. As reported in Table 3 , the mean pretest score over the eight force and motion word problems for all participants was 70.6%, while the mean posttest score for the same items was 80.5%. A paired sample correlation for achievement revealed significant gains across all subjects (r = 0.49, p \\ 0.01), and a paired sample t-test for the 9.9% mean score gain was significant (p \\ 0.01). Table 3 presents the pretest, posttest, and gain score means for all three sites as well as the combined scores for the two sites that used the 100% online implementation model. These data indicate that the mean pretest-posttest gain scores for the participants at Site 1 (the blended model) was 5.2%, while the mean pretest-posttest gain scores for the two 100% online implementation model sites was 11.7%. These gain scores for the 100% online participants represented a statistically significant gain in achievement."}, {"section_title": "Confidence", "text": "One of the most important attitudes measured was the teachers' confidence levels regarding their ability to teach concepts related to Newtonian force and motion. Out of the 45 participants who completed both the pre-and postsurvey, 13 (28.9%) reported that they were ''Not Confident'' to teach the content before the SciPack professional development program, while no participants reported this level of confidence after the program. Twenty-nine participants (64.4%) reported that they were ''Somewhat Confident'' before the program, while 18 (40%) reported the same level after the program. And only three participants (6.7%) reported that they were ''Very Confident'' before the program, while 27 (60%) reported that they were very confident after the completion of the program. Table 4 presents these figures broken down by type of professional development implementation model."}, {"section_title": "Relevance and Satisfaction", "text": "Most of the participants who responded to the follow-up attitude survey were very favorable about the personal relevance of the material and their general levels of satisfaction. The data in Table 5 indicate that 44 of the 45 respondents (97.8%) agreed or strongly agreed that the content was relevant to their needs. The same number agreed or strongly agreed that the embedded interactions effectively helped them understand the concepts being facilitated. Likewise, 44 participants (97.8%) agreed or strongly agreed that they will seek out additional SciPacks in the future when they feel the need to learn science content, and 44 participants (97.8%) agreed or strongly agreed that they would recommend SciPacks to their colleagues."}, {"section_title": "Content Wizard Feedback", "text": "Participants from two of the districts had access to the Content Wizard button on every screen of the SciPack. Of these 32 teachers, only 21 (66.7%) responded that they were aware of the purpose of the Content Wizard. Only five participants (15.6%) who had access to the Content Wizard feature used it, but all five reported that the feature was helpful."}, {"section_title": "Instructor-led Workshop Feedback", "text": "In general, the results from the attitude items addressing the instructor-led workshop were favorable. Thirteen participants experiencing the blended model of implementation completed the attitude post-survey. Six of these respondents (46.2%) strongly agreed and seven (53.8%) agreed that ''Adding an instructor-led workshop and facilitated web-based seminar to the self-paced online SciPack pilot enhanced my understanding of the content.'' Likewise, six respondents (46.2%) strongly agreed and seven (53.8%) agreed that ''The instructor-led workshop at the beginning of the SciPack pilot provided me the opportunity to ask questions and/or eliminate misconceptions.'' Additionally, four teachers (30.8%) strongly agreed and eight (61.5%) agreed that ''The facilitated web seminars during the SciPack pilot made me feel more comfortable about the course in general.''"}, {"section_title": "Open-ended Responses", "text": "All the participants were asked to list those features of the SciPack that they felt were most valuable in helping them learn the content. Twenty-seven of the respondents mentioned that the visuals, animations, and simulations were well done and complemented/clarified the text for them. Five of the respondents indicated that the immediate feedback associated with the practice and quiz items was the feature that helped them the most. Four participants indicated that the on-demand nature of the entire experience helped them the most because they could access what \nOnly the scores of participants who completed both the pretest and the posttest were included in the analyses *p \\ 0.01, **p \\ 0.05 (difference between pretest and posttest scores on a paired sample t-test) Total n = 13 n = 0 n = 29 n = 18 n = 3 n = 27 28.9% 0% 64.4% 40% 7.4% 60%\n''How would you rate your confidence in your ability to teach physical science concepts related to Newtonian force and motion?''\nOverall n = 45 [completed both pre-and post-survey] they wanted, when they wanted in order to help them learn what they needed to learn. And three of the respondents felt that the audio feature (the ability to have the text read out loud) was the most valuable feature."}, {"section_title": "Interviews with Professional Development/Science Curriculum Specialists", "text": "One of the broadest questions asked in the follow-up interviews with the professional development/science curriculum specialists who coordinated the pilot tests in each of the school districts was ''What impressions and comments did you observe from the educators who participated in the pilot study?'' One of the respondents stated: ''To a person, their comments were positive. Many pointed out how much they learned.'' Other responses included references to how much the participants seemed to enjoy the online, on-demand style of professional development. The coordinators were also asked to comment about the on-demand implementation model, including whether they had to address any technical issues. Again, the responses were generally positive. One coordinator responded that ''…most teachers love the fact that they can work from their home or Starbucks if they want. Teachers like to set their own [professional development] learning hours.'' Another coordinator indicated that the program worked without major technical problems, and that ''online delivery of professional development is absolutely necessary'' in his school district. However, he followed up by stating ''I do fear the absence of face-to-face interaction.'' When asked about ways to improve the SciPack professional development experience, both of the coordinators whose teachers did not have an instructor-led component indicated that they would want to include face-to-face workshops in the future, particularly if they included hands-on activities associated with designing lessons that addressed the content learned. The coordinator whose district did implement the blended implementation model indicated that in the future, his district might try to find a way to implement the on-demand material during more open-ended professional development days so that the teachers could experience the material during times when they would normally be teaching.\nAdditionally, all three coordinators indicated that they would recommend this type of professional development experience for other school districts, and they all hoped that the material could somehow be included in a graduate course that could be taken for university credit."}, {"section_title": "Discussion", "text": "One of the most important evaluation questions about this professional development program that needed to be answered was whether the participants learned-at an acceptable level of proficiency-the knowledge and skills associated with the content that the Force and Motion SciPack was designed to facilitate. Based on the pretest and posttest gain scores, a generalization could be made that the participants did increase their skill level. But it is difficult to comment on the acceptability of scores that collectively improved by nearly 10%. The items constituted multiplechoice word problems, and they focused on an application of the concepts facilitated. A great deal of the SciPack involved the organized presentation of knowledge, skills, and numerous examples leading up to the higher-level problems presented. It can be assumed that the participants most likely improved their general understanding of underlying physical science knowledge, but a closer examination of the en route science object practice, quiz, and final assessment data would be needed to make this judgment.\nTaken collectively, participants in the three pilot groups did show a significant improvement in their applied achievement scores. However, when examined by individual group as well as type of implementation model, the data indicate that the participants in the blended model did not significantly improve their pretest-posttest gain scores. This was the same group of participants who professed a very high level of confidence in being able to teach Newtonian concepts at the conclusion of the pilot study (73.3% indicated that they were ''Very Confident''). Such a high degree of confidence could have been influenced by the fact that these participants experienced the modeling of science instruction related to the topic. But the negative relationship between levels of confidence and achievement might suggest a disconnect between feeling confident in teaching a particular subject and actually knowing the content well. This phenomenon is reminiscent of the Trends in International Mathematics and Science Study (TIMSS) data for 2003 that indicated American eighthgrade students ranked their confidence in learning science higher than those students in all the countries that actually outperformed the US students on the standardized TIMSS science tests (Martin et al. 2004) . TIMSS researchers suggest that participants in those countries performing well on the content exams but scoring themselves low on the self-confidence scale may have been influenced by cultural practices regarding expressions of confidence (Martin et al. 2004) . Likewise, practicing educators in this pilot test may possess a general underlying belief that an ability to learn a particular subject does not necessarily relate directly to performance abilities on an application written test. It is also possible that the participants in the blended model actually spent less time with the computer-supported instructional material because they spent an ample amount of time in the face-to-face workshops. Unfortunately, this pilot test occurred before the creation of a reliable system of retrieving data associated with how much time each participant spent with the online material. Future pilot tests of this and other SciPack materials will need to be conducted in order to focus on performance data at this level.\nAnother measure of learning is tied to the overall success rate in completing all the science objects and passing the final assessment. By successfully passing the final assessment with a score of 70% or greater, learners demonstrate an acceptable level of understanding related to the content knowledge and skills. As indicated, 91.1% of the participants completed all the material and performed at an acceptable level on the final assessment by the end of the 4-week period. This indicates a fairly high-general success rate for the participants.\nThe four participants who did not pass the final assessment were members of the same school district. A followup interview with the science professional development coordinator for this district revealed several factors that could have contributed to this lower level of success, including district student assessment administration occurring during the pilot-test period, as well as a change in personnel responsible for overseeing the pilot-test experience for the district while it was being facilitated.\nPerhaps the biggest effect that this professional development experience had on the participants was changing their level of confidence in helping their students learn about Newtonian force and motion. At the conclusion of the experience, all the participants who responded to the survey indicated that they were either ''Somewhat Confident'' or ''Very Confident'' to teach physical science concepts related to Newtonian force and motion. Indeed, 73.3% of the participants in the blended group rated themselves as ''Very Confident.'' This was a higher level of confidence than the number reported by participants in the nonblended groups (50% were ''Very Confident''). It may be coincidental that participants in the blended group reported such a high level of confidence compared with participants in the other groups (still high levels of confidence, though). But this might also have been the effects of having the opportunity to spend more time with the material, working with hands-on activities related to the content, and/or having a content expert explain the material and answer questions about things that were unclear or difficult to grasp. In any case, this data does support the value of using a blended approach where possible.\nIt must be noted that confidence in being able to teach the material does not necessarily translate readily into ability to teach the material well, or even into making the choice to teach the material. These important issues were not addressed in this particular pilot test. The SciPacks are designed to facilitate specific content-area skills; they are not designed to help teachers learn how to best teach the content within the parameters of a typical K-12 environment. It would be highly interesting to study how such factors as confidence, satisfaction, and achievement apply to more effective pedagogy, but these questions need to be addressed within studies specifically designed to answer such questions.\nIn addition to variables affecting confidence, a factor supporting the use of instructor-led workshops in conjunction with the online material was the overall response to the item ''Adding an instructor-led workshop and facilitated web-based seminar to the self-paced online SciPack pilot enhanced my understanding of the content.'' All of the participants in the blended group strongly agreed or agreed with this statement. This is important because the workshop represented a rather significant time investment, and the participants could have resented this requirement due to the fact that the online material was designed to help them learn the material without the need of an instructor. Responses to the other items associated with the value of the instructor-led workshop reinforced the assumption that the participants really valued the session. The professional development/science curriculum specialists also concurred that an instructor-led component to the experience would be an important value-added component to future experiences.\nBecause the participants in the online, on-demand groups did not have an opportunity to ask questions about the content during a face-to-face workshop, they were provided with access to a ''virtual'' content expert accessible via e-mail by clicking on a Content Wizard button located on every screen. Although every participant who used this feature reported that it was helpful, only five participants (15.6%) chose to use it. This represents a potential good news-bad news situation for future consideration. On the one hand, limited use of this feature did not overwhelm the content experts who were standing by, ready to respond to the e-mail messages. On the other hand, going to the trouble of employing content experts to quickly reply to such messages represents an expense that might only be worth the trouble if more learners would take advantage of it. This feature will require further study in order to determine its ultimate return on investment.\nAlthough the Content Wizard feature was not an element of the SciPack experience that was used by most of the participants, many of the other interactive features of the material were reported to be of great value. In the openended responses, over half of the participants indicated that the animations, simulations, visuals, and/or practice with immediate feedback were features that helped them learn the SciPack content. The ability of the web-based environment to deliver interactive multimedia material represents one of the most promising aspects of delivering content-specific professional development materials in an on-demand fashion. One of the greatest expenses in developing web-based materials is the cost of creating unique graphics, animations, and the programming involved in providing interactive assessments with feedback. By acknowledging the value of such features, the participants have somewhat affirmed the effort and expense that NSTA continues to invest in the development of websupported professional development opportunities.\nAll the information collected during this pilot test will help NSTA not only improve the design of the SciPack instructional materials, but also inform the implementation process by ensuring that future pilot tests address specific implementation issues. For example, there were probably many factors influencing the number of participants who successfully completed the program. If self-directed, online, on-demand professional development experiences are going to be made available to teachers in the future, steps will need to be taken to maximize the success rate. But what are these factors, and what steps should be taken? Perhaps a closer study of how practicing teachers access and use online materials might help answer questions such as: Do most teachers access the material at home on weekends, after school, or during planning periods? Do they try to tackle the entire SciPack at one sitting, or is it spread throughout the 4 weeks? And how valuable are the incentives for participating? These questions, along with more detailed en route performance data collection and analysis, will need to be the focus of future SciPack pilot tests."}]