[{"section_title": "INTRODUCTION", "text": "Understanding the structure of the coastal internal boundary layer (IBL) during the landfall of a tropical cyclone has important ramifications on operational forecasting, structural design, and post-storm damage assessment. Despite these important issues, it is unclear how the structure of the IBL evolves at the coastline on micro-and meso-scales during a landfalling hurricane. Understanding of the vertical kinematic structure within tropical cyclones over water has improved greatly through the advent of the GPS dropsonde (Hock and Franklin 1999, Franklin et al. 2003, Giammanco 2011. Unfortunately, reconnaissance and research aircraft are limited to over-water missions resulting in a poor understanding of vertical kinematic structure near the coastal interface where changes in IBL structure are expected due to changes in coastal geometry and surface roughness. This study addresses the utility of a comprehensive observational dataset at the coastal interface within a hurricane. Singleand dual-Doppler (DD) measurements from the Cape Canaveral, FL region during the landfall of Hurricane Frances (2004) are used to investigate mean IBL structure over a complex coastal interface."}, {"section_title": "EXPERIMENT", "text": ""}, {"section_title": "Hurricane Frances (2004)", "text": "After peaking in intensity at 65 m s -1 three days prior, Hurricane Frances made _____________________________________ Corresponding Author Address: Brian Hirth, Texas Tech University Wind Science and Engineering Research Center, Lubbock, TX 794091 brian.hirth@ttu.edu landfall near Port Saint Lucie, Florida on 5 September 2004 as a Category 2 hurricane with estimated one-minute maximum surface winds of 47 m s -1 according to the National Hurricane Center (Beven 2004). The landfall point in southeast Florida placed the Cape Canaveral area in onshore flow for a considerable portion of the event. At landfall (Figure 1), Frances was a relatively large storm containing a large eye (90-130 km in diameter), with hurricane (tropical storm) force winds extending outward up to 135 (320) km from the center."}, {"section_title": "Shared Mobile Atmospheric Research and Training (SMART) Radars", "text": "Single-and DD data sets were collected by the Shared Mobile Atmospheric Research and Teaching (SMART) radars (Biggerstaff et al. 2005). The radars were located at Merritt Island Airport (SR1) and Space Coast Regional Airport (SR2) in Titusville, resulting in a baseline of 21.9 km ( Figure 2). For this study, two primary scanning strategies utilized during this deployment have been considered. The first provided plan-position indicator (PPI) volumetric sampling that was temporally coordinated between both radars allowing for DD examination of the wind field over the coastal transition region. Eight DD mean periods were examined, each consisting of three consecutive coordinated volumes spanning 15 minutes in time. These DD periods covered 11 hours between 4 September at 1900 UTC and 5 September at 0600 UTC. The second scanning strategy used repetitive range-height indicator (RHI) scans along a single azimuth aligned along the low-level mean wind direction. This strategy provided a unique perspective of the IBL flow using high spatial and temporal sampling of the coastal interface."}, {"section_title": "Hurricane Internal Boundary Layer Empirical Model", "text": "An IBL forms within a region of horizontal advection across a discontinuity in one or more surface properties. While the rate of IBL growth (increase in depth with increase in downwind distance from a surface discontinuity) will vary depending on the character of the surface roughness, the IBL should exhibit continual growth until the entire depth of the boundary layer has fully adjusted to the new underlying surface. In the absence of mesoscale influences (e.g., convective downdrafts), it is widely accepted that the HBL is mechanically dominated and characterized by neutral static stability. Given this assumption, IBL height (h I (1) ) at a given downwind distance X is defined as: where c is a stability constant accepted as equal to 0.5 for statically neutral situations (Peterson 1969;Stull 1988;Powell et al. 1996). Other authors have accepted the value of c to equal 0.28 for neutral static stability (Wood 1981;Simiu and Scanlan 1996). Stull (1988) states that the value of c is dependent on stability ranging from 0.2 (stable) to 0.8 (unstable), while Arya (1988) estimates the constant between 0.35 and 0.75. is the roughness length (m) of the rougher surface up-or down-wind of the surface discontinuity. From the empirical relationship in (1), IBL growth is dictated by roughness length magnitude and downwind distance from a roughness discontinuity only, and is theoretically not a function of wind speed (also supported by Rao et al. 1974 andDeaves 1981). Like many coastal areas, the Cape Canaveral region is comprised of multiple roughness transitions as a result of intermediate waterways and diverse land cover. It would be expected that a complex IBL would exist with contributions from multiple surface roughness regimes."}, {"section_title": "Surface Roughness Characterization", "text": "To interpret the collected radar data, understanding of the underlying surface roughness is essential. A pre-existing land use database is qualitatively transformed into a surface roughness assessment over the Cape Canaveral region. The National Oceanic and Atmospheric Administration (NOAA) Coastal Change Analysis Program (C-CAP) houses an inventory of land use data for coastal areas to monitor the evolution of intertidal, wetland and upland habitats. Landsat Thematic Mapper, aerial photography, and ground-based field data are integrated to construct an objective digitized land use product. The employed database was assimilated in 2006 and consists of 21 unique land use classes with a horizontal resolution of 30 meters. Land cover classifications were qualitatively converted to roughness length values using the methodologies described by Wieringa (1993). A direct conversion from land cover to a single roughness length value is imperfect and aerial photography was supplemented were needed. In all, this method yields a reasonable representation of the heterogeneous roughness regimes comprising the analysis domain (Figure 3)."}, {"section_title": "RADAR ANALYSES", "text": ""}, {"section_title": "Zone Analyses", "text": "Radial velocity data collected by SR1 and SR2 were interpolated to overlapping Cartesian grids with 100 m horizontal grid spacing and 50 m vertical grid spacing between 50 -1450 m. DD syntheses were then conducted to generate horizontal wind speed and direction fields for each DD volume. For each of the eight 15-min DD periods consisting of three consecutive volumes, a mean of the three volumes was constructed. Seven 3 km x 3 km zones were then extracted out of each of the eight mean DD volumes for comparison ( Figure 4). Within each zone, a composite vertical wind speed and direction profile was created for each mean DD volume by spatially averaging all DD data bound by the zone at each vertical level between 50 -1450 m. Since mean boundary layer wind speed generally increased and wind direction generally veered over the 11 hour DD period, zone means wind speed and direction profiles are represented as a difference from the 1200 -1450 m layer mean, allowing for a more representative comparison through varying wind conditions. As expected, the mean zone vertical profiles of wind speed and direction indicate a continuous transition of increasing wind speed and direction deviations relative to the layer means in the low levels with increasing inland distance ( Figure 5). Zones 1 and 2, located over the Florida mainland, contain the greatest deviation in wind speed and direction, relative to the layer means, of 11 m s -1 Constant altitude plots connecting each zone provide a supplemental perspective on the horizontal and vertical variability of the mean DD wind speed and direction between each zone (Figure 6). At and above 700 m, the mean wind speed difference between the Zone 1 and Zone 7 is less than 1 m s and 17°, respectively, between 300 -1300 m. DD data below 300 m is lacking through the entire domain due to extensive and unavoidable radar beam blockage from trees and buildings located in close proximity to both radars. Zone 3, located over Merritt Island, shows a lesser deviation in wind speed and direction than Zones 1 and 2 at 300 m since the flow has encountered less friction there. The vertical wind speed profiles of Zones 4 and 5 are similar to each other. -1 , showing that the greatest horizontal wind speed changes within the IBL are confined to the lowest several hundred meters. At the 400 m level, modest wind speed slowing occurs from Zone 6 to Zone 4, while a much more abrupt decrease of 4 m s -1 is observed between Zone 4 and Zone 1. The landmass of Merritt Island appears to have a more significant impact on IBL growth than does the upstream landmass over Eastern Cape Canaveral. The mean vertical profiles taken from Zone 1 show a 10 m s -1 (15°) difference in wind speed (direction) between 400 -1200 m."}, {"section_title": "RHI Analyses", "text": "Repetitive RHI scans were performed by SR2 along a single azimuth oriented into the mean low-level wind direction (90°) for two approximately thirty minute periods; between 1355 -1425 UTC (268 scans, RHI-1) and between 1436 -1505 UTC (258 scans, RHI-2) on 5 September 2004. Individual RHI scans were collected at roughly seven second intervals and this scanning strategy was utilized when the center of Frances was near its closest approach to Cape Canaveral. In general, the radar measured a radial velocity maximum centered near 500 m above ground. This feature had large temporal and spatial variability in magnitude and coverage, as demonstrated in Figure 7. Though these two RHI scans were separated by less than seven minutes, the wind structure sampled was quite different, with wind speed differences in the lowest several hundred meters in excess of 10 m s -1 Vertical radial velocity profiles were constructed at x = 2, 4, 8, 12 and 16 km from SR2 for the RHI-1 and RHI-2 mean periods (Figure 9). The radial velocity maximum feature atop the IBL is more defined during RHI-2 and is positioned slightly lower in height within 8 km than during RHI-1. Profiles in the lowest 200 m at x = 4 km and x = 8 km for both RHI-1 and RHI-2 are similar, despite a considerable difference in the upwind radial velocity magnitude beyond x = 14 km. In the lowest 50 m, between x = 2 km and x = 16 km, gridded radial velocity decreases by 33% and 26% for the mean periods of RHI-1 and RHI-2, respectively. . Despite this variability, when individual scans over the RHI-1 and RHI-2 period are composited, a consistent mean IBL structure is revealed (Figure 8). Using this analyses technique, IBL formation appears to be ongoing in earnest over central Merritt Island with near-surface mean radial velocity values at x = 2 km 25-30% less than at x = 14 km. Further examination of the RHI composites in Figure 8 shows that IBL growth appears confined once encountering the hurricane low-level wind maximum. To investigate this concept, three pronounced smooth-to-rough transitions (T1, T2 and T3) are subjectively defined across the Cape Canaveral region (Figure 8c) containing Z OR values of 0.4 m, 0.6 m, and 1.0 m, respectively. Due to the relatively course nature of the vertical composite data, it is not possible to discern individual IBL \"kinks\" in the vertical radial velocity profiles constructed in Figure 20. Instead, the empirically-derived IBL height using (1) is compared to each RHI composite low-level wind maximum at a 2 km distance east of SR2. From (1) with c = 0.5, the empirical IBL height from T1, T2 and T3 is 1249 m, 1158 m, and 1065 m, respectively. The radial velocity maximum for RHI-1 at 2 km distance from SR2 is 649 m and for RHI-2 is 579 m. For all three transitions, the expected IBL height using the accepted neutral stability value for c far exceeds the height of the low-level wind maximum. If a c value of 0.28 is considered, the empirical IBL heights from T1, T2, and T3 are 749 m, 554 m, and 408 m, respectively. For this smaller value for c, the derived IBL height from T1 still exceeds the height of the wind maximum while the derived IBL heights from T2 and T3 remain below the wind maximum. The composite vertical radial velocity profiles shown in Figure 20 depict noticeable wind speed slowing between an x-distance of 2 and 16 km confined to the lowest 300-400 m. Though specific IBL growth rates cannot be accurately assessed with this dataset, it is believed that at the coastal interface the IBL (or combination of IBLs) grows until it encounters the hurricane low-level wind maximum, at which point IBL growth is overwhelmed. Had the radar beam been oriented along a differing azimuth, the IBL structure would potentially change. The amount of land and/or water traversed by the upwind flow would become different and the resulting IBL heights would respond. The vertical structure of the lowlevel flow at a given location is highly dependent on wind direction in situations where the upwind surface character is diverse."}, {"section_title": "CONCLUSIONS", "text": "SMART-Radar observations collected during the landfall of Hurricane Frances (2004) over the Cape Canaveral, FL region have provided an innovative way of examining IBL kinematic character at the coastal interface during a landfalling tropical cyclone. Single-and DD data were composited to assess mean IBL structure. Within the IBL development region for onshore flow, substantial changes in mean horizontal wind speed and direction occured. DD analyses showed horizontal wind speed decreases in the lowest 400 m of around 4 m s -"}, {"section_title": "1", "text": "The radar observations suggest the IBL growth rate is less than predicted by (1) using a c value of 0.5, which is widely accepted as representing neutral stability. From the various DD analyses shown, IBL height over western Merritt Island, the Indian River, and the Florida mainland is contained below a depth of 600 m. RHI analyses from SR2 within the primary rainband of Frances suggest the greatest wind speed slowing is confined to the lowest 400 m. The wind speed maximum is lowering with time, consistent with the low-level wind maximum lowering with decreased distance from the storm center observed by Franklin et al. (2003), Giammanco (2011) and modeled by Kepert (2001Kepert ( , 2006 and Kepert and Wang (2001) offshore. . RHI composite analyses showed a nearsurface radar radial velocity decrease greater than 30% from eastern Merritt Island to the location of SR2. This value would have been greater if the full wind speed could have been resolved. DD analyses reveal wind direction backing in the lowest 400 m between 15-20° from offshore to onshore. When dealing with complex terrain over a coastal region, what appears as a single IBL actually consists of multiple IBLs. A heterogeneous underlying surface yields multiple scales of IBL development and contribution. Kinks in vertical profiles at various positions within the general IBL conglomerate can provide reliable information as to the upwind surface roughness character and the type of transitions (smooth-to-rough versus rough-to-smooth) that are occurring. Figure 2. Deployment locations of SR1 and SR2 and resultant DD lobes (dashed circles). Large thin circles identify the maximum range for each SMART radar, and the thick line indicates the track of Frances with designated timestamps. The location of the KMLB WSR-88D radar is also shown for reference.      . SR2 composite RHI gridded radial velocity (m s -1 ) for (A) RHI-1 and (B) RHI-2. (C) The along-radial composite C-CAP derived roughness length (m) is also provided for reference. SR2 is located at x = 0 km. Figure 9. SR2 composite RHI radial velocity profiles at 2, 4, 8, 12, and 16 km range for (A) RHI-1 and (B) RHI-2."}]