[{"section_title": "INTRODUCTION AND CONCEPTUAL ISSUES", "text": "Individuals with higher levels of education tend to be more civically engaged. This stylized fact has been well documented in the political science literature (e.g., Wolfinger and Rosenstone 1980;Nie, Junn, and Stehlik-Barry 1996), and has been recently supported by other social scientists who have accounted for ability-bias issues (e.g., Hauser 2000;Dee 2004). According to such studies, education reduces cognitive and material costs to civic participation (Wolfinger and Rosenstone 1980) and shapes the preferences of individuals towards civic activities (Dee 2004). Policywise, the positive effect of education on civic engagement provides an additional benefit of this human capital variable on economic development. Education, by fostering social capital via civic engagement (Segura, Pachon and Woods 2001), promotes a more robust democracy and consequently a healthier platform for economic growth. Less explored is whether civic engagement impacts educational attainment. Much of the literature on civic engagement focuses on measures of well-being (e.g., Thoits and Hewiit 2001) or informal learning outcomes, such as knowledge about the local government or current events (for a review, see Niemi, Hepburn and Chapman, 2000: 49-51). The Thoits and Hewitt study examines the relationship between voluntary community work and six measures of well-being. However, some community work performed by high school students might not be voluntary but required by their educational program. Moreover, the vast majority of the studies on the link between civic activities and education pertain to students in post-secondary academic institutions. While some exceptions include Niemi, Hepburn and Chapman (2000); Billig, Root and Jesse (2005); and Borg (1966), the first two studies only consider cross-section data, and the latter focuses on elementary students. These studies allude to but do not test for potential endogeneity issues: for example, a finding suggesting that civic engagement influences academic achievement could be questioned considering the aforementioned research linking such achievement to civic activities. Conceptually, while civic engagement builds needed social capital (e.g., Putnam 1995;Segura, Pachon and Woods, 2001), its role in developing (or hindering) human capital is not clear. On the one hand, civically-active students might be more motivated and focused than other students and thus the association between the two could be related to ability and not to civic engagement per se. Independent of this potential ability bias, moreover, perhaps students who are more involved with current events gain a greater understanding of the value of education and, as a result, put additional effort into formal academic activities. On the other hand, academic progress might be hindered because of the time constraints imposed by civic activities. The issue of time constraints imposed by out-of-school activities has been discussed in the literature, although the focus has generally been on employment (e.g., Steinberg, Fegley and Dornbusch 1993;Carr, Wright and Brody 1996;Ruhm 1997;Schoenhals, Tienda and Schneider, 1998). Dávila and Mora (2004) have more specifically studied scholastic achievement with respect to time-constraint issues for the case of high school students with entrepreneurial parents. In this paper, we employ panel data from 1988-2000 in the National Education Longitudinal Study (NELS) of 1988 to test for the impact that civic engagement has on educational progress made after the eighth grade by empirically analyzing the following questions. What is the relationship between student-government participation (a formal type of civic engagement) and community volunteer work (a less formal activity) among high school students? Does civic engagement affect academic progress in mathematics, reading, history, and science? Does voluntary community service differently influence scholastic progress compared to involuntary service, and does the frequency of this engagement matter? Also, are civically-engaged teenagers more likely to acquire higher education than their peers? In providing empirical answers to these Civic Engagement and High School Academic Progress questions, our study assesses the relationship between civic engagement and educational progress among high school students. We also address potential endogeneity issues between factors related to civic engagement and scholastic achievement, such as controlling for household income and parents' education, as well as considering whether the community service was mandatory. Moreover, by focusing on teenagers, we examine a young population that faces a variety of civic-engagement opportunities."}, {"section_title": "DATA AND SAMPLE CHARACTERISTICS", "text": "Our empirical analyses utilize panel data from 1988 -2000 in the National Education Longitudinal Study (NELS) of 1988. In 1988, the National Center for Education Statistics (NCES) sponsored the NELS to nationally represent eighth graders in public and private U.S. schools, and to track these students in later years. The NCES conducted follow-up surveys in 1990, 1992. Students who dropped out of school after the eighth-grade are included in the follow-up surveys; thus NELS represents a rich dataset that can be used to address the questions posed by this study. Of the 16,489 individuals in the 1988-92 longitudinal sample, 15,340 provided information on whether they were performing community service in 1992. The 1992 NELS questionnaire also asks those students who were enrolled in school at the time if: (1) they had been engaged in unpaid community volunteer work since January 1990, and (2) the community service was required (such as being part of a class or mandated by a court order). While this latter information was not asked of the high school dropouts, it can be used to consider whether voluntary versus involuntary community service activities have different effects on academic progress in particular disciplines for students who were enrolled in school four years after the eighth grade. This information also provides a tool to address the potential endogeneity problem between civic engagement and scholastic achievement because involuntary service is not solely determined by the individual. The NELS has an additional advantage when addressing endogeneity issues because all individuals in the sample initially start with the same education level-the eighth grade. The academic performance can be held constant in our analyses because the NELS provides the students' scores on standardized cognitive exams (Item Response Theory exams) designed by the Educational Testing Service (ETS) in four subject areas: reading, mathematics, science, and history. 1 Finally, the NELS provides information on students before they reach high school and become old enough to actively perform community service, reducing the unintentional censoring bias that might occur in other longitudinal datasets that begin at the high school level. Table 1 provides selected mean characteristics of the NELS panel, and the Appendix contains the definitions of key variables. Over a quarter of the sample was involved in some type of community service four years after the eighth grade. Furthermore, this table reveals a positive relationship between involvement in eighth-grade student government and community service four years later. It also shows a correlation between such service and participation in student government during high school, where 27 percent of individuals performing community service in 1992 had been involved in student government, compared to 12 percent of students who were not involved with volunteer work. These results provide insight into the first question posed above, by indicating that formal civic engagement as reflected by participation in student government relates to less structured civic activities (volunteer work in the community). ***, **, * Differences are statistically significant at the one, five, or ten percent level. Notes: The parentheses contain robust standard errors for the continuous variables; these statistics were estimated using the appropriate NCES-provided sampling weights to preserve the national representation of the sample. The samples include individuals in the 1988-92 panel of the NELS who reported whether or not they participated in community/volunteer work in 1992. For information on the IRT exams (and their scoring), see Owings et al. (1994)."}, {"section_title": "Civic Engagement and High School Academic Progress", "text": "Underlying differences in altruism represent one explanation: those involved in community service in 1992 were more likely to report the importance of helping others in the community. 2 Table 1 further shows that participation in volunteer work relates to educational attainment. Nearly 12 percent of the \"uninvolved\" individuals had dropped out of school by 1992, compared to 4.5 percent of those engaged in community service activities. Similarly, almost half of the individuals performing community service in 1992 graduated from college eight years later, compared to a quarter of those who did not volunteer in their communities. These education differences, of course, warrant a more in-depth analysis. For example, they could simply reflect the fact that a greater share of the uninvolved resided in households with lower income than those performing community service ($36,000 versus nearly $47,000 in 1988), and were less likely to have college educated parents. Studies have shown that household income and parents' education represent primary factors affecting educational attainment (e.g., Hanushek 1986;Summers and Wolfe 1977;Rumberger 1983;Coleman 1988;Ehrenberg and Brewer 1997;Dávila and Mora 2004). Such characteristics could also explain the higher average exam scores in 1988 of the civicallyengaged students in mathematics, reading, science, and history. At the same time, Table 1 indicates that individuals who participated in community service made lower progress in reading during high school than other students; the uninvolved improved their reading scores by nearly 25 percent on average between 1988 and 1992, compared to the 22 percent gain experienced by civically-engaged youths. Progress in the other three disciplines, however, did not significantly differ on the basis of civic engagement. As reading is an activity that can be conducted outside of school, perhaps the lower progress in this discipline among those involved in community service reflects timeallocation pressures. Demographic characteristics are also provided in Table 1. Female students were more likely to perform community service in 1992 than males. Mexican Americans and Native Americans were over-represented among teenagers who did not perform community service, while Asians and the children of immigrants were over-represented among those who were involved in the community. While outside of the scope of this current manuscript, we explicitly analyze differences in civic engagement (and its effect on scholastic outcomes) along the lines of race/ethnicity and gender in the second part of this study (Dávila and Mora 2007). To what extent do these cursory results linking civic engagement and academic progress hold when controlling for other observable characteristics, such as household income? We turn to more rigorous econometric analyses to address this question. In particular, our methodological approach follows the techniques often used in the economics of education literature (e.g., Hanushek 1986Hanushek , 1971Ehrenberg and Brewer 1994;Mora 1997Mora , 2000Dávila and Mora 2004) to empirically test whether civic engagement relates to scholastic progress made after the eighth grade.\n(2) reported information on the frequency of community/volunteer work in 1992; and (3) had non-missing scores on the corresponding 1988 and 1992 IRT exams. Other variables in the regressions (not shown) include the percent of students in the 1988 school receiving free lunch, the geographic region of the school, the urban/rural/suburban location of the school, and binary variables indicating missing information for immigration status, household income, parents' education, and the percent of students in the school receiving free lunch. In these regressions, the Civic Engagement vector includes binary variables (=1; 0 otherwise) for three activities, namely participation in: (1) eighth-grade student government, (2) high school government (defined as involvement in student government in 1990 or 1992), or (3) community service or unpaid volunteer work in 1992. Given the host of other variables included in the regressions, the estimated coefficients on these civic engagement measures should be interpreted as net of the confounding influences of household income, prior academic standing, demographic characteristics, etc. 3 The major findings reported in Table 2 are that participation in high school student government improved, in a statistically significant way, the IRT scores of students across each academic measure, as did community service in 1992 for all scholastic categories except for reading. For example, the scholastic performance of students involved in student government during high school rose by two percent more on average in mathematics, science, and history (and 1.6 percent more in reading) than for other students, ceteris paribus. With the exception of reading, community service in 1992 also related to a positive (albeit smaller) effect on scholastic progress, with students involved in such service advancing their scores in mathematics, science, and history by 0.7 -1.4 percent more than other students. As with Table 1, the statistically insignificant relationship between reading development and community service performed in the 1991-92 school year could reflect time constraints, as reading is arguably an easier activity to conduct outside of school than other academic disciplines. More will be discussed on this issue below. Given that participation in eighth-grade student government does not have a statistically significant impact on subsequent academic progress, it would appear that formal civic engagement in the latter part of a student's academic program has a greater impact on his/her scholastic development than earlier involvement. Overall, Table 2 suggests that both formal and less formal forms of civic engagement at the highschool level might serve to highlight the value of education to students. At a minimum, the results in this table do not support the contention that civic engagement hinders the academic progress of students by detracting from the student's time into these activities. Some of the findings for the backdrop variables in Table 2 are as expected. For example, students with a low academic standing in the eighth-grade experienced a relatively low rate of academic progress in the four areas during the next four years, while those with higher 1988 IRT scores progressed at higher corresponding rates. Also, the coefficient on the female categorical variable has its traditional sign for each discipline: female students made significantly greater progress than males in reading between 1988 and 1992, but lower progress in mathematics, science, and history. African American (and with the exception of mathematics, Native American) students did not fare as well as their non-Hispanic white counterparts with respect to scholastic growth during high school, while Mexican American and Other Hispanic (i.e., non-Mexican-American) students made lower progress in two of the four subject areas than non-Hispanic whites after 1988. It is interesting to note that foreign-born students made greater improvement than other students in mathematics, science, and history, and U.S.-born students of immigrant parents outperformed their counterparts with U.S.-born parents with respect to history. Finally, Table 2 indicates an unsurprising positive association between the education of parents and the academic progress of their children during high school. Endogeneity Issues: Voluntary versus Involuntary Civic Engagement. Recall that one advantage with the NELS is that the 1992 survey contains information on whether high school students had participated in voluntary or involuntary community service activities since 1990. This distinction is important in light of the endogeneity issue mentioned above. That is, Table 2 suggests that civic engagement enhances academic progress, but the possibility remains that students making the greater progress are the ones that become more civically engaged because Civic Engagement and High School Academic Progress they have lower cognitive and material costs (e.g., Wolfinger and Rosenston 1980). We control for the cognitive costs via the exam scores and academic standing in 1988, and material costs in terms of household income, but an ideal test would be to randomly select students to participate in civic activities, and compare their subsequent academic growth to that of similar students who did not participate in these activities. 4 Such an experiment can be approximated using the NELS by considering that some students are required to perform civic duties, such as to fulfill a service-learning component for a class. While not completely random (as some students might actively seek courses with such requirements), mandatory community service depends less on the student's initiative and ability than voluntary activities. 5 Also, some academically-oriented students conduct community service as a means to enhance their college applications and build resumes (e.g., Friedland and Morimoto 2005;Price 2002). As such, examining required community service has an additional benefit of reducing the potential problem that this \"resume padding\" might create in the interpretation of the scholastic achievement results. We therefore re-estimate Equation (1) while using the alternative community service measure in the 1992 NELS survey that identifies whether service activities conducted between January 1990 and 1992 had been involuntary or strictly voluntary. Table 3 provides the regression results for the variables of interest, namely the civic engagement measures. The remaining results can be obtained from the authors. ***, **, * Statistically significant at the one, five, or ten percent level. Notes: The parentheses contain robust standard errors obtained using the appropriate NELS-provided sampling weights. This sample includes individuals who: (1) were in the 1988-1992 NELS panel, (2) reported information on the frequency of community/volunteer work in 1992, (3) were in school during the 1992 survey, and (4) had non-missing scores on the corresponding 1988 and 1992 IRT exams. The question regarding voluntary versus involuntary community service between January 1, 1990 and 1992 was not asked of high school dropouts. Other variables in the regressions include those listed in Table 2, the percent of students in the 1988 school receiving free lunch, the geographic region of the school, the urban/rural/suburban location of the school, and binary variables indicating missing information for immigration status, household income, parents' education, and the percent of students in the school receiving free lunch. Note that voluntary community service is positively related to academic progress during high school in all four disciplines, with the voluntarily engaged students improving their average scholastic performance by four to eight percentage points over their counterparts. Teenagers who conducted community service for classes also experienced significantly greater scholastic development (by three to nearly seven percentage points) in the four disciplines than their counterparts. 6 While the gains in mathematics and science were smaller for course-required community service rather service performed on a purely voluntary basis, these results provide evidence that the positive relationship between civic engagement and academic progress is not solely driven by potential endogeneity issues. These findings also point to positive educational effects associated with including service-learning components in high school curricula. Frequency of Community Service. Our results so far suggest that civic engagement promotes scholastic development. A logical extension is whether the frequency of such engagement matters. Do civic duties have diminishing marginal effects on academic progress? Clearly, if students devote 100 percent of their time to civic activities, their academic progress would decline; that is, because of the time allocation issue mentioned above, perhaps a disproportionate time commitment to non-academic service activities negatively influences academic outcomes. Ideally, we would test this hypothesis by using a continuous measure of the amount of time students spend in community-service activities. However, this measure does not exist in the NELS. Instead, we have categorical information on the frequency of community service in 1992, such that the service measure can be partitioned into \"weekly\" and \"less than weekly\" categories. 7 Table 4 provides selected regression results from estimating Equation (1) using these frequency measures. The results for mathematics and science scores suggest that there might be diminishing returns to civic engagement given that students less actively involved in community service outperformed their more active counterparts. In particular, students who participated in civic activities in 1992 less than once a week improved their scores in mathematics and science by two percentage points more than students who performed such activities every week. So while we have reported academic benefits to civic engagement, these results hint at diminishing returns to the academic progress stemming from such engagement. (2) reported information on the frequency of community/volunteer work in 1992; (3) had non-missing scores on the 1988 and 1992 corresponding IRT exams (for the academic achievement regressions). Other variables in the regressions include those listed in Table 2, the percent of students in the 1988 school receiving free lunch, the geographic region of the school, the urban/rural/suburban location of the school, and binary variables indicating missing information for immigration status, household income, parents' education, and the percent of students in the school receiving free lunch. Subsequent Educational Attainment. The results presented thus far indicate a positive relationship between civic engagement activities and academic progress made by high school students. What remains unclear is whether participation in civic activities during high school also improves subsequent educational attainment. To address this issue, we now estimate two logit models-one to account for those students remaining in school four years after the eighth grade, and the other to capture those having a four-year college degree 12 years following the eighth grade-that control for a host of demographic and socioeconomic characteristics in addition to the civic engagement measures: (2) Educational Attainment Post-88 = f (Civic Engagement 88-92 , Household 88 , Academic rank 88 , Personal, School 88 ). For the first model, Educational Attainment represents a binary variable equal to one if the student was still in school four years after the eighth grade (i.e., in 1992), and equals zero if the individual had dropped out. In the second model, this measure equals one if the individual had completed a four-year college degree by 2000 (and equals zero otherwise). When estimating the 1992 school retention regression, the sample includes individuals in the 1988-92 NELS panel. For the college graduation model, we only focus on individuals in the 1988-2000 panel who had been enrolled in school in 1992. We employ the appropriate sampling weights provided by the NCES. As with Equation (1), Civic Engagement in Equation (2) represents a vector of binary variables indicating civic activities, namely participating in student government and community service. However, for the 1992 school enrollment model, the student government measure only reflects government participation in 1988 or 1990 (not in 1992) because participating in 1992 affirms the student was still in school. The remaining terms in Equation (2) are the same as in Equation (1) above. Table 5 provides three sets of logit regression results for educational attainment. The first column includes the estimated marginal effects from the 1992 school enrollment model, and the next two columns include the estimated marginal effects for college-degree attainment using the two different measures of community service in the 1992 survey: the general measure identifying such service in 1992, and the other providing information on voluntary versus involuntary service conducted between 1990 and 1992. We cannot distinguish between voluntary and involuntary community service for the 1992 school enrollment model because the questionnaire for high school dropouts does not contain this information. Civic Engagement and High School Academic Progress   When controlling for a host of socioeconomic and demographic characteristics, Table 5 shows that both participation in student government in 1990 and community service in 1992 positively affected the odds of staying in school between 1988 and 1992. Compared to students who were not civically engaged, the likelihood of remaining in school between 1988 and 1992 was nearly five percentage points higher among those who had been involved in student government in 1990, and 3.5 percentage points higher for individuals performing community volunteer work in 1992. Similarly, such activities performed during high school significantly enhanced the probability of attaining a four-year college degree within 12 years of completing the eighth grade. Indeed, involvement in student government in the eighth grade and particularly during high school increased the odds of being a college graduate by 2000. Community service conducted in 1992 also increased these odds by nearly 14 percentage points. When considering whether community service conducted between 1990 and 1992 had been voluntary or conducted for a class, note that both types of service had similar (and positive) effects on acquiring a college degree. 8 As such, there is something about community service participation among high school students that enhanced the likelihood of finishing college several years later, regardless whether the individual volunteered in the community on his or her own accord, or because such service had been required. Of course, the possibility exists that the more civically-motivated teenagers might have intentionally enrolled in those classes (or other activities) that required community service, or were more likely to select community service over other options to meet specific course components. The data do not permit us to determine the degree to which these possibilities drive the results, but it should be noted that when focusing exclusively on individuals who reported in 1992 that it was \"very important\" to help others in the community (a sample of altruistic individuals), the results (not shown to conserve space) remain primarily unchanged. To illustrate, the re-estimated marginal effects (standard errors) of performing community service for a class, being required to do so for reasons other than a class, and performing strictly voluntary service for earning a college degree are 0.236 (0.050), 0.219 (0.072), and 0.216 (0.029) among the altruists. Other findings in Table 5 worth noting include how academic performance in the eighth grade serves as a strong predictor of later educational attainment: the odds that a student with a low academic standing in 1988 completed a college degree by 2000 were 26 percentage points below such odds for others in the cohort. Moreover, Hispanics and African Americans were significantly less likely to finish college by 2000 than non-Hispanic whites, ceteris paribus, while young women had a higher likelihood of doing so than their male counterparts. Table 5 also provides evidence of significant household effects, in which the eighth-graders' household income, parents' education level, and parents' marital status related to their schooling attainment in later years. In all, the results in Table 5 support the hypothesis of a positive relationship between high school civic engagement and subsequent educational attainment. As noted above, many studies highlight the link between civic activities and education, but they generally presume that the direction of causation stems from educational Table 5 Notes ***, **, * Statistically significant at the one, five, or ten percent level. Notes: The parentheses contain robust standard errors. These results employ the appropriate NELS-provided sampling weights. Other variables in the logit regressions include participation in eighth-grade student government, low academic ranking in the eighth-grade, personal characteristics (foreign-born and U.S.-born of foreign-born parents), household characteristics in 1988 (family income, parents' highest education level, parents' marital status), school characteristics in 1988 (percent of students receiving free lunch, location in urban/suburban/rural area, and geographic region), and binary variables for missing information for family income and the percent of students in the 1988 school receiving a free lunch. Only non-Hispanic whites, African Americans, Hispanics, and Asians in the 1988-2000 NELS panel who had non-missing information on participation in community service in 1992, and who were still enrolled in school in 1992 are included in the samples. Civic Engagement and High School Academic Progress attainment. Our analyses suggest, however, that the opposite might (also) be the case: civicallyengaged teenagers seemingly acquire higher levels of education on the average than their otherwise similar peers as they get older."}, {"section_title": "Empirical Methodology and Results", "text": "We first focus on post-eighth-grade academic progress in reading, mathematics, science, and history by estimating academic production functions using the NELS data. Specifically, we estimate: (1) Exam Score 92 = f(Exam Score 88 , Civic Engagement 88-92 , Household 88 , Personal, School 88 ). The variable Exam Score 92 represents the natural logarithm of the IRT score in 1992, and Exam Score 88 is the corresponding eighth-grade IRT score. A key advantage with estimating Equation (1) is that including the 1988 score as a regressor controls for the fact that initial achievement may influence subsequent scholastic development, and it further reduces the effects of omitted factors such as ability on academic progress (Hanushek, 1971(Hanushek, , 1986Maddala 1994: 263-64). Controlling for the 1988 exam score also means that the regression estimates should be interpreted as the marginal or \"value-added\" effects of the right-hand side variables (Hanushek 1986). Civic Engagement represents a vector of variables for civic activities undertaken between 1988 and 1992, namely participating in student government and community service. Most of our discussion will focus on the estimated coefficients on these variables. Equation 1also accounts for a host of socioeconomic characteristics as well as parental and school controls believed to be associated with academic progress. The vector Household contains variables for the individual's household's characteristics in 1988 (including income, parents' education, and parents' marital status), and School includes the percentage of students in 1988 receiving a free or subsidized lunch, as a means to control for the socioeconomic status of the student body, along with its geographic location. Finally, Personal denotes a vector of the personal characteristics, such as gender, race/ethnicity, immigration status, and whether the student had a low academic standing in the eighth grade. Table 2 presents the ordinary-least-squares (OLS) regression results for the academic progress of students in reading, mathematics, science and history. When examining reading scores, we omit those individuals who did not take the IRT for reading in both the 1988 and 1992 surveys. Similarly, when examining the other disciplines, we omit those individuals who do not have corresponding IRT scores in both surveys. ***, **, * Statistically significant at the one, five, or ten percent level. Notes: The parentheses contain robust standard errors obtained using the appropriate NELS-provided sampling weights. This sample includes individuals who: (1) were in the 1988-1992 NELS panel;"}, {"section_title": "Concluding Remarks", "text": "Beyond the implications for personal well-being, civic identity, and political awareness discussed in the literature (e.g., Thoits and Hewitt 2001;Niemi, Hepburn and Chapman 2000;Ehrlich 1999;Uggen and Janikula 1999), insight into the scholastic consequences of civic engagement should provide high school students the opportunity to make more informed decisions on the time and intensity they should devote to such activities. Because this study investigates civic activities in both school (via student government) and in the community (through volunteer work), our results provide insights into time-resource allocation among civic duties. In addition, by distinguishing between voluntary and involuntary service, our findings indicate potentially unintended positive consequences from academic policies and programs (such as Learn and Serve America) that support service-learning components in the curricula. 9 As noted by Niemi, Hepburn and Chapman (2000) and Gibson (2001) among others, voter participation and many other measures of civic participation in the political process have fallen dramatically in recent times. The many dimensions leading to this purported crisis are worthy of social science investigation. By empirically analyzing the relationship between civic activities and scholastic achievement after the eighth grade, our study participates in this debate. Indeed, we point to the importance of civic engagement to the development of social capital in the introduction, and how this type of social capital promotes a healthier democracy that is a requisite for economic development. Our findings reveal a potentially added benefit of civic engagement to economic development: civic activities undertaken by teenagers seemingly foster human capital growth."}, {"section_title": "NOTES", "text": ""}, {"section_title": "1.", "text": "The reading comprehension test attempts to measure the understanding of words in context, identifying figures of speech, interpreting the author's perspective in short reading passages, and evaluating the reading passages as a whole. The mathematics test includes word problems, graphs, equations, quantitative comparisons, and geometric figures. The science exam contains questions drawn from the fields of life, earth, and physical sciences, with the emphasis placed on understanding underlying concepts rather than the memorization of facts. Finally, the history exam actually covers a broad range of material, such as political and economic history, citizenship, and geography. See Owings et al. (1994, pp. 47-49) for more information."}, {"section_title": "2.", "text": "In 1992, the NELS questionnaire asked individuals to rate how important they deemed helping others in the community; the possible responses were \"very important\", \"somewhat important\", and \"not important\". 3. As discussed by Maddala (1994, pp. 260-64), the structure of academic progress equations such as (1) accounts for ability bias, such that the estimated coefficients on variables like Civic Engagement indicate the marginal effects of such activities. For example, assume the following equation reveals the true relationship between 1992 achievement (A 92 ), a civic activity conducted between 1988-1992 (Civic 88-92 ), and ability: (a) A 92 = β Civic 88-92 + b 1 Ability + e 1 . Further assume that achievement in 1988 relates to participation in subsequent civic activities; 1988 achievement also depends on ability: (b) A 88 = b 2 Ability + e 2 . Solving for Ability in Equation (b) placing it in Equation (a) yields: (c) A 92 = β Civic 88-92 + b A 88 + (e 1 -b e 2 ) , where b = (b 1 / b 2 ). Estimating Equation (c) by OLS provides an unbiased estimate of β (Maddala 1994;Goldberger 1972)."}, {"section_title": "4.", "text": "An additional consideration is that scholastic progress shapes attitudes toward civic engagement (e.g., Dee 2004), such that successful students become more altruistic, and therefore become involved in community service activities. Still, when only including students in the NELS sample who reported in 1992 that helping others in the community was \"very important\" (an altruistic sample), similar results to those in Table 2 exist with respect to civic engagement and academic progress. For example, the re-estimated coefficients (standard error) from Equation (1) for reading, math, science, and history are 0.025 (0.016), 0.020 (0.008), 0.023 (0.009), 0.028 (0.007) for high-school student government, and 0.006 (0.011), 0.016 (0.008), 0.031 (0.008), and 0.014 (0.005) for community service."}, {"section_title": "5.", "text": "In the second part of this study (Dávila and Mora 2007), we find that participation in courserequired community service is significantly higher for females than males, indicating that some choices are made with respect to engaging in these activities. For example, students often have options to register for particular courses, some of which might be more disposed to include service-learning components. Even in the same class, sometimes community service is an option within a set of assignments to fulfill a particular course objective. We cannot control for these possibilities with our data, but it is reasonable to assume that on average, participation in servicelearning activities depends less on students' initiatives than purely voluntary community service. 6. Recall that Table 2 suggested that overall community service conducted in the 1991-92 school year was not significantly related to gains in reading between 1988 and 1992. Yet, Table 3 shows that both voluntary and class-required community service undertaken between 1990 and 1992 positively influenced reading progress. As the voluntary/involuntary service measures cover a Civic Engagement and High School Academic Progress broader time period, perhaps the scholastic effects of civic engagement take longer to foment in areas such as reading (an activity easily conducted outside of school) than more school-intensive subjects. Future research should explore differences in the amount of time it takes to observe the influence of service-learning activities on progress made in various academic disciplines. 7. It should be noted that the NELS provides a bit more detail by further distinguishing between daily community service and service conducted \"once or twice a week\" in 1992. However, the number of students involved on a daily basis is quite small, such that we combine the two categories. 8. Along with endogeniety issues, recall that considering whether the community service was required has the advantage in terms of reducing the potential effects of \"resume padding\" on educational attainment. 9. Learn and Serve America-a program of the Corporation for National and Community Service (an independent federal agency created in 1993)-provides direct and indirect support to K-12 schools, community groups, and higher education institutions to facilitate service learning; see http:// www.learnandserve.org/. Some states also actively encourage community service opportunities in schools. For example, in 1992 Maryland became the first state to mandate service-learning activities as part of the high school graduation requirements. This mandate became effective in 1993 and applied to the graduating class of 1997 and beyond. More information can be found at http://www.marylandpublicschools.org/MSDE/programs/servicelearning/. Civic Engagement and High School Academic Progress APPENDIX: Definitions of the Variables"}, {"section_title": "Variable Construction", "text": "Engaged in community service in 1992 = 1 if individual spent time on volunteer or community service in 1992 that was not sponsored by the school; = 0 otherwise [Questions: F2S33E and F2D35E] Community service 1990-92 required for class = 1 if student in 1992 survey had performed any unpaid volunteer or community service that was required for class work since January 1, 1990; = 0 otherwise [Question: F2S38C] Community service 1990-92 required for reason other than class = 1 if student in 1992 survey had performed any unpaid volunteer or community service that was court ordered or required for reasons other than class since January 1, 1990, and community service required for class = 0; = 0 otherwise [Questions: F2S38B and F2S38D] Community service 1990-92 strictly voluntary = 1 if student in 1992 survey had performed any unpaid volunteer or community service since January 1, 1990, and community service required for class = 0 and com. service required for other reasons = 0; = 0 otherwise [Questions: F2S38A -F2S38E] Participated in student government in 1990 = 1 if participated in student government as member or officer \"this school year\" for students in school in the 1990 survey, or if participated in leadership groups such as government when student was \"in school\" for the school dropouts in 1990; = 0 otherwise [Questions: F1S41BC and F1D21D] Participated in student government in 1992 = 1 if participated in student government or served as an officer/leader \"this school year\" for students in school in the 1992 survey; = 0 otherwise Attained a four-year = 1 if highest post-secondary education degree was a bachelor's"}]