[{"section_title": "1", "text": "A therosclerotic cardiovascular disease (CVD) is the major cause of mortality and morbidity in adults with type 2 diabetes (1). The origin of atherosclerosis is early in childhood with progression toward clinically significant lesions in young adulthood (2, 3) .\nCarotid artery intima media thickness (IMT) and aortic pulse wave velocity (aPWV), a measure of arterial stiffness, are noninvasive measures of subclinical atherosclerosis that have been used as surrogate measures of cardiovascular events in various adult studies (4 -9) . Data regarding IMT and arterial stiffness in children are limited despite the increasing tide of obesity and type 2 diabetes. Therefore, in this pilot study, we aimed 1) to evaluate IMT and aPWV in obese adolescents with type 2 diabetes and 2) to investigate the relationship between these vascular markers and the clinical/metabolic risk factors of CVD."}, {"section_title": "RESEARCH DESIGN AND", "text": "METHODS -We studied 20 adolescents with type 2 diabetes (undetectable islet-cell and GAD65 autoantibodies, duration 1.7 Ϯ 0.4 years) and 22 normalweight and 20 obese healthy control subjects. The groups were comparable for age, sex, ethnicity, and puberty assessed by Tanner criteria (10) ( Table 1) . Type 2 diabetic subjects were receiving either metformin or rosiglitazone (7), metformin with insulin (5), insulin alone (1), and metformin and acarbose (1) in addition to lifestyle modification. None of the subjects had a family history of hereditary hyperlipidemia. Four subjects were smokers (three normal weight and one obese) with no significant difference among the three groups for smoking status (P ϭ 0.189).\nEach subject underwent a physical examination and had fasting blood drawn for glucose, insulin, C-peptide, adiponectin, lipid profile, high-sensitivity C-reactive protein (hs-CRP) and HbA 1 c . Homeostasis model assessment of insulin sensitivity (HOMA-IS) and fasting adiponectin level were used as surrogate estimates of insulin sensitivity (11-12). IMT and aPWV were measured by high resolution B-mode and Doppler ultrasonography, respectively (13) . Four blood pressure measurements taken immediately before and after wave acquisition with an automatic cuff were averaged."}, {"section_title": "Statistical analysis", "text": "Differences in continuous variables among the three groups were tested with either ANOVA or the nonparametric equivalent, Kruskal-Wallis. Bivariate relationships were examined with Spearman's correlation analysis because IMT and aPWV were not normally distributed. Data are presented as means Ϯ SE. Statistical significance was set at P Յ 0.05. As hs-CRP results Ͼ8 mg/l may indicate an acute inflammatory condition and cannot be used to establish risk of CVD, the values Ͼ8 mg/l (data from four obese and two type 2 diabetic subjects) were excluded from statistical analysis (14) . Data from type 2 diabetic patients taking insulin (n ϭ 6) were excluded from fasting insulin and HOMA-IS calculations. Multiple linear regression was used to evaluate predictors of aPWV, where variables were rank transformed with results presented after back transformation.\nRESULTS -Clinical, biochemical, and ultrasonographic characteristics of the subjects are presented in Table 1 . IMT was not different among the three groups. However, aPWV (centimeters per second) was highest in the type 2 diabetic subjects (769.4 Ϯ 81.7), followed by the obese subjects (583.9 Ϯ 26.9), and then followed by the normal-weight control subjects (496.9 Ϯ 15.2) ( Table 1 ). In the total group, after controlling for systolic blood pressure (because increased arterial stiffness is directly related to pulsatile blood pressure [15] ), aPWV correlated significantly with BMI (r ϭ 0.50), fasting insulin (r ϭ 0.46), fasting glucose (r ϭ 0.38), HOMA-IS (r ϭ Ϫ0.52), HbA 1c (r ϭ 0.28), triglycerides (r ϭ 0.27), and hs-CRP (r ϭ 0.47) (P Ͻ 0.001-0.042). A multiple regression analysis (obese and type 2 diabetic subjects) with aPWV as the dependent variable and HOMA-IS and HbA 1c as the independent variables revealed total R 2 ϭ 0.357 (P ϭ 0.002), with the independent contribution of HOMA-IS (R 2 ϭ 0.272, P ϭ 0.011) and HbA 1c (⌬R 2 ϭ 0.085, P ϭ 0.066).\nCONCLUSIONS -In the present study, aPWV was significantly higher in type 2 diabetic adolescents than obese and normal-weight control subjects with no differences in IMT among the three\ngroups. The elevated aPWV in type 2 diabetic youth in our study (after adjusting for methodology) is comparable with values obtained from 41-to 59-year-old obese adults in a previous study (13) and ϳ40-year-old men in the Baltimore Longitudinal Study of Aging (6), suggestive of increased risk for premature aging of cardiovascular system in youth with type 2 diabetes. These findings may reflect early functional changes in the vasculature in the absence of ultrasonographically detectable structural changes. With increasing age and duration of diabetes, these functional changes may progress to structural changes if left without intervention. This proposal is consistent with a study in Japanese adults with type 2 diabetes, which identified age and diabetes duration as independent risk factors for increased aPWV and IMT (16) . A causative link between glycemia and vessel stiffness was suggested by the Pathobiological Determinants of Atherosclerosis in Youth Study (17) . In adults with type 2 diabetes, for any given age and blood pressure value, aPWV increased with abnormal glucose tolerance and diabetes duration (18) . Our finding of higher aPWV in type 2 diabetes versus equally obese youth of similar age and blood pressure is suggestive of the additional impact of hyperglycemia on vascular stiffness.\nThe higher aPWV (ϳ87 cm/s) in obese adolescents compared with normal-weight control subjects (P ϭ 0.006) suggests that obesity alone is associated with abnormalities in aPWV. This is consistent with the data of 40-to 90-cm/s higher aPWV values in obese versus nonobese adults (13) and in obese French children with increased vessel stiffness measured by brachial artery reactivity (19) .\nInsulin resistance is the proposed link between obesity and vascular stiffness (20) . Although both obese and type 2 diabetic adolescents are insulin resistant compared with normal-weight control subjects, HOMA-IS is 40% lower in type 2 diabetic compared with obese subjects. Hypoadiponectinemia may be another component of atherogenesis by reducing endothelial activation (21) . Our findings of low adiponectin level in the obese and type 2 diabetic subjects with evidence of vascular stiffness are in accordance with these observations. Furthermore, the significantly elevated hs-CRP in obese and type 2 diabetic youth and the strong correlation between hs-CRP and aPWV are in accordance with the role of inflammation as a link between obesity/type 2 diabetes and vascular stiffness (22) .\nIn conclusion, the present observation of a profound effect of obesity/type 2 diabetes on vascular compliance, i.e., increased vascular stiffness, renders further support to the American Heart Association guidelines of primary prevention of atherosclerotic CVD beginning in childhood (23). "}]