[{"section_title": "Abstract", "text": "The anterior cingulate cortex (ACC) is involved in several cognitive processes including executive function. Degenerative changes of ACC are consistently seen in Alzheimer's disease (AD). However, volumetric changes specific to the ACC in AD are not clear because of the difficulty in segmenting this region. The objectives of the current study were to develop a precise and high-throughput approach for measuring ACC volumes and to correlate the relationship between ACC volume and cognitive function in AD. METHODS: Structural T 1 -weighted magnetic resonance images of AD patients (n = 47) and age-matched controls (n = 47) at baseline and at 24 months were obtained from the Alzheimer's disease neuroimaging initiative (ADNI) database and studied using a custom-designed semiautomated segmentation protocol. RESULTS: ACC volumes obtained using the semiautomated protocol were highly correlated to values obtained from manual segmentation (r = .98) and the semiautomated protocol was considerably faster. When comparing AD and control subjects, no significant differences were observed in baseline ACC volumes or in change in ACC volumes over 24 months using the two segmentation methods. However, a change in ACC volume over 24 months did not correlate with a change in mini-mental state examination scores. CONCLUSIONS: Our results indicate that the proposed semiautomated segmentation protocol is reliable for determining ACC volume in neurodegenerative conditions including AD."}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD) is the most common cause of dementia worldwide and progresses in stages, from mild to moderate to severe.\n1,2 Impairment in higher-order cognitive skills is consistently seen and exacerbates with each stage of the disease. 3 In response, recent research has focused on developing interventions that target specific stages of the disease to modify the course. [4] [5] [6] Structural changes of the brain have been under close scrutiny as a potential biomarker of AD progression and to identify changes underlying cognitive symptoms. [7] [8] [9] An understudied region is the anterior cingulate cortex (ACC), which shows degenerative changes and reduced functional activity in patients at early stages of AD. 10, 11 Moreover, loss of ACC volume has been demonstrated in converters from mild cognitive impairment to AD. 12, 13 ACC is a critical hub and is extensively connected to structures, including the insula, prefrontal cortex, amygdala, hypothalamus, and brainstem; the ventral ACC is implicated in the default mode network while the dorsal ACC is implicated in the frontoparietal attention network, both of which are affected in AD. [14] [15] [16] The ACC is also specifically implicated in cognitive functions, including conflict resolution, error detection, task selection, and motivation. [14] [15] [16] All of these contribute to executive function, a core cognitive ability consistently impaired in AD. 17 Impaired motivation to act is typically manifested as apathy, a feature of lesions involving the ACC, 18, 19 and a prominent symptom of AD. 19, 20 Anatomically, the ACC is comprised of gray matter demarcated by the paracingulate, cingulate, and callosal sulci. 21, 22 The paracingulate sulcus, however, is found only in 30-60% of the population. 23 The inconsistent nature of this sulcus resulted in several in vivo imaging studies considering the gray matter dorsal to the paracingulate sulcus, the paracingulate gyrus, as part of the ACC. 24, 25 Consequently, segmentation of ACC volumes is inconsistent. Manual segmentation is considered to be the current gold standard, 26 ,27 yet because portions of the ACC must be segmented individually from each slice of a magnetic resonance image (MRI) to isolate its whole volume, it is a timeconsuming task seldom feasible for large datasets. 28 Although results from automatic segmentations are reproducible, designing software that can identify anatomical structures for segmentation continues to be a complex problem as AD brains are highly variable and landmarks do not exist for all structures. 27, 29 Such is the case for the ACC; although the corpus callosum is a reliable landmark for its ventral boundary, the paracingulate sulcus on its dorsal boundary is often discontinuous even in healthy individuals. 30 To address these complexities related to the segmentation of the ACC, we proposed a modified set of landmarks to define the ACC and a protocol for semiautomated segmentation. Our objectives included developing a semiautomated method for determining ACC volume that could be used to determine progressive changes in AD, and to study the relationship between the change in ACC volume and cognitive function in the context of AD."}, {"section_title": "Methods", "text": ""}, {"section_title": "ADNI Database", "text": "Data used in the study were obtained from the Alzheimer's disease neuroimaging initiative (ADNI) database (adni.loni.usc.edu). Written informed consent for participation in the study was obtained from each participant or his/her family. All procedures related to subject participation and data acquisition were approved by the local ethics review board at each participating site."}, {"section_title": "Imaging and Clinical Data", "text": "MRI images and clinical data were obtained from the ADNI database. For the current study, subjects were only included if their T 1 -weighted images and clinical data at baseline and at 24 months were both available in the ADNI database. Following consideration of the entire ADNI database, there were 58 AD patients whose T 1 -weighted ACC images at baseline and at 24 months were comprehensible for analysis and had at least one of the neuropsychological assessments, mini-mental state examination (MMSE), 31 while 179 ageand gender-matched elderly controls who met these requirements. Consistency in scan sequence, orientation, and angulation between MRI images was insured by ADNI's screening process and was based on ADNI protocol as listed: http://adni.loni.usc.edu/wp-content/uploads/2013/09/DOD-ADNI-MRITrainingManual_09Oct2012_reduced.pdf."}, {"section_title": "Defining Landmarks for ACC Segmentation", "text": "MRI images of each subject were imported into 3D Slicer, an open-source software platform (www.slicer.org) for visualization and segmentation. Each image was visualized from the coronal plane. Eight of the 58 AD subjects were randomly selected to establish ACC landmarks. ACC landmarks used in healthy controls by Kitayama et al 32 were qualitatively tested to determine whether they may identify the ACC in AD brains. It is important to note that in the current study, the pregenual and retrogenual parts of the ACC are not considered due to high variability seen in AD brains (Fig 1A) . Therefore, the most anterior slice containing the anterior pole of the corpus callosum, the most posterior slice containing the anterior commissure, and each slice in between was considered to contain the ACC. Within each of these approximately 20 slices, the segment of the ACC was defined as the gray matter between the paracingulate sulcus, which is the first sulcus from the dorsal surface of the brain, and the corpus callosum. The cumulative gray matter between these landmarks in each slice was defined as the ACC.\nUpon review, these landmarks were modified to account for the discontinuity of the paracingulate sulcus. In slices where the paracingulate sulcus was absent, the dorsal boundary for the ACC was determined to be equivalent to the dorsal boundary of the nearest slice containing the paracingulate sulcus ( Fig 1B) . Two blinded operators manually segmented the ACC in each of the 8 randomly selected AD subjects and the results were compared for the inter-rater reliability of the defined landmarks. Similarity between the two sets of ACC volumes was quantified by the Dice similarity coefficient (DSC). 33 Correlation between the two sets of ACC volumes was determined by a Pearson correlation test and its significance was tested by a paired t-test. P < .05 was considered statistically significant."}, {"section_title": "Semiautomated Segmentation of the ACC in AD", "text": "Separate cohorts of AD subjects (n = 3) and age-matched controls (n = 3) were randomly selected to evaluate the validity of the proposed semiautomated segmentation protocol. The ACC volume of each subject was determined by both manual and semiautomated segmentation. For the manual segmentation, a blinded operator segmented the ACC in each subject and determined its volume using 3D Slicer.\nFor the semiautomatic segmentation, an initial manual segmentation was performed where a blinded operator traced a circular region in each slice. The perimeter of each circle was overlapped with the dorsal and ventral ACC landmarks such that all of the ACC gray matter in a slice was encompassed ( Fig 1C) . These circular regions were then multiplied with the grayscale image and the histogram of the grayscale region was obtained to determine the lower and upper threshold values. This step produced adaptive threshold values for each subject. This thresholding method was used to segment the ACC region in each subject and then each subject's ACC volume was measured. All steps were implemented in insight segmentation and registration toolkit (ITK) (http://www.itk.org). 34 It should be noted that the bounding box around each subject was defined using alignment between the test image and atlas image to mitigate any errors introduced by the scanner. A Pearson correlation was performed to evaluate the correlation between the ACC volumes obtained by manual and semiautomatic Manually traced left (green) and right (red) ACC and its component sulci, the paracingulate sulcus, cingulate sulcus and callosal sulcus, are shown. The most anterior slice containing the corpus callosum (vertical line 1) was used for the anterior boundary for segmentation. The most posterior slice containing the anterior commissure (vertical line 2) was used for the posterior boundary. (B) Manually segmented right ACC in coronal slices of a representative Alzheimer's disease (AD) subject. Note the absence of the paracingulate sulcus in the slice on the right (arrow). The dorsal boundary for this slice was estimated by using the closest slice with a clear paracingulate sulcus (left). (C) The semiautomatic segmentation protocol. Images display the same coronal slice in a control subject. The image on the left is the slice unlabeled. The center image demonstrates a manual segmentation of the circular region encompassed by the dorsal and ventral landmarks of the right ACC. The image on the right displays the slice after the manual segmentation has been processed using the insight segmentation and registration toolkit (ITK-processed).\nsegmentation and the significance of this correlation was tested using a paired t-test."}, {"section_title": "Volumetric Assessment of ACC and Clinical Outcomes in AD", "text": "Remaining group of 47 AD subjects and randomly selected 47 control subjects from the original sample were employed. Their ACC volumes at baseline and at 24 months were determined using the semiautomated segmentation protocol. Paired t-tests were performed to assess the change in ACC volume in controls and in AD subjects and the change in MMSE scores in controls and in AD subjects obtained from the ADNI database. Pearson correlation tests were performed to assess the correlation between the ACC volume and the MMSE scores and between the change in ACC volume and the change in MMSE scores at the two time points."}, {"section_title": "Results", "text": ""}, {"section_title": "Inter-Rater Reliability of ACC Landmarks", "text": "Example of manual segmentations of the ACC achieved by two different blinded raters in the same AD subject is shown in Fig 2A. The ACC volumes measured by manual segmentation were highly correlated between the two raters (r = .89, P < .01; Fig 2B) . The DSC for the ACC volumes determined by the two raters was .84."}, {"section_title": "ACC Volumes by Manual Versus Semiautomated Segmentation", "text": "The ACC volumes measured by the semiautomated segmentation protocol were 1.513 cm 3 larger on average than those obtained by manual segmentation. However, the difference between the two volumes on average was not statistically significant (P = .31) and the volumes determined for each subject by manual and semiautomated segmentation were highly shows the left (green) and right (red) anterior cingulate cortex (ACC) of the AD subject that was manually segmented by one blinded rater; the image on the right displays manual segmentations of the left and right ACC performed by another blinded rater. The two raters segmented the ACC individually and separately. (B) ACC volumes (cm 3 ) of three AD and three control subjects manually segmented by two blinded raters were highly correlated (r = .89; Pearson correlation). The correlation between the ACC volumes determined by each rater was statistically significant (P < .01, paired t-test). Data represent the ACC volume of individual subjects. (C) ACC volumes (cm 3 ) of AD and control subjects determined by manual and semiautomated segmentation were highly correlated (r = .98; Pearson correlation). The correlation between the ACC volumes determined by the two techniques was statistically significant (P < .001, paired t-test). Data represent the ACC volume of individual subjects. correlated (r = .98, P < .001; Fig 2C) . The average time required to segment the ACC was approximately 60 minutes per subject for manual segmentation and 10 minutes per subject for semiautomated segmentation."}, {"section_title": "ACC Volume and Clinical Outcomes in AD", "text": "For both AD and control subjects, the ACC volume at 24 months was significantly lower than at baseline (P < .0001; Fig 3A) . The mean of the difference ± SD in the ACC volumes were −.40 ± .33 cm 3 in control subjects and −.44 ± .37 cm 3 in AD subjects. There were no significant differences in ACC volumes at either time points or in the overall change in ACC volume between AD and control subjects. At both baseline and at 24 months, control subjects had significantly higher MMSE scores than AD subjects (P < .0001). In control subjects, no significant differences in MMSE scores were observed over 2 years of this study. In contrast, the MMSE score in AD subjects decreased significantly at 24 months compared to baseline (P < .0001; Fig 3B) . However, no significant correlations were observed between change in ACC volume and change in MMSE scores in the control (r = −.17) or AD group (r = −.19) (Fig 4) ."}, {"section_title": "Discussion", "text": "In this study, we defined landmarks in T 1 -weighted MRI suitable to identify the ACC in people with AD and developed and validated a semiautomated protocol to rapidly segment the ACC based on these landmarks. Employing a semiautomated protocol, we observed a small decline (.4 cm 3 ) in ACC volume over 2 years in both patient and control groups but there were no differences in the rate of atrophy between the groups.\nAD is characterized by progressive deficits in several domains of cognitive function and varying degrees of degenerative changes in brain regions. Whole brain analysis of MRI findings is less correlative to the deterioration of specific symptoms. 35 Consequently, regional analysis is often sought after. Automated analysis of magnetic resonance images of localized regions shows significant correlation to clinical progress of AD. 35 Since, ACC is considered critical for executive function and shows degenerative changes in AD, a high-throughput analysis of ACC may be a useful tool in identifying relevant changes. [10] [11] [12] [13] [14] [15] In the past, reproducible segmentation of the ACC was difficult in both AD and control subjects, partly because of the difficulty in identifying the paracingulate sulcus, which is often discontinuous and highly variable between individuals. 23, 32, 36 Whereas previous guidelines for ACC segmentations simply excluded the paracingulate sulcus in volumetric assessments, and consequently, the dorsal boundary and, hence, the ACC volume was inconclusive. 10, 32, 37 The landmarks defined in our approach overcame the challenges in identification of the ACC's dorsal boundary. In our approach, if the paracingulate sulcus is absent in a particular MRI slice, adjacent slices that do contain the sulcus are referenced to define the dorsal boundary. Each Fig 3. (A) Semiautomatically segmented anterior cingulate cortex (ACC) volumes (cm 3 ) of control subjects and Alzheimer's disease (AD) subjects at baseline and 24-month (m24) time points. Data represent mean ACC volume ± standard deviation (SD). ACC volumes for both AD and control (Ctrl) subjects were significantly higher at baseline in comparison to m24 (*P < .0001, paired t-test). (B) MiniMental Status Examination (MMSE) scores of control subjects and AD subjects at baseline and m24 time points. Data represent mean MMSE scores ± SD. MMSE scores for AD subjects were significantly higher at baseline in comparison to their scores at m24 (*P < .0001, paired t-test). In control subjects, there were no significant differences in MMSE scores between the two time points. MMSE scores for control subjects were significantly higher than that of AD subjects at both baseline and at m24 (*P<.0001, unpaired t-test).\nof the landmarks from this study were also defined such that they would be unaffected by the ACC's sulcal variability and AD-associated atrophy. 30 Overall, these landmarks were able to provide highly reproducible volumetric assessments of the ACC between raters even in late-stage AD brains.\nThe semiautomated segmentation protocol developed and validated in this study also satisfies the need for high-throughput techniques to isolate ACC volume. 10, 27, 29 The first step of this protocol ensures accurate identification of ACC landmarks. During this step, a roughly circular area was identified manually such that the tracing's perimeter overlaps with the dorsal and ventral landmarks of the ACC. This step avoids the complex challenge of developing an automated segmentation protocol with anatomical specificity. 27, 28 The second step rapidly isolated the ACC from the circular area through the use of the program ITK.\nOur overall technique demonstrated to be considerably less time consuming than a full manual segmentation of the ACC (ß2-3 minutes per slice 38 ). The difference in speed is largely due to the circular ACC tracings in our technique compared to precise manual segmentation of this region. The volumes obtained when using the semiautomated protocol and those obtained when using the gold-standard manual segmentation showed a Pearson coefficient of .98, a value considerably higher than available procedures for automated segmentation of brain areas. 39 A limitation of our methods is the small number of independent raters and sample size employed in the validation of our semiautomated technique. In future MR studies, which may benefit from and implement semiautomated segmentation, it would be important to consider increasing the number of raters and sample to improve validity.\nA high correlation between the ACC volumes was determined semiautomatically and manually, and was observed at both at baseline and at 24 months in control and AD subjects. With regard to the ACC volumes over 24 months, the semiautomated segmentation protocol was, thus, demonstrated as effective as the current gold standard in assessing brains affected by age-and AD-related atrophy. However, like many other automated techniques available, ACC volumes segmented semiautomatically were higher than those segmented manually. 40, 41 A qualitative assessment of the semiautomated segmentations revealed that this was mainly due to the isolation of the ACC using ITK, which occasionally included extra pixels from the boundaries between gray and white matter. The error is similar in nature to those observed in popular existing automated segmentation protocols such as FSL/FIRST and FreeSurfer. 42 Previously, it has been described that both of these automated protocols provide significantly larger volume estimates than manual segmentation, with FreeSurfer tending to inflate surfaces generally over the entire area of interest and FSL/FIRST inflating surfaces over the head and tail of the area of interest during segmentation. 42 It is recommended that the threshold used to differentiate between white and gray pixels in ITK be further refined for future studies. The semiautomated segmentation protocol developed in this study is, however, already a suitable technique for longitudinal analysis due to its speed and extent of correlation to manual segmentations.\nAnnual atrophy rate of the ACC in AD subjects was observed to be 3.5%, consistent with those from previous work that varied from 1.2 to 6.4%. 43, 44 ACC atrophy between the groups in the present study is not significantly different as the control group had an annual ACC atrophy rate of 3.0%. It may be possible that some control subjects on the ADNI database may have comorbidities that might have influenced these findings. 44 Alternatively, in light of a previous report that found the ACC to be one of the first structures to degenerate in AD, [10] [11] [12] [13] it is possible that differentiation between control and AD subjects based on ACC degeneration is most informative in the early stages of the disease. Future work should investigate changes in ACC volume at early stages of AD.\nACC volume was demonstrated to be a moderate indicator of performance on the MMSE, supporting our hypothesis and previous findings on the ACC's role in cognition.\n14 However, this is in contrast to Jones et al, 10 they observed no correlation between MMSE scores and ACC volume. This might be because the previous study used different criteria to define the ACC and considered only the cingulate gyrus for volumetric assessment while excluding the paracingulate gyrus. 10 Although the results may also have been influenced by the limited sample size, which the authors explain was due to the time-consuming nature of their manual segmentation protocol. 10 The MMSE tests global cognitive function while the ACC is implicated in executive function. [14] [15] [16] [17] Although widely used for its ease of administration and preference of patients and health professionals, MMSE is not suitable for identifying mild impairment in cognition. 44 Consequently, decline in ACC-related functions might be difficult to isolate from MMSE scores alone. MMSE was used in this study as it was the only cognitive measure available for this cohort of patients in ADNI database. Thus, to better understand the relationship between the ACC and AD, it is recommended that tests to assess executive function, such as the Wisconsin Card Sorting Test, be included in routine clinical assessment for AD subjects in the future.\nIn this study, we designed a semiautomated protocol to assess ACC volume in the AD brain and determined the nature of AD-associated changes in ACC volume. There is still much to be clarified about the relationship between brain atrophy and cognitive dysfunction in AD. Continued study of neural structures that are associated with both the volumetric and cognitive changes observed in AD may help clarify their association. The semiautomated segmentation protocol developed and validated in this study may serve as a useful tool to accelerate this process and aid in the discovery of a suitable biomarker for AD progression."}]