[{"section_title": "Abstract", "text": "Background-A cognitive concern from the patient, informant, or clinician is required for the diagnosis of mild cognitive impairment (MCI); however, the cognitive and neuroanatomical correlates of complaint are poorly understood."}, {"section_title": "Introduction", "text": "Mild cognitive impairment (MCI) is widely considered a prodromal phase of dementia because many individuals diagnosed with MCI convert to Alzheimer's disease (AD) [1] . Current MCI diagnostic criteria require quantitative evidence of neuropsychological impairment, relative preservation of functional abilities, and a concern regarding a change in cognition observed by the patient, someone close to the patient (i.e., an informant), or a clinician [2] . Extensive research has investigated the clinical meaningfulness of neuropsychological impairment [3] [4] [5] [6] , functional abilities [7] [8] [9] , and neuroimaging markers in MCI [10] [11] [12] . Despite a growing body of data on the clinical correlates of cognitive complaint among cognitively normal older adults [13] , there remains an underrepresentation of literature examining the cognitive and neuroimaging correlates of cognitive complaint in older adults with MCI. Understanding cognitive complaint in MCI is important because it is an essential part of the MCI diagnostic criteria, and cognitive complaint may be an early and predictive marker of unhealthy brain aging [13] .\nEvidence relating self-reported subjective cognitive complaint in MCI to objective cognitive performance is mixed. Cross-sectional studies suggest that subjective cognitive complaint in MCI is related to poorer verbal episodic memory performances [14, 15] , but this finding is not consistent across the literature [16] . For example, leveraging very large MCI cohorts, other groups have shown that subjective cognitive complaint is not associated with decline in global [17, 18] or domain-specific cognition, such as verbal episodic memory, attention, executive functioning, or information processing speed [18] . Overall, it remains unclear how subjective cognitive complaint relates to cognition.\nCognitive complaint may correspond to structural brain changes reflecting AD pathophysiology, but there are limited studies examining neuroimaging correlates of subjective complaint that exclusively focus on MCI. For example, multiple groups have focused on medial temporal lobe volumes and compared MCI with other groups, such as cognitively normal elders with and without complaint [19, 20] . This prior work suggests that the presence of cognitive complaint is related to smaller structural volumes within the hippocampus [19] , entorhinal cortex [20] , and parahippocampal gyrus [19] .\nThe frontal or parietal cortex may also be linked to self-perceived memory changes as suggested in the existing literature on anosagnosia (i.e., awareness of cognitive abilities and impairment) [for review ; 21] . Functional imaging studies suggest that MCI individuals with poor awareness of their own cognitive ability have altered metabolism in the medial frontal [22] , parietotemporal [23] , and posteriomedial [24] , and posterior cingulate [22] regions. Volumetric brain analyses suggest that more unawareness of one's cognitive ability is related to smaller medial frontal cortex in MCI [25] . It is plausible that subjective cognitive complaint might also relate to structural differences in these neuroanatomical regions.\nThe current study cross-sectionally examines whether endorsement of a specific subjective memory question (i.e., \"Do you feel you have more problems with your memory than most?\") in MCI corresponds to objective cognitive impairment or structural brain changes. Leveraging the geographically representative and comprehensive Alzheimer's Disease Neuroimaging Initiative (ADNI) database, we hypothesize that older adults with MCI who endorse a subjective memory complaint question will have poorer verbal episodic learning and memory performances (i.e., total learning, learning slope, delayed recall, delayed recognition) because rapid forgetting is most commonly the first clinical manifestation of AD [26] . To comprehensively assess the relation of subjective cognitive complaint and cognition, additional measures were included that tap key cognitive domains affected in the prodromal phase of AD, including executive functioning [6] , language [27] , and processing speed [28] . Our second hypothesis is that older adults with MCI who endorse a subjective memory complaint question will have smaller medial temporal lobe volumes (i.e., hippocampus, parahippocampal gyrus, and entorhinal cortex) because these structures are affected earliest by AD neuropathology [29] . We also examine structural variables reported in the anosagnosia literature [for review ; 21] , including cingulate, frontal lobe, and parietal lobe volumes. While all MCI participants enrolled in ADNI have some form of complaint (self, informant, or clinician), the current study aims to provide a comprehensive assessment of the biological underpinnings and cognitive correlates of subjective memory complaint in MCI using a single but common question."}, {"section_title": "Methods", "text": ""}, {"section_title": "Participant characteristics", "text": "Participants were drawn from the multisite, longitudinal Alzheimer's Disease Neuroimaging Initiative (ADNI; http://adni.loni.usc.edu/), launched in 2003 to examine neuroimaging biomarkers in the progression of MCI and AD. At the time of participant enrollment, ADNI-1 exclusion criteria included neurological disease other than AD (e.g., Parkinson's disease, epilepsy, multiple sclerosis), history of brain lesion (e.g., infection, infarction) or head trauma, and history of psychoactive medication use. For a list of full inclusion and exclusion criteria, please refer to http://www.adni-info.org. We accessed publicly available data from the original ADNI cohort (ADNI1) on 4/1/2013, and the current study was limited to participants with MCI at baseline, available baseline structural 1.5T neuroimaging data, and baseline completion of the Geriatric Depression Scale (GDS) [30] , which resulted in a total sample size of 397 participants. Analysis of ADNI's publicly available database was approved by our local Institutional Review Board prior to data access or analysis."}, {"section_title": "Diagnostic Determination", "text": "MCI was defined by ADNI as (a) Mini-Mental State Examination (MMSE) [31] score>23; (b) Clinical Dementia Rating (CDR) [32] global score ≤0.5 (reflecting mild severity of impairment); (c) relatively spared activities of daily living; (d) objective cognitive impairment as measured by education-adjusted scores on Wechsler Memory Scale-Revised (WMS-R) Logical Memory Delayed Recall [33] ; (e) expressed concern regarding cognitive change by participant, informant, or study clinician; and (e) not meeting diagnostic criteria for AD (please refer to http://www.adni-info.org) [34] ."}, {"section_title": "Cognitive Complaint Status", "text": "All ADNI MCI participants were required to have a cognitive complaint at study entry defined as a cognitive concern reported by the participant, the informant, or the study clinician. An additional complaint definition is implemented in the current study. That is, before analyses, MCI participants were categorized into two complaint groups using their response to the GDS question \"Do you feel you have more problems with your memory than most?\" [17, 35] . A \"yes\" response was coded as a complaint, and a \"no\" response was coded as no complaint. Thus, while all ADNI MCI participants have some form of complaint (self, informant, or clinician), the current study investigates the relation between a specific subjective cognitive complaint question and cognitive and neuroimaging outcomes."}, {"section_title": "Neuropsychological Assessment", "text": "All participants completed a common neuropsychological protocol assessing multiple cognitive systems as described below:\n1. Episodic Memory: The Rey Auditory Verbal Learning Test (RAVLT) [36] is a verbal episodic memory test that includes five learning trials for a list of 15 nouns (Trials 1-5 Total Learning), followed by immediate recall of a 15-item distractor list and short-delay free recall of the original list (Immediate Recall). After a 30-minute filled delay, participants are asked to recall the original list (Delayed Recall) followed by a yes/no recognition test for the original 15-item list (Delayed Recognition). We included learning slope as an outcome (a regression-based slope, which statistically models the linear best fit over all learning trials) [37] because a flat learning slope is characteristic of a classic amnestic profile [38] . The WMS-R Logical Memory [33] is a verbal episodic memory test using a paragraph-long story to assess Immediate Recall and Delayed Recall.\nusing FreeSurfer Version 5.0 (http://surfer.nmr.mgh.harvard.edu) [46, 47] . Briefly, participant data was run through the reconstruction process (recon-all) for skull stripping, intensity normalization, and segmentation by tissue type (i.e., cerebrospinal fluid, gray matter, and white matter). White and gray matter regions were segmented using spatial intensity gradients and intensity of gray/white borders [48] . Contiguous ROIs were detected based on intensity similarity and spatial gradient (contour). Bias fields were modeled as a three-dimensional second order polynomial. The cortical surface of the brain was then inflated and registered to a spherical atlas to parcellate gyral and sulcal structures [49] . After recon-all, all data were manually inspected and edited (SD, WC) to correct for registration, topological, and segmentation defects, which included inspection of white and gray surfaces in accordance with the FreeSurfer training manual (http://surfer.nmr.mgh.harvard.edu/ fswiki/Edits). During these manual edits, the segmentation of the hippocampus was reviewed and edited as necessary. After these manual edits were complete, images were reprocessed through FreeSurfer to update the transformation template and segmentation information. After surface generation, all surfaces were smoothed at 30mm full-width/halfmaximum Gaussian kernel to reduce the effects of noise on the results. Variables of interest for the current study were generated as follows:"}, {"section_title": "Cortical thickness analysis:", "text": "Both intensity and continuity information were used to produce representations of cortical thickness, calculated as the closest difference from the gray/white matter boundary to the gray matter/CSF boundary at each surface vertex [48] . The generated values relied on spatial intensity gradients not restricted to the voxel resolution, so they were not affected by absolute signal intensity and were able to detect submillimeter features. Such cortical thickness procedures have been validated with histological [50] and manual measurements [51] . Average gray matter thickness was calculated for all cortical ROIs. For the current study, ROIs from FreeSurfer [52] included the parahippocampual gyrus and entorhinal cortex."}, {"section_title": "Volumetric analysis:", "text": "For volumetric analyses, images underwent automated Talairach transformation and segmentation [53] . Regional volume was calculated based upon the number of voxels occupied within the region of interest. FreeSurfer's lobe mapping was used to calculate lobar volumes (i.e., frontal, temporal, parietal, cingulate) laterally by each hemisphere and bilaterally (total volumes)."}, {"section_title": "Intracranial Volume:", "text": "FreeSurfer computed estimated total intracranial volume (etICV) by completing three iterations of likelihood maximizations of the hidden Markov field model, then summing the gray and white matter voxels [54] . All regional and lobar volumes were corrected by intracranial volume (ICV), computed as ROI volume/etICV*100. The ICV-corrected volumes were then used in all volume-based analyses."}, {"section_title": "Statistical Analysis", "text": "Prior to hypothesis testing, between-group comparisons were conducted for demographic variables (i.e., age, education, gender, race), global cognitive functioning (i.e., MMSE), depressed mood (i.e., GDS total score excluding the question \"Do you feel you have more problems with your memory than most?\"), cognitive performances, and neuroimaging indices, using Wilcoxon rank-sum test for continuous outcomes and Pearson's chi-squared for categorical outcomes. Effect sizes were calculated according to Cohen's d formula and interpreted according to published guidelines [55] .\nHypothesis testing was conducted using linear regression for each cognitive and neuroimaging outcome with subjective cognitive complaint defined as the independent variable using no complaint as the referent. Each model adjusted for age, race, gender, education, MMSE, GDS (excluding the cognitive complaint question), and apolipoprotein-E (APOE) ε4 status (i.e., positive=ε2/ε4, ε3/ε4, or ε4/ε4 versus negative=ε2/ε2, ε2/ε3, or ε3/ ε3). Ordinal least square method was used for parameter estimation. For demographic comparisons and primary outcome models, significance was set a priori at p<0.0022 based on a strict Bonferroni correction factor (i.e., α=0.05/22 comparisons). Secondary analyses were conducted using lateral lobar volumes to assess for possible lateralization effects [for review ; 56] . Analyses were conducted using R 2.14.1 with ols function from rms package (http://cran.r-project.org) and MATLAB (2012a; The MathWorks; Natick, MA)."}, {"section_title": "Results", "text": ""}, {"section_title": "Participant Characteristics", "text": "The subjective memory complaint group (n=206) differed from the non-complaint group (n=191) on age (F (1, 395) "}, {"section_title": "Subjective Memory Complaint and Cognitive Indices", "text": "Linear regressions adjusting for baseline characteristics indicated that MCI participants with a subjective memory complaint performed worse than participants with no complaint on RAVLT Immediate (β=−1.07, p<0.001) and RAVLT Delayed Recall (β=−1.06, p=0.001).\nThe association between subjective complaint and RAVLT Trials 1-5 Total Learning (p=0.006) did not survive Bonferroni correction for multiple comparison. No other associations between complaint status and cognition were observed (p-values>0.03) using the Bonferroni-adjusted significance threshold. Refer to Table 2 for details."}, {"section_title": "Memory Complaint and Neuroimaging Markers", "text": "After adjusting for baseline clinical characteristics, subjective memory complaint did not relate to any neuroimaging outcome examined (all p-values>0.12, see Table 2 for details). Secondary analyses yielded no association between subjective memory complaint and lateralized (hemispheric) lobar volumes (data not shown)."}, {"section_title": "Discussion", "text": "Leveraging a multicenter cohort, the current study examined the cognitive and neuroanatomical correlates of a subjective memory complaint in individuals with a clinical diagnosis of MCI. Our cross-sectional findings suggest that a subjective memory complaint was related to aspects of verbal episodic memory, specifically lower (or worse) immediate and delayed recall on a serial list-learning task. Our findings are consistent with prior research suggesting that MCI individuals with a subjective memory complaint have poorer episodic memory performances, defined with a composite measure (i.e., serial list-learning, story learning, and serial figure learning) in comparison to MCI individuals without a complaint [14] .\nIn contrast, no association was observed between complaint and story learning, consistent with prior work in which we found no cross-sectional or longitudinal differences in story learning performance between MCI elders with and without a self-reported cognitive complaint [18] . The discordant finding between the list and story learning paradigms used in the current study may due to several factors. Foremost, the two measures may assess different aspects of learning and memory. Compared to story learning, serial list-learning has been shown to be more sensitive to episodic memory changes in MCI [57, 58] and more sensitive to detection of early AD pathology [59] . Second, we used a correction factor, which may be so strict that it creates a Type II error. In the absence of any correction factor, cognitive complaint would have statistically related to poorer story learning performance. Third, discrepant findings within and across the literature could relate to different complaint assessment methods. Subjective cognitive complaint can be assessed by one [20] or multiple questions [60] that query for changes compared to one's own past abilities [61] , to one's peers [35] , or based upon a functional ability [62] . Different complaint questions may relate differently to objective cognitive performance [63] without comparable clinical significance. Taken cumulatively, it is plausible that the implementation of a more sensitive measure of episodic memory or a strict correction factor, or the method of assessing subjective cognitive complaint in the current study yielded differences not captured in other recent work.\nSubjective cognitive complaint was not predictive of any non-memory cognitive performances, including executive functioning, information processing speed, or language skills. This finding is consistent with existing research suggesting that a self-complaint of cognitive change among individuals with MCI is not related to cross-sectional or longitudinal changes in other areas of cognition [18] . The lack of association with nonmemory domains could be due to the method by which we defined complaint. In the current study, subjective cognitive complaint is specific to memory (i.e., \"Do you feel you have more problems with your memory than most?\"), whereas prior work has emphasized general \"cognitive decline\" [18] . The current findings may speak to more precise concordance between memory-specific concerns and objective memory performances in individuals with MCI.\nBased on prior research in cognitively normal elders and the known distribution of pathology early in the AD course, we hypothesized that cognitive complaint would be related to greater atrophy in the hippocampus [19] , parahippocampal gyrus [19] , and entorhinal cortex [20] . However, our statistical models did not yield any significant associations between memory complaint and the neuroimaging markers of interest, including brain regions commonly affected early in AD (i.e., hippocampal, parahippocampal, and entorhinal cortex) and areas implicated in anosagnosia (i.e., frontal, parietal, and cingulate volumes) [for review ; 21,56] . Recent evidence suggests that objective episodic learning and memory impairments (as measured by RAVLT) precede structural imaging evidence of hippocampal atrophy [64] . Given the association between subjective memory concern and objective list-learning performance, it is plausible that a subjective memory complaint is an early clinical marker of AD pathogenesis. However, alternative explanations should be considered. This null finding could suggest that MCI individuals who report a memory change have medial temporal and global atrophy comparable to MCI individuals who deny any memory changes, making detection of any between-group differences difficult. Morphological brain changes in the medial temporal lobe are known to be present in MCI [1, 65] , but ADNI MCI cohort members may have more medial temporal atrophy than typically seen in MCI given ADNI's higher conversion rate to dementia (i.e., 16.5% over 12 months) [34] as compared to epidemiological studies (i.e., 2-7%) [66] . It is also possible that our method for segmenting hippocampal volume introduced unwanted variance, making it difficult to detect differences in this anatomical region [67] . Alternatively, we defined cognitive complaint by one memory-focused question, which may be insufficiently sensitive to neuroanatomical changes, especially those areas implicated in anosagnosia.\nIt is important to note that as part of the diagnostic classification at ADNI enrollment, all MCI participants had some form of cognitive complaint (i.e., self-report, informant-report, or clinician-report). Due to possible inconsistency in site-specific methods for defining complaint and the unavailability of item-level self-report complaint data in the ADNI enrollment dataset, we leveraged responses to one self-report question (i.e., Do you feel you have more problems with your memory than most?), which is collected as part of the GDS. Our single-item method provided an opportunity to define complaint consistently across all MCI cohort members enrolled across the ADNI sites. The current findings provide new information about how this specific self-perceived memory question relates to cognitive and neuroimaging markers of unhealthy brain aging. Furthermore, results suggesting that endorsement of the item was related to poorer objective episodic memory performance augment past work examining the validity of this particular memory complaint question [35] .\nThe ADNI cohort offers a number of strengths, including nationwide representation of participants, standardized diagnostic criteria, standardized neuroimaging protocol, and standardized neuropsychological protocol. A strength of the current study is that methodologically, we considered memory complaints in tandem with neuropsychological and neuroimaging outcomes. Lastly, restriction of participant inclusion to MCI allowed for a greater understanding of how complaint relates to cognitive and neuroimaging markers of cognitive aging in a population at very high risk for converting to dementia.\nThe present study has several noteworthy limitations. First, ADNI participants are predominantly White and well-educated (i.e., with a mean education of 16 years), which may limit the generalizability of findings to the population at large. Criteria for MCI diagnosis in ADNI requires a memory complaint, thus all participants in the current study have some form of self-, informant-, or clinician-concern regarding cognitive changes. Although the ADNI MRI protocol was optimized for comparability across different scanning platforms, variability in hardware and software configurations may have contributed unknown variance to the data. While our analytical plan was hypothesis-driven, the current study did not analyze all possible brain structures, so we may have overlooked an important association between memory complaint and neuroanatomical changes not captured in the regions selected. Furthermore, the lobar regions (i.e., frontal, parietal, and cingulate) included in our analyses were large and possibly lacked sufficient sensitivity to detect associations between subjective complaint and these broader cortical areas. Our analyses were cross-sectional, so we are unable to make temporal or causal associations between memory complaint and outcomes, but a longitudinal analysis may help resolve inconsistencies in relations between cognitive complaint and neuroanatomical changes.\nThe current study provides new information about the cognitive and neuroanatomical correlates of memory complaint by suggesting that a memory complaint in MCI is related to worse immediate and delayed recall performances. The current findings enhance this prior literature by investigating detailed verbal episodic learning and memory performances (i.e., total learning, learning slope, immediate recall, delayed recall, recognition), rather than a global composite measure in older adults with MCI. Results indicate that subjective memory complaint correlates not only with delayed recall but also with immediate recall.\nThe findings highlight that this memory complaint question may have clinical implications for individuals with MCI and that endorsement of the question \"Do you feel you have more problems with your memory than most?\" is preferentially related to objective memory performance as compared to other cognitive performances (i.e., executive functioning, information processing speed, language). Further research is needed to better understand the clinical relevance of cognitive complaint in MCI and to extend these analyses to cognitively normal older adults to examine the role of memory complaint as an early marker of unhealthy brain aging. Additionally, expanding outcomes to include cerebrospinal fluid biomarkers of AD or amyloid and tau imaging will further enhance understanding of the clinical significance of cognitive complaint. Such information could provide clinicians and researchers with an important and easy-to-use tool for identifying individuals at risk for unhealthy brain aging. Early recognition of older adults with abnormal cognitive changes is critical for minimizing the public health burden of dementia and AD. "}]