[{"section_title": "", "text": "12. Percentage of actual detections of nitrate greater than concentrations of 2, 5, and 10 milligrams per liter and the predicted probability of detecting elevated concentrations of nitrate from models that did and did not include fertilizer use, using ground-water quality data collected by "}, {"section_title": "Probability of Detecting Atrazine/Desethyl-atrazine and Elevated Concentrations of Nitrate in Ground Water in Colorado", "text": "By Michael G. Rupert"}, {"section_title": "Abstract", "text": "Draft Federal regulations may require that each State develop a State Pesticide Management Plan for the herbicides atrazine, alachlor, metolachlor, and simazine. Maps were developed that the State of Colorado could use to predict the probability of detecting atrazine and desethylatrazine (a breakdown product of atrazine) in ground water in Colorado. These maps can be incorporated into the State Pesticide Management Plan and can help provide a sound hydrogeologic basis for atrazine management in Colorado. Maps showing the probability of detecting elevated nitrite plus nitrate as nitrogen (nitrate) concentrations in ground water in Colorado also were developed because nitrate is a contaminant of concern in many areas of Colorado.\nMaps showing the probability of detecting atrazine and(or) desethyl-atrazine (atrazine/DEA) at or greater than concentrations of 0.1 microgram per liter and nitrate concentrations in ground water greater than 5 milligrams per liter were developed as follows: (1) Ground-water quality data were overlaid with anthropogenic and hydrogeologic data using a geographic information system to produce a data set in which each well had corresponding data on atrazine use, fertilizer use, geology, hydrogeomorphic regions, land cover, precipitation, soils, and well construction. These data then were downloaded to a statistical software package for analysis by logistic regression. (2) Relations were observed between ground-water quality and the percentage of landcover categories within circular regions (buffers) around wells. Several buffer sizes were evaluated; the buffer size that provided the strongest relation was selected for use in the logistic regression models. (3) Relations between concentrations of atrazine/DEA and nitrate in ground water and atrazine use, fertilizer use, geology, hydrogeomorphic regions, land cover, precipitation, soils, and well-construction data were evaluated, and several preliminary multivariate models with various combinations of independent variables were constructed. (4) The multivariate models that best predicted the presence of atrazine/ DEA and elevated concentrations of nitrate in ground water were selected. (5) The accuracy of the multivariate models was confirmed by validating the models with an independent set of ground-water quality data. (6) The multivariate models were entered into a geographic information system and the probability maps were constructed."}, {"section_title": "INTRODUCTION", "text": "Ground-water quality is a water-resource management concern in Colorado. Pesticides (a generic term for herbicides, insecticides, and rodenticides) have been detected in greater than 90 percent of the wells sampled in urban and agricultural areas of the South Platte River Basin of northeast Colorado (Dennehy and others, 1998) . Atrazine and desethylatrazine (DEA), a breakdown product of atrazine, were detected in water from 61 and 54 percent, respectively, of the wells sampled in the South Platte River Basin; alachlor, metolachlor, and simazine also were detected (Dennehy and others, 1998) . Pesticide data from the South Platte River Basin were compared with pesticide data collected in many different basins of the United States. The South Platte River Basin ranked in the highest 25 percent of the basins for frequency of pesticide detections (U.S. Geological Survey, 1999) , and types of pesticides detected in the South Platte River Basin were similar to those found across the United States. Frequency of pesticide detections from 1,034 wells sampled in agricultural and urban settings across the United States were atrazine (38.2 percent), DEA (34.2 percent), simazine (18.0 percent), metolachlor (14.6 percent), and prometon (13.9 percent) (Kolpin and others, 1998) . Not all areas in Colorado have high frequencies of pesticide detections; data collected from the San Luis Valley in south-central Colorado showed few pesticide detections (Anderholm, 1996) in spite of coarsetextured soils and a water table close to the land surface. Ground-water samples collected in the Upper Colorado River Basin also showed few pesticide detections (Spahr and others, 2000) .\nDraft Federal regulations (U.S. Environmental Protection Agency, 1996) may require that each State develop a State Pesticide Management Plan (PMP) for the herbicides atrazine, alachlor, metolachlor, and simazine. The Colorado Agricultural Chemicals and Groundwater Protection Program, a cooperative effort of the Colorado Department of Agriculture (CDA), the Colorado Department of Public Health and Environment (CDPHE), and the Colorado State University Cooperative Extension (CSUCE), is developing a PMP for each of the herbicides and would benefit from a map that could be used to predict the probability of detecting atrazine and DEA in ground water. The map could be incorporated into the PMP and provide a sound hydrogeologic basis for atrazine management in Colorado. Other organizations and programs that could benefit from maps that predict the probability of detecting atrazine, DEA, and elevated concentrations of nitrate in ground water include the agri-chemical industry, county and city governments, farmers, planning and zoning commissions, education programs for applicators, and State programs related to Wellhead Protection, Drinking Water, Home-ASyst, and Best Management Plans (BMP's). To address these needs, the U.S. Geological Survey (USGS), in cooperation with the CDA, CDPHE, and CSUCE, conducted a study to develop maps to predict the probability of detecting atrazine and(or) DEA and elevated concentrations of nitrate in ground water in Colorado."}, {"section_title": "Background", "text": "Ground-water vulnerability maps are designed to portray the potential for contamination of ground water in an area on the basis of anthropogenic (related to human activities) and hydrogeologic factors. Several definitions have been used for the term \"ground-water vulnerability.\" The National Research Council (1993) defines ground-water vulnerability to contamination as \"the tendency or likelihood for contaminants to reach a specified position in the ground-water system after introduction at some location above the uppermost aquifer.\" The National Research Council (1993) refined the definition on the basis of whether the assessment was contaminant specific, defined as \"specific vulnerability,\" or for any contamination in general, \"intrinsic vulnerability.\" Rao and Alley (1993) defined \"intrinsic vulnerability\" to be the time of travel of water from the point of contaminant entry to the reference location in the ground-water system. The U.S. Environmental Protection Agency (1993) defined aquifer vulnerability to pesticides as \"the relative ease with which a contaminant (such as a pesticide) applied on or near the land surface can migrate to the aquifer of interest under a given set of agronomic management practices, pesticide characteristics, and hydrogeologic sensitivity conditions.\" The U.S. Environmental Protection Agency (1993) groups factors such as depth to ground water, geology, and soils into hydrogeologic sensitivity; sensitivity plus contaminant input and contaminant characteristics constitutes ground-water vulnerability. Vowinkel and others (1996) defined vulnerability as sensitivity plus intensity, where intensity is a measure of the source of contamination. Even though multiple definitions have been used for the term \"vulnerability,\" they all attempt to address the same underlying question: What is the potential for ground-water contamination?\nThe most widely known ground-water vulnerability mapping procedure is the DRASTIC model (Aller and others, 1985) . DRASTIC was designed to evaluate the potential for ground-water contamination in a given area on the basis of hydrogeologic factors. The DRASTIC acronym refers to the seven factors considered in the model: depth to water, net recharge, aquifer media, soil media, topography, impact of vadose zone media, and hydraulic conductivity of the aquifer (Aller and others, 1985, p. iv) . The DRASTIC model has been used to develop ground-water vulnerability maps in many parts of the Nation, but the validity and accuracy of the model has met with mixed success (Koterba and others, 1993, p. 513; Barbash and Resek, 1996; Rupert, 2001) . DRASTIC maps usually use a vulnerability point rating system that is based upon best professional judgment instead of calibration to actual contaminant concentrations.\nOne of the first published ground-water vulnerability maps in Colorado was developed for the greater Denver area by Hearne and others (1995) using the DRASTIC model. Hall (1998) developed a groundwater sensitivity map for the entire State of Colorado using a modified form of the DRASTIC model. Four factors were incorporated into Hall's map: (1) Location of principal aquifers, (2) depth to water table, (3) soil hydrologic group, and (4) the presence of irrigated agriculture. Hall's map (1998) was constructed at a relatively small scale (1-km grid cells), and the point rating scheme was developed on the basis of best professional judgment.\nNolan and others (1997) developed a groundwater vulnerability map for the contiguous 48 States that shows the risk of nitrate contamination. Nolan and others (1998) used estimates of nitrogen input (such as fertilizers and animal manure), soil drainage, and woodlandto-cropland ratios. Nolan and others (1998) observed a good fit when they compared their maps to actual ground-water quality data.\nThe validity and accuracy of ground-water vulnerability maps have been improved by calibrating the vulnerability rating system to actual ground-water quality. Rupert (2001) improved the validity and accuracy of a modified DRASTIC vulnerability map by calibrating (adjusting) the vulnerability point ratings to measured nitrite plus nitrate as nitrogen (nitrate) concentrations in ground water using nonparametric statistical tests.\nThe validity and accuracy of ground-water vulnerability maps also have been improved by using logistic regression to relate water-quality data to anthropogenic and hydrogeologic factors (Koterba and others, 1993; Druliner and others, 1996; Nolan and Clark, 1997; Tesoriero and Voss, 1997; Rupert, 1998) . Logistic regression (Hosmer and Lemeshow, 1989; Kleinbaum, 1994 ) is a statistical method that can be used to predict the probability of occurrence of an event of interest (such as detection of a contaminant in ground water) as a function of a set of independent variables (such as land cover and soils). Logistic regression is an improvement over the nonparametric statistical methods used by Rupert (2001) because the actual probabilities of a detection are quantified and the weighting of the independent variables is quantified."}, {"section_title": "Purpose and Scope", "text": "This report presents maps developed to show the probability of detecting concentrations of atrazine and(or) DEA (atrazine/DEA) at or greater than 0.1 µg/L and elevated concentrations of nitrate greater than 5 mg/L in ground water in Colorado. The maps are based on predictions of the probability of detecting contamination calculated using logistic regression and are termed \"probability\" maps. The probability maps are analogous to the U.S. Environmental Protection Agency's (1993) vulnerability maps because hydrogeologic, land cover, and chemical-use variables are combined. These probability maps are intended to be used by the Colorado PMP to identify areas in greatest need of ground-water protection. The study used a broad-brush approach, and additional site-specific data would be needed for site-specific evaluations.\nThe maps were developed from existing Geographic Information System (GIS) data and existing ground-water quality data; resources to develop or collect additional data were not available. Relations between atrazine/DEA and nitrate in ground water and anthropogenic and hydrogeologic factors were examined using a GIS and statistical analysis software. Statistical models that predict the probability of detecting atrazine/DEA and elevated concentrations of nitrate in ground water were developed using logistic regression statistical methods. The only herbicide probability map developed by the study was for atrazine/DEA because only atrazine/DEA had a sufficient number of detections in the available data sets for analysis by logistic regression. Ground-water quality data used in the study were collected from 1992 to 2000 by the State of Colorado and the USGS. In this report, nitrate refers to nitrite plus nitrate measured as nitrogen."}, {"section_title": "CLIMATE, GEOLOGY, AND WATER USE", "text": "Colorado ( fig. 1 ) has been called \"The Rooftop of the Nation\" because it contains more peaks higher than 14,000 ft than all the other States combined (Litke, 1990) . The headwaters of four major rivers-the Arkansas, Colorado, Rio Grande, and South Platte-are in Colorado. The lowest elevation (about 3,300 ft) is in southeastern Colorado, where the Arkansas River flows into Kansas.\nColorado's midlatitude interior-continental location and high-altitude, mountainous terrain combine to produce a complex and diverse climate. Annual precipitation ranges from about 7 inches in the San Luis Valley of south-central Colorado to about 60 inches in the mountains east of Steamboat Springs ( fig. 1) (Collins, 1991) . Seasonal large-scale atmospheric circulation interacts with the mountainous topography to produce three major precipitation patterns in the State (Collins, 1991) . Throughout the winter, frontal systems from the Pacific Ocean travel generally eastward over the Colorado Rockies, causing relatively large amounts of precipitation west of the Continental Divide and small amounts of precipitation east of the divide. This important precipitation pattern provides the snowpack for snowmelt runoff that produces much of Colorado's water supply. The second precipitation pattern affects eastern Colorado during the spring and summer, where moisture from the Gulf of Mexico produces periodic, widespread rainfall and occasionally severe thunderstorms. The third precipitation pattern affects the southern Rocky Mountains during the summer, where subtropical moisture from the Pacific and Atlantic oceans drifts northward into the Southwestern United States, resulting in frequent summer thunderstorms (Collins, 1991) ."}, {"section_title": "San Luis Valley", "text": "The geology of Colorado can be generalized by subdividing the State into four regions. Eastern Colorado contains the High Plains ( fig. 2) , a gently rolling upland composed mostly of shales, limestones, and siltstones of Cretaceous age, overlain by gravels of Tertiary age (Chronic, 1980 The most productive and easily developed aquifers in Colorado (and commonly some of the most vulnerable to contamination) are composed of unconsolidated deposits of Tertiary or Quaternary age (Hurr and Hearne, 1985) . The most significant unconsolidated aquifers are composed of alluvial and eolian deposits near the South Platte River and its tributaries ( fig. 3 ), alluvial and eolian deposits near the Arkansas River and its tributaries, alluvial and eolian deposits in the High Plains aquifer in eastern Colorado, and sand, gravel, and eolian deposits in the San Luis Valley of south-central Colorado (Hurr and Hearne, 1985) . An important regional aquifer in eastern Colorado is the High Plains aquifer of Tertiary and Quaternary age ( fig. 3) , also referred to as the \"Ogallala aquifer.\" The High Plains aquifer extends into Colorado, Kansas, Nebraska, New Mexico, Oklahoma, South Dakota, Texas, and Wyoming. The High Plains aquifer is a water-table aquifer that is composed mainly of sand and gravel deposits with some silt and clay.\nThe western one-half of Colorado holds threefourths of the State's surface-water resource but contains only 10 percent of the State's population (Litke, 1990) . The eastern one-half of the State, which includes the populous Front-Range urban corridor surrounding Denver, must rely on scarce rainfall (8-16 inches per year), ground-water resources, and water diverted from the western part of the State to fulfill its water demands (Litke, 1990) .\nGround water constitutes 18 percent of the total water used in Colorado (Hurr and Hearne, 1985) . Of the total population, 15 percent obtains drinking water from ground water. In many rural areas of Colorado, ground water is the main source for domestic and irrigation supply. Of the total 2.7 million acres irrigated in Colorado, 2.1 million acres are irrigated with ground water or a combination of ground water and surface water (Hurr and Hearne, 1985) . "}, {"section_title": "Major River Basins", "text": ""}, {"section_title": "Major Geologic Regions", "text": ""}, {"section_title": "METHODS OF INVESTIGATION", "text": "Maps showing the probability of atrazine/DEA detections and elevated concentrations of nitrate in ground water in Colorado were developed in several steps. 1. All suitable anthropogenic, hydrogeologic, and ground-water quality data were compiled. 2. Ground-water quality data were overlaid with anthropogenic and hydrogeologic data using a GIS to produce a data set in which each well had corresponding data on atrazine use, fertilizer use, geology, hydrogeomorphic regions, land cover, precipitation, soils, and well construction. These data then were downloaded to a statistical software package (SYSTAT) for analysis (SPSS, Inc., 2000) . 3. Relations were observed between ground-water quality and the percentage of land-cover categories within circular regions (buffers) around wells. Several buffer sizes were evaluated; the buffer size that provided the strongest relation was selected for use in the logistic regression models. 4. Several preliminary multivariate models with various combinations of independent variables were constructed. 5. The multivariate models that best predict the presence of atrazine/DEA in ground water were selected. 6. The models were validated with a second, independent set of ground-water quality data to verify their accuracy. 7. The multivariate models were entered into the GIS, and the probability maps were constructed. The specific details of data compilation, statistical methods, model development, model validation, and construction of the probability maps are discussed in the following sections."}, {"section_title": "Compilation of Anthropogenic, Hydrogeologic, and Ground-Water Quality Data", "text": "Anthropogenic, hydrogeologic, and groundwater quality data were compiled for use by this study. Anthropogenic and hydrogeologic data include herbicide use, fertilizer use, geology, hydrogeomorphic regions, land cover, precipitation, soils, and well construction. These data were available in GIS format from a variety of sources.\nTwo independent sets of ground-water quality data were used in this study. One set of data was collected by the State of Colorado; the other was collected by the USGS. The data collected by the State of Colorado were used to calibrate the models because the data were collected at the greatest number of wells and the wells had a wider distribution across the State. The data collected by the USGS were used to validate the models."}, {"section_title": "Anthropogenic and Hydrogeologic Data", "text": "Herbicide-use data were obtained from two sources. The first source was the CDA, which surveyed all commercial pesticide applicators during 1997 (Robert Wawrzynski, Colorado Department of Agriculture, written commun., 2001). Information on compounds applied, the amounts of active ingredients, and the number of acres being treated in each county was compiled. This survey included commercial chemical applicators, residential landscaping applicators, and structural/termiticide applicators, but retail sales by sources such as hardware stores and home gardening stores were not included. Farmers were included in the survey, but those data could not be used in this study because the survey did not include the county where the farmer applied the pesticide.\nThe second source of herbicide-use data was Battaglin and Goolsby (1994) , who prepared GIS coverages of herbicide-use estimates for the 20 mostused herbicides in the conterminous United States based on data compiled by Gianessi and Puffer (1991) . Gianessi and Puffer's (1991) estimates for each county included the number of acres treated, pounds of active ingredient used, and pounds used per square mile. Herbicide-use estimates by county were generated by Gianessi and Puffer (1991) for 1987 by the following procedure: (1) Collect statistics by State, by crop, on percentage of acres treated with a given herbicide, and average annual application rates of the herbicide from surveys sent to Extension Service weed scientists in 1987 and 1989; (2) augment survey data with published information available from some States; (3) establish herbicide-use profiles, by State and by crop, containing the percentage of acres treated and average annual application rates; (4) apply herbicideuse profiles to county-level crop-acreage estimates from the 1987 Census of Agriculture (U.S. Department of Commerce, 1989) ; and (5) tabulate pounds of active ingredient of herbicides used by crop and by county. Although crop-acreage data represent the 1987 growing year, the herbicide-use estimates generally reflect 1989 usage amounts (Gianessi and Puffer, 1991) . In this study, usage amounts in Battaglin and Goolsby (1994) were converted to ounces to allow comparison with the usage data compiled by the CDA. In order to produce the most accurate results with logistic regression, usage amounts also were divided by 100,000 to transform the data to the same relative magnitude as all other independent variables. When the final probability maps were created for this study, atrazine use was assigned only to areas in GIS coverages that delineate irrigated agricultural land cover because these are the areas where most, if not all, agricultural atrazine use occurs.\nEstimates of nitrogen fertilizer use for 1997 were developed by David Lorenz (U.S. Geological Survey, written commun., 2001). First, estimates of the total amount of nitrogen fertilizer product that was sold in Colorado during 1997 were obtained from the Association of American Plant Food Control Officials (AAPFCO) at the University of Kentucky. The statewide total was prorated to each county based upon amounts of fertilizer expenditures by farmers that were reported in the 1997 Census of Agriculture. In order to produce the most accurate results with logistic regression, nitrogen fertilizer estimates were divided by 1,000,000 to transform the data to the same relative magnitude as all other independent variables prior to analysis by logistic regression. When the final probability maps were created for this study, nitrogen fertilizer use was assigned only to areas in GIS coverages that delineate agricultural land cover.\nEstimates of average annual precipitation for 1961-90 were developed by Daly and others (1994) , with the Parameter-elevation Regressions on Independent Slopes Model (PRISM). PRISM uses climatic point data and a digital elevation model (DEM) to generate gridded estimates of climatic parameters. PRISM has been used extensively to map precipitation and minimum and maximum temperature over the United States, Canada, and other countries. Green (1992) digitized geology from the original scribe sheets used to prepare the published Geologic Map of Colorado (Tweto, 1979) . For this study, geologic units were grouped to allow comparison of ground-water quality among similar geologic materials. For instance, sedimentary deposits of Quaternary age were grouped into one category and metamorphic and intrusive rocks of Precambrian age were grouped into a different category.\nA GIS data set delineating hydrogeomorphic regions in Colorado was developed for this study ( fig. 3) . Hydrogeomorphic regions are similar in concept to regional aquifers, but are distinguished from regional aquifers in that hydrogeomorphic regions are delineated on the basis of general geographic locations of geologic materials and not on actual aquifer locations. A comprehensive coverage of regional aquifers for all of Colorado was not available, but hydrogeomorphic regions satisfied the needs of this study. Hydrogeomorphic regions were delineated by combining information from three sources. The first source was the geologic map of Colorado (Tweto, 1979) , which was digitized by Green (1992) . Unconsolidated alluvial regions were delineated by using the alluvial, gravel, eolian, and glacial deposits of Quaternary age that are delineated on the geologic map of Colorado. The second source was a GIS coverage delineating the boundary of the High Plains aquifer (Cederstrand and Becker, 1999 ) that was compiled from a digital coverage created for publication of paper maps in McGrath and Dugan (1993) . The third source was a GIS coverage digitized from reports that delineate the boundary of the valleyfill aquifer in the lower Arkansas River Basin (Hurr and Moore, 1972; Nelson and others, 1989a Nelson and others, , 1989b Nelson and others, , 1989c .\nLand-cover data for Colorado were obtained from National Land Cover Data (NLCD) developed by the U.S. Geological Survey (2000). NLCD were produced as part of a cooperative project between the U.S. Environmental Protection Agency and the USGS to produce a consistent land-cover GIS data layer for the conterminous United States based on 30-meter-resolution Landsat thematic mapper (TM) data. The NLCD contains 21 categories of land-cover information-open water, perennial ice and snow, low-intensity residential, high-intensity residential, commercial/industrial/transportation, bare rock/sand/clay, quarries/strip mines/gravel pits, transitional, deciduous forest, evergreen forest, mixed forest, shrubland, orchards/vineyards, grasslands, pasture/hay, row crops, small grains, fallow, urban/recreational grasses, woody wetlands, and emergent herbaceous wetlands. The NLCD files were too large for the computers available to this study to manipulate in raw form, so the files were generalized to 60-meter resolution. This generalization may have improved the consistency of the data by reducing the number of isolated single-cell occurrences of a particular land-cover classification, which were probably an artifact of spectral processing and not true differences in land cover.\nSoils data were obtained from the State Soil Geographic (STATSGO) database (U.S. Department of Agriculture, 1991). The finer scale Soil Survey Geographic (SSURGO) database (U.S. Department of Agriculture, 1995) was not available for all regions in Colorado. The STATSGO data were not suitable for use by this study in raw form, so STATSGO data compiled by Schwarz and Alexander (1995) were used. These later data included weighted averaging of many of the soil characteristics contained in the database (table 1) . Available water-capacity data were multiplied by 100 to transform the data to the same relative magnitude as all other independent variables prior to analysis by logistic regression. The U.S. Department of Agriculture (1993) provides more information on these soil characteristics."}, {"section_title": "Ground-Water Quality Data for Model Calibration", "text": "Herbicide and nitrate ground-water quality data collected by the State of Colorado for the years 1992 through 1999 were used as the model calibration data set for this study. The data were collected through a cooperative program with the CDPHE, CDA, and CSUCE to meet the requirements of the Colorado Agriculture Chemicals and Groundwater Protection Act. This monitoring program collects samples from different regions of the state each year, and collects samples from selected wells in Weld County annually. The water samples were analyzed by the CDA laboratory in Denver. The minimum laboratory reporting limits for alachlor, atrazine, DEA, and metolachlor were lowered during the study period as the laboratory improved its analytical capabilities. All ground-water quality monitoring data were censored to the highest minimum laboratory reporting limit (0.1 µg/L for atrazine) for analysis by logistic regression. The ground-water quality data collected by the State of Colorado were collected from shallow wells completed in the uppermost portion of unconfined aquifers. The median depth of the wells is 64 ft, the median water level is 14 ft below land surface, and the median saturated thickness penetrated by the wells is 40 ft. Table 1 . Summary of soil characteristics described in the STATSGO soil database (Schwarz and Alexander, 1995) [mm, millimeters]"}, {"section_title": "Soil characteristic Description", "text": "Available water capacity The volume of water that should be available to plants if the soil, exclusive of rock fragments, was at field capacity. Clay content Clay content of the soil or horizon, expressed as a percentage of material less than 2 mm in size."}, {"section_title": "Liquid limit", "text": "The water content at the change between the liquid and plastic state of the soil. It is measured on thoroughly puddled soil material that has passed a number 40 sieve (0.43 mm) and is expressed on a dry-weight basis. Occurrence of hydric soils Hydric soils are soils that are saturated, flooded, or ponded long enough during the growing season to develop anaerobic conditions in the upper part. They make up part of the criteria for the identification of wetlands. Organic matter content\nThe amount of organic material in the soil, in percent by weight."}, {"section_title": "Soil permeability", "text": "The amount of water that will move downward through a unit area of saturated soil in unit time, under unit hydraulic gradient, measured in inches per hour. Based upon laboratory measurements."}, {"section_title": "Soil drainage", "text": "The natural drainage condition of the soil, based on the frequency and duration of periods when the soil is free from saturation. Ratings are composed of seven categories ranging from very poorly drained to excessively drained. Soil erodibility A relative index of the susceptibility of bare, cultivated soil to particle detachment and transport by rainfall. Measured by applying simulated rainfall on freshly tilled plots."}, {"section_title": "Soil hydrologic group", "text": "The minimum steady-ponded infiltration rate for a bare ground. Ratings are composed of four categories, A through D, with A having the highest saturated hydraulic conductivity. Soil surface slope Slope of soil surface, measured in percent."}, {"section_title": "Soil thickness", "text": "The weighted average thickness of all soil layers, in inches.\nGround-water quality data collected by the State of Colorado were screened to use only one analysis from each well. For wells in which the compound was detected in more than one sample, the largest concentration was used. For wells in which a compound was detected in one sample, but not in another sample, the sample with the detection was used in the logistic regression calculations. The reason for this approach is because the well has a likelihood for future contamination if the compound was detected at any time in water from that well, and the most valid logistic regression model will be developed if all detections are used.\nHerbicides and elevated concentrations of nitrate primarily were detected in water from wells in the eastern half of Colorado and in the San Luis Valley. Atrazine/DEA was detected mostly in the Arkansas and the South Platte River Basins ( fig. 4) . Concentrations of atrazine ranged from below the minimum laboratory reporting level of 0.1 µg/L to a maximum concentration of 4.2 µg/L (table 2), which exceeds the maximum contaminant level of 3 µg/L established for drinking water by the U.S. Environmental Protection Agency (2000). Metolachlor and alachlor were detected in the South Platte River valley, but at a much lower frequency than atrazine (table 2). Nitrate concentrations are greater than the maximum contaminant level of 10 mg/L (U.S. Environmental Protection Agency, 2000) in the Arkansas River Basin, the South Platte River Basin, and the San Luis Valley in the Rio Grande Basin ( fig. 5 )."}, {"section_title": "Ground-Water Quality Data for Model Validation", "text": "Herbicide and nitrate ground-water quality data analyzed by the USGS National Water Quality Laboratory for the years 1993 through 2000 were used as the model validation data set for this study. Most of the data were collected by the USGS National WaterQuality Assessment Program (NAWQA), which is studying water quality in three basins in Colorado in addition to many other basins in the United States. Data collected in northeast Colorado were collected by the South Platte River Basin Study Unit . Data collected in central and western Colorado were collected by the Upper Colorado River Basin Study Unit (Apodaca, 1997) , and the data collected in the San Luis Valley were collected by the Rio Grande Basin Study Unit (Anderholm, 1996) . Atrazine data from the lower Arkansas River valley (southeastern Colorado) were collected by investigators of the State of Colorado as part of the cooperative program with CDA, CDPHE, and CSUCE but were included in the USGS data set because the samples were analyzed by the USGS National Water Quality Laboratory using the same USGS laboratory methods used for the NAWQA data. The reporting level for atrazine in the USGS data set (0.001 µg/L) (Zaugg and others, 1995) is lower than the reporting levels in the Colorado data set (0.1 µg/L). The ground-water quality data in the USGS data set were collected from shallow wells completed in the uppermost portion of unconfined aquifers. The median depth of the wells is 36 ft, the median water level is 13 ft below land surface, and the median saturated thickness penetrated by the wells is 12 ft.\nHerbicides and elevated concentrations of nitrate in the USGS data set were detected in areas similar to detections in the State of Colorado data set, but the USGS data set had a larger frequency of herbicide detection because of the lower laboratory reporting limit. Atrazine and DEA were commonly detected in the Arkansas and South Platte River Basins ( fig. 6 ). Atrazine and DEA were not detected in the San Luis Valley, probably because atrazine is not used by local weed control districts (Eric Lane, Colorado Department of Agriculture, oral commun., 2002) or farmers in the area (Sandra McDonald, Colorado State University Cooperative Extension, oral commun., 2002). The USGS data set had a higher frequency of detection of atrazine, metolachlor, and simazine than the State of Colorado data set probably because of the lower laboratory reporting limits of the USGS data (table 2) . USGS atrazine concentrations ranged from below the minimum laboratory reporting limit of 0.001 to 1.6 µg/L. For the most part, nitrate concentrations were above the maximum contaminant level of 10 mg/L in the South Platte River Valley and the San Luis Valley (fig. 5 )."}, {"section_title": "Statistical Methods and Regression Models", "text": "Logistic regression (Hosmer and Lemeshow, 1989; Kleinbaum, 1994) is conceptually similar to multiple linear regression because relations between one dependent variable and several independent variables are evaluated. In logistic regression, the dependent variable (for this study, atrazine/DEA detection or elevated nitrate concentration) was transformed to a binary variable (detection or nondetection). A major advantage of logistic regression over multiple regression is that the former is well suited for analysis of data sets with a large number of nondetections. Logistic regression calculates several statistical parameters that determine the predictive success of the model. The log-likelihood ratio measures the success of the model as a whole by comparing observed with predicted values (Hosmer and Lemeshow, 1989, p. 13) ; specifically, it tests whether model coefficients of the entire model are significantly different from zero. The most significant model is the one with the highest loglikelihood ratio, taking into account the number of independent variables (degrees of freedom) used in the model. The log-likelihood ratio follows a chi-squared distribution, and the computed p-value indicates whether model coefficients are significantly different from zero. In other words, the computed p-value is the significance level attained by the data; the smallest p-value indicates the best model. (Nolan and Clark, 1997, p. 855) . The partial-likelihood ratio was used to compare nested models to determine the significance of adding one or more new variables (Helsel and Hirsch, 1992; Nolan and Clark, 1997) . A nested model contains all of the independent variables in the original model, plus one or more additional independent variables. To determine whether the model is improved by adding the independent variable, the logistic regression model is calculated without that new variable. Logistic regression calculates a partiallikelihood ratio. The logistic regression model then is rerun, this time with the additional new independent variable; the second model also calculates a partiallikelihood ratio. The difference in partial-likelihood ratios between the two models is calculated, and a chisquared approximation is calculated with degrees of freedom equal to the number of additional variables in the new model. If the p-value from the chi-squared distribution is less than 0.10, the model has been significantly improved at the 90-percent significance level.\nIn logistic regression, a model is generated that predicts the probability (P) of detecting atrazine/DEA or elevated concentrations of nitrate in ground water similar to equation 1:\n(1) (table 3) . Ground-water quality data collected by the State of Colorado were used to calibrate the logistic regression models. Ground-water quality data collected by the USGS were used to validate the performance of the models. All data on atrazine/ DEA and nitrate concentrations in ground water were converted to binary coding of \"zero\" for wells with no detection and \"one\" for wells with detections to satisfy the input data requirements of logistic regression. To produce the largest possible sample set, and because DEA is a breakdown product of atrazine, atrazine and DEA data were combined into one dependent variable.\nAtrazine use, fertilizer use, percent land cover, precipitation, soils, and well construction were modeled as continuous variables. Land cover was modeled as percentage of a certain land-cover classification within Because of their categorical nature, geology and hydrogeomorphic regions were modeled as discrete (design) variables. Discrete variables were coded as \"one\" if a well was located in a particular geologic or hydrogeologic unit and coded \"zero\" if the well was not located in a unit. An example is the hypothetical case where two geologic units exist, Unit A and Unit B. If a well is located in Unit A, then the database would be coded \"Unit A = 1,\" \"Unit B = 0.\" Hosmer and Lemeshow (1989) provide more information on the use of continuous and discrete variables in logistic regression."}, {"section_title": "Selecting the Most Significant Land-Cover Buffer Size", "text": "Land cover in many areas in Colorado consists of a patchwork of many different types. For instance, fields of irrigated row crops can be commingled with irrigated pasture and nonirrigated rangeland ( fig. 7) . Ground-water quality in areas with multiple landcover classifications probably reflects the combined effects of all the land-cover classifications in those areas. To account for mixtures of land-cover classifications in the vicinity of wells, this study incorporated the percentage of land-cover classifications within circular buffers around wells into the logistic regression models.\nThe significance of relations between the percentage of land-cover classifications and groundwater quality is affected by the size of the buffers around wells. To determine which buffer size had the most significant relation with ground-water quality, univariate logistic regression relations between ground-water quality data collected by the State of Colorado and percentage of land-cover classifications were evaluated. The following buffer radii were evaluated: zero, 100, 250, 500, 1,000, 2,000, 4,000, 8,000, 16,000, 20,000, 30,000, 40,000, and 50,000 meters. A wide range of buffers was used to bracket the optimum buffer size. McFadden's rho-squared (SPSS, Inc., 2000, p. I-571) was calculated for each buffer size, and the results were plotted to highlight the most significant relation (figs. 8 and 9).\nFor agricultural lands, an optimum buffer size of 2,000 meters was determined for atrazine/DEA detections and elevated concentrations of nitrate ( fig. 8) . Pasture/hay, row crops, small grains, and fallow land-cover classifications were regressed with atrazine/DEA detections greater than 0.1 µg/L and nitrate detections greater than 5 mg/L; row crops had the most significant relation, followed by small grains ( fig. 8 ). Pasture/hay and fallow did not have a significant relation. Logistic regression calculated p-values for each independent variable in the univariate relations; p-values for row crops and small grains were less than 0.004, denoting these relations are statistically significant.\nFor urban lands, an optimum buffer size of 500 meters was determined for atrazine/DEA detections and elevated concentrations of nitrate ( fig. 9 ). Low-intensity residential, high-intensity residential, commercial/industrial/transportation, and urban/ recreational grasses land-cover classifications were regressed with atrazine/DEA detections greater than 0.1 µg/L and nitrate detections greater than 5 mg/L; commercial/industrial/transportation had the most significant relations, followed by urban/recreational grasses and high-intensity residential ( fig. 9 ). Lowintensity residential did not have a significant relation. Individual p-values for commercial/industrial/ transportation were less than 0.005, which indicates these relations are statistically significant. Individual p-values for urban/recreational grasses and highintensity residential ranged from 0.100 to 0.254, which indicates much weaker relations.\nAgricultural land cover had a larger significant buffer size than urban land cover, possibly because wells in agricultural lands are deeper than wells in urban land cover. Out of 439 wells sampled by the State of Colorado with well depth information, 418 wells have row crop land cover within a 2,000-meter buffer. The median depth of these wells is 65 ft, and the mean well depth is 117 ft. From this same data set, 95 wells have commercial/industrial/transportation land cover within a 500-meter buffer; the median well depth is 50 ft and the mean well depth is 86 ft. Agricultural land cover also may have a larger buffer size than urban land cover because ground-water quality in agricultural land is typically influenced by nonpoint pollution such as widespread fertilization of fields, whereas urban land may be more influenced by point-source pollution from local sources such as spills and leaks. "}, {"section_title": "ESTIMATING THE PROBABILITY OF DETECTING ATRAZINE/ DESETHYL-ATRAZINE AND ELEVATED CONCENTRATIONS OF NITRATE IN GROUND WATER", "text": "Statistical models predicting the probability of detecting atrazine/DEA at or greater than concentrations of 0.1 µg/L in ground water were developed using logistic regression techniques. All possible combinations of independent variables were evaluated to develop the most accurate models. Overall model validity and accuracy were determined by evaluating the log-likelihood ratio, McFadden's rho-squared, p-values calculated for each independent variable, and the percentage of correct responses. The models were built by including each individual variable in the model and evaluating the resulting test statistics. One of the most useful methods to determine whether addition of a particular independent variable made a significant improvement to the model was to compare the partial-likelihood ratios calculated before and after addition of that variable. As described in the \"Statistical Methods and Regression Models\" section, the independent variable was determined to significantly improve the model if the chi-squared p-value calculated from the difference of the partial-likelihood ratios was less than 0.1."}, {"section_title": "Development of Atrazine/ Desethyl-atrazine Model", "text": "Two models were developed that predict the probability of detecting atrazine/DEA in ground water: one with and one without estimates of atrazine use. Both models were developed because atrazine use can improve the statistical strength of the model, but the use estimates are inexact estimates and are available only on a county-by-county basis. As a result, in some cases, probability ratings change substantially at county boundaries.\nHydrogeomorphic regions, available water capacity of soils, clay content of soils, occurrence of hydric soils, organic matter content of soils, percentage of land in row crops within a 2,000-meter buffer, and percentage of land in small grains within a 2,000-meter buffer were significant variables in both atrazine/DEA models (table 3). Percentage of low-intensity residential land within a 500-meter buffer and percentage of pasture/hay land within a 2,000-meter buffer were significant variables in the model without atrazine use but were not significant in the model with atrazine use, probably because atrazine use contains similar information but has higher statistical significance than low-intensity residential and pasture/hay land cover. This higher statistical significance is confirmed by a smaller p-value for atrazine use (0.059) than low-intensity residential (0.081) and pasture/hay (0.092) land covers without atrazine use (table 3) . Overall performance of both models was good, with the chi-squared p-value calculated from the log-likelihood ratio of the entire model less than 0.001, McFadden's rho-squared values greater than 0.338, and the percentage of correct predictions greater than 0.8 (table 4) .\nThe p-values corresponding with each significant land cover and soil variable incorporated in the models were all less than 0.10, and several were less than 0.001 (table 3), confirming that the land cover and soil variables used in the models were significantly related to atrazine/DEA detections in ground water. The significance of the hydrogeomorphic regions is more difficult to interpret than the percent land cover and soils variables because hydrogeomorphic regions were modeled as discrete variables. Because they were discrete variables, the (table 3) , which is to be expected because the greatest atrazine use occurs in irrigated row crops. On the other hand, the relation between the percentage of small grains and atrazine/DEA detections was negative. The small grains land-cover classification comprises mostly dryland grains on which little or no atrazine is used; as the percentage of small grains land cover increases, the occurrence of atrazine/DEA detections decreases. The relation between clay content and organic-matter content of soils and atrazine/DEA detections was negative. Increased clay and organicmatter content in soil decreases the likelihood that atrazine/DEA will reach the water table.\nTo help confirm that the atrazine/DEA models are calibrated to the ground-water quality data, regressions were made between the percentage of actual atrazine/DEA detections and the predicted probability of atrazine/DEA detections ( fig. 11 ). The percentage of actual atrazine/DEA detections was determined by dividing the predicted probabilities for the entire study area into groupings of 10 percent (0 to 10 percent, greater than 10 to 20 percent, greater than 20 to 30 percent, and so on). The percentage of atrazine detections within each group then was calculated and included in the regressions shown in figure 11 . Both atrazine/DEA models showed good calibration, with r-squared values larger than 0.95."}, {"section_title": "Development of Nitrate Model", "text": "Logistic regression models were developed to predict the probability of detecting elevated concentrations of nitrate by using the same methods as those used to develop the atrazine/DEA models. Six models were developed. Three different nitrate concentrations were tested to determine which concentration produced the best models-greater than 2 mg/L, greater than 10 mg/L, and greater than 5 mg/L. Background nitrate concentrations are generally less than 2 mg/L (Nolan and others, 1998) H ig h P la in s a q u if e r S a n d , g r a v e l, a n d e o li a n d e p o s it s in t h e S a n L u is V a ll e y A ll u v ia l a n d e o li a n d e p o s it s n e a r t h e A r k a n s a s R iv e r a n d t r ib u t a r ie s A ll u v ia l a n d e o li a n d e p o s it s n e a r t h e S o u t h P la t t e R iv e r a n d identifying problem areas before concentrations exceed the maximum contaminant level. Two models were developed for each of these concentrations: one with and one without nitrogen fertilizer use. Nitrate data were converted to binary classifications of \"zero\" for nondetection and \"one\" for detection at each of the three nitrate concentrations, and multivariate models were constructed using logistic regression. The most significant logistic regression models were developed at a nitrate concentration greater than 5 mg/L (fig. 12) ; the r-squared values of the regressions were the largest. The log-likelihood was much larger for the models developed at greater than 5 mg/L (greater than 230) than the models developed at greater than 2 mg/L (less than 163) or greater than 10 mg/L (less than 184). Soil organic matter and occurrence of hydric soils became insignificant in the models developed at greater than 2 mg/L and 10 mg/L, which severely limits the accuracy of the resulting maps. The numbers of detections and nondetections of nitrate were evenly distributed at greater than 5 mg/L, which probably aided the development of the most significant models at this concentration."}, {"section_title": "Validation of the Atrazine/ Desethyl-atrazine and Nitrate Models", "text": "To validate the models, comparisons were made with an independent set of ground-water quality data collected by the USGS. The atrazine/DEA groundwater quality data collected by the USGS had a lower laboratory reporting level (0.001 µg/L) than the data collected by the State of Colorado (0.1 µg/L). To make the data comparable, the USGS data were converted to binary classifications of \"zero\" for nondetection and \"one\" for detection at or greater than a concentration of 0.1 µg/L before validating the models. Relations of the atrazine/DEA models with ground-water quality data collected by the USGS (validation data) had an r-squared of 0.849 for the model with atrazine use and an r-squared of 0.792 for the model without atrazine use ( fig. 13 ). The r-squared values from the validation data set are smaller than from the calibration data set probably because the validation data set had a lower overall number of wells and a lower percentage of atrazine/DEA detections; out of 228 wells, water from only 32 wells had atrazine/DEA detections at or greater than 0.1 µg/L. Relations with the validation data set would probably have larger r-squared values if additional ground-water quality data were available.\nValidations of the nitrate models with an independent set of ground-water quality monitoring data collected by the USGS were good; an r-squared of 0.966 was calculated for the model without fertilizer use, and an r-squared of 0.910 was calculated for the model with fertilizer use (fig. 14) . USGS data were converted to binary classifications of \"zero\" for no detection and \"one\" for detection greater than a concentration of 5 mg/L before validating the models. "}, {"section_title": "Construction of Atrazine/ Desethyl-atrazine and Nitrate Probability Maps", "text": "Maps showing the probability of ground water in Colorado of detecting atrazine/DEA at or greater than concentrations of 0.1 µg/L ( fig. 15 ) and nitrate concentrations greater than 5 mg/L ( fig. 16) were constructed using the logistic regression models. Before constructing the maps, all GIS data were converted to grids with 60-meter spacing. Then, the logistic regression models similar to equation 1 were entered into a GIS and a probability rating was calculated for each of the approximately 78,000,000 grid nodes across Colorado. The atrazine/DEA and nitrate models that did not incorporate chemical (atrazine and nitrogen fertilizer) use are shown in figures 15 and 16. The models that incorporate chemical use are not shown in this publication because the differences between the maps with and without chemical use are not visible at the scale the maps are presented. Percentage of actual detections of nitrate greater than concentrations of 2, 5, and 10 milligrams per liter and the predicted probability of detecting elevated concentrations of nitrate from models that did and did not include fertilizer use, using ground-water quality data collected by the State of Colorado (calibration data)."}, {"section_title": "MODEL RESULTS", "text": "Atrazine-use estimates by the CDA (Robert Wawrzynski, Colorado Department of Agriculture, written commun., 2001) and Battaglin and Goolsby (1994) were evaluated to determine which estimates were most closely related with atrazine/DEA detections in ground water. The estimates by Battaglin and Goolsby (1994) had more significant relations with atrazine/DEA detections in ground water than the CDA data, probably because the CDA data were based on use estimates by commercial applicators but did not include estimates of atrazine use by farmers.\nThe probabilities of detecting atrazine/DEA and nitrate in urban areas may be anomalously low. In the State of Colorado data set, a limited number of wells were near urban areas, which may have caused the logistic regression model to give urban areas an anomalously low probability rating. The validity and accuracy of the probability maps in urban areas may be improved in the future if additional ground-water quality data become available. The logistic regression models were significantly improved when more than one soil characteristic was incorporated. Acceptable models were developed using only one soil characteristic, but the models were much more significant when several soil characteristics were used. Contaminant migration through the soil is affected by complex interactions with the soil; using more than one soil characteristic can constrain these interactions and reduce the statistical variability in the model.\nThe same ground-water monitoring, hydrogeologic, and anthropogenic data used to create the atrazine/DEA models were used to create the nitrate models, thus allowing a direct comparison between atrazine/DEA and nitrate models. For the most part, the same independent variables that were significant in the atrazine/DEA models were significant in the nitrate models (table 3) ; hydrogeomorphic regions, available water capacity of soils, clay content of soils, occurrence of hydric soils, organic matter content of soils, and percentage of row crops within a 2,000-meter buffer were important variables in the atrazine/DEA and nitrate models. Percentage of low-intensity residential land within a 500-meter buffer, percentage of pasture/hay land cover within a 2,000-meter buffer, and percentage of small grains land cover within a 2,000-meter buffer were significant variables in the atrazine/DEA model without atrazine use but were not significant in either of the nitrate models (table 3). The differences between atrazine/DEA and nitrate models were attributed to differences in the extent and rates of application of these compounds, and possibly to differences in the chemical behavior of these compounds in the environment.\nHydrogeomorphic regions are significant in the atrazine/DEA and nitrate models because a large variation in percentage of atrazine/DEA detections and elevated concentrations of nitrate occurs between the various hydrogeomorphic regions of Colorado ( fig. 10 ). Hydrogeomorphic regions primarily are a surrogate for aquifer lithology in the logistic regression models, but chemical use, climate, and cropping practices also vary regionally among the hydrogeomorphic regions. Hydrogeomorphic regions are an important variable because they allow logistic regression to compartmentalize the variability in groundwater quality conditions observed in an area as large as Colorado, and they allow logistic regression to build statistical models that are significant over a wide variety of environmental conditions. One advantage to using hydrogeomorphic regions is that the probability maps are calibrated to current groundwater quality conditions within each region, creating models that are more accurate under relatively local conditions. One disadvantage is that using hydrogeomorphic regions may give some areas anomalously low probability ratings in regions where a particular chemical compound or contaminant has not yet been used, or where chemical use increased but an insufficient amount of time has passed for those compounds to reach the ground water. Anomalously low probability ratings may occur because the compound has not yet been detected in ground water, so logistic regression would assign low probability to that hydrogeomorphic region.\nModels that excluded hydrogeomorphic regions (figs. 17 and 18) were constructed to allow a comparison with models that did include such regions (figs. 15 and 16). In the atrazine/DEA and nitrate models that excluded hydrogeomorphic regions, the probability ratings tend to decrease in the South Platte River Basin and increase in the High Plains and the San Luis Valley (figs. 17 and 18) because the land cover and soils variables are modeled equally across the entire State. Model validity and accuracy were significantly reduced in all models that excluded hydrogeomorphic regions (table 5) (table 5) . A negative relation with percentage of shrubland land cover within a 2,000-meter buffer and a negative relation with percentage of small grains land cover within a 2,000-meter buffer became significant when hydrogeomorphic regions were excluded from the atrazine/DEA and nitrate models (table 6) .\nModels incorporating hydrogeomorphic regions may be useful for predicting probability of detecting atrazine/DEA and elevated concentrations of nitrate in regions that have a relatively long history of atrazine use or nitrogen input from sources such as fertilizers and manure; models excluding hydrogeomorphic \nregions may be more useful for extending probability ratings into regions where atrazine has not been used or sources of nitrogen have not existed. For instance, the San Luis Valley has a low probability of atrazine/DEA detections in the model that incorporates hydrogeomorphic regions ( fig. 15 ). Very little, if any, atrazine is used on crops in the San Luis Valley, and atrazine/DEA have not been detected in ground water in the San Luis Valley (figs. 4, 6, and 10). The lack of atrazine/DEA detections in the San Luis Valley caused logistic regression to give the San Luis Valley low probability ratings. Atrazine/DEA probability ratings in the San Luis Valley are larger in the model that does not include hydrogeomorphic regions ( fig. 17 ), indicating that portions of the valley may have a potential for atrazine/DEA detections in ground water if atrazine is used there in the future.\nOnly 40 wells were sampled in the interbasin sand, gravel, eolian, and glacial deposits hydrogeomorphic region, and in many of the basins no wells were sampled (figs. 4, 5, and 6). The interbasin sand, gravel, eolian, and glacial deposits hydrogeomorphic region was excluded from the final atrazine/DEA and nitrate probability maps that included hydrogeomorphic regions (figs. 15 and 16) because insufficient groundwater quality data were available to calibrate the atrazine/DEA and nitrate models for this hydrogeomorphic region. The interbasin sand, gravel, eolian, and glacial deposits hydrogeomorphic region was included in the atrazine/DEA and nitrate models that exclude hydrogeomorphic regions, however, because these models are based upon correlations with ground-water quality across the entire State (figs. 17 and 18) and not in particular hydrogeomorphic regions.\nPercentage of low-intensity residential land cover within a 500-meter buffer\nPercentage of high-intensity residential land cover within a 500-meter buffer\nPercentage of commercial/industrial/transportation land cover within a 500-meter buffer\nPercentage of urban/recreational grasses land cover within a 500-meter buffer "}, {"section_title": "USE OF THE ATRAZINE/ DESETHYL-ATRAZINE AND NITRATE MODELS FOR ALACHLOR, METOLACHLOR, AND SIMAZINE", "text": "The State of Colorado may have to develop chemical-specific PMP's for alachlor, metolachlor, and simazine. Relations between atrazine/DEA detections and nitrate concentrations greater than 5 mg/L with alachlor, metolachlor, and simazine were evaluated to determine if the atrazine/DEA or nitrate models could be used as a surrogate for alachlor, metolachlor, or simazine detections.\nLogistic regression models for alachlor, metolachlor, and simazine could not be constructed because an insufficient number of detections were available in the data set.\nThe co-occurrence of atrazine/DEA detections and nitrate concentrations greater than 5 mg/L with alachlor, metolachlor, and simazine was observed. Ground-water quality data collected by the USGS were used because of the higher frequency of detections due to the lower laboratory reporting limits (table 2). Out of 57 samples with detections of simazine, atrazine was detected in 52 samples (tables 2 and 7), indicating a relatively large co-occurrence. Metolachlor had a less frequent co-occurrence with atrazine; out of 36 samples with detections of metolachlor, atrazine was detected in 28 samples. Co-occurrence of metolachlor and simazine with nitrate concentrations greater than 5 mg/L was less frequent (table 7) . There were insufficient alachlor detections to determine if there is co-occurrence with atrazine/DEA and nitrate concentrations greater than 5 mg/L. A Spearman correlation matrix was calculated to quantify correlations between alachlor, atrazine, DEA, atrazine/DEA combined, metolachlor, simazine, and nitrate concentrations greater than 5 mg/L (table 8) . USGS data were used for the correlation; data were converted to binary coding of \"zero\" for nondetection and \"one\" for detection to reduce the influence of concentrations in the correlations. Two factors are strongly correlated when the result from a Spearman correlation approaches plus or minus one; no correlation exists as the Spearman correlation approaches zero (Helsel and Hirsch, 1992) . A strong correlation between atrazine, DEA, and atrazine/DEA combined (table 8) verifies co-occurrence; atrazine and DEA should be strongly correlated because DEA is a breakdown product of atrazine. Simazine had Spearman correlations of about 0.6 with atrazine, DEA, and atrazine/DEA combined, indicating a relatively strong correlation. All other correlations were insignificant. The ground-water quality data also were subdivided into individual hydrogeomorphic regions, but the Spearman correlations were not significantly different than those presented in table 8.\nThe Spearman correlation matrix indicates that the atrazine/DEA and nitrate models probably are not valid for metolachlor and simazine. Additional comparisons between the occurrence of atrazine/DEA and metolachlor and simazine are needed before reaching a final conclusion on the use of the atrazine/DEA model as a surrogate for metolachlor and simazine. The differences in chemical use should be taken into account, as well as the differences or similarities in chemical characteristics of the compounds, such as solubility and sorption coefficient. Table 7 . Number of wells with co-occurrence of alachlor, metolachlor, and simazine with atrazine detections and nitrate concentrations greater than 5 milligrams per liter in ground water in Colorado using ground-water quality data analyzed by the U.S. Geological Survey "}, {"section_title": "APPROPRIATE USES OF THE PROBABILITY MAPS, AND SUGGESTIONS FOR IMPROVEMENTS", "text": "The probability maps developed by the methods described in this report are designed to portray the potential for contamination of ground water in Colorado. These maps do not show areas that are actually (currently) contaminated, but rather, the areas that have a potential (or likelihood) for being contaminated if a contaminant was released to the environment. More specifically, each map shows the probability of detection (in terms of a percent) of a particular chemical compound (the contaminant) in ground water. Probability is not the same as certainty; a well in a high probability area is not necessarily contaminated because contamination also can depend on well depth and other local factors not taken into account by the models described in this report.\nThe atrazine/DEA and nitrate probability maps were specifically developed for use by the State of Colorado in their PMP to help provide a sound hydrogeologic basis for the management of atrazine and nitrogen in Colorado. The maps are intended to be a first approximation at developing a consistent rating method for the entire State. Additional site-specific data are needed before site-specific decisions are made, such as pesticide-use restrictions. The most appropriate uses of these maps are to focus prevention programs in areas of greatest concern, to focus ground-water sampling programs in areas of greatest potential for contamination, and to assist educational programs for ground-water quality protection.\nThe probability maps should not be used at a scale any larger than 1:250,000. The soils data had the smallest scale (1:250,000) of all the independent variables used in the models; therefore, the resulting probability maps should not be used at a larger scale. Soils data at a larger scale were not available for all regions of Colorado.\nThe accuracy of the probability maps would be improved if (1) larger scale soils data were available in digital form, (2) more complete and detailed chemical-use data were available, and (3) a larger number and wider distribution of ground-water quality data, particularly in rangeland areas, were available. Data differentiating between sprinkler and flood irrigation methods would probably improve the accuracy in agricultural areas. Some site-specific variables, such as improper well construction and local spills of contaminants, were not accounted for in the models. Accounting for ground-water flow direction was beyond the scope of this study.\nDepth to ground water was not evaluated by this study because a large-scale statewide coverage was not available. Hall (1998) incorporated a depth to water (CSUCE) , is developing a PMP for each of the herbicides and would benefit from a map that could be used to predict the probability of detecting atrazine and desethyl-atrazine (DEA) in ground water. The map could be incorporated into the PMP and provide a sound hydrogeologic basis for atrazine management in Colorado. Nitrate also has been identified as a contaminant of concern in ground water in Colorado. To address these needs, the U.S. Geological Survey (USGS), in cooperation with the CDA, CDPHE, and CSUCE, conducted a study to develop maps to predict the probability of detecting atrazine and(or) DEA and elevated concentrations of nitrate in ground water in Colorado.\nMaps showing the probability of detecting atrazine and(or) DEA (atrazine/DEA) concentrations at or greater than 0.1 µg/L and nitrite plus nitrate as nitrogen (nitrate) concentrations greater than 5 mg/L in ground water in Colorado were developed using logistic regression statistical methods as follows:\n(1) Ground-water quality data were overlaid with anthropogenic and hydrogeologic data by using a geographic information system to produce a data set in which each well had corresponding data on atrazine use, fertilizer use, geology, hydrogeomorphic regions, land cover, precipitation, soils, and well construction. These data then were downloaded to a statistical software package for analysis by logistic regression techniques; (2) relations were observed between ground-water quality and the percentage of land-cover categories within circular regions (buffers) around wells. Several buffer sizes were evaluated; the buffer size that provided the strongest relation was selected for use in the logistic regression models; (3) relations between atrazine/DEA and nitrate in ground water and atrazine use, geology, hydrogeomorphic regions, land cover, precipitation, soils, and well-construction data were evaluated and several preliminary multivariate models with various combinations of independent variables were constructed; (4) the multivariate models that best predicted the presence of atrazine/DEA and elevated concentrations of nitrate in ground water were selected; (5) the accuracy of the multivariate models was confirmed by validating the models with an independent set of ground-water quality data; and (6) the multivariate models were entered into a geographic information system and probability maps were constructed.\nTwo models that best predicted the probability of detecting atrazine/DEA in ground water were selected: one with and one without atrazine use. Relations of the predicted probability of atrazine/DEA in ground water with the percentage of actual detections were good; r-squared values were 0.953 and 0.956. Models were validated using a second set of groundwater quality data (validation data). Relations of the predicted probability of atrazine/DEA in ground water with the percentage of actual detections in the validation data set had an r-squared of 0.849 for the model with atrazine use and an r-squared of 0.792 for the model without atrazine use. Smaller r-squared values from the validation data set than from the calibration data set probably result from a smaller number of wells and a lower percentage of atrazine/DEA detections in the validation data set; out of 228 wells, water from only 32 wells had atrazine/DEA detections at or greater than 0.1 µg/L. Relations with the validation data set would probably have larger r-squared values if additional ground-water quality data were available.\nLogistic regression also was used to develop models that predict the probability of elevated concentrations of nitrate in ground water in Colorado. Three concentration ranges were tested: 2, 5, and 10 mg/L. The models predicting the probability of nitrate detections at concentrations greater than 5 mg/L were the most significant models, probably because the numbers of detections and nondetections were evenly distributed at that concentration. Two models that best predicted the probability of nitrate concentrations greater than 5 mg/L in ground water were selected: one with and one without fertilizer use. Relations of the predicted probability of nitrate concentrations greater than 5 mg/L in ground water with the percentage of actual detections were good; r-squared values were 0.964 and 0.965. Models were validated using a second set of ground-water quality data (validation data). Relations of the predicted probability of nitrate concentrations greater than 5 mg/L in ground water with the percentage of actual detections in the validation data set were good; r-squared values were 0.910 and 0.966.\nModels that excluded hydrogeomorphic regions were constructed to allow a comparison with models that included these regions. In the atrazine/DEA and nitrate models that excluded hydrogeomorphic regions, the probability ratings tend to decrease in the South Platte River Basin and increase in the High Plains and the San Luis Valley because the land cover and soils variables are modeled equally across the entire State. Model validity and accuracy was significantly reduced in all models that excluded hydrogeomorphic regions, confirming that hydrogeomorphic regions are a significant variable. Models incorporating hydrogeomorphic regions may be useful for predicting probability in regions that have a relatively long history of atrazine use or nitrogen input from sources such as fertilizers and manure; models excluding hydrogeomorphic regions may be more useful for extending probability ratings into regions where atrazine has not been used or sources of nitrogen have not existed. For instance, the San Luis Valley has a low probability of atrazine/DEA detections in the model that incorporates hydrogeomorphic regions. Very little, if any, atrazine is used on crops from the San Luis Valley, and atrazine/DEA have not been detected in ground water in the San Luis Valley. The lack of atrazine/DEA detections in the San Luis Valley caused logistic regression to give the San Luis Valley low probability ratings. Atrazine/DEA probability ratings in the San Luis Valley are larger in the model that does not include hydrogeomorphic regions, indicating that portions of the valley may have a potential for atrazine/DEA detections in ground water if atrazine is used there in the future. The probability maps developed by the methods described in this report are designed to portray the potential for contamination of ground water in Colorado. These maps do not show areas that are actually (currently) contaminated, but rather, the areas that have a potential (or likelihood) for being contaminated if a contaminant were released to the environment. More specifically, each map shows the probability of detection (in terms of a percent) of a particular chemical compound (the contaminant) in ground water. Probability is not the same as certainty; a well in a high probability area is not necessarily contaminated because contamination can also depend on well depth and other local factors not taken into account by the models described in this report.\nThe maps produced by this project were developed using the best available data, and can probably be improved as additional data become available. Additional ground-water quality data in areas that are sparsely sampled would probably improve the calibration of the maps. Larger scale soils and chemical input data would probably improve the accuracy of the probability maps. Data differentiating between sprinkler and flood irrigation methods would probably improve the accuracy in agricultural areas. Chemical-use data in urban areas would improve the accuracy of the probability maps in urban areas."}]