[{"section_title": "", "text": "availability for researchers of huge data bases on avian phenotypes, genotypes, functional traits, natural histories, and population levels also improves the value of birds as a model taxon for studies of ecological questions and conservation challenges. Yet, identifying and counting birds, particularly many tropical species, can be deceptively difficult. The utility of birds in ecological studies can be greatly compromised if the frequency of false-negative and false-positive identification errors is high (Remsen 1994, Lees et al. 2014. From our experience as journal editors and reviewers, we have strong reason to believe that the level of error in many tropical avian surveys is a cause for concern. Tropical forests, for example, with their extremely high avian diversity are particularly difficult to sample adequately as observers need to be thoroughly familiar with a very large regional species pool containing many rare species (Terborgh et al. 1990, Robinson et al. 2000. The rate at which observers misidentify or fail to detect birds is influenced by level of expertise, as well as methodology and duration of surveys (Gaston 1996). Auditoryvisual surveys in tropical forests pose exceptional challenges in typically dark and structurally complex rain forest environments where upwards of 95 percent of birds are heard but never seen by an observer. Furthermore, most species utter many sounds aside from typical 'loud' songs, which means that field surveys necessitate familiarity with potentially thousands of different bird vocalizations (Remsen 1994). Mastering the suite of sounds requires months of daily fieldwork in a region (Parker 1991), although the ready availability of electronic sound files online can now accelerate the learning process for bird surveyors. Here, we comment on several methodological approaches that can improve estimates of abundance and community-level richness, some of which are simple to implement whereas others require deeper thought about the specific objectives of each study. Our overview is intended mostly for researchers who wish to incorporate birds into ecological or conservation studies but who may not yet have sufficient experience with the exceptional challenges of surveying tropical bird communities and estimating abundances. Experienced tropical field ornithologists will know that evaluating sources of error and bias in surveys of tropical bird abundances and inventories of richness are active areas of investigation (Gale et al. 2009, Anderson et al. 2015, Peele et al. 2015, Gomez et al. 2017. For assessments of species richness within tropical bird communities, no field surveys are ever 'complete' and thus display a trade-off between the time available for the surveys, the methods used during surveys, and expertise of the surveyors. It is therefore extremely important to understand how incomplete or inaccurate any given survey is, so that only comparably complete data sets are used in analyses, or appropriate statistical measures taken into account for differences in completeness. The degree to which surveys approach complete inventories is affected largely by non-detection of individual species, which can be ascribed to two different components of detection (Boulinier et al. 1998, Nichols et al. 2009. Availability is whether a species was vocalizing or visible from a point or a transect. Perceptibility is whether a species was detected and identified correctly by the observer (Marsh & Sinclair 1989, Johnson 2008). Availability will be affected by survey protocols such as timing (across diel and annual cycles, given the phenology of breeding patterns and migration) and length of survey periods in addition to ambient conditions such as weather and distance from the observer. Perceptibility is more a function of observer experience and will be influenced by distance to the bird, mediated by signal attenuation in denser habitats and the conspicuousness of the signal. Species missed by inexperienced observers tend to be a non-random subset of those in an assemblage, leading not only to spurious assessment of richness but distorted interpretations of macroecological patterns and the conservation value of treatments (Remsen 1994, Blackburn & Gaston 1998. Best practices for assessing completeness of community surveys include quantification of survey completeness using species accumulation curves. To improve efficiency of work, researchers should also consider use of a priori stopping rules, which are quantitative estimates of survey completeness determined from predicted shapes of species accumulation curves (Cam et al. 2002). Software for such analyses is freely available (Colwell 2013, Hsieh et al. 2016. Estimators generated from inadequate community inventories may lead one to conclude sufficient effort has been invested, even when important components of a community have been missed. Furthermore, estimators may predict richness greater than that actually detected, but provide no information on the ecological traits of 'missed' species. In addition to careful use of statistical estimators, we encourage collaboration with local experts whose expertise may expedite learning sounds of rarely detected species. Given that accumulation curves in most communities will rarely stop climbing because of detection of vagrants and species with very large home ranges and low densities, local experts can also provide advice on completeness of surveys for expected resident species. For example, some tropical bird species are both visually cryptic and vocalize infrequently. A recent tracking study of Variegated Antpitta (Grallaria varia) revealed occurrences of singing at just two of 68 locations within its home range (Jirinec et al. 2018). Detection of such species requires exhaustive sampling regimes to avoid problems of low availability. Yet, the effort required to detect and count such rare species is important as they are among the most sensitive to environmental change (Banks-Leite et al. 2014). On the other end of the abundance spectrum, we have noticed, as editors, the absence or relative scarcity of some core rain forest species which ought to be abundant in many Neotropical locations, including canopy Zimmerius tyrannulets and small understory woodcreepers such as Glyphorynchus spirurus which often are among the commonest species in many landscapes (high availability) but easily overlooked because of their unassuming vocalizations (low perceptibility). Adequately designed and executed surveys of tropical bird communities need to compensate for this great variability in availability and perceptibility by incorporating multiple sampling methods with appropriate design characteristics, using highly skilled observers, and archiving sound files to allow re-examination of soundscapes and add an element of repeatability to the study. We first discuss the use of mist nets as a technique for sampling tropical bird communities, then highlight some aspects of auditory-visual surveys bird counters should consider carefully. Mist nets have been used to sample tropical bird communities for many years but their use has been controversial (Terborgh et al. 1990, Remsen & Good 1996. Much of the controversy has focused on the question of whether or not capture rates of birds in mist nets can provide a useful index of abundance or activity. Given the many factors that influence capture rates (e.g., behavior, habitat structure), it is unlikely that mist nets will, at least in most instances, provide a true estimate of abundance. Thus, interpretations of results based on mist-net captures must be done with caution. This may be particularly true when comparing results from study sites that differ in habitat structure; ground level mist nets will certainly sample a greater proportion of species in habitats with short and dense vegetation when compared to tall forests. Similarly, care must be taken when comparing rates across species as differences in behavior may have a significant impact on the likelihood of capture. Although mist nets will not provide a complete sample of bird communities in lowland tropical forests, they can be a useful addition to other sampling methods such as point-counts or territory mapping. Mist nets do provide the advantage that captured birds may, in most cases, be identified by researchers who lack knowledge to identify birds by sound alone. Another advantage is the opportunity to color-mark individuals and facilitate efforts for spot-mapping territories, but such approaches require very large investments of effort. In some cases, mist nets may better sample some species which vocalize infrequently and that might be overlooked with other methods (e.g., Sclerurus leaftossers, some understory frugivores), thereby helping to provide a more complete species list for a given site. When mist nets are deployed in sites with similar habitats, a comparison of capture rates can provide an index with which to compare levels of activity between sites, but only for those species likely to be captured in nets. Overall, mist nets can be useful in studies of tropical bird communities but only if their limitations and benefits are recognized. One of the most important decisions to be made when designing auditory-visual surveys of tropical birds involves survey radius. The area surveyed influences estimates of abundance as well as probability of detection. Most birds in tropical habitats are heard and not seen. Although tempting to keep distances from observer small to reduce chances of missing birds, the shorter the distance the more likely it is that abundances will be severely under-estimated because many birds will be missed. Most birds simply move away in response to observer presence, while a very few species may be attracted to observers. For example, during line transect surveys, most birds are rarely detected along the transect because they move away as observers walk toward them. During stationary surveys, birds are also likely to detect an observer and move away or stop vocalizing. Most tropical field ornithologists recommend including birds detected at all distances from the observer and recording the distance (either measured with range-finder, range-finder binoculars or by estimating distance if one is very experienced with distance estimation). Use of unlimited distance radii allows one to reduce effects of observer proximity on bird behavior while also accumulating more data than one would gather with short radii. Most tropical field ornithologists do not necessarily use all of the data collected from unlimited distances to estimate abundances because ability to hear or see species diminishes with distance, but those data can be used in analyses of community richness. The distance at which detectability declines varies among species. We often truncate the data at some distance (typically 75 m-150 m, depending on the species being studied and structural complexity of the habitat). As editors, we have seen many studies where data were collected at radii of 10 or 20 m, presumably to avoid the issue of missing more distant birds. But our experience tells us that the biases appearing from bird response to observer presence are just too great to justify use of such short radii. We recommend researchers use unlimited distance surveys and note the distances in their data, then truncate data later to appropriate distances based on the species-specific distance histograms. Processes for determining appropriate truncation distances are explained in the program DISTANCE (Thomas et al. 2010). Note that DISTANCE requires sample sizes of detections larger than can be normally acquired for many rare tropical species. Analytical strategies that compensate for such limitations are becoming more common (Gomez et al. 2017). Quantifying distances from observer presents substantial challenges. Most birds are not seen but heard, so determining distance accurately requires extensive experience and an understanding of how sounds of different frequency ranges (high vs. low pitch) attenuate as a function of habitat structure and even humidity conditions or other ambient environmental noise. Such experience is typically only accumulated after months, sometimes years of survey work. We encourage inclusion of details in manuscripts (at least in supplementary online material) summarizing the experience level of data collectors (Robinson & Curtis in review). Observers could maintain and update regularly (daily or weekly) a list of species they know they can identify by sound, which could become part of project metadata. In addition, we recommend researchers supplement their work by archiving recordings of bird sounds for review. The recordings can be 'voucher' specimens for individual species and archived in sites such as xeno-canto.org or the Macaulay Library (through eBird.org). We also see value in archiving ambient recordings of the entire bird community soundscape within a time frame beginning 30 min before dawn and extending to 2 h after dawn, the time period when most diurnal species vocalize. Such recordings should be at least 15-30 min in duration. The Macaulay Library at the Cornell Lab of Ornithology is an option for archiving such recordings in a publicly available web space. Another commonly variable characteristic of avian surveys is duration of counts. In contrast to studies of temperate zone birds, where count durations of 3, 5, and 8 min are widely used, there is no standardized length of counts widely used across tropical bird communities. In part, this is because there are currently no continentwide surveys like the North American Breeding Bird Survey (using 3-min counts) in Latin America, and the realization that many tropical birds vocalize more infrequently so count duration often needs to be longer. Researchers must balance efficiency of surveyor effort and completeness of sampling as a function of count length. Longer counts increase chances that individual birds may move into range of detection after the count starts, so the actual area being surveyed becomes difficult to ascertain. Shorter counts can be too brief to allow opportunity to detect a reasonably high fraction of birds actually present. Commonly used count durations in tropical forests are 8, 10, and 15 min. These durations seem to represent a reasonable balance allowing detection of infrequently vocalizing species and minimizing excessively large rates of movements into detection range, but we know of no rigorous assessments of this balance nor how it varies across a diversity of habitats. An advantage of 8 or 10 min counts is that such counts can be divided easily into 2-min intervals. Experienced observers can then track detections of individual birds in each 2-min intervals, creating a 'capturerecapture' history and allowing a variety of additional methods for estimating detectability and abundance (Farnsworth et al. 2002, Alldredge et al. 2007a. It is essential that observers attempt to use modern methods to adjust for detectability issues when a goal is to estimate abundance. Use of unadjusted count data, even when data are sparse, can produce erroneous impressions of abundance differences across species. Yet, tropical bird species can be so rare that accumulating sufficient data to use modern methods is a challenge. Combining data across ecologically and vocally similar species to boost sample sizes could be attempted (Dorazio et al. 2013, Iknayan et al. 2014, Gomez et al. 2017. Restricting the set of questions asked may be necessary. Sometimes, careful design of study questions and sampling strategy can reduce the need for sophisticated and data-hungry sample methods (Banks-Leite et al. 2014). For example, comparing changes over time in richness and estimated abundances or numbers of detections per species at a given site might be achieved simply by ensuring use of identical methods and (ideally) observers (Blake & Loiselle 2015). More complicated goals such as comparing variability in abundances of species across guilds might be confounded by substantial differences in detectability that are difficult to quantify and control. We have encountered many troubling issues in manuscripts that include tropical bird data, only a few of which we have addressed here. The most important challenges to address include: staying current with modern literature on how best to adjust count data when a goal is to estimate abundance; objectively assessing completeness of community-level surveys by using accumulation curves and objective stopping rules; ensuring use of experienced observers who are very familiar with all sounds of species in the regional species pool; creating opportunity for repeatability of assessments by archiving sound files in publicly available sites for independent review of identifications; and archiving in supplementary materials lists of species encountered and numbers of detections of each species so that experts can assess the degree to which species inventories appear to be complete. Tropical bird communities are rich, important ecologically and are tempting to include in many types of studies. But tropical birds are deceptively difficult to detect and count accurately, so great care should be taken when designing and conducting studies. Detailed methodology and metadata should be included to allow careful evaluation of potential sampling biases."}]