[{"section_title": "Introduction", "text": "Health insurance coverage in the U.S. is often cited as an important domestic policy issue. Health insurance can affect health-care demand and spending by providing greater access to medical care and reducing out-of-pocket expenses. Health status of a population is influenced by access to medical care and a variety of other factors, such as education, nutrition, and lifestyle. In recognition of its importance to quality of life, since 2003 the U.S. Bureau of the Census (2007) has reported rates of insurance, or noncoverage, for the U.S. population in addition to the most basic indicators of well-being, income and poverty rates. 1 According to recent statistics, 16.3% of U.S. persons had no form of health insurance in 2010, a slight increase from the recent past. Most persons receive coverage through employer-sponsored programs. Additionally, income levels and health insurance coverage are related. More than 25% of low-income families ($25,000 or less in income) were without insurance coverage, compared to 8% of high-income families ($75,000 and above). Because of the significant role of employer-sponsored health insurance programs, concern is often expressed about the ability of the self-employed population to access affordable health insurance. U.S. farmers and ranchers are part of the self-employed population, and their occupation is consistently rated among the highest for fatalities and injuries. Furthermore, farmers and ranchers garner significant interest in policy discussions relative to their numbers. There are only about two million farms in the United States, and most of those farms have only one operator. Allowing for cases of multiple operators per farm, there are still only 3.1 million farm operators and 5.4 million persons in the households of family farms. 2 However, subsidies to the farm sector are significant, drawing special policy attention to the farm population. The ten-year annual average for [2001][2002][2003][2004][2005][2006][2007][2008][2009][2010] Mary Clare Ahearn and Hisham El-Osta are economists in the USDA Economic Research Service. Ashok K. Mishra is a professor at Louisiana State University AgCenter and Louisiana State University. The authors would like to acknowledge the helpful advice of two anonymous reviewers. The judgments and conclusions herein are those of the authors and do not necessarily reflect those of the U.S. Department of Agriculture or Louisiana State University. Review coordinated by Larry Makus. 1 The information on insurance coverage has been collected annually on the Current Population Survey since 1987. 2 A small number of farms (2.3% or 49,711 in 2010) are classified as nonfamily farms (USDA-ERS 2011b). Operator household information is not collected for these farms. was more than $15 billion from the federal government in direct payments alone (U.S. Department of Agriculture, Economic Research Service, 2012). In the usual sources of national data on income and health insurance, the occupations of the respondent and household members are generally recorded as the major occupation. However, it is very common for persons in farmer households to hold multiple jobs. In more than two-thirds of principal farm-operator households, either the operator or spouse has a nonfarm job or business, and the nonfarm job is often where the majority of their work time is spent. Because they hold multiple jobs, adequate information on this important population is not available from general population surveys. This paper provides information on health insurance coverage in the farm-operator household population based on the Agricultural Resource Management Survey (ARMS), which is representative of all farm households, including those with a major occupation other than farming. We also consider how coverage varies by the farm operator's age category because we know that almost all persons age sixty-five and over are covered by Medicare and the age distribution of farm operators is generally older than the U.S. population. In addition, the paper provides information on the source of health insurance for farmers, recognizing that they are self-employed, since employment-sponsored programs for wage and salary workers are nationally the most common sources of insurance. Finally, we consider the importance of access to health insurance relative to other factors in the pursuit of off-farm employment opportunities. Off-farm work increases access to health insurance through coverage provided directly by employers and because off-farm income provides households with an alternative source of income for purchasing insurance directly."}, {"section_title": "Health Insurance Coverage of Farm-Operator Households", "text": "Previous evidence of health insurance coverage among farmers shows that farmers tend to have lower rates of coverage, or higher rates of uninsurance, than the general U.S. population. For example, Zheng and Zimmer (2008) analyzed the 261 respondents in the Medical Expenditure Panel Survey for 1996-2001, aged 18-64, who reported that their main job was as a farm owner or manager. This population included those who own farmland but do not operate a farm and excluded those farm operators whose major occupation is something other than farming. 3 Zheng and Zimmer (2008) reported that 19% of this population did not have insurance. In an analysis of a 1983 USDA survey, Jensen and Saupe (1987) found that in 18.1% of farm households, not all family members had health insurance coverage. This was based on a sample of 529 farm families in eight counties in southwest Wisconsin. In an earlier study using a large sample of 24,052 persons from the 1976 Survey of Income and Education who reported living in a household that received any farm income (from operating a farm or renting out farmland), Jensen (1983) found that 14.3% did not have health insurance. In all of these studies, the authors concluded that the farm population they identified was more likely to be uninsured than the general U.S. population. In contrast to the studies above, McNamara and Ranney (2002) found that, at least for the farmers indicating that managing a farm was their major occupation, farmers are more likely to have health insurance than other populations. Their analysis compared insurance coverage for major occupation farmers, hired farm workers, and other workers using the Current Population Survey for 1995-1999. Consistent with the McNamara and Ranney (2002) results but in contrast to the other studies, a recent analysis of a representative sample of all farms on the Agricultural and Resource Management Survey (ARMS) and the households of their principal operators found that insurance coverage was slightly higher for this population than the general U.S. population. In 2010, 12.8% of persons in farm households were uninsured, compared to 16.3% of the general U.S. population (USDA-ERS 2011b). 4 It has been well documented for some time that farm-operator households have above-average income and wealth relative to all U.S. households and that both income and wealth increase as farm size increases. As has been the case for decades, most of the income of farm-operator households is from off-farm sources. In 2010, the average income of farm-operator households from all sources was estimated to be $82,450; the off-farm income component was estimated at $70,491, accounting for 85.0% (USDA-ERS 2011b). Most of this (about two-thirds) was from wages and salaries or from operating nonfarm businesses. The reliance on off-farm income is not surprising in light of the fact that most farm households operate very small farms and production is increasingly concentrated on large farms. 5 Although farm operators are largely self-employed, either the operator or the spouse is employed off the farm in a majority of farm-operator households. Given the extensive engagement of farm-operator households in the nonfarm economy, it is not surprising that the most common source of health insurance for members of farm households is employment-based. In fact, farmers are almost as likely as the general U.S. population to receive their health insurance through an outside employer. However, the source of health insurance varies significantly by the age of the operator and the off-farm employment status of the operator and spouse. Farm households in which neither the operator nor the spouse works at a nonfarm job are the least likely to have health insurance. The farm operators in these households are more likely to be elderly than operators in other farm households and, consequently, are more likely to receive their insurance through a government program-virtually all U.S. citizens age sixty-five or older have some coverage through Medicare. If we consider households where neither the operator nor the spouse works off the farm using two age categories-below sixty-five and sixty-five and older-we see that coverage is much different (table 1). For the elderly group, 96% of household members have coverage, compared to 67% of the younger group. The younger group allocates significantly more time to farming than the older group, which is obvious from their average farm income and farm-size distribution. Households in which neither the operator nor the spouse works off the farm are more likely to purchase insurance directly from private insurance sources. Some households where neither the operator nor the spouse works off the farm have employment-based health insurance coverage from previous nonfarm employers or receive coverage as employees of their own farm businesses or through a farm group, such as farm cooperatives. Households in the younger group in which neither operator nor spouse work off the farm have higher household expenses for health care-for both insurance premiums and out-of-pocket expenses-than other farm households. The largest group of farm households includes households in which either or both the operator or the spouse works off the farm and the operator is less than sixty-five years old. Not surprisingly, these households are most likely to receive coverage through employment-based policies and to operate small farms. Households that operate large farms (those with sales of $250,000 or more) are less likely to have an operator or spouse working off the farm than other farm households since they are fully employed on the farm. These households are more likely to purchase health insurance directly from an insurance provider than families operating smaller farms. "}, {"section_title": "Literature Review", "text": "The literature on off-farm labor is well established. The primary assumption is that an operator's labor is allocated between farm and off-farm activities such that the marginal value of working on the farm (or reservation wage) equals the wage rate of an off-farm activity. Households maximize their utility when considering how they allocate their labor between work and leisure. A key factor in determining the time allocation is the wage rate from working in the market place. This market wage rate is the opportunity cost or price of leisure. For our application, the standard labor-leisure model needs to be broadened slightly to recognize that the value of health insurance benefits are similar to the role played by wages. In a 2004 survey, operators and their spouses were asked about their most important reasons for working off the farm. Increasing household income was overwhelmingly the top reason, but health insurance was also listed as important, especially by spouses (Covey et al., 2005, pp. 27-28). The conceptual model combines the decisions of agricultural households relating to producer, consumer, and labor supply into a theoretically consistent model (Taylor and Adelman, 2003). The individual is assumed to allocate time to farm work, off-farm work, and leisure in such a way that the optimal allocation is achieved when the marginal values of time devoted to the activities are equal. The farm-operator household is assumed to have the optimization problem: ( subject to: where Y is consumption goods, L o is home time (leisure) for the farm operator o, L s is home time (leisure) for the farm operator's spouse s, T is the total time endowment, E is time allocated to offfarm work, F is time allocated to farm work, w is the off-farm wage rate, p f are farm output prices, Y f are farm output quantities, P y denotes the price of consumption good Y , w f are farm input prices, X f are farm input quantities, V signifies other household income (including employer-sponsored health insurance), C is human capital, and R describes location-specific characteristics. Equations (4) and (5) are budget (cash income) and production technology constraints, respectively. After substituting (5) into (4), the budget constraint can be written as: The utility function and the production function are assumed to be concave, continuous, and twice differentiable. The first-order conditions for the above model provide the optimality conditions for off-farm work participation. The health economics literature on health insurance issues is vast (for example, see the review by Currie and Madrian, 1999). Cutler and Madrian (1998) provide an example of related research for the general U.S. population on the relationship between labor participation and health insurance. The empirical literature on estimating off-farm labor covers a variety of issues, largely using farmhousehold microdata. Of greatest relevance to this paper is research by Jensen and Salant (1986) on the role played by fringe benefits from off-farm employment of farm operators, based on a USDA survey covering twenty-three counties in Mississippi and six counties in Tennessee. They found that fringe benefits induced more operator off-farm labor supply. Given their findings from more than twenty years ago and the extensive literature on off-farm labor supply since that time, it is surprising that more empirical applications have not considered fringe benefits. Jensen and Salant (1986) recognized that a weakness of their study was that they ignored the likely jointness in the labor allocations of the operator and spouse. In contrast to the role of fringe benefits, the issue of jointness has been actively pursued in the literature since that time, with most of the recent literature finding interdependence in operator-spouse decision-making. We also draw on this work in designing our model (Gould and Saupe, 1989;Tokle and Huffman, 1991;Ahearn, El-Osta, and Dewbre, 2006)."}, {"section_title": "Data and Model Estimation", "text": "This analysis uses data from the 2010 Agricultural Resource Management Survey (ARMS), Phase III, Costs and Returns Report (CRR) version (USDA-ERS 2011a). The CRR version includes 6,775 sample farm households and is designed to be representative of the U.S. farm-operator-household population when used with sample weights. ARMS is the USDA's primary vehicle for collecting and disseminating data on a wide range of issues about farm financial conditions and resource use and costs. Generally, ARMS is used to gather information about the relationships among agricultural production, resources, and the environment. It also provides data for estimating production costs and returns of agricultural commodities and the measurement of farm businesses' net-farm income. Another ARMS contribution is information on the characteristics and financial conditions of farm households, including information on management strategies and off-farm income. The data used in the off-farm labor participation analysis are a subset of the 2010 ARMS CRR data tailored to address our issue. In addition to eliminating some observations due to refusals on variables key to our study, we excluded households when the farm operator was sixty-five years or older because these persons are automatically eligible for health insurance coverage through the Medicare program. In order to provide clear results regarding the effects of insurance on the offfarm work decisions of operators and their spouses, we also eliminated the 18% of farm households without a spouse present. The final sample for the off-farm labor participation analysis was 3,025 farm households. This study also uses some auxiliary data. Local area characteristics are based on county-level data from Bureau of Economic Analysis income files, Bureau of Economic Analysis employment files, Bureau of Labor Statistics unemployment files, and the 2000 Census of Population, STF-3 file. We examine the determinants of off-farm labor participation among farm operators and farm spouses with special emphasis on the role of health insurance using a probit regression procedure. The unobserved latent dependent variable Y * i , characterizing the off-farm work status of the farm household, is represented by a binary outcome variable Y i , which takes a value of 1 if either the operator or the spouse of the i th (i = 1, . . . , n) household chooses to work off farm and takes a value of 0 when no such work occurs, as in the following model: where Y * 2i is an unobserved latent variable capturing the decision of the farm household to acquire health insurance, X 1 is a vector of exogenous explanatory variables, and u 1 is a random disturbance term. Because of unobserved characteristics among farm households that affect both the decision to purchase health insurance and to work off the farm (e.g., physical ability, health status, healthcare affordability, risk tolerance, etc.), these decisions are likely to be jointly determined; thus there is a need for the additional health-insurance-participation equation: Perry and Rosen (2001) used the conventional probit model to examine the effect of self-employment on the probability of health service utilization. Among the findings was an affirmation of the view that the self-employed are able to finance access to health care from sources other than insurance. A study by Olson (2002) used a two-stage instrumental variable approach to obtain unbiased estimates of the effect of health insurance on labor-market behavior. The study's findings suggest that wives with own-employer health insurance would accept a 20% wage discount in the presence of health benefits. Terza, Basu, and Rathouz (2008) provided a two-stage residual inclusion method as an alternative approach to the classic two-stage instrumental variable method to deal with endogeneity concerns in health economics and health services research. As shown by Mallar (1977) and Maddala (1983) and as was used by Zimmer (2001), estimating the simultaneous structural probit equations in equations (7) and (8) follows a two-stage process that starts by estimating the following reduced-form probit equations: where X X X i is a vector of all the exogenous variables in equations (7) and (8). As part of the secondstage estimation, predicted latent values from these reduced-form equations are then used to replace their corresponding endogenous variables as in: , where Φ Φ Φ is the cumulative standard normal distribution function. 6 Table 2 presents the means of explanatory variables as defined by vector X X X and based on the distinct binary strategies of off-farm labor participation and health insurance purchase decisions. Figure 1 shows the four U.S. Census regions and the ten farm-resource regions (for more detail, see USDA-ERS 2011a) that are entered in equations (11) and (12), respectively, in order to control for the geographic location of the farm. 7 The fact that the ARMS data have a complex survey design and are cross-sectional raises the possibility that the error terms in equations (11) and (12) are heteroskedastic. Accordingly, all standard errors were adjusted for heterosckdasticity using the Huber-White sandwich robustvariance estimator based on algorithms contained in Stata (see Huber, 1967;White, 1980). This 6 The marginal effect in the j th ( j = 1, 2) binary model in equations (11) and (12) is a measure of the instantaneous effect that a change in the k th explanatory variable has on the predicted probability Pr(Y j = 1) when the remaining explanatory variables are held constant. Such an effect is computed as the derivative of the conditional mean function with respect to x given by (Greene, 2008, p. 775), where φ (•) is the standard normal density of the cumulative standard normal function Φ(•). 7 The USDA's Economic Research Service developed these ten resource production regions to allow for economic analyses to be carried out based on areas with similar types of farms intersected with areas of similar physiographic, soil, and climatic traits. Notes: Asterisks (*) indicate that the respective means of estimates of continuous variables across the two groups in each model are statistically different (at 5 % level confidence interval based on 1,000 bootstrap resamples). Primary data source: 2010 Agricultural Resource Management Survey (Version 1, Phase III). a Excluded Farm Resource Region: \"Northern Great Plains.\" b Excluded Census Region: \"West.\" type of adjustment for standard errors was used in the regression models in lieu of the jackknife variance-estimation method. The jackknife is a method suitable for estimating standard errors when the dataset has a complex survey design (for further detail in the context of ARMS, see Kott, 1998;Dubman, 2000) and when the dataset is used in full rather than as a subset. We use a subset of the data (i.e., we include only married farm couples under sixty-five years of age)."}, {"section_title": "Figure 1. Delineation of Regions Used in the Regression Models Empirical Findings", "text": "A primary determinant to be examined is the impact of health insurance on the off-farm work decisions of farm operators and their spouses. We account for the potential endogeneity of this household-decision variable in the off-farm-labor participation model, which if left unattended may result in biased and inconsistent estimators, by using a two-stage simultaneous probit procedure as proposed by Mallar (1977) and Maddala (1983). 8 In the first stage, reduced-form regression models of health insurance and off-farm work were estimated using probit regression. The explanatory variables of these regression models included a vector of all the exogenous variables in equations (7) and (8). 9 Table 3 reports estimation results for the simultaneous probit models of health insurance and off-farm work, which were reached based on maximum likelihood and robust variance estimation methods. The estimated models demonstrated reasonable predictive capabilities as indicated by McFadden pseudo R 2 values of 0.22 and 0.10, respectively, for the health insurance coverage and off-farm-work status equations. 10 Results based on the estimation of the first equation in the simultaneous probit model show a significant association between the propensity of off-farm work by the operator or spouse and the likelihood of being covered by health insurance. A similar positive and significant association was found between health insurance coverage and increases in the level of human capital (as measured by years of education) of both the operator and the spouse. A farm location in the Midwest and an increase in the share of employment in transportation in the local area were also significant and positive in terms of their effect on the likelihood of health insurance coverage. Of special interest in this analysis is the finding the propensity for health insurance coverage, as proxied by the latent health insurance variable in the off-farm-work equation, had a significant and positive effect in the off-farm work decision by the operator and spouse. This result supports the notion that health insurance has the same effect as a wage increase in inducing household members to supply labor to off-farm work. Off-farm work provides workers with employer-sponsored health insurance as part of a compensation package or off-farm incomes increase the ability of households to purchase insurance directly from a provider. The effect of the age of the spouse on the likelihood of off-farm work is found to increase but at a diminishing rate as the spouse gets older. Other factors that are found to increase the likelihood of off-farm work are increases in the state average wage rate, and a farm location in any of the modeled ERS farm production regions except for the Northern Crescent or the Prairie Gateway regions. Table 3 provides the predicted marginal effects of factors affecting the probabilities of health insurance coverage and of off-farm work by farm operators and their spouses, evaluated at their mean levels. Focusing on the off-farm work and insurance coverage variables in the two respective probit models, we find farm operators and their spouses who report off-farm work are 3.2 percentage points more likely to report health insurance coverage; those same individuals who report health insurance coverage are 19.2 percentage points more likely to report off-farm work. Figure 2 compares the marginal effects of off-farm work on the likelihood of having health insurance (panel A) to the marginal effects of health insurance on the likelihood of off-farm work (panel B) (see Zimmer, Notes: Single, double, and triple asterisks (*, **, ***) indicate significance at the 10%, 5%, and 1% level. Significance of an estimated parameter is based on robust asymptotic standard error measurement of the corresponding coefficient. The computation of the marginal effect for a continuous variable is done based on footnote (6) with the remaining explanatory variables held fixed at their weighted mean levels. For a dummy variable, the marginal effect is computed as the difference in the probability of purchasing health insurance coverage or of working off the farm when the value of the binary variable is 1 and when it is 0 with all other explanatory variables in the respective models held at their weighted means (see Greene, 2008, p. 775). 2001, and equations (1) and (2)). 11 Considering only the positive range of the latent indices, the 11 The simulated probabilities of health insurance coverage and off-farm work along with their confidence intervals due to changes in the propensities to work off farm and to have health insurance coverage were computed with other explanatory variables being held at their means using the Spost package for Stata (see Xu and Long, 2005). marginal effect of health insurance on the likelihood of off-farm work (panel B) is shown to be stronger than the marginal effect of off-farm work on health insurance (panel A)."}, {"section_title": "Summary and Conclusions", "text": "It has been well documented for some time that farm-operator households have above average income and wealth relative to all U.S. households. However, because most Americans still receive their health insurance through employer-sponsored programs-and farmers are self-employed-it has not been clear whether persons in farm households would be as likely to have health insurance as all U.S. persons. Furthermore, coverage of the farm-operator-household population is likely to be inadequate in national surveys because farm-sample sizes are very small and individuals are generally classified in occupational categories based on their major occupation. Most farm operators have a primary job other than farming. Using new data collected by the Agricultural Resource Management Survey, it is now clear that persons in farm-operator households are just as likely to have health insurance coverage. The availability of these representative data is timely because of the continuing policy discussion regarding the implementation of the Patient Protection and Affordable Care Act, which was signed into law on March 23, 2010, and had its constitutionality upheld by the U.S. Supreme Court on June 28, 2012. The law has ten titles that are phased in over time. By January 1, 2014, insurers are prohibited from charging higher rates or discriminating against individuals based on pre-existing medical conditions or gender. The law includes various mandates, subsidies, and tax credits to provide incentives to individuals and employers to acquire and provide insurance coverage. Our analysis showed that a major reason for the relatively high rate of health insurance coverage in the past has been due to farm operators and their spouses holding multiple jobs. An important motivation for participating in the off-farm labor market has been the opportunity to receive health insurance benefits. Liao and Taylor (2010) tested the effect of health insurance reform in Taiwan on off-farm labor participation and found participation was reduced significantly (by upwards of 13.6%). The complexity of the new law coupled with the income and employment diversity of the U.S. farm household population means that the legislation will impact the off-farm labor supply decisions of farm households in a variety of ways. However, our results suggest that the new legislation is likely to lead to a smaller reduction in off-farm work among farmer and rancher households, and especially among the spouses of farmers and ranchers, in the U.S. compared to Liao and Taylor's findings for Taiwan. [Received April 2012; final revision received January 2013.]"}]