[{"section_title": "Abstract", "text": "This study investigated the phonological awareness of low-income Spanish-English bilingual children, because phonological awareness has been found to be an important prerequisite for literacy acquisition and because such children have been identified as at risk for successful literacy acquisition. Our sample included 123 Spanish-English bilingual preschool children (M = 49.1 months) attending Head Start programs. Children's receptive vocabulary was assessed using the Peabody Picture Vocabulary Test3rd Edition and the Test de Vocabulario en Imagines Peabody. We assessed phonological awareness using English and Spanish versions of the Early Phonological Awareness Profile, which includes deletion detection and rhyming tasks. Emergent literacy was assessed in the child's stronger language using the Emergent Literacy Profile, which includes tests of environmental print knowledge, printed word awareness, alphabet knowledge, and early writing. Spring levels of phonological awareness in each language were most strongly related to development of phonological awareness in the other language. Final models accounted for 68% of the variance in spring English and Spanish phonological awareness. Educational implications are discussed."}, {"section_title": "", "text": "reviewed numerous studies that together make the point that the potential role of book reading as a stimulus for early literacy varies among culturally different groups. Parents from different cultures sustain their children's curiosity in different ways. Parents who were read to themselves provide the kind of interactive book reading talk that is both pleasurable and beneficial to children (Whitehurst et al., 1988) . Unfortunately, parents who were not read to as children and were from cultures that valued discipline of children above all had less helpful and supportive book-reading sessions with their children. Often such conversations resulted in much effort to restrain the child or low-demand conversations that emphasized naming illustrations. Bus (2001) cautions that there was much variation among parents within any group, however, and has undertaken accounts to explain this variation. Among low-income Spanish-speaking families in America in particular, there is considerable disparity in family literacy practices, which is related to early Spanish literacy and oral English proficiency, both of which in turn significantly predict English reading achievement in Grade 7 (Reese, Garnier, Gallimore, & Goldenberg, 2000) . Taken together, all these studies point to the need to better understand the path of literacy development during the preschool years among children from Spanish-speaking homes.\nCertainly, being reared in a bilingual environment need not result in poor scholastic achievement. In a study of 5,567 students in 8th, 10th, and 12th grade, 56% of whom were from Spanish-speaking homes (from the National Education Longitudinal Study database), researchers (Yeung, Marsh, & Suliman, 2000) found that home language proficiency did not affect subsequent English test scores, school grades, or English proficiency in 12th grade. Home language proficiency did have a strong positive effect on maintenance of home language use and positive effects on standardized tests in English, math, and history. The few negative impacts of frequency of home language use on perceived English proficiency were found only in the early years of high school and did not persist. Certainly, many oral and written literacy skills in older children transfer from the L1 to second languages (L2s; e.g., see Cummins, 1991, for review) ; in particular, children may acquire orthography in their L2 for which they already have phonological representations in their L1 (Geva & Wade-Woolley, 1998) . Few prior studies have focused on studying the relationship between bilingualism and phonological awareness, and the few that have found either evanescent advantages or advantages on specific tasks by specific kinds of bilingual children compared to monolingual peers (Bialystok, Majumder, & Martin, 2003) . Cisero and Royer (1995) found that in kindergarten and first grade, students' ability to isolate initial sounds in their L1 was a significant predictor of their ability to isolate initial sounds in an L2.\nThe goal of the current research is to describe the pattern of development of phonological awareness of 3-and 4-year-old children from Spanish-speaking homes. We tracked their growth in phonological awareness in both English and Spanish and identified linguistic and print-related factors that contribute to the emergence of phonological awareness. We were interested in the extent to which phonological awareness development in one language is transferred to an L2 and in the contributions of oral language facility and early literacy knowledge to emerging phonological awareness in both languages. "}, {"section_title": "OVERVIEW OF PHONOLOGICAL AWARENESS: IMPORTANCE, ORIGINS, AND STABILITY", "text": "Much past research has established that phonological awareness is a critical precursor, correlate, and predictor of reading achievement Cronin & Carver, 1998; MacLean, Bryant, & Bradley, 1987; Speece, Roth, Cooper, & de la Paz, 1999; Stanovich, 1992; Vellutino & Scanlon, 2001; Wagner & Torgesen, 1987; Wagner, Torgesen, Laughon, Simmons, & Rashotte, 1993; Wagner et al., 1997) . Experimental evidence of the importance of phonological awareness interventions comes from phonological awareness training studies of 5-to 6-yearold children that boosted later reading achievement (Ball & Blachman, 1991; Bradley, 1988; Bradley & Bryant, 1983; McGuinness, McGuinness, & Donohue, 1995) . Training preschool children in phonological skills before beginning reading instruction has also proven effective (Lundberg, Frost, & Petersen, 1988) . The importance of even small changes in the early years is heightened by the fact that early differences in phonological recoding skills translate into progressively larger differences in reading skills at later ages Juel, Griffith, & Gough, 1986; Lundberg, Frost, & Petersen, 1988; .\nDespite the importance of phonological awareness to literacy development, we do not have a good understanding of all the factors that support its emergence. Some have argued that general linguistic abilities, rather than phonological awareness per se, are the critical basis of reading acquisition (Bowey & Patel, 1988; Chaney, 1992 Chaney, , 1994 Chaney, , 1998 Metsala, 1999; Whitehurst & Lonigan, 2001 ). For example, Metsala (1999) advances what has been termed the \"lexical restructuring process\" in which rapid expansion of vocabulary arguably forces the representation of increasingly small segments in words; children at the very outset of language acquisition need to discriminate relatively few unique words so that quite holistic representations of phonological forms will initially suffice. In other words, the kind of segmental representations involved in phonological awareness emerge after some threshold of vocabulary development has been achieved, although such representations are also held to be word specific. Words that are encountered many times or acquired early are more likely to become restructured than their rarer or later counterparts.\nOthers claim that phonological awareness or sensitivity is a cognitive process that is relatively distinct from general language or cognitive skill (e.g., Siegel, 1998) ; the fundamental phonological deficit in dyslexia is so severe that it is found in individuals with reading problems at all IQ levels. Furthermore, this phonological deficit is an arrest, not merely a delay, because it persists even when comparisons are made with reading-level matched individuals whereas linguistic and cognitive differences do not. Vellutino and Scanlon (2001) argue that the relationship between general cognitive abilities and phonological awareness varies and is complicated to measure. Specifically, reading achievement and cognitive profiles of children who are easily remediated by one on one tutoring are more like those of normal readers and probably reflect limitations of the former in early reading experience and/or limitations in early reading instruction. However, the profiles (Woodcock Reading Mastery Test-Revised [WRMT-R] ; Woodcock, 1987) of children who are found 327 Dickinson et al.: Bilingual phonemic awareness to be difficult to remediate were more likely to be associated with basic cognitive deficits. It is important to note, however, that IQ scores (Wechsler Intelligence Scale for Children-Revised [WISC-R]; Wechsler, 1974) of these groups did not differ from each other, from normal readers, or from the IQ norm, so cognitive deficits relevant to reading are not best indexed by traditional IQ measures. Regardless of the relationship between phonological awareness and the other various faculties required in order to read, there is abundant evidence from longitudinal-correlational and training studies that phonological processes are remarkably stable across the elementary school period (Torgesen & Burgess, 1998; Whitehurst & Lonigan, 2001) ."}, {"section_title": "BIDIRECTIONAL RELATIONSHIP OF PHONOLOGICAL AWARENESS AND LITERACY", "text": "Literacy instruction and children's growing grasp of the alphabetic principle play a major role in spurring individuals to begin attending to the sounds of words. Phonological awareness is partly an outgrowth of literacy experiences (Wagner, Torgesen, & Rashotte, 1994) . Even in adults, phonological awareness does not emerge spontaneously but rather as a result of learning to read an alphabetic script (Kolinsky, Cary, & Morais, 1987; Read, Zhang, Nie, & Ding, 1986) . Studies of children's emerging phonological awareness indicate the impact of letter knowledge and early reading on children's phonological sensitivity (Ehri, 1998) . Reading books to children also has been related to children's phonological awareness (Dickinson, Bryant, Peisner-Feinberg, Lambert, & Wolf, 1999) ; regression analyses of a sample of over 800 Head Start children predicting phonological awareness found that parents' reported provision of specific literacy experiences (i.e., regular reading, availability of children's magazines, and use of the library) predicted phonological awareness over and above home background factors such as family size, socioeconomic status, and mother's education.\nPhonological awareness is now established as important to children's ability to successfully focus on graphemes and link them to phonemes (Adams, 1990; Bryant, Bradley, MacLean, & Crossland, 1989; Byrne & Fielding-Barnsley, 1991; MacLean et al., 1987; Siegel, 1998; Tunmer, Herriman, & Nesdale, 1988) . There is also considerable evidence that many children need instruction to lead them to the analytic approach to print and language such mappings require (Ehri & Robbins, 1992; Masonheimer, Drum, & Ehri, 1984) .\nEncouraging children to write is one effective means of instruction in phonological awareness. When children are encouraged to write freely they analyze their own speech without any direct phonological training (Vernon & Ferreiro, 1999) . In another study (Dickinson & DiGisi, 1998) , the amount of writing children did in class was correlated significantly with first grade reading achievement. Students with higher reading achievement scores were in classrooms where teachers asked students to engage in narrative and informational writing.\nIn any event, children must get off to a strong start with decoding, because longitudinal studies show considerable consistency from first grade to the later elementary grades in children's decoding skill (Dickinson, Tabors, & Roach, 1996;  Applied Psycholinguistics 25:3 328 Dickinson et al.: Bilingual phonemic awareness Juel, 1988; Stanovich, 1986) , a finding that echoes the pattern seen for phonological awareness (Torgesen & Burgess, 1998) ."}, {"section_title": "PHONOLOGICAL AWARENESS AND LINGUISTIC DIVERSITY", "text": "Children's language background can influence the extent, nature, and development of their linguistic awareness, particularly their phonological awareness. Dialect can influence linguistic awareness in that children cannot be expected to reflect on structures they have not acquired (Chaney, 1994) . Researchers will want to guard against the use of biased assessments of phonological awareness; when biased items are removed, there is no correlation between dialect and awareness (Chaney, 1994) . Family literacy experiences also affect phonological awareness (Chaney, 1994) ; amount of family literacy experience is related to children's knowledge of alphabet concepts, a school-like literacy task. While children from all types of families receive some exposure to print, middle-class families routinely provide more exposure to a wide variety of literacy experiences than do poorer, less well educated families (Chaney, 1994) . Thus, socioeconomic status affects phonological awareness, with children of wealthier and better educated families scoring higher than children of working-class families Dickinson & Snow, 1987; Wallach, Wallach, Dozier, & Kaplan, 1977; Warren-Leubecker & Carter, 1988) . Chaney (1994) , however, found that once language development was equalized, socioeconomic factors played an insignificant predictive role.\nBilingualism facilitates certain types of metalinguistic awareness (Bialystok, 1988; Galambos & Hakuta, 1988; Ianco-Worrall, 1972 ; see brief review in Malakoff & Hakuta, 1991) , though these effects are often found mostly for middleclass and/or nonminority language bilingual children. Moreover, the languages in which a child is bilingual will determine the extent of the impact of their bilingualism in this regard; specifically, tonal phonological awareness is relatively independent of alphabetic phonological awareness, so that knowing Chinese in addition to English is less helpful, for example, than knowing a more closely related language (Liow & Poon, 1998) . However, the phonological awareness of monolingual children benefits from being part of a multilingual classroom (Dickinson, 2000) . Compared to monoglot instruction, bilingual schooling has also been shown to increase phonological awareness in bilingual students (Campbell & Sais, 1995) ."}, {"section_title": "PRIOR RESEARCH ON SPANISH-ENGLISH PHONOLOGICAL AWARENESS", "text": "Some studies have looked at the phonological awareness of Spanish-English bilingual children in particular (see Denton, Hasbrouck, Weaver, & Riccio, 2000, for review) . Several investigators have found Spanish phonological awareness to be a strong predictor of reading (Bravo-Valdivieso, 1995; Carrillo, 1994; Durgunoglu, Nagy, & Hancin-Bhatt, 1993) . Spanish-English bilingual children in kindergarten through Grade 2 were superior to monolingual children in the phonological translation of proper names, which moderately correlated with their reading ability (Oller, Cobo-Lewis, & Eilers, 1998) . Among first graders enrolled in a transitional bilingual education program, phonological awareness in Spanish significantly Applied Psycholinguistics 25:3 329 Dickinson et al.: Bilingual phonemic awareness correlated with phonological awareness in English, English spelling, and Spanish word recognition (Durgunoglu, 1998) . Phonological awareness, independent of both native and L2 vocabulary, contributed to achievement in English reading comprehension among Spanish-speaking first, second, and third graders who were becoming bilingual (Carlisle, Beeman, Davis, & Spharim, 1999) .\nDespite such demonstrated relationships, Spanish phonological awareness may differ from the English variety. Specifically, Vernon and Ferreiro (1999) argue that the sensitivity shown by English-speaking subjects to onset and rime (the stuff of nursery rhymes) may not be as prevalent among speakers of other languages. Unlike English-speaking children, Spanish-speaking children normally initially attune to vowels before consonants (Denton et al., 2000) ."}, {"section_title": "PRESENT PROJECT", "text": "In reviewing studies of Spanish phonological awareness, Denton and colleagues (2000, pp. 349-350) note that \"none of the Spanish tests of phonological or phonemic awareness have been subjected to psychometric study of validity and reliability,\" and that \"there is a need to identify those combinations of tasks that are reliable predictors of reading progress in Spanish-speaking children.\" In this study, we attempted to address both of these concerns in the context of conducting a larger correlational study of language and literacy abilities of low-income children. We were interested in the extent to which phonological awareness development in one language is transferred to an L2 and in the contributions of oral language facility and early literacy knowledge to emerging phonological awareness in both languages. We hypothesized that growth in phonological awareness in Spanish would predict growth in phonological awareness in English and vice versa and both of these variables would relate to a lesser extent to vocabulary acquisition within a specific language.\nThe data we report come from a larger study that examined multiple dimensions of the language and literacy development of Head Start children from English-and Spanish-speaking homes and the home and classroom environments that support development. Spanish speakers were an important subset of our full sample and are the group that we examine in the current paper. Because of the breadth of our study and the fact that we assessed some children in two languages, it was possible to examine only selected dimensions of children's emerging phonological awareness."}, {"section_title": "METHOD", "text": ""}, {"section_title": "Sample", "text": "The sample consisted of 123 children enrolled in Head Start programs in the northeastern and southeastern United States. The average age of participants was 49.1 months (SD = 5.5, range = 33.7−60.3 months). In data not tabled here, an estimated 54% of the sample was male. On a 4-point scale (1 = no high school diploma to 4 = college degree), the average level of maternal education was 2.2 (SD = 1.1). An estimated 66% of the sample was identified as Spanish dominant, and 33% as English dominant. Dominance was assessed using Applied Psycholinguistics 25:3 330 Dickinson et al.: Bilingual phonemic awareness three independent approaches: teachers were asked to indicate the child's primary language; parents were asked what language the child should be tested in; and the native bilingual speaker who assessed the child made a determination based on informal conversation, an assessment that was then confirmed by administration of a test of receptive language in that language. Typically, these three approaches provided congruent information; when there was a lack of agreement the bilingual assessor's rating was used."}, {"section_title": "Measures", "text": "Each child was assessed over the course of 2 days. Each session lasted approximately 30 min. Assessment was done in the fall (i.e., between mid-October and late November) and in the spring (i.e., early April through late May). Children assessed earlier in the fall were also assessed earlier in the spring. The following measures were obtained:\nPhonological awareness in English and Spanish. Phonological awareness in English and Spanish were measured by the Early Phonological Awareness Profile (EPAP 1 ; Dickinson & Chaney, 1997a) , using adaptations of tasks previously employed by Chaney (1994) . The EPAP consists of two tasks. The Deletion Detection Task is the easier task of the two and was selected because it was the easiest task we could devise that tapped children's ability to attend to the sounds of words apart from their meanings and we wished to avoid floor effects. For this task the assessor \"directs\" a puppet to say certain words and the child judges if the puppet says the words \"right\" or \"wrong.\" Words that are \"wrong\" are those in which an initial or final phoneme is deleted. If a child states that a word is \"wrong\" then he or she is asked to produce the word correctly. (See Appendix A; note that the last syllables of ladder and shadow each constitute one phoneme.) Prior to receiving the test words the children are given instructions and provided with two practice items, and they are also provided feedback and coaching. Note that this is not the type of task that has been called a \"phoneme deletion\" task by researchers examining more advanced children, tasks in which children themselves produce words after subtracting a phoneme. It is best conceived of as an assessment of the child's sensitivity to the absence of initial and final phonemes and the ability to correct those errors.\nThe second task is rhyme recognition. For this task children are asked to identify words that \"have the same sound\" or \"rhyme.\" They are shown pictures of three objects, two of which rhyme, and told the names of each object. They are asked to repeat the words to ensure that they have correctly labeled each picture and asked to point to or name the two words that \"have the same sound\" or \"rhyme.\" Children also receive two practice trials for this task. Those children who correctly identify at least five out of eight pairs of rhyming words then continue with the rhyme production task. For this task the child is given a word and asked to produce a word that rhymes with it. Responses are correct if they rhyme, regardless of whether the answer is a real word.\nThe EPAP has been employed by researchers in the New England area and in the southeastern region of the United States. The Cronbach's alpha for the total score 331 Dickinson et al.: Bilingual phonemic awareness on all subtasks in this large sample of English speaking children (n = 984) was .93. For the bilingual sample used in the current project, the Cronbach's alpha was .94 for the Spanish version of the EPAP and .93 for the English version. Spring scores on the EPAP in English and Spanish are used as the outcome variable in these analyses. Fall scores are used as controls. Change scores (in the other language) are used as predictors. Analyses looking for floor and ceiling effects found some evidence of ceiling effects for the deletion task and floor effects for the rhyming tasks; but when scores for all tasks were combined into one composite score, floor and ceiling effects were not evident.\nThe Spanish version of the EPAP was created by a language expert who is a native speaker of Mexican Spanish under the direction of Carolyn Chaney. This version was not a direct translation, but it retained the same conceptual structure. We make no a priori claims that the two tools are of equivalent difficulty and use change scores in our analyses, reflecting our interest in developmental factors. Both versions assess children's ability to detect the deletion of phonemes and recognize and produce rhymes.\nEmergent literacy. Children's emergent literacy was assessed by the Emergent Literacy Profile (ELP; Dickinson & Chaney, 1997b) . The ELP consists of four component tasks: the ability to read environmental print, sensitivity to what is and is not printed language, letter identification and naming, and ability to write one's name (see Appendix A for details).\nFirst, children's ability to read environmental print is assessed by showing cards that display familiar objects containing text (e.g., McDonald's logo, stop sign) and asking \"What does this say?\" Second, children's sense of printed language is assessed by asking them to distinguish between words and strings of letters or characters that do not make a word. For example, children are presented with a card that contains the text NNNT, W3#NJ, and MILK and are asked \"Which one of these is a word?\" Third, for the letter identification task, children are asked to name letters that are displayed on cards or to identify letters by the sounds that they make. If a child is unable to name the letter or its sound, then the assessor will provide the names of the letters and ask the child to identify the letter by pointing. Fourth, for the early writing task, the assessor presents the child with a blank piece of paper and a magic marker and asks the child to write his or her name. This process is scored based on directionality (did the child move from left to right?), intentionality (did the child intend to write his or her name or something else?) and conventionality (how many conventional letters did the child form?).\nWe created Spanish and English versions of this task, but because of the printbased nature of the assessment, the two versions were extremely similar. The first year of pilot work indicated that children's performance when assessed in English was very closely related to their performance when administered in Spanish; therefore, we did not continue assessing children in both languages. Instead, we assessed the children in their stronger language using the means described below. We had Spanish-speaking assessors administer this task, and they accepted as correct the responses that were given in either language. Thus, if a child was being assessed in English and labeled a letter using the Spanish letter name, the response Applied Psycholinguistics 25:3 332 Dickinson et al.: Bilingual phonemic awareness was scored correct. The Cronbach's alpha for the full task for a large sample of English-speaking children (n = 578) is .86 and in the current study is .82. This task did not have floor or ceiling effects.\nReceptive vocabulary. Fall and spring receptive vocabulary in English was assessed with the Peabody Picture Vocabulary Test-3rd Edition (PPVT-III; Dunn, Dunn, & Dunn, 1997) and is reported in terms of standard scores. The Test de Vocabulario en Imagines Peabody (TVIP) was used to measure fall and spring receptive vocabulary in Spanish; standard scores were also used. This test is administered in Spanish and has been normed on Spanish populations.\nDemographic factors. Child age was determined by the chronological age (months) of the child upon administration of the first assessment tool. Dichotomous variables were created for gender (1 = male, 0 = female) and language dominance (1 = Spanish, 0 = English). Mother's level of education was expressed as a continuous variable where 1 = no high school diploma, 2 = high school diploma, 3 = some postsecondary education/training, and 4 = college degree.\nAssessment protocol. Once a child was assessed by the researcher to corroborate teacher and parent reports of his or her dominant language, testing on the first day proceeded in that dominant language and followed the following schedule. Children who were bilingual, Spanish dominant were given the TVIP and EPAP in Spanish and ELP in Spanish on Day 1 and the PPVT-III and EPAP in English on Day 2. Similarly, the PPVT-III and EPAP in English and the ELP in English were administered to children who were bilingual, English dominant on Day 1 and the TVIP and EPAP in Spanish on Day 2."}, {"section_title": "Analytic approach", "text": "Our analyses were designed to examine the relationships between phonological awareness in English and Spanish and identified linguistic and print-related factors. First, we explored the relationship between phonological awareness in Spanish (spring score) as a function of spring scores in phonological awareness in English, Spanish and English receptive vocabulary, and emergent literacy skills. Second, we examined the relationship between a child's phonological awareness in English (spring score) as a function of spring scores in phonological awareness in Spanish, English and Spanish receptive vocabulary, and emergent literacy skills. To examine our research questions, we fit a series of multiple regression models predicting phonological awareness on the basis of the aforementioned predictors, controlling for age and the child's entry level of phonological awareness in the fall. Gender, language dominance, and mother's level of education were considered as potential covariates, but the bivariate analysis revealed that they were not correlated with spring phonological awareness in either English or Spanish. Thus, they were not fit in the regression models. The final model for both English and Spanish outcomes, however, was fit with language dominance as an interaction term, in order to examine the appropriateness of a main-effects model. Missing data were imputed using regression analyses. "}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Descriptive statistics", "text": "Across the full sample, spring phonological awareness in Spanish averaged 12.7 points (SD = 6.6, range = 0-27 out of a possible 27 points). The estimated mean spring phonological awareness in English was 12.3 points (SD = 6.8, range = 0-26). The estimated mean of fall phonological awareness in Spanish was 8.2 (SD = 6.9, range = 0-24) and in English was 8.4 (SD = 7.1, range = 0-24). As mentioned above, the average age of the children was 4 years, 1.1 months. Average spring receptive vocabulary (standard scores) was estimated to be 86.1 (SD = 14.4, range = 55-114) in Spanish and 77.4 (SD = 13.1, range = 40-105) in English. Children's spring scores on print-related concepts averaged 19.5 (SD = 8.1, range = 4-42 out of a possible 44 points). Table 1 displays bivariate correlations among the outcomes, spring phonological awareness in Spanish and English, and predictors. First, note that children who begin the school year with a high level of phonological awareness in one language also tend to have a high level in the other language, whereas those who score poorly in the fall in one language also tend to score poorly in the other (r = .60, p ≤ .001)."}, {"section_title": "Bivariate correlations", "text": "It is not surprising that both spring outcomes are correlated with their fall controls (r = .42, p < .001 for Spanish and r = .35, p < .001 for English). Further inspection of the correlational analysis reveals that spring phonological awareness in Spanish is highly correlated with spring phonological awareness scores in English (r = .78, p < .001), as well as spring scores in Spanish and English receptive vocabulary (r = .40, p < .001 and r = .32, p < .001, respectively) and emergent In data not shown here, age is not significantly correlated with English phonological awareness (r = .14, p = .13) but is correlated with Spanish phonological awareness (r = .25, p < .01). Therefore, age will be used as a control in all regression analyses. Background factors such as gender, language dominance, and mother's level of education are not correlated with the outcomes. Therefore, these background factor variables will not be used in subsequent analyses, although because of the potential theoretical importance of language dominance in these analyses, the interaction effects of language dominance will be examined in the final model."}, {"section_title": "Multiple regression analysis", "text": "Phonological awareness in Spanish. To examine the relationship between spring phonological awareness in Spanish and linguistic and print-related predictors, a taxonomy of regression models was built (see Table 2 ). In approaching the modelbuilding process, two control variables, age and fall phonological awareness in Spanish, were entered into the model. This control model predicts approximately 18% of the variation in spring phonological awareness in Spanish. After establishing the control model, linguistic and print-related variables significantly correlated with the outcome were added. Because spring phonological awareness in English was strongly correlated with the outcome (r = .78), it was added in Model 2. With this addition, the predictive power of Model 2 increased to nearly 64%. On average, children demonstrating strong competency in phonological awareness in English also had higher scores in spring phonological awareness in Spanish. In Model 3, the two measures of receptive vocabulary were added to the model (r = .40 for Spanish, r = .32 for English). The addition of these variables increased the amount of variance explained in spring phonological awareness in Spanish to 67%. However, English receptive vocabulary was not significant and was consequently dropped from the model-building process. Model 4 incorporates the spring emergent literacy variable (ELP), which is not statistically significant in this model.\nIn order to determine the impact of students' language dominance on the model, the dummy variable for language dominance was added to investigate two-way interactions between language dominance and the two significant predictors: English phonological awareness (Model 5) and receptive vocabulary in Spanish (Model 6). Although the interaction between language dominance and phonological awareness in English was not significant, the interaction between language dominance and Spanish receptive vocabulary was statistically significant. Model 5 presents the results to the model with the addition of the interaction between language dominance and English receptive vocabulary. The amount of variation explained in Model 6, the final model, is now 68.10%. The effect of receptive vocabulary in Spanish varies according to language dominance, with the impact being greater for Spanish-dominant students. Phonological awareness in English. In approaching the model-building process (Table 3) , student age and fall phonological awareness in English were used as controls. Together, these control predictors explain 12% of the variation in phonological awareness in English. Spring phonological awareness in Spanish was added to the control model (Model 2), as it was the variable most highly correlated with spring phonological awareness in English (r = .78). In Model 2, phonological awareness in English was fit and the predictive power increased to 63%. On average, children demonstrating higher spring scores in phonological awareness in Spanish also had higher spring phonological awareness in English. In Model 3, receptive vocabulary in English and Spanish (r = .48 in English, r = .35 in Spanish) were added to the model and the R 2 increased to 68%. Receptive vocabulary in English was a significant predictor, but its Spanish counterpart was not. Therefore, this latter variable was dropped from the model-building process.\nIn Model 4, emergent literacy was added to the model but it was not statistically significant. To explore the impact of student's language dominance on the model, the dummy variable for language dominance was added to Models 5 and 6 and two-way interactions with Spanish phonological awareness and language dominance (Model 5) and English receptive vocabulary and dominance (Model 6) were examined. Moreover, the interaction terms were found not to produce statistical significance. The main effects model, Model 4, was determined to be the final model, accounting for 69% of the variance in spring EPAP English scores."}, {"section_title": "DISCUSSION", "text": "In this article we examine various factors that contribute to 4-year-olds' phonological awareness in two languages. We are particularly interested in the transfer of phonological awareness from one language to another, both from Spanish to English and vice versa. In addition, we are interested in the extent to which a child's achievement in receptive vocabulary in both languages and emergent literacy play a role in the development of phonological awareness.\nThe most potent predictor of spring phonological awareness in both languages is phonological awareness in the other language. In each case, highly significant amounts of additional variance in phonological awareness scores in one language were accounted for by the performance in the child's L2, after controlling for age and fall phonological awareness in the same language. Thus, we found strong transfer of phonological awareness from Spanish to English and vice versa. In this most important result, our work corroborates and extends the work of Durgunoglu (1998) , Cisero and Royer (1995) , and Carlisle and colleagues (1999) , who found similar transfer with children older than those in the present sample. These results strongly indicate that stimulation of phonological awareness of bilingual children in either of their languages is likely to transfer to the other language. In order to interpret our results, it is helpful to describe in broad terms the preschool experiences of these children, given that the quality of teacher-child conversations in classrooms is related to language growth (Dickinson, 2001a; NICHD, 2000 NICHD, , 2002 Peisner-Feinberg et al., 2001 ). "}, {"section_title": "Classroom context", "text": "Our data were collected in Head Start classrooms before the drive to improve literacy support that began at the turn of this century. Previous studies of Head Start demonstrated that support for language is an area of special weakness in these classrooms. Layzer, Goodson, and Moss (1993) found that lead teachers engaged in one-one or small-group interactions with children 26% of the time, slightly less than the 28% of the time when they were coded as interacting with no children at all. In 20% of the classrooms half or more of the children had no individual interactions with an adult all day long. Similarly, in a longitudinal study carried out in the same region of the United States, Dickinson found that, on average, during free play 3-year-old children spent 21% of their time interacting with a teacher and 4-year-olds spent only 17% of their time interacting with a teacher (Dickinson, 2001b) . In parallel studies carried out in many of the same classrooms from which our sample was drawn, we found similar weakness in the focus on language and literacy. For example, using a tool that uses anchored ratings, we found that the quality of support for language and literacy was significantly weaker than ratings for creation of a positive climate that is well organized and supplied (Dickinson & Sprague, 2001) . Intentional support for phonological awareness was rare, focused instruction on letter names or sound-symbol relationships was not seen in groups and rare in one-one interactions, and book reading was seldom seen in small groups and often was not found at all in large group settings Dickinson, McCabe, Anastasopoulos, Peisner-Feinberg, & Poe, 2003) . Finally, teachers almost never talked explicitly about the meanings of words (Dickinson, McCabe, & Clark-Chiarelli, in press ). This absence of talk about language came despite the large numbers of English language learning children in these classrooms.\nThus, the children in our study were in classrooms where English was the medium of instruction and the primary language for social interaction among children. Although the classrooms had displays of print and provided opportunities to write, explicit attention to language and literacy was not common."}, {"section_title": "Factors contributing to phonological awareness", "text": "Children's level of phonological awareness in a given language is relatively reliable. Fall scores on phonological awareness in both languages correlate with spring scores (r = .42 in Spanish, r = .35 in English). These findings are congruent with evidence from longitudinal-correlational and training studies that phonological processes are stable across the elementary school years (e.g., Torgesen & Burgess, 1998; Whitehurst & Lonigan, 2001 ). However, they reflect only modest levels of stability over this relatively short period of time. The fact that the correlation is lower for English than Spanish may result from the fact that the language of instruction in these classrooms was English. Although systematic support for language and phonological awareness was absent, the classrooms did support English acquisition of children from Spanish-speaking homes. No such support for Spanish acquisition was provided, which is probably why we found somewhat stronger evidence of consistency in Spanish phonological awareness Applied Psycholinguistics 25:3 339 Dickinson et al.: Bilingual phonemic awareness than in English phonological awareness. Thus, there is evidence that this may be a developmental period when phonological awareness abilities are responsive to environmental inputs.\nOne factor that might also have an impact on phonological awareness is receptive vocabulary. After controlling for age and fall phonological awareness in Spanish and testing for EPAP in the other language, receptive vocabulary in Spanish (but not English) helps to predict phonological awareness in Spanish, though this accounts for less than 4% of predictive variance. After controlling for age and fall phonological awareness in English and testing for EPAP in the other language, receptive vocabulary in English (but not Spanish) helps to predict phonological awareness in English, although this accounts for less than 5% of the predictive variance. The finding that vocabulary contributes only a small amount of variance when predicting phonological awareness could be interpreted as indicating that language and phonological awareness are relatively distinct abilities at this age. Alternatively, it may be that the two systems are so closely interrelated that the phonological awareness assessment picks up considerable variance associated with broader language capabilities (Dickinson et al., in press ). This perspective is supported by the fact that we, like others (e.g., Goswami, 2001; Metsala, 1999) , found relationships between vocabulary and phonological awareness within language for both Spanish and English. Further work is needed to unravel the interdependencies among the linguistic and cognitive abilities that support the emergence of literacy.\nAnother factor that may contribute to phonological awareness is literacy. However, we found that literacy scores in the child's stronger language predicted neither English nor Spanish phonological awareness. This result is not consistent with prior work, discussed earlier, which documents that phonological awareness is, in part, an outgrowth of literacy experiences (Ehri, 1998; Kolinsky et al., 1987; Read et al., 1986; Wagner et al., 1994) . It may be that we found no such a relationship because the classrooms provided little in the way of systematic instruction related to literacy. While children did vary in how much they knew about print and its uses, this learning likely was not the by-product of much direct instruction. Almost certainly the Head Start classrooms of these children were not providing instruction that explicitly linked the sounds of letters to the letters. It is likely that, because prior researchers were studying older children, those children were receiving more explicit instruction related to the connection between sounds and letters.\nWe conclude that bilingualism is no disadvantage to children at the cusp of literacy. Preschool phonological awareness skill transfers from L1 to L2s, just like many other oral and written literacy skills in older children (e.g., see Cummins, 1991, for review) . Indeed, our findings clearly indicate that parents whose L1 is not English should be encouraged to use their stronger home language when they engage in activities that foster phonological awareness. Furthermore, our findings suggest that classroom instructional programs might consider using multiple languages as they help children acquire phonological awareness. Young children from Spanish-speaking homes transfer awareness across languages. Even in classrooms where English is the primary language of instruction, these children might benefit from having some phonological awareness experiences provided in Spanish.\nOf course much remains to be learned about this complex area. Our sample was comprised strictly of children from low-income homes in the northeastern and Dickinson et al.: Bilingual phonemic awareness southeastern parts of the United States, all of whom attended Head Start at a time when there was relatively little systematic attention to literacy and phonological awareness. Subsequently, literacy and phonemic awareness have been addressed more directly in many programs, but there is no reason to think that such changes would affect the general developmental processes we have described. Our results reflect changes over a relatively short period of time using a restricted battery of assessments of phonological awareness and included only vocabulary as an additional measure of language. Further observational research is needed that is more comprehensive and covers a longer time span. Intervention work, especially interventions that manipulate the language used, can also play an important role in unraveling the complex interdependencies among knowledge systems that support the acquisition of literacy."}, {"section_title": "APPENDIX A: ASSESSMENT TASKS", "text": ""}, {"section_title": "EPAP", "text": ""}, {"section_title": "Deletion detection task 2", "text": "Total points = 14 (8 points for judgments, 6 for corrections of all 6 incorrect items). The child is shown pictures and told the name of the object. Then the experimenter has the puppet say what the object is. The child is asked to judge whether the puppet has said the correct word. If the child says \"no,\" then he or she is asked to provide the correct pronunciation for the word."}, {"section_title": "Stimuli.", "text": "PRACTICE ITEMS."}]