[{"section_title": "Abstract", "text": "Although satellite technology promises great usefulness for the consistent monitoring of chlorophyll-α concentration in estuarine and coastal waters, the complex optical properties commonly found in these types of waters seriously challenge the application of this technology. Blue-green ratio algorithms are susceptible to interference from water constituents, different from phytoplankton, which dominate the remote-sensing signal. Alternatively, modelling and laboratory studies have not shown a decisive position on the use of near-infrared (NIR) algorithms based on the sun-induced chlorophyll fluorescence signal. In an analysis of a multi-year (2003)(2004)(2005)(2006)(2007)(2008)(2009)(2010) in situ monitoring data set from Tampa Bay, Florida (USA), as a case, this study assesses the relationship between the fluorescence line height (FLH) product from the Moderate Resolution Imaging Spectrometer (MODIS) and chlorophyll-α.\nThe determination coefficient (r 2 ) at individual sites ranged between 0.67 (n = 28, p < 0.01) and no relationship. Overall, there was no good relationship between in situ chlorophyll-α and the FLH product (r 2 = 0.20, n = 507). Nevertheless, the low determination coefficient obtained was still eight times higher than that between in situ chlorophyll-α and OC3M, the standard product traditionally used to estimate chlorophyll-α in ocean waters, which is based on the blue-green section of the spectrum. A better relationship of r 2 = 0.4 (n = 93) was obtained by using only sites located at least 5 km from shore and bridges and with depths ≥3.2 m. Although these results from Tampa bay did not demonstrate a consistent spatial applicability of MODIS FLH on estuarine waters, a few good determination coefficients found in particular sites (r 2 = 0.67, 0.64, and 0.49; n = 28, 11, and 13, respectively) show that good relationships can be achieved."}, {"section_title": "", "text": "Although satellite technology promises great usefulness for the consistent monitoring of chlorophyll-α concentration in estuarine and coastal waters, the complex optical properties commonly found in these types of waters seriously challenge the application of this technology. Blue-green ratio algorithms are susceptible to interference from water constituents, different from phytoplankton, which dominate the remote-sensing signal. Alternatively, modelling and laboratory studies have not shown a decisive position on the use of near-infrared (NIR) algorithms based on the sun-induced chlorophyll fluorescence signal. In an analysis of a multi-year (2003) (2004) (2005) (2006) (2007) (2008) (2009) (2010) in situ monitoring data set from Tampa Bay, Florida (USA), as a case, this study assesses the relationship between the fluorescence line height (FLH) product from the Moderate Resolution Imaging Spectrometer (MODIS) and chlorophyll-α.\nThe determination coefficient (r 2 ) at individual sites ranged between 0.67 (n = 28, p < 0.01) and no relationship. Overall, there was no good relationship between in situ chlorophyll-α and the FLH product (r 2 = 0.20, n = 507). Nevertheless, the low determination coefficient obtained was still eight times higher than that between in situ chlorophyll-α and OC3M, the standard product traditionally used to estimate chlorophyll-α in ocean waters, which is based on the blue-green section of the spectrum. A better relationship of r 2 = 0.4 (n = 93) was obtained by using only sites located at least 5 km from shore and bridges and with depths ≥3.2 m. Although these results from Tampa bay did not demonstrate a consistent spatial applicability of MODIS FLH on estuarine waters, a few good determination coefficients found in particular sites (r 2 = 0.67, 0.64, and 0.49; n = 28, 11, and 13, respectively) show that good relationships can be achieved."}, {"section_title": "Introduction", "text": "Monitoring and assessment of water quality is critical for managing and improving the environment. Water quality monitoring requires timely and accurate data at regular intervals over sustained periods to adequately understand processes, phenomena, and characteristics"}, {"section_title": "International Journal of Remote Sensing", "text": ""}, {"section_title": "6469", "text": "and the height of the fluorescence peak has been found to be affected by the concentrations of coloured dissolved organic matter (CDOM) and suspended particles in the water (McKee et al. 2007; Gower 1999 ).\nAn analysis of data from the Medium Resolution Imaging Spectrometer (MERIS) (Gower 1999) concluded that using the band at 753.75 nm for the baseline would lead to significant overestimation of FLH at higher levels of suspended material due to the increasing difference in reflectance between 700 nm and 750 nm. Gilerson et al. (2006) showed that most of the emergent radiation from coastal waters is a result of scattering rather than fluorescence. He concluded, through a series of laboratory analyses, that extracting fluorescence using the baseline method could strongly overestimate values in coastal waters. Conversely, McKee et al. (2007) suggested, based on HydroLight modelling, raised background radiance levels resulting in an estimated FLH of about only 30% of the true value of FLH. This would be due to a breakdown in the MODIS FLH signal when mineral suspended solid (MSS) concentrations are equal to or greater than 5 mg l −3 . The authors showed that the MODIS FLH algorithm is relatively unaffected by increasing CDOM. Hlaing et al. (2008) noted the best correlations between FLH and chlorophyll-α when the in situ chlorophyll-α concentration was lower than 4 µg l −1 and the total suspended matter concentration was greater than 4 µg l −1 . Another possible source of uncertainty in fluorescence baseline algorithms is a result of the physiological processes of the phytoplankton. Fluorescence yield is a function of photosynthesis and can vary as a function of physiological status (Falkowski and Kiefer 1985; Kiefer, Chamberlain, and Booth 1989; Chamberlin et al. 1990; Babin, Morel, and Gentili 1996; Letelier and Karl 1997; Letelier et al. 2000; Laney, Letelier, and Abbott 2005) . Laboratory and field studies have shown that fluorescence is influenced by the nutrient stress (Kiefer 1973a; Cleveland Perry 1987; Abbott et al. 2000; Kiefer 1973b; Letelier and Karl 1997; Letelier et al. 2000) , chlorophyll concentration, pigment packaging effects (Bissett et al. 1997 ) on light absorption, and light-dependent energy-quenching processes (Behrenfeld et al. 2009 ). Babin, Morel, and Gentili (1996) assumed that nutrient stress would increase the susceptibility of phytoplankton to excess irradiance, leading to the inactivation of reaction centres and reduced fluorescence yield. Additionally, phytoplankton undergoes diurnal variations, and there appears to be a midday depression in FLH emission (Falkowski and Kolber 1995) , which could be a limiting factor if it coincides with the satellite visit time.\nGiven both the benefits and disadvantages of using fluorescence-based algorithms, it is timely to conduct a definitive empirical analysis of their applicability for chlorophyll determination in estuarine waters. Furthermore, in most of the experiments above, the fluorescence emission studies have been activated by artificial light supplied by the experimenter or by using numerical models that simulate natural conditions. Few other previous studies had looked at the empirical validity of fluorescence algorithms in coastal waters using a comprehensive long-term in situ data set."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Study area", "text": "Tampa Bay is located on the gulf coast of the Florida Peninsula in the southeastern USA between 27.5-28.08\n• N and 82.36-82.75\n• W (Figure 1 ). With a subtropical climate, air temperatures in the area range between about 4\n• C in the winter and 39\n• C in the summer. About 60% (approximately 76 cm) of the annual precipitation occurs during summer (June to September) . Tampa . Monitoring sites marked in red (22 sites) are those having a statistically significant relationship between satellite data (FLH) and in situ chlorophyll-α (p ≤ 0.05). Sites marked in white (17 sites) either had no significant relationships between satellite data and chlorophyll-α (p > 0.05, 13 sites) or did not present match ups between both parameters (4 sites). The sites marked in black denote those for which no satellite data were obtained (15 sites).\nthe state of Florida, covering about 1000 km 2 at high tide and comprising the coastlines of Hillsborough, Manatee, and Pinellas counties. Lewis and Whitman (1985) defined seven sections within the bay; however, all of the monitoring sites used in this study are located in the four largest sections and more commonly understood to compose the entire bay: Old Tampa Bay (OTB), Hillsborough Bay (HB), Middle Tampa Bay (MTB), and Lower Tampa Bay (LTB). The sub-regions in Tampa Bay ( Figure 1 ) were defined by Lewis and Whitman (1985) , mainly based on geometrical relationships between areas and shoreline lengths.\nThe average 3.4 m water depth of Tampa Bay constitutes a concern for possible reflectance contamination from the shallow bottom, especially at the blue and green Downloaded by [Indiana Universities] at 07:55 30 July 2013 sections of the spectrum. considered a diffusion attenuation coefficient (K d ) of approximately 0.33 at 645 nm for waters with medium to low turbidity and coloured dissolved organic matter (CDOM) in Tampa Bay. The same authors chose a bottom depth threshold of 2.8 m following trial and error criteria to select in situ data in Tampa Bay at that wavelength. Four major rivers comprise up to 85% of the freshwater inflow (Lewis and Estevez 1988) : the Hillsborough River (HR), the Alafia River (AR), the Little Manatee River (LMR), and the Manatee River (MR). This is of special interest when considering the potential interference to optical properties caused by CDOM and organic and inorganic detrital particles, which are constituents typically brought by rivers to estuaries. Nevertheless, these limitations make Tampa Bay a good study case to represent coastal waters, especially when there is such an extensive amount of in situ data available for comparison, which makes Tampa Bay one of the most data-rich water bodies in the world.\nAlong with marshes and mangroves, seagrass beds are among the bay's most crucial habitats, which serve as nursery and feeding grounds for a number of species and support the tourism industry. The area cover of this important ecosystem has been used as an indicator to monitor the bay water quality (TBEP 2006) . Because of the shading effect of the high chlorophyll-α concentration, which blocks the penetration of sunlight through seagrass, this is a key water quality parameter regularly monitored in situ in Tampa Bay, but rarely in many coastal waters in the world where there are technical and financial limitations to support sustainable field monitoring programs. Direct and indirect nutrient discharges to Tampa Bay from mining, industry, and wastewater treatment, among others, caused a dramatic mid-century decline in bay water quality and a loss of seagrass coverage during the twentieth century. Fortunately, successful watershed management efforts, the most important of which has been the upgrade of the Tampa wastewater treatment plant to the tertiary level since 1979 (Garrity, McCann, and Murdoch 1985) , have improved the bay water quality by reducing point and nonpoint source nutrient loading to the bay (TBEP 2006) .\nA preliminary analysis of all of the in situ data made available for this study by the EPCHC for the period 2003-2010 showed the chlorophyll-α concentration ranging between 8 and 333.4 µg l −1 (mean (µ) = 8 µg l −1 , standard deviation (σ ) = 10.6), Secchi depth between 0.1 and 8.8 m (µ = 2.1 m, σ = 1.1), suspended solids (SS) between 0 and 70 mg l −1 (µ = 11.7 mg l −1 , σ = 6), total nitrogen (TN) between 0 and 39 mg l −1 (µ = 0.7 mg l −1 , σ = 1.6), total phosphorus (TP) between 0 and 8.7 mg l −1 (µ = 0.2 mg l −1 , σ = 0.2), turbidity between 0.4 and 31 NTU (µ = 3.1 NTU, σ = 2.1), and biological oxygen demand (BOD) between 0 and 8.8 mg l −1 (µ = 1.5 mg l −1 , σ = 1). Forty-four per cent of the chlorophyll-α samples registered below 5 µg l −1 , while 82.8% of the total suspended solid measurements ranged between 5 and 20 mg l −1 . The average chlorophyll-α concentration throughout all sub-regions of the bay exceeded 4 µg l −1 , from 4.18 µg l −1 near the mouth of the bay (e.g. LTB) to greater than 11 µg l −1 170 for the more inland portions of the bay (e.g. HB). Total suspended solids and turbidity (NTU) also showed a marked increase in the inland (15.5 mg l −1 and 4.1 NTU) compared with that in the mouth of the bay (12.9 mg l −1 and 2.6 NTU).\nUsing the data from the Coastal Change Analysis Program (C-CAP), the Tampa Bay watershed (TBW) has been estimated to extend for 6600 km 2 (Moreno-Madriñán et al. 2012) , including most of the Tampa Bay metropolitan area, which comprises the cities of Tampa (its largest city), St. Petersburg, and Clearwater. Its economy relies primarily on tourism and port operations. The Tampa Bay area is notable for its high population growth and the consequent rising environmental concerns. With a growing population of more Downloaded by [Indiana Universities] at 07:55 30 July 2013 than 2.7 million inhabitants by the time of the 2010 US Census (US Census Bureau 2012), Tampa Bay metropolitan area is the second and 21st most populous metropolitan area of Florida and the USA, respectively."}, {"section_title": "Satellite data", "text": "Eight years (2003) (2004) (2005) (2006) (2007) (2008) (2009) (2010) of daily MODIS Aqua L1A data (1 km resolution) were downloaded from the L1 and Atmospheric Archive Distribution System (LAADS Web) at the Goddard Space Flight Center. The criterion used to choose the Aqua satellite as opposed to Terra (both carrying a MODIS sensor in a near polar sun-synchronous orbit with 98\n• of inclination) was the daily time range during which the in situ data, initially available for matching, was collected. The local equatorial crossing time of Aqua is approximately 1:30 pm, while that of Terra is 10:30 am. The in situ data initially available for comparison was collected between 9:00 am and 4:00 pm. Consequently, the Aqua time-visit is closer to the middle of the sampling collection time window as compared to the Terra time-visit. This makes more uniform the time interval between in situ and satellite measurements for most of the matchup pairs and reduces that interval for those in situ measurements collected near the upper range-limit of the collection time window.\nThe MODIS data were processed from Level 1A using the SeaDAS software (version 6.2), by applying calibrations for ocean remote sensing developed by the MODIS Ocean Biology Processing Group (Fu, Baith, and McClain 1998) . The Ocean Biology Processing Group (OBPG) is responsible for the production and distribution of the ocean colour data products from the MODIS sensor on the Aqua satellite and optimizes MODIS ocean colour data by updating SeaDAS look up tables (LUTs). The LUTs are derived from the analysis of a variety of measurements aboard the MODIS sensor (solar diffuser measurements, lunar observations, and on-board lamps). Additional improvements in the data products result from enhancements in the sensor calibration, atmospheric correction, and improved biooptical algorithms.\nMore than 3242 files were downloaded from the LAADS web and processed to level 1A. Files containing contamination by cloud edges, severe distortion, and extensive cloud cover were eliminated from the analysis using a manual QA/QC procedure (Fischer 2009 ). The remaining images were processed to mapped level 3 chlorophyll fluorescence products (Abbott and Letelier 2003) and the standard blue-green algorithm chlorophyll-α product (OC3M) (Campbell 2003; Carder et al. 2003) . For the atmospheric correction required to derive products (FLH, OC3M), we applied the SeaDAS default atmospheric correction algorithm (Gordon and Wang 1994) , with the addition of NIR correction for nonzero water-leaving radiance (Stumpf et al. 2003) . The default masks of land, cloud, and saturated radiance were applied between L1A and L2 processing. The resulting image data were mapped to a cylindrical projection. The true resolution of FLH and OC3M images are at best ∼1 km at nadir; bilinear interpolation was used to generate 500 m resolution images. Images were further quality-controlled, and those images that contained cloud contamination or severe distortion were again removed from the analysis (Fischer 2009 )."}, {"section_title": "In situ data", "text": "All in situ data used in this study were collected and provided by the Environmental Protection Commission of Hillsborough County (EPCHC). Data were collected monthly as part of routine water quality monitoring programmes from fixed sampling sites throughout the entire Tampa Bay (Figure 1 ). Our analysis considered the time interval between Downloaded by [Indiana Universities] at 07:55 30 July 2013 years 2003 and 2010 to cover the period elapsed since the first full year of MODIS Aqua until the last full year of the in situ data available at the time of starting this study.\nAnalyses of in situ chlorophyll-α were determined by Standard Methods (SM) 10200 H (APHA 1998), using acetone and a tissue grinder. All in situ data used in this study were drawn from samples collected at mid-depth using a beta sampler. Brown high-density polyethylene bottles were used as sample containers, and the laboratory analysis was performed in low lighting. All in situ data were obtained according to QA/QC rules of the National Environmental Laboratory Accreditation Program (NELAP)."}, {"section_title": "Satellite and in situ matchups", "text": "More than 18,000 and 19,000 data points representing the biophysical parameters of fluorescence (FLH) and chlorophyll-α (OC3M), respectively, were derived from the MODIS imagery and were initially available for comparison with over 7552 data points from the in situ data set. Around 507 matchup pairs of data with a bottom depth equal to or greater than 2.8 m and within a time window of ±6 hours were selected for an overall coefficient of determination (r 2 ) between the predictor variables (satellite algorithm) and the single common dependent variable (in situ) chlorophyll-α. The 2.8 m threshold criterion was chosen following a trial-and-error procedure. This criterion was also used by , , and MorenoMadriñán et al. (2010) . Both of these studies showed no further improvement in the satellite vs in situ comparisons by the inclusion of samples with shallower bottom depths. As mentioned earlier, Secchi depth ranged between 0.1 and 8.8 m (µ = 2.1 m, σ = 1.1). used the same 2.8 m threshold to estimate the turbidity of Tampa Bay water, with MODIS surface reflectance at 645 nm. The authors found this value to be very close to the light penetration depth as predicted from a diffuse attenuation coefficient (Kd) of approximately 0.33 m −1 at 645 nm. This depth was not expected to interfere with the signal at the 665.1-746.3 nm wavelength used by the FLH algorithm, since the depth of light penetration is lower at longer wavelengths in this section of the spectrum (Botha et al. 2013) due to the strong absorption of light by water molecules (Pope and Fry 1997) . A similar trial-and-error procedure was followed to choose the ±6 h time window criterion, since further decreasing this time window did not improve the relationship. used time windows of 3 and 24 h for chlorophyll-α estimation using the algorithms based on the blue-green band ratios .\nIn situ chlorophyll-α values were log-transformed, as the chlorophyll-α concentrations tend to be log-normally distributed (Campbell 2003 (Campbell ). A long-term (2003 (Campbell -2010 annual mean was calculated for each of the MODIS products (FLH and OC3M) along with the chlorophyll-α in situ data. Areas that had less than 25% satellite coverage were excluded from the final mapped products. Lastly, correlations between in situ chlorophyll-α and the remotely-sensed products FLH and OC3M were compared.\nNo satellite data could be generated for 15 out of the 54 in situ sampling sites (Figure 1) . Most of these sites were located adjacent to the coastline. Out of the 39 sites for which satellite data were generated, 35 had dates matching the in situ chlorophyll-α data collection. Downloaded by [Indiana Universities] at 07:55 30 July 2013 The chlorophyll-α concentration of the matched in situ data ranged from 0.3 to 37.5 µg l −1 (µ = 4.6 µg l −1 , σ = 3.7). Sixty-nine per cent of the chlorophyll-α samples matched with the satellite data registered below 5 µg l −1 . Twenty-two sites showed statistically significant relationships when the FLH product was matched with in situ chlorophyll-α data, but only two sites had coefficients of determination (r 2 ) greater than 0.6 (Table 1 ). The r 2 within sites ranged between 0.67 (n = 28, p < 0.01) (Figure 2(a) ) and no correlation. There was one unexplained case (station LTB96) where the relationship was negative, r 2 = −0.45 (n = 12, p = 0.016). Sites that exhibited the best relationships included MTB14 (r 2 = 0.67, p < 0.01, n = 27), HB7 (r 2 = 0.64, p < 0.01, n = 11), OTB68 (r 2 = 0.49, p < 0.01, n = 13), and MTB32 (r 2 = 0.48, p < 0.01, n = 28) (Figure 2 While the HB sub-region had only one statistically significant station for the 12 in situ sampling locations, MTB, OTB, and LTB had 8, 7, and 6 significant sites for the 13, 18, and 11 sites in the respective sub-regions. The percentages of sites by sub-region that produced statistically significant results were 8%, 61%, 39%, and 55%, for HB, MTB, OTB, and LTB, respectively. The mean determination coefficients (r 2 ) of the statistically significant sites by sub-region were 0.64, 0.40, 0.38 and 0.16, for HB, MTB, OTB, and LTB, respectively.\nWhile the average distances to shoreline (including bridges) for the statistically significant stations were 3386 m and 2160 m, the average distances for the nonstatistically significant stations were 1309 m and 813 m, respectively. The average bottom depth for the statistically significant sites was 5.0 m, while that of the nonsignificant sites was 4.3 m. Overall, including all matchups pairs available in all the sites, and after removing matching pairs with a bottom depth less than 2.8 m, there was no important relationship between FLH and in situ chlorophyll-α concentrations (r 2 = 0.21, n = 507, p < 0.01) (Figure 3(a) ). Nevertheless, it was 8 times greater than that between FLH and the standard MODIS blue-green ratio (OC3M) product (r 2 = 0.0272, n = 507, p < 0.01. This seems to corroborate studies showing that the global MODIS empirical algorithm (OC3M) breaks down in coastal waters, producing an overestimate ranging from 50% to as much as 20 fold (Wozniak and Stramski 2004) . The poor overall correlation found between FLH and in situ chlorophyll-α (r 2 = 0.2) seems to support the modelling results of McKee et al. (2007) according to which the FLH signal breaks down in turbid waters where mineral suspended solids are greater than 5 mg l −3 . The authors explained this to be caused by the raised background radiance levels created by the suspended material. Their study further states that the FLH signal detected by satellite-based sensors reaches only 30% of the true value of FLH. In addition, Hlaing et al. (2008) noticed a noticeable spatial structure correlation between satellitebased chlorophyll and fluorescence maps for areas with chlorophyll concentration lower than 4 µg l −1 . Average in situ chlorophyll-α and total suspended solids measurements in Tampa Bay exceeded 4 µg l −1 and 5 mg l −1 , respectively. However, no improvement was obtained after considering only matching pairs with in situ chlorophyll-α concentration lower than 4 µg l −1 and total suspended matter concentration greater than 4 µg l −1 . Some improvement in the relationship was achieved when the analysis was limited to matching pairs from sites located at least 5 km from the shoreline and bridges (r 2 = 0.4, n = 93, p < 0.01) (plot closer to linear regression, Figure 3(b) ). Some of these bridges have four lanes in each direction in addition to the shoulders of the road and abundant vegetation along the sides of the embankment to both ends. Thus these structures may have an impact, contaminating the pixels."}, {"section_title": "Results", "text": ""}, {"section_title": "Spatial patterns", "text": "The spatial patterns of the long-term means (2003) (2004) (2005) (2006) (2007) (2008) (2009) (2010) for the FLH and OC3M product are shown in Figure 4 along with that of the in situ data for comparison. The blue-green ratio OC3M product mean displayed a higher chlorophyll-α concentration in OTB, and in general increased eastward throughout the full extent of OTB, MTB, and LTB. A similar eastward pattern was observed on water turbidity estimation using the surface reflectance MODIS Terra product (MOD09GQ, 620-670nm) (Moreno-Madriñán et al. 2010 ) and appears to be related to river discharge as the four major rivers (HR, AR, LMR, and MR) discharge their waters at the east side of Tampa Bay. A possible direct association between higher OC3M estimation of chlorophyll-α and water turbidity may be explained by the associated concentration of CDOM discharged by these four rivers and the high absorption of CDOM in the blue wavelength. of CDOM, this aligns with the studies showing that the OC3M algorithm can overestimate the measurements in coastal waters by as much as 50% to 20 fold (Wozniak and Stramski 2004) . No major river discharges into OTB, but a number of minor streams and storm water runoff from watershed scale precipitation can be important sources of CDOM for this bay sub-region. Conversely, the FLH product estimated higher concentration of chlorophyll-α westward throughout all sub-regions of Tampa Bay. Both remote-sensing products showed a decreasing spatial trend in chlorophyll-α from the upper bay sub-regions to the lower sub-regions. This trend agrees with the in situ data and may be associated with the adjacent more-dense urban areas influencing the northern side of the bay (Xian, Crane, and Su 2007; MorenoMadriñán et al. 2012) transitioning southwards with the influence of the clear waters from the Gulf of Mexico at the south (Weisberg and Zheng 2006) as also suggested by .\nSimilar to the FLH product and contrary to the OC3M product, the geographical distribution of the in situ data (Figure 4 ) confirmed that the chlorophyll-α concentration was in fact higher toward the western portion of OTB. For both of the OC3M and FLH products, lower satellite coverage for HB (<25%) produced a limited data set. Therefore, not enough matchup data points were available to analyse the spatial distribution trends in HB as can be appreciated from the large proportion of masked area covering this sub-region of the bay in Figure 4 . Because of the absence of monitoring sites adjacent to the western shoreline of MTB, it was not possible to confirm whether the pattern of the in situ data would coincide with the FLH product showing higher chlorophyll-α concentration along that shoreline."}, {"section_title": "Discussion", "text": "This analysis utilizes a long-term in situ data set from Tampa Bay, Florida (USA), and assesses the validity of the MODIS FLH algorithm to monitor chlorophyll-α concentrations Downloaded by [Indiana Universities] at 07:55 30 July 2013 in coastal and estuarine waters. The in situ data set contains a range of values from multiple water quality parameters that characterize an optically complex estuarine body of water and provides the opportunity to assess algorithm performance across a range of variables and conditions. Despite the fact that the overall correlation between the FLH product and in situ chlorophyll-α measurements was about 8 times greater than that between OC3M (blue-green ratio) algorithm and in situ chlorophyll-α, it was still not useful.\nStray light contamination from the brighter, adjacent land pixels may have contributed to the overall poor FLH-in situ relationships within Tampa Bay, whose width is only ∼16.5 km at its widest point. The impact of this adjacency effect over inland and coastal water pixels can be very strong in the NIR channels, for which water is very dark, and land pixels normally present a high reflectance, and can even be noticed in visible channels under certain conditions (Odermatt et al. 2008) . As a result, a significant portion of the recorded signal from the MODIS sensor can originate from outside the area represented by that pixel. In addition, artefacts introduced by the along-scan transition of Aqua from bright (land) to dark (ocean) pixels compromises the reflectance signal in coastal areas less than 5 km from the coast (Chuanmin Hu, personal comm.) .\nIt is important to mention that the 93 matchup pairs from sites at 5 km or more from the shoreline and bridges (r 2 = 0.4) (Figure 3(b) ) had bottom depths ≥3.2 m. As a matter of fact, the site with the second best relationship between the FLH product and in situ chlorophyll-α (HB7, r 2 = 0.64) (Figure 2(b) ) was located ∼1.3 km from the shoreline, with an average bottom depth of 3.6 m. This good relationship was followed by r 2 = 0.49 in OTB68 (Figure 2 (c) ) and r 2 = 0.48 in MTB32 (Figure 2(d) ) with ∼1.5 and ∼3 km from the shore, respectively. Average bottom depths for both sites were 4.8 and 7.5 m, respectively. This suggests that the slight improvement in the relationship achieved with increasing distance from shore may also be helped with increasing depth. Confirming both hypotheses (bottom depth and distance from shore), the best relationship (MTB14) was observed at >5 km from the shore and with a bottom depth of 7.4 m (Figure 2(a) ). Remarkably, the three monitoring sites with the best relationships observed between the MODIS Aqua FLH product and in situ chlorophyll-α were also reported with the best relationships between the MODIS Terra surface reflectance product (MOD09GQ) and in situ water turbidity (Moreno-Madriñán et al. 2010) . The coefficients of determination observed in that study were 0.86, 0.77, and 0.66, respectively, for OTB68, MTB14, and HB7. The fact that each one of these monitoring sites is located in a different sub-region of the bay suggests the usefulness of using them in representation of their respective sub-region to monitor water quality with remote sensing.\nTo understand whether the low relationships between FLH and chlorophyll-α could be explained by turbidity interfering with the FLH signal, a determination coefficient between the FLH product and water turbidity was computed for 417 available matchups. This resulted in an r 2 = 0.06, which does not seem to support turbidity as the determining factor for a low relationship between the FLH product and in situ chlorophyll-α. Lastly, given that the near polar, sun-synchronous orbit of the Aqua satellite crosses the equator at approximately 1:30 pm and since the emission of chlorophyll-α fluorescence is depressed at noon (Falkowski and Kolber 1995) , roughly coinciding with the satellite time visit to Tampa Bay, this could be argued as a strong contributor to explain the low relationships found in most of the sites. The average in situ sampling time for the 507 matchup pairs with bottom depth ≥2.8 m was 12:33 pm. As mentioned earlier, this shorter range between in situ and satellite measurements was the criterion to choose Aqua as opposed to Terra. However, the average sampling times for the sites MTB14, HB7, OTB68, and MTB32 with the best observed relationship were 11:14 am, 10:24 am, 1:51 pm, and 11:10 am, respectively, with only one Downloaded by [Indiana Universities] at 07:55 30 July 2013 of them being closer to Aqua time visit as compared to Terra. Nevertheless, even in the case that the time of the satellite visit could explain the low relationships between FLH and in situ chlorophyll-α determinations, the question remains about why there are still few sites with good relationships. A good part of the answer to this question may come from undertaking a similar study based on the data generated by the MODIS sensor on Terra. It is important to mention, however, that 10:30 am would still be within the period of low FLH fluorescence signal, and alternatively fluorescence measurements taken at night would require night in situ sampling for comparison."}, {"section_title": "Conclusions", "text": "Overall, these results line up with the laboratory and modelling studies, suggesting that the FLH product may have difficulties to quantify in situ chlorophyll-α concentration and/or water quality of estuarine waters. Nevertheless, the time of satellite visit to the sites is also thought to play a possible role. Although in a broad sense, and based solely on this Tampa Bay case and satellite visit time, these results are not favourable to recommend the use of MODIS FLH algorithm for the measurement of chlorophyll-α concentration in estuarine waters. Yet they show that in particular sites this product can draw good estimations, which exposes the need for further research addressing the factors that determine this difference between bad and good sites. An approach to use this product in estuarine waters would imply an initial period of in situ monitoring to identify the sites with good determination coefficients. Once these sites are identified, a monitoring programme with satellite technology could continue. This approach would allow temporal consistency in water quality monitoring, although it would be deprived of consistent spatial distribution for analysis across larger areas of the estuary.\nIt can be reasonably deduced that improvements regarding spatial consistency can be made when simultaneously considering certain conditions like distance between monitoring sites and shore along with bottom depth. The low but still better relationship between in situ chlorophyll-α and the FLH product as compared with the blue-green ratio OC3M confirms possibilities for continuing search for improvements using the fluorescence signal and the NIR section of the spectrum to estimate chlorophyll-α in estuarine waters. It would be valuable to perform a similar study using the data generated from MODIS Terra, given the earlier daily time of visit of the Terra satellite, thus avoiding the fluorescence emissivity depression of chlorophyll-α at midday."}]