[{"section_title": "Abstract", "text": "The early academic skills of children tend to serve as precursors for later academic successes or struggles. Being exposed to multiple risk factors early in life (e.g., poverty, unsafe or impoverished neighborhood conditions, and language minority status) is typically associated with having fewer skills at kindergarten entry, but some children come to school from adverse conditions displaying advanced academic skills. In this study, we investigate high-risk high achievers in the United States context (i.e., children who arrive at school [~5 years old] from high-risk environments displaying high-levels of academic skills) to determine if their achievement trajectories remain elevated, like those of their high-achieving peers, or if they take a different trajectory more reflective of their high-risk conditions. We find that across nine years of formal schooling, the average math and reading scores of high-risk, high-achieving students were more similar to the scores of students who were initially medium achievers at school entry and less similar to other high achievers who entered school with fewer early contextual risk factors. Our results suggest that early exposure to numerous risks can flatten children's learning trajectories, even if they present with advanced skills."}, {"section_title": "", "text": "In the United States, recent federal policies focusing on the benefits of early childhood education reflect an understanding that investment in the early stages of children's lives produces better life outcomes. Indeed, research focused on the American context shows that the differences in the academic skills of children as they begin school are predictive of learning and achievement trajectories throughout elementary-, middle-, and high-school (Bodovski & Youn, 2012; Cheadle, 2008; Magnuson, Ruhm, & Waldfogel, 2007; Sabol & Pianta, 2012; Schoon, Bynner, Joshi, Wiggins, & Sacker, 2002) . Entering school with more advanced skills usually results in continued success, whereas the opposite tends to presage academic struggles (Morgan, Farkas, & Wu, 2009 ).\nInvestigating further this phenomenon, known as academic inertia, research has begun to consider whether the pay-off from early skills varies from student to student or among disciplines. To this end, studies in the United States have found that math skills at kindergarten entry better predict later reading, math, and science scores than do reading skills at kindergarten entry (Claessens & Engel, 2013) . While such findings push researchers and practitioners to assess the types of skills that are emphasized early in school, these results do not consider whether all children benefit equally from early academic success. Left unaddressed is the possibility that academic inertia varies not only by skill type, but by \"type\" of child as well.\nEvidence from international research has drawn attention to differences in early academic skills by poverty status (e.g., Walker et al., 2007) and by membership in a racial or ethnic minority (Heath, Rothon, & Kilpi, 2008) ; both patterns are regularly found in the context most relevant for this study -the American system (Fryer & Levitt, 2004; Robinson, 2013) . In the United States, poverty and race/ethnicity minority status serve as proxies for the disadvantaged and high-risk circumstances in which many of these children live. Their families disproportionately experience issues with food insecurity, living in unsafe neighborhoods, and underemployment (Cook & Frank, 2008; Slack & Jensen, 2002) . Independent of social class and minority status, such risks contribute to experiences that can set into motion disadvantageous processes that tend to result in children from high-risk homes entering school with underdeveloped skills; these gaps often accumulate over time, which may lead to future social inequality (Burchinal, Roberts, Zeisel, Hennon, & Hooper, 2006; Luster & McAdoo, 2008; Raver, 2004; Sektnan, McClelland, Acock, & Morrison, 2010 ). Yet, not all high-risk children arrive at school with the same set of skills, as some have managed to excel in the midst of their challenging conditions (Garmezy, 1993; Rutter, 1987) .\nChildren coming to school from backgrounds typified by large numbers of risks while simultaneously displaying unexpectedly high levels of academic skills are at an intersection of competing forces. In one direction, academic inertia would predict from their advanced academic skills that these individuals would progress along a pathway of success. At the same time, and in the opposite direction, high-risk children are handicapped by their early circumstances, which may be expected to undermine the ability of these children to realize their full academic potential. In this regard, high-risk, high-achieving students, while a unique segment of the student population, nevertheless provide an ideal group for the study of whether early academic skills benefit all children equally."}, {"section_title": "Literature Review", "text": "There is increasing evidence that the skills and abilities children begin school with strongly affect their subsequent educational trajectories (Bodovski & Youn, 2012; Cheadle, 2008; Hindman, Skibbe, Miller, & Zimmerman, 2010; McClelland, Acock, & Morrison, 2006; Sabol & Pianta, 2012) . This is particularly the case in the United States, where children arriving at school with more skills tend continually to add to their advantage, while underperforming children make progress but never quite enough to catch up (Domina & Saldana, 2012; Klugman, 2012; Lucas, 2001) . The presence of academic inertia has given rise to studies focused on understanding the factors associated with differences in children's early academic skills, and prior research has repeatedly highlighted the negative consequences associated with living in environments characterized by multiple risks and social disadvantage (Alexander, Entwisle, & Horsey, 1997; Cheadle, 2008; Duncan, Brooks-Gunn, & Klebanov, 1994) .\nRisk, in studies focused on the American context, is understood as a combination of problematic conditions and negative characteristics of the space in which an individual lives that contributes to an \"elevated probability of a negative or undesirable outcome in the future\" (Masten & Gewirtz, 2006, p. 24) . According to the cumulative risk literature, individual risks by themselves often do not hinder future achievement; however, risks tend to co-occur, and the more risks a child has, the greater likelihood of negative outcomes. The presence or absence of such risks as poverty, single-parent family structure, or parental depressiveness early in life dictates the circumstances in which an individual lives; their presence burdens children with manifold disadvantages.\nPrevious research has shown that children who live in disadvantaged contexts defined by large numbers of risks in their daily lives often experience poorer developmental outcomes (Adkins, Wang, Dupre, van den Oord, & Elder, 2009; Cooksey, Menaghan, & Jekielek, 1997; Schoon, Parsons, & Sacker, 2004) . Of particular interest for our study is that these children are more likely to experience academic problems than peers from more advantaged backgrounds (i.e., those growing up with fewer risks) (Alexander, Entwisle, Blyth, & McAdoo, 1988; Evans & Schamberg, 2009; Gerard & Buehler, 2004; Morales & Guerra, 2006) . All too often, children exposed to numerous risks early in life enter school less prepared (Mistry, Benner, Biesanz, Clark, & Howes, 2010) , which gives rise to lower test scores and grades during the elementary school years (Dubow & Luster, 1990; Morales & Guerra, 2006) , more absenteeism throughout compulsory schooling (Gutman, Sameroff, & Cole, 2003) , taking less rigorous courses in middle and high school (Dauber, Alexander, & Entwisle, 1996) , and higher dropout rates in high school (Alexander et al., 1997) . The schooling experiences of high-risk children epitomize the troubling academic inertia experienced by students who arrive at school with underdeveloped skills. Moreover, recent evidence suggests that not all early skills are equal in their association with later educational success.\nExpanding on earlier research that identified the importance of early academic skills for later educational success, researchers have begun to examine whether all skills have the same benefit over time. For example, Claessens and Engel (2013) looked at children's kindergarten math and reading achievement and whether each of these early skills similarly predicted later math and reading skills and grade retention. Relatively speaking, they found that early math skills were a much stronger predictor of later educational outcomes, and concluded that curriculums could maximally benefit children by focusing on math skills early in school. These findings thus complicate the naive idea that universally improving children's early academic skills would have uniform benefits, because not all skills are rewarded equally. However, even if curriculums attempted to target specific math skills in the early years in order to improve children's later outcomes to the fullest extent possible, the premise of this reform still hinges on the idea that academic skills will benefit all children equally. It overlooks the possibility that the educational returns on early skills not only vary by skill type but may also vary according to the life experiences of the student (e.g., environmental risk exposure rates).\nChildren coming from high-risk environments tend to enter school with underdeveloped academic skills, but this is not always the case. Despite their circumstances, a portion of children from high-risk environments enter school with stronger academic skills and find themselves at the mercy of two competing influences (Mistry et al., 2010) . Based on academic inertia, high achievers from high-risk environments would be expected to show greater academic success than low-and middle-achieving peers, as their advanced early skills should be perpetuated over time. However, high-risk high-achieving children come from circumstances that are typically detrimental to the development of academic skills, and these early-life conditions may stunt the growth of their educational skills and achievements. High achievers from high-risk environments are found at a particular intersection of early academic skills and social circumstances, thus offering us a chance to examine whether there are differential educational returns to early academic skills for different groups of students. To this end, we seek to answer the following research question: Do early academic skills benefit all children equally, or are there differential educational returns resulting from the children's varying exposure to environmental risks?"}, {"section_title": "Method", "text": "To answer our research questions, we used data from the Early Childhood Longitudinal Study, Kindergarten cohort (ECLS-K). The ECLS-K is a seven-wave panel study that collected data from a nationally representative sample of over 20,000 children in the United States who attended kindergarten in the fall of 1998. The study subsequently followed children for nine years, until most children had advanced into the eighth grade (Tourangeau, Nord, Le, Pollack, & Atkins-Burnett, 2006) . In the United States, formal schooling requirements vary slightly among states, but generally children are required to attend school between the ages of 6 and 17 years, with instruction offered for kindergarten through 12 th grade. Consequently, the ECLS-K provides data tracing students' schooling experiences for about 80% of the compulsory schooling period and about 70% of the instructional grade levels offered in the U.S. Although we will refer to data collection rounds by grade level, not all children were in the same grade for later waves. For example, while we refer to the final round of collection as the eighth-grade wave, this is the modal grade for students at that time, and a small portion of students were actually in seventh grade or lower or ninth grade or higher. The sample was designed as a three-stage stratified random sample, with students nested in schools, which were themselves nested in geographic areas (usually consisting of counties or a collection of counties). Data were collected from the children and their parent, teacher, and school administrator, to provide several perspectives regarding children's family and educational circumstances."}, {"section_title": "Defining High-Risk Environment High Achievers", "text": "In order to classify children as coming from high-risk family environments and having high levels of achievement at kindergarten entry, we first categorized children according to their risk level. Twenty-one risk factors found in children's early contexts were identified using parent-reported data. Examples of risk factors included poverty status, receiving food stamps, family structure instability, overcrowding in the home, residential mobility, and community gang problems (for the full list of risks, see Table 1 ). Each risk was coded dichotomously (1 = risk), and summed to create a total count of children's risks. The average number of environmental risks children entered kindergarten with was 5.5 (SD = 3.98). Based on their total environmental risk score, children were separated into three groups, reflecting high-(8 or more), medium-(3 to 7), or low-risk (2 or less) levels with about 30% of children classified as high, 30% as low, and 40% as medium.\nNext, we used children's performance on the fall kindergarten direct-assessment of reading, math, and general knowledge skills to classify students according to their achievement level. We explored categorizing high achievers using several different sources of information (e.g., using teacher-reported information on children's academic competencies in reading and math). However, none of the different sources produced different results than what is found in the current study. Rather than rely on any single subject, we opted to rely on a cross-section of performance, and defined children as \"high-achieving\" if they scored in the top 40 th percentile on all three subject-matter assessments (21%), \"low-achieving\" if they scored in the bottom 40 th percentile on all three assessments (22%), and \"medium-achieving\" otherwise (57%). Finally, our risk-achievement groups were created by intersecting the three-level risk classification and three-level achievement classification, creating a 9-group indicator. The risk-achievement classification indicator was converted to a set of dummy variables for analysis, with high-risk high achievers set as the reference group. There were 319 children identified as high achievers who came from a high-risk environment."}, {"section_title": "Reading and Math Trajectories", "text": "We wanted to examine whether the achievement trajectories of students varied according to their risk and achievement levels when they began school. To measure achievement trajectories we used children's performance on their math and reading direct-assessments from kindergarten through grade 8. Although reading, math, and general knowledge scores were used to define high-achieving students at school entry, we relied on reading and math to measure academic trajectories, because the general knowledge assessment was only administered in the Kindergarten and Grade 1 waves of the ECLS-K. Children's reading and math skills were assessed using a two-stage procedure. In the first stage, all children received a set of comparably difficult questions, called routing questions. Based upon performance in the first stage, children were allotted a second series of questions of high, medium, or low difficulty (with the exception of the final wave, which only had a high-and low-difficulty second series of questions). Item response theory (IRT) was used to calculate a score for each subject-matter assessment at each wave. IRT uses the pattern of right, wrong, and omitted responses in combination with information on the difficulty and \"guess-ability\" of each test question to calculate a probability that a child would answer a particular question correctly. This allows children to receive a subset of all assessment questions, but still receive a robust assessment score, just as if they had provided an answer for every item."}, {"section_title": "Control Variables", "text": "Additional variables relating to children's achievement trajectories that we included were sex, age (in years), race/ethnicity, and first-time kindergartener status. Table 2 provides the mean and standard deviation for each of the independent, control, and dependent variables, overall and by risk-achievement classification."}, {"section_title": "Time", "text": "Our analysis of children's academic achievement trajectories requires a variable for time, which measures the interval between the assessment occasions. However, the ECLS-K has an unbalanced sample design when assessing students, such that during each collection period students were assessed across a period of nearly three months. Students tested later in the collection period had received additional days of academic instruction compared to those tested earlier on. In order to account for this design feature, and calculate an unbiased time-measure, child-specific time-lapse values were computed. The grand mean test date of the Spring Kindergarten assessment was calculated and then used as the zero point from which the childspecific test-dates from later waves were subtracted. The time variable thus captures variability in the initial assessment date (a child assessed prior to the mean assessment date in kindergarten receives a negative value, and a child assessed after receives a positive value), as well as any difference in the number of days between assessment occasions (the number of days between child i's assessment occasion in a later wave and the assessment date for Spring Kindergarten is unique to child i). The unit of measurement for time was originally days, but to provide more reasonably sized coefficients, it was converted into years for analysis."}, {"section_title": "Missing Values", "text": "Multiple imputation via the ICE command in STATA (StataCorp, 2014) which was used to handle missing values for the analysis (Royston, 2007) . A total of five data sets were imputed using all of the risk items and the independent and dependent variables in the analysis. That is, individual risks were multiply imputed, and the total risk score was computed using the imputed data file. Because of the longitudinal nature of the dependent variable, we imputed the data in the person-file format, and then transposed it to the person-period layout for analysis. In order to assess the sensitivity of our results to the multiple imputation process, we tested the models using listwise deletion, and found substantively similar patterns."}, {"section_title": "Analysis", "text": "To address our two research questions, we used HLM mixed-effect growth curve modeling (Fitzmaurice, Laird, & Ware, 2004; Raudenbush & Bryk, 2002; Singer & Willett, 2003) . HLM growth curve modeling is particularly suited for our study, because it handles the unbalanced design of our data, and also estimates the association between time-invariant covariates (e.g., risk-achievement classification) and change in a time-varying dependent variable (i.e., reading and math scores). Two models each were run for reading and math. Model 1 includes only the set of risk-achievement classification dummy variables, in order to provide a baseline estimation of any differences in achievement trajectories that may exist; and Model 2 added in the control variables for socio-demographic characteristics to determine whether differences in trajectories reflected other characteristics of children.\nFor the HLM growth curve analysis, children's time-varying assessment measures were estimated at Level 1 (N = 90,485), and nested in children at Level 2 (N = 18,097). Preliminary analyses revealed a non-linear trend in children's test scores from kindergarten to eighth grade; therefore, all models contain Time and Time-sq., its squared term, to estimate the convex functional form of children's growth in reading and math. Since we are interested in children's trajectories, we have our independent and control variables included in the equations predicting the intercept, time, and time-squared, and include a random-effect for time. The full model is presented below:\nLevel 1: where, in the Level-2 equation, RISK-ACH is the vector of dummy variables for a child's riskachievement classification at kindergarten, and δ is a vector of socio-demographic controls. The second Level-2 equation estimates the Level-1 linear time parameter, π 1i , and the third Level-2 equation estimates the Level-1 squared term for time, π 2i . The Level-2 equations thus model the interaction between the risk-achievement classification of children at kindergarten and the linear and curvilinear association with their reading and math scores. That is, the models are estimating the variability in children's growth in academic skills by risk-achievement classification. Table 1 contains the mean and standard deviation for each of the risk items used to create the total risk score, reported for the overall sample as well as separated out by risk-achievement classification. As might be expected, the proportion of children having a particular risk was lower for children classified as low-risk than it was for children labeled as medium and high risk. For children classified in the high-risk environment group, each achievement level was proportionally represented in specific types of risks with a few exceptions. Specifically, among high-risk environment students:"}, {"section_title": "Results", "text": "• High-achievers were less likely to be in poverty compared to medium-and lowachievers (34%, 54%, and 65%, respectively); • High-achieving students were less likely to have a parent working less than full time compared to medium-and low-achievers (27%, 33%, and 41%, respectively); • A lower percentage of high-achieving students lived in an overcrowded house compared to medium-and low-achievers (19%, 30%, and 36%, respectively); • High-achievers were less likely to speak a non-English language at home compared to medium-and low-achievers (7%, 23%, and 26%, respectively).\nThe substantive differences in the proportion of children across these four risk factors suggest subtle variations in the risk profiles of high-risk high achievers relative to their high-risk medium-achieving and high-risk low-achieving peers. Table 2 provides the mean and standard deviation for all the variables included in the analysis for the overall sample, as well as by risk-achievement classification. Briefly, children who entered school as high-risk high achievers continued to outperform their high-risk low-achieving and high-risk medium-achieving peers in both math and reading; however, high-risk high achievers scored the lowest of the high achievers. That is, high-risk high achievers scored lower than their low-risk high-achieving and medium-risk high-achieving peers in kindergarten, and this gap grew between kindergarten and eighth grade. In fact, by the eighth-grade wave, the average reading and math scores of high-risk high achievers were comparable to the reading and math scores of children who began school as low-risk, medium achievers. These descriptive patterns suggest that high-risk high achievers are able to maintain part of their academic advantage during the elementary and middle school years, especially relative to other high-risk peers who were lowand medium-achievers in kindergarten. Nevertheless, part of their advantage appears to wane in the later years. Next, we examine these relationships in a multivariable framework Table 3 provides results from the HLM analyses examining the association between riskachievement classification and children's reading and math achievement trajectories from kindergarten through eighth grade. The coefficients presented under the row labeled \"Intercept\" are the estimates for children's average test scores on the spring kindergarten assessment; the coefficients under the row labeled \"Time\" are the estimates of the annual linear growth in test scores between kindergarten and eighth grade; and the coefficients under the row labeled \"Timesq.\" are the estimates of the non-linear growth in test scores between kindergarten and eighth grade. Finally, to help convert the many numbers in these tables to a more readilycomprehensible format, Figures 1 and 2 present line graphs of the predicted values for students based upon the reading and math models, respectively.\nThe descriptive statistics reported in Table 2 indicated that high-risk high achievers started school with test scores slightly lower than their low-and medium-risk, high-achieving peers, but that small initial difference in test scores grew over time. This pattern is reaffirmed in model 1 in Table 3 of the reading analysis. Model 2 controlled for a handful of sociodemographic traits that prior research has shown are associated with children's academic achievement, and have also served as markers of social disadvantage (e.g., race/ethnicity). After Control variables NO YES NO YES *** p < .001 ** p < .01 * p < .05 NOTE: Models are weighted to adjust for over-sampling and design effect. Socio-demographic variables are child's sex, age at kindergarten assessment, race/ethnicity, and first-time kindergartener status.\ncontrolling for these variables, many of the relationships and patterns from model 1 remained. High-risk high achievers scored somewhat lower on the spring kindergarten reading assessment than their low-risk high-achieving peers, but were statistically indistinguishable from their medium-risk high-achieving peers. However, the linear gains of high-risk high achievers were less each year in reading (30.8 points) than their medium-risk (32.9 points) and low-risk (32.8 points) high-achieving peers. The annual linear gains of high-risk high achievers followed closely the trajectory of low-risk, medium achievers: the annual linear gains of the two groups were statistically indistinguishable. In addition to the linear change in reading scores over time, the models also controlled for non-linear changes (which could take the form of acceleration or deceleration in scores). The coefficient for the non-linear changes was negative, indicating decelerating gains over time (i.e., children are making gains each year, but gaining less than in the previous year). Only two other groups of students experienced greater deceleration than highrisk, high-achieving students, and they were children in the medium-risk, high achiever and lowrisk, high achiever groups. While high-risk high achievers may have had the least decelerating gains of all the high achievers, in combination with their lower linear gains they lost ground relative to their other high-achieving peers each year (a separation visible in the top line graph of Figure 1 ). Table 3 also includes the results from analyses of children's math achievement trajectories, and like the results from the reading models, model 1 of the math analyses revealed slight differences at baseline between high-risk high achievers and their low-and medium-risk high achieving peers that expanded over time. Controlling for socio-demographic variables did little to change the intercept differences (i.e., differences in the spring kindergarten scores), and the annual estimated linear gain was 26.5 points for high-risk high achievers; 27.6 points for medium-risk high achievers; and 28.2 points for low-risk high achievers. High-risk high achievers were gaining less than their other high-achieving peers over time. In addition to the linear change in math scores over time, the models also controlled for non-linear changes (which could take the form of acceleration or deceleration in scores). The coefficient for the non-linear changes was negative, indicating decelerating gains over time (i.e., children are making gains each year, but gaining less than the previous year). Only one group of students experienced greater deceleration than high-risk high-achieving students, and they were children in the lowrisk high-achieving group. In combination with their lower linear gains, high-risk high achievers lost ground to their other high-achieving peers each year in math scores, which resulted in minimal differences at baseline expanding into noticeable gaps by the eighth-grade (a separation visible in the top line graph of Figure 2 ).\nFigures 1 and 2 make visible the unfulfilled potential of the high-risk high achievers. For ease of presentation, the top graph compares the trajectories of high-risk high achievers against their lower-risk high-achieving peers, and the bottom graph compares the trajectories of highrisk high achievers against their other high-risk peers. When compared to their lower-risk highachieving peers, we see a widening gap in reading and math, especially during the later years of elementary and middle school. Similarly, the bottom line graphs in Figure 1 and Figure 2 display a modestly closing gap between high-risk high-achieving students and their high-risk peers, who were either medium-or low-achieving during the later elementary and middle school years. Table 3 . HRHA = high-risk, high-achiever; HRMA = high-risk,medium-achiever; HRLA = high-risk, low-achiever; MRHA = medium-risk, high-achiever; LRHA = low-risk, high-achiever. "}, {"section_title": "Discussion", "text": "Previous evidence, generated by research conducted in the United States, has established the importance of early academic skills for later educational success (Bodovski & Youn, 2012; Cheadle, 2008; Magnuson et al., 2007) . While not all skills are propagated to the same extent over time, with early skills being more indicative of later skills in math as opposed to reading (Claessens & Engel, 2013) , it is not clear what other aspects of the children's lives might also influence academic inertia. In particular, might living in high-risk environments dampen Table 3 . HRHA = high-risk, high-achiever; HRMA = high-risk,medium-achiever; HRLA = high-risk, low-achiever; MRHA = medium-risk, high-achiever; LRHA = low-risk, high-achiever. students' learning over time, especially for students who begin school with high levels of academic skills? To examine this possibility, we identified groups of children based on the number of risks in their early environments and their performance on direct assessments of their math and reading skills. Intersecting these early-life environmental risks with demonstrated academic skills, we identified a group of children who were high-risk high achievers at kindergarten entry, and compared them to the other eight risk-achievement classification groups (medium-and low-risk high achievers, and medium achievers and low achievers at all three risk levels) by examining their reading and math trajectories from kindergarten through eighth grade. Our findings suggest that high-risk high achievers have a learning trajectory distinct from those of other groups we tested. Compared to their low-and medium-risk high-achieving peers, highrisk high achievers exhibit diminished growth in their test scores over time; however, high-risk high achievers outperformed their peers who entered school from high-risk environments, but were initially either low or medium achievers.\nThese findings align with previous research that has separately examined the ways that early academic skills and early social conditions have long-term implications for children's achievement, and has shown that they may have opposing effects. High-risk environments tend to be associated with academic struggle, and early academic success tends to continue as children progress through school (e.g., Magnuson et al., 2007; Schoon et al., 2004) . Though these conclusions have been repeatedly established, less research has considered the intersection of early high-risk and high-achievement on the long-term trajectories of students, and the implications these competing forces have on children's elementary and middle school test scores. The reading and math trajectories of a nationally-representative sample of high-risk highachieving students in the United States presented in this study speak directly to these competing forces. In line with prior research (Mistry et al., 2010) , we find that these children are able to overcome their disadvantaged circumstances and succeed when they might otherwise be expected to fail, and that they continue to perform better than their other high-risk peers. Experience of a high-risk context does not automatically equate to academic failure. At the same time, these high-risk high-achieving students were not able to take full advantage of their initial academic success as their gains over time were notably depressed relative to their high-achieving peers who were not subjected to such risky environments. These findings align with the notion that children are capable of adapting to the most disadvantaged of circumstances, but also serves as a reminder that even the resilient are not entirely immune to their context. Advanced skills tend to beget additional advanced skills, while fewer skills tend to foreshadow a slower accumulation of skills (Claessens & Engel, 2013) . High-risk high achievers entered school with skill sets that should have continuously propelled them toward future success, and while they did continue to outperform their low-and medium-achieving high-risk peers, their trajectories did not have the same high level of sustained learning gains as their lowand medium-risk high-achieving peers. It might be suggested that high-risk high achievers overperformed on the kindergarten assessment, and that their risk-achievement classification was thus incorrect, but this is unlikely to have been the case for the entire group. Moreover, despite the depressed trajectory of these children, they did continue to be among the top performers across later waves of the study. It seems likelier to us that high-risk high-achieving children are unable to fully maximize their potential because of the disadvantaged circumstances in which they live. While policies and interventions could be developed to help further the academic successes of these children, additional research is needed that further identifies the factors contributing to their unfulfilled promise.\nAs policy-makers begin to consider the benefits of investing in early childhood education, they face a lack of evidence about whether boosting kindergarten-entry skills will be enough on its own to sustain students' growth over the long term and to close achievement gaps. While the current study does not address this issue directly, it does investigate a group of highrisk students who entered kindergarten with advanced skills, and it asks what happens to these students during their early years of schooling. This study informs the debate on early childhood education by looking at an atypical group of children -those living with a high prevalence of risk, yet nonetheless achieving high scores on academic assessments at kindergarten entry. While studying the impact of pre-kindergarten programs was beyond the scope of the present study, investigating this atypical group serves as a warning that early childhood programs serving atrisk students may be insufficient, and that at-risk children may need more support once in school if they are to achieve their full potential.\nFuture research that moves beyond some of the limitations of our current study may provide other new insights into high-risk high-achieving students. For example, we concentrate on the risks and achievement levels of students as they enter school. However, further research is needed to understand the impact that exposure to multiple risks over time has on children as they progress through school. Additionally, this study only considers academic achievement, which is but a single area of children's development. Other areas of development, such as socio-emotional or physical health, may reveal different patterns and processes linking early well-being to later outcomes, and how these processes vary depending on children's social circumstances. It is worth noting that we are not the first to find variability in the outcomes of children who experience and then overcome high-risk environments (e.g., Kassis, Artz, Scambor, Scambor, & Moldenhauser, 2013) , and there is evidence that overcoming risks in one domain does not ensure overcoming risks in another (e.g., Ungar, 2004) . Finally, our study only considers students in the American system, and while academic inequalities exist around the world, it is unknown whether the outcomes of high-risk high achievers in the U.S. are indicative of the trajectories and patterns that would be seen in other societal contexts. Data from other countries and education systems would provide essential follow-up to this study, and inform the ways in which broader context can impact individual development.\nDespite these limitations, this study provides a further investigation of the consequences of social disadvantage for children's academic achievement by studying the reading and math trajectories of children according to their risk-achievement classification. We found that highrisk high achievers arrived at school with advanced skills in reading, mathematics, and general knowledge, yet were unable to capitalize on these advanced skills to the same degree as their high-achieving but lower-risk peers. The early social circumstances of these children appear to undermine the advantage that advanced academic skill typically creates, which serves as an important reminder that providing supports for children requires improving the conditions in which they exist."}]