[{"section_title": "Introduction", "text": "The World Bank Human Capital Index (HCI) was launched in October 2018 as part of the Human Capital Project (HCP), a flagship World Bank initiative to accelerate progress in human capital outcomes around the world. The HCI measures the human capital that a child born today can expect to attain by her 18th birthday, given the risks of poor health and poor education prevailing in her country. 1 The HCI brings together indicators of health (child survival rates, stunting rates, and adult survival rates) and indicators of the quantity and quality of schooling (expected years of school, and international test scores). Using estimates of the economic returns to education and health, the components are combined into an index measuring the expected productivity as a future worker of a child born today, relative to the benchmark of complete education and full health. The index ranges from zero to one, and an HCI value of implies that a child born today will only be × 100 percent as productive as a future worker as she would be if she enjoyed complete education and full health. By benchmarking shortfalls in future worker productivity due to current gaps in human capital outcomes among the young across countries, the HCI has underscored the urgency of accelerating progress in human capital outcomes and has been instrumental to elevating World Bank policy engagement around investments in human capital. 2 The HCI covers 157 countries at the national level and is calculated using national averages of its component data. While the comparison of such national average human capital outcomes across countries is important, it masks significant differences across groups within a country, particularly between richer and poorer households. In this paper, we shed light on these inequalities by developing a disaggregation of the HCI by socioeconomic status (SES) . Socioeconomic inequality in the distribution of human capital can reflect the presence of financial and access barriers to investing in human capital and 1 The HCI was introduced in World Bank (2018a,b) , and the methodology of the HCI is detailed in Kraay (2019) . 2 The global HCI, as well as the HCI disaggregated by socioeconomic status developed in this paper, both measure the expected future human capital of children born today under the assumption that they experience currentlyprevailing risks of poor health and poor education faced by children aged 0-17. For terminological convenience we refer to this as \"human capital\" or \"human capital outcomes\" for short. However, we emphasize that this is a measure of the expected future increment to the stock of human capital of a country (defined as the productive capacity attributable to health and education of the entire workforce), and not the stock of human capital itself. 5 This paper is organized as follows. Section 2 provides a brief overview of the components and aggregation methodology of the existing national-level HCI, and readers familiar with the HCI methodology can skip this section. Section 3 describes the component data sources of the SES-HCI.\nSection 4 calculates the SES-HCI by quintiles and documents the differences between the average (across quintiles) of the SES-HCI and the HCI. Section 5 contains our main findings, documenting patterns in inequalities in human capital outcomes within and between countries. Section 6 concludes."}, {"section_title": "A Recap of the HCI", "text": "The HCI measures the quantity of human capital that a child born today can expect to attain by age 18, given the risks of poor health and poor education that prevail in the country where she lives. 7 The HCI is designed to highlight how improvements in current health and education outcomes shape the productivity of the next generation of workers, assuming that children born today experience over the next 18 years the educational opportunities and health risks that children in this age range currently face.\nThe HCI measures key points along the trajectory from birth to adulthood of a child born today.\nIn the poorest countries in the world, there is a significant risk that the child does not even survive to her fifth birthday. Even if she does reach school age, there is a further risk that she does not start school, let alone complete the full cycle of 14 years of school from pre-school to Grade 12 that is the norm in rich countries. The time she does spend in school may translate unevenly into learning, depending on a variety of factors including the quality of teachers and schools she experiences. When she reaches age 18, she carries with her lasting effects of poor health and nutrition in childhood that limit her physical and cognitive abilities as an adult.\nThe HCI quantifies the key stages in this trajectory and their consequences for the productivity of the next generation of workers, with three components:\nComponent 1: Survival from birth to school age, measured using under-5 mortality rates.\nComponent 2: Expected Years of Learning-Adjusted School, combining information on the quantity and quality of education. The quantity of education is measured as the expected number of years of school a 6 child can expect to obtain by age 18 given the prevailing pattern of enrollment rates across grades. The quality of education reflects ongoing work at the World Bank to harmonize test scores from major international student achievement testing programs. 8 These are combined into a measure of qualityadjusted school years using the \"learning-adjusted years of school\" conversion metric proposed in the 2018 World Development Report. 9 Component 3: Health, which in the absence of a single broadly-accepted, directly-measured, and widelyavailable metric, is captured by two alternative proxies: (i) adult survival rates, defined as the fraction of 15-year-olds that survive until age 60, and (ii) the rate of stunting for children under age 5. Adult survival rates can be interpreted as a proxy for the range of fatal and non-fatal health outcomes that a child born today would experience as an adult if current conditions prevail into the future. Stunting is broadly accepted as a proxy for the pre-natal, infant and early childhood health environment, and so summarizes the risks to good health that children born today are likely to experience in their early years -with important consequences for health and well-being in adulthood.\nThese three components are converted into contributions to productivity relative to benchmarks of complete education and full health. Multiplying these contributions to productivity gives the overall HCI. The resulting index ranges between 0 and 1. A country in which a child born today can expect to achieve both full health (no stunting and 100 percent adult survival) and full education potential (14 years of high-quality school by age 18) will score a value of 1 on the index. Therefore, a score of 0.70 signals that the productivity as a future worker for a child born today is 30 percent below what could have been achieved with complete education and full health. Because the theoretical underpinnings of the HCI are in the development accounting literature, the index is linked to real differences in how much income a country can generate in the long run. If a country has a score of 0.50, then the gross domestic product (GDP) per worker could be approximately twice as high if the country reached the benchmark of complete education and full health. 10 7 3. SES-Disaggregated Data for the SES-HCI"}, {"section_title": "Overview of Data Sources", "text": "To construct the SES-HCI, we require SES-disaggregated data on mortality rates among children under 5, stunting rates among children under 5, school enrollment rates by age, and harmonized test scores. We obtain the first three indicators from Demographic and Health Surveys (DHS) and Multiple Indicator Cluster Surveys (MICS). Both are nationally-representative household surveys that collect data on measures of population, health and nutrition. The DHS program has fielded over 400 surveys across 90 countries, while over 300 MICS have been carried out in more than 100 countries. Many (but not all) DHS and MICS datasets include birth histories (used to calculate child mortality rates); school attendance rates by age (used to calculate expected years of school); and anthropometric data (used to calculate stunting rates among children under the age of 5). Crucially, the DHS and MICS also contain information on household characteristics and asset ownership, and there is an accepted methodology for combining these into a wealth index. This wealth index can be used to disaggregate child mortality, school attendance, and stunting by SES quintile. 11 We obtain this data by drawing on two existing compilations of DHS and MICS data disaggregated by SES quintile. SES-disaggregated school enrollment data by age come from the latest update to the household wealth and educational attainment dataset first described in Filmer and Pritchett (1998) . The latest version of their dataset contains 345 DHS and MICS surveys, with enrollment rates for 99 countries over the period 1990-2017. 12 The SES-disaggregated under-5 mortality rates and stunting rates come from the latest edition of the Health Equity and Financial Protection Indicators (HEFPI) database, described in Wagstaff, Eozenou, Neelsen and Smitz (2019) . The database assembles information from multiple survey programs, including the DHS and MICS that are used in this analysis, and reports health outcome and health care usage indicators disaggregated by SES quintiles for a large cross-section of countries. Both datasets calculate the SES index in the same way, using principal component analysis to 11 In the DHS/MICS context, these indexes are usually referred to as \"wealth\" or \"asset\" indexes. As discussed below, international testing program databases construct conceptually similar indexes but use terms such as \"economic, social and cultural status (ESCS)\" -as used in the PISA assessments, for example. For terminological convenience, we refer to all of these measures generically as \"socioeconomic status (SES)\" indexes. 12 Filmer, Deon. 2018 The final ingredient in this exercise is harmonized test score data disaggregated by SES. We obtain this data from Abdul-Hamid and Iqbal (2019) , who in turn draw on the same database of student-level harmonized test scores used in the 2018 HCI, as described in Patrinos and Angrist (2018) . This database harmonizes test scores from seven major international and regional student achievement testing programs into common units, resulting in \"harmonized learning outcomes (HLO)\" covering over 160 countries since 2000. As discussed in more detail below, Abdul-Hamid and Iqbal (2019) develop proxies for the SES of the households in which each student resides, based on data collected by the testing program on students' home possessions, as well as parental education and occupation. We obtain average harmonized test scores by centiles of the SES index for all tests converted into HLO units, and as discussed below we use these detailed centile distributions to align quintiles of test takers with quintiles of households in the DHS and MICS.\nThe DHS/MICS are typically carried out approximately every five years in a given country, although the timing and frequency of surveys varies considerably across countries. Similarly, each of the major testing programs adheres to its own cycle and covers different sets of countries. To create the sample of countries and years for this paper, we align data from DHS/MICS surveys with testing datasets in two stages. First, we create a single cross-section of 51 countries, using the most recently-available DHS/ MICS, and testing data available. In this first stage, we require the gap between the DHS/MICS and the testing data to be no more than ten years. Second, for countries with more than one DHS/MICS and more than one test, we create a panel dataset by matching each available DHS/MICS with the nearest available testing program. In this second stage, we limit gaps between the DHS/MICS and the testing data to no more than five years, and we never assign the same testing data to more than one DHS/MICS. That is, we align data to ensure a gap of no more than five years, with no survey or assessment being used more than once. 13 See for example documentation of the methodology for the DHS wealth index in Rutstein and Johnson (2004) . Filmer and Pritchett (1998) show that the asset index is strongly correlated with more traditional welfare indicators such as household-size-adjusted consumption expenditures in datasets where both can be constructed. They also show that the asset index works as well as, or better than consumption expenditures as a proxy for longrun household wealth in predicting children's school enrollment. In related, Filmer and Scott (2011) study LSMS data from 11 countries and find weaker correlations of rankings of households based on per capita expenditure versus based on asset indexes, but nevertheless conclude that analyses of inequalities in education and health outcomes tend to be quite robust to the use of either measure."}, {"section_title": "9", "text": "This approach to aligning DHS/MICS with testing program data gives us a sample of 88 countryyear observations covering 51 countries. Appendix Table A1 describes the country coverage of the HCI socio-economic disaggregation sample by region and income group. Low-income and lower-middleincome countries comprise the majority of observations, reflecting the DHS/MICS coverage. Appendix Table A2 list the full set of 88 country-year observations in our dataset and indicates the timing and source of all the component data. In the remainder of this section, we discuss each of the SES-disaggregated components of the SES-HCI in more detail, and briefly summarize differences between SES-HCI data sources and the data sources used in the national-level HCI. Throughout we will frequently refer to Table   1 which reports summary statistics for the components of the SES-HCI by SES quintiles."}, {"section_title": "Probability of Survival to Age 5", "text": "The probability of survival to age 5 is calculated as the complement of the under-5 mortality rate.\nThe under-5 mortality rate is the probability of a child born in a specified year dying before reaching the age of 5 if subject to current age-specific mortality rates and is frequently expressed as a rate per 1,000 live births. For SES-HCI, under-5 mortality rates are obtained from the HEFPI database and are calculated using the same life-table synthetic-cohort probability method employed in DHS reports and programmed in the Stata module SYNCMRATES (Masset 2016) . Survey-based mortality rates rely on birth histories in the five years prior to the survey 14 , and consequently report average rates for this period. Summary statistics on child survival rates by quintile are reported in the first panel of Table 1 . The top panel of against log GDP per capita (on the horizontal axis) for the most recent cross-section of 51 countries. Child survival rates range from around 0.85 in the poorest countries to around 0.98 in the richest countries in this sample. The range of outcomes within countries is wide as well, particularly in the poorest countries."}, {"section_title": "10", "text": "In Burkina Faso for example, child survival averages 0.82 in the lowest quintile and 0.91 in the highest quintile, a range that is nearly three-quarters as large as the cross-country range.\nIn the bottom panel of Figure 1 we plot the national average of child survival rates as used in the SES-HCI against those used in the HCI. The data used in the HCI come from annual estimates of child mortality constructed by the UN Interagency Group for Child Mortality Estimates (UN-IGME). UN-IGME compiles all available nationally representative data relevant to the estimation of child mortalityincluding data from vital registration systems, population censuses, household surveys and sample registration systems -and calculates mortality rates, making adjustments for data quality if needed. 15 In practice, in many low-income countries in our sample where vital registries are weak, DHS/MICS are an important data source for UN-IGME. Overall, therefore, national averages of child survival rates obtained directly from the UN-IGME (as used in the HCI) and those obtained from the HEFPI dataset (as used in the SES-HCI) are highly correlated. One further consideration in comparing the SES-HCI versus the global HCI data is that the global HCI used UN-IGME data for 2017, while the SES-HCI data refers to the year of the underlying DHS/MICS, which frequently is several years older than 2017. Since child survival rates in the UN-IGME data trend upwards for most countries, this means that the SES-HCI data (which comes from earlier years) on average shows slightly lower child survival rates than the global HCI data for the same country. Consistent with this, three countries that are the largest outliers in this graph (Burkina Faso, Burundi and Niger) are also countries where the SES-HCI data are relatively old (2010, 2010, and 2012 respectively)."}, {"section_title": "Expected Years of School", "text": "Expected years of school is defined as the number of years of school that a child can expect to attain over a given age range if she experiences currently-observed enrollment patterns. It is measured as the sum of age-specific enrollment rates over the age range of interest. We implement this calculation using DHS/MICS data on school attendance (not enrollment) by age, disaggregated by SES quintiles, as constructed in the latest version of the database originally presented in Filmer and Pritchett (1998) . They rely on DHS/MICS questions which gather information on whether individuals between the ages of 6 and 11 24 attended a given grade or level of education at least one day during the academic reference year. 16 For the SES-HCI, we sum the SES-quintile-averaged attendance rates across ages 6-17 to arrive at a measure of expected years of school, with a maximum possible of 12 years. Summary statistics on expected years of school by quintile are reported in the second panel of Table 1 . In parallel with the analysis for child survival, the top panel of Figure 2 There are significant conceptual and practical differences between the measure of expected years of school based on survey data that we use in the SES-HCI and the corresponding measure used in the global HCI calculations. First, the global HCI calculates expected years of school from ages 4 to 17, for a maximum possible of 14 years, while the SES-HCI for reasons of data availability focuses on the 6-17 age range. 17 Second, the HCI uses administrative data on enrollment rates, adjusted for repetition where possible, by four levels of school (pre-primary, primary, lower secondary, upper secondary) to proxy for age-specific enrollment rates within these brackets. This difference in the type of data introduces a plethora of potential sources of discrepancies between the resulting measure of expected years of school.\nConceptually, attendance and enrollment are different since not all children who are enrolled attend school. The DHS/MICS survey data does not provide information on whether a child is repeating the grade of school she is currently attending, while administrative data permits adjustment for repetition.\nAdministrative data may be collected by school officials who have incentives to over-report enrollment in order to obtain greater school financing. These differences are readily apparent in the bottom panel of 16 The DHS questions are typically: 1) Did [NAME] attend school at any time during [REFERENCE ACADEMIC YEAR] school year? 2) During (this/that) school year, what level and grade is/was) [NAME] attending? 17 DHS and MICS surveys have collected information on children 5 and younger only in recent years, and the data on pre-primary schooling is still less than fully consistent across a large sample of countries. Figure 2 , which plots the SES-HCI measure of expected years of school (on the vertical axis) against the corresponding HCI measure (on the horizontal axis). The absolute difference between the two measures is less than one year for 23 countries, and less than 1.5 years for 36 countries. While there are many factors contributing to these differences, two key offsetting ones are worth noting in this context. On the one hand, the SES-HCI measure of expected years of school is lower than the corresponding measure in the global HCI because the latter includes up to two years of pre-primary education while the former does not. On the other hand, the household survey-based data in the SES-HCI suggests higher rates of school participation than do administrative enrollment data for lower-and upper-secondary school. In contrast, administrative and household data on primary schooling tend to be better aligned in our sample.\nShedding new light on the relative importance of these (and many other potential) sources of such discrepancies is beyond the scope of this exercise. Rather we simply note that these differences are present and limit the comparability of the expected years of school measure between the SES-HCI and the HCI. Importantly, these discrepancies suggest a significant long-term measurement agenda to better measure school participation, particularly in the poorest countries where administrative data is likely to be the weakest."}, {"section_title": "Harmonized Test Scores", "text": "In the SES-HCI, we follow the HCI in using data on harmonized learning outcomes (HLO) to adjust expected years of school for quality. We draw on the student-level test score data in the HLO database used in the HCI, as described in Patrinos and Angrist (2018) . These authors assemble data from seven international testing programs and develop a methodology to convert these into common units. The HLO is measured in Trends in International Mathematics and Science Study (TIMSS)-equivalent units, where 400 corresponds to minimum proficiency and 625 is advanced attainment. Abdul-Hamid and Iqbal (2019) develop SES indexes for the households in which the children taking the test live, based on data collected by each testing program on students' home possessions as well as the educational and occupational status of the students' parents. 18 We are grateful to these authors for kindly providing to us the distribution of 18 The student-level SES index available in international testing programs typically is based on some combination of measures of (a) parents' highest level of education, (b) parents' occupation, and (c) a list of household possessions. Abdul-Husein and Iqbal (2019) draw on existing SES indexes provided by Programme for International Student Assessment (PISA), Southern and Eastern Africa Consortium for Monitoring Educational Quality (SACMEQ), and the 2014 round of Program of Analysis of Education Systems (PASEC)). They then apply similar methodologies to data on student characteristics to calculate student-level SES indexes for Progress in International Reading Literacy Study (PIRLS), Trends in International Maths and Science Study (TIMSS), Latin American Laboratory for Assessment test scores by SES, in the form of average test scores within each SES centile, separately for all country x test x subject x grade x year groupings represented in their dataset. We then average these across subjects, grades, and tests using the same rules that were used in the HCI to obtain country x year HLO scores by centile of the SES distribution.\nTo combine the DHS/MICS data with test scores, we make the crucial (and unavoidable) assumption that the ordering of households in the SES index in the test score database is the same as the ordering of households in the SES index in the DHS/MICS data. With this assumption, we can estimate average learning outcomes for children in each SES quintile of the DHS/MICS data. To do so, however, we have to address one further complication, which is that the SES distribution of test score data by construction covers only the households of children who are attending school (since the HLOs are calculated using only school-based tests), while the DHS/MICS data covers all households, including those whose children do not attend school.\nWe address this complication by \"merging\" the DHS/MICS data on attendance by age and SES quintile with the distribution of HLO scores by SES centiles. Consider for example a country where the test scores are taken from PISA, which is administered to 15-year-olds. We use enrollment rates for 15-yearolds by SES quintile in DHS/MICS to calculate the fraction of students attending school associated with each SES quintile in the DHS/MICS. For example, if students in the bottom SES quintile are more likely to drop out of school, then students in the bottom quintile might for example represent only 15 percent of test takers even though they account for 20 percent of households. In this case, we assign the average HLO score for the poorest 15 percent of test takers (according to the SES index in the test score data) to the households in the poorest quintile in the DHS/MICS. We apply a similar approach for each quintile to arrive at average HLO scores for each DHS/MICS quintile. countries. HLOs vary widely across countries: in the poorest countries such as Niger, Chad or Mali, the of the Quality of Education (LLECE), Early Grade Reading Assessments (EGRA), and pre-2014 rounds of PASEC. They combine this with student-level data on harmonized test scores developed in Patrinos and Angrist (2018) as used in the global HCI to arrive at SES-disaggregated SES scores. We are grateful to the authors for providing distributions of harmonized test scores by centiles of the wealth distribution required for our calculations described below. average student has an HLO score around 300, well below the TIMSS standard of minimum proficiency of 400. In contrast, in richer countries such as Vietnam, Moldova or Turkey, average test scores fall in the 450-500 range. As with the previous indicators, the range of outcomes within some countries is wide as well. Moreover, in contrast to the SES-HCI components discussed in the previous subsections, it is visually apparent from the top panel of Figure 3 that dispersion in test scores on average tends to be larger in richer countries in our sample. However, as discussed in more detail in Section 5.3, this pattern is to some extent an artifact of the methodology used to harmonize test scores.\nIn the bottom panel of Figure 3 we plot the national average HLO as used in the SES-HCI (on the vertical axis) against the national average HLO as used in the HCI. Since both come from the same underlying student-level test score data, the resulting differences are minimal, and are attributable to two factors. First, for some countries data required to calculate the SES index are missing for some students, and so the SES-HCI overall average HLO is based on a slightly different set of students than the HLO used in the calculation of the global HCI. Second, in some cases it was not possible to obtain the distribution of test scores by SES centile for the test that was used in the global HCI, and so we used a distribution of test scores for another test for the same country where the SES-centile disaggregation was available. 19"}, {"section_title": "Fraction of Children Under 5 Not Stunted", "text": "In the SES-HCI, the health component is based on one indicator, the fraction of children under 5 who are not stunted, which is the complement of the under-5 stunting rate. We obtain stunting rates disaggregated by SES quintile from the HEFPI database, where they are calculated using 2006 WHO growth standards. Specifically, children are defined as stunted if their height-for-age is more than two standard deviations below the WHO Child Growth Standards median. Child-level stunting prevalence is averaged across the relevant 0-5 age range to arrive at an overall under-5 stunting rate.\nSummary statistics on not-stunted rates are reported in the fourth panel of Table 1 . The top panel of Figure 4 shows the variation in stunting outcomes within and between countries. In some of the poorest countries in our sample, only half of children fall within the normal height range for their age, while in the richest countries in our sample over 90 percent of children do so. Gaps in stunting rates across SES quintiles are large in some countries: in Guatemala for example only around one-third of children in the bottom SES quintile are not stunted, while over 80 percent of children in the top SES quintile are not stunted.\nThe stunting data used in the global HCI exercise primarily comes from the UNICEF-WHO-World Bank Joint Malnutrition Estimates (JME) database. Since the DHS and MICS are among the primary data sources in the JME compilation, there are few differences in the stunting rates reported in the HEFPI and the JME databases. This is readily apparent in the bottom panel of Figure 4 , where the data from the two different sources align almost perfectly along the 45-degree line."}, {"section_title": "Calculating the SES-HCI", "text": "The SES-HCI is calculated following the methodology of the global HCI. The HCI measures the expected productivity as a future worker of a child born today, assuming that the child faces the same risks of poor health and incomplete education that current cohorts of children face. It is calculated as the product of three terms:\nwhere , ℎ and ℎ indicate the three components of the SES-HCI for each quintile . Each of the components is expressed relative to the benchmark of complete education and health and is defined as follows.\nChild survival is measured as the probability of survival to age 5, , relative to the benchmark of no child mortality over this age range, i.e. relative to the benchark of * = 1:\n(2)\nSchooling is measured as the contribution to worker productivity of learning-adjusted expected years of school. Expected years of school is calculated as described above, as the sum of enrollment rates by age between ages 6 and 17. The adjustment for learning follows the HCI methodology, and is described in Filmer, Rogers, Angrist and Sabarwal (2018) . It consists of discounting expected years of school by the ratio of observed HLO scores relative to the TIMSS international benchmark for high achievement of 625.\nFor example, this means that a year of schooling obtained by a child who scores 300 is \"worth\" only half as much as a year of schooling obtained by a child who scores 625. Years of school are converted into contributions to worker productivity using a central estimate of the labour market return to schooling, which is = 0.08 or 8 percent per additional year of school. Finally, this is expressed relative to the benchmark level of worker productivity corresponding to a full 12 years of high-quality school resulting in a test score of 625, i.e. a full 12 years of learning-adjusted school years: 20\nFinally, the health component of the SES-HCI relies on stunting as a proxy for the health risks faced by children. This is linked to future worker productivity through two steps. First, children who face health risks that are manifested in stunting are also likely to be below-normal stature as adults. Second, there is a large literature that measures the effects of childhood health shocks on adult health and earnings, by estimating the effect of adult height on earnings. The combination of these two effects suggests that a 10 percentage point reduction in stunting rates would raise productivity as a future worker by 3.5 percent, i.e. the \"return\" to reduced stunting is = 0.35. The benchmark of complete health corresponds to no stunting, or a not-stunted rate of 1. Putting these pieces together implies that the health component of the SES-HCI is:\nMultiplying together the three components results in the overall SES-HCI, which takes on values between zero and one, and represents the shortfall in expected productivity as a future worker of a child born today that is attributable to shortfalls in her expected health and education outcomes relative to the benchmark of complete high-quality education and full health.\nBefore turning to our main findings on gaps in SES-disaggregated human capital between and within countries, we first briefly summarize the differences between the global HCI and national averages of the SES-HCI. We calculate the national average of the SES-HCI by evaluating the HCI at the national averages of its four components. 21 Then in Figure 5 , we plot the national average SES-HCI (on the vertical axis) against the global HCI (on the horizontal axis). To isolate the first source of difference between the two, the global HCI on the horizontal axis is calculated using only stunting as the proxy for health, as is the case for the SES-HCI. As discussed in the previous section, national averages of child survival, stunting, and test scores used in the SES-HCI are very similar to their counterparts in the global HCI. This means that the differences between the SES-HCI and the global HCI displayed in Figure 5 are primarily due to differences in expected years of school as calculated from survey data (as in the SES-HCI) as opposed to administrative data (as in the global HCI). These differences are manifested in two different ways in Figure   5 . First, although the correlation across countries between the SES-HCI and the global HCI is high at 0.93, it is not perfect. This reflects the less-than-perfect correlation between expected years of school based on survey versus administrative data, as shown in the bottom panel of Figure 2 . Second, recall that the SES-HCI calculates expected years of school over a shorter 12-year age range (age 6-17), while the HCI considers a 14-year age range (age 4-17). This means that the dispersion in expected years of school across countries is smaller in the SES-HCI because it does not capture cross-country differences in preprimary school participation. Since the overall index values reflects gaps in human capital relative to the benchmark, these gaps also are smaller in the SES-HCI. This in turn means that the values of the SES-HCI are on average larger than in the HCI, as can be seen from the fact that nearly all countries are above the 45-degree line in Figure 5 . countries, shortfalls in health and education imply that productivity as future workers of children born today will only be 30 to 40 percent of what it could be had these children enjoyed complete education and full health, while in the best performing countries productivity will be 70 percent of what it could have been. As noted above, the SES-HCI covers primarily low and middle-income countries where DHS/MICS data are available. Although not strictly comparable for the reasons described above, we also"}, {"section_title": "Results", "text": ""}, {"section_title": "Differences in Human Capital Between and Within Countries", "text": "show the global HCI in Figure 6 (as light grey points), in order to help to visually situate the countries covered in the SES-HCI in the global distribution. Comparing these two measures, it is clear that the SES-HCI sample of countries represents roughly the poorest two-thirds of countries covered in the global HCI.\nThe most striking feature of Figure 6 is the large gaps in human capital within countries, as measured by the range between the SES-HCI in the top versus bottom quintiles (indicated as vertical ranges on the graph). These gaps are apparent across the income spectrum. For example, in Madagascar the SES-HCI ranges from 0.40 in the poorest quintile to 0.58 in the richest quintile, while in much richer\nVietnam the gap ranges from 0.58 to 0.85. In both cases, the within-country range between the top and bottom quintile is roughly half the size of the cross-country range between the highest and lowest country-average SES-HCI values in our sample.\nHow do these differences in human capital between richer and poorer people within a country contribute to overall differences in human capital around the world? To answer this question more systematically, we rely on a simple variance decomposition to quantify the relative importance of between versus within-country variation in the SES-HCI. Let ℎ denote the SES-HCI for quintile in country = 1, … , ; ℎ denotes the country average of ℎ ; and ℎ denotes the global average across countries of ℎ . Then the total variation (across quintiles and countries ) of human capital outcomes as measured by the SES-HCI can be written as:\nThe first term on the right-hand side reflects variation across quintiles and is the cross-country average of the within-country variance across quintiles of the SES-HCI. The second term represents the variation across countries in the country-level average SES-HCI. The first column of Table 2 presents the results of this variance decomposition for the HCI. It shows that 34 percent, or nearly one-third of the variation in human capital consists of differences between rich and poor groups within countries. The remaining columns of Table 2 unbundle this by performing the same variance decomposition on the components of the HCI. Differences in child survival and test scores across groups within countries account for a relatively smaller share of the overall variation in these outcomes across countries and groups: 21 and 23 percent, respectively. In contrast, within-country rich-poor gaps in expected years of school and stunting account for a considerably larger share of the overall variation in these outcomes, at 31 and 33 percent, respectively."}, {"section_title": "Human Capital-Income Gradients Between and Within Countries", "text": "In this section we document the relationship between human capital differences and income differences within and between countries. To do so, we require estimates of income differences across the SES quintiles for which the SES-HCI is calculated. Since the SES quintiles are based on wealth or asset indexes in the underlying DHS/MICS and test score data rather than an absolute measure of income, this requires a further assumption and additional data. We assume that the ordering of households according to the SES index in the DHS/MICS is the same as the ordering of households according to their income or consumption expenditures. 22 We draw on the World Bank's PovcalNet database to retrieve the quintile shares in income or consumption (depending on the type of survey available) for the nearest household survey to each of the country-year observations in our SES-HCI dataset. Appendix Table 2 documents the source year for these data. We then combine these quintile shares with real per capita GDP to calculate a proxy for average per capita income within SES quintiles. 23 Figure 7 shows the within-country gradients between log income and the SES-HCI across quintiles for the most recent cross-section of 51 countries. This gradient is of interest because it can be interpreted as a comparable measure of inequalities in human capital outcomes across income levels within a country.\nFor example, if the slope within a country is zero, it means that human capital outcomes are equalized across income groups, while if the slope is steep it means that human capital outcomes among the rich are much better than among the poor. To make the graphs legible, we divide the countries in our sample 22 Naturally this assumption is unlikely to be literally true. However, our goal is not to match individual households but rather to measure average incomes within each quintile. As long as most differences in the rank ordering of households by SES versus by income average out within quintiles, the quintile averages of income will be reasonable approximations. See also Filmer and Scott (2011) who document less-than-perfect rank correlations of income and SES indexes across individuals in a number of LSMS surveys, but nevertheless conclude that distributional analysis of health and education outcomes is robust to the use of either measure. Wagstaff and Watanabe (2003) arrive at similar conclusions, noting that analysis of socioeconomic inequalities in child malnutrition are broadly similar whether a measure of household income or an asset index is used. 23 Specifically, log average income in quintile = 1, … ,5 is calculated as ln �\nis the income or expenditure share of quintile . 20 into regional subgroups in the six panels of the graph. In each panel we plot log per capita income (on the horizontal axis) against the SES-HCI by quintiles (on the vertical axis). The five observations corresponding to the five quintiles for each country are connected by lines, and the slope of these lines shows the rate at which human capital increases with income across quintiles within countries. Not surprisingly, these lines are all upward-sloping, reflecting the pattern of higher income and higher human capital across SES quintiles. Interestingly, however, the slopes are generally fairly similar for most countries. To highlight the exceptions to this pattern, we identify the \"steepest\" and \"flattest\" country within regional grouping with green and red coloured lines. For example, in the top-left panel, the fairly flat green line for Haiti shows that Haiti has relatively small differences in human capital outcomes across SES quintiles despite quite large income differences across quintiles, while conversely the steep red line for Guatemala highlights its large differences in human capital outcomes across SES quintiles given its income inequality.\nHow do these within-country relationships between human capital outcomes and income levels compare with the corresponding pattern across countries? To answer this question, we pool the quintilelevel data on the SES-HCI and log income per capita for all 51 countries in our cross-section of most recent data, and then estimate a \"between\" and a \"within\" regression of the former on the latter. The \"between\" slope captures the relationship between country-level average income and average SES-HCI across countries, while the \"within\" slope captures the average slope of this relationship across quintiles within countries. The results are shown in Table 3 . For the full sample of 51 countries, the two slopes are remarkably similar, at 0.069 and 0.074, respectively. This finding is both surprising and somewhat discouraging. Redistributive and targeted policies within countries have the potential to reduce inequalities in health and education outcomes across income groups, while such redistribution is more difficult across countries. Thus, one might expect the within-country slope to be flatter than the betweencountry slope. In contrast, we find that the slopes are roughly the same, indicating that income-related differences in the HCI are on average as large within countries as they are across countries. Looking across columns in Table 3 , we find that roughly the same pattern holds across countries in sub-Saharan Africa, and separately within poorer and richer countries in our sample. In all four cases, the 95% confidence interval around the between-country slope comfortably includes the within-country slope across quintiles.\nIn the remainder of Table 3 , we unbundle this by estimating the same between and within regressions for the components of the SES-HCI. While the estimated slope coefficients are different across the different components of the SES-HCI (reflecting differences in the units of the underlying variables), 21 the same general pattern holds: in most cases the slope of the relationship between countries is similar to the cross-country slope. This indicates that on average, these specific human capital outcomes are as unequal across income groups within a country as they are across countries. The one exception to this pattern is child survival rates, where the within-country gradient with income consistently is smaller than the between-country gradient with income."}, {"section_title": "What Accounts for Within-Country Human Capital Differences Across SES Quintiles?", "text": "In this subsection, we document patterns in, and covariates of, rich-poor gaps in the SES-HCI and its components. In this subsection and the following, we define these gaps between the top and bottom quintiles in a specific way to facilitate interpretation of the relationship between rich-poor gaps in the overall SES-HCI and rich-poor gaps in its components. To motivate our approach, take the logarithm of the SES-HCI as defined in Equations (1)-(4) to arrive at the following expression: weights equal to one, = 0.08, and = 0.35 as discussed in Section 4. 24 In addition, to allow unbundling of rich-poor gaps in quality-adjusted expected years of school, we define gaps in expected years of school and harmonized test scores as differences in levels of these variables.\nIn Figure 8 , we plot the gaps between the top and bottom quintiles of the SES-HCI and its components against log GDP per capita for our most recent cross-section of 51 countries. This graph reveals quite clear patterns. Reading down the first column, Q5-Q1 gaps in expected years of school are smaller in rich countries than in poor countries. This is because school participation rates tend to be high in the richest quintile across all countries, while there are much more pronounced differences in school participation in the poorest quintile, that are narrower in richer countries. The opposite is true of test scores, where Q5-Q1 gaps tend to be larger in richer countries, although as discussed below this pattern needs to be interpreted with some caution. Combining these two patterns, the former dominates the latter, and Q5-Q1 gaps in quality-adjusted years of school tend to be smaller in rich countries than in poor countries. In the second column of Figure 8 , we see that Q5-Q1 gaps in child survival and stunting both tend to be lower in rich countries than in poor countries. As with expected years of school, this is due to a much stronger improvement in these outcomes in the poorest quintile as we move from poorer to richer countries. Finally, the bottom-right panel of Figure 8 shows the pattern in Q5-Q1 gaps for the (log) SES-HCI. As noted above, this pattern will reflect the weighted sum of the patterns for Q5-Q1 gaps in (log) child survival, quality-adjusted years of school, and stunting. These combine into a modest downwardsloping pattern, with smaller Q5-Q1 gaps in richer countries than in poorer countries.\nTo assess the statistical significance of these correlations, the odd-numbered columns of Table 4 report the OLS regressions corresponding to the scatterplots Figure 8 , a regression of the Q5-Q1 gap in the SES-HCI and its components on log GDP per capita, for the most recent cross-section of 51 countries.\nThe pattern of narrowing Q5-Q1 gaps in richer countries for child survival and expected years of school, as well as the pattern of widening Q5-Q1 gaps for harmonized test scores, are all statistically significant at conventional levels. However, the weak negative relationship between the Q5-Q1 SES-HCI gap and per capita GDP across countries is not significant. In the even-numbered columns of Table 4 , we further probe these cross-country patterns by including measures of country size (log population and log land area, 25 to allow for the possibility of larger Q5-Q1 gaps in human capital outcomes in larger countries) and income inequality (the log difference between the top and bottom quintile shares in income from the of inequality in health outcomes is less strongly correlated with the simple rich-poor gap we focus on in the paper, but nevertheless also yields broadly similar cross-country patterns that we discuss below. 25 These data are retrieved from World Bank (2019) .\nPovcalNet database discussed earlier, to allow for the possibility that Q5-Q1 gaps in human capital outcomes are larger in countries with higher income inequality). The partial correlation between country size and Q5-Q1 human capital gaps is positive in most cases, and significantly so for the overall SES-HCI and non-stunted rates when country size is measured as log population. Q5-Q1 gaps in human capital outcomes are larger in more unequal countries (with the exception of test scores where the correlation is negative but not significant). This intuitive pattern is statistically significant at the 10 percent level or better for the overall SES-HCI, child survival, and the not stunted rate. "}, {"section_title": "Changes over Time in Human Capital Gaps", "text": "In the previous sections, we have explored how gaps in human capital outcomes between better and worse-off households vary across countries, using our most recent cross-section of 51 countries. In this final section, we exploit the more limited panel dimension of our dataset to examine patterns within countries over time in SES-disaggregated human capital outcomes. To do so, we construct a sample of 24 \"spells\" covering the longest available time span for each country with two or more data points for the SES-HCI and its components. To improve over-time comparability within each of these spells, we restrict attention to spells for which the first and last observation use data from the same testing program. For example, we only consider spells in which the first and last observations are both EGRAs. The full sample of country spells is indicated with highlighted rows in Appendix Table A2 . Spells are of varying length: the median spell is 9 years long, and the shortest and longest spells are 4 and 16 years, respectively. To make changes over time comparable across spells of different lengths, we define all changes as annual average changes over the length of the spell. In Table 5 "}, {"section_title": "Discussion and Conclusions", "text": "Inequalities in health and education may reflect barriers to optimal investments in human capital.\nThese inequalities matter intrinsically, and they also affect human capital accumulation of future generations and eventually the aggregate growth process. This paper builds on a large existing literature documenting these inequalities to construct an index of human capital of the next generation of workers, disaggregated by quintiles of socioeconomic status (SES-HCI). This measure follows the methodology of the World Bank global HCI that was launched in October 2018. The HCI measures the human capital that a child born today can expect to attain by her 18th birthday, given the risks of poor health and poor education prevailing in her country. 28 It is constructed by aggregating together indicators of health (child 26 survival rates, stunting rates, and adult survival rates) and of the quantity and quality of schooling (expected years of school, and international test scores) using the estimates of their economic returns.\nRelying on data from DHS/MICS surveys, we compute the SES-HCI for 51 mostly low-and middle-income countries.\nWe find that differences between socio-economic groups within countries are large, and that within-country variation accounts for roughly one-third of the total variation in human capital outcomes.\nIt is also important to note that our results focus on inequalities across quintile-average outcomes, rather than inequalities across individual-level outcomes, and therefore represent a lower bound on overall inequality in human capital outcomes across individuals. Overall, human capital outcomes increase with income, but when documenting how they do so within and between countries, we find a striking pattern:\nhuman capital outcomes increase with income across countries at roughly the same rate as they do within countries, across SES quintiles.\nOverall, the gap between human capital of the rich and of the poor decreases weakly with income.\nThis overall trend masks heterogeneity in the behavior of individual measures of human capital. For example, the rich-poor gaps in child survival and expected years of school narrows as countries get richer.\nIn contrast, rich-poor gaps in harmonized test scores tend to be higher in richer countries with higher test scores, although this latter finding is to some extent a consequence of the methodology used to harmonize test scores.\nFor a small set of countries, we are able to examine trends over time. We find some surprising evidence that improvements in country-level averages of human capital outcomes are slower in fastergrowing countries. However, these latter findings must be taken with a grain of salt, since our sample consist of only 22 countries where we have comparable data on all of the components of the SES-HCI at two points in time.\nMeasuring inequalities in health and education outcomes can be a powerful tool to better target investments in the human capital of those who need it the most. This work documents the existence of large inequalities in human capital across socio-economic groups. Our evidence suggests that countries, especially those where the rich-poor gap has the steepest gradient with income, could make significant improvements in human capital by targeting the most disadvantaged. This implies an important role for governments in easing the constraints faced by the most disadvantaged to increase their -and ultimately their countries' -human capital outcomes. Cash transfers can lessen financial constraints and thus support 27 better access to education and health services; targeted education policies can help to improve access to and quality of learning at all levels; universal health coverage can help prevent and better manage health shocks and the related financial consequences. Yet, we find no evidence that on average redistributive policies within countries, arguably more easily implementable than redistribution across countries, produce differential effects, because the rate at which inequalities in health and education outcomes are reduced with income is indistinguishable within and across countries. Thus, in addition to highlighting the urgent need to address inequalities in human capital outcomes, our work draws attention to the consonant need for more research on policies and programs that are effective at closing these gaps. Log Real GDP Per Capita at PPP"}, {"section_title": "Figure 7: Human Capital -Income Gradients Within Countries", "text": "Notes: This graph reports the within-country relationship across quintiles between the SES-disaggregated HCI and log per capita income. Per capita income in each quintile is approximated using the quintile share in income or consumption as reported in the PovcalNet database for the survey nearest to the SES-HCI data, together with GDP per capita as the mean. The upward-sloping lines in each panel trace out the five quintile values for each country. The heavy solid green line (heavy dashed red line) shows the country in each group with the flattest (steepest) withincountry gradient between the SES-HCI and log income per capita. Table 3 "}, {"section_title": ": Human Capital -Income Gradients Between and Within Countries", "text": "Notes: This table reports the slope coefficient from a regression of the SES-disaggregated HCI (first row) and its components (next four rows) on log per capita income. Regressions are estimated for all countries, for countries inSub-Saharan Africa, for countries in the richest half of the sample (High Income), and for countries in the poorest half of the sample (Low Income). Within each country grouping, the \"Within\" column reports the slope of the within-country regression across quintiles (i.e. a regression with country fixed effects), and the \"Between\" column reports the slope of the regression of country averages of the dependent variable on country averages of log per capita income. Per capita income in each quintile is approximated using the quintile share in income or consumption as reported in the PovcalNet database for the survey nearest to the SES-HCI data, together with GDP per capita as the mean. The full sample in the first two columns consists of the cross-section of the most recent observation for each country. Robust standard errors reported in parentheses below point estimates. * (**) (***) indicate significance at the 10 (5) (1) percent level."}, {"section_title": "Within Between Within Between Within Between Within Between", "text": "Human Capital Index 0.069*** 0.074*** 0.066*** 0.064*** 0.070*** 0.085*** 0.069*** 0.079** (0.002) (0.010) (0.003) (0.014) (0.003) (0.026) (0.003) (0.031)\nProbability of Survival to Age 5 0.017*** 0.031*** 0.019*** 0.019*** 0.015*** 0.020* 0.020*** 0.032** (0.001) (0.004) (0.002) (0.007) (0.001) (0.010) (0.002) (0.013) Notes: This table presents cross-country regressions of the Q5-Q1 gap in the SES-disaggregated HCI and its components on log GDP per capita, log population, log land area, and income inequality (measured as log difference between average income in the top versus bottom quintile, with per capita income in each quintile is approximated using the quintile share in income or consumption as reported in the PovcalNet database for the survey nearest to the SES-HCI data, together with GDP per capita as the mean). The Q5-Q1 gaps are defined as (a) the difference between the top and bottom quintiles for expected years of school, harmonized test scores, quality-adjusted years of school, and the notstunted rate, and (b) the log-difference between the top and bottom quintiles for child survival and for the overall HCI. The sample consists of the cross-section of the most recent observation for each country. Robust standard errors reported in parentheses below point estimates. * (**) (***) indicate significance at the 10 (5) (1) percent level.\n(1) (2) (3) (4) (5) (6) (7) (8) (9) (10) (11) (12) Log GDP per capita -0.022 -0.025* -0.009*** -0.010*** -0.900*** -0.944*** 17.622***17.637*** -0. Notes: This table reports the results of regressing the average annual change in the country-level average of the SES-HCI and its components on the average annual changes in log per capita GDP and inequality (even-numbered columns); and the results of regressing the within-country average annual change in the Q5-Q1 gap in the SES-HCI and its components on the average annual changes in log per capita GDP and inequality (odd-numbered columns). Changes are calculated over the longest-available time span for 22 countries with SES-HCI data at two points in time, and for which the initial and terminal period test scores come from the same testing program to ensure over-time comparability. The Q5-Q1 gaps are defined as (a) the difference between the top and bottom quintiles for expected years of school, harmonized test scores, qualityadjusted years of school, and the not-stunted rate, and (b) the log-difference between the top and bottom quintiles for child survival and for the overall HCI. Spells for two countries (Democratic Republic of Congo and Zambia) are excluded because they register very high average annual per capita GDP growth rates in excess of 10 percent per year over their respective spells, making them highly-influential in the regressions. * (**) (***) indicate significance at the 10 (5) (1) percent level."}, {"section_title": "Mean Gap Mean", "text": "Gap Mean Gap Mean Gap Mean Gap Mean Gap (1) (2) (3) (4) (5) (6) (7) (8) (9) (10) (11) (12) -0.111*** -0.031 -0.072*** 0.018 -1.413 -0.014 -40.328 -24.377 -1.554* -0.574 -0.102 -0.009 (0.038) (0.036) (0.020) (0.026) (0.946) (0.759) (29.886) (20.493) (0.760) (0.382) (0.064) (0.061) -0.051* 0.033 -0.018 0.020 -0.229 -0.352 -44.014 15.778* -0.799 -0.190 -0.048 0.079* (0.029) (0.036) (0.013) (0.016) (0.583) (0.526) (32.919) (9.001) (0.655) (0.380) (0.049) (0.038) Constant 0.009*** -0.002 0.006*** -0.002* 0.135*** -0.030 1.430 2.148*** 0.109*** 0.024 0.011*** -0.004 (0.001) (0.002) (0.001) (0.001) (0.037) (0.035) (1.291) (0.581) (0.033) (0.019) (0.003) (0.003) "}]