[{"section_title": "Abstract", "text": "Background. In the general population, accumulating data support a link between low testosterone levels and mortality by all causes, but especially by cardiovascular disease (CVD). Also, accelerated arterial stiffness has been recognized as an important cardiovascular risk factor. Here, we explored the association between testosterone levels and risk of death in male haemodialysis (HD) patients, whose arterial system is characterized by generalized stiffening. Methods. In this three-centre prospective observational study, 111 male HD patients after completion of baseline assessment, including measurement of male sex hormones and pulse wave velocity (PWV), were followed up for CVD and all-cause mortality. Results. Of the 111 patients studied, 54 were found with and 57 without testosterone deficiency, defined as testosterone levels <8 nmol/L. During a median follow-up period of 37 months, 49 deaths occurred, 28 (57%) of which were caused by CVD. Testosterone deficiency patients had increased CVD and all-cause mortality {crude hazard ratio: 3.14 [95% confidence interval (CI), 1.21-8.16] and 3.09 (95% CI, 1.53-6.25), respectively}, even after adjustment for age, body mass index, serum albumin and C-reactive protein, prevalent CVD and HD vintage. The association of testosterone with CVD mortality, but not with all-cause mortality, was lost after adjusting for PWV, an index of arterial stiffness. Testosterone levels were inversely related to PWV (r ¼ À0.441; P < 0.001). Conclusion. We showed that testosterone deficiency in male HD patients is associated with increased CVD and all-cause mortality and that increased arterial stiffness may be a possible mechanism explaining this association."}, {"section_title": "Introduction", "text": "A large number of studies have found an association between low serum testosterone levels and various cardiovascular disease (CVD) risk factors, including diabetes [1] and metabolic syndrome, hyperlipidaemia [2] , inflammation [3] , atherosclerosis [4] , endothelial dysfunction [5] and arterial stiffness [6] . In addition, a growing body of evidence links testosterone deficiency to all-cause mortality [7] and especially to cardiovascular mortality [8] [9] [10] [11] . Thus, continuously emerging epidemiologic data suggest that low testosterone levels may be used as a predictive marker in high-risk patients.\nHypogonadism is common among men on haemodialysis (HD), as approximately two-thirds of them have serum testosterone levels in the hypogonadal range [12, 13] . Hormonal abnormalities, including low free and total serum testosterone [13] , typically begin before end stage and are not corrected by dialysis therapy [14, 15] . The pathophysiology of gonadal dysfunction has not yet been elucidated, but the combination of primary testicular failure and secondary pituitary hypothalamic dysfunction along with other comorbidities, stress and drugs have been implicated in the pathogenesis of androgen deficiency in uraemic men [16] .\nChronic kidney disease (CKD) is associated with a significant burden of CVD risk factors [17, 18] . However, it is not clear yet whether testosterone deficiency is associated with excess risk for CVD death in end-stage renal disease (ESRD) men, as it has been described in healthy elderly men. In a study reported by Carrero et al. [19] , testosterone concentrations were inversely associated to mortality due to both CVD and all causes in a Swedish HD cohort, but this association was lost after adjusting for serum creatinine, a surrogate marker of muscle mass. In a recent Turkish study [20] of 420 prevalent HD men, although testosterone levels predicted all-cause mortality, this association was largely dependent on age. Previously, we provided evidence linking testosterone deficiency with increased carotid artery intima-media thickness, atherosclerotic plaque occurrence and reduced flow-mediated dilatation [21] . The findings of that study suggested that the adverse influence of low testosterone on the cardiovascular system in male HD patients may be mediated in part via the effects of testosterone on vascular structure and function. This notion is further supported by several population-based studies [22] [23] [24] , in which low testosterone levels were also found to be associated with increased atherosclerosis and arterial stiffness in elderly men. Indeed, arterial stiffness is established independent predictor of adverse CVD outcome [25] particularly in ESRD patients [26] . However, the way testosterone levels impact on arterial stiffening in uraemic patients remains largely unknown.\nWith this background, the current study was undertaken on male HD patients to examine (i) the possible effects of endogenous testosterone concentrations on CVD markers and especially on pulse wave velocity (PWV), a reliable measure of arterial stiffness, which has recently been incorporated into clinical assessment of patients [27] ; (ii) the relationship between testosterone deficiency and subsequent mortality due to all causes and CVD and (iii) the role of arterial stiffness in the association between testosterone levels and mortality."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Study population", "text": "The study was performed at the Greek dialysis units of the University Hospital of Heraklion, General Hospital of Chania and General Hospital of Chios. All patients receiving regular therapy in any of these three units were invited to participate. The exclusion criteria were as follows: HD treatment of <6 months, malignancy, overt endocrine disease, use of steroid hormones, antiandrogen treatment and documented history of prostate or testicular cancer before study enrolment. A total of 111 eligible male HD patients were recruited between October 2005 and December 2006. Preliminary data of the first 48 patients concerning the association of the cross-sectionally measured PWV with testosterone levels have been previously reported [(Abstract) Nephrol Dial Trans 2006; 21; (Suppl 4): MP389]. Enrolled patients were treated with HD three times a week for a minimum of 4 h using bicarbonate dialysate and high-flux (32%) or lowflux (68 %) dialysis membranes. The study protocol was approved by the Scientific Committee of the participating centres and signed informed consent was obtained from all patients.\nClinical data Each patient's medical chart was reviewed, extracting data pertaining to underlying kidney disease, history of CVD, diabetes, arterial hypertension, prescribed antihypertensive medications and lipid lowering agents (statins). Baseline CVD was defined as a medical history of myocardial infarction, angina pectoris, percutaneous coronary intervention and coronary artery bypass surgery, the development of symptoms (intermittent claudication and transient ischaemic attack), therapeutic interventions (revascularization and amputation) and artery stenosis >60% in imaging studies. Arterial hypertension was defined as systolic blood pressure >140 mmHg or use of antihypertensive treatment up to 6 months before enrolment. Clinical information collected at baseline for each patient also included age, duration of HD therapy, body mass index (BMI) and smoking habits."}, {"section_title": "Determination of carotid-femoral PWV", "text": "PWV measurements were performed, before blood sampling for hormone determination, in the supine position by the Pulse Trace 6000 system (MicroMedical Ltd, Kent, UK), as described previously [28] . Blood pressure was measured with a mercury sphygmomanometer before PWV measurement. Phases I and V of the Korotkoff sounds were taken as the systolic and diastolic blood pressures, respectively. Three measurements determined at 2-min intervals were averaged."}, {"section_title": "Assessment of sex hormones", "text": "Following recommendations of restricting testosterone measurements to morning hours [29] , because testosterone levels vary in a diurnal pattern [30] , all serum samples were obtained between 07:00 and 11:00 hours in a non-HD day and kept frozen at À70°C, if not analysed immediately. All hormone measurements were performed in the Nuclear Department of the University Hospital of Heraklion. Total testosterone and progesterone levels were measured using RIA kits (IM1119, IM1188, respectively) from Immunotech (Marseilles, France) and free testosterone levels were measured with the RIA kit DSL-4900 from Diagnostic Systems Laboratories Inc (Webster, TX).\nAccording to the recently published guidelines [29] , testosterone deficiency was defined as a total testosterone level <8 nmol/L and subjects were divided into two groups, those with and those without testosterone deficiency. Coincidentally, the median testosterone value in our study was 8.1 nmol/L."}, {"section_title": "Laboratory analyses", "text": "Serum calcium, phosphorus, total cholesterol, high-density lipoprotein (HDL) and low-density lipoprotein (LDL) cholesterol, triglycerides, albumin, C-reactive protein (CRP) and haemoglobin were measured routinely, at least once monthly and serum parathormone (PTH) at least quarterly, using standard laboratory techniques. The average of the last 6-month laboratory data were used for analysis."}, {"section_title": "Follow-up", "text": "Follow-up began on the date of enrolment and finished upon the death from all causes or 31 December 2009, whichever came first. No patient was lost to follow-up and all deaths were accurately recorded by the attending nephrologists. Cardiovascular mortality was defined as death as a result of coronary heart disease, sudden death, stroke or complicated peripheral vascular disease."}, {"section_title": "Statistical analysis", "text": "For all statistical analyses, the SPSS/PC 18 statistical package (Chicago, IL) was used. Chi-square test was used for the analysis of categorical variables and Student's t-test for continuous variables, as appropriate. All continuous data were tested for a normal distribution (KolmogorovSmirnov test) before further statistical analysis. Non-normally distributed variables, including serum progesterone, PTH, CRP and HD vintage, were log transformed undergoing regression analyses.\nUnivariate and multivariate regression analysis were used to test the associations of variables related to serum testosterone and PWV. Survival analysis was performed by using the Kaplan-Meier survival curves. Hazard ratios (HR) of all-cause and CVD mortality were analysed using univariate and multivariate Cox proportional hazards regression. All variables were expressed as mean AE SD or as median (interquartile range). Statistical significance was set at the level of P < 0.05 (two sided)."}, {"section_title": "Results", "text": ""}, {"section_title": "General characteristics", "text": "The study cohort consisted of 111 patients with a mean age of 65 AE 12 (range 28-85) years. CVD and hypertension were detected in 63 (56.8%) and 56 (50.5%) patients, respectively. Forty-three patients were on antihypertensive drugs [b-blockers, n ¼ 23; calcium channel blockers, n ¼ 26 and angiotensin-converting enzyme inhibitors/angiotensin receptor blockers, n ¼ 25]. Forty patients were statin users and 28 current smokers. There were no significant differences in patient characteristics between the different centres."}, {"section_title": "Patients with versus without testosterone deficiency", "text": "Fifty-four patients (49%) had testosterone deficiency, as defined in the Materials and methods section, and 57 (51%) patients were not testosterone deficient. The general characteristics of the two groups are shown in Table 1 . Men with testosterone deficiency were older, had a longer HD vintage, higher BMI and showed an increased prevalence of diabetes and CVD at baseline. Of note, patients with testosterone deficiency had a 2.9 [95% confidence interval (CI) 1.2-7.4] greater odds of having CVD at baseline compared to those without, even after adjustment for age, HDL cholesterol, history of hypertension, BMI and diabetes mellitus (data not shown). Serum phosphorus, LDL cholesterol, CRP, PWV and pulse pressure were also increased in testosterone-deficient patients, while free testosterone and progesterone were decreased. There were no differences between the two groups with regard to prevalence of hypertension, smoking status, cause of ESRD, antihypertensive agent class or statin use (data not shown)."}, {"section_title": "Relationships of testosterone with baseline characteristics", "text": "After adjusting for age, total testosterone levels were associated with more risk factors than free testosterone and the associations were generally stronger ( Table 2) . After Bonferroni correction for multiple comparisons, only the correlation of total testosterone with PWV, body weight, CRP and free testosterone were statistically significant. HD vintage was inversely correlated with progesterone (r ¼ À0.207; P < 0.05). In multiple regression analysis, CRP, body weight, age, HD vintage and diabetes were negative predictors of total testosterone levels ( Table 3) ."}, {"section_title": "Determinants of PWV", "text": "Total testosterone levels were inversely related to PWV (r ¼ À0.441; P < 0.001). The results of forward stepwise multivariate analysis showed that total testosterone levels, systolic pressure, LDL cholesterol, calcium-phosphorus product and age were independent determinants of PWV (Table 4) . Examination of the standardized (beta ¼ À0.294) and partial correlation (r ¼ À0.323) coefficients, indicated that testosterone was the strongest determinant of PWV. Together, these five variables explained 35% of the variance in PWV, whereas the contribution of testosterone alone to the variance of PWV was~20%."}, {"section_title": "Testosterone and mortality", "text": "During a median follow-up period of 37 months, 49 deaths occurred, 28 (57%) of which were cardiovascular. Unadjusted Cox proportional hazards regression analysis showed a 3-fold increase in all-cause and CVD death in the testosterone-deficiency group (Table 5) . After adjustment for age, BMI, CVD at baseline, HD vintage, serum albumin and CRP, testosterone-deficient men continued to have a greater mortality risk. However, further adjustment for PWV resulted in a considerable loss of the significance of the association of testosterone levels with CVD, but not with all-cause mortality. All the above factors that were entered as covariates into the multivariate models were univariately significant (all P < 0.05) predictors of CVD mortality, except for HD vintage, which was included as covariate for further investigation of its role.\nGiven that a clinical cut-off point for assessing mortality in ESRD patients has not yet been uniformly adopted, we divided total and free testosterone distributions into tertiles to determine the optimal threshold for increased mortality effect in our sample population. Cut-offs of the tertiles for total testosterone were 5.2 and 12.8 nmol/L and for free testosterone 0.21 and 0.33 nmol/L, respectively. KaplanMeier survival analysis by tertile of plasma total testosterone levels revealed that low testosterone levels was associated significantly with both CVD (P ¼ 0.027) and all-cause (P ¼ 0.001) mortality ( Figure 1) . Next, total and free testosterone levels were examined by Cox regression as dichotomous variables comparing the lowest tertile to all higher ( Table 6 ). The unadjusted and adjusted risk of CVD and allcause mortality was significantly elevated for men in the lowest tertile of the total (<5.2 nmol/L) and free (<0.21 nmol/L) testosterone distributions compared with those in the highest tertiles. However, adjustment for PWV attenuated the CVD, but not all-cause mortality association with low testosterone levels using either total or free measures. Finally, when both free and total testosterone were entered as independent variables in the adjusted (including PWV) Cox model of all-cause mortality, only low total testosterone levels (<5.2 nmol/L) were associated with a higher risk of all-cause mortality [HR 3.27 (95% CI 1.25-8.56)]."}, {"section_title": "Discussion", "text": "The present study showed that male HD patients with total testosterone levels <8 nmol/L displayed significantly increased risk of all-cause and CVD mortality as compared to those with higher hormone levels. This low-testosterone mortality relationship remained significant even after adjustment for age, BMI, serum albumin and CRP, baseline CVD and HD vintage. However, after adjusting for PWV, testosterone lost its prognostic value for CVD death, but not for all-cause death, thus implicating altered arterial stiffness as a candidate underlying mechanism for this observed association. In this regard, our results clearly indicated that the enhanced progression of arterial stiffening in uraemia could be further substantially accelerated by the According to the currently accepted definition of testosterone deficiency [29] , 49% of our cohort patients were hypogonadal. The proportion of patients with hypogonadism, defined as testosterone levels <10 nmol/L, were 66% in a Turkish [20] and 44% in a Swedish [31] ESRD cohort. The reasons why hypogonadism is so widespread among men with ESRD are far from clear [16, 32, 33] . However, a previous study [34] demonstrated that the dialytic clearance of testosterone is negligible, thus indirectly indicating that reduced production of testosterone is the major abnormality in ESRD. In this context, our results clearly demonstrated that in the uraemic milieu, suppression of androgen biosynthesis starts at early steps in steroidogenesis, as evidenced by the inverse correlation of progesterone with HD vintage, and continues with a progressive decline in testosterone over time. Another pertinent observation of this study was that CRP levels emerged as the most important independent determinant of testosterone levels (Table 3) , confirming the strong negative association between various inflammatory biomarkers and testosterone levels found in healthy elderly men [3, 35] and ESRD patients [19, 20, 31] . Given that our cross-sectional data cannot answer whether reduced testosterone is a cause or a consequence of inflammation [36] , the temporal sequence of causality is needed to be addressed in further longitudinal studies.\nThe most important findings of this study were that male HD patients with androgen deficiency (total testosterone < 8 nmol/L) or testosterone in the lower tertile (<5.20 nmol/L) had an increased risk of mortality due to all causes and specifically to CVD causes. Thus, our findings are consistent with most [8] [9] [10] [11] [12] , but not all [37] , of the previous studies undertaken in non-renal patients. In addition, hypogonadal patients had a higher prevalence of CVD, further implicating testosterone in the pathophysiology of vascular disease. The first of the two studies that examined the association of testosterone levels with mortality in male HD patients [19] was comparable to ours with regard to sample size, age of patients, duration of follow-up, blood sampling time, testosterone cut-off point for assessing mortality (< 8.1 nmol/L) and amplitude of the association between low serum testosterone and CVD mortality (unadjusted and adjusted HR 3.19 and 2.47, respectively). Muscle depletion was identified as the potential mechanism underlying the low-testosterone CVD (and all-cause) mortality association. In our study, we did not adjust for muscle depletion, so we cannot further comment on it. However, although the low-testosterone CVD mortality association was dependent on PWV, the association of low serum testosterone with all-cause mortality remained robust even after adjustment for a number of potential confounders, including PWV. Although we cannot exclude residual confounding from other factors not measured here, these findings directly implicate testosterone deficiency in the increased risk of mortality from all causes among male HD patients.\nIn the other relevant study reported by Gungor et al. [20] , the inverse association detected between serum testosterone and all-cause mortality was largely dependent on age. There are several possible explanations for these results. Firstly, the proportion of deaths was much lower in the Turkish cohort (24.8%) than in ours (44.1%), reflecting the almost 11-year older average age of our patients (65 versus 54 years). Thus, the importance of low testosterone for survival may become increasingly important as men age, as it has also been shown in previous large population-based studies [8, 9] . Secondly, considering the welldocumented diurnal variation in serum testosterone [30] , the untimed collection of blood samples in the Turkish study might have introduced some circadian variation in testosterone levels, which reduced the ability to detect associations [8] . Thirdly, the authors of that study unfortunately did not explore the predictive impact of testosterone levels on CVD mortality, and this possibility cannot be excluded from their study.\nWe also examined whether free (the bioactive fraction) or total testosterone is a better predictor of death in our study cohort. Testosterone circulates in plasma freely (1-4%), weakly bound to non-specific proteins such as serum albumin or avidly bound to sex hormone-binding globulin (SHBG), consisting of the biologically inactive fraction of circulating testosterone. The purpose of the free testosterone determination is to correct the total testosterone concentration for the effect of variable binding by SHBG. SHBG levels in male HD patients, reportedly, were comparable to those found in eugonadal men [15] . In a study of 126 male HD patients [19] , both the SHBG and the testosterone levels were decreased and the free and bioavailable fractions remained decreased in a similar manner. In addition, the percentage of free to total testosterone was 2.4 and 2.3% in patients with and without testosterone deficiency, respectively. The corresponding percentages in our study were 4.6 and 2.2%, respectively. These findings indicate that uraemia per se is not associated with abnormalities in SHBG and thus, the percentage of free to total testosterone remains rather stable.\nIn this study, free testosterone levels <0.21 nmol/L were associated strongly with CVD and all-cause mortality. The HR for mortality were quite similar for total and free hormone levels. In several previous population studies [9, 38] , low total and free or bioavailable (free and albumin bound) testosterone levels were comparable predictors of subsequent mortality, whereas in others [39] , only low free testosterone predicted mortality. Of note, a multivariable model, in which we included both total and free testosterone, showed that only low total testosterone predicted allcause mortality. Overall, our data suggests that measuring free testosterone in addition to total testosterone is unlikely to improve prediction of mortality outcome beyond that offered by total testosterone alone. Testosterone deficiency appears to adversely affect mortality outcomes by influencing conventional CVD risk factors [40, 41] . However, there are studies supporting that increased arterial thickness [42] and arterial stiffness [22, 23] , expressing the morphological and functional vascular changes in atherosclerosis, respectively, may be the mechanisms by which hypotestosteronaemia itself may impact on cardiovascular end points. Testosterone deficiency may promote atherogenesis by impaired vasodilation, through decreased nitric oxide release or direct Ca21 antagonism in vascular endothelial and smooth muscle cells [40, 43] . Conversely, testosterone treatment may offer protection against endothelial dysfunction by reducing inflammatory factors [44] , increasing endothelial progenitor cell activity [45] and improving the coagulation process [46] . Androgens, apart from their action on vascular reactivity, can also influence structural elements within the arterial wall including collagen, elastin and fibrillin-1 and their regulators (metalloproteinases). In a relevant human model [47] , the elastin/ collagen ratio was >11-fold higher in the presence of 17b-estradiol and progesterone compared with testosterone. This was attributed to the fact that testosterone increased both gene and protein expression of metalloproteinase-3 relative to female hormones, which contributed to degradation of elastic matrix proteins. However, it is unclear whether the variation in large artery stiffness observed between sexes applies also in the uraemic state. Whatever the precise mechanism(s) linking testosterone deficiency to arterial stiffening, a number of human studies have clearly shown that low testosterone levels adversely impact vascular function and structure in the long run [4, 42] . In the Baltimore Longitudinal Study of Aging [22] , serum testosterone, obtained 5 years prior to the assessment of arterial properties, predicted the arterial stiffness index, suggesting a cause and effect relationship between low testosterone and the evolution of subsequent increased arterial wall rigidity. The strong inverse association between testosterone concentrations and PWV in ESRD patients, reported for the first time here, along with our observation that adjustment for PWV attenuated the effect of testosterone deficiency on CVD mortality, suggests that increased arterial stiffness might be the intermediate step in the association between testosterone and CVD mortality.\nWe recognize that this study had limitations. The small sample size and the low number of deaths may limit our findings, and need to be confirmed by further studies. Also, a causal relationship could not be established since low testosterone, apart from being a cause of death, may be merely the result of acute and chronic illnesses [48] and therefore associated with death. To minimize reverse causality by comorbidity, we excluded patients with a HD vintage <6 months since early mortality rate within 6 months of starting maintenance dialysis is very high [49] due to pre-existing multiple comorbid illnesses. Finally, hypogonadism was diagnosed on the basis of a single blood sample for testosterone, without considering clinical symptoms and signs. Nevertheless, because many of the signs and symptoms of hypogonadism are insidious in onset and can accompany normal aging and CKD, current guidelines advocate diagnosis of hypogonadism in HD patients on the basis of laboratory testing primarily [50] ."}, {"section_title": "Conclusions", "text": "In summary, we provide supportive evidence that androgen deficiency is associated with increased risk of CVD and all-cause mortality in male HD patients. Given that the association with CVD mortality was not maintained after controlling for PWV, we conclude that the arterial stiffness might be a potential mechanism underlying this association. Indeed, the data presented here provided substantial evidence of a strong adverse impact of low testosterone levels on arterial stiffness in ESRD patients. Randomized controlled studies are needed to definitely establish a causal relationship between low testosterone levels and mortality and ascertain the putative role for testosterone replacement therapy in reducing mortality in ESRD men."}]