[{"section_title": "", "text": "The decisions of crop farmers, such as how much fertilizer and pesticide to use, can affect biodiversity and water quality. Hendricks et al. (2014), for example, find that increased demand for corn-based ethanol expanded the so-called dead zone in the Gulf of Mexico by encouraging farmers to plant more corn and use more fertilizer. U.S. federal crop insurance may have similar unintended effects. Although designed to reduce farm income variability, crop insurance may cause farmers to take more risks and apply more fertilizer, plant crops on erodible lands, or specialize in fewer crops, thereby exacerbating environmental externalities from agriculture. The growth in federal crop insurance warrants greater study of the program's unintended consequences (Goodwin and Smith, 2013). Crop insurance has expanded significantly since 2000 and with the 2014 Farm Act is now the main conduit of financial support to farmers. Between 2000 and 2013, acres enrolled beyond the most basic coverage increased by 77 percent. The corresponding premium subsidies paid by the federal government also increased. Before 2000 the subsidies never exceeded a billion dollars in real terms; for the years 2011-2013, they ranged between $6 and $7 billion annually ( Figure 1). The empirical literature on crop insurance provides a generally weak foundation for distinguishing the effect of insurance apart from confounding factors. There are no farm-level empirical studies of crop insurance and input use that use a sample of national scope and control for farm fixed effects. Studies have commonly relied on cross-sectional variation (e.g. Horowitz and Lichtenberg, 1993;Smith and Goodwin, 1996), even though time-invariant unobservable variables such as land quality and risk attitudes are likely correlated with crop insurance participation and input use. O'Donoghue, Roberts, and Key (2009) is an exception, but it only considers crop diversification, not input use. Almost all published studies also assume that crop insurance participation is exogenous to farm decisions. This is unlikely. Farmers may shift land from low-input, non-insurable uses to high-input, insurable crops (or vice versa) for reasons unrelated to insurance such as changing crop prices or farm finances. With the new land use eligible for subsidized insurance, participation in insurance would increase along with input use, inducing a spurious correlation between the two. Here, Cornaggia (2013) is a notable exception in his treatment of the endogeneity of insurance adoption. He exploits the introduction of new insurance policies in some counties and not others. However, his data only permit examining the effect of insurance on yields, and his identification strategy rests on 14 insurance policy events, with all but one occurring before the beginning of our study period. We study how changes in insurance coverage over the 2000-2013 period affected farmlevel crop choice and fertilizer and chemical use while controlling for farm-fixed effects and the endogeneity of crop insurance participation. Controlling for farm-fixed effects is possible by our creation of a panel data set constructed from 14 years of the annual USDA Agricultural Resource Management Survey. For plausibly exogenous variation in coverage, we exploit the insurance program's limit on how much coverage farmers could purchase. As the incentive to have insurance grew, farmers who initially had little coverage could greatly expand coverage; farmers already close to the maximum level could not. Instrumenting the change in coverage with each farm's initial coverage ratio-its actual coverage relative to its farm-specific maximum coverage possible-allows us to identify the effect of coverage on production decisions under plausible assumptions. Moreover, the non-linear relationship between the initial coverage ratio and the subsequent change in coverage allows us to control (linearly) for the initial level of crop insurance coverage in our regressions, making our approach robust to a linear relationship between initial coverage and changes in production decisions. In addition to providing plausible estimates of the effects of insurance coverage, we create and document a new farm-level panel data set that will enrich future research in agriculture and environmental policy. Empirical research related to U.S. farms has been limited by the lack of nation-wide panel data at the farm level. Outside of the Census of Agriculture, which has a limited scope of questions and occurs once every five years, there has been no comprehensive panel data for U.S. farms. Our panel data set is based on the Agricultural Resource Management Survey-the only annual nation-wide data source on the finances, production practices, and resource use of U.S. farms and the households operating them. Despite its design as a cross-sectional survey, nearly 32,500 farms have been surveyed at least twice over the 2000-2013 period, thereby providing a rich resource to study dynamic issues and account for time-invariant farm heterogeneity. Applying the data to study the effects of crop insurance, our OLS estimates from a firstdifferenced model show a positive relationship between coverage and fertilizer and chemical use, though smaller than some prior estimates using cross-sectional data. Our instrumental variable estimates, however, show that coverage has little effect on crop specialization or input use. The estimates are sufficiently precise that even the upper bounds of a 95 percent confidence interval represent environmentally negligible effects. Thus, it does not appear that a more generous crop insurance program by itself encourages specialization or greater fertilizer and chemical use as several prior studies have found."}, {"section_title": "AGRICULTURE, THE ENVIRONMENT, AND CROP INSURANCE", "text": ""}, {"section_title": "Agriculture and the Environment", "text": "Farmers are the chief managers of arable lands around the world, and their decisions affect environmental quality on their lands and beyond (Tilmen et al., 2002). Switching marginal land from passive uses into cultivation reduces its value as wildlife habitat. Marginal lands are also more prone to soil erosion when cultivated, leading to the sedimentation of lakes and streams (Shortle, Abler, and Ribaudo, 2001). For land already in cultivation, a less diverse crop mix reduces biodiversity and increases insect and disease problems (Sulc and Tracy, 2007;Landis, 2008). Fertilizer nutrients or pesticides running into surface water or leaching into groundwater can be extensive. The U.S. Environmental Protection Agency has identified agricultural nonpoint source pollution as a leading source of impairment of the country's water resources (U.S. EPA, 2015). Studies have shown that 30 to 40 percent of nitrogen fertilizer applied to crop fields seeps into ground or surface water, with losses of 70 percent on the margin (Cambardella et al., 1999;Randall and Mulla, 2001;Li et al., 2006). A ten-year study by the U.S. Geological Survey found widespread occurrences of pesticides in streams and groundwater, often at concentrations deemed harmful to aquatic life and fish-eating wildlife (Gilliom, 2007). A 1990 nation-wide survey by the EPA found that 10 percent of community water systems and 4 percent of rural domestic wells contain at least one pesticide (EPA, 1990).  (2014) shows that the subsidies led farmers to adopt policies with higher coverage levels, with a one percent increase in the subsidy rate increasing total premiums and premiums per acre by one percent. The 2008 Farm Act maintained subsidies for traditional policies and introduced a new option for enterprise units, which came with even higher subsidies (80 percent for most coverage levels)."}, {"section_title": "The Federal Crop Insurance Program and Incentives to Participate", "text": "For both the 2000 and 2008 Acts, the additional subsidies and options would have been available in the year following the Act's authorization. The full effect of the changes on coverage, however, likely took several years to occur as farmers learned about the new options in a way that is analogous to the adoption of new product or innovation. The rate of adoption of a new product or technology often follows the \"S-shaped curve\" described by the Diffusion of Innovations model (Rogers, 2010). The rate of adoption is initially slow and then accelerates before leveling off when only a few of those remaining have not adopted. This pattern seems to apply to crop insurance adoption. For example, revenue based policies were first introduced in 1996 but adoption expanded most quickly during the 1998 to 2001 period (Dismukes and Coble, 2006). Following this pattern, the subsidy increase in 2000 (and 2008) resulted in temporal variation in crop insurance coverage over the next several years as more and more farmers adopted insurance in response to the subsidy increases. In addition to changes in subsidies and insurance options, the Renewable Fuel Standard and macroeconomic factors also made insurance more attractive by increasing price levels, price variability, and consequently profit variability. Increases in energy prices helped increase fertilizer and other input prices while U.S. biofuel policy and rising global demand contributed to higher crop prices in the second half of our study period (Trostle et al., 2011;Beckman, Borchers, and Jones, 2013). Higher input and output prices, in turn, generally increase profit variability by magnifying the effect of yield shocks. 1 Moreover, the U.S. Renewable Fuel Standard increased the volatility of corn prices by strengthening the linkage between energy and corn markets (McPhail, Du, and Muhammad, 2012;Du and McPhail, 2012;McPhail and Babcock, 2012). exponentially with the crop price. If both input and output prices increase proportionally, average profits will increase by the same proportion, which could discourage insurance use. Empirically, Coble et al. (1996) find that the elasticity of crop insurance with respect to expected marginal revenue is similar in magnitude to the elasticity with respect to the variance of marginal revenue (though they have different signs). If their finding holds for recent years, it implies that a proportional increase in input and output prices would increase the demand for insurance because it would increase profits linearly and profit variability exponentially. subsidies show a roughly similar pattern, though the percent increase was larger, reflecting reflects rising production values, which increased expected indemnities and premiums."}, {"section_title": "Crop Insurance and Farm Decisions", "text": "There are several reasons why insurance coverage could influence decisions like how much fertilizer to apply. According to the moral hazard argument, greater coverage encourages riskier production choices, causing farmers to use more risk-increasing inputs and fewer risk-decreasing inputs (Pope and Kramer, 1979;Leathers and Quiggin, 1991;Horowitz and Lichtenberg, 1993;Babcock and Hennessy, 1996). Sheriff (2005) argues that farmers over-apply nitrogen fertilizer to reduce the risk of very low yields, in which case subsidized crop insurance would reduce nitrogen use. Whether an input is risk-increasing or risk-decreasing, and consequently how insurance affects input use, becomes an empirical question. A similar logic applies to other production decisions that affect profit variability. With greater coverage, a risk-averse producer could shift to riskier crops or specialize in one or two crops (O'Donoghue, Roberts, and Key, 2009). For farm households, less farm income risk may encourage households to spend less time at off-farm jobs and more time on the farm (Key, Roberts, and O'Donoghue, 2006). Shifting time or money to the farm could result in cultivation of marginal land and more fertilizer used per acre (Chang and Mishra, 2012). However, the potential effects of crop insurance on production via moral hazard should not be overstated. Deductibles and premiums depend on yield histories and should therefore attenuate moral hazard. The premium a farmer pays also depends on his claim history. A claim in one year increases the premium for following years and reduces the guarantee at which insurance pays, effectively increasing the deductible. Federal crop insurance might alter production decisions for other reasons. Because it is is heavily subsidized, the program increases the risk-adjusted returns to insured crops. By encouraging farmers to shift to insured crops, which may require more inputs, additional insurance could increase input use at the farm or regional level, even if it lowered input use on individual crops (Wu, 1999;Wu and Adams, 2001;Young, Vandeveer, and Schnepf, 2001;Goodwin, Vandeveer and Deal, 2004;Walters et al., 2012). In addition, banks may lend to insured farmers at more favorable terms, relaxing financial constraints and making it cheaper to buy equipment or inputs to increase yields or plant more acres (Cornaggia, 2013)."}, {"section_title": "Empirical Approaches and Findings", "text": "Much of the earliest empirical work examining the production effects of crop insurance used cross-sectional data and focused on fertilizer and pesticide application rates. Horowitz and Lichtenberg (1993) show large, input-increasing effects of adopting crop insurance, with federally insured farms applying 19 percent more nitrogen and spending 21 percent more on pesticides than uninsured farms. Two other empirical studies around the same time find that insurance reduced chemical use: Quiggin, Karagiannis, and Stanton (1993) for Midwestern corn and soybean farmers and Smith and Goodwin (1996) for Kansas wheat farmers. Babcock and Hennessy (1996) take a different approach and use data from field experiments to estimate how fertilizer use affected crop yield distributions. In a simulation with their parameterized model they find that insurance would cause small reductions in nitrogen fertilizer use. Later empirical work estimated the effect of insurance on a wider range of farm outcomes. Wu (1999) shows that in Nebraska, crop insurance shifted land away from hay and pasture into corn, which increased chemical use. Goodwin, Vandeveer, and Deal (2004) simultaneously estimate the effect of insurance on output and input intensity and find that The generally weak foundation for distinguishing the effects of crop insurance from confounding factors may explain the diverse findings in the literature. Many studies use crosssectional data or assume that insurance decisions are unrelated to unobserved factors that affect crop choices or fertilizer use. As noted earlier, this is a tenuous assumption: it is easy to imagine a scenario where, for reasons unrelated to crop insurance, a farmer decides to plant more acres of corn, which then affects decisions about fertilizer use and insurance coverage."}, {"section_title": "EMPIRICAL ANALYSIS", "text": ""}, {"section_title": "Empirical Approach", "text": "To quantify how crop insurance coverage affects farm decisions and therefore the environment, our empirical approach uses a novel unbalanced panel data set (described in the next section) with rich farm-level information. The base model relates changes in various outcomes to changes in crop insurance premiums per acre while controlling for initial farm characteristics, county fixed effects, and the years when the farm was observed: where , − , is the change in the production variable for farm between the first year the farm was observed and the second year (or in the case of farms observed three or more times, the second and third time and so forth). To measure the allocation of land to crops, we look at the share of total acres operated that are harvested; to capture crop specialization, we use the share of total acres harvested accounted for by the most harvested crop. For fertilizer and chemical use, we look at the log of fertilizer expenses per acre, the log of chemical expenses per acre, and the log of the sum of fertilizer and chemical expenses per acre. To capture overall intensity of land use, we use the log of the value of production per acre. We measure crop insurance coverage using the premium paid per acre of land operated ( , ). Many prior studies used a binary variable to indicate whether a farmer had any acres enrolled in crop insurance (Horowitz and Lichtenberg, 1993;Smith and Goodwin, 1996;Wu, 1999). Conditional on having some acres enrolled, this approach does not capture increases in the number of acres enrolled or the level of coverage chosen for enrolled acres. More recent work has used the share of total acres enrolled in crop insurance (Walters et al., 2012;Chang and Mishra, 2012). But as Goodwin, Vandeveer, and Deal (2004) note, such a measure ignores changes in coverage levels on enrolled acres. Our measure of coverage, in contrast, captures changes in acres enrolled and coverage levels. Because coverage is expressed as premiums per acre operated by the farm, the measure increases with the share of acreage enrolled in crop insurance. It also increases with the level of coverage chosen for enrolled acres since farmers pay higher premiums for higher coverage levels. The measure is similar to that of Goodwin, Vandeveer, and Deal (2004), who use a measure of total liabilities, since premiums are proportional to the liabilities covered by the insurance policy. Our premium-based measure of coverage is well-suited to our empirical goal of quantifying how an increase in crop insurance coverage-whether from enrolling more acres or selecting higher coverage levels or both-affects farm decisions. The vector , contains farm-specific characteristics observed in the first year of the difference in the dependent variable (subscript s in equation 1). Controlling for initial characteristics allows farms managed by young versus old farmers, for example, to have different growth trends, and avoids the potential for reverse causality that comes with using changes in characteristics. We control for the initial level of crop insurance coverage as measured by (unlogged) premiums per acre. To capture farm size and life cycle effects we include a linear and quadratic term for both the farm operator age and the initial total value of production. To account for differences in crop specialization, we control for the initial share of harvested acres accounted for by soybeans, corn, and wheat, all separately. Including the share of acres in each of these major crops helps control for any effect that crop rotation patterns may have on changes in insurance coverage and input decisions. As we will show, our conclusions are robust to excluding the farm-level control variables. The vector contains binary variables indicating the first year of the differenced dependent variable; the variables in indicate the second year. These year dummy variables control for shocks unique to those years and that affect the change observed over the time spanned by the two years. This controls for confounding macroeconomic factors correlated with crop insurance coverage and our outcomes. For example, coverage generally increased over time along with corn prices, which would lead to an increase in the value of production per acre, or, similarly, an increase in fertilizer use per acre. The term ( ) is a county fixed effect. It captures any change in behavior common to all sample farms from the same county. It therefore controls for local unobserved conditions such as the possibility that changing crop prices encouraged agricultural intensification in some areas more than others because of differences in land suitability. On average there are about 6 sample farms per county."}, {"section_title": "Identification", "text": "Prior studies of crop insurance and production decisions that do not control for farm fixed effects (e.g. Horowitz and Lichtenberg, 1993;Smith and Goodwin, 1996)  Appropriately estimating the effect of insurance coverage requires temporal variation in coverage unrelated to the decision to expand or intensify crop production. Our instrumental variable identification strategy leverages two facts: first, as previously discussed, the incentive for farmers to adopt more insurance increased over time and second, the federal crop insurance program has always had a maximum coverage level (85 percent for an individual level policy; 90 percent for an area-based policy). The growing incentive to expand coverage and the presence of a maximum coverage level suggests a negative nonlinear relationship between a) a farmer's initial coverage relative to the maximum coverage possible, and b) the change in coverage in response to incentives to have more insurance. This nonlinear relationship is because farmers who initially had coverage close to the maximum coverage were substantially more limited in how much they could expand coverage compared to farmers who initially had less coverage. To illustrate, consider an increase in the demand for insurance from period 1 to period 2 caused perhaps by a drop in the price of insurance. Greater demand will result in more coverage for most farms, and premiums per acre in period 2 will increase relative to premiums per acre in period 1 ( Figure 2). How much premiums increase in the second period depends on the farmer's initial coverage. A farmer paying the maximum premium in the first period cannot increase coverage in response to the lower price of insurance, which is why the ratio of the second and first period premium equals one when the first period premium equals the maximum premium. A farm with a low premium in the first period, in contrast, may double or triple coverage. This is shown in Figure 2 by the negative nonlinear relationship between the ratio of the period 1 premium to the maximum premium possible in period 1 (horizontal axis) and the ratio of the second period premium to first period premium (vertical axis). The relationship in Figure 2 has a firm microeconomic foundation. Consider two riskaverse farmers who seek a specific level of risk exposure. The farmers can reach their desired risk exposure through a combination of risk-reducing practices (\"diversification\") and insurance. The combinations of diversification and insurance that yield the same risk exposure constitute an indifference curve for each farmer. The price of insurance relative to the price of diversification (e.g. the cost of risk-reducing practices) determines the cost-effective mix of diversification and insurance. Further assume that the maximum coverage constraint binds for one farmer and not the other (perhaps because of a greater aversion to risk and therefore a greater demand for insurance). Consider an increase in premium subsidies, which causes the price of insurance to decline relative to the price of diversification. The constrained farmer cannot increase the quantity of insurance and, assuming that his preferred risk exposure has not changed, he has no incentive to change his use of diversification. In contrast, the change in relative prices causes the unconstrained farmer to use less diversification and more insurance, a shift associated with an increase in premiums relative to the constrained farmer. Moreover, the percent change in coverage increases exponentially the further the farmer's initial insurance level is from the maximum level (see the online appendix for a detailed explanation, a graphical illustration, and a treatment of the case where increased profit variability increases the demand for a reduction in risk). Following the logic of Figure 2, let the relationship between the rate of increase in coverage and the initial coverage level can be described with an exponential function of the form: where is presumably negative. Taking logs of both sides gives ). ( 3)Equation 3motivates using an instrumental variable approach to estimate (1), where the log of the initial premium divided by the maximum premium, which we call the coverage ratio, is used as an instrument for the log difference in coverage as measured by premiums per acre. The first stage in this IV regression is then: We calculate the coverage ratio by dividing the initial per acre premium paid by the farmer by his maximum premium. The maximum premium-and therefore maximum coveragevaries by county and crop mix. We calculate the maximum using producer premium data from the Risk Management Agency's Summary of Business data, which are county-level data aggregated from all individual policies issued in the county. We find the crop-specific plan and coverage level with the highest per-acre premium in each year and each county. Then we multiply this maximum per-acre premium by the number of harvested acres of each crop for every farm. This gives the total premiums each farm would have paid, had it enrolled each crop in the most expensive plan observed in the county. We refer to this amount as the farm's maximum premium. 3 3 While we call this a maximum premium it is calculated as the average premium per acre associated with the most expensive plan and coverage level observed in the county. For example, two farmers with the most expensive plan in the county may pay different premiums because of different claim histories. If these were the only two farmers with the most expensive plan, we would use the average of the two for the per acre premium associated with the The nonlinear relationship between the coverage ratio and changes in coverage allows for estimating while controlling for the initial premium per acre, . , which is included in X. The instrument-the log of the coverage ratio-is not perfectly predicted by a linear relationship with the initial premium per acre. Note that the log of the ratio can be written as ln( . ) − ln ( , ). Both terms have variation that is not fully predicted by a linear function of the farm's initial premium per acre. First, the log of the maximum coverage, ln ( , ), varies by county and year, causing the coverage ratio to differ for two farmers despite having the same initial level of coverage. Second, the non-linearity introduced by taking the natural logarithm provides another source of variation, since ln( . ) and . are not perfectly correlated. This non-linearity is a product of the constraint imposed by policy. As shown by Figure 2, the maximum coverage level introduces a constraint that binds exponentially more for farmers as their initial coverage level approaches the maximum level. This non-linearity is confirmed by the data in Figure 3, which shows a negative linear relationship between the log of the coverage ratio and the log difference in premium per acre. Our instrumental variable is plausibly exogenous to changes in farm decisions because it is statistically related to changes in coverage because of a policy constraint (the coverage limit) and changing policy and market conditions (more subsidies, program options, and higher crop and input prices). Moreover, the inclusion of the farm's initial coverage level makes the model robust to a correlation between a farm's initial coverage level and changes in the outcomes studied. most expensive plan and coverage level. Also, note that this maximum is based on the most expensive insurance option chosen in a county, which may be different than the most expensive option available if that option is not selected by anyone in the county. More specifically, the IV estimator is likely to give more credible estimates than the OLS estimator because the change in premiums per acre predicted non-linearly by the coverage ratio should strip out much of the endogenous changes in premiums per acre. Consider a scenario where changing crop prices or farm finances encourage some farmers to shift land from lowinput, non-insurable uses to high-input, insurable crops. With the switch, farmers increase insurance coverage, so premiums per acre and input use per acre both increase. Because OLS uses all the variation in premiums for identification, every time such a switch happens, premiums change in a way that is spuriously correlated with input use. As long as the log of the coverage ratio imperfectly predicts such switching, the predicted change in premiums will contain less endogenous variation then the actual change. 4"}, {"section_title": "Creating a Panel Data Set from the Agricultural Resource Management Survey", "text": "Empirical research on the causal effects of U.S. agricultural and environmental policy has been constrained by a lack of farm-level panel data. The only nation-wide source of detailed and comprehensive farm-level data is the Agricultural Resource Management Survey (ARMS), which is a cross-sectional survey. The National Agricultural Statistics Service (NASS), which administers the survey, draws a new sample of farms each year, sampling roughly 30,000 farms out of a population of 2.1 million. 5 Although designed as a repeated cross-sectional survey, farms surveyed more than once over the years can be identified and their records linked. If a simple random sample were drawn, the probability of observing the same farm twice would be very low. This is not the case with ARMS. The USDA definition of a farm is broad and, as a result, many farms in the population have little production. Because ARMS seeks to be an annual snapshot of the state of agriculture every year, small farms are undersampled while larger farms, where most production occurs, are oversampled. Having been conducted annually since 1996, the many years of ARMS samples combined with the oversampling of large farms has caused many farms to be surveyed two or more times. Using the unique principal operator identifier, a number assigned to each farm that does not change over time, we identified all farms appearing at least twice in the ARMS. Because the survey questions necessary for our study were not present prior to 2000, we focus on the data sets from 2000 to 2013. Over this period, 202,127 distinct farms were sampled and responded to the survey, of which 16 percent, or 32,498 farms, appear at least twice (Table 1). Roughly 4 percent of farms appear at least three times. Farms appearing at least twice in ARMS, which we label repeat farms, are quite different, on average, from the typical ARMS respondent. Because larger farms are sampled with a higher probability, repeat farms tend to be larger farms. For each year of ARMS we compare the median value of production and acreage operated of all respondent farms with that of repeat farms observed for the first time in that year. We calculate the unweighted median since we are interested in comparing repeat farms with the typical ARMS respondent farm, not repeat farms with the general population. As expected the median repeat farm consistently has more acres and production than the median respondent farm ( Table 2). The oversampling of large farms arguably suits our purposes better than a sample representative of the U.S. farm population as defined by the USDA. We are not interested in the observing the typical farm in the population, which-because of the broad USDA farm definitionhas little agricultural production and is unlikely to participate in federal crop insurance. For environmental and land use issues we are most interested in what happens to the typical acre. Because large farms account for most acres enrolled in crop insurance, a sample reflecting the large farm population provides more information on how crop insurance affects practices on the typical acre. As this is the first study to construct a true panel data set using ARMS, there is value to documenting how repeat farms might differ from the typical respondent farm. We know that repeat farms are larger than the typical respondent farm, but if we control for farm size are the repeat farms similar to the typical respondent? To make this comparison, we draw a random subsample of ARMS respondent farms that is stratified to match the farm size distribution of repeat farms. We compare the two groups for a variety of characteristics other than farm size (provided in the appendix). In considering the comparability of treatment and control groups, Imbens and Wooldridge (2009) suggest that linear regression may be misleading when the normalized difference in group means is larger than 0.25 standard deviations. The largest difference we observe is 0.23 and the average absolute difference is 0.04, indicating substantial comparability across the two groups. We also make comparisons among farms meeting our sample criteria and find substantial comparability across the groups, with only one normalized difference exceeding 0.25."}, {"section_title": "Sample farms", "text": "We narrow our sample of repeat farms to those most relevant for studying the effects of crop insurance. We focus on farms that participated in federal crop insurance in at least one of the years observed and whose primary outputs are insurance-eligible, which we define as farms where at least half of the value of production in the first year observed came from crop insurance eligible crops. 6 This gives a sample of 6,681 repeat observations, the majority of which reflect unique farms because most sample farms are observed only twice and therefore account for one repeat observation (Table 1). To take full advantage of our panel data, we also included observations from farms observed three or more times. A farm observed three times contributes two observations to our sample, the difference from the first and second year observed and the difference between the second and third year observed. Excluding these farms has little effect on the results. In the first year of each year-to-year difference, the average farm in the sample was operated by a 52 year old whose farm had nearly $854,000 in production or about $380 per acre (Table 3) A threat to our instrumental variable approach is that time-varying factors affected land and input use in a way that was non-linearly related to the initial coverage ratio. We cannot dismiss such a situation but we can compare the beginning-period values for land and input use for farms across coverage-ratio terciles. Farms with initially similar practices are arguably more likely to experience similar time-varying factors than farms with differing practices. Table 4 shows that farms in the first tercile (low coverage ratios) harvested a larger share of their land and used more inputs per acre than farms in the second and third terciles. The differences, however, are surprisingly small. As mentioned earlier, a normalized difference in means of 0.25 standard deviations or less is often interpreted as indicating reasonably comparable groups (Imbens and Wooldridge, 2009). In comparing the first and the second tercile, the normalized difference is 0.13 on average and is always less than a quarter. When comparing the first and the third terciles, the average normalized difference is 0.14 and is greater than 0.25 for only one variable-the share of harvested acres. Given the unique nature of our panel, we assess the distribution of sample farms across years. We provide the number of farms observed in each year pairing, for example, the number of farms observed for the first time in 2000 and for the second time in 2003 (see online appendix). Farms are well distributed across years, with a farm most commonly observed two or three years apart. More than 11 percent of the sample was observed for the first time in 2000, prior to the implementation of the 2000 Farm Act that increased subsidies. Similarly, 68 percent were observed for the first time prior to the large increase in crop prices in 2007 (and therefore also before the implementation of the 2008 Act)."}, {"section_title": "Weighting, Standard errors, and Zeros", "text": "The sample statistics are based on unweighted data. The ARMS uses a stratified sampling design and each observation has a weight based on its probability of selection. In the typical crosssectional use of ARMS data the weights permit using sample data to estimate population values such as the income of the average U.S. farm. Because ARMS is designed to create a nationally representative cross-section of farms rather than a panel of farms, the weights associated with repeat farms do not expand to a meaningful population. We therefore ignore the weights in estimation. Researchers using ARMS normally account for sample design in estimating variances using a jackknife method with replicate weights provided by the USDA/NASS (e.g., Katchova, 2005;Ahearn et al., 2006). This is an unattractive option because the replicate weights (like the base weights) are designed uniquely for each cross-sectional sample, not for the subsample of repeat farms. Facing a similar problem of needing to account for sample design without using weights, Weber and Clay (2013) cluster standard errors by each farm's survey stratum or location. The intuition is clear-clustering by stratum amounts to summing variances from mutually exclusive and exhaustive subpopulations. They show that clustering by strata or by location gives standard errors of similar magnitude, both of which are about two-thirds larger than the unclustered errors. Because we use county fixed effects, we cluster our standard error by county. The robustness section considers using crop reporting district fixed effects and clustering errors by district. Because farms sometimes have zero insurance coverage in one of the years observed, our key dependent variable, the log difference in premiums per acre, is undefined for about a quarter of sample of farms. We take the common, though arbitrary, approach of adding a very small number to observations with a zero premium. To allow for a discrete effect of this arbitrary fix, we include in all models a dummy variable for whether the farm had a zero premium in the first year observed and another one for whether it had a zero premium in the second year observed. In the robustness section we present results for when these observations are excluded."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Ordinary Least Squares", "text": "Estimating equation 4with OLS suggests that greater insurance coverage encourages farms to cultivate and harvest a larger share of their acres and use more fertilizer and chemicals per acre (Table 5) Qualitatively, these first-differenced OLS results fit the farm-level cross-sectional findings of Horowitz and Lichtenberg (1993) and Chang and Mishra (2012) as well as the county-level panel data findings from Goodwin, Vandeveer, and Deal (2004), all of which show a positive association between insurance and fertilizer and chemical use. Yet, as highlighted before, such correlations may reflect unobserved factors that encourage a farmer to both intensify production and expand coverage. Figure 2 depicts the hypothesized nonlinear relationship between the initial coverage ratio and the ratio of the second and first period premium. Using the sample data, we plot the actual linearized relationship as described by equation 3 (Figure 3). The slope of the line corresponds to in equation 3. It is negative as predicted: farmers with a larger log coverage ratio had a smaller proportional change in premiums per acre. The line runs through the point (0,0), which corresponds to the point (1,1) in the hypothesized nonlinear relationship in Figure 2."}, {"section_title": "Instrumental Variable Approach", "text": "We more formally establish the strength of the excluded instrument, the log of the coverage ratio, by estimating equation 4. A first-stage regression for the full sample shows that a 1 percent increase in the logged ratio was associated with 0.73 percent less growth in premiums per acre (coefficient of 0.724, standard error of 0.022) ( Table 6). The F statistic for whether the coefficient on the logged ratio is zero is above 1,100, far higher than the thresholds provided in Stock and Yogo (2005) for the reliability of t-tests based on IV estimates and for a sufficiently low probability that the bias of the IV point estimates is less than 10 percent of the bias of OLS. In contrast to the OLS estimator, the Instrumental Variable estimator shows that crop insurance slightly decreases the share of acres harvested and has little effect on input use (Table   7). Compared to the statistically significant coefficients in the OLS regressions, the IV coefficients are multiple times smaller and yet with standard errors of roughly similar magnitude. OLS, for example, gives a coefficient of 0.044 on the change in premiums when looking at total fertilizer and chemical expenditures while the IV estimate is only 0.011. The one case where both OLS and IV give similar results is for crop specialization. In both cases the coefficient is positive, but with point estimates that indicate economically insignificant effects: a 10 percent increase in crop insurance coverage leads to a 0.03 (OLS) to 0.05 (IV) percentage point increase in the share of acres harvested dedicated to the most harvested crop. Only the IV estimate is statistically distinguishable from zero."}, {"section_title": "Robustness", "text": "We perform nine robustness checks. The first six checks concern the general robustness of the results. The seventh and eight checks relate to heterogeneous effects and external validity. The ninth check address concerns about measurement error in premiums per acre. First, we drop the farm characteristic control variables and only control for county and year fixed effects and the zero-premium indicator variables. If our instrument, the log of the coverage ratio, were substantially correlated with farm characteristics that affect our outcomes, we would expect large changes in our estimates. Sensitivity to controlling for observed characteristics, in turn, would suggest that estimates may also be sensitive to unobservable characteristics correlated with our instrument. Second, we exclude farms that had a zero premium in one year and for which we added a small number to the premium to permit taking the log. Third, instead of including a dummy variable for the first year observed and another dummy variable for the second year observed, we include a dummy variable for each unique year pairing (e.g. 2002 for year 1 and 2007 for year 2). This provides a general robustness check on our approach to controlling for time shocks. It also controls for a modification in the calculation of premiums made in the 2008 Farm Act, which could cause a shift in premiums for farms observed before and after 2008. 7 Fourth, we control for the number of years between the first and the second observation. This helps address concerns about survivor bias as it allow for a correlation between years of survival and changes in farm decisions. Fifth, to address concerns that varying time lengths used in differencing may affect our results, we limit estimation to farms observed 3 to 5 years apart, which reduces our sample size by about two-thirds. Sixth, we use crop reporting district fixed effects and cluster our standard errors at the district level. Crop reporting districts are groupings of roughly 10 agriculturally similar counties. The results are surprisingly stable across the first six robustness checks (Table 8). Controlling for farm characteristics provides economically small and statistically insignificant coefficients for all outcomes. There is a change in statistical significance compared to the main results for the share harvested and the maximum share in one group, but even these main results were economically small. Excluding farms with zero premiums gives point estimates very similar to the main estimates. Likewise, including dummy variables for year pairings, including a length of time elapsed variable, limiting estimation to farms observed 3 to 5 years apart, or using crop reporting district fixed effects all provide results similar to the main results. The seventh and eight checks address the applicability of the estimates of the response to greater crop insurance ( 1 in equation 1) to the broader population of crop farms growing insurance-eligible crops. Almost all farm-level empirical studies of crop insurance assume that conditional on covariates, the behavioral response to crop insurance coverage is the same for all sample farms (Quiggin, Karagiannis, and Stanton, 1993;Horowitz and Lichtenberg, 1993;Smith 7 Prior to 2008, total premiums were mandated to be priced to generate a loss-ratio of 1.075. The 2008 Farm Act mandated that total premiums should be priced to generate a ratio of 1.0 (actuarially fair). Including dummy variables for each unique year pairing will control for this change in policy. For information on the change, see Dennis Shields, \"Federal Crop Insurance: Background and Issues,\" Congressional Research Service, Dec 2010, footnote 16, p12. and Goodwin, 1996;Wu, 1999;O'Donoghue, Roberts, and Key, 2009). Endogeneity issues aside, assuming a homogenous behavioral response, and therefore the same coefficient across farms, OLS gives a consistent point estimate of this coefficient when using a simple random sample as well as when using a sample where large farms are oversampled, such as the normal ARMS sample or the repeat sample that we have constructed. If there are heterogeneous responses, weighted or unweighted OLS will not provide a consistent estimate of the populatedshare-weighted average response, regardless of the sample design (see p. 67-70 in Deaton, 1997). The only solution to estimate interpretable coefficients is to simply estimate different equations (or at least different coefficients) based on each farm group for which the behavioral response is unique. The key issue for applying our results more broadly, then, is whether small and large farms, for example, have a fundamentally different response to crop insurance, in which case a distinct coefficient should be estimated for each type of farm. A reasonable test of the assumption of a homogenous response is to estimate separate equations for different types of sample farms. We do this on two dimensions: crop specialization and farm size. For crop specialization, we split the sample based on how much corn a farm had in its original crop mix, with corn farms categorized as those where 25 percent or more of the value of production comes from corn. For farm size, we split the sample based into small and large farms based on having more or less acreage than the median farm. When splitting the sample, the estimated coefficient on the change in premiums is statistically indistinguishable from zero 22 out of the 24 times (four samples multiplied by six outcomes) ( Table 8). The actual coefficients are generally statistically similar across subsamples as well. For farms specialized in corn, the 95 percent confidence interval for the coefficient on the change in premiums contains the coefficient estimated for farms not specialized in corn five out of six times. Similarly, for large farms, the confidence interval contains the point estimate for small farms five out of six times. Thus, the overall results suggest that greater crop insurance coverage has little effect on farm behavior and that this is true for different types of farms. The one statistically strong and economically large result from the sample is for the value of production per acre on small farms. However, this was not associated with greater input use. One interpretation is that insurance encourages smaller farmers to switch to higher value crops that require more investment but not more fertilizer or pesticide. Act, which changed subsidy rates for farms selecting policies involving enterprise units. For farms where both observations occur in the 2001 to 2007 window, the percent change in the farmer premium equals the percent change in the total premium since the relationship between the two was fixed by law during this period. We exploit this fact to explore the possibility of attenuation bias from measurement error and find little indication that measurement error is a problem. If it were a problem, OLS estimates for the change in premiums in equation (1), 1 , should be larger when using only farms observed for the first and second time between 2001 and 2007. Yet, we find estimates of 1 that are similar to or smaller than those from the full sample where measurement error is presumably greater (see online appendix)."}, {"section_title": "DISCUSSION", "text": ""}, {"section_title": "Can We Reject Economically Important Effects?", "text": "In many instrumental variable applications, large standard errors can prevent a rejection of the null hypothesis of a zero effect but, at the same time, not allow researchers to rule out economically important effect sizes. This is not the case for our results, where even the upper bound estimated effects are economically small.  Table 8). This estimate comes from multiplying our upper bound estimate of the increase in fertilizer expenses (1.9 percent) with the estimate of fertilizer loss from Li et al. (2006). They found that a 1 percent increase in the fertilizer application rate on Iowa corn and soybean fields leads to a 0.7 percent increase in nutrients in water flowing in tiles that drain agricultural areas, which would likely result in an even smaller percentage increase in nutrients in larger streams (column 4 in Table 8). 8 It is reasonable to apply these numbers to our study, which has many Midwestern corn and soybean farms, and assume that a 1 percent increase in fertilizer expenses per acre would translate into a similar increase in the fertilizer application rate. The implied (upper-bound)  Using data from the National Water Quality Assessment program, Tesfamichael et al. (2005) estimate that a 1 percent increase in the application rate of atrazine led to a 0.5 percent increase in the concentration of atrazine in streams. (Atrazine is a commonly used pesticides and was the second most commonly found pesticide in a nation-wide survey by the EPA (U.S. EPA, 1990)). Our upper-bound estimate suggests that a doubling of crop insurance premiums would cause a 1.9 percent increase in chemical expenses. Supposing the increase in chemical expenses is associated with a similar increase in quantity of pesticide applied, our estimate multiplied by that of Tesfamichael et al. (2005) suggests a 1.1 percent (=2.2 percent x 0.5 percent) increase in the concentration of pesticide in streams."}, {"section_title": "What Our Empirics Do and Do Not Capture", "text": "Our measures of fertilizer and chemical use are per acre operated by the farm. It is possible that insurance subsidies caused marginal lands to be brought into cultivation. If the land was originally part of the farm (e.g. in pasture) and crop insurance encouraged the farmer to convert it to cropland, we would observe increases in the value of production per acre, the share of land harvested, and fertilizer and chemical expenses per acre. If, however, crop insurance encouraged the farm to acquire the land, our outcome variables would only increase if the farmer used more fertilizer on it (or had a more specialized crop mix and so forth) than the average acre already operated by the farm. Otherwise, we would not capture the effect. We do not know how land acquired between the first and second time observed may have differed from land already in the farm. But we can test if crop insurance was association with farms acquiring more land. Using the log difference in the total acres operated as the dependent variable, we find that greater insurance coverage was not associated with an increase in acres operated (coefficient of -0.01, standard error of 0.007). This result combined with the lack of an effect on the value of production suggests that insurance did not cause participating farmers to intensify production on marginal lands. Still, it is possible that both high and low-coverage farms acquired land at similar rates, with farms with high coverage tending to acquire marginal lands (and intensify production on them) while low coverage farms tended to acquire better lands. However, this would require that high coverage farmers replaced high quality land with marginal land such that the total acres operated did not change, which seems unlikely. Our empirics capture the effect of expanding crop insurance coverage in a period when other farm programs changed very little. We do not examine the effects of replacing any "}, {"section_title": "CONCLUSION", "text": "Policies with non-environmental goals can cause unintended environmental harm. Using a novel data set and identification strategy, we find that federal crop insurance does not appear to fall into this category despite several past studies suggesting otherwise.  1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 Figure 2. The Initial Coverage Ratio and the Response to Greater Incentives for Insurance Figure 3. The Log of the Initial Coverage Ratio is Negatively Related to the Change in Coverage. The line represents the results of a kernel-weighted local polynomial regression of the log difference in coverage on the log of the initial coverage ratio. For the figure, the log of the coverage ratio is truncated at -6, and only observations with nonzero premiums are used.   Tables   Table 1.   Note.-\"All Years\" contains 2013 data in the \"All\" categories while there is no row for 2013 since any repeat farms would, by definition, have to have been observed prior to 2013. Resource Management Survey (ARMS), 2000-2013. The descriptive statistics are for farms meeting the sample criteria as described in the text. Note.-The farm-level statistics are based on the first year the farm was observed. There are a total of 6,681 observations in the full sample used in our analysis. The premium per acre statistics are based only on farms observed for the first time in the reference year (n=752 for 2000 and n =1,199 for 2013). Monetary amounts are in 2011 dollars.   Note. -Robust standard errors clustered by county are in parenthesis. County and year fixed effects are included as well as all the control variables mentioned in the text (dummy variables indicating zero premiums in the first or second year observed; linear and quadratic terms for the age of the farm operator's age and the farm's total value of production; the initial share of harvested acres accounted for by soybeans, corn, and wheat, all separately). Other than the share variables, the dependent variables are per acre operated by the farm. The different number of observations across regressions is from some farms not having positive values for the outcome variable in at least one year.   Note.-Robust standard errors clustered by county are in parenthesis. County and year fixed effects are included as well as all the control variables mentioned in the text (dummy variables indicating zero premiums in the first or second year observed; linear and quadratic terms for the age of the farm operator's age and the farm's total value of production; the initial share of harvested acres accounted for by soybeans, corn, and wheat, all separately). Other than the share variables, the dependent variables are per acre operated by the farm. The different number of observations across regressions is from some farms not having positive values for the outcome variable in at least one year. The first stage F statistic for the excluded instrument (Δ log premium per acre) is 1,130.  Note.-Robust standard errors clustered by county are in parenthesis. For the row \"Full sample, excluding farm covariates\", only the zero-premium indicator variables and the county and year fixed effects are controlled for. The other regressions include county and year fixed effects as well as all the control variables mentioned in the text. Other than the share variables, the dependent variables are per acre operated by the farm. Specialization in corn farming is based Note.-The doubling of premiums per acre is based on the observed change in premiums per acre from 2000 to 2013 (roughly $6 to $12 per acre). The results in column 3 are from multiplying column 2 by 0.70 (=ln(12/6)). For the share variables, the numbers in column 3 refer to the percentage point increase in the share (e.g. a 0.8 percentage point increase in the max share of one crop). The elasticity of contamination for fertilizer (column 4) is from Li et al. (2006) and represents the percent increase in nitrogen in tile drainage water for a percent increase in fertilizer application. The elasticity of contamination for chemical expenses refers to the percent increase in atrazine in waterways resulting from a one percent increase in atrazine application as estimated by Tesfamichael et al. (2005). Column 5 comes from multiplying column 3 with column 4."}, {"section_title": "Supplemental Online Appendix for \"Does Federal Crop Insurance Make Environmental Externalities from Agriculture", "text": "Worse?\" Figure SA1 depicts risk indifference curves for farmers A and B. Assume that both farmers seek to reach a particular level of risk exposure through the lowest-cost combination of risk-reducing practices (\"diversification\") and insurance. 9 The vertical axis indicates spending on riskreduction through diversification and the horizontal axis indicates spending on insurance. The slope of the isocost line is the price of insurance divided by the price of diversification (e.g. the cost of risk-reducing practices). Given a particular risk indifference curve (assumed to have the same shape for both farmers), these relative prices determine the mix of diversification and insurance used."}, {"section_title": "SA1. The Microeconomic Foundations of Figure 2-A Graphical Explanation", "text": "We assume that farmer B seeks less risk exposure than farmer A, perhaps because of risk preferences or wealth. This puts farmer B on an indifference curve further from the origin, indicating less risk exposure and more spending on risk-reducing practices and insurance (D B >D A ; I B >I A ). We further assume that farmer B's optimal insurance amount is beyond the maximum coverage level (I B > I Max ). Consider an increase in premium subsidies, which lowers the price of insurance. The decline in price flattens the isocost curve, causing farmer A to use less diversification and more insurance ( ′ < , ′ > ). Farmer B, in contrast, is constrained in the amount of insurance he 9 The assumption that each farm has a targeted risk indifference curve allows us to abstract away from a full household utility maximization problem and focus on the mix of diversification and insurance used to achieve the targeted level of risk. While it is a strong assumption, it could be a reasonable approximation if farm households seek a risk level that rules out extreme outcomes such as defaulting on a loan, and once this risk level is achieved the household places little value on further reductions in risk. can purchase, so is while his optimal unconstrained insurance level, indicated by stars, increases from * to * ′ his actual purchase remains at I Max (farmer B's use of diversification will also not change as long as he does not change his preferred level risk exposure). Farmer A's premiums increase relative to farmer B's premiums since farmer B cannot increase his use of insurance. The empirical focus of the paper is whether farmer A's shift away from diversification and towards insurance is associated with an increase in fertilizer use, chemical use, and so on. Figure 2, the percent change in coverage in response to the subsidy increases exponentially the further the farmer's initial insurance level is from the maximum level. In the example given, ′ ⁄ > ⁄ = 1 and ′ ⁄ increases exponentially as decreases."}, {"section_title": "Consistent with", "text": "The same framework can be used to explore an overall increase in profit variability, which causes the indifference curves for both farmers to shift outward by the same degree-to obtain the same level of risk requires more insurance and/or diversification. The previous isocost line is now associated with an indifference curve with more risk exposure, requiring farmers to spend more-either on diversification or insurance-to reach the prior level of risk exposure ( Figure SA2). Without limits on coverage and no changes in relative prices, both farmers would increase diversification and insurance proportionally (indicated by an outward shift in the isocost curve) and remain at a similar point of curvature on the indifference curve but on a new curve with the desired risk exposure. Because the coverage constraint binds for farmer B, he will hold constant the use of insurance but increase the use of diversification, moving up the indifference curve towards greater dependence on diversification. Farmer A, in contrast, increases the use of diversification and insurance and remains at the same point on the indifference curve. As before, premiums increase proportionally more for farmer A than for farmer B. The change corresponds to the replacing of insurance with diversification and fits the empirical focus of the paper, which is whether farmer A's shift away from diversification and towards insurance is associated with an increase in fertilizer use, chemical use, and so on."}, {"section_title": "SA2. Comparing Repeat Farms to the Typical Respondent farm.", "text": "The full sample of repeat farms is 32,498 (see Table 2 in the main text). For the purpose of broad conclusions about repeat farms, our comparison of repeat and respondent farms is based on the full sample of repeat farms, not the more narrow sample used for our analysis of crop insurance. We break the repeat farm sample into quartiles based on the value of production. There are 8,124 repeat farms in the bottom quartile of the value of production, which is defined by having $116,075 or less in production. We then randomly draw the same number of farms among all respondent farms having $116,075 or less in production. We do this for the second, third, and fourth farm-size quartiles, thereby creating a subsample of ARMS respondent farms with a farmsize distribution similar to that of the repeat farm sample. For many quartiles, repeat and respondent farms have group means that are statistically different at the one percent level. But given the more than 16,000 observations in each quartile, a statistically significant difference is likely even if the difference is economically unimportant. The normalized difference-the difference in means for the two groups divided by the square root of the sum of their squared standard deviations-is a common metric of comparison and is more informative than a test of statistical significant difference in means between two large groups. Comparing the two groups across 11 variables and four quartiles for each variable, the average absolute normalized difference is just 0.04. By comparison, Imbens and Wooldridge (2009) suggest that linear regression to estimate treatment effects may be misleading when it is larger than 0.25 standard deviations. Across most of the variables explored in Table SA1, the mean differences between the two samples are more pronounced for the smaller farms (the first quartile) and tend to disappear by the fourth quartile. This is likely because the full ARMS respondent sample includes many very small farms-often without any agricultural production at all, which lowers the average values within the first quartile. The differences in the second and third quartiles, though sometimes statistically significant, generally diminish and by the fourth quartile, the two samples tend to have very similar means across the variables explored. We performed a similar comparison for farms meeting our sample criteria. The repeat farms correspond to our sample farms while the \"Random Draw of Respondent Farms\" refers to the respondent farms in the random draw that meet our sample criteria. One of the criteria was for repeat farms to have crop insurance in one or more years. This criterion cannot be applied to general respondent farms. Instead, we require these farms to be participating in crop insurance. As before, the comparison shows substantial comparability across the two groups, with an average normalized difference of 0.11, with only one case where the normalized difference was above 0.25 (excluding the crop insurance participation variable which will be different for the two groups by construction) (Table SA2).  Note.-The subsample of respondent farms is a stratified random selection of respondent farms such that the resulting sample has a similar farm size distribution as repeat farms. This is done by selecting a certain number of farms in each size quartiles, where the quartiles are based on the repeat sample. Statistical significance is at the one percent level. Note.-The repeat farms correspond to our sample farms while the \"Random Draw of Respondent Farms\" refers to the respondent farms in the random draw that meet our sample criteria.Comparison are then made within each farm-size quartile. One of the criteria was for repeat farms to have crop insurance in one or more years. This criterion cannot be applied to general respondent farms. Instead, we require all of these farms to be participating in crop insurance.  Year2 2001Year2 2002Year2 2003Year2 2004Year2 2005Year2 2006Year2 2007Year2 2008Year2 2009 0  0  0  0  0  0  0  0  0  22  186  135  92  435  2010  0  0  0  0  0  0  0  0  0  0  20  206  115  341  2011  0  0  0  0  0  0  0  0  0  0  0  46  209  255  2012  0  0  0  0  0  0  0  0  0  0  0  0  134  134  2013  0  0  0  0  0  0  0  0  0  0  0  0  0  0  Total  25  148 308 290 300 528 541 611 560 431 683  1,213  1,219  6,857 Note.-Year 1 corresponds to the first year the farm was observed; Year 2 corresponds to the second year observed. Note.-The regression is based on farms where the first year observed was after 2000 and the second year observed was before 2008. Robust standard errors clustered by county are in parenthesis. County and year fixed effects are included as well as all the control variables mentioned in the text (dummy variables indicating zero premiums in the first or second year observed; linear and quadratic terms for the age of the farm operator's age and the farm's total value of production; the initial share of harvested acres accounted for by soybeans, corn, and wheat, all separately). Other than the share variables, the dependent variables are per acre operated by the farm. The different number of observations across regressions is from some farms not having positive values for the outcome variable in at least one year. *p < .10. ** p < .05. *** p < .01"}]