[{"section_title": "Introduction", "text": "The Indian Ocean Dipole is a mode of zonal climate variability that occurs across the tropical Indian Ocean [Saji et al., 1999;Webster et al., 1999]. Positive Indian Ocean Dipole (pIOD) events correspond with a weakening or reversal of the zonal sea surface temperature (SST) gradient and zonal surface winds, whereas negative IOD (nIOD) events occur when the climatological SST gradient is intensified. The seasonal evolution of IOD events is phase locked to the half-year corresponding with the Asian summer monsoon season [Cai et al., 2013;Saji et al., 1999;Webster et al., 1999]. During a pIOD event, cool SST anomalies begin to develop off the south coast of Java in approximately May/June and intensify and propagate in a northwest direction along the Sumatran coast. These cool SSTs are brought about by upwelling of subsurface waters caused by strengthening of the alongshore (southeasterly) tradewinds and in some cases are preconditioned by shoaling of the thermocline related to El Niño events in the tropical Pacific Ocean. At the same time warmer than usual SSTs tend to develop in the tropical western Indian Ocean, and once established the reversed equatorial SST gradient results in a Bjerknes feedback that sustains the anomalous conditions until the tradewinds reverse at the end of the Asian summer monsoon season in approximately November/December [Meyers et al., 2007;Webster et al., 1999]. The atmospheric coupling to pIOD SST anomalies results in enhanced atmospheric convection over eastern Africa, which is associated with floods, while subsidence occurs over the cool SST anomalies in the eastern Indian Ocean and brings intense drought to parts of Indonesia and southeastern Australia [Ummenhofer et al., 2009] (Figure 1). The IOD system displays a skewness related to the SST anomalies in the eastern Indian Ocean. The warm surface ocean of the Indo-Pacific Warm Pool (exceeding 28°C) places a thermodynamic limitation on the magnitude of additional warming that is possible here. This means that pIOD events (eastern Indian Ocean cooling) tend to be stronger and more frequent than their nIOD equivalents (eastern Indian Ocean warming) [Cai et al., 2013] (Figure 1a). Variability of the IOD is classically defined by the Dipole Mode Index (DMI) [Saji et al., 1999] (Figure 1a). The DMI is calculated as the difference in SST anomalies between the equatorial western Indian Ocean (10°N-10°S, 50°E-70°E) and the eastern Indian Ocean (0°-10°S, 90°E-110°E) ( Figure 1b). Extended global sea surface temperature products have been produced back to the late 19th century. However, the lack of ship-based observations in the DMI regions prior to 1958 necessitates a high degree of interpolation that may not appropriately capture IOD signals [Saji et al., 1999], particularly in the coastal upwelling zone offshore of Java and Sumatra [Abram et al., 2007]. Saji et al. [1999] first used the DMI to identify the six strongest pIOD events between 1958 and 1999, and later defined nine pIOD events in this interval based on the DMI exceeding a 0.5σ threshold for at least 3 months [Saji and Yamagata, 2003] (Table 1). The DMI has since been widely applied in IOD studies; however, differences in SST data sets, time series smoothing and detrending, and in how the threshold for IOD events is defined mean that there is no single definition for years that should be termed pIOD events. The ongoing industrial-era warming trend in the tropical Indian Ocean also poses a challenge for consistent threshold-based definitions of pIOD events [Cai et al., 2009[Cai et al., , 2013. Alternate methods for IOD classification have used a lagged empirical orthogonal function (EOF) method to first remove the influence of the El Niño-Southern Oscillation (ENSO) on Indian Ocean SSTs and then used the residual SSTs in the eastern IOD upwelling region to define IOD events [Meyers et al., 2007;Ummenhofer et al., 2009]. This two-step process was designed to enable assessments of the individual and combined impacts of IOD and ENSO variability on rainfall patterns. A recent study proposed an extension of the traditional SST-derived DMI to also incorporate anomalies in equatorial surface winds and eastern Indian Ocean thermocline depth [Deshpande et al., 2014]. Using this composite definition the authors proposed that strong pIOD events have dynamical coupling between the ocean and atmosphere, whereas moderate pIOD events are a response to surface winds without ocean coupling. Similarly, another study suggested that due to nonlinear climate processes the DMI alone may not be sufficient to differentiate extreme pIOD events from more moderate events [Cai et al., 2014]. This study used the DMI as a first step for identifying the occurrence of pIOD events and proposed a second step of classification for extreme pIOD events based on the second principal component of September-November rainfall anomalies over the equatorial Indian Ocean (10°N-10°S, 50°E-70°E).  [Reynolds et al., 2002], shown as weekly values (grey) and moving 11-point average (black). Positive and negative IOD events are highlighted in red and blue shading, respectively, based on intervals when the 11-point moving average exceeds ±1.5σ (Table 1). (b and c) Spatial correlation of annual averages (April-March \"tropical\" year) of the instrumental DMI with gridded SST (Figure 1b) [Reynolds et al., 2002] and rainfall ( Figure 1c) [Adler et al., 2003] products over the Indian Ocean region. Circles show the locations of coral records used in this study (Table 2); solid boxes show the western and eastern regions where SST anomalies are used to define the DMI [Saji et al., 1999]."}, {"section_title": "Paleoceanography", "text": "\n\n\n\n\n\n\n\n\n\n\n"}, {"section_title": "10.1002/2015PA002810", "text": "This two-step classification captures the nonlinear effects of the IOD on rainfall, whereby negative rainfall anomalies project further into the central equatorial Indian Ocean during extreme pIOD events. Table 1 presents the details of years classified as pIOD events since 1958 according to different published sources. An extended reconstruction of the DMI since 1846 has been produced using monthly resolved coral records from the eastern and western IOD regions [Abram et al., 2008]. Coral oxygen isotope (δ 18 O) records document the temperature of the seawater, in which the coral grew, as well as changes in the δ 18 O composition of seawater that are primarily caused by changes in the balance of evaporation and precipitation. Together, an increase (decrease) in the 18 O content of coral results from warmer and/or wetter (cooler and/or drier) conditions. As such, coral δ 18 O captures the coupled ocean-atmosphere signal of IOD variability. The coral DMI documents a statistically significant increase in the recurrence of pIOD events from everỹ 20 years at the start of the 20th century to every~4 years by the end of the 20th century [Abram et al., 2008]. In the coral DMI reconstruction, moderate pIOD events were classified when the normalized and detrended DMI exceeded 1.5σ between July and November, and extreme pIOD events were classified as exceeding 3.0σ. This dual classification indicated that an increase in the strength of pIOD events during the 20th century had also accompanied the increase in pIOD frequency. Based on seasonal δ 18 O trends in the eastern and western coral records, the 20th century increase in the frequency and strength of pIOD events was attributed to a suppressed warming trend in the eastern equatorial Indian Ocean during the Northern Hemisphere summer monsoon season caused by intensification of the southeasterly tradewinds [Abram et al., 2008]. Nakamura et al. [2009] independently reached similar conclusions, linking the 20th century increase in the frequency of pIOD events to enhanced warming of the western Indian Ocean and intensification of the IOD-monsoon interaction. These reconstructed 20th century changes in IOD behavior have been corroborated and extended by multimodel assessments of the IOD response to increasing atmospheric greenhouse gas levels [Cai et al., 2009[Cai et al., , 2014. Using historical and future climate model  Meyers et al. [2007], Saji et al. [1999], Saji and Yamagata [2003], and Ummenhofer et al. [2009]. The BoM 08 study refers to the pIOD years listed on the Australian Bureau of Meteorology (BoM) website. Extension of the BoM classification beyond 2007 was carried out using the BoM seasonal climate summaries archived in the Australian Meteorological and Oceanographic Journal. Examination of IOD characteristics in different SST products is presented in Table 2, noting that ERSST v3b has now superseded the COADS product. b Denotes years classified as pIOD events in this study. c Denotes years classified as extreme pIOD events in this study.\nsimulations it was reported that extreme pIOD events may be nearly three times more frequent during the 21st century compared to the 20th century [Cai et al., 2014]. While the available evidence suggests that anthropogenic climate change is forcing an alteration of IOD behavior that favors more frequent and more intense pIOD events, there remains considerable uncertainty around the range of intrinsic variability of this climate mode. In particular, there is virtually no knowledge of whether multidecadal-scale variability is an important component of the IOD system. Extensive studies of the tropical El Niño-Southern Oscillation (ENSO) system have found that unforced fluctuations in the strength of ENSO variability are large, making detection of any forced changes difficult [Cobb et al., 2013]. Based on long unforced climate simulations it has been proposed that records of up to 240 years are required to fully capture the range of ENSO variability in order to make accurate assessments of any systematic changes in ENSO behavior [Stevenson et al., 2010;Wittenberg, 2009]. Similar studies have not yet been performed for the IOD, either from coral paleoclimate records or using climate simulations. As such, it is unclear how significant the recent observations and predictions of future intensification of pIOD events may be. The development of long reconstructions of IOD behavior during the Holocene would provide the necessary framework to assess the significance of recent IOD changes in the context of intrinsic and forced climate variability. However, fundamental limitations exist in extending coral-based histories of the IOD further back in time based on the west-east gradient method used for the DMI. First, while fossil corals are frequently preserved at sea level along the Indonesian coastline by tectonic activity [Abram et al., 2003[Abram et al., , 2007, they are rarely preserved in tectonically stable regions such as the western DMI sector. This severely limits the ability to find coeval fossil coral samples from both IOD sectors. Second, even using extremely precise dating methods, the ages of fossil corals spanning the last 1000 years are usually known to at best ±5 years [Cobb et al., 2003]. Thus, even if it were possible to locate coeval fossil coral samples from both DMI sectors, it would not be possible to combine these with absolute certainty at a year-to-year level. Hence, future extension of the IOD history requires us to characterize an optimum location where a large proportion of IOD variability can be captured at a single site. In this study, we use coral δ 18 O and instrumental SST records from a variety of sites across the equatorial Indian Ocean to examine the ability of a single coral reef location to capture information about both the occurrence and magnitude of pIOD events. We also use unforced climate model simulations to estimate the likely range of intrinsic variability within the IOD system and potential biases caused by short paleoclimate reconstruction windows. Together, this information provides a foundation for the development of paleo-IOD reconstructions that will be valuable in understanding the response of IOD variability to a range of natural and anthropogenic climate forcings, including increasing atmospheric greenhouse gas levels.\nAn internal laboratory standard (ANU-M2; δ 18 O v-PDB = À7.32‰, σ = 0.09, n = 201) was also used to verify cross-instrument performance. Reproducibility of δ 18 O measurements was assessed based on the standard deviation of NBS-19 analyses within the same sequences where the coral samples were measured, and is estimated at 0.046‰ (199 measurements across 36 runs) for coral TT01-A-1b, and 0.049‰ (57 measurements across 10 runs) for coral SW12-C-1. Chronologies were developed for the coral records by assigning the annual δ 18 O maximum to the month of the climatological SST minimum at both sites (November at South Pagai Islands; September in Sunda Strait; Figure 2). A depth-age conversion was performed using linear interpolation between the annual tie points, and the coral δ 18 O records were then resampled using linear interpolation to generate monthly resolved time series. This is consistent with the objective chronological methods used for the other corals assessed in this study and is estimated to result in age scales with seasonal uncertainties of~1-2 months [e.g., Charles et al., 1997].\nwestern DMI sector. We then used the model DMI to determine the occurrence of pIOD events; defined as when the model DMI exceeds +1.5σ for at least three consecutive months. This classification is more stringent than the classification we apply to the instrumental DMI; however, we believe this to be justified as previous assessments have demonstrated that many climate models tend to overestimate the strength of the Bjerknes feedback in the Indian Ocean region, resulting in higher model pIOD frequency than observations [Cai et al., 2011]. We also use the model ensemble to examine SST variations in the single nearest ocean grid cell to the South Pagai coral site (~3°S, 100.5°E). This choice is guided by our analysis of modern coral δ 18 O records, which suggests that this is the likely area of optimum single-site IOD variability. The optimum location SST from each model is used to examine the strength of IOD-SST relationships in the ensemble and to assess the stationarity of IOD signals in SST variability at this single-site location.\nThe non-IOD season disparity between Sunda Strait coral δ 18 O and SST becomes clearer through comparison of their average annual cycles. The alignment of the coral δ 18 O maximum to the month of minimum SST (September) results in a summer minimum in δ 18 O ( approximately February-March) that is notably earlier than the annual peak in gridded SST (April-May). A secondary minimum (January) is seen in the Sunda Strait SST record and may be associated with water masses that are transported southward from the Java Sea during the non-IOD season (i.e., the Asian winter monsoon season) as its timing coincides with the January-February minimum in Java Sea temperature (Figure 2b). The deviation of the coral δ 18 O record from gridded SST during the non-IOD season may then indicate that corals from near the southern end of Sunda Strait capture climate information related primarily to SST variability in eastern Indian Ocean SST, but that they also have the potential to be influenced by water transported from the Java Sea in this season. Future coupled Sr/Ca measurements on the Sunda Strait coral, and seawater δ 18 O measurements from the site, will likely provide more clarity on the processes controlling coral δ 18 O at this site during the non-IOD season. Despite these uncertainties in the interpretation of coral δ 18 O during the non-IOD season, we  Figure 1a) [Reynolds et al., 2002], and since 1958 using the monthly resolution ERSST v3b data set (grey) [Smith et al., 2008]. Note that the ERSST v3b DMI has been rescaled to match the mean and standard deviation of the NOAA DMI product since 1981. Red shading denotes years classified as pIOD events (Table 1). (b) Coral δ 18 O records (colors) are shown along with the corresponding 1°× 1°SST record for each site (black) [Reynolds et al., 2002]. Coral isotope records are plotted with an isotope range denoted by the scale bar. (c) Location of the coral records used in this study (circles), where the colors match the respective isotope curves in Figure 3b. Red and blue boxes show the location of the western and eastern DMI regions, respectively.\nconclude that the Sunda Strait coral reliably captures SST variability characteristic of the eastern Indian Ocean during the July-December IOD season.\nat high enough resolution to enable anomalies specific to the July-December IOD season to be isolated. IOD-season correlations for the Sunda Strait coral are the second highest of all of the locations examined here, with a significance of P = 0.005 and~33% of DMI variance explained (Table 3). At the event level, identification of pIOD events in Sunda Strait coral δ 18 O is best for extreme events, whereas moderate events are not always reliably identified (Figure 4).  (Figures 3 and 4). The gridded SST data for this site suggest that while moderate pIOD events coincide with cool anomalies there is limited differentiation of these anomalies from non-IOD years (Figure 4). However, the detection of moderate pIOD events in coral δ 18 O is clear, most likely due to the additional influence of associated pIOD rainfall anomalies on coral δ 18 O. Correlation of the South Pagai coral δ 18 O record with the instrumental DMI suggests that it is possible to capture on the order of 50% of the variance of the IOD at this single optimal location (Table 3), making it an ideal location for fossil coral studies of prehistoric IOD variability. At the northern end of the eastern Indian Ocean coral sites examined here, the Mentawai coral documents prominent ocean cooling during extreme pIOD events. Once again, the small climatological SST range allows for an unambiguous determination of the occurrence of the most extreme pIOD events. However, at this northerly location there is no consistent SST or coral δ 18 O anomaly associated with moderate pIOD events, as upwelling does not extend as far north as the equator at these times (Figures 3 and 4). Figure 5 shows an expanded view of the eastern Indian Ocean coral and SST time series for intervals spanning 1960-1968 and 1990-1998. These are periods of time when a number of pIOD events, including extreme events, took place. This expanded view further demonstrates the way that the cool SST anomalies associated with pIOD upwelling develop in the east near Bali and Java, before they migrate and intensify toward Sumatra. Based on our assessments, we conclude that the optimum eastern Indian Ocean location for detecting both the occurrence and magnitude of pIOD events using coral archives is in the vicinity of the South Pagai Islands. Examination of the coral δ 18 O and instrumental SST records from the western Indian Ocean shows that while these sites tend to record warming during pIOD events, there are also frequent warm anomalies of a similar magnitude that do not correspond with pIOD events. Corals from the Seychelles capture on the order of 14% of IOD-season variance, while at Kenya correlations with the DMI are not significant in either annual average or IOD-season assessments (Table 3). This means that without additional knowledge it is difficult to use corals from these sites to confidently infer the occurrence of IOD events. Thus, while we acknowledge the importance of the tropical western Indian Ocean in the behavior of the coupled ocean-atmosphere IOD system, it appears that the eastern Indian Ocean is a more useful target for paleoclimate studies aimed at studying event-level IOD behavior.  1963, 1967, and 1991) and extreme (1961, 1994, and 1997) pIOD events at different sites along the Javan and Sumatran coasts during intervals of frequent pIOD activity.\nThis detailed examination of instrumental and coral data supports the analysis of Meyers et al. [2007], who suggested that upwelling in the eastern IOD region was one of the fundamental physical processes involved in pIOD events. These authors argued that, similar to the upwelling processes in the eastern Pacific that are fundamental to El Niño and La Niña events, it is possible to generate a reliable representation of pIOD activity using information derived exclusively from the eastern pole of the IOD system. Similarly, other studies have noted that the IOD-SST signal appears to lack spatial stationarity in the western IOD region [Deshpande et al., 2014], whereas oceanic changes in the eastern Indian Ocean are a fundamental component in defining IOD variability [Deshpande et al., 2014;Zhao and Nigam, 2014].\ncompiled to calculate the 5-95% range of pIOD recurrence estimates. We find a similar pattern for all models (Figure 7), where the range of possible pIOD recurrence estimates is very large at short window lengths, and the estimates converge toward the overall mean as the analysis window increases. In simple terms, the longer the analysis window, the more representative the calculated pIOD interval will be of the overall recurrence interval. It is also apparent that the distribution of pIOD recurrence estimates is asymmetric about the true mean ( Figure 7). Estimates of less frequent occurrence (i.e., a longer recurrence interval) have the potential to be more biased than estimates of more frequent occurrence. This bias can also been seen within a single model. Using the 10,000 year CSIRO Mk3L simulation, we divided this data set into nonoverlapping 500 year cuts to replicate the typical length of CMIP5 preindustrial control runs (Figure 7b). The 95% (upper) range on pIOD recurrence interval displays a much greater range among these cuts than the 5% (lower) range on pIOD recurrence estimates. To better visualize the sensitivity results across multiple models with different mean pIOD recurrence intervals (Table 4), we calculated for each model the 5-95% range of pIOD recurrence estimates expressed as a deviation from the overall pIOD recurrence interval (Figure 7c). For the CSIRO Mk3.6.0 model, which has the most active IOD of the models examined here, the 5-95% range of recurrence interval estimates is À2.9 to +14 years for 20y windows, À1.9 to +5.2 years for 50y windows, À1.3 to +1.9 years for 100y windows, and À0.6 to +0.6 years for 200y windows (where deviations are relative to the mean pIOD recurrence interval of 5.8 years). For comparison, using the MPI ESM-LR model (mean pIOD recurrence of 11.8 years) the 5-95% range of recurrence interval estimates is À6.8 to >20 years for 20y windows, À4.6 to +13.2 years for 50y windows, À3.4 to +8.2 years for 100y windows, and À3.1 to +2.5 years for 200y windows. What does this mean for how prehistoric windows of paleoclimate information from corals are interpreted with respect to the IOD? It is important to be aware of the potential biases that short reconstruction intervals will have, and particularly that these biases are more strongly skewed toward overestimating the true pIOD recurrence interval. It is also difficult to define a single optimum length for these records as the magnitude of potential biases will change depending on the overall frequency of pIOD events in a particular climate state. As a general rule though, the less frequent pIOD events are the more potential there is to overestimate the true pIOD return interval. Hence estimates of past intervals of reduced pIOD activity will have more uncertainty associated with them than similar length estimates of high pIOD activity. The findings also highlight that even for very long paleoclimate windows there will be some Figure 7. The effect of sample window size on estimated pIOD recurrence in preindustrial control simulations. (a) Example using ACCESS1.0. Thick colored line denotes the median, and shading denotes the 5-95% range of pIOD recurrence estimates according to analysis window length, with the range converging toward the mean pIOD recurrence rate (dashed black line) as the analysis window increases. Grey shading denotes recurrence intervals greater than the analysis window. (b) Details as in Figure 7a but using the long control run of the CSIRO Mk3L model. Grey curves denote 5-95% ranges calculated in nonoverlapping 500y portions of the 10,000y simulation. (c) Details as in Figure 7a but for the multiple models assessed in this study. To facilitate the multimodel comparison the y axis in Figure 7c shows the deviation of the 5-95% range in pIOD recurrence estimates relative to the mean pIOD recurrence for each model (dashed black line).\nuncertainty in estimates of the long-term mean pIOD recurrence interval, which means that small changes in apparent recurrence could be difficult to interpret as a forced change in IOD activity.\nThis model analysis provides valuable support for the assumption that the impact of the IOD on SST variability in the optimum eastern Indian Ocean location is likely to be a stationary feature of the climate system. A caveat to this statement is that it is yet to be determined if this stationarity holds over longer time periods when climatic boundary conditions may have changed. In particular, aspects of IOD behavior in the eastern upwelling region are connected to the Asian monsoon and ENSO systems, which are known to have undergone changes during the Holocene. However, fossil coral evidence for IOD activity along the Mentawai Island chain demonstrates that the Javan-Sumatran coast has been sensitive to IOD climate events since at least the mid-Holocene [Abram et al., 2007]. This adds weight to the notion that fossil corals from sites along the eastern IOD upwelling region have the potential to greatly enhance our understanding of the preindustrial characteristics and variability of the IOD.\nO records associated with this manuscript are accessible from the World Data Center for Paleoclimatology at http://www.ncdc. noaa.gov/paleo/study/18895. Other data used in this study was sourced from the following sites: Coral DMI reconstruction ftp://ftp.ncdc.noaa.gov/pub/data/paleo/ coral/indian_ocean/mentawai2008.txt. Instrumental DMI based on OISST data: http://stateoftheocean.osmc.noaa.gov/ sur/ind/dmi.php. Bureau of Meteorology pIOD classification http://www.bom.gov. au/climate/IOD/positive/ and extension of the BoM classification using the BoM seasonal climate summaries archived in the Australian Meteorological and Oceanographic Journal http://www.bom. gov.au/amoj/index.shtml. CMIP5 preindustrial control simulations were accessed from the Earth System Grid Federation (http://pcmdi9.llnl.gov/esgf-web-fe/)."}, {"section_title": "Methods", "text": ""}, {"section_title": "Instrumental Data", "text": "In this study we primarily use the NOAA 1°x 1°gridded SST data set (Optimum Interpolation Sea Surface Temperature version 2 (OISST v2)), derived from ship, buoy, and satellite observations since November 1981 [Reynolds et al., 2002]. These data are used for identifying recent pIOD events (Table 1) and to examine SST signals at sites where coral δ 18 O records are available. An extended instrumental DMI derived from the Extended Reconstructed Sea Surface Temperature version 3b (ERSST v3b) 2°x 2°gridded SST product [Smith et al., 2008] is also used to examine correlations between coral δ 18 O records and the DMI as it provides a longer overlap than the OISST-derived DMI. We only use the portion of ERSST v3b from 1958 onward, where sufficient ship-based SST observations are believed to result in a more accurate product for the IOD regions [Saji et al., 1999]. In Table 2 we compare the characteristics of IOD variability within the OISST v2 [Reynolds et al., 2002] and ERSST v3b [Smith et al., 2008] data sets, as well as in the Hadley Centre Global Sea Ice and Sea Surface Temperature (HadISST) product [Rayner et al., 2003]. The OISST-derived DMI data are used to extend the existing definition of pIOD events up to the end of 2014 (Table 1). The weekly resolved DMI data are derived from the NOAA Ocean Observations Panel for Climate and is based on SST anomalies calculated relative to the climatological seasonal cycle using a reference period of 1982-2005. We applied a moving 11-point average to the weekly data and calculated the standard deviation of the smoothed DMI ( Figure 1a). Selecting a pIOD threshold of 1.5σ (σ = 0.42°C) for the smoothed DMI results in a classification of pIOD years that is in good agreement with the most widely accepted pIOD events listed in previous studies (Table 1). A threshold of 3.0σ also appears to be a good measure of extreme pIOD events, although we note that in some studies 2006 is not classified as an extreme event [Cai et al., 2014]. Based on previous assessments and our extension of the DMI classification up to present day, we define 1961, 1963, 1967, 1972, 1977, 1982, 1991, 1994, 1997, 2006, 2007, 2008, 2011, and 2012 as years of pIOD events (Table 1). Of these, 1961Of these, , 1994Of these, , 1997Of these, , and 2006 are classified as extreme pIOD events."}, {"section_title": "Coral Data", "text": "We use previously published Porites coral δ 18 O records from sites within or near the eastern and western IOD regions. These sites include the northern Mentawai Islands [Abram et al., 2008], and Lombok Strait near Bali [Charles et al., 2003] in the eastern Indian Ocean. In the western Indian Ocean we use coral records from the Seychelles [Charles et al., 1997;Pfeiffer and Dullo, 2006] and from Kenya [Nakamura et al., 2009]. All previously published coral data are archived and available at the World Data Center for Paleoclimatology, with the exception of one of the Seychelles records [Pfeiffer and Dullo, 2006] that was provided by M. Pfeiffer. We also present two new modern Porites δ 18 O records from sites along the Java and Sumatran coasts. Coral SW12-C-1 was drilled in June 2012 approximately 30 m offshore of Batu Hitam beach (6°32′S, 105°38′E). The coral colony was estimated to be~2.5 m high, with its upper growth surface~0.5 m below the low tide level. The coral was located near the outer margin of a fringing reef system on the southwest Javan coast of Sunda Strait. The 48 cm long coral core covers the period spanning from 1989 to 2012. Coral TT01-A-1b was drilled in June 2001 from the fringing reef offshore of Taitaitanopo Island, in the southern South Pagai island group (3°11′S, 100°31′E). The fringing reef is open to the approximately 100 km wide Mentawai Trough to the east and lies close to the southernmost point of the Mentawai Island chain, which receives high wave energy from the southwest due to its unrestricted aspect to the Indian Ocean. The TT01-A-1b coral colony was estimated to be~2.5 m high, with its upper growth surface~0.7 m below the low tide level. The coral core has been sampled and analyzed for δ 18 O over the interval spanning from 1959 to 2001. Following standard procedures, the coral cores were sliced into 7 mm thick slabs along their major growth axis and X-rayed to reveal the internal growth structure. Coral sampling followed tracks of maximum growth and was carried out by preparing 2.5 mm thick ledges along the sampling tracks. Prior to microsampling, each coral piece was immersed in deionized water and the sampling ledge was thoroughly cleaned using an ultrasonic probe. Cleaned coral pieces were then dried for 48 h in an oven at 40°C. Samples were micromilled continuously at 0.5 mm increments, equating to approximately fortnightly resolution. The X-rays and sampling tracks for both corals are presented in the supporting information that accompanies this paper (Figures S1 and S2). Corals TT01-A-1b and SW12-C-1 were analyzed for δ 18 O by a Thermo MAT-253 mass spectrometer coupled to a Kiel-IV carbonate device using~120 μg aliquots of carbonate powder. This instrument is part of the Stable Isotope Facility at the Research School of Earth Sciences, The Australian National University (ANU), and has been set up specifically for the high-precision analysis required for coral paleoclimate studies. Each analysis sequence was calibrated using a mean offset determined by measurements of the International Atomic Energy Agency (IAEA) standard NBS-19 (δ 18 O v-PDB = 2.20‰), followed by a linear trend correction using the IAEA NBS-18 standard (δ 18 O v-PDB = À23.0‰; NB: the old IAEA reference value for NBS-18 is used to maintain long-term consistency of results across different mass spectrometers at the ANU Stable Isotope Facility). a Statistics are based on annual averages that span the tropical year from April to March and use the DMI calculated from each SST product compared with SST anomalies in the same product. References for data products are OISST v2 [Reynolds et al., 2002], ERSST v3b [Smith et al., 2008], and HadISST [Rayner et al., 2003]. b n.s. denotes correlations where significance (P) values are greater than 0.05 (below 95% confidence)."}, {"section_title": "Climate Simulations", "text": "To assess the possible range of intrinsic variability in the IOD system, and the interpretations that can be made with only short windows of coral paleoclimate information, we examine a multimodel ensemble of climate simulations. We use a subset of preindustrial control simulations run as part of the Fifth Coupled Model Intercomparison Project (CMIP5) [Taylor et al., 2012]. Our chosen subset incorporates models that have previously been assessed as showing some level of eastern IOD skewness analogous to observed IOD behavior [Cai et al., 2014], and we use this measure to examine IOD variability in unforced simulations spanning a range of skewness levels. We note that the five models analyzed in this study represent only a small fraction of the more than 50 different climate models that participated in the CMIP5 exercise. Our examination of the model subset is not designed to be a thorough analysis of the IOD in the full range of available climate simulations; the selected models are used only as a tool to provide additional perspective on the interpretation of paleoclimate data generated from corals. The CMIP5 preindustrial control experiments used in this study are between 500 and 1000 years long. We also use a 10,000 year preindustrial control simulation of the Commonwealth Scientific and Industrial Research Organisation (CSIRO) Mk3L model version 1.2 [Phipps et al., 2011[Phipps et al., , 2013 to examine the range of intrinsic IOD variability in a much longer control simulation than is available from standard CMIP5 experiments. In all of the preindustrial control experiments we calculate a model DMI using SST variations in the eastern and western IOD regions defined by Saji et al. [1999]. The SST data for each region were converted to anomalies by removing the mean annual cycle, and the anomaly in the eastern DMI region was subtracted from that in the  . Also shown in Figure 2b is the mean annual cycle of SST for the Java Sea to the north of Sunda Strait (dashed grey line and crosses), which suggests that water masses from north of Sunda Strait have little influence at the southern Sunda Strait coral site."}, {"section_title": "Results and Discussion", "text": ""}, {"section_title": "Characteristics of New Coral Records", "text": "We first examine the characteristics of δ 18 O signals in the South Pagai and Sunda Strait coral records developed for this study. For similar assessments of the other coral δ 18 O records used in this study (Table 3) we refer readers to their original publications [Abram et al., 2008;Charles et al., 1997Charles et al., , 2003Nakamura et al., 2009;Pfeiffer and Dullo, 2006]. As well as examining the monthly resolved time series data (Figure 2), we also perform correlation analysis against instrumental SST using (i) annual averages that span a \"tropical year\" from April to March that is designed to prevent splitting of IOD-and ENSO-related signals across adjacent years [Tierney et al., 2015] and (ii) for the half-year spanning approximately July-December, which we term the \"IOD season.\" The coral record from the South Pagai Islands covers the period from 1959 to 2001 ( Figure S1). Coral δ 18 O correlates significantly (P < 0.05) with the OISST v2 1°x 1°grid cell that includes the South Pagai Islands, using both annual tropical-year averages (April-March; r = À0.75) and for IOD-season averages (July-December; r = À0.88). The coral has a mean annual δ 18 O range of 0.35‰, compared with a mean annual SST range in the OISST v2 data set of 1.2°C (Figure 2a). The annual range in coral δ 18 O is larger than expected based on SST alone, using published coral δ 18 O-SST dependencies of between 0.17‰°C À1 and 0.23‰°C À1 [Gagan et al., 2012]. Previous studies in the Mentawai Islands chain have shown that ocean-atmosphere climate coupling acts to enhance the IOD-related climate signal captured by coral δ 18 O over that expected from SST anomalies alone [Abram et al., 2007[Abram et al., , 2008. The sharp 18 O enrichments that characterize the winter isotopic maximum in the South Pagai coral similarly support an additional and complementary rainfall modulation of the coral record during the IOD season. The Sunda Strait coral δ 18 O record covers the period from 1989 to 2012. It has an average annual average δ 18 O range of 0.47‰, while the mean annual SST range of the associated OISST v2 grid box is 1.8°C (Figure 2b). The coral δ 18 O time series correlates significantly with the corresponding SST record for the July-December IOD season (r = À0.60, P < 0.05). However, correlations of the coral δ 18 O record with instrumental SST are not significant when calculated using annual averages. a Correlations are performed using annual average and IOD-season data. Correlation coefficients (r) and significance (P) are given, as well as the estimated percentage of DMI variance explained by the coral δ 18 O records based on the correlation coefficient (r), where variance explained = r 2 × 100. b Annual averages defined on a tropical year running from April to March. c IOD-season averages span the half-year from July to December. d n.s. denotes correlations where significance (P) values are greater than 0.1 (below 90% confidence)."}, {"section_title": "Optimum IOD Location", "text": "We next examine the suitability of single sites for capturing IOD variability by comparing coral δ 18 O records from various sites in the tropical eastern and western Indian Ocean with local SST time series and the instrumental DMI since 1958 ( Figure 3 and Table 3). IOD-season averages of the coral δ 18 O and SST data from each site are also used to examine the deviation of climate anomalies recorded during pIOD and extreme pIOD events (Figure 4). Along the coasts of Java and Sumatra in the eastern Indian Ocean a progression is seen in the magnitude of SST anomalies that occur during pIOD events. Around Bali, which lies in the most easterly location examined here, all pIOD events tend to coincide with cool SST anomalies and corresponding coral 18 O enrichment signals. However, there is no clear separation at this location in the magnitude of coral δ 18 O anomalies (or instrumental SST anomalies) associated with moderate or extreme pIOD events (Figures 3 and 4). This is because Bali lies in the region where initial upwelling and sea surface cooling begin during pIOD events, but as the events continue to develop the core of the upwelling signal migrates and intensifies in a northwest direction toward Sumatra. In the Sunda Strait location, annual average correlations of coral δ 18 O with the IOD are not significant (Table 3). Nonetheless, the short modern coral record that has been analyzed from Sunda Strait suggests that fossil corals from this region can provide valuable data on past IOD behavior if the corals are sampled O and instrumental SST signals during pIOD event years. IOD season (July-December) averages were standardized and their distribution plotted with years classified as neutral or nIOD (grey crosses), pIOD (colored circles) and extreme pIOD (colored diamonds). Note that the standardized coral isotope (σ coral ) and instrumental SST (σ SST ) scales were inverted for the western Indian Ocean corals and the eastern Indian Ocean instrumental SST records, respectively, so that in all cases positive standard deviation values should correspond with pIOD states. The absolute magnitude of variability in the July-December δ 18 O and SST averages at each location is given by the 1σ values to the right of the plot."}, {"section_title": "Optimum Length", "text": "The frequency of pIOD events has shown considerable variance over the 20th century, ranging from one event every~20 years in the early 1900s and increasing to one event every~4 years in recent decades [Abram et al., 2008;Nakamura et al., 2009]. This potential for large changes in the frequency of pIOD events demonstrates a need to understand how the length of coral paleoclimate reconstructions could influence assessments of IOD activity at different times in the past. To assess this we performed sensitivity tests on preindustrial model output from five different climate models, which cover a range of negative skewness levels for mean annual SST variability in the eastern IOD region (Table 4). We first determined the characteristics of mean IOD variability in each model; of the models assessed, CSIRO-Mk3.6.0 has the most frequent recurrence rate for pIOD events (5.8 years), while low resolution version of Max Planck Institute Earth system model (MPI ESM-LR) has the least frequent pIOD events (11.8 years mean recurrence). Using these two control model simulations as an example ( Figure 6) it can be seen that unforced variability in the IOD can result in a range of estimates of pIOD recurrence intervals depending on the duration of discrete analysis windows and their position within the time series. The level of uncertainty in pIOD activity estimates was examined for each of the climate model simulations using moving, overlapping windows, ranging between 10 and 250 years in length. For each window, the pIOD recurrence interval was calculated based on the number of pIOD events identified in that window. The results for each window length were then  "}, {"section_title": "Stationarity", "text": "A critical assumption in our assessment of the optimum location for paleo-IOD reconstructions is that the spatial patterns of IOD-forced SST anomalies remain stationary over time. It is likely that this is a reasonable assumption, particularly for the eastern Indian Ocean sector as the location of coastal (Ekman) upwelling here is constrained by the geography of Java and Sumatra. Nevertheless, we examined this further using the preindustrial climate simulations to calculate the distribution of DMI versus optimum-site SST correlations at different window lengths (Figure 8). We find that all of the models examined here display correlation distributions that show a significant inverse relationship between the model DMI and SST at the South Pagai grid cell. Across models, the correlations are strongest and most highly stationary in models with more frequent pIOD events (e.g., ACCESS and CSIRO Mk3.6.0; Table 4). The models with less frequent pIOD events, and where the DMI accounts for a lower proportion of the SST variability in the South Pagai grid cell (e.g., CSIRO Mk3L and MPI ESM-LR; Table 4), display a larger spread in the range of negative DMI versus SST correlations. However, the full distribution of correlations remains highly significant even in these models. Assessment within each model of the impact of reconstruction window length shows that even at short (20y) window lengths the distribution of correlation coefficients exhibits very little additional spread compared to the same analysis performed using much longer (100y) windows (shading versus solid lines in Figure 8). This demonstrates that the climate models assessed here do not indicate any multidecadal scale fluctuations in the impact of the DMI on SST variability at the optimum-site grid cell that could affect IOD interpretations based on short paleoclimate reconstructions. "}, {"section_title": "Future Application", "text": "Tectonic activity has preserved fossil corals of various ages along the Sumatran and Javan coasts where optimum reconstructions of the IOD could be achieved. Fossil coral preservation events in this region include reef emergence events associated with recurrent mega-earthquakes along the Sunda subduction zone [Sieh, 2005;Sieh et al., 2008], and tsunamis such as the event associated with the 1883 eruption and collapse of Mount Krakatau. Age assessments of fossil coral material collected from Sunda Strait and the Mentawai Island chain (including the South Pagai Islands) indicate that fossil corals spanning throughout the middle to late Holocene are preserved here [e.g., Abram et al., 2003;Sieh et al., 2008]. The targeted approach outlined in this study sets up a framework for developing and interpreting fossil coral paleoclimate records of the IOD climate system. Future work will need to consider the ways in which IOD signals are manifest at different sites along the Javan and Sumatran coasts (e.g., Figure 5), particularly if paleoclimate records are to be compared between different locations along the eastern upwelling zone. Chronological uncertainty will also be an important aspect to address, as the small annual SST cycle in this region may introduce an additional error into assessments of past IOD recurrence intervals. The application of new statistical methods to determine age models with quantified uncertainty will be invaluable in these assessments [e.g., Wheatley et al., 2012]. Finally, high-precision U-series dating of fossil coral material has the potential to allow short fossil coral sections to be spliced together to form longer, continuous time series [Cobb et al., 2003]. This would be advantageous for overcoming uncertainties in IOD recurrence estimates determined using short fossil coral records. Our findings are aimed specifically at informing future paleoclimate studies of the Indian Ocean Dipole. However, the methods discussed here are also applicable to the targeted reconstruction of other modes of climate variability. By combining instrumental data, model simulations and pilot coral records it is possible to make informed assessments that will both maximize the amount of information gained through targeted paleoclimate reconstructions and enhance the climatic interpretation of these records."}, {"section_title": "Conclusions", "text": "In this study we have examined observational SST records and coral δ 18 O records at various sites in the tropical Indian Ocean, alongside multimodel control simulations of Indian Ocean SST variability to provide a framework for future targeted analysis of the Indian Ocean Dipole climate mode. Our findings indicate that the optimum site for fossil coral-based reconstructions of the IOD is located in the eastern Indian Ocean, in the region spanning from west Java and along the Sumatran coast (~3-7°S). Isolating the July to December IOD-season of the coral δ 18 O record maximizes the amount of DMI variability that is explained, and at the optimum South Pagai site can equate to 50% of the variance. An assessment of Indian Ocean SST variability in a multimodel set of preindustrial control simulations demonstrates potential biases on the estimated pIOD recurrence interval caused by unforced IOD variability and reconstruction window length. These biases are more strongly skewed toward underestimating rather than overestimating the recurrence interval of pIOD events, particularly at smaller reconstruction windows or in climate scenarios where pIOD events are less frequent. An assessment of stationarity of model IOD-SST relationships further suggests that the assumption of geographically-locked stationarity is reasonable for the optimum eastern Indian Ocean location identified in this study. Future work using the targeted framework outlined in this study has the potential to greatly enhance our understanding of the Indian Ocean Dipole climate system."}]