[{"section_title": "Abstract", "text": "00 44 203 448 3553 Word count 1386 References 10 Financial disclosures: JMS has received research funding and PET tracer from AVID Radiopharmaceuticals (a wholly owned subsidiary of Eli Lilly); has consulted for Roche, Eli Lilly, Biogen and Merck; received royalties from Oxford University Press and Henry Stewart Talks; given education lectures sponsored by Eli Lilly and Biogen; and serves on a Data Safety Monitoring Committee for Axon Neuroscience SE. TDP has no disclosures"}, {"section_title": "2", "text": "In this edition of Biological Psychiatry, Wachinger and colleagues describe the results of a combined genetic and imaging study of Alzheimer's disease (1) . Individually, genetic discoveries and non-invasive brain imaging have both been instrumental in shaping contemporary views of the biological underpinnings of Alzheimer's disease (AD). The first major genetic breakthroughs came in the 1990s with the identification of the three genes (APP, PSEN1 and PSEN2) that cause AD on an autosomal dominant basis. Discovery of these genes, which influence -amyloid (A) processing, led to the development of the 'amyloid cascade hypothesis', which suggests that accumulation of toxic forms of A is an upstream and key initiating factor of the disease (2) . Although the precise mechanisms are not yet fully delineated, A accumulation is thought to lead to inflammation, accumulation of intracellular taucontaining neurofibrillary tangles, as well as dendritic and neuronal destruction that ultimately manifests as macroscopic, but regionally specific, cerebral atrophy, which is then mirrored by clinical symptoms. These discoveries have in turn led to the development of animal and cellular models and to novel, if as yet unproven, therapeutic strategies. Possession of an APOE e4 allele identified in the 1990s, remains the single most important genetic risk factor for the much more common late-onset sporadic form of the disease. More recently, advances in genetic technologies particularly when applied to very large cohorts of patients have allowed for genome-wide associations studies (GWAS), which have identified more than 20 genetic risk factors for AD (3). Whilst each of these genes individually confers only a small risk, together they explain a significant proportion of an individual's risk for AD. Importantly, these genetic risks have begun to provide evidence for novel pathways leading to AD -implicating A and tau processing, but also neuroinflammation, cholesterol/sterol metabolism and endosomal vesicle recycling, avenues that are being actively explored in cellular and animal models as potential therapeutic targets (2) .\nInsight into the pathogenesis, progression and diagnosis of human (as opposed to animal and cellular models of) AD have been hugely advanced using neuroimaging techniques. These include structural imaging -initially with computed tomography (CT), latterly with magnetic resonance imaging (MRI) -and positron emission tomography (PET) ligands that quantify glucose-metabolism, and more recently tracers targeted to core AD proteins, in the form of A and tau PET. Cross-sectional imaging approaches both to identify volume loss and deposition of A are now 3 included in new diagnostic criteria; and serial MR imaging studies have consistently showed excess brain volume loss in patients with AD, information which is being used as a potential trial outcome measure for clinical trials.\nCombining genetics and imaging together in the context of autosomal dominant AD has allowed for studies of AD to extend into the pre-symptomatic phase of the disease. Early studies revealed that not only are rates of whole brain and hippocampal atrophy higher in patients with symptomatic autosomal dominant AD, but they are also increased in individuals harbouring mutations who are destined to develop the disease several years before the symptoms start (4) . Combining multimodal imaging techniques has allowed for the spatial and temporal patterns of imaging abnormalities to be explored in vivo in this presymptomatic phase, with evidence that fibrillary A deposition, as measured using A PET, starts perhaps two decades before symptoms, and prior to the development of hypometabolism and excess brain volume loss all of which precede symptoms by many years (5) . These findings, which are now being replicated in elderly individuals at risk of AD, have provided vital evidence both for presymptomatic neurodegeneration, but also selective vulnerability of specific brain regions in AD, and has led to a change in our conceptualisation of AD as a biological continuum with a long pre-symptomatic period. This provides a critical window of opportunity for disease prevention studies and longitudinal neuroimaging biomarkers are a potential means of monitoring this progression, and the effect of putative disease modifying drugs.\nWhat of the influence of genetic risk on brain structure in typical, late onset AD?\nNumerous studies have explored the relationship between APOE status and imaging outcomes, providing evidence not only that APOE e4 carriers are at increased risk of disease, but may have more focal and faster hippocampal atrophy, increased cerebral A deposition and cerebral hypometabolism (6). As for genetic risks that are either rarer or exert less risk, imaging can either be used as an outcome, i.e. an endophenotype to increases power to detect genetic variants (7) ; or as a means of assessing what influences previously identified genetic risks have on brain structure and function.\nWachinger and colleagues take a combined MR imaging/genetics approach to investigate the influence of genetic risk factors for AD not on brain volumes, but instead on brain symmetry (1) . Using the Alzheimer's Disease Neuroimaging Initiative (ADNI) cohort, they apply a recently described image analysis technique based on determining the shape of brain structures -Brainprint. This method involves segmentation of cortical and subcortical brain substructures using the widely used Freesurfer package, application of a 3D mesh based approach to compute a spectral shape descriptor for each structure, and for the purposes of this analysis, computation of the distance between -and hence asymmetry oflateralised substructures. They then assessed the influence of a number of risk genes for AD and genes implicated in brain structure on evolving AD related asymmetry in a number of subcortical brain structures including the hippocampus, amygdala, putamen and caudate. They found that TNKS and DLG2, genes previously associated with differences in amygdala and putamen symmetry, also influence AD-related asymmetry in these regions. Genes identified as risks for AD -namely BIN1, ZCWPW1, ABCA7 and CD2AP -all also had effects on brain symmetry associated to AD. No associations, however, were found between neuroanatomical asymmetry and APOE genotype.\nThese results are intriguing but not straightforward to interpret. Whilst the human brain has distributed and in some cases highly lateralised functions, at least at a gross macroscopic level brain structure is fairly symmetrical. In a clinical setting the presence of symmetrical hippocampal volume loss on MRI is used to support for the diagnosis of AD. Whilst a number of volumetric studies have shown that there are subtle structural asymmetries as AD progresses -with left hippocampal volume loss slightly exceeding that seen on the right (8) -this is in stark contrast to other neurodegenerative diseases such as frontotemporal dementia which are characterised by often striking asymmetric focal atrophy (9), for example the left inferior medial temporal volume loss that characterises sporadic semantic dementia due to TDP-43 type C pathology; or the unilateral hemispheric atrophy seen in patients with frontotemporal dementia due to progranulin mutation again associated with TDP-43 pathology. Brainprint has been specifically designed to detect more subtle asymmetries than can be determined from volumetric studies, and the authors have previously applied it to show that progression of AD is associated with progressive unilateral shape asymmetry (10) . However, given the wide range of other neuroimaging and fluid biomarker modalities that can provide disease-specific information regarding AD and that detection of asymmetries of this nature require advanced MRI analysis techniques, it is in our view unlikely that such an approach will find diagnostic utility in a clinical setting. However, the fact that risk genes both for 5 AD and implicated in influencing subcortical volumes may impart subtle differences in the symmetry of brain -including in some regions typically implicated in AD -as the disease progresses, may provide valuable insights into the genetic influence that impact on selective vulnerability. It is inevitable that different genetic risk factors for AD will exert their influences at different stages of the AD pathological cascade: technique like this may prove useful in identifying those that influence aspects of neurodegeneration (e.g. BIN1), as opposed to those principally influencing A deposition (e.g. APOE). Understanding what underpins these shape changes, e.g. using high field MRI and ultimately pathological confirmation -may also provide valuable insights into pathogenesis. Is for example AD related asymmetry driven by either genetically determined selective vulnerability or resistance of specific nuclei or cell populations to AD pathology? This technique, or others like it, may have even more power to explore the genetic influences of the more striking asymmetry seen in other neurodegenerative diseases. More broadly, studies like this demonstrate the potential for combined neuroimaging and genetic analyses to uncover subtle genetic influences on brain structure and function, potential which will only increase as available sample sizes and the richness of genetic data increase, and as neuroimaging and bioinformatics techniques continue to evolve."}]