[{"section_title": "Abstract", "text": "The migration of young Chinese scientists to undertake graduate studies in U.S. universities is arguably one of the most important recent episodes of skilled migration. Using a new data set covering around 16,000 Ph.D. graduates in 161 U.S. chemistry departments, we show that Chinese students have a scientific output during their thesis that is significantly higher than other students. In fact, conditional on acceptance into the same programs, Chinese students perform about as well as the awardees of the NSF doctoral fellowship program. These results shed new light on the benefits of student migration on scientific productivity of destination countries."}, {"section_title": "I. Introduction", "text": "I MMIGRANTS from China are a large fraction of science and engineering Ph.D. graduates educated in the United States. Of around 30,000 Ph.D. students graduating in 2006, more than 4,300 (14.3%) were Chinese citizen (NSF, 2009 ). Recent Ph.D. graduates from U.S. universities are more likely to have done their undergraduate studies at Tsinghua University or Peking University than at the University of California, Berkeley, or any other institution (Mervis, 2008) . As of the 2000 census, 8.9% of doctorate holders in U.S. science and engineering occupations were born in China (NSF, 2007) .\nUsing a new original data set covering around 16,000 Ph.D. graduates in 161 U.S. chemistry departments, we show that Chinese students have a scientific output during their thesis that is significantly higher than other students. In fact, conditional on acceptance into the same programs, Chinese students perform about as well as the awardees of the NSF doctoral fellowship program-America's best and brightest in science and engineering.\nWe relate the productivity differential between the Chinese and other students to a selection effect, as the majority of Chinese migrants come from a very restricted set of extremely selective Chinese universities.\nThe relatively high quality of Chinese students migrating to the United States is consistent with the theoretical conclusion of the Roy model on a positive link between positive self-selection and migration costs (first shown in Borjas, 1987, and further discussed in Jasso & Rosenzweig, 1990 ). This paper is thus related to the extensive literature on the economic impacts of immigration (Borjas, 1999) . This literature emphasizes the importance of the quality of immigrants for cost-benefit analysis, but it is generally unable to measure quality beyond a few limited proxies such as schooling levels.\nEarlier research on immigration and scientific productivity has focused on the role of foreign-born star scientists in U.S. science and on the propensity of natives and migrants to publish during their career.\nBoth Levin and Stephan (1999) and Hunt (2009) show that foreign-born U.S. scientists tend to outperform natives on a number of measures of scientific productivity.\nOur results suggest that the immigration of Chinese students substantially expands the pool of talent available to the American scientific research entreprise. This advantage has, however, to be balanced against a number of possible counterarguments, including the fact that migration of foreign graduate students may crowd out native students (Borjas, 2004) or decrease incentives for natives to engage in scientific careers (Borjas, 2006; Freeman, 2009 )."}, {"section_title": "II. Data Construction", "text": "We identify Ph.D. students using Proquest Dissertations and Abstracts. This bibliographic database lists abstracts of completed Ph.D. theses with the name of the student, the university, and year of graduation, as well as the field and the name of the advisor. It also includes links to the full text of the theses, which is useful because theses from certain universities include additional bibliographical information on students (MacGarvie, 2007) .\nProquest data provide good coverage of Ph.D. graduates for U.S. universities and recent years. However, we do not directly observe country of birth or of undergraduate education. To address this limitation, we use a technique similar to that pioneered by Kerr (2008a Kerr ( , 2008b in his study of ethnic patent inventors. This technique relies on the fact that names implicitly contain information about the origin of individuals, and ethnicity can be reasonably well inferred by matching names to lists of ethnic names. Using the same approach, we constructed lists of Chinese last and first names and used them to code students as Chinese.\nTo verify the quality of the results obtained with our ethnic name matching algorithm, we manually coded CVs for universities that require students to report biographical information in theses. We find that 88% of students coded as Chinese had received their undergraduate degrees in China (and a further 5% in Taiwan). Conversely, our algorithm identified 96% of students that did their undergraduate studies in China as Chinese.\nAs a benchmark group to the Chinese, we also identify NSF graduate fellows in our data. The NSF graduate research fellowship is a highly prestigious award for American science and engineering students. Freeman, Tanwin, and Hanley (2005) refer to the program as \"supporting the best and brightest in science and engineering.\"\nWe construct scientific output measures by matching our list of students to publication data from Scopus. This bibliographical database has the advantage of including affiliation data for each author. To minimize errors in the matching process, we used the fact that papers authored by chemistry students are almost invariably written with their advisor as coauthor. A publication is matched to a student if nine criteria are successfully met: one author of the publication needs to have the (a) last name of the student, (b) first initial of the student, (c) correct departmental affiliation of the student, (d) correct university affiliation of the student, and one of the coauthor of the paper has to have (e) the last name of the advisor, (f) the first initial of the advisor, (g) the correct departmental affiliation of the advisor, and (h) the correct university affiliation of the advisor. Finally, the paper has to be published (i) no earlier than three years prior to the graduation of the student and no later than the year of graduation. "}, {"section_title": "III. Descriptive Statistics", "text": "We have 16,073 students, of whom 2,385 (14.8%) are identified as Chinese. The share of Chinese students does not exhibit much variation over time but considerable variation across universities. New York University, Southern Illinois University, and the University of New Mexico have more than 50% of Chinese students, while Berkeley, the University of Colorado, Arizona State, the University of Oregon, and the University of Texas at El Paso have less than 5%. The fraction of Chinese students is markedly higher in lower-tier schools (schools with lower chemistry R&D budgets). Chinese students represent 10.2% of students in tier 1 schools, 13.2% in tier 2 schools, 16.3% in tier 3 schools, and 20.6% in tier 4 schools.\nScientific output can be measured by counting the number of publications or adjusting for the quality of the journal (publications weighted by journal impact factors, hereafter referred to as JIF-weighted publications) or by counting the number of cites these publications receive. Moreover, in chemistry, and in the physical and life sciences more generally, first authorship has a special meaning and is typically used to recognize the junior scholar who made the largest contribution to the paper. Thus, it is interesting to distinguish between first-authored publications and all publications. Descriptive statistics by type of student for the six resulting output measures are displayed in table 1."}, {"section_title": "IV. Estimation and Results", "text": "We regress various measures of scientific output on a dummy for Chinese students and a dummy for NSF fellows. We estimate most regressions with a quasi-maximum likelihood conditional fixed-effects Poisson model (Hausman et al., 1984) . This model has several desirable properties, including consistency of the coefficient estimates independent of any assumption on the conditional variance as long as the mean is correctly specified (Wooldridge, 1997) and consistency in the standard errors even if the data-generating process is not Poisson. This estimator can also be used for fractional and nonnegative variables (Santos Silva & Tenreyro, 2006) , such as quality-adjusted first-authored publications in our case. We implement this in Stata with the \"xtqmlp\" procedure written by Tim Simcoe. 1 We use three types of specifications. In the first type (table 2, panel A), we have as controls only year of graduation fixed effects and subfield fixed effects. 2 Next, we introduce school fixed effects and so compare students who are enrolled in the same program (table 2, panel B) . Finally, we replace the school fixed effects by advisor fixed effects (table 2, panel C). An attractive feature of specifications with advisor fixed effects is that by comparing students who have the same advisor, we compare students who must be doing a very similar type of science.\nThe coefficient on Chinese student is positive and significant at 1% in all specifications. Comparing the Chinese student coefficient horizontally across output measures, we tend to have larger values for citations than for the number of publications or JIF-weighted publications. Since citations are usually thought to be a better proxy for the THE REVIEW OF ECONOMICS AND STATISTICS quality of research, this suggests that the productivity advantage of Chinese students is stronger in the quality dimension than in the quantity dimension. Comparing the Chinese student coefficient vertically across specifications, we find very similar coefficients. Thus, the productivity differential of Chinese students does not seem to be explained by school or advisor or team characteristics.\nThe Chinese student coefficient takes values between 0.259 and 0.583. Thus, Chinese students are between 22% (1-exp[−0.259] and 44% (1-exp[−0.583]) more productive than other, non-NSF fellow, students, depending on the specification. To interpret that magnitude, it is useful to note that this difference is about the same as that between NSF fellows and other students in the specifications with school fixed effects. In other words, conditional on being admitted in the same program, Chinese students seem to be doing as well as the recipients of the highly selective prestigious NSF fellowships."}, {"section_title": "V. Discussion", "text": "Why do the Chinese perform so well? Our preferred explanation is a selection effect. U.S. education enjoys an excellent reputation in China and attracts the brightest and most motivated Chinese students. Despite the fact that U.S. universities are admitting large numbers of Chinese students, it is nevertheless considerably more difficult for a Chinese than for a native to be accepted into a U.S. Ph.D. program. Evidence from Attieh and Attieh (1997) suggests that top U.S. universities give substantial preference to U.S. citizens in their admission decisions. While this may reflect an underlying preference for natives, it could also be an optimal response to difficulties encountered in evaluating the applications of Chinese students (lack of familiarity with schools, grading systems, and reference letter writers).\nPrecisely because of these difficulties, an undergraduate degree from one of the top Chinese university is a de facto requirement for entry into a U.S. Ph.D. program. Chinese graduate students overwhelmingly come from a set of extremely selective Chinese universities. Around 10 million high school finishers take the national college entrance exam, but only three thousand are admitted into the two most prestigious schools, Peking University and Tsinghua University, which are thus more selective than the most exclusive U.S. institutions. In fact, the majority of MIT undergraduates would not have had standardized test scores high enough to be admitted into the undergraduate programs of these two Universities. 3 Besides this positive selection story, two other plausible arguments could explain the productivity advantage of the Chinese. The first argument points to incentive effects due to the higher preferences of the Chinese for an academic career. The second explanation emphasizes a cultural predisposition of the Chinese for higher effort at work.\nAccording to the first argument, a career in academia and postdoctoral training in particular may be relatively more attractive to Chinese students, thus increasing the incentives to publish during the Ph.D. In particular, immigration considerations may be relevant, as maintaining valid visa status in the United States is easier when undertaking postdoctoral training than when working in industry. 4 . However, data from the 2001 Survey of Earned Doctorates indicate that Chinese Ph.D. students in chemistry are more likely to be planning to go to industry directly from graduate school than others (35.8% of those born in China plan to work in industry versus only 26.2% of those born anywhere else) and no more likely to be planning to follow postdoctoral training (37.4% of the Chinese plan to follow postdoctoral training, versus 39.7% of all the other students) (Stephan, 2010) .\nIn support of the second argument, anecdotal evidence suggests that Chinese graduate students work harder and spend more time in the laboratory. Again, complementary evidence from other data sources suggests that this cultural predisposition for higher effort might be of second-order importance. In fact, a survey of postdocs found only small differences between Chinese and Americans in terms of hours worked (50.5 hours per week versus 49.8; Sigma Xi, 2005) ."}, {"section_title": "VI. Conclusion", "text": "The contribution of this paper is to show that Chinese students enrolled in U.S. Ph.D. programs have a strong record of publications during their graduate studies. We argue that this excellent performance of the Chinese with respect to other students is most likely explained by the fact that they come from a restricted number of very selective elite institutions in China. Given that the graduate student is the workhorse of the modern laboratory, the influx of talented students is bound to enhance the productivity of U.S. universities. This benefit to host universities has to be balanced against potential negative effects, in particular, the fact that migration may decrease incentives for natives to engage in scientific careers (Borjas, 2006) .\nSince the costs of training graduate students are mainly borne by the host country in the form of research and teaching assistantships, it is important to consider the stay rates of Chinese students. According to estimates derived by Finn (2007) using Social Security data, the stay rate for Chinese doctorate recipients is around 92% after five years from obtaining the title, the highest observed for any country in 2005. However, the current high stay rates cannot be taken for granted given the steadily raising skill premium in China and the aggressive recruiting policies of Chinese universities.\nAn important limitation of our study is that our research is based on an early measure of productivity-publication during doctoral studiesand does not address post-Ph.D. outcomes. We do not know if Chinese students continue to outperform non-Chinese students after their training period. On the one hand, initial differences in scientific productivity tend to persist and might even amplify over time. On the other hand, postgraduate occupations may require skills that the Chinese immigrants may lack. Further evidence on productivity and mobility choices after the Ph.D. is thus central to a better understanding of to what extent Chinese student migrants contribute to U.S. scientific productivity."}]