[{"section_title": "0", "text": "ne outgrowth of what Kerr (1 991 :xii) Statistics, NCES 2000:286) . The increase in referred to as \"the great transforma-graduate degrees outpaced the rate of tion\" of higher education in the growth in undergraduate degrees to such an United States has been a dramatic rise in the extent that whereas in 1960, one out of four scale and significance of postgraduate pro-degree recipients were graduate students, by grams. In terms of raw figures, whereas from 1997, the ratio was one out of three. In the 1960 to 1997, the number of bachelor's wake of the post-1 960 expansion, there is evidegrees awarded tripled, the number of mas-dence that graduate degrees became more ter's degrees, first-professional degrees important than ever before as passports to (including dentistry, medicine, optometry, high-paying, prestigious occupations osteopathic medicine, pharmacy, podiatry, (Cappell and Pipkin 1990; Kingston and veterinary medicine, chiropractic medicine, Clawson 1990; Useem and Karabel 1986) . law, and theology), and doctoral degrees Although roughly one-third of higher edumore than quadrupled, from 120,437 to cation's human products are graduate stu-544,007 (National Center for Education dents, sociologists know little about the rela-"}, {"section_title": "Sociology of Education 2003, Vol. 76 (April): 143-7 69 743", "text": "tive roles of ascribed characteristics versus achieved academic qualifications in their selection. The two most comprehensive research frameworks on education and stratification, the status attainment and the social reproduction models, have generated a substantial body of theoretical and empirical literature on undergraduate education but have directed little attention toward graduate education. Moreover, the few studies on the topic have turned up startling results. Although the effects of social background on educational attainment at the undergraduate level have been extensively documented (Alexander, Pallas, and Holupka 1987; Hearn 1991) , research has identified the striking absence of these effects on graduate enrollment. Mare (1980:301) found that the passage to graduate school was uncontaminated by family background effects and concluded that \"for college graduates, the influence of social origins on their decisions to pursue further schooling is virtually nil.\" Stolzenberg (1 994:1068), who updated and reconfirmed this finding with more recent data, determined that a college degree brought a \"major movement toward [the] socioeconomic liberation of college graduates from their status origins.\" These researchers suggested that the higher one goes in the educational system, the further one is removed from one' s social roots and the closer one approaches the meritocratic ideal. Mare's (1 980) and Stolzenberg's (1 994) conclusions pose a challenge to the social reproduction perspective, which views education as a site of class reproduction with little room for meritocratic mobility. According to social reproduction theory, particularly the work of Bourdieu (1984) , an expanded system of education should become even more socially exclusive at the top. As new social groups enter higher education, socially privileged groups, whose reproduction was traditionally ensured by college degrees, increase their investments in education to stay ahead of the newcomers (Bourdieu and Boltanski 1978) . The competition for credentials creates a dialectic of downclassing and upclassing (Bourdieu 1984) . If college degrees lose value through saturation, those who rely on educational capital to reproduce their priviMullen, Coyette, and Soares lege will increasingly take the additional step of investing in graduate degrees.\nFurthermore, reproduction theory suggests that graduate programs and institutions should be differentiated into distinct positions within a \"field of power\" (Bourdieu 1996:270) . Bourdieu viewed separate subfields of stratification for institutions as well as for academic subjects. Although most sociologists are familiar with Bourdieu's classification of institutions by the economic and cultural weight of their members (1 996), his distinctions between academic subjects are less well known (1988) . For Bourdieu, academic subjects occupy a social space structured by \"a 'society' pole and . . . the 'scientific' pole\" (1988:73) . The X, or \"society,\" axis of Bourdieu's academic field may be thought of as the links between degrees and prestigious occupations, while the Y, or \"scientific,\" axis is determined by the amount of educational \"capital acquired within the university\" (1988:78) that is required by the program. For example, at the high end of the X axis, one would include the faculties of law and medicine and at the low end, social work and the training of primary school teachers. The high end of the Y axis would include doctoral programs and the low end, master's programs. Bourdieu's work suggests that differentiating between types of graduate programs better illuminates the impact of family background than considering all graduate programs in the aggregate.\nThe mismatch between the predictions of social reproduction theorists' and the empirical research on graduate school enrollment motivated our research questions. Did the expansion of higher education in the United States equalize opportunities for graduate education, as previous research appears to have found? Or have researchers failed to consider critical dimensions of graduate school enrollment that may mask the influence of social background? In this article, we reconsider the social and academic correlates of entry into graduate programs and extend previous analyses by evaluating graduate enrollment separately by degree program. We then reinvestigate the mechanisms that are responsible for the transmission of social privilege and academic achievement. Finally, we discuss why our results may differ from those of previous pioneering studies."}, {"section_title": "PREVIOUS RESEARCH", "text": "Although both quantitative and qualitative researchers have found strong, clear effects of family background on the decision to attend college (Hossler, Schmit, and Vesper 1999; Manski and Wise 1983; Mare 1980) , previous research has suggested that those effects do not extend to the decision to enroll in graduate programs. As we mentioned earlier, Mare (1 980)) using data from the 1973 Occupational Changes in a Generation Survey and a 1964 survey of U.S. military veterans, discovered that fathers' scores on the socioeconomic index (SEI) and parent's educational levels had virtually no impact on sons' decisions to attend graduate institutions.\nIntrigued by Mare's findings, Stolzenberg (1 994) attempted to uncover why family background had little influence on students' postgraduate educational decisions. He used data from the 1972, 1976, and 1986 waves of the National Longitudinal Survey for the high school class of 1972 and concentrated on the effects of family background on the completion of a graduate entry examination and on continuation into an MBA program. Stolzenberg found that social background and parental education did not positively influence the likelihood that a student would take any of three graduate entrance examinations-the Law School Admissions Test (LSAT), Graduate Record Exam (CRE), or Graduate Management Admission Test (GMAT)-or would enroll in an MBA program. He concluded that graduation from college marks a break in the link between parents' background and the postcollegiate educational attainment of their offspring.\nSimilarly, Ethington and Smart (1986) found no direct effects of family income or education on educational persistence after college graduation. However, they did find indirect influences of family background on a student's postgraduate educational decision making through the mechanisms of social and academic integration. Academic integra-7 45 tion refers to a studentls academic involvement in his or her institution, and social integration refers to the extent of a student's involvement in relationships with peers and college faculty. In contrast to Mare (1 980) and Stolzenberg (1 994), Ethington and Smart suggested that family income and education do indeed influence graduate school attendance, although only indirectly.\nThe finding that parents' income and educational background do not directly influence enrollment in graduate education is unexpected because there are several compelling explanations for why they would likely have an effect. The first explanation involves resources. Resources available to parents of high socioeconomic status (SES) allow children more opportunities for success in school than do those of low-SES parents (Stolzenberg 1994; Wilson and Portes 1975) . For example, wealthy parents are better able to afford a private, selective college education for their children.\nThe second conventional explanation for the influence of family background, particularly parents' education, on students' educational attainment can be classified as the socialpsychological or expectations approach. This approach views parents' educational background as important because it influences parents' educational expectations for children, which, in turn, influence children's expectations for themselves (Looker and Pineo 1983; Sewell and Shah 1968) . Parents who have been to graduate school may expect the same for their children.\nThe third explanation is that family educational background influences children's academic performance. While academic performance is often considered an achieved characteristic, it has also been included in the Wisconsin Models of Status Attainment as a key variable that mediates the effects of parents' SES on educational attainment (see, e.g., Sewell, Haller, and Ohlendorf 1970; Sewell, Haller, and Portes 1969) . Ethington and Smart (1986) also considered academic performance at the collegiate level through the concept of academic integration, which they measured using undergraduates' average grades. They found that students with better-educated parents received higher grades in college than did those from lessadvantaged backgrounds and that grades influence a student's propensity to continue on to graduate school. Stolzenberg (1 994) also identified a small direct effect of college grade point average (CPA) on a student's likelihood to take either the CRE or the CMAT. However, he found no relationship between CPA and actual enrollment in MBA programs, nor did he uncover any link between family educational background and college grades.\nAnother mechanism through which family background may influence entry to graduate school is the field of study in college. Although there has been little systematic research on the choice of a college major, the few studies on the topic have suggested a link between family background and field of study. Social background has been found to predict positively the selection of a liberal arts or science major (Coyette and Mullen 2002; Mullen 1998 ). In addition, the choice of a major may influence the decision to pursue a graduate degree. There is evidence that students in arts and science fields are more likely to pursue graduate education than are those in professional fields (Coyette and Mullen 2002; NCES 2000) .\nThe final influence that family background may have on postgraduate enrollment concerns work values. Stolzenberg (1 994) argued that the choice of entering a particular graduate school program is likely to be influenced by one' s attitudes and values, even moral beliefs, about work. Individuals may seek careers with different proportions of financial reward, autonomy, recognition, intellectual stimulation, flexibility, creative expression, and sense of social purpose. To the extent that a graduate program leads to an individual's ideal career, she or he is more likely to choose such a program. Such attitudes, values, and beliefs about work may be influenced by a student's family background."}, {"section_title": "ANALYTIC STRATEGY, DATA, AND METHODS", "text": "In this article, we contribute to the discussion of the relationship among parents' education, Mullen, Coyette, and Soares academic achievement, and postgraduate educational enrollment in three important ways. First, in our research, we used data that are considerably more recent than those used by Mare (1980 ), Stolzenberg (1994 , and Ethington and Smart (1 986) . Furthermore, our sample was larger than those of Stolzenberg and Ethington and Smart. In Stolzenberg's sample of 12,841 high school seniors in 1972, only 10 percent (1,319) of those who were reinterviewed in 1986 had completed college and were included in the sample. Ethington and Smart's sample included a little over 6,000 students who entered undergraduate institutions in 1971, 2,918 of whom later attended a postgraduate program.\nUsing data from the Baccalaureate and Beyond Longitudinal Study (B&B), we had a large nationally representative sample of 10,080 students from the 1 .lmillion students who completed bachelor's degrees in 1992-93. One-third of the 10,080 students, or 3,364, enrolled in some form of graduate education. The students were first surveyed in 1992-93, in their last year of college. A follow-up was conducted in 1993-94, one year after the respondents had graduated from college, and a second follow-up took place in 1997, five years after graduation.2\nAlong with these data, we obtained an institution-level variable of the average SAT scores from entering college students. The data were from the 1 991 U.S. News and World Report survey (America's Best Colleges, 1 993) of 1,279 postsecondary institutions and were merged by institution with the B&B data, which included 1,094 institutions. The U.S. News and World Report data included information on test scores for 97 percent of the students in the B&B sample.\nIn addition to using a larger and more recent data set, a second, and more important, contribution of our research is that we considered graduate education separately by degree program. It is possible that as more graduates continue their education, parents' background becomes a greater influence on the type of graduate program.3 Graduate programs differ dramatically in the commitment required and the rewards that may be gained from them. Master's degree programs, for example, are often only two to three years long (and can be as short as a year) and in many fields, such as education or social work, lead to occupations that offer modest financial rewards. However, first-professional and doctoral programs require a greater level of time commitment from their students but lead to highly advantageous positions in the labor market.\nHow these differences among programs affect students' decision making is an unexplored, empirical question. However, what is most important about controlling for the type of graduate program is that it may further clarify the relationship between parents' educational background and students' postgraduate educational enrollment. Because most postgraduate-degree seekers are enrolled in master's programs, the important relationships between family educational background and other types of graduate programs may be underestimated if all types of programs are grouped together. Before we conclude that parents' education does not influence postgraduate educational attainment, we need to consider if and how it affects students' choices among types of graduate programs.\nThe third contribution of this research is that we revisit the question of how parental education may indirectly influence postgraduate educational enrollment.4 Our survey includes a more detailed measure of parental education than has been available in past surveys. BdrB includes questions on the highest level of education completed by either parent. Unlike other surveys that have aggregated those with college and postgraduate degrees, B&B separates these two categories. We operationalized parental education with a measure of the highest education completed by either parent.\nLike previous research, we recognized three possible indirect effects of parents' education on educational attainment: structural, social-psychological, and academic performance. We considered characteristics of a student's undergraduate institution as structural effects. Bourdieu's (1 996) field of power provides strong theoretical grounds for hypothesizing institutional effects, and these effects in the United States have been docu-mented by a growing body of empirical literature on the premiums provided to the graduates of elite colleges and universities (Bowen and Bok 1998; Hoxby 1998; Karabel and McClelland 1987) . We investigated three types of institutional effects: selectivity, mission, and control.\nFirst, we considered college selectivity following the conceptions used in previous research (Bowen and Bok 1998; Davies and Cuppy 1997; Ethington and Smart 1986) . High school students with favorable parental backgrounds are likely to be better able to identify and afford prestigious colleges. These prestigious colleges may provide information to students about postgraduate education or may influence a student's acceptance into graduate school, thus increasing the likelihood that a student will continue with her or his education. Following the practice of other researchers (Davies and Cuppy 1997; Ethington and Smart 1986; Hearn 1991) , we used average SAT scores of entering college students as an indicator of institutional selectivity.5 We divided the scores (combined verbal and math) into quartiles.\nSecond, we looked a t school mission as a potential source of institutional effects. Research universities, for example, may predispose their graduates to postgraduate options that are different from those nurtured in liberal arts colleges. To capture the most salient differences in the missions of various types of institutions, we used the 1994 Carnegie classification system to distinguish among research-oriented doctoral institutions, liberal arts colleges, comprehensive colleges, and two-year colleges.\nThird, in the literature on institutional effects, there is a line of inquiry that draws a distinction between public and private control. The control of an institution frequently influences whether it is viewed as \"elite\" or \"nonelite\" (Bowen and Bok 1998; Hoxby 1998; Kingston and Lewis 1990) . Although not all private colleges are elite and not all public colleges are nonelite, the overlap between the two categories for research universities persuaded us to apply this distinction. The elite-privatelnonelite-public dichotomy is not especially relevant for further differentiating the overwhelmingly private liberal arts sector or the comprehensive and two-year colleges, which are nonelite by definition (Brint and Karabel 1989) . Therefore, we distinguished between public and private control of only the research-oriented doctoral universities.\nWe believe that these three categories (selectivity, mission, and control) capture significant differences in institutional characteristics that may mediate the impact of social background on postgraduate participation. For example, students from low-SES families may be more likely to enroll in two-year institutions than may students from high-SES families, who may be more likely to attend private research universities and liberal arts colleges (Advisory Committee 2001; McPherson and Schapiro 1998; Terenzini, Cabrera, and Bernal 2001 ) .\nIn our analyses of the role of types of undergraduate institutions, it is important to distinguish between \"selection effects\" and \"treatment effects\" (Shulman and Bowen 2001 :42) . Students are sorted into colleges partly on the basis of their high school academic preparation and performance, and these factors may also predict educational continuation after college. Thus, without controlling for students' previous academic performance, one may find that apparent effects of types of undergraduate institutions may be spurious.\nUnfortunately, the B&B data set does not include measures of high school academic preparation and performance, such as curriculum and GPA. It does, however, provide students' scores on college admissions tests (either the SAT I or ACT). We included this variable as an indicator of performance on standardized high school tests but caution against its interpretation as an indicator of academic ability. The tests were explicitly designed to predict the grades of first-year undergraduates, not general academic ability. Even so, researchers have reported that high school GPA and subject-specific tests, such as the SAT II, are better predictors of undergraduate grades than is the SAT I (Geiser and Studley 20025; Willingham et al. 1990 ). Furthermore, SAT I scores, more so than SAT II scores or high school CPA, have been found to be sensitive to differences in social background (Geiser and Studley 2002: 8-1 0, 22)."}, {"section_title": "Mullen, Coyette, and Soares", "text": "However, although the interpretation of these test scores is contested, many colleges use the SAT and ACT to select students. Hence, by controlling for standardized test scores, we address the possibility that selection explains our findings.\nLike other studies, we gauged the socialpsychological impact of family educational background by including educational expectations. College students were asked how much schooling they expected to achieve. We used the conventional continuous measure of years of education, since we found that coding educational expectations as a categorical variable did not alter the results (Goyette and Xie 1999) .\nIn addition to these structural and socialpsychological mechanisms, we considered another mediator of family educational background that is often included in the literature: academic performance. Academic performance need not mediate family background, however. It could predict postgraduate enrollment independent of parents' education, a finding that would support a meritocratic view of higher education. We used student's college GPA to assess whether or not parents' educational background works through academic performance even a t the highest levels of education (Ethington and Smart 1986) . To make the interpretation of the variable more meaningful in the regression analysis, we divided GPA scores into deciles.\nBesides these well-documented mediating factors, we included two more: (1) the possible role of college major and, (2) following Stolzenberg (1 994), measures of career values to gauge further the impact of family background on continuation in school. Students were asked whether or not it was important to be successful in one's line of work, influence the political structure, and be well off financially. We speculated that parents' background may influence a student's conception of what is valuable in a career.\nIt is important to note that other ascriptive characteristics, namely race, ethnicity, gender, and age, strongly influence the continuation of education after the bachelor's degree. Unfortunately, even though the B&B oversampled minority students, the numbers are still too small for statistical analysis. In contrast, the numbers are sufficient for an analysis of gender, and accordingly, we included controls for gender and tests of interaction effects. We incorporated age into our analysis because family background influences the age a t which students complete their undergraduate degrees. Students from low-SES families finish college a t older ages than do students from high-SES families (Advisory Committee 2001; Terenzini et al. 2001) . And older undergraduates, especially those with families, may be less inclined than may their younger classmates to forgo earnings or to incur debts in a lengthy program of graduate studies.\nOur analytic strategy comprises two parts. First, we present simple descriptive statistics to address the question of whether or not parents' education affects educational continuation after the baccalaureate. To do so, we present a table showing the percentage of students entering master's, MBA, first-professional, and doctoral programs by parent's education level.\nIn the second part of the analysis, we present the results of multinomial logistic regression models. This technique allows for the analysis of multiple dependent variables, in this case, types of graduate programs. Variables are entered into the models in five blocks to highlight the direct and indirect influences of key variables on enrollment in each type of graduate program. The first block includes the social background variables of parents' education, gender, and age. The second block adds a control for students' scores on college admissions tests. The third block incorporates the institutional characteristics variables, type and selectivity of college, and the fourth considers the additional effects of college performance as reflected by college CPA and field of study. The final model adds the social-psychological variables of educational expectations and career values."}, {"section_title": "Descriptive Results", "text": "In Table 1 , we present descriptive results on the educational continuation patterns of the 1993 bachelor's degree recipients as of 1997. Our first important finding from the descriptive statistics is that parents' education does matter for graduate school attendance, contradicting the earlier findings of Mare (1 980) and Stolzenberg (1 994). The first column of the table shows that 76 percent of the students whose parents had a high school education or less did not pursue graduate education after they received their bachelor's degrees, compared to 62 percent of those whose parents had some postgraduate education (significant at the p < .001 level).\nA second notable result from the descriptive statistics is that parents' educational Note: The total sample size for the analysis is 9,241. The percentages were weighted to account for disproportionate and nonrandom sampling using the statistical program SUDAAN. Columns may not add to zero because of rounding.\nbackground matters more for entry into some programs than into others. The gap by parents' educational level for those entering master's programs is significant but modest. About 18 percent of those whose parents have only a high school degree or less enter master's programs, compared to 22 percent of those from the most highly educated families. However, the gap is much wider for firstprofessional and doctoral programs, 2.2 percent versus 7.1 percent and 1.4 percent versus 5.1 percent, respectively. In both cases, students with highly educated parents are more than three times more likely to enroll in first-professional and doctoral programs than are those whose parents have a high school degree or less (again significant at p < .001).\nAlthough overall the likelihood of entry into first-professional and doctoral programs is small, it is substantially higher for those whose parents have high levels of education.\nOn the other hand, the difference for MBA programs is not significant. About 2.6 percent of those whose parents have a high school education or less enroll in an MBA program, compared to 3.6 percent of those whose parents have more than a college degree, confirming Stolzenberg's (1 994) findings on MBA students.\nIn sum, these results show that parental background does influence postgraduate educational continuation and that it does so differentially across graduate programs. Parental education has a relatively strong influence on matriculation in first-professional and doctoral programs, a weaker influence on master's programs, and no effect on MBA programs (descriptive statistics on other explanatory variables included in the multivariate regression models are presented in Appendix Table  A ; means and standard deviations of the descriptive statistics are presented in Appendix Table B) . To explore the mechanisms through which parents' educational background works and the direct and indirect effects of the other explanatory variables, we now turn to the multivariate analyses."}, {"section_title": "Multinomial Results", "text": "Paralleling the descriptive findings, the most striking result from the multinomial regresMullen, Coyette, and Soares sion is the significant but differential impact of parents' education on enrollment in graduate education programs. The first model in Table 2 considers the three social background variables: parents' education, gender, and age. Parents' education demonstrates a positive effect on enrollment in each type of graduate program (versus no enrollment). However, the effect varies in strength, depending on the type of graduate program. For a master's program, the impact of parents' education is modest. The odds ratio of 1.06 indicates that every one year increase in parents' education increases the odds of enrolling in a master's program by 6 percent. The influence of parents' education on MBA programs is not significant. However, the effects of parents' education on enrollment in a first-professional program are substantial, increasing one's odds by 16 percent per year of education. Parents' education exhibits the strongest influence on entrance into a doctoral program. Every year increase in parents' education increases one's odds of enrolling in a doctoral program by over 20 percent. Because the overall probability of entering a doctoral program is only .029 (see Table I ), an increase in odds of 20 percent represents a large proportionate effect but a small absolute one.\nThe strength and direction of the coefficients for the gender variable reflect expected gender distributions by type of graduate program. The odds of entering master's programs are greater for women than for men, but the odds of entering all other types of programs are much stronger for men.6 Age has a negative effect on enrolling in doctoral and first-professional programs but no effect on enrolling in MBA or master's programs. Although not shown here, the addition of age to the model reduces the coefficients for parents' education by about 15 percent for doctoral, first-professional, and MBA programs, while the gender variable does little to alter these coefficients. Students from less-privileged backgrounds tend to be older at graduation from college than do those from more privileged backgrounds.\nModel 2 includes students' scores on college admissions tests, which exhibit a significant influence on educational continuation after college. An increase of 100 points on a standardized test raises the odds of continuation into a graduate program from 1.1 1 times for master's programs to 1.70 times for doctoral programs. The addition of test scores in this model reduces the strength of the coefficients for parents' education, revealing an indirect effect of social background through successful performance on high school tests. However, even when students' test performance is controlled, parents' education maintains a significant effect across master's, firstprofessional, and doctoral programs. Test scores explain only a part of the influence of parents' educational background on students' educational continuation. The third model considers the effects of the characteristics of students' undergraduate institutions. The variable indicating whether a student attended a two-year college is nonsignificant. However, we tested this variable in additional models and found that it is significant in models that do not control for scores on college admissions tests. Thus, students who initially attend a two-year institution are at a disadvantage for pursuing firstprofessional and doctoral programs, but this disadvantage is primarily due to their lack of proficiency on standardized tests. This model registers significant effects for the type of four-year institution one attends. In comparison with the omitted category of comprehensive institutions, the odds of entering first-professional programs were 1.90 times greater for graduates of private research institutions, while the odds for graduates of public research institutions were 1.92 times higher for enrolling in doctoral programs. The odds of liberal arts graduates entering a doctoral program were 2.24 times larger and for entering a professional program 1.74 times larger than for those from comprehensive institutions. Finally, graduating from a private research institution increases one' s odds of attending a master's program. These effects of Carnegie institution types are significant even when selectivity is controlled, indicating an independent influence of institutional characteristics.7 Again, it is important to note that the large odds ratios here represent only small absolute increases in the overall probability of entering first-professional and doctoral programs.\nCollege selectivity also proves to be a significant predictor of graduate school enrollment that varies in strength, depending on the program. Selectivity matters modestly for entrance into a master's program, but is more important for MBA and first-professional programs, with favorable increases in odds of 1.26 and 1.1 9 per selectivity quartile, respectively. In all cases, once we control for the institutional variables, the effect of parents' education drops from between 12 percent to 20 percent. Thus, parents' education indirectly affects educational continuation by working through undergraduate institutional characteristics. In addition, the coefficients for test scores fall in this model, demonstrating that part of the benefit of high test scores is due to the enhanced likelihood that a student will attend college a t a more selective researchoriented university or liberal arts college.\nThe fourth model adds the variable measuring a student's college GPA and undergraduate major. For all types of programs, GPA is a strong determinant of continuation into graduate education. Students who are the most likely to enroll in graduate education of any kind are those who performed well in college. Again, CPA has a differential impact, depending on the type of graduate program. As we move up the table from master's to doctoral programs, the effect increases in strength. Each one decile increase in CPA raises one's odds of entering a master's program by 13 percent, an MBA program by 20 percent, a first-professional program by 31 percent, and a doctoral program by 37 percent.\nIn the interest of space, the results for each major are not reported in Table 2 , only their influence on the other variables. Table 3 lists the significant odds ratios for college majors and shows strong effects in expected directions. Compared to the excluded category of \"other\" majors, the odds ratios of entering a doctoral program are more than 12 times higher for biology majors and more than 5 times higher for mathematics, science, and psychology majors. The predicted odds of entering first-professional programs are the highest for biology majors, while business, engineering, and social science majors show the highest relative odds of entering MBA Note: The sample size is 9,000. The results are weighted according to the panel weights for the 1993-97 sample. The models include variables that represent missing values and controls for parents' education, gender, age, scores on college admissions tests, institutional characteristics, and college GPA. The table presents only the odds ratios for significant coefficients. The excluded category of major i s \"other.\"\nprograms. Finally, students in most fields, with the exceptions of business, health professions, and social science, have higher odds of continuing their education at the master's level than do their peers in other fields. College field of study powerfully influences the decision to pursue particular types of graduate programs.\nThe additions of GPA and field-of-study variables in this model do not appreciably alter the influence of parent's education, although we did see a considerable reduction in models, not presented here, that did not include the control for college admissions test scores. The odds ratios for test scores diminish substantially in this model, demonstrating that test scores influence both the choice of a college major and college grades. The links between parent's education and test scores and between test scores and college GPA and field of study suggest a relationship between social background and academic performance.\nIn Model 5, we find a strong impact of the variable measuring expected years of education on enrollment in graduate school. For a master's program, each year increase in expected education extends one's odds of continuation by 1.37 times. The impact lessens slightly for enrollment in MBA programs but increases in strength for enrollment in first-professional and doctoral programs, with odds ratios of 1.63 and 2.67, respectively. This model also includes the career-value variables. Aspiring to influence the political structure has a significant, positive effect on entering both master's and firstprofessional programs. Setting one's sights on financial gain nearly doubles one's odds of enrolling in an MBA program, while aiming for success in one's work has a negative effect on entering master's programs. Once again, we see reductions in the coefficients for parents' education, and this time they become nonsignificant for first-professional and doctoral programs, indicating a final indirect effect through educational expectations and career values. In addition, the coefficients for GPA and, though not shown here, college major, reduce as well, suggesting a link between a student's educational expectations and his or her college performance.\nIn the final model, with the exception of parent's education, most of the explanatory variables introduced in previous models continue to be significant. Three of the institution vari-ables remain strong and positive. Graduates of more selective institutions and private and public research institutions are significantly more likely to continue their education, even after college grades, major, educational expectations, and career values are controlled for. In addition, students' attendance at these kinds of institutions affects their graduate enrollment above and beyond their selection by test scores into such institutions. However, liberal arts graduates, once other factors are controlled for, are not more likely to enter graduate programs than are their peers in comprehensive colleges. CPA also maintains a significant and strong influence on graduate enrollment, as does college major, net of past performance on standardized tests."}, {"section_title": "DISCUSSION", "text": "Our results highlight the enduring influence of parents' education on their offspring's educational attainment. Family educational background affects enrollment in postgraduate programs even after the receipt of the baccalaureate degree, suggesting that a college degree does not equalize opportunities to attend graduate school among those of different family backgrounds. Furthermore, we found that the impact of parents' education on postgraduate enrollment varies by type of graduate program, being the strongest for entering first-professional and doctoral programs and the weakest, but still significant, for entering master's programs. Parents' education does not appear to be related to entering MBA programs. We found that the coefficients for parent's education diminish once we controlled for college admissions test scores and undergraduate institutional characteristics, demonstrating that the family background effect is largely indirect. Educational expectations and career values reduce the direct influence of parents' education still further. Youths with highly educated parents are the most likely to enter selective, research universities or liberal arts colleges and the most likely to expect to enter and gain entry to postgraduate programs, particularly first-professional and doctoral programs.\nThe disparities between our findings and those of previous research raise questions about why our results may differ from those of Mare (1980) and Stolzenberg (1 994). There are two likely sources of variation. First, because our data are newer, we may observe a cohort effect. A second source of variation may stem from the conception and measurement of the dependent variable, enrollment in graduate programs, and the independent variable, parents' education. Certainly, disaggregating graduate programs by type uncovers a range of various parental background effects that are obscured when all programs are analyzed together. It is conceivable that Mare and Stolzenberg would have found an impact of parents' education if they had broken down graduate programs using our categories. However, we found that family educational background also significantly influences entry into an aggregate category of graduate programs, contrary to earlier studies (see Table 1 ). We attempted to parse this latter source of variation by reconstructing the variable formulations found in Mare's and Stolzenberg's work.\nStolzenberg (1994) examined four outcomes: entrance to an MBA program and completion of the CRE, LSAT, or MCAT. We found no effects of parents' education on enrollment in an MBA program, as did he. To test whether parental background influences the completion of graduate entrance examinations, we ran simple logistic regression models on the completion of each graduate entrance examination (the results are available from us on request).\nTo measure social background, Stolzenberg used a standard SES variable, along with a variable for father's educational level, indicating whether a father had less than a high school education. Using an independent variable of father's education that matches this construction, we were able to reproduce Stolzenberg's results concerning taking a graduate examination (for comparability, we limited our sample to men). However, when we used our original construction of the father's education variable (as described in Appendix Table C), we found that father's education was significantly related to taking an entrance examination. Although there are other differences in our methodologies, this finding suggests that the measurement of parents' education is important. Specifically, our results suggest that parents' education has the strongest influence on graduate enrollment at the high end; indeed, a student whose parent has more than a college degree has the greatest probability of attending graduate school (see Table 1 ).\nWe also considered differences in Mare's (1980) and our measure of parents' education. Mare included both mother's and father's education, measured by grades of school completed. To test whether this construction makes a difference, we ran models using separate variables for mother's and father's education constructed as were Mare's. We found, like Mare, that mother's education has no significant influence on postgraduate enrollment, but, contrary to Mare, found that father's education is significantly related to continuing school. This finding suggests that the measurement of parents' education does not explain the difference between our findings and Mare's.\nIt is possible that the differences between our results and those of Mare and Stolzenberg are due to changing graduate school selection processes over time. We speculate that the post-1960s expansion of the system of higher education brought in its wake an intensification of stratification a t the top in which the importance of social background for postgraduate degrees grew, confirming Bourdieu's (1 984) and Bourdieu and Boltanski's (1978) theories. The Bourdieuian notion that expansion intensifies stratification, which has received support from studies of European nations (Blossfeld and Shavit 1993; Soares 1999) , has recently been shown to apply to the United States as well. Karen's (2002) comparison of entry to selective U.S. institutions by two undergraduate cohorts, 1980 and 1992, revealed a dramatic increase in the weight of social background effects for the later cohort. Consequently, it i s reasonable to expect that over this same period, the significance of parents' education for entry into postgraduate programs rose. If we were to test this hypothesis, we would need data with comparable measures across several cohorts. We leave this issue to future research."}, {"section_title": "Mullen, Goyette, and Soares", "text": "Regardless of whether differences in the results of our research and that done previously are due to cohort effects or the various operationalizations of the key dependent and independent variables, we explain the influence of family educational background on graduate school enrollment in three main ways. First, family background works indirectly on a student's decision to enter graduate school through structural forces. Students with highly educated parents are more likely to enter selective private or public research universities or liberal arts colleges, which, in turn, influences the likelihood of entry into postgraduate programs. This is true even after students' performance on standardized tests is controlled.\nThe second mechanism through which family background works is social-psychological. Unlike Stolzenberg (1 994), we found that family background continues to influence students' educational attainment through their educational expectations. Students of well-educated parents have higher educational expectations, which translate into a greater propensity to enroll in graduate programs. The indirect effect of parental education that is transmitted through students' expectations is consistent with Bourdieu's (1 984) theory of habitus.\nThird, we found that college performance is related to a student's standardized test scores and that these scores, in turn, are associated with parents' education, revealing a link between parents' education and academic performance. We also found strong direct influences of college CPA and major on entry into graduate school. Thus, a final mechanism that helps to transmit social background effects i s academic performance, which supports the earlier findings of Ethington and Smart (1986) . We also note, however, that those who achieve at the undergraduate level are more likely to continue their education, regardless of their family background. Bourdieu's (1 988, 1996) theory of stratified academic fields provides a partial explanation for our discovery of the differential impact of parental background on type of graduate program. According to our results, the more socially prestigious the graduate occupation and the greater the amount of academic capital required for it, the more influence parental education has on matriculation into that program. Parental education has the strongest effect on enrollment in doctoral programs and the weakest on enrollment in master's programs. However, this interpretation cannot explain the weak influence of background on entry into MBA programs. It appears that enrolling in any MBA program is less influenced by family educational background than is enrolling in a professional or doctoral program; however, the prestige of the MBA program entered may be affected by parents' education.\nIn sum, college degrees serve both to reproduce social inequalities and to ameliorate them. While the influence of parents' education on graduate enrollment is maintained through the characteristics of undergraduate institutions and through students' educational expectations, undergraduate academic performance is a significant determinant of postgraduate enrollment independent of parents' educational background. In this way, undergraduate institutions serve dual, oppositional roles: They further transmit the educational advantages of parents to their children and provide avenues for academically talented or hardworking students to overcome disadvantaged family backgrounds.\nFurther exploration of stratification in graduate education may show parallels to the disparities found a t the undergraduate level. Studies of undergraduate education show that the growth of the higher education system has reduced the gross effects of family background on access to college while effects on inter-and intrainstitutional access have become more prominent. Undergraduate institutions vary in levels of prestige and selectivity, and family background has been found to play a strong direct and indirect role in a student's college destination (Alexander, Holupka, and Pallas 1987; Davies and Guppy 1997; Hearn 1984 Hearn , 1991 Karabel and Astin 1975) . In addition to furthering our understanding of individual stratification by family background, we have added to the literature on institutional stratification that demonstrates that selective schools provide positive outcomes, such as an income premium, even when students' test scores and SES are held constant (Bowen and Bok 1998; Hoxby 1998) . We showed that research universities and selective institutions significantly increase the likelihood of going on to graduate programs even after a student's background, educational expectations, and college performance are controlled for. In addition to institutional hierarchies, a second axis of stratification runs along fields of study. High levels of gender segregation exist for college fields of study, which are directly linked to persistent patterns of gender inequality in the labor market (Jacobs 1986 (Jacobs , 1995 . Although we found inequality across types of programs by family educational background, we suspect that more nuanced analyses of graduate education, particularly by fields of study and the prestige of institutions, will reveal additional dimensions of stratification.\n1. There is a dearth of empirical research by social reproduction theorists on this topic, which could be due to Bourdieu's French focus, since in France, higher education is divided between universities and grandes ecoles. The latter are not graduate schools in the American sense of the term. They are not hierarchically related to undergraduate institutions, but rather lateral to them. One enters after passing a rigorous test that is taken without receiving a first university degree. Crandes ecoles are a separate form of higher education focused on professional training. The only study that touched on American graduate schools from Bourdieu's perspective was by DiMaggio and Mohr (1 985). It found a modest correlation between cultural capital and graduate school attendance.\n2. To correct for interview nonresponse and disproportional sampling of some population groups, our analyses were conducted using weights. It should be noted that SAS treats the complex sampling design as if it were a simple random sample and understates standard errors. For this reason, we also used SUDAAN, a software program capable of producing design-corrected standard errors. 3. It is also possible that graduate school attendance and the relationship of family background to graduate school enrollment vary by period. Our data reflect graduate school enrollment during the early 1990s, when the economy was just recovering from a recession that bottomed out in 1991. The number of people taking the LSAT or the CMAT peaked in 1991 and declined toward more average levels in 1993 (\"Dot-Com Generation\" 2001 :C2). How the economy and other structural conditions influence graduate school enrollment is an empirical question that deserves attention but is outside the scope of this research.\n4. Ideally, we would have also liked to examine the impact of parental income and occupation on students' postgraduate enrollment. However, the data for these variables are limited and preclude analyses.\n5. We are mindful that institutional selectivity, as measured by average entering SAT scores, is not necessarily reflective of admission rates. Institutions may fall into our top SAT quartile yet admit 60 percent to 80 percent of applicants.\n6. We tested interaction terms for gender and parents' education, test scores, college selectivity, type of institution, CPA, expected years of education, and career values. Both test scores and attending public research institutions exhibited additional positive effects on women's likelihood of entering doctoral programs. Aspiring to influence the political structure held an additional benefit for women on entering first-professional programs. On the other hand, an interaction term of gender and educational expectations revealed that women's educational expectations are significantly less likely than men's to influence their entry into first-professional programs. All other interaction terms were nonsignificant. In exploratory models run separately by gender, there is evidence that parents' education affects men and women differently. For women, it more strongly predicted entry into a first-professional program over a doctoral program; for men, the findings were the inverse. In addition, a modest effect of parents' education on entry into MBA programs was found for men, but not for women. And parents' education predicted entry into master's programs more strongly for women than for men.\n7. We also ran models with a greater disaggregation of Carnegie institution types. For every model, the relationships that were significant remained the same a t roughly the same level of magnitude. No essential information was lost in the models we present in Table 2 . The highest level of education completed by either parent. Coded continuously in years."}, {"section_title": "APPENDIX", "text": "Coded 1 for women and 0 for men.\nThe student's age at the time of the bachelor's degree, measured continuously in years.\nThe student's score on either the SAT (combined verbal and math) or the ACT (ACT scores were converted into their SAT equivalent). Scores range from 400 to 1600 and are divided by 100.\nA dichotomous variable indicating whether the student ever attended a two-year college. "}]