[{"section_title": "", "text": "A potential economic impact of federal crop insurance (FCI) on the farm sector could be through its effect on debt financing. Debate over FCI covers many potential benefits and drawbacks of the program. Amongst many other arguments, proponents note that FCI could be addressing a market failure for crop insurance because private insurance markets alone would not provide the level of crop insurance demanded by farmers and that FCI helps producers manage risk in today's volatile commodity markets. Detractors note the high cost to taxpayers of subsidizing FCI premiums and potential distortions to planting decisions. Premium subsidies in 2012 were $6.96 billion. The focus of this article is on the relationship between farm-level debt use and FCI participation. Farm debt levels and leverage have been increasingly covered in both the farm media and popular press. Parallels are often made between rising farm sector income over the last decade and the farm boom of the 1970s, which was followed by a severe downturn. The farm sector debt crisis in the 1980s led to many farm bankruptcies and bank failures, as well as broad changes to agricultural lending practices and the creation of Farmer Mac. Although farm sector debt has been increasing, it has been outpaced by growth in farm asset values, and the farm sector debt-to-asset ratio is currently at a historic low. Many of the current concerns about farm debt are related to concentration of debt or the risk of farm leverage increasing if farm income or farm asset values decline."}, {"section_title": "Federal Crop Insurance and Farm Policy", "text": "As U.S. farm sector income has risen over the last decade, the role of government programs has evolved. In this environment, FCI has been widely adopted and is now a risk management tool used by the majority of field crop producers in the United States, as well as some specialty crop and livestock producers. Based on the U.S. Department of Agriculture's (USDA) Risk Management Agency and the USDA's National Agricultural Statistics Service data, almost 84% of all corn acreage in the United States was enrolled in FCI in 2012, up from 74% in 2002 and 28% in 1992. Although premium subsidies do not represent total federal crop insurance expenditures, they are one proxy measure of the size of the program. We compare premium subsidies to nonconservation farm program payments, which include payments made under the direct payments, countercyclical payments, loan deficiency payments (LDPs), and disaster assistance programs, as well as payments for various other farm program payments paid directly to farmers within the calendar year, excluding conservation program payments. These nonconservation programs are generally designed to boost farm income, especially in years when income might otherwise sharply decline due to low crop yields or market prices dropping below the level set in legislation. In 2002, federal crop insurance premium subsides were $1.74 billion, as compared to nonconservation farm program payments of $10.45 billion. In 2012, federal crop insurance premium subsides had grown to $6.96 billion, which was nearly equal to total nonconservation farm program payments of about $7.15 billion that year."}, {"section_title": "CHOICES 3rd Quarter 2013 • 28(3)", "text": "Strong commodity prices as well as rising production expenses have led to a decline in the relative importance of many nonconservation farm programs. For example, commodityprice-dependent farm programs, such as countercyclical payments and LDPs, provide less of a safety net in today's farm economy than when they were initially introduced because even a substantial drop in prices might not trigger payments and any potential payments would be relatively small in relation to current farm expenses, at least for most crops. Payments linked to market prices averaged about 22% of total farm program payments in the past decade but have been lower in recent years. Countercyclical payments and LDPs were less than 1% of farm program payments in 2012, and are expected to remain negligible in 2013, even under the assumption of lower prices driven by expected yields in 2013. Many farm organizations, as well as the crop insurance industry, have lobbied to maintain or bolster FCI in proposed 2012 and 2013 farm bill legislation, while accepting the elimination of direct payments, which are not linked to current prices but are made based on historic production and prices set in legislation. In addition to the declining importance of nonconservation farm programs, this strong support for FCI may be in part related to the role it plays in access to credit. One traditional justification for farm programs, particularly direct payments, has been to facilitate access to credit (Westcott and Young, 2004). Because the amount and timing of direct payments were known to producers and lenders, they essentially served as a reliable income source to service debt. Direct payments have remained relatively steady and, similar to payments linked to commodity prices, are much smaller relative to revenues and expenses for most eligible crops than a decade ago."}, {"section_title": "How Federal Crop Insurance Impacts Debt Financing", "text": "As a predominant risk management tool, FCI may lead to increased use of debt financing. Debt financing can increase financial risk, but can also increase returns. Agricultural lenders protect themselves from credit default risk through a variety of measures. Some level of collateral is usually required for most farm loans and could be used to make loan payments if income levels are lower than expected. Hence, farms with a high value of assets relative to debts would be considered more creditworthy. FCI participation lowers revenue risk and might allow lenders to accept loan applications with lower collateral or for operations that are more leveraged. FCI can also increase expected revenue through premium subsides. Lenders might require producers with higher debt levels to purchase FCI in order to obtain a loan or increase their line of credit. This relationship could also be driven by producer response to FCI availability. An increase in debt levels in response to FCI availability would be consistent with risk balancing theory (Featherstone et al., 1988). Policies that increase farm income or decrease the variability of farm income could induce farm operators to increase leverage. If a farm is operating at an optimal level of risk, a decline in business risk due to policies could make additional leverage (financial risk) acceptable. In other words, the operator \"balances\" reductions in business risk with an increase in financial risk. With this increase in financial risk, such policies might ultimately not decrease the total risk in the farm sector."}, {"section_title": "FCI Participation, Debt Use and Financial Risk", "text": "Debt levels between farms with and without FCI coverage can be compared using data from the USDA Agricultural Resource Management Survey (ARMS), which is the only nationally representative farm survey that collects data on farm financial characteristics and crop insurance participation. FCI participation is determined by whether or not a farm had some acres enrolled in FCI in 2011. We consider only farm businesses, or farm operations with sales of over $250,000 or smaller operations where farming is reported as the primary farm operator's principal occupation. Farms with significant sources of nonagricultural income and wealth might not face the same lending constraints. In 2011, approximately 228,000 farm businesses specialized in field crop production including wheat, corn, soybeans, sorghum, rice, tobacco, cotton, peanuts, other cash grains, and oilseeds. Although FCI does cover many specialty crops and livestock (through pasture and margin insurance programs), coverage is more widespread among farms that specialize in field crops and so we limit our analysis to this subset of farms. As there may be large scale effects in both FCI participation and use of debt, we consider three acreage classes for field crop farm businesses: small, medium, and large acreage classes, which, respectively, have cropland acres less than 500; from 500 to 1500; and greater than 1,500. Participation in FCI does vary by farm size, with larger farms more likely to participate. Further, most debt is held by farms with FCI coverage. As illustrated in Figure 1, approximately 62% of small acreage field crop farm businesses participated in FCI in 2011, 85% of medium acreage farms, and 92% of large acreage farms. About $54.4 billion of debt was held by farm businesses that specialized in field crops in 2011, and 88% of this debt was held by farm businesses that participated in FCI. For small acreage farms, $5.6 billion of debt was held by farms that participated in FCI, or about 79% of all debt held by the acreage class. For medium acreage farms, $16.7 billion of debt was held by farms that participated in FCI, or about 82% of all debt held by the acreage class. For large acreage farms, $25.6 billion was held by farms that participated in FCI, or about 95% of all debt held by the acreage class. Regardless of farm size, farms that participated in FCI accounted for a larger share of debt than farms that did not participate. Farms that purchased FCI are more leveraged. Debt to asset ratios by acreage class and FCI participation status are reported in Figure 2. Debtto-asset ratios are statistically different and higher for all farm businesses, as well as small and large acreage class farms. However, debt-to-asset ratios are not statistically different for medium acreage farms. These relationships generally hold when we look separately at debt-to-asset ratios for (noncurrent) real estate debt only and non-real estate debt only. This relationship is consistent with risk balancing behavior, as well as lenders encouraging farms with higher leverage to participate in FCI. However, lenders may consider several factors beyond leverage in making credit decisions. We find that farms with FCI participation have a higher default risk, using a comprehensive measure of the probability of default (Brewer et al., 2012). The estimate of default risk that we use is similar to a credit score in that it takes into account several measures of farm financial status, including debt coverage measures, owner equity ratios, working capital, current ratio, and others. As shown in Figure 3, about 78% of farm businesses that do not participate in FCI had a less than 1% probability of default (the <0.5% and 0.5-1% categories), compared to 64% of farm business that participated in FCI. The average probability of default for farms without FCI coverage was 1.9%, compared to 2.2% for farms with FCI coverage, and these estimates are statistically different. While FCI could also be lowering the cost of credit through lowering default risk, the relationship between interest rates reported in ARMS and FCI participation is ambiguous. This finding is consistent with the higher financial risk of farms with FCI, which would have an upward effect on interest rates. For short-term loans, non-real estate loans, and real estate loans, only real estate loan interest rates were significantly different for field crop farm businesses by FCI participation status (5.6% for farms without FCI vs. 5.2% for farms with FCI). When we compared interest rates by acreage classes for different types of loans, they were generally not statistically different by FCI participation status.  Other Potential Effects FCI participation has both direct and indirect impacts on farm wealth and investment, which could affect use of credit. To the degree that FCI participation creates value for farm operations, that value could be capitalized into farmland values, increasing owner equity and collateral, and potentially impacting debt use. Through altering the expected returns and risks of different production choices, FCI participation could also lead to new investments that affect overall farm production decisions and structure, such as increasing concentration in production. Further, farms that purchase FCI might be able to have low cash reserves or savings and make additional investments. Farm operations that are more specialized or efficient might be considered more creditworthy and increase use of debt financing. Alternatively, if farmers prefer equity financing, these changes could lead to lower use of debt financing. The potential sector-wide impacts of a linkage between farm debt use and FCI are important to recognize. If FCI participation does increase debt use, there could be positive or negative consequences for the farm sector. An example of a positive consequence would be that farm sector profitability increases through relaxed credit constraints or, in other words, increasing use of debt by creditworthy producers that otherwise would not have had access to credit. In 2005, about 30% of U.S. farms reported some issues with access to credit (Briggeman, Towe, and Morehart, 2009), although more recently bankers have reported low loan demand. An example of a negative consequence would be that some producers take on higher levels of debt than they would have without FCI availability and debt repayment difficulties potentially increase farm bankruptcies."}, {"section_title": "Going Forward", "text": "Financing decisions and FCI participation decisions are related, as FCI participants have higher levels of financial risk. Yet, several questions remain. Has FCI availability caused producers to take higher levels of debt, or do farms that want to take on higher levels of debt or access a higher line of credit purchase FCI based on lender preferences? Both effects may be influencing our findings. Impacts of FCI participation may differ across loan types as well. Production loans are of particular interest, as farm production expenses have more than doubled over the past decade. If credit market imperfections exist and crop insurance addresses these issues, the FCI program could be creating considerable value for the farm sector. Likewise, FCI could be supporting financial positions that are riskier than they would have been otherwise, and thus not lead to a reduction in the total risk faced by the farm sector."}, {"section_title": "For More Information:", "text": ""}]