[{"section_title": "Abstract", "text": "Remote regions across Alaska are challenging environments for obtaining real-time, operational observations due to lack of power, easy road access, and robust communications. The Alaska Ocean Observing System partners with government agencies, universities, tribes and industry to evaluate innovative observing technologies, infrastructure and applications that address these challenges. These approaches support acquisition of ocean observing data necessary for forecasting and reporting conditions for safe navigation and response to emergencies and coastal hazards. Three applications are now delivering real-time surface current, sea ice, and water level data in areas not possible a mere 10 years ago. One particular challenge in Alaska is providing robust alternative power solutions for shore-based observing. Remote power options have been evolving alongside resilient technologies and are being designed for freeze-up conditions, making it possible to keep remotely deployed operational systems running and easy to maintain year-round. In this paper, three remote observing approaches are reviewed, including use of off-grid power to operate high-frequency (HF) radars for measuring surface currents, a real-time ice detection buoy that remains deployed throughout the freeze-up cycle, and a high-quality water level observing alternative to NOAA's National Water Level Observing Network (NWLON) installations. These efforts are highly collaborative and require working partnerships and combined funding from other interested groups to make them a reality. Though they respond to Alaska's needs including Arctic observing, these approaches also have broader applications to other remote coastal regions."}, {"section_title": "INTRODUCTION", "text": "Alaska has been experiencing dramatic changes in the past decade, especially in the Arctic. March 2015 and 2016 Arctic sea ice extents set new record lows in the winter sea ice extent maximum for the entire satellite record starting in 1979 (Viñas, 2016; NASA, 2016) . December 2017 continued this trend and experienced the second lowest ice extent in the satellite record (NSIDC, 2018; Walsh, 2018) . Later freeze-up dates in the fall and earlier break-up dates in the spring are occurring for both the Bering Strait and Chukchi Sea regions (Mahoney et al., 2014; Johnson and Eicken, 2016; DeMarban, 2018a,b; Samenow, 2018) . Sea ice coverage has decreased to the point that existing northern shipping lanes around the world are open for longer periods of time (Masters, 2013) and are projected to experience a continued increase in marine vessel traffic (Arctic Council, 2009 ). This heightens the likelihood of ship groundings and the potential for oil spills in the region (Roelevan et al., 1995; Merrick et al., 2002) . Already, the United States and nations including Russia, China, Korea, and Japan are eyeing increased access and use of this new Arctic Marine Highway for shipping, offshore oil, gas and mining activities, and fishing (Arctic Council, 2009; Zysk, 2014; Pan and Huntington, 2016; Tonami, 2016; Quillérou et al., 2017) . To this end, the United States Arctic, comprised of the Beaufort, Chukchi and Bering Seas, needs a robust marine and coastal observing infrastructure providing real-time maritime observations to support national interests in this region, including navigation safety, hazard risk planning, and incident response (U.S. Navy Dept, 2009; U.S. Coast Guard, 2013) . However, to date, the United States Arctic has been significantly under-observed, especially compared to other United States coasts.\nAlaska is a challenging environment for obtaining real-time observations due to the lack of coastal infrastructure including grid-tied-power, easy road access and robust communication systems. During the past decade, the Alaska Ocean Observing System (AOOS) has partnered with government agencies, universities, tribes, and private industry to evaluate and demonstrate creative solutions to filling information gaps by establishing observing networks and using technologies and infrastructure that circumvent some of these challenges. In this review, we highlight three of these solutions and provide the motivation, application and a brief evaluation on successes that demonstrate the viability of these technologies for Alaska and other remote maritime observing needs."}, {"section_title": "METHODS AND APPROACH", "text": "The Alaska Ocean Observing System and Regional Collaborations\nThe sheer size of the Alaska region requires extensive collaboration and leveraging of other programs to accomplish the AOOS mission, which is to increase observing and forecasting capacity in all regions of the state, especially in the Arctic and the Gulf of Alaska. AOOS supports key observational assets while identifying and working to fill information gaps.\nThe Alaska Ocean Observing System is guided by a governing board made up of state and federal agencies, the University of Alaska and other Alaska research institutions, and representatives of the private sector including marine navigation, fisheries, oil and gas industries, and tribes. Strong stakeholder relationships and active engagement and outreach programs ensure the most urgent observing needs are prioritized as described in the AOOS Strategic Operations Plan (Alaska Ocean Observing System [AOOS], 2016). To enlist stakeholder input used to prioritize observing initiatives, AOOS hosts multiple observing network consortiums. The Alaska Water Level Watch (AWLW) is a collaborative group working to improve the quality, coverage, and accessibility to water level observations in Alaska's coastal zone 1,2 . The Alaska Ocean Acidification Network 3 and the Alaska Harmful Algae Bloom Network 4 are two other examples of AOOS lead, topical working groups. These networks provide forums for stakeholder participation, collaboration and input to observing priorities, and they support and host workshops, pursue funding opportunities and proposals, as well as conduct outreach activities.\nAlaska Ocean Observing System also actively supports and provides public access to regional real-time and historical data through the largest collection of regional and Arctic data, models, and visualization tools, powered by a state-of-the-art highperformance computing center. Through data portal tracking, user feedback and data requests, AOOS identifies where users need more information. All of these efforts provide valuable feedback on the need for specific data and information across the region, and through AOOS, informs the national IOOS program on critical observational data gaps and infrastructural and technology needs required to fill these gaps."}, {"section_title": "Operating High Frequency (HF) Radars in Remote Regions Off the Grid", "text": "High frequency (HF) radar systems are shore-based installations that measure high-resolution speed and direction of surface currents across large areas of the coastal ocean at hourly intervals in real-time. The present state of the United States national HF radar network for measuring surface current has resulted from nearly 40 years of research, development and application (Stewart and Joy, 1974; Teague et al., 1975; Holbrook and Frisch, 1981; Janopaul et al., 1982; Fernandez et al., 1995; Chapman and Graber, 1997; Graber et al., 1997; Essen et al., 2000; Paduan et al., 2001) . HF radars are highly suitable for remote monitoring as they can operate autonomously under any weather condition. The spatial-map time series of HF radar surface currents provide enough detail for important applications including ecosystem research and management, numerical modeling and prediction, search and rescue, hazardous materials spill response, and overall increased marine domain awareness. HF radar signals have also been evaluated as a tool for vessel detection in areas lacking Automated Information System (AIS) capability (Roarty et al., 2013a,b) , increasing their potential utility for remote observing."}, {"section_title": "Challenges With HF Radar Implementation in Alaska", "text": "Changes occurring in the Arctic, the expected increase in vessel traffic and need for predictive capabilities in ocean and ice forecasting are just a few of the motivations to increase HF radar observing in Alaska, especially along the Bering Sea and Bering Strait and the north slope in the Beaufort Sea. Though there is an extensive HF radar network operating continuously along much of the contiguous United States coastline 5 , Alaska currently has only three HF radar stations, which operate along the northwest coast on the Chukchi and western Beaufort Seas. Alaska lacks adequate HF radar installations, due in part to the limited available power and transportation infrastructure across much of the Alaska coastline.\nA 5 MHz HF \"long-range radar\" are most common as they provide the best coverage and can transmit over radar distances up to 200 km using on the order of 7.5 kWh/day. Most HFR systems in the United States obtain power from the onshore power grid, and it is this dependency that has severely limited HF radar application in Alaska. Where power is available, namely in remote coastal communities that struggle with generating their own power needs, site location may not yield the optimal radar mask for sampling ocean currents. Remote installations of HF radar in Arctic and sub-Arctic Alaska must also consider difficult and costly logistics, demanding environmental conditions such as high winds, sub-freezing temperatures, salt-laden maritime air and icing, inquisitive, and potentially disruptive, wildlife (rodents, foxes, and bears), and site permit requirements."}, {"section_title": "HF Radar Power Solution -The Remote Power Module (RPM)", "text": "To solve the power problem with HF radar installations in Alaska, engineers and scientists from the University of Alaska, Fairbanks (UAF) College of Fisheries and Ocean Sciences developed an HF radar remote power module (RPM) (Statscewich et al., 2011 (Statscewich et al., , 2014 . The RPM (Figure 1 ) is a stand-alone device for longterm deployments that minimizes permit issues associated with diesel generators and logistical costs associated with refueling and maintenance. The RPM design facilitates setup and transport to remote sites using small vehicles, and contains subsystems 5 http://hfradar.ndbc.noaa.gov for power generation, satellite communications, and power performance monitoring. A battery bank with a 5-day power reserve is charged primarily by wind and solar, and secondarily by a biodiesel generator. The current system used in Alaska is specifically designed for high latitudes, but can be modified for remote coasts elsewhere. Two of the three Alaska HF radar stations are currently powered by RPMs. The UAF team has also successfully operated three HF radars in Antarctica, two of which were powered exclusively by RPMs. In 2019, AOOS and UAF will install two additional HF radars in the Bering Strait region with one system utilizing an RPM."}, {"section_title": "Lessons Learned", "text": "The RPM design has proven reliable for the \"High Arctic\" and the Antarctic summer, but has several critical flaws, namely in the ability to keep electronics warm in deep winter. Engineers have since developed an insulated, thermo-regulated enclosure for the sensitive HFR electronics. Fortunately, heavy snow has not been an issue, as the foundation keeps the instrument enclosure and the bottom of the solar array nearly 1.5 m above the ground. Solar panels are kept at a fairly steep angle of 65 degrees, so snow tends to slide off, keeping them exposed to sunlight. To ensure real-time data delivery, an add-on iridium satellitebased data telemetry system will be implemented to provide a reliable data back-haul as a fail-over should the Hughes Net telemetry system go down. The three RPMs currently in the Arctic have produced nearly 90% of their total power from the wind, and similar performance at the new Bering Strait location is expected, but with periodic bursts of much higher winds than are typically seen on the north slope. To accommodate the higher winds, the wind turbine masts have been reinforced with a grade 80 stainless steel insert and deployed wind turbines will have a smaller rotor diameter to avoid excessive blade deflection and mast strikes. The power delivery sub-panel for the RPM has also undergone a major revision and will be much more compact, modular and integrated. The net result of these modifications will reduce total cost to build and purchase the RPM, enable quicker installation in harsh environments and provide additional system health monitoring, expediting a more thorough remote troubleshooting capability.\nThe 2015 subsurface mooring was never recovered, either because the acoustic release failed, or more likely because ice keels moved the mooring by hooking the subsurface floatation. In 2018, a third IDB deployment only reported data for 1 day before going off-transmission due to ice. A passing research vessel recovered the intact mooring, which had moved south from its original deployment position and sustained damage to the antenna. The IDB surface and subsurface floatation clearly puts it at risk of mobile ice any time of year, and the IDB sea-trials have informed several needed modifications for future IDBs, including safeguarding against ice rafts and reinforcing the surface float communications antenna. Despite these risks, the value of capturing the real-time water column density stratification conditions during freeze-up was demonstrated and the success has captured the attention of the NWS and other stakeholders interested in ice freeze-up prediction and forecasting.\nThe Seward sea trials using GNSS-R for water level observing have provided valuable logistical installation information for future remote deployments. Seward GNSS-R data indicated that deployment near mountainous regions can block satellite coverage and reduce the data rate during certain times of the day. GPS receivers provide high frequency data rates for water level observing, and fortunately, the reduced data rate did not prevent tidal harmonic and subtidal analyses of the data. However, a period of time when a ship was moored near the GPS receiver caused interference in the data quality, and illustrated the importance of locating installations away from areas frequented by boats."}, {"section_title": "Real-Time Ice Detection Buoys for Maritime Domain Awareness and Ice Forecasting", "text": "In the United States Arctic, federal agencies, shipping and the oil and gas industries require an accurate method of predicting sea ice formation for offshore operations and maritime safety. One aim is to avoid costly, premature or delayed cessation of marine operations caused by inaccuracies in model predictions or satellite detection of sea ice formation. Despite the exceptional ability to forecast the onset of sea-ice formation, sea ice models remain challenged by the lack of information about how the vertical density gradient (induced by both temperature and salinity) over the shelf evolves as a function of air-sea heat fluxes. This information is limited as real-time water column observations are typically restricted to seasonal mooring operations that can only be conducted with vessel support during ice-free conditions. However, it is precisely during the breakup and freeze-up transitions when these observations are most needed for accurate ice modeling and forecasting efforts.\nA Real-Time Ice Detection Buoy System (IDB)\nThe IOOS Ocean Technology Transition (OTT) program, sponsoring the transfer of emerging marine observing technologies into operational-ready platforms, supported the University of Alaska (UAF), industry partner Pacific Gyre and AOOS to fully develop and deploy an ice detection buoy (IDB) system that inexpensively and accurately reports the seasonal evolution of the thermohaline structure in the water column through the freeze-up cycle. Data from the IDB are needed by models to determine when the onset of offshore sea ice formation begins, while providing guidance for improving remote sensing algorithms for frazil ice detection, a notoriously difficult process for remote sensing ice satellites. The IDB itself is designed to transmit data real-time via iridium satellite through the onset of ice formation, at which time an expendable surface buoy is remotely detached by an operator to prevent loss of the subsurface mooring just before ice moves in or freeze-up commences. The subsurface mooring and sensor array remain in the water below ice keel-depth, recording data through the following breakup cycle and planned recovery."}, {"section_title": "Alaska IDB Sea Trials", "text": "The first IDB was deployed in 2015 on the Chukchi Shelf in 40 m water depth. The mooring was equipped with a sea surface thermistor, five subsurface SBE 37 IMM Microcat Conductivity and Temperature sensors (8,10, 20, 30, and 40 m) , subsurface floatation below the expected ice keel-depth, an acoustic release and an expendable surface float equipped with iridium antennae for data transmission 6 . The IDB successfully reported the vertical temperature and salinity structure of the Chukchi Sea shelf in real-time prior to and during the 2015 freeze-up cycle. Operators released the expendable surface buoy when the vertical density gradient eroded in early November and satellite imagery indicated the main ice pack was less than a day from over-riding the mooring (Hauri et al., 2018) .\nThe success of this trial buoy lead to the deployment of an identical system in 2017, with support from the NOAA National Weather Service (NWS). 2017 data were displayed real-time on the AOOS data portal as well as shared through the GTS (Global Telecommunications System), which enabled real-time access to the IDB data for use in the NWS Alaska Sea Ice Program (ASIP) forecasting activities. Data were used in the daily ice analysis, 5-day sea ice forecasts, and the 3-month sea ice outlook products. The NWS analyzed the IDB data alongside current satellite imagery in the vicinity of the buoy for a better informed and more complete view of the coupled atmosphere/ice/ocean system. The 2017 IDB was successfully recovered in the late summer of 2018 and the overwintering data are currently being analyzed.\n6 https://aoos.org/ice-detection-buoy/"}, {"section_title": "A Tiered Data Quality Approach for Observing Water Levels", "text": "Accurate water level observations are fundamental for safe navigation, mapping and charting, storm-surge forecasting, informed emergency response, and ecosystem management. Alaska's extensive and remote shorelines are especially underinstrumented with respect to basic water level observations, due in part to regional obstacles including the formation of seasonal ice, the lack of coastal infrastructure needed to install observing platforms and rapid coastal erosion that render conventional water level sensing technologies impractical. Approved NOAA Center for Operational Oceanographic Products (CO-OPS) National Water Level Observation Network (NWLON) technologies primarily consist of in-water sensors in stilling wells or down-looking microwave systems, and station siting is heavily reliant on ice-free conditions and local infrastructure, making annual operations and maintenance of a more widespread series of NWLONs cost prohibitive for most of the low infrastructure coastline in Alaska. Currently, the entire west and north coasts of Alaska have only five NWLON tide gauges. Though NWLON installations are always desirable as they provide the best solution for all water level data applications, a tiered water level data policy allows for observations with lesser accuracies (Edwing, 2015) . The policy stipulates water level data quality tiers A (e.g., NWLON), B and C, matching data accuracy to specific applications ( Table 1) .\nThe Alaska Water Level Watch (AWLW) partnership is working to augment the existing Alaska NWLON with tiered coastal water level observation products (e.g., real time stations, short-term time series, and high-water mark measurements). The ultimate goal is to make these additional data products public through a robust data management system that parallels the NOAA CO-OPS Tides and Currents online system 7 , as this system only hosts Tier A data. AOOS is supporting the initial development of the tiered data portal, and IOOS and NOAA CO-OPs plan to advance development Real time or non-real time (determined by agreement)\nNon-real time (minimum latency -24 h), except for tsunami data (Adapted from Edwing, 2015) .\nof this capability and make it nationwide through the IOOS Regional Associations."}, {"section_title": "Remote, Real-Time Water Level Observing Using GNSS Reflectometry", "text": "Alaska Ocean Observing System is testing alternative methods that provide Tier B water level information, the minimum accuracy sufficient for computing datums, resolving tidal and subtidal water levels within 10 s of cm, also adequate for understanding flooding events and validating storm surge models and forecasts. Global Navigation Satellite Systems (GNSS) receivers have been demonstrated to provide a quality alternative method for directly measuring water level without a tide gauge, referred to as GNSS-Reflectometry (GNSS-R) (MartinNeira, 1993; Löfgren et al., 2011; Larson et al., 2012 Larson et al., , 2013 Larson et al., , 2017 Dawidowicz, 2014; Strandberg et al., 2016; Williams and Nienvinski, 2016) . GNSS-R receivers measure water level changes at an oblique angle, and can be installed on existing infrastructure, such as a pier or a building, or directly on land where a clear view of the water surface exists with no obstructions. The basic approach uses reflected GPS satellite signals to determine the height of a reflecting surface, such as the ocean, relative to a stable GPS antenna of fixed local height. The total received GPS signal measured by the antenna is the sum of the direct signal and the reflected signal. The interference between these two signals depends on the satellite altitude in the sky and on the receiver height above the ground. Given the satellite altitude is known, the observed interference pattern as the satellite rises/sets is used to extract the receiver height, after which the antenna height is subtracted to determine the true water level. GNSS-R can be installed and maintained more easily and at significantly lower cost than a traditional NWLON tide gauge while providing high quality Tier B water level information (e.g., Larson et al., 2013) . GNSS-R systems do not require much power, and can operate off remotely rechargeable power supplies, such as small solar panels with rechargeable batteries, making them suitable for remote coastal installations. GNSS-R receivers also do not need to be removed prior to freeze-up, hence are especially well-suited for year-round Arctic installations. Real-time (or near real-time) data can be transmitted either by cell phone (if in a community with service), or via an iridium satellite link."}, {"section_title": "Alaska GNSS-R Pilot Study", "text": "Since 2017, AOOS and partners have been exploring GNSS-R water level measuring techniques to determine the efficacy of these systems for use in remote Alaska, and to determine some of the limitations in various environmental settings, such as mountainous fjords commonly found along the Southeast Alaska coast, and low-rise topography coastal areas with large tidal excursions common along the western Alaska coastline and north slope. The NWS is supporting AOOS in testing GNSS-R systems from both a non-profit geoscience consortium UNAVCO 8 , and a private industry partner ASTRA, LLC.\nAlaska Ocean Observing System and UNAVCO have just started their collaboration, but AOOS and ASTRA, LLC completed their first GNSS-R sea trial in 2018 using ASTRA's commercialized dual frequency GPS system that was initially developed for space weather monitoring. These space weather systems have operated in Alaska, including the Arctic, for over 10 years. A year-long pilot study conducted in Seward, Alaska enabled the performance of the ASTRA GPS receiver to be evaluated against water level measurements from a NOAA-operated NWLON station 2 km away. The water level data comparisons between the two methods showed acceptable agreement with the GNSS-R major tidal constituents (M2, S2, N2, K1, and O1) measuring within 5 cm of the NWLON estimates, easily meeting the Tier B water level criteria objective (Janzen et al., 2018) ."}, {"section_title": "DISCUSSION", "text": "All observing activities in Alaska depend on substantial partnerships and leveraging of resources, as well as enhanced coordination with Alaska coastal communities and tribes. AOOS, as the Integrated Ocean Observing System (IOOS) Regional Association (RA) responsible for coordinating statewide monitoring for Alaska's nearly 44,000 miles of coastline and offshore environments, is not the only entity working in this realm. However, it is the only entity representing state and federal agencies, research institutions and the private sector whose primary mission is to enhance ocean observations to meet a broad range of end user needs. Many of these activities depend on the collaboration among all 17 federal agencies within the NOAA managed national IOOS Program, as well as links to the Global Ocean Observing System (GOOS) and the Group on Earth Observations (GEO). These collaborations should be fostered and enhanced with training and technical support, as well as additional mechanisms for transferring and sharing of funds among federal agencies and with the private sector. As the Arctic continues to become more accessible and receive greater attention and use, a modest investment in additional observing assets in the region -linked to pan-Arctic assets and those in other Arctic regions, will enhance the United States marine domain awareness in the Arctic as well as national and international security."}, {"section_title": "AUTHOR CONTRIBUTIONS", "text": "CJ: AOOS program manager of all projects in mini-review, lead author of this manuscript, lead author of Sections "}, {"section_title": "ACKNOWLEDGMENTS", "text": "We would like to recognize the following for working toward increased marine observing: The NOAA Office of Coast Survey (OCS), the NOAA National Weather Service (NWS), the NOAA Integrated Ocean Observing System (IOOS) program, the Alaska Department of Natural Resources, and the Bureau of Ocean and Energy Management (BOEM). We would also like to thank our private industry partners Pacific Gyre and ASTRA, LLC, and non-profit partner UNAVCO for their significant role in making innovative and cost effective remote observing technologies possible."}]