[{"section_title": "INTRODUCTION", "text": "Estuaries are transitional ecosystems that occur wherever freshwater from rivers mixes with the sea, encompassing deepwater tidal habitats and tidal wetlands (Pritchard 1967;Cowardin et al. 1979;PSP 2012). Estuaries and their associated tidal wetlands perform numerous ecological, economic, and cultural functions, including buffering storm surges, cycling nitrogen and phosphorus, decomposing waste and excess nutrients, regulating the climate by storing carbon, and providing habitat for terrestrial and aquatic species, many of which are harvested for food (Costanza et al. 1997;McLeod et al. 2011;Crooks et al. 2014;Mitsch and Gosselink 2015). Along the coast of Washington state, the nutrient cycling, nursery habitat, carbon storage, and other functions performed by the Puget Sound estuary system translate into benefits to human populations in the form of clean water, toxic algal bloom prevention, protected coastal property, and populations of commercially valuable species such as salmon and oysters (Simenstad et al. 1982;Goble and Hirt 1999;Batker et al. 2008;PSP 2012). The benefits that humans derive from ecosystem functions are termed ecosystem services, and they are what make estuaries and their tidal wetlands critically important to human populations globally and in the Puget Sound region in particular (Costanza et al. 1997). Because the ecosystem services provided by estuaries are fundamental to and inseparable from the activities of human societies, some studies have attempted to estimate the monetary value of estuary ecosystem services. Costanza et al. (1997) estimated that coastal systems worldwide contributed at least US$10.6 trillion per year in ecosystem services, of which US$4.1 trillion per year came from estuaries. With respect to the Puget Sound, Batker et al. (2008) estimated the value of estuary ecosystem services ranges from $10.29 million to $1.03 billion per year. Tidal marshes, in particular, provide ecosystem services worth $1.6 trillion per year globally, and $29.83 million to $9.54 billion per year in the Puget Sound (Costanza et al. 1997;Batker et al. 2008). The value of estuaries and tidal wetlands will likely only increase as an increasing human population and the effects of climate change (e.g. rising sea levels, more powerful storms occurring more frequently) place more pressure on historically extensive estuaries and tidal wetlands that have been largely degraded and lost (Collins et al. 2003;Batker et al. 2008;Mote et al. 2008;DOE 2012;PSP 2012). The loss and degradation of tidal wetlands in the Puget Sound began in the 1850s with the arrival of Euro-American settlers, who were of the mindset that estuaries and tidal wetlands were without value in their natural state (Goble and Hirt 1999;Batker et al. 2008). Consequently, tidal wetlands were converted to agricultural, urban, and industrial uses during the 19 th and 20 th centuries via filling and the construction of dikes, levees, and tide gates (Goble and Hirt 1999;Collins et al. 2003;Collins and Sheikh 2005). Additionally, shoreline armoring resulted in tidal wetland loss by increasing the erosion of river deltas, which were also receiving lower sediment inputs due to tidal barriers (Simenstad et al. 2009;Schlenger et al. 2011). More recently, a recognition of the value of estuaries and tidal wetlands has prompted restoration efforts from federal, state, local, and tribal agencies, as well as non-governmental organizations (PSP 2012;USACE et al. 2016). As part of the restoration effort, the Washington state legislature founded the Puget Sound Partnership in 2008 to create an Action Agenda that established recovery objectives and monitoring indicators for the Puget Sound (PSP 2012). The PSP indicator tracking the amount of land restored to tidal flooding, and by assumption to tidal wetland habitat, within Puget Sound's 16 major river deltas showed 1,272 ha had been restored by 2019, and 1,715 ha would have to be restored to reach the 2020 target of 2,987 ha (Ramirez 2019a). However, decisions regarding where and how much area should be restored require knowledge of how much tidal wetland area was historically present and how much of that historical area is left. Although the fact of extensive tidal wetland loss is well-established, estimates of the extent of tidal wetland loss throughout the Puget Sound vary from 53% (Simenstad et al. 2009;Schlenger et al. 2011) to 76% (PSP 2012) to slightly over 80% (Collins and Sheikh 2005;Batker et al. 2008). Consequently, estimates of the current and historical extent of tidal wetlands also vary. To investigate the variability among estimates, this study compared three estimates of the current and historical extent of tidal wetlands in the 16 major river deltas of the Puget Sound to determine how and where the estimates differ."}, {"section_title": "METHODS", "text": "Three estimates of the current and historical extent of tidal wetlands in the 16 major river delta estuaries of the Puget Sound were compared to one another and to a fourth estimate developed by Crooks et al. (2014) for the Snohomish estuary. The three estimates come from Brophy et al.'s (2019) analysis of estuary habitat loss along the west coast of the United States, Ramirez's (2019b) study of estuary extent in the Puget Sound, and Simenstad et al.'s (2011) analysis of change and impairment of nearshore habitats in the Puget Sound. Given the level of detail and consequent accuracy of the current and historical wetlands extent estimates from Crooks et al. (2014), those estimates were used to assess the accuracy of Brophy et al.'s (2019), Ramirez's (2019b), and Simenstad et al.'s (2014) estimates. Because the comparison was limited to vegetated (i.e. emergent, scrub-shrub, and forested) tidal wetlands, distributary channel and mudflat areas were subtracted or excluded during area calculations when possible. Unvegetated areas were excluded by Brophy et al. (2019) in their analysis of wetland loss, so their area values were left unaltered. To calculate the historical vegetated extent for Ramirez (2019b), the areas of primary distributary channels and distributary channels were subtracted from the full estuary extent. Ramirez's (2019b) current vegetated extent was calculated by summing the areas of tidal channels, tidal channel complexes, and connected wetlands. Tidal channels and tidal channel complexes were included in the vegetated area calculations because Brophy et al. (2019) and Simenstad et al. (2011) included tidal channels in their vegetated extents. The current and historical vegetated extents for Simenstad et al. 2011 "}, {"section_title": "Brophy et al. (2019) West Coast USA Current and Historical Estuary Extent", "text": "The historical extent of vegetated tidal wetlands in this study was created from a seaward boundary delineated by the National Wetlands Inventory (NWI) and a landward boundary set at the 50% exceedance contour, which Brophy et al. determined was the landward extent of the highest annual tides. Extreme Water Levels (EWL) data from NOAA tide gauges were combined with LiDAR digital elevation models (DEMs) to map the 50% exceedance boundary. The historical seaward boundary Brophy et al. used in their analysis of wetland loss was set at the vegetated edge of the delta wetlands, which was delineated by the NWI from 1980 and 1981 high-altitude aerial photographs with scales ranging from 1:62,000 to 1:130,000 (USFWS 2020). Within the historical extent, the 1980s NWI wetland data was used to determine the current extent of tidal wetlands with emergent, scrub-shrub, or forested vegetation types. Any vegetated wetland area the NWI had classified as tidal, connected (i.e. not diked or drained), and estuarine, riverine, palustrine, or lacustrine was included as part of the current wetland extent."}, {"section_title": "Ramirez (2019b) Estuaries Common Indicator", "text": "Ramirez used data from the Pacific Marine and Estuarine Fish Habitat Partnership (PMEP) and NOAA Northwest Fisheries Science Center to delineate the landward and seaward boundaries, respectively, of the historical tidal wetlands extent. The PMEP landward boundary was the 50% exceedance contour used by Brophy et al. (2019), and it was calculated using the same NOAA EWL and LiDAR DEM data used by Brophy et al. (2019) since multiple authors from the Brophy et al. (2019) study first developed the 50% exceedance landward boundary method in 2014 (Lanier et al. 2014). The historical seaward boundary was set at the vegetated edge of the delta wetlands, which was mapped by NOAA as part of the Puget Sound Salmon Habitat Status and Trends Monitoring Program. NOAA mapped the vegetated edges at a scale of 1:2,000 from 2010 and 2011 0.3-m resolution aerial images (Beechie et al. 2017). Like the historical extent, Ramirez delineated the current tidal wetlands extent using data from the Puget Sound Salmon Habitat Status and Trends Monitoring Program. The program used LiDAR DEMs and 2011 aerial imagery to determine the extent of tidal inundation within an estuary. All areas seaward of a tide gate, dike, or other obstruction to tidal inundation were included in the current wetlands extent."}, {"section_title": "Simenstad et al. (2011) Puget Sound Nearshore Ecosystem Restoration Project (PSNERP)", "text": "Simenstad et al. created their historical and current tidal wetlands extents from historical and current wetland data developed by Collins and Sheikh (2005) for the Puget Sound River History Project. Collins and Sheikh (2005) primarily used US Coast and Geodetic Survey topographic sheets (T-sheets) and General Land Office (GLO) survey maps from the 1850s to the 1890s to map the historical boundaries, which extended to the seaward and landward vegetated edges of tidal wetlands within the river deltas. Aerial photographs from the 1930s, LiDAR DEMs, hydric soil maps, and other sources were used to supplement the information provided by the T-sheets and GLO maps (Collins and Sheikh 2005;Collins 2008). Although neither the T-sheets nor the GLO maps predate land conversion and development in the major river deltas, those sources still provide valuable and reliable information on the historical extent of tidal wetlands (Collins and Sheikh 2005;Crooks et al. 2014). Collins and Sheikh (2005) used orthorectified aerial photographs from 1998 to 2004 to map current tidal wetlands and other land cover classes. The aerial photographs were supplemented with NWI, LiDAR DEMs, oblique shoreline photographs, and ShoreZone shoreline data from the Washington Department of Natural Resources. The riverine and estuarine emergent, scrub-shrub, and forested wetland land cover classes from the Collins and Sheikh (2005) data were selected and grouped into estuarine mixing (emergent), oligohaline transition (scrub-shrub), and tidal freshwater (forested) classes by Simenstad et al. to construct the PSNERP historical and current tidal wetlands extents (Anchor QEA 2009)."}, {"section_title": "Crooks et al. (2014) Snohomish Estuary", "text": "Crooks et al. mapped the historical tidal wetlands extent in the lower Snohomish estuary using land cover data from Haas and Collins (2001) and the Puget Sound River History Project. Like the Puget Sound River History Project, Haas and Collins (2001) used GLO maps and T-sheets from 1884 and 1885 to map emergent, scrub-shrub, and forested tidal wetlands and other land cover classes within the Snohomish estuary. The current wetlands extent in the lower Snohomish estuary was mapped using remotely sensed 2006 land cover data from NOAA's Coastal Change Analysis Program (C-CAP). The C-CAP data was applied within a boundary set at the potential elevation of Mean Higher High Water in 100 years."}, {"section_title": "RESULTS", "text": "Among the 8 estuaries analyzed by Brophy et al. (2019), Ramirez (2019b), and Simenstad et al. (2011), Ramirez (2019b) produced the highest total historical and current extent estimates, whereas Simenstad et al. (2011) had the lowest total historical extent estimate (Table 1). Brophy et al. (2019) had the lowest total current extent estimate, and they produced the greatest total percent loss of 84.2% (Table 1). Ramirez's (2019b) and Simenstad et al.'s (2011) total percent losses were 80.4% and 75.9%, respectively, for the 8 estuaries Brophy et al. (2019) analyzed. Ramirez (2019b) and Brophy et al. (2019) found losses in all of the estuaries they analyzed, but Simenstad et al.'s (2011) analysis showed 7 of the 16 estuaries had gained vegetated tidal wetland area (Table 1) (Fig. 1). According to the Ramirez (2019b) and Brophy et al. (2019) estimates, the Samish estuary lost the most tidal wetland area, with percent loss being 98.3% and 98.2%, respectively (Fig. 2). Percent loss was greatest in the Duwamish and Puyallup estuaries (99.7%) for Simenstad et al. (2011), though the Samish estuary had the second greatest percent loss of tidal wetland area (96.5%) (Fig. 2, Fig. 3).  Brophy et al. (2019). These are the Nooksack, Samish, Skagit, Stillaguamish, Snohomish, Nisqually, Skokomish, and Quilcene.   In the lower Snohomish estuary, Crooks et al.'s (2014) estimates produced the greatest percent loss of tidal estuary (99.6%) ( Table 2). Simenstad et al.'s (2011) percent loss was closest to that of Crooks et al. (2014), though their historical extent estimates differed the most (Table 2) (Fig. 4). Brophy et al.'s (2019) current tidal wetland extent estimate was the most similar to Crooks et al.'s (2014), but, even so, Brophy et al.'s (2019) current extent estimate was 48 times greater than Crooks et al.'s (2011) estimate (Table 2) (Fig. 5).    Brophy et al.'s (2019) and Ramirez's (2019b) historical estimates were more similar to one another than they were to Simenstad et al.'s (2011) historical estimate. This similarity is likely the result of Brophy et al. (2019) and Ramirez (2019b) using similar methods and data sources to create their seaward and landward boundaries. Specifically, Brophy et al. (2019) and Ramirez (2019b) derived their historical seaward vegetated edges from 1980s and 2000s aerial photographs that were recent relative to the maps from the late 1800s used by Simenstad et al. (2011), and thus Brophy et al.'s (2019) and Ramirez's (2019b) historical seaward boundaries were generally in agreement. Moreover, Brophy et al.'s (2019) and Ramirez's (2019b) historical landward boundaries were the same because Brophy et al. (2019) and Ramirez (2019b) used the same methods and data to calculate their historical landward boundaries."}, {"section_title": "DISCUSSION", "text": ""}, {"section_title": "Historical Extent", "text": "The method Brophy et al. (2019) and Ramirez (2019b) used to create their historical landward boundaries may also explain why their historical extents were larger than Simenstad et al.'s (2011) historical extent (Table 1). Because Brophy et al.'s (2019) and Ramirez's (2019b) historical landward boundaries were calculated as the highest elevation annually inundated by tides, their boundaries extend farther inland than Simenstad et al.'s (2011) historical landward boundary, which was derived from surveyors' direct mapping of the extent of tidal wetlands. This difference in how the three studies obtained their landward boundaries largely explains why percent loss was greatest in the Samish according to Brophy et al. (2019) and Ramirez (2019b), but not Simenstad et al. (2011). Although the three studies produced very similar current extents in the Samish, Brophy et al. (2019) and Ramirez (2019b) produced a greater percent loss because their historical landward boundaries extended farther inland than Simenstad et al.'s (2011) historical landward boundary (Fig. 2). Simenstad et al. (2011) showed percent loss was greatest in the heavily industrialized Duwamish and Puyallup because, unlike the 2000s aerial photographs Ramirez's (2019b) historical extent was based on, the late 1800s maps Simenstad et al. (2011) used to construct their historical extent were created before the Duwamish and Puyallup tidal wetlands were completely converted to industrial uses (Fig. 3). In addition to showing the Puyallup and Duwamish have experienced the greatest loss of tidal wetland area, Simenstad et al.'s (2011) historical and current estimates indicated the Deschutes, Skokomish, Hamma Hamma, Duckabush, Dosewallips, Quilcene, and Elwha have gained tidal wetland area (Table 1). In most of the estuaries that gained tidal wetland area, the gains appear to be due to large unvegetated areas in Simenstad et al.'s (2011) historical extent becoming vegetated in their current extent (Fig. 1). As such, Simenstad et al.'s (2011) extent suggests vegetated tidal wetlands in the smaller estuaries have migrated seaward, though Brophy et al.'s (2019) and Ramirez's (2019b) extents do not show the same seaward migration (Fig. 1)."}, {"section_title": "Current Extent", "text": "Similar to how Simenstad et al.'s (2011) direct mapping of tidal wetlands may have produced a smaller historical extent than Brophy et al. (2019) and Ramirez (2019b), Brophy et al. (2019) and Simenstad et al. (2011) may have produced smaller current extents than Ramirez (2019b) because they directly mapped their tidal wetlands from aerial photographs. Instead of delineating current tidal wetlands from aerial photographs, Ramirez (2019b) mapped tidal barriers and assumed all the area seaward of a barrier was tidal wetland area. In the Nooksack, Ramirez's (2019b) assumption that tidal wetlands were present in all areas seaward of tidal barriers may explain why Ramirez's (2019b) current extent in the Nooksack extended farther inland than Brophy et al.'s (2019) and Simenstad et al.'s (2011) current extents, and consequently produced an area estimate that was over twice as large as Brophy et al.'s (2019) and Simenstad et al.'s (2011) current estimates (Table 1). Contrary to Ramirez's (2019b) current extent in the Nooksack, Ramirez's (2019b) current extent estimate was half as large as Brophy et al.'s (2019) and Simenstad et al.'s (2011) current estimates (Table 1). This difference was mostly caused by differences in where each study decided to draw the boundary differentiating the Stillaguamish from the Skagit. Brophy et al. (2019) and Simenstad et al. (2011) placed their boundary between the Stillaguamish and the Skagit farther north than Ramirez (2019b) did. Thus, some of the tidal wetland area that Brophy et al. (2019) and Simenstad et al. (2011) assigned to the Stillaguamish was assigned to the Skagit by Ramirez (2019b). Additionally, Brophy et al.'s (2019) and Simenstad et al.'s (2011) current extents in the Stillaguamish extend farther west than Ramirez's (2019b) current extent. Differences among Brophy et al.'s (2019), Ramirez's (2019b), andSimenstad et al.'s (2011) current extent estimates may also be explained by the age of the data used in each study. Whereas Ramirez (2019b) and Simenstad et al. (2011) derived their current extents from aerial photographs taken in the 2000s, Brophy et al. (2019) used NWI maps from 1980 and 1981 to produce their current extent. As such, Brophy et al.'s (2019) current extent does not include tidal wetland areas that have been restored since the 1980s. Additionally, errors in NWI maps usually result from wetlands being omitted rather than non-wetland habitats being mistakenly mapped as wetlands (Tiner 1997). Taken together, these factors may explain why Brophy et al. (2019) produced the smallest current extent."}, {"section_title": "Snohomish Validation", "text": "Differences between the historical extents in the lower Snohomish can be explained by differences in the exclusion and inclusion of patches of tidal wetland area among the four extents. Specifically, Crooks et al.'s (2014) historical extent was lower than Brophy et al.'s (2019), Ramirez's (2019b), and Simenstad et al.'s (2011) historical extents due to the exclusion of patches of tidal wetlands located seaward and along the eastern edge of the estuary (Fig. 4). Simenstad et al. (2011) produced the largest historical estimate because they included the area of distributary channels, which were excluded by the other three estimates, and more seaward patches of tidal wetland than Crooks et al. (2014), Brophy et al. (2019), and Ramirez (2019b) (Fig. 4). With respect to the current extent of the lower Snohomish, differences among the studies appear to be the result of differences in what type of wetlands were included in each study. Crooks et al.'s (2014) current extent estimate identified 2,137 ha of wetlands, of which 14 ha were tidal and 2,123 ha were palustrine (nontidal) wetlands (Table 2) (Fig. 5). Unlike Crooks et al. (2014), Brophy et al. (2019) included tidally influenced palustrine, riverine, and lacustrine wetlands in their current extent, and Ramirez's (2019b) extent may also have included tidal freshwater wetlands since Ramirez (2019b) did not differentiate between wetland types when assuming that all wetlands seaward of tidal barriers were tidal wetlands. Similarly, S classified riverine wetlands as tidal freshwater wetlands, which accounted for 518 ha of their current extent estimate, though the areas of two wastewater treatment plants were included Simenstad et al.'s (2011) tidal freshwater wetland area (Anchor QEA 2009) (Fig. 5). Crooks et al. (2014) "}]