[{"section_title": "Abstract", "text": "A polyT repeat in an intronic polymorphism (rs10524523) in the TOMM40 gene, which encodes an outer mitochondrial membrane translocase involved in the transport of amyloid-b and other proteins into mitochondria, has been implicated in Alzheimer's disease and APOE-TOMM40 genotypes have been shown to modify disease risk and age at onset of symptoms. Because of the similarities between Alzheimer's disease and sporadic inclusion body myositis (s-IBM), and the importance of amyloid-b and mitochondrial changes in s-IBM, we investigated whether variation in poly-T repeat lengths in rs10524523 also influence susceptibility and age at onset in a cohort of 90 Caucasian s-IBM patients (55 males; age 69.1 ± 9.6). In carriers of APOE e3/e3 or e3/e4, genotypes with a very long (VL) poly-T repeat were under-represented in s-IBM compared to controls and were associated with a later age at symptom onset, suggesting that these genotypes may be protective. Our study is the first to suggest that polymorphisms in genes controlling mitochondrial function can influence susceptibility to s-IBM and have disease modifying effects. However, further studies in other s-IBM populations are needed to confirm these findings, as well as expression studies of different TOMM40 alleles in muscle tissue."}, {"section_title": "Introduction", "text": "Sporadic inclusion body myositis (s-IBM) is a progressive degenerative and inflammatory myopathy which has a number of features in common with Alzheimer's disease (AD), such as a late onset (most commonly over the age of 50 years), abnormal accumulation of amyloid-b and other misfolded proteins, mitochondrial dysfunction and oxidative stress [1] [2] [3] [4] . However, studies to date have shown differences in genetic susceptibility for the two diseases. Whereas in AD apolipoprotein APOE e4 is a strong risk factor [5] , in s-IBM there is no recognised association with APOE genotype [6, 7] , although APOE has been shown to co-localise with b-amyloid in vacuolated muscle fibres [8] .\nThe strongest genetic association in s-IBM is with the HLA-DRB1 and secondary HLA-DRB loci in the central MHC region [9] [10] [11] . In addition, in a phylogenetic analysis of mtDNA variants we demonstrated an association with the 4336G and 4580A D-loop variants in s-IBM, but not in AD [12] .\nThe 'Translocase of Outer Mitochondrial Membrane 40' homologue (TOMM40) gene is adjacent to and in linkage disequilibrium with the APOE locus on chromosome 19. TOMM40 encodes the mitochondrial pore protein Tom40, which is part of the TOM complex and is involved in the passage of peptides and importation of amyloid-b into mitochondria [13] . Roses et al [14] first reported that in late-onset Alzheimer's disease (LOAD), carriers of the APOE e3/e4 genotype, with a VL-[very long] poly-T repeat from the e3 strand and a L [Long] poly-T repeat from the e4 strand at rs10524523 in intron 6 of TOMM40 had a higher disease risk and an earlier age at onset than individuals with the S [Short] poly-T on the APOE-TOMM40 linkage disequilibrium region. An association between carriage of the VL allele per se and disease risk was subsequently also found in other AD populations [15] , but in the opposite direction, with carriage of the VL allele being found to be protective [16] . Subsequent observations demonstrated that the genotypes of both inherited alleles are in fact important in determining the age-at-onset, with homozygotes of the VL allele having the oldest age-at-onset curve and other genotypes being associated with an earlier onset [17] .\nIn this study we investigated whether genetic variation in APOE-TOMM40 also influences disease susceptibility and the age of symptom onset in s-IBM. Our hypothesis was that genetic variants of TOMM40 may have differential effects on mitochondrial function in muscle that may impact on the risk of developing s-IBM and the tempo of the disease, and that some alleles of TOMM40 may have a protective effect."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Subjects", "text": "DNA was collected from 90 Caucasian s-IBM patients (55 males; age 69.1 ± 9.6) recruited at the Australian Neuromuscular Research Institute in Perth, the Royal Melbourne Hospital and Monash Medical Centre in Melbourne, and the Concord Repatriation and Royal North Shore Hospitals in Sydney, who fulfilled the diagnostic criteria for definite or probable s-IBM [2, 18] . All patients had a detailed clinical history taken, including the age-at-onset of the initial symptoms of limb muscle weakness, and a full neurological examination with grading of muscle strength on an expanded (10-point) Medical Research Council scale. The age-at-onset was determined from the recollection of the patients, and when available their spouses, of the year in which they first became aware of symptoms of lower limb or hand weakness, and ranged from 37 to 83 years (mean 60.4 ± 9.7 years). The mean disease duration at the time of DNA collection was 8.7 years. Muscle biopsy reports, and when necessary the biopsy slides, were reviewed. The study was approved by the Sir Charles Gairdner Hospital Human Ethics Committee (Approval Number 2006-073).\nThe control group comprised 205 individuals (mean age 76.0 ± 5.2 years) from the Alzheimer's Disease Neuroimaging Initiative (ADNI) Database. The ADNI was launched in 2003 by the National Institute on Aging, the National Institute of Biomedical Imaging and Bioengineering, the Food and Drug Administration and private pharmaceutical companies. The primary goal of ADNI has been to test whether serial magnetic resonance imaging, positron emission tomography, other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of mild cognitive impairment and early Alzheimer's disease. The Principal Investigator is Michael W. Weiner, MD, VA Medical Center and University of California -San Francisco. ADNI is the result of efforts of many co-investigators from a broad range of academic institutions and private corporations, and subjects have been recruited from over 50 sites across the U.S. and Canada."}, {"section_title": "Genotyping", "text": "DNA samples were plated on 96-well plates for longrange PCR and sequencing which was performed at Polymorphic DNA Technologies (Alameda, CA, USA), as described previously by Roses et al. [14] and Linnertz et al. [19] . Based on the length of the PCR product, alleles of rs10524523 were classified using the convention established by Roses et al for determining alleles: Short (S), 619; Long (L) 20-29; Very Long (VL) P30 [14, 19] . APOE genotyping was performed as described previously [19] ."}, {"section_title": "Statistical methods", "text": "Frequencies were compared by chi-square or stratified Mantel-Haenszel tests as appropriate. Distributions of ages at onset adjusting for gender were compared via Cox proportional hazards models. Analyses were carried out using the TIBCO Spotfire S+ package ver 8.2 (TIBCO Software Inc., Palo Alto, California)."}, {"section_title": "Results", "text": ""}, {"section_title": "APOE genotypes", "text": "The majority (85/90) of s-IBM patients were carriers of APOE e3. Of these, 50 were homozygous, 26 carried e3/e4, and nine carried e2/e3. The remaining five s-IBM cases carried e2/e4 (2), e4/e4 (2) or e2/e2 (1)."}, {"section_title": "Poly-T repeat lengths in s-IBM and controls", "text": "In keeping with the findings of Roses et al. [14] , the distribution of poly-T repeat lengths among those homozygous for APOE e3 was strongly bimodal, with a gap between 17 and 25 repeats (Fig. 1 ). Analyses were confined to carriers of e3/e3 and e3/e4, within which carriage of VL was likely associated with APOE e3. Numbers of cases and controls carrying the VL repeat length according to the two APOE genotype groups are shown in Table 1 . The odds ratios within the two groups are not significantly different (p = 0.44), while the combined Mantel-Haenszel odds ratio estimate of 0.47 is significantly less than one (p = 0.019, 95% CI 0.25-0.88). Carriage of a VL poly-T repeat length within these groups is thus significantly associated with protection."}, {"section_title": "Poly-T repeat length and AAO of s-IBM", "text": "The boxplots in Fig. 2 show the ages at onset for the four subgroups of s-IBM patients defined as e3/e4 or e3/ e3 carrying or not carrying VL. Note that there are only 7 individuals in the group e3/e4 with VL and these display more variability than the remaining subgroups. Kaplan-Meier plots demonstrating the age at onset distributions for individuals carrying and not carrying a VL poly-T length are given in Fig. 3 . Whilst gender was not significant (p = 0.2), after adjusting for gender those with VL had a later age at onset overall (p = 0.038)."}, {"section_title": "Discussion", "text": "This is the first study to investigate the influence of polymorphism in the TOMM40 gene in s-IBM. Our findings show that among carriers of APOE e3 there is a significant association between carriage of rs10524523 genotypes including a very long (VL) poly-T repeat length allele and a reduced risk of s-IBM as in the case of AD [16] . Moreover, carriage of APOE-TOMM40 genotypes with a VL allele was associated with a later age at onset of symptoms. These findings therefore both point to the possibility that these genotypes have a protective effect and warrant further investigation.\nMitochondrial abnormalities are an important part of the pathological phenotype of s-IBM, and include raggedred and cytochrome oxidase (COX) deficient muscle fibres, ultrastructural abnormalities, and multiple somatic mtDNA deletions which are associated with defective synthesis of COX and other components of the respiratory enzyme chain [20] [21] [22] . Mitochondrial dysfunction and oxidative stress, which is increased in s-IBM muscle fibres [23] [24] [25] , are known to stimulate aggregation of amyloidogenic proteins [26] . Moreover, over-expression of bAPP and accumulation of amyloid-b are early changes in muscle fibres prior to the development of structural abnormalities [27] , and over-expression of bAPP in human myoblasts in vitro leads to the development of structural mitochondrial abnormalities and loss of COX activity [28] . Increased transport of amyloid-b into mitochondria, or arrest of bAPP in the mitochondrial import pores, as has been demonstrated in AD [29, 30] , could interfere with COX activity and lead to increased generation of reactive oxygen species (ROS) [31] . Genetic variants of TOM40 could be associated with altered mitochondrial pore function and transport of bAPP/amyloid-b and other proteins into mitochondria. This could in turn lead to changes in energy metabolism and increased generation of ROS, which could contribute to impaired mitochondrial integrity and muscle fibre degeneration.\nThe rs10524523 locus may influence susceptibility to AD and s-IBM by modulating expression levels of TOMM 40 or APOE. Expression studies of TOMM 40 alleles with different poly-T repeat lengths in brain have produced varying findings. The study by Cruchaga et al. [16] on a small number of AD brain samples failed to show any differences in TOM40 cDNA levels with different rs10524523 alleles. However, in a more detailed analysis of a larger number of samples, Linnertz and colleagues have shown that the VL allele is associated with higher expression levels of TOMM40 and APOE mRNA, both in normal and AD brain specimens (unpublished). Similar studies have yet to be performed on muscle samples from s-IBM and normal subjects and will be important in determining if expression levels in muscle are also altered by carriage of VL allele bearing genotypes.\nThe present findings support our previous suggestion that multiple genes, both immune and non-immune, may contribute to susceptibility to s-IBM [3] . However, the findings need to be confirmed in other s-IBM patient cohorts and should also be investigated in patients of other genetic and racial backgrounds. In particular, the association with age at onset requires further confirmation, in view of the potential limitation of self-reported data on the age of symptom onset in s-IBM. Identification of new genes and polymorphisms that "}]