[{"section_title": "", "text": "Until the 1960s, there was almost no collective bargaining in American public education, and teachers unions were small and weak. But when the states began passing labor statutes for public sector workers-beginning with Wisconsin in 1959 and continuing into the 1970s-the organization of teachers spread rapidly, and by the early 1980s virtually all school districts of any size (outside the South) were unionized and subject to collective bargaining. The result was a new equilibrium in which union power and collective bargaining were fully institutionalized. For the past quarter century, this equilibrium has been a fundamental feature of American education (Farber, 2006; Moe, 2011) .\nWrit small, collective bargaining is simply an effort to ensure that teachers are treated fairly when it comes to wages, benefits, and working conditions (Casey, 2006; Kaboolian, 2005) . But the impacts stand to be much broader. Labor contracts for school districts are filled with formal rules that govern matters of operational importance to the education process: from the assignment and transfer of teachers to the number of minutes of teacher preparation time to the length of faculty meetings to the handling of parent complaints to the evaluation of teacher performance. Whatever collective bargaining might do to promote fairness, then, it also plays a key role in shaping and prescribing the way America's schools are organized to do their work. A labor contract is fundamentally about organization (Hess & West, 2006; Moe, 2011) .\nIf there is a single, overriding theme arising from the \"new institutionalism\" of modern social science-which is now exceedingly welldeveloped and no longer new-it is simply that organization matters (Peters, 2011; Shepsle, 2010) . This is a point that few scholars would dispute. However, what it means in this case is that collective bargaining, by specifying fundamental features of organization, can be expected to have consequences for the way schools operate and perform-and thus, presumably, for how well they are able to educate children.\nNonetheless, collective bargaining has rarely been studied by education researchers. Quantitative studies are almost entirely confined to a small literature-uneven in quality, diverse in method, mixed in findings, and largely dated-that focuses solely on the impact of collective bargaining on student achievement and essentially black-boxes issues of school organization. 1 The aim of most of these studies is to determine whether student achievement is influenced by the existence of collective bargaining or by the strength of the teachers unions (as measured by their density of membership) in the relevant states or districts. Questions of organization, which ask how collective bargaining and its formal rules actually affect important kinds of behavior within schools and districtsand thus, if answered, would help explain why collective bargaining might influence student achievement-have largely gone unaddressed. 2 Our aim in this paper is to put the spotlight on collective bargaining and the organization of schools and to explore their consequences for behavior. Specifically, we focus here on the seniority rules that, in many collective bargaining contracts, give teachers the right to transfer to schools they find desirable-or to resist transfers to schools they find undesirabledepending on how much seniority they have in the district. The question is: What are the consequences of these rules for the way teachers get distributed across schools, and what are the larger implications for the education of children?\nOf all the work rules that find their way into district labor contracts, seniority-based transfer rights are surely among the most important targets of scholarly investigation. Two reasons stand out. The first is that when such rules exist, they go right to the heart of school organization. Teachers are the education system's single most important resource, and if the schools are to be effectively organized it is imperative that teachers be allocated to their most productive uses (Hanushek & Rivkin, 2006; Sanders & Rivers, 1996) . But when jobs are allocated based on seniority, district leaders do not have the authority to do this, and there is no reason to think it will somehow happen automatically. The \"good\" jobs (in teachers' eyes) should tend to go to senior teachers. The \"bad\" jobs (in teachers' eyes) should tend to go to junior teachers. These are major behavioral consequences.\nThe second reason for the importance of seniority-based transfer rules is that they may place additional burdens on schools that have high percentages of minority and low-income children. By any account, these are the schools in greatest need of improvement, and thus in greatest need of high quality teachers. Yet research has shown that they tend to be staffed with disproportionate numbers of inexperienced teachers and that, on average, these teachers are lower in quality than their more experienced colleagues (Clotfelter, Ladd, & Vigdor, 2005 Lankford, Loeb, & Wyckoff, 2002; Peske & Haycock, 2006; Rivkin, Hanushek, & Kain, 2005) . Research has also shown that, when changing schools, teachers are especially likely to move from disadvantaged schools-particularly those whose student populations are lowachieving or high-minority-into those that are more advantaged (Hanushek, Kain, & Rivkin, 2004; Scafidi, Sjoquist, & Stinebrickner, 2007) . 3 When such seniority-based transfer rules are in place, and assuming they are followed, they give senior teachers a greater ability to avoid disadvantaged schools-leaving those jobs for inexperienced teachers to fill. More generally, these formal rules make it difficult for principals and district administrators to ensure that teachers of the highest possible quality, whatever their level of experience might be, are placed in these neediest of schools.\nfor thinking that the answer to both questions should be yes.\nEvidence of a qualitative nature seems to point in the same direction. Education reformers Michelle Rhee and Joel Klein attempted to eliminate seniority-based transfer rights in their districts-Washington, D.C., and New York City, respectively-because, in their in-thetrenches judgment, these rules created serious problems for the effective organization of their schools (Moe, 2011) . And they are not alone. Many other superintendents see it the same way (e.g., Levin, Mulhern, & Schunck, 2005; Nolan, 2011) . Recent case studies by independent policy organizations, moreover, suggest that these district leaders are right to be troubled. In a widely cited report by the New Teacher Project, for example, based on a staffing study of five city school districts, findings revealed that \"these rules undermine the ability of urban schools to hire and keep the best possible teachers for the job.\"\n5 Said one of the superintendents in their study, \"We will never get the stability and significant improvements in our schools without changing these [transfer] rules.\" 6 Quantitative studies that take rigorous account of the large numbers of districts, however, are clearly necessary for gaining a more confident and systematic assessment of this situation. And there is in fact a small research literature that is attempting to do that. 7 Its focus is specifically on the impact of senioritybased transfer rules on the distribution of inexperienced teachers across schools. This is only one component of the broader issue, which has to do with how these rules constrain the ability of administrators to choose teachers of the highest possible quality for their schools. But it is obviously a key component, directly related to the content of the rules (which treat teachers differently based on their experience) and to teacher quality. And it is thus a reasonable place to start in building a research literature on the topic.\nThe first such study was carried out by Moe (2005) , who developed an analytic framework for exploring the behavioral effects of senioritybased transfer rights, coded the labor contracts of a large sample of California school districts, and conducted empirical tests. He found that these rights do indeed affect the way teachers get distributed across schools, and do indeed burden disadvantaged schools with disproportionate numbers of inexperienced teachers. 8 A second study, carried out by Koski and Horng (2007) , took Moe's study as a baseline and model-using the same analytic framework but collecting data from a newer and larger sample of California districts, adopting a different coding scheme, and carrying out the tests using a different method: hierarchical linear modeling rather than Moe's fixed-effects econometric approach. Their analysis led them to conclude, in direct contrast to Moe, that seniority-based transfer rights have no effect on the distribution of teachers across schools and do not burden disadvantaged schools with inexperienced teachers.\nThe explanation, they argue-based on interviews with 19 district administrators-is that formal rules written into contracts are often not followed in practice: District and union officials are flexible, and they work around seniority rules that threaten to have unwanted consequences for children and quality education, so the consequences expected by Moe do not actually occur. Koski and Horng are not arguing, we should note, that organization does not matter. They are arguing, in effect, that the real organization of schools departs from the written rules contained in district contracts.\nThis argument is best understood as a theoretical one-and as such, it is interesting and plausible. But it also invites simple counters. Why would unions fight so hard to get these rules written into contracts, and why would reformers such as Rhee and Klein fight so hard to eliminate them, if the rules have no consequences for the organization of schools? And why do case studies by the New Teacher Project and other organizations indicate that the consequences are quite real and serious problems?\nTogether, the Moe and Koski-Horng studies provide a useful foundation for exploring the impact of seniority rules, as well as collective bargaining contracts more generally, on the nation's public schools. Our purpose in this paper is to bring clarity and consistency to this new literature-and to move it ahead. Specifically, we offer progress along two lines. First, using the original data sets from Moe (2005) and Koski and Horng (2007) , we showwith hierarchical linear modeling and the fixedeffects econometric approach-that the two data sets actually lead to the same basic finding: that seniority-based transfer rules do have consequences for the distribution of teachers and the plight of disadvantaged schools. Second, we go on to develop a more refined analysis that shows, among other things, that these impacts are present (and problematic) only in the larger school districts-not in the smaller ones."}, {"section_title": "9", "text": "These results point to a coherent theoretical perspective that makes good sense. They suggest that seniority rules do have behavioral consequences, as Moe has argued, but that these consequences tend to be realized in those large, bureaucratic contexts where impersonal rulefollowing is likely to be the norm. Rules have consequences when they are followed, and this tends to happen in large districts. In smaller, more personal settings, on the other hand, decision making is less likely to be bureaucratic and formal, and the rule-bending that Koski and Horng envision can more often occur when needed. Rules do not have consequences when they aren't followed-notably, in those instances when local decision makers go around them to avoid negative outcomes-and this is more likely to happen in small districts. This does not mean that the rules don't matter in those districts. It just means that, in those cases when following the rules to the letter would lead to undesirable results, decision makers have more flexibility to make reasonable adjustments."}, {"section_title": "10", "text": ""}, {"section_title": "A Framework for Analysis", "text": "We begin our analysis with a simple departure from these studies that strikes us as a necessary midcourse correction. Both these studies attempt to estimate the impact of senioritybased transfer rules on the distribution of teachers across schools, with attention to two teacher characteristics-experience and credentialsthat are analyzed separately.\nOur departure is to put the focus squarely on teacher experience. Seniority-based transfer rules are specifically designed to give teachers priority based on their years of experience, not their credentials. To the extent that these rules have a behavioral impact, it should be reflected most directly in the ways that experienced and inexperienced teachers get distributed across schools, and this is the aspect of schooling that the analysis ought to be explaining. We should add, moreover, that experience is the more important variable in drawing conclusions about teacher quality. Research has shown that teachers in their first few years on the job are less effective in the classroom (on average) than those with more experience, and it has also shown that formal certification has little or nothing to do with teacher effectiveness (Goldhaber, 2011; Hanushek & Rivkin, 2006; Kane, Rockoff, & Staiger, 2008; Rivkin et al., 2005) .\nOur empirical analysis, then, is centered on how a district's transfer rules affect the distribution of experienced teachers across its schools, with special attention to the implications for schools at different levels of social advantage. The main question is, Do seniority-based transfer rights cause disadvantaged schools to operate with greater numbers of inexperienced teachers than they otherwise would?\nThe \"otherwise would\" part is important. There are various factors that affect how inexperienced and more senior teachers get distributed across schools. Even in the absence of senioritybased transfer rights, teachers inevitably have opportunities for choosing their jobs and acting on their job preferences-and in such a choice process, senior members tend to have certain advantages anyway. In the normal course of events, senior teachers know the system better than their inexperienced colleagues do, have better contacts, and are better-situated for getting, hanging onto, and switching into the jobs they find desirable. School principals, moreover, are aware that inexperienced teachers are often lower in quality (and require training, mentoring, and the like), and they are likely to prefer senior teachers if they can get them.\nHow these forces operate, and how strongly district leaders might act to modify or override them with assignment decisions that impose higher-level criteria and goals, are empirical matters, and they doubtless vary from district to district. But at the school level, there are several factors that plausibly need to be taken into account in any effort to understand howin the absence of seniority-based transfer rules-experienced and inexperienced teachers might tend to get distributed across schools, and how the built-in advantages of seniority might tend to play out. These are factors that Moe identifies in his study, and that Koski and Horng take as a model for theirs as well.\nThe first of these factors is the school characteristic that orients this body of research: the level of disadvantage. As we have noted, studies have demonstrated that schools with disadvantaged student populations tend to be less attractive to teachers, presumably because these schools are often difficult work contexts and many teachers want to avoid the academic and behavioral problems that go along with them."}, {"section_title": "11", "text": "This being so, disadvantaged schools are likely to be staffed by more than their share of inexperienced teachers.\nMoe's framework identifies three other variables that plausibly influence the distribution of experienced and inexperienced teachers as well. Given the substantive focus on a school's level of disadvantage, these additional variables are best considered as statistical controls that, while important for purposes of estimation, are otherwise of only peripheral interest to the analysis:\n1. School Growth. The more a school's enrollment grows from year to year, the more likely the school will have to scramble to meet its teaching needs by adding slots and finding teachers to fill them-and the more likely it may be forced to rely on inexperienced teachers. 2. School Size. Some teachers may value small schools for their collegiality and sense of community; others may value large schools because they offer more diverse opportunities, both professional and social. In the aggregate, then, it is unclear whether small or large schools are more desirable, and thus, which type is less likely to be burdened with inexperienced teachers; but the size of the school is surely relevant, nonetheless, to teacher choice and needs to be taken into account. We should note, in addition, that small schools may also be more sensitive to the marginal effects of adding inexperienced teachers-and the principals of such schools may go to greater lengths to avoid them. 3. Class Size. Teachers prefer smaller classes, so a school with larger classes will tend to be regarded as less desirable, and thus may be more highly staffed by inexperienced teachers. A countervailing influence, however, is that schools with larger classes have fewer slots to fill and so may find it easier to meet their staffing needs without resorting to hiring the inexperienced. We cannot know which influence is likely to prevail, but it seems clear that class size should have an influence on the distribution of teachers and needs to be taken into account.\nHow, then, do seniority-based transfer rules come into play? This brings us to the second level of Moe's framework-which, like the first, also frames the analysis of Koski and Horng. Unlike the variables we have just discussed, which are school-level factors that vary from school to school within any given district, transfer rights are district-level variables: They are part of the district's collective bargaining contract and are the same for all schools within the district. Because this is so, transfer rights cannot have the kind of direct influence that the schoollevel factors are assumed to have in explaining why teachers take jobs at one school rather than another within a district. These rights are constants for each district, identical from school to school. Even so, they can still have important influences-because their presence within a district can alter the way the school-level factors operate, and thus change their effects on the distribution of teachers.\nConsider, most importantly, a school's level of disadvantage. This school-level variable takes on different values from school to school-some schools are more disadvantaged than othersand as a school's level of disadvantage increases, we expect it to have a negative effect on that school's percentage of experienced teachers. We also expect, however, that the magnitude of this effect is going to be greater-that is, more negative-if the district has seniority-based transfer rights than if it does not. The reason is that when these formal rules are in place, senior teachers have more control over job choices and are better able to avoid disadvantaged schools than when they are not in place. Transfer rights thus interact with a school's level of disadvantage to enhance the forces that already burden these schools with disproportionate numbers of inexperienced teachers.\nIt is plausible to argue that transfer rights may interact with class size and school size in much the same way. These factors, like a school's level of disadvantage, are matters of teacher preference, and their impacts may thus be magnified when experienced teachers are empowered by the formal rules in labor contracts. Indeed, it is even possible that transfer rights could interact with the school growth variable as well. This is not because it is a reflection of teacher preferences but rather because transfer rights may impose rigidities on the staffing process, which make it more difficult for schools to respond to growth by hiring qualified staff. The result may be a heavier reliance on teachers who are inexperienced.\nTo summarize, the analytic framework explores the impact of seniority-based transfer rules by positing influences that operate at two levels: the school level and the district level. At the school level, the model sets out four basic factors that vary across schools-their social disadvantage, their growth, their class size, and their total enrollment-and these factors are each expected to have impacts on the way experienced and inexperienced teachers are distributed across schools. The model recognizes, however, that these impacts may not be the same from district to district. This is because, at the district level, transfer rights are expected to play a role in changing the way these schoollevel variables operate, and thus in changing their impacts on the distribution of teachers from what it would otherwise have been.\nWithin this two-level model, there are many questions that could be asked and explored, but one question stands at the center of attention. When districts have seniority-based transfer rights, do they worsen the plight of disadvantaged schools by burdening them with still higher levels of inexperienced teachers?"}, {"section_title": "Revisiting Existing Studies", "text": "We begin by revisiting the Moe and KoskiHorng studies to determine how they came to such different conclusions. Fortunately, the basic analytical framework is the same in both the papers, and so are the measures (and data sources) of most of the key variables.\n12 School growth is measured as the percentage change in school enrollment over the past year. School size is the natural log of total school enrollment, and class size is measured as a school's average class size in Grades 4 through 6. Disadvantage is measured as the percentage of students in the school who are minority: African American, Hispanic, or Native American. 13 Finally, teacher experience is the percentage of school's teachers who are in or beyond their 3rd year of teaching.\n14 Although the commonalities across these two studies are substantial, there are several differences that warrant discussion. One is that they use different measures of the key independent variable: seniority-based transfer rights. Moe focused on the two basic types of transfers that can affect teacher assignments: voluntary and involuntary. Voluntary transfers occur when jobs open up, and teachers who are already employed by the district seek to transfer from their existing jobs into the newly opened jobs. Involuntary transfers occur when district leaders-in response, say, to reduced enrollments at certain schools-move teachers out of their current jobs and place them in different schools. For each type of transfer, Moe gave districts a 1 if their contracts require that seniority be the overriding factor in the decision, and a 0 if they do not.\n15 He then summed the two scores to yield a transfer index that took on values 0, 1, or 2.\nKoski and Horng cast a much wider net in coding their labor contracts. They coded voluntary transfers, as well as two variations on involuntary transfers. 16 But they also coded whether within-district applicants are given preference over out-of-district applicants, whether a district must give reasons for denying a transfer request, and whether a teacher is guaranteed her prior assignment when returning from long-term leave. With each dimension assigned a score of anywhere from 0 to 3 points, the total summed score-their primary measure of seniority-based transfer rights-potentially ranged from 1 to 14."}, {"section_title": "17", "text": "The two studies also carried out their analyses on different samples of school districts. Koski and Horng were able to get contracts for a larger number of California districts than Moe did.\nWithin each district, they also tended to include a larger number of schools-because Moe restricted his analysis to elementary schools, while they included both elementary and middle schools. Furthermore, Koski and Horng's sample included Los Angeles-which dwarfs the other districts in size and number of schools-but Moe's did not. There are several other differences in the samples as well, but the ones we have noted here are the most significant. 18 The bottom line is that Koski and Horng carried out their analysis on a sample of schools that was roughly three times larger than that of Moe's study. 19 Finally, the authors adopted different modeling strategies. Moe used ordinary least squares (OLS) regression with district fixed effects, the main version of which was the following:\nThe subscript i denotes the school and j denotes the school district. The α j are the district fixed effects, ε ij is an error term, and the β are regression coefficients. The main effect of interest is β 8 , which represents how seniority-based transfer rules shape the relationship between a school's minority composition (the measure of disadvantage) and the percentage of teachers who are experienced. If strong seniority provisions enhance the ability of senior teachers to avoid disadvantaged schools, then β 8 should be negative.\nKoski and Horng used hierarchical linear modeling (HLM). They presented the results of several models, but the key model of relevance was the following: There are several important differences between this more complicated HLM model and Moe's fixed-effects OLS model, but we leave that discussion for later. For now, we simply point out that the main quantity of interest in the Koski-Horng model is γ 41 -which is expected to be negative, and (like β 8 in Moe's model) measures the extent to which high-minority schools have even fewer experienced teachers as a result of seniority-based transfer rights.\nOur first step in the empirical analysis is to replicate Moe's main model, using OLS regression with district fixed effects and applying it to his original data set. The results are set out in Column 1 of Table 1 . They show that schools with high growth rates and lots of minority students tend to have lower percentages of experienced teachers. And more importantly, the coefficient of the interaction between percent minority and the transfer rights variable is negative and statistically significant, as expected.\nTo see what this coefficient estimate means in substantive terms, consider the following. Suppose we are comparing an advantaged school (25% minority) with a disadvantaged school (75% minority). Moe's empirical results imply that if these two schools were located in a district without seniority-based transfer rights (a score of 0 on the transfer variable), the percentage of inexperienced teachers would be five points higher in the disadvantaged school than in the advantaged one-but if those schools were located in a district with full seniority-based transfer rights (a score of 2 on that variable), the percentage of inexperienced teachers would be 12 points higher in the disad- vantaged school than in the advantaged one. Thus, disadvantaged schools are burdened with an additional 7% of inexperienced teachers in districts with seniority-based transfer rights, by comparison with advantaged schools. This extra amount, moreover, is quite large when we recognize that the average school in Moe's sample has 16% inexperienced teachers-so any factor that boosts a school's portion of inexperienced teachers by 7 percentage points is creating a very big change indeed, equal to 44% of the overall average across schools.\nWe now turn to the study by Koski and Horng. Before replicating their analysis, we need to recognize that in presenting their findings, the authors did not provide standard errors or t-scores for the estimated coefficients. Instead, they simply presented the estimated coefficients and marked some of them with asterisks to indicate that they were significantly different from zero at various levels of confidence.\nTheir key conclusion is that the impact of transfer rights on the slope of percent minority is not significantly different from zero, and therefore that transfer rights have no effect. Without information on the precision of the estimates, however, readers have little basis for evaluating this conclusion and thus for determining whether the central argument of their article is consistent with the underlying evidence.\nTo replicate Koski and Horng's analysis, we use their original data set and all their original variables, including the 14-point measure of seniority-based transfer rights. 21 As their model is a hierarchical linear model, we estimate it using the same HLM software that Koski and Horng used to produce their results. 22 The estimated coefficients and residual variances from our estimation match the results presented by Koski and Horng exactly, so we are confident that we have successfully replicated their analysis.\nIn Column 2 of Table 1 , we present the results of this replication, including the robust standard errors. 23 The coefficient on the relevant interaction term is negative, as expected, and identical to what Koski and Horng found. Because the hypothesis motivating this data analysis is that transfer rights have a negative impact, the relevant null hypothesis is that the coefficient is nonnegative, and the appropriate test of statistical significance is one-tailed. When we carry out this test, the null hypothesis can be rejected at a high level of confidence (p = .051). This is a statistically significant result and provides support for the notion that transfer rights have negative effects on disadvantaged schools by decreasing their percentages of experienced teachers.\nKoski and Horng, however, arrived at a different conclusion. It appears that they conducted two-sided hypothesis tests, 24 and, because the p-value of the two-sided test on this coefficient was just a hair over the 10% mark (p = .103), they concluded that seniority-based transfer provisions have no effect. 25 Even if a two-sided test were appropriate, such a categorical conclusion would not be warranted; for any specific threshold of significance is ultimately arbitrary, and there is but a trivial difference between a p-value of .103 and a p-value of .100, both of which represent high levels of confidence. Had readers been presented with the standard errors, as is conventional, they would have had sufficient information to arrive at their own conclusions about what the estimation actually shows.\nWe should also note that, even with the categorical decision rule used by Koski and Horng, their bottom-line conclusion would have been reversed if they had dropped just one district-out of a total of 437-from their sample. That district is Los Angeles Unified, which, as the largest district in the state by many orders of magnitude, is clearly an outlier that threatens to have a disproportionate influence on the estimation; indeed, the schools from this one district make up more than 10% of all the schools in their data set.\nWhen we drop Los Angeles from the sample and carry out the analysis on the remaining 436 districts, we get the results set out in Column 3 of Table 1 . The coefficient of the interaction between transfer rights and percent minority is slightly more negative than in the original analysis, and it is now statistically significant in a two-tailed test (p = .062). Had they omitted this one district, Koski and Horng would have concluded using a two-tailed test that transfer rights are associated with a more unequal distribution of inexperienced teachers across advantaged and disadvantaged schools. And had they used a one-tailed test, as in our table, they would have found that the relationship is significant at a still-higher level (p = .031).\nImportantly, then, the studies by KoskiHorng and Moe actually point in the same direction. Both support our hypothesis that district transfer rules have a significant effect on the way experienced teachers distribute themselves across schools, creating additional burdens for high-minority schools. They reach this common conclusion, moreover, using different samples of schools and districts, different measures of transfer rules, and different statistical models-which is a sign (although it is not definitive) that this finding may be robust."}, {"section_title": "Reassessment: The Role of Seniority-Based Transfer Rules", "text": "These studies are just the beginning, and more research is surely needed. In this section, we discuss some of the issues and problems that arise in this line of analysis and then describe our construction of a new data set that addresses these concerns. We then go on to conduct a series of empirical tests that shed additional light on the subject and add a new dimension to the way it has heretofore been understood.\nOne issue that needs to be dealt with is timing. It is reasonable to expect that the transfer rules in place during year t will tend to influence teacher (and administrator) transfer decisions during that year-and that those decisions will lead to actual job placements, and thus to changes in the distribution of teachers, during the following year. The impact of transfer rules, in other words, should be experienced with a time lag. The model should reflect as much and so should the measures of teacher experience, which should reflect school percentages for the following year.\nAt the time Koski and Horng carried out their study, however, the available years of data were limited, so they matched data from labor contracts collected in 2005-2006-which means that transfer rights are measured in that same year-to other variables from [2003] [2004] , which is before many of the contracts were first negotiated. 26 This means, among other things, that teacher experience is measured from years that are often prior to the observed transfer rules, when it should be measured from the year after."}, {"section_title": "27", "text": "To carry out our own analysis, then, we use the Koski-Horng data on transfer rules for 2005-2006, but we adjust the timing on the other variables. To allow for the lagged effect of transfers on job placement, we measure teacher experience in the following year, 2006-2007 (and 2007-2008, see below) . And to fill out the rest of the model, we draw our other independent variables from the base year of 2005-2006, rather than from 2 years prior."}, {"section_title": "28", "text": "Another concern, aside from timing, is that the teacher experience variable needs to be approached with caution. The percentage of experienced teachers for any given school can fluctuate greatly from one year to the nextespecially for small schools, where the shift of one or two teachers can translate into huge percentage changes. To reduce this inherent volatility, we take three steps. First, we average the percentages for each school from 2006-2007 and 2007-2008 . 29 Second, we limit our analysis to schools for which the estimate is based on an average of at least 10 teachers per year, which is the case for 97% of the schools in our sample."}, {"section_title": "30", "text": "And third, in our statistical estimation, we explicitly model the variances of the error terms as functions of the number of teachers in each school.\nWe must also pay careful attention, needless to say, to the key independent variable-senioritybased transfer rights-and how it is coded. Because Koski and Horng collected a much larger number of labor contracts than Moe did, and because their contracts are more recent, we rely on their coding of seniority provisions. Three of the six dimensions that Koski and Horng used to construct their measures, however, are only peripherally related to the role of seniority in teacher transfers.\n31 Accordingly, we base our own coding solely on the three dimensions that deal directly with how seniority comes into play in voluntary and involuntary transfers. 32 In addition, because two of these dimensions deal with involuntary transfers and only one deals with voluntary transfers, we multiply each district's voluntary transfer score by two to give the two types of transfers equal weight. We then sum the scores to yield a single index, which ranges from 0 to 8.\nA final data issue has to do with the types of schools included in the analysis. Like Moe, Koski and Horng excluded high schools because there are typically not enough of them per district to give teachers sufficient alternatives in the transfer process. But Koski and Horng did include middle schools and elementary schools (without differentiation), and we think this is not the best approach. 35 While we know of no literature on the subject, it is reasonable to believe that elementary school teachers tend to transfer to elementary schools, that middle school teachers tend to transfer to middle schools, and that transfers across levels are much less common. Indeed, the two types of teachers often hold different credentials (which is the case in California), and that alone would set up obstacles to cross-level transfers. The typical district, moreover, is likely to have only one or two middle schools, which is insufficient for a study of teacher transfers. In our own analysis, therefore, we restrict the sample to elementary schools.\nWe also eliminate eight school districts in the Koski-Horng sample that reported having no labor agreements, as they are not directly comparable with districts that engage in collective bargaining and are governed by contract rules. In addition, we exclude Los Angeles Unified because its sheer size makes it an outlier, and it would have a disproportionate influence on the analysis. Aside from the omissions we have listed here, we retain all the Koski-Horng schools and districts in our final sample. Adjusting for missing data on some of the control variables, the data set we use for the analysis contains 407 districts and 3,493 schools. 36 "}, {"section_title": "An HLM Model of Teacher Transfers", "text": "Even with this improved data set, the literature presents us with two different approaches to modeling the distribution of experienced teachers across schools. Both approaches are suitable for the data and research question at hand, and yet the structure and assumptions of the models are quite different. OLS regression with standard errors clustered by school district has the advantage of requiring comparably few assumptions for its estimates to be unbiased and efficient. 37 And by including school variables, district fixed effects, and interaction terms between district variables (like transfer rights) and school variables (like percent minority), it can model effects at the school and district level."}, {"section_title": "38", "text": "HLM is nonetheless a more flexible modeling strategy, especially with data of the sort we are using here-data in which schools are nested within districts and effects can occur at both levels. For example, we can imagine that each school district has not only its own intercept but also its own slope for one or more of the school-level variables. These intercepts and slopes can themselves be modeled as linear functions of district characteristics. Instead of estimating a single, school-level model, we can estimate a hierarchy of linear models: one equation at the school level, called the Level 1 model, and one or more equations at the district level, called the Level 2 model, to model the intercept and slopes from the first level. Flexibility, however, comes with a cost. For HLM estimates to be unbiased and efficient, a number of assumptions in addition to the regular OLS assumptions must hold. 39 In addition, because hierarchical models are inherently more complex, they are typically estimated using iterative procedures rather than least square estimation-and unless the models are simple, the data requirements for arriving at confident estimates can be considerable.\nEven among leading methodologists, there are differing views about which modeling approach, HLM or OLS, is preferable. 40 That being so, we conduct all our analyses in the pages below using both techniques. Because HLM has become standard practice in the education literature-owing to the fact that education data so often have a nested structure (students within schools, schools within districts)-we present only our HLM results in the main text of the article and provide the OLS results in an appendix. The key findings of the analysis, however, do not depend on which of the two techniques we use.\nLet us turn, then, to an HLM specification of the model. We have already settled on the variables to be included in the Level 1 equation: school growth, school size, class size, and percent minority (disadvantage). How, then, should we set up the Level 2 equations to model its intercept and slopes-particularly the slopes, which are our main concern? HLM makes it relatively easy to pursue more complex models, so it might seem natural to start by modeling each of the slopes of the Level 1 equation as a function of transfer rights and a random error term. We could then incorporate other district-level variables (such as district size) into the equations later on if warranted. Conceptually, this approach is simple. When we move ahead to estimation, however, it is anything but.\nHere is why. By including a random error term in each equation, and thus by assuming that each slope varies randomly as a function of unmeasured district-specific influences, we would force HLM to estimate many more new parameters (variances and covariances of all the random effects) in addition to the slope coefficients we are interested in. Moreover, we would force it to estimate all these parameters using relatively little information-an average of nine schools per district. As a consequence, the estimation would likely take thousands of iterations to converge, 41 and the results might not be trustworthy. 42 The advice of HLM experts is thus to examine the data, weigh theoretical considerations, and consider the possibility of data limitations when deciding on which slopes to model as random (Bryk & Raudenbush, 1992, pp. 115-116, 201-203) . That is what we do here. Our preliminary analysis (which we do not present) shows that the intercept as well as the slopes of school growth and percent minority vary significantly across districts.\n43 Therefore, we model the intercept as well as the slopes of percent minority and school growth as functions of transfer rights plus a random error term. And because this preliminary analysis shows that the slopes of school size and class size do not vary significantly across districts, we model the slopes of those variables as nonrandomly varying as a function of transfer rights. Thus, the model is as follows 44 : experience ij = β 0j + β 1j (growth ij ) + β 2j (school size ij ) + β 3j (class size ij ) + β 4j (minority ij ) + r ij β 0j = γ 00 + γ 01 (transfers j ) + u 0j β 1j = γ 10 + γ 11 (transfers j ) + u 1j\nBefore moving ahead to estimate this model, we need to consider a common assumption that typically underpins the estimation of hierarchical models: that the errors of the Level 1 model have equal variance. If this assumption is violated in the data, the coefficient estimates will be inefficient. In our case, there is good reason to believe that the variance of the Level 1 errors will vary inversely with the number of teachers in a school. Because the dependent variable is the percentage of teachers in a school who are experienced, this measure stands to be quite volatile in schools with small numbers of teachers. We have tried to reduce this volatility by averaging the percentages over 2 years, as explained earlier, but there is still reason to worry that our models will fit most poorly for the schools with the fewest teachers, and thus that heteroskedasticity will be a problem."}, {"section_title": "45", "text": "Rather than maintain the usual assumption of constant variance, we augment the above model by assuming that the Level 1 variance is a function of the number of teachers in the school."}, {"section_title": "46", "text": "Findings From the Basic HLM Model Column 1 of Table 2 presents the results."}, {"section_title": "47", "text": "The pattern is quite striking. Even though we are using HLM, a newer and larger data set, and an alternative measure of transfer rules (based on coding carried out by Koski and Horng) , the relationships we find here are very similar to those found in the earlier studies-at the school level and at the district level. Most importantly, seniority-based transfer rights have no significant effect on the slopes of class size, school size, or percent school growth-but they do have a significant negative relationship with the slope of percent minority. As seniority provisions in district labor contracts get stronger, disadvantaged schools tend to have fewer and fewer experienced teachers compared with more advantaged schools. language in the transfer provisions of its collective bargaining contract, the percentage of inexperienced teachers is predicted to be 3.1 points higher in the disadvantaged school than in the advantaged one. However, in a district where transfers are at their strongest, the gap between the two schools doubles. The percentage of inexperienced teachers in the disadvantaged school is predicted to be 6.3 points greater than in the advantaged one."}, {"section_title": "Controlling for Other District-Level Variables", "text": "Is it possible that something else about the districts-factors correlated with transfer rights, perhaps-actually explains the unequal distribution of experienced teachers across schools and that the association we are finding for transfer rights is spurious? As a next step in the analysis, we consider two alternative explanations for our findings.\nFirst, we test whether something as simple as district size can explain why senior teachers in some districts are better able to sort into schools with fewer disadvantaged students-or, for that matter, schools with more desirable class sizes or other characteristics that make them more appealing. Recall that our replication of Koski and Horng's empirical results showed that district size does make a difference for the slopes of some of the school-level variables. We can think of one important reason why this would be so: In larger districts, there are simply more schools, which means that teachers (and administrators) therefore have more opportunities to make transfers and exercise choice. Accordingly, the negative slope of percent minority might be more negative in larger districts. Of course, our main concern here is to determine whether, once this (presumed) effect of district size is taken into account, the effect of seniority-based transfer rights remains-or is reduced or even eliminated.\nSecond, it is possible that the education level of the district's population-so far unmeasured in this analysis-might be playing a confounding role in our findings. If, for example, the districts with weaker seniority provisions happen to have more educated citizens who are more politically active in demanding a more equitable distribution of experienced teachers across schools, the effect that we are attributing to transfer rules might actually be caused by variation in district education levels (which we will measure as the percentage of adults with a college education).\nTo take these two alternative explanations into account, we estimate the following model: \nHere, the random intercept and the random coefficient on percent minority are modeled as functions of the transfers index, the log of the number of elementary schools in the district, 49 and the percentage of adults in the district who have a college education. To simplify the specification, we drop the interactions between the transfers variable and class size, school size, and growth, because we established in Column 1 that transfer rights have no discernible impact on the slopes of those school-level variables. However, the slopes of those variables may vary with district size. For example, if teachers tend to favor schools with smaller class sizes, senior teachers might have greater opportunity to transfer to such schools in larger districts; similarly, if fast-growing schools tend to have fewer experienced teachers because they have to scramble to make new hires, this might be less the case in large districts, where there is a bigger pool of teachers to draw on. To test these possibilities, we interact district size with class size, school size, and growth. We see no persuasive reason, however, why a district's level of education would alter the distribution of teachers across schools of varying size, class size, or growth. So we do not complicate the model by introducing new interaction terms between education and these variables-although we do interact it, as noted, with percent minority.\nThe results are set out in Column 2 of Table 2 . District size does not significantly alter the effects of school growth, class size, or school size-but it does have a negative influence on the slope of percent minority: As districts get larger, the slope of percent minority on teacher experience becomes more negative. 50 Thus, as expected, expanding the choices of teachers and administrators is associated with additional burdens for disadvantaged schools. The district's education level also proves relevant: The more educated a district's citizens are, the less negative the relationship between percent minority and teacher experience-and the better (and more equitable) things are for disadvantaged schools. 51 With respect to the example we presented earlier, in which we evaluated the effect of transfer provisions for two schools with 25% and 75% minority students, what the coefficient on Education × Minority means is that a 30-point increase in the percentage of district residents with a college education can reduce by half the estimated negative effect of seniority-based transfer rights. Both these findings are of real substantive interest and help to fill in the bigger picture of how teachers get distributed across schools. But more importantly, given our purposes here, the magnitude of the interaction between transfer rules and percent minority does not change: We still find that transfer rules are negatively associated with the slope of percent minority. 52 Thus, even when we control for the size and education level of the school district, and even though both have significant estimated effects, we still find evidence that strong seniority provisions have negative consequences for disadvantaged schools."}, {"section_title": "The Effect of Seniority Rules by District Type", "text": "Up to this point, our approach to studying the effects of transfer rights has been quite general. Although we have allowed the intercepts and slopes of the school-level equation to vary across districts, the analysis makes no other distinctions among the districts-and we have thus carried out the estimation by pooling all the districts together. To put it simply, if District A and District B have the same score on the transfer rights index and schools with the same percentages of minority students, then by construction our model predicts that the effect of transfer rights on the percentage of experienced teachers in those schools will be exactly the same.\nYet, perhaps there is something more going on that this pooling approach fails to capture. Maybe the contexts of decision making are very different across districts-and because of this difference in context, strong transfer rights may be very bad for disadvantaged schools in some contexts but not in others. Maybe our general finding about the importance of transfer rights is not general at all, but depends on district \"type.\"\nThere is reason, empirical and theoretical, to pursue this line of thinking. In a recent study of collective bargaining contracts more generally, found that the restrictiveness of a district's labor contract has a markedly negative impact on academic achievement in large districts-but that it has no discernible impact within smaller districts. The likely theoretical explanation, he argued, is that decisions may well get made very differently in these two contexts. Larger districts are likely to be much more impersonal and bureaucratic in organization, and their decisions are more likely to adhere to formal rules-even if doing so entails negative consequences. As districts get smaller, their organizations are likely to be less bureaucratic: administrators, teachers, and union representatives are more likely to know each other personally, take an informal approach to decisions, and bend the rules to avoid negative consequences. By this logic, then, the formal provisions of labor contracts should have their greatest effects in the larger districts-and these effects should decline, or possibly even go away, in the smaller districts.\nInterestingly, then, district size may be of theoretical importance in the study of transfer rights for two quite separate reasons. The first, which we investigated in the prior section, is that district size matters because it determines the scope of choice available to teachers and administrators in the transfer process. And that notion was borne out by the data. But now we have a second, completely different way that district size may matter: Larger districts are likely to be more bureaucratic than smaller districts, and transfer rules should tend to have bigger effects in those settings because they are more likely to be followed and enforced there.\nWe now investigate this possibility in a final set of empirical tests. We divide our sample into two categories: large districts (those with at least 15 elementary schools) and small districts (those with fewer than 15 elementary schools). The cutoff of 15 schools is a natural break in our data, because it divides the sample into roughly equal numbers of schools and enrolled students. 53 For each subsample, we estimate a simpler version of the previous model, one in which the district size variable is removed from the slope equations for school size, class size, and growth (where its effects-see Column 2-are insignificant).\nThe results for the large districts are presented in Column 3, and the results for the small districts are presented in Column 4. The estimates support the hypothesis that the effect of transfer rights is greater in the large districts. Recall that, in our prior analysis (see Column 2) in which all districts were pooled together, the estimated coefficient on the interaction of transfer rights and percent minority was −0.008. When we look just at the large districts, the estimated coefficient increases to −0.014 and is significant at the 1% level."}, {"section_title": "54", "text": "Here is what a coefficient of this magnitude means, more concretely. In a district with no seniority language in its transfer rules, the average difference between the percentage of inexperienced teachers in a school with 25% minority students and a school with 75% minority students is two percentage points. 55 In a district where seniority is the determinative factor in voluntary and involuntary transfers, however, the percentage of inexperienced teachers is predicted to be 8 points higher in the disadvantaged school than in the advantaged school. This extra six percentage point increase is especially big considering that the average school in our sample has 10% inexperienced teachers. A boost of six percentage points, therefore, is equivalent to a 60% increase in a typical school's number of inexperienced teachers.\nSmall districts are a very different story. In column 4, the effect of transfer rights on the slope of percent minority is statistically indistinguishable from zero. In other words, in small districts, transfer rules seem to make no difference in how senior teachers distribute themselves across advantaged and disadvantaged schools. Rather, for this subset of districts, the disparity between schools is influenced only by district size (due, we are suggesting, to \"scope of choice\" effects) and the education level of the district's population. This is rather striking evidence, then, that the theoretical notion we are exploring here is essentially on the mark. Our results suggest that transfer rights-even though they are written into legally binding contracts-only have negative consequences in certain settings: those that are bureaucratic enough to ensure that the rules actually get followed even when they lead to undesirable outcomes. And this is what tends to happen in large districts. In smaller districts, where decision making is likely to be less bureaucratic and by the book, the rules may get written into contracts-but their negative consequences seem to be avoided."}, {"section_title": "An Alternative Measure of Disadvantage: Free and Reduced-Price Meals", "text": "Throughout this analysis, we have used percent minority as our measure of a school's level of disadvantage. Disadvantage can be measured in other ways, however, and it is reasonable to ask whether our findings would be roughly the same if another measure were used-notably, the percentage of children enrolled in free and reduced-price meals, which is probably the most common measure of disadvantage used in the education literature.\nBut would we expect the findings to be the same if we shifted to this alternative measure? Probably not. Disadvantage is not a simple, onedimensional concept: Race and family income are useful indicators (depending on the specific analysis), and they are highly correlated (ρ = 0.84 in our data)-but they are clearly not the same thing. They get at different aspects of disadvantage, and it is quite possible that, in evaluating the attractiveness of their job options, teachers respond to these two aspects in different ways. Studies of teacher sorting across schools and districts, moreover, indicate that this is in fact the case (Hanushek et al., 2004; Scafidi et al., 2007) . These studies find that the minority composition of schools is a powerful determinant of teacher sorting behavior, but that the schools' family-income composition-as measured by the percent of children on free and reduced-price meals-is not. 56 Interestingly, both these studies were carried out in southern states: Scafidi et al. (2007) in North Carolina, Hanushek et al. (2004) in Texas. It is possible that the salience of race in their analyses is due to the southern contextalthough, in our view, there is nothing about the South per se that would explain why teachers attach so little salience to the schools' familyincome composition. It is also possible that teachers in California are not responsive to the same aspects of disadvantage that teachers in North Carolina and Texas are-and more generally, that exactly what teachers respond to in evaluating the attractiveness of schools may vary across regions of the country. More research is clearly needed to arrive at confident conclusions."}, {"section_title": "57", "text": "For now, the best available evidence is that the minority composition of schools makes a big difference to teachers as they evaluate their options, and that the family-income composition of schools does not. If these studies are on the mark, percent minority and percent free and reduced-price meals should not be regarded as interchangeable measures of disadvantage as we explore the effect of seniority-based transfers on the distribution of teachers across schools. They are different measures that are apparently weighted differently by teachers, and we should expect an empirical analysis to reveal as much. Specifically, we should expect to find that the effect of seniority-based transfer rights is smaller when free and reduced-price meals are used as the measure of disadvantage, because it is an aspect of disadvantage that appears to be less relevant to teacher choice.\nWe test these expectations in Columns 5 and 6 of Table 2 , where we replace percent minority with percent free and reduced-price meals in our models for large and small districts. 58 In column 6, we find that changing the measure of disadvantage makes little difference to our findings for small districts: Seniority-based transfer rights have no significant effect on the relationship between percent free and reduced-price meals and percent experienced. For large districts, however, the measure of disadvantage we use does make a difference. In Column 5, the coefficient on the interaction between transfer rights and percent free and reduced-price meals is smaller in magnitude than the corresponding coefficient in Column 3 for the interaction between transfer rights and percent minority."}, {"section_title": "59", "text": "To give a sense of what this means, consider the gap in teacher experience between schools that have a two-standard-deviation difference in the percentage of students on free and reducedprice meals: Our model in Column 5 predicts a gap of 2.4 points in a district with no seniority provisions 60 and 4.5 points in a district where seniority is the determinative factor in voluntary and involuntary transfers-a difference of 2.1 percentage points. Contrast that with the analogous figures for schools that have a two-standard-deviation difference in percent minority: The model in Column 3 predicts a 1.9 percentage point gap in a district with no seniority provisions (again, statistically insignificant) and a 6.2 point gap in a district with strong seniority provisions-a 4.3 point difference. By these estimates, seniority-based transfer provisions have a stronger association with percent minority than with economic disadvantage. Given the findings in the teacher sorting literature, this is precisely what we should expect."}, {"section_title": "61", "text": ""}, {"section_title": "Endogeneity", "text": "As in any analysis, it is possible that the patterns we have observed are due in part to endogeneity problems. We think this is unlikely, but we cannot definitively rule it out.\nThe most plausible culprit, in our view, has to do with why some districts have senioritybased transfer rights and some do not. The baseline, we should note, is that the pursuit of seniority rules-as applied to salary, job assignments, layoffs, rehiring, and the like-is standard behavior for American unions generally, including teachers unions: Seniority is a longfavored, widely employed method of limiting the discretion of managers over key job decisions and giving workers more control (Bennett & Kaufman, 2007; Moe, 2011) . We should expect that teachers unions in virtually all districts will be inclined to pursue seniority rules, other things being equal. In the context of our analysis, though, the endogeneity concern is that the teachers in certain districts may have unusually strong feelings about avoiding disadvantaged schools, and, for that reason, their unions may make unusually strong demands for seniority-based transfer rights and be more likely to win such provisions in their contracts. Districts with strong transfer rights, then, could be districts whose senior teachers are especially inclined to avoid disadvantaged schools-and some of the effect we have associated with transfer rights, therefore, might possibly be due to the specific attitudes of teachers in the districts that have those rights.\nWe do not have measures of teacher attitudes. However, we can get at them indirectly, because we would expect teacher desires to avoid disadvantaged schools to be a function of district characteristics that we can measure. For example, teachers probably feel most strongly about avoiding disadvantaged schools in the districts where the most disadvantaged school is particularly disadvantaged, and similarly where the range in disadvantage across schools is high. Applying our data, however, we find that the transfer index is virtually uncorrelated with the maximum percent minority in each district (r = .04), and the same is true for the range of percent minority (r = .06). From what we can tell, strong seniority rules are not concentrated in districts where we might expect teachers to be especially concerned about avoiding disadvantaged schools. There is some evidence to suggest, then, that endogeneity might not be a troubling issue here.\nWe can only do so much with the data we have, however, and we cannot put endogeneity issues to rest entirely. 62 Our purpose here is simply to recognize their relevance and, although we think that they are not a problem in this case, to point out that more research with better data and more refined methods is needed to address these sorts of causality issues more definitively."}, {"section_title": "Conclusion", "text": "Collective bargaining is a fundamental feature of American public education. Outside the southern and border states, virtually all districts of any size are governed by labor contracts with their local unions, and these contracts contain countless formal provisions-almost all of them dealing with teachers, the system's single most important resource-that profoundly shape the organization of the public schools, and through it their behavior and performance. Anyone who seeks to understand why America's schools are organized as they are, as well as why they operate and perform as they do, needs to pay serious attention to collective bargaining.\nYet education researchers have rarely done that. There is a small quantitative literature on the impact of collective bargaining on student achievement. But researchers have almost never carried out quantitative studies of the contents of labor contracts, their implications for organization, and their broader behavioral consequences.\nThis paper is a move in that direction. Our focus here is on key contractual provisionsseniority-based transfer rights-that stand to affect the way experienced teachers get distributed across advantaged and disadvantaged schools. It happens that there are two existing large-N studies of seniority-based transfer rights: one by Moe (2005) , the other by Koski and Horng (2007) . This is a rarity and a big plus, as they establish a starting point for further research. However, they arrive at different conclusions, and thus, as they stand, give rise to more confusion than progress.\nOne aim of our own study is to clarify the models and methods of these projects, reconstruct their analyses, and assess their findings. In doing that, we demonstrate that they bothdespite the use of very different measures, data sets, and statistical approaches-actually lead to the same basic conclusion: that seniority-based transfer rights are associated with a more unequal distribution of experienced teachers across advantaged and disadvantaged schools. What seems confusing, initially, is in fact coherent and consistent.\nWe then move beyond these early studies by discussing some of the measurement and modeling issues involved, adopting a different measure of transfer rights, constructing our own data set and statistical models, and carrying out a more refined analysis. We find that, even though we have made many adjustments in data, measurement, and approach, the basic finding about the relationship between transfer rights and disadvantage holds up. We also find that it continues to hold up in the face of competing explanations: the number of schools in the district (which gives senior teachers more choices) and the average education level (which appears to generate demands for a more equitable distribution of experienced teachers across schools).\nWe go on to explore whether this is a generic result that holds across all districts, or whether transfer rights may in fact operate quite differently in districts of different types. Specifically, we recognize that large districts are likely to be much more bureaucratic and formal in their decision making than small districts are, and thus that there is good theoretical reason to believe that the formal transfer rules in labor contracts are more likely to be followed and enforced-and to have negative consequences for disadvantaged schools-in large districts than in small ones. Our analysis shows that this is precisely what happens. The negative relationship between transfer rights and percent minority is quite substantial in large districtsand much greater in magnitude than our generic estimates would suggest. But the relationship is virtually nonexistent in small districts. This is a major qualification. For one, it tells us that collective bargaining may have very different consequences-for organization, for behavior, for performance-depending on the size of the district. If so, this is an important step in gaining a more variegated understanding of how collective bargaining affects the public schools, and it points the way toward new lines of theory and research that stand to be quite productive. For another, it tells us that, to the extent that collective bargaining has negative consequences, those consequences may well be concentrated on precisely those districts and schools-large districts, highminority schools-that over the years have been the worst performers and the most difficult to improve. If this is true, as our analysis suggests, it is surely an essential part of any effort to understand the nation's schools and their problems of organization and performance-and it suggests that collective bargaining needs to be taken seriously as a target of reform.\nOur focus here has been on seniority-based transfer rights and, specifically, on their consequences for the distribution of (in)experienced teachers across schools. While we believe that we have made some progress, more research is clearly needed on the characteristics of students and schools that shape the job choices of teachers and on how these preferences may vary across types of teachers or regions of the country. Researchers must also turn their attention to the broader effects of these seniority rulesnotably, the constraints they impose on the ability of principals and administrators to hire teachers of the highest possible quality for their schools, particularly schools that are disadvantaged and in greatest need.\nSeniority transfer rules, moreover, are just one example of the many types of provisions that get embedded in district labor contracts. These contracts often contain hundreds of pages of organizational rules, prescribing everything from how teachers must be evaluated to what duties they can (and cannot) be assigned to how many faculty meetings can be held-and each one of them (if followed) may shape the organization of schooling in ways that are consequential for effective performance. The task for researchers is to recognize the far-reaching relevance of collective bargaining for the organization and performance of schools-and to make it a topic of serious, systematic study.\nOf course, collective bargaining in the public sector is not limited to school districts and teachers, and the consequences surely are not either. A large portion of American cities, counties, states, and special districts are also unionized and bound by collective bargaining contracts-and these contracts too (to the extent their formal provisions are followed) are likely to have profound implications for the way these governments are organized, how their employees do their work, and how effectively public services are provided. As in education, however, scholars have done little to explore the effects of collective bargaining on the organization and performance of government more generally. This needs to change. The setup is straightforward. District fixed effects (dummies whose coefficients we don't present in Table A1 ) allow each district to have its own intercept. The key variables-percent minority, growth, school size, class size, and percent free and reduced-price meals-are the same as before, and we introduce interaction terms to allow their slopes to vary with characteristics of the district: transfer rights, district size, and education.\nThe findings are set out in Table A1 . As Columns 1 and 2 show, the interaction between transfer rights and percent minority is negativemeaning that the slope of percent minority becomes still more negative in districts with strong transfer rights. In Column 1, the onesided p-value for this coefficient is 0.12-just shy of statistical significance at conventional levels-but in Column 2, we estimate a coefficient of −0.007, significant at the 10% level. In Columns 3 and 4, we divide the sample into large and small districts. We find that in large districts, seniority-based transfer provisions have a statistically significant negative relationship with the slope of percent minority-but that the same relationship is not present in small districts. Finally, in Columns 5 and 6, we test whether strong seniority provisions also affect the distribution of experienced teachers across schools with large and small percentages of students enrolled in free and reduced-price meals. As in the HLM models, for large districts, we find that the association between seniority-based transfer rights and percent free and reduced-price meals is weaker than the association between transfer rights and percent minority: The coefficient on the interaction between transfer rights and percent free and reduced-price meals is negative, but it is smaller than in Column 3 and statistically insignificant. As in Table 2 , we find no effect for smaller districts.\nThe bottom line: when we use OLS with district fixed effects rather than HLM to generate the estimates, we find essentially the same patterns that we did in Table 2 of the paper. at Stanford University Libraries on April 25, 2014 http://eepa.aera.net Downloaded from In the Moe study, labor contracts are coded on the basis of how restrictive they are (in constraining management and extending rights to teachers); an index of restrictiveness is constructed using factor analysis; and an empirical analysis putting this index to use shows that for large districts, the restrictiveness of the contract tends to undermine the capacity of schools to realize achievement gains, while for small districts there is no effect. Strunk (2011) uses a different method, first developed in Strunk and Reardon (2010) -based on a partial independence item response model-to construct an index of contract restrictiveness; and she goes on to use this index in exploring the impact of contract restrictiveness on spending and student performance. She finds, among other things, that contract restrictiveness has a negative impact on the level of student achievement, but not on achievement gains. (Her model of achievement gains, we should point out, is very different from Moe's and omits the initial level of achievement on the right-hand side, along with changes in the relevant independent variables. In addition, she does not explore whether the impact of contract restrictiveness varies across large and small districts).\n3. As we will discuss later, these same studies find that teacher sorting across schools does not appear to be influenced by economic disadvantage, as measured by free and reduced-price lunch.\n4. Research has shown that principals can indeed recognize teachers who are especially effective in the classroom at promoting student achievement. See, e.g., Jacob and Lefgren (2008) .\n5. Levin, Mulhern, and Schunck (2005, p. 4) . For similar findings about the problems associated with seniority-based transfer rules, see various studies carried out by the National Council on Teacher Quality (NCTQ; 2009a , 2009b .\n6. Levin et al. (2005, p. 27) . 7. In addition to the two studies we discuss below, a study by Gross, DeArmond, and Goldhaber (2010) also carries out a quantitative assessment, using an interrupted time series design to explore how the distribution of teachers was affected in one particular district when it shifted away from a policy of seniority-based transfers. Because this is essentially a case study of one district rather than a large-N analysis of many districts, and because evaluating its methods, analysis, and findings would require an extensive discussion to cover all the relevant issues, we will not consider it here.\n8. We use the 2005 version of the Moe paper because it is the one that Koski and Horng used as the baseline for their own analysis. That paper was subsequently revised, but the substantive conclusions stayed the same. A 2006 revision, which uses a slightly different dependent variable, is available at the Education Working Paper Archive (EWPA), Department of Education Reform, University of Arkansas (http://www.uark.edu/ua/der/EWPA/ Research/Teacher_Quality/1786.html).\n9. The empirical analysis in this paper is based on data from California, where the teachers' unions are noted for being strong. But seniority-based transfer rules are quite common throughout the nation in districts that engage in collective bargaining, and it is reasonable to think that wherever these rules are adopted and followed (e.g., in the larger, more bureaucratic districts), they will affect the distribution of teachers across schools and impose constraints on administrators. Using the NCTQ's national data set on collective bargaining contracts for 64 of the nation's largest districts in 2010, Moe (2011) shows that 54% had seniority rules for voluntary transfers, 80% had seniority rules for teacher excessing (e.g., when schools are closed), and 84% had seniority rules for layoffs. See www.nctq.org/tr3/home.jsp for the updated contracts and seniority provisions in a now-expanded set of large districts.\n10. This argument was first developed in to explain that article's central empirical finding that contract restrictiveness has a negative impact on student performance in large districts, but no impact on performance in small districts. The empirical analysis presented here on seniority-based transfer rights thus provides additional evidence that rule-following-and the behavioral consequences of rule-following-may indeed be very different across large and small districts.\n11. In addition to the works we cited earlier, see also Loeb, Darling-Hammond, and Luczak (2005) , which explores the impact of working conditions on teacher turnover in disadvantaged schools.\n12. The measures for school size, school growth, and percent minority, below, are from the California Basic Educational Data System (CBEDS) Public School Enrollment and Staffing Data Files. The measure of class size is from the Academic Performance Index Data Files. Both are data systems of the California Department of Education. As we will discuss later in the paper, Moe and Koski-Horng use different base years for these variables.\n13. In principle, disadvantage might be measured in various ways. Children may be disadvantaged because they are minorities but also because they come from low-income families or because their academic performance is low. And these factors are highly correlated with one another: Schools with high percentages of minority students also have high percentages of students on free and reduced-price meals (the standard measure of low income) and high percentages of low-performing students. However, the research on teacher sorting finds that the key determinants of teacher movement across schools are achievement and race, and that income (free and reduced-price meals) is relatively unimportant (Hanushek, Kain, & Rivkin, 2004; Scafidi, Sjoquist, & Stinebrickner, 2007) . In the context of our own study, moreover, student achievement is problematic as an independent variable because it is endogenous: A school's low academic performance may help explain why it fails to attract experienced teachers, but a lack of experienced teachers is likely to promote low academic performance. Using percent minority as a proxy for disadvantage avoids this endogeneity problem, and at the same time provides a measure that has been shown to be relevant to teacher sorting across schools.\n14. The data are from the CBEDS data system, California Department of Education, and the measure is averaged over two years to reduce its volatility. We will discuss the volatility and timing issues more fully in the next section.\n15. Note that, in the case of involuntary transfers, this would mean that the least senior teacher would get moved out of her job.\n16. One measure of involuntary transfers had to do with the role of seniority in selecting a teacher for transfer (as in Moe's study), and a second had to do with the role of seniority in whether the receiving principal had to accept that teacher (not measured by Moe).\n17. They also carried out the analysis for a second, narrower measure of transfer rights: a 0-to-3 score that was based only on the rules for voluntary transfers. Our replication using that measure leads to results that mirror those of the 1-to-14 transfer index, so we only report results on the latter.\n18. Specifically, both studies limited their analyses to districts with four or more schools to ensure that teachers had meaningful alternatives to choose from in making transfers. In addition, Moe constrained his sample to include only those districts in which the median school had a score of at least 5% inexperienced teachers (to try to ensure within-district variance on the dependent variable) and only those districts in which the median school had more than 15% and fewer than 85% minority students (to try to ensure at least some variation within districts on the school-disadvantage variable).\n19. In addition, their samples are drawn from different years: Moe collected his collective bargaining contracts in 1999, and Koski and Horng collected theirs in 2005. Summary statistics for both data sets are presented in the appendix.\n20. While it is not clear from the Koski-Horng paper why district size is included in their model, we discuss the potential theoretical relevance of that variable below. In addition, note that the Moe paper does include controls for district size and other factors, such as bureaucracy and education, later in his paper, but they do not affect his main findings about transfer rights. Here, we stick to his basic model. 21. We thank Koski and Horng for providing the data they used for their analysis.\n22. Specifically, we use HLM 6.08, a later version of the software that Koski and Horng used for their analysis.\n23. To conserve space, we do not present the chisquared statistics for the random effects' variance components, but we have indicated whether the residual variances are statistically significant.\n24. Indeed, if we were to conduct two-sided hypothesis tests for all of their coefficients, our results would match up with Koski and Horng's markers for statistical significance.\n25. The same is true of the model in which Koski and Horng use their alternative measure of transfer rights: The effect on the percent minority and transfers interaction term is −0.024, significant at the 10% level in a one-tailed test (p = .077).\n26. Most contracts are renegotiated every 3 years or so. A good estimate, then, is that more than half of these contracts were adopted in either 2004-2005 or 2005-2006 . In addition, roughly one third were probably adopted in [2003] [2004] , which still does not allow the contract to have a lagged effect on the dependent variable. Moreover, in the Koski-Horng data set, teacher experience is actually an average over 2002-2003 and 2003-2004 , for reasons we will discuss later.\n27. Importantly, however, labor contracts change slowly over the years, and it is likely that, in almost all districts, the transfer provisions in place during earlier years were also in place in later years.\n28. Aside from the lags, our independent variables are measured in the same way as the other studies Collective Bargaining, Transfer Rights, and Disadvantaged Schools measure them, and the teacher experience and class size variables are taken from the same sources as well (see our previous discussion.) The only difference is that we have relied on the National Center for Education Statistics' Common Core of Data for our data on school size, school growth, and percent minority.\n29. The other two studies followed the same strategy but used different years. To create our dependent variable, we use the staff demographic data files from the California Department of Education. We include only fulltime teachers, and we also limit the calculations to teachers who are tenured teachers, probationary teachers, or long-term substitutes or temporary employees (i.e., we exclude \"other\" teachers). Nearly all fulltime teachers in San Juan Unified were classi- 30. Specifically, out of 3,590 elementary schools in our sample with no missing data, we drop 99 schools for which the dependent variable is based on an average of fewer than 10 teachers each year. As we suspected, the value of the dependent variable can be extreme for some of these small schools, and because the maximum value of the dependent variable is 100%, the extreme values are always on the low end of the distribution. As a result, the data below the 5th percentile of the distribution deviate from what we would expect if the data were distributed normally. (The remainder of the distribution, however, is approximately normal.) Because our HLM models below assume that the Level 1 error term has a normal distribution, we drop the subset of schools for which the dependent variable is based on a small number of teachers. This goes a long way toward making the normality assumption more suitable for our data. However, our results are not sensitive to this decision. We have conducted the analysis with all the schools, as well as schools for which the dependent variable is created from an average of at least 20 teachers each year, and the results are substantively the same.\n31. Specifically, they code the following: How are outside applicants considered relative to inside applicants? When is the district required to provide reasons for denying a transfer request? What position must a teacher be given on returning from long-term paid leave? 32. The three coding items are the following: What role does seniority play in voluntary transfer teacher assignments? What role does seniority play in selecting a teacher for involuntary transfer? What role does seniority play in receiving a teacher who is being involuntarily transferred?\n33. We should point out that the restrictiveness of seniority-based transfers might also have been measured in other ways-notably, using the Strunk and Reardon (2010) method of index construction, which relies on a partial independence item response model, or the method used by , which relies on factor analysis. Because our focus here is not on contracts generally, and thus involves only a few specific rules rather than huge numbers of them, we have tried to keep the approach as simple and easily interpretable as possible.\n34. This measure also contains one other small adjustment to the original Koski-Horng coding. For voluntary and involuntary transfers, they gave a district a 0 if there is no seniority language in the contract, a 1 if seniority is a factor but not determinative, a 2 if seniority is determinative, and a 3 if senior teachers are allowed to \"bump\" other teachers when they transfer. Yet, in each case, only a single district received a score of 3 (and one of those was Los Angeles Unified). With explicit bumping language being so uncommon, we simply recoded these 3s as 2s in constructing our new transfer variable.\n35. We also exclude charter schools, magnet schools, and other nontraditional elementary schools.\n36. We are missing data for four districts on the district education variable, which is described below. Summary statistics are available in the appendix.\n37. Specifically, the outcome has to be a linear function of the regression parameters, and none of the independent variables can be constant or perfectly collinear with the other independent variables. In addition, the independent error term must be unassociated with the model's predictors and have homoskedastic variance.\n38. Ordinary least squares (OLS) regression does not allow the district fixed effects (the separate district intercepts) to be modeled as a function of transfer rights or any other district-level variables. However, even if it could (as HLM can), such a model would simply be telling us that the strength of transfer rights has an effect on the average level of teacher experience in each district-and this tells us nothing about how experienced teachers are distributed across schools within the district. It is the latter that we want to know, and this is precisely what the impact of transfer rights on the slope coefficients of percent minority (and other school-level variables) tells us about. So being able to model the intercepts as a function of transfer rights is not particularly important in this case. Besides, in OLS, the districtwide (average) effect of the transfer rules is absorbed in the estimates of the district fixed effects, and Koski and Horng's HLM analysis showed that transfer rules actually have no effect on the average level of teacher experience in the district anyway.\n39. To take Koski and Horng's model as an example, the usual OLS assumptions apply, but in addition, the district random effects are assumed to have a multivariate normal distribution. Any district-level variables omitted from the Level 2 models must be independent of transfer rights and district size. Furthermore, the Level 1 error must be independent of all the district residual effects. See Bryk and Raudenbush (1992) .\n40. For example, Bryk and Raudenbush (1992) and Gelman and Hill (2007) advocate the use of HLM, whereas Arceneaux and Nickerson (2009) explain that OLS with clustered robust standard errors can sufficiently resolve the statistical issues that arise in analyzing nested data, and Green, Kim, and Yoon (2001) argue that fixed effects are often necessary for accounting for unobserved betweengroup heterogeneity.\n41. For example, with two random effects in the model, we would have to estimate three unique elements of the residual variance-covariance matrix, whereas with five random effects in the model, we would have to estimate fifteen. Bryk and Raudenbush (1992, pp. 201-203) also explain that the number of iterations the maximization algorithm takes can be used as a rough indicator of whether the data are sufficiently informative to estimate all of a model's parameters. When we estimate a model in which the intercept and all Level 1 coefficients are allowed to vary randomly, with no Level 2 predictors, the maximization procedure takes more than 1,300 iterations, suggesting that the Koski-Horng approach of allowing all coefficients to vary randomly is not suitable for our new data set.\n42. As Bryk and Raudenbush (1992, p. 201) write, \"if one overfits the model by specifying too many random Level-1 coefficients, the variation is partitioned into many little pieces, none of which is of much significance. The problem here is analogous to focusing a projector. If one moves beyond the proper range, the image loses focus.\"\n43. This analysis is based on a two-level model in which the intercept and each of the slope coefficients from the school-level equation are modeled as equal to a constant plus a random error term. The focus is on the chi-squared tests of whether the variances of the random effects are significantly different from zero. The answer is no for the slopes of school size and class size, but it is yes for the intercept and the slopes of percent minority and school growthmeaning that their coefficients do appear to vary significantly across districts.\n44. Here and in all subsequent models, the Level 1 predictors are group mean-differenced, and the district-level predictors are entered into the model uncentered.\n45. Indeed, our residual plots illustrate that this pattern is present: The variance of the residuals decreases noticeably with increases in the number of teachers in a school.\n46. Specifically, Var r ij ij ( ) = σ 2 , and log (s 2 ij ) = α 0 + α 1 (teachers ij ). Our results are substantively the same if we make the simpler assumption of homogenous Level 1 error variance.\n47. All hypothesis tests in Table 2 are two-tailed except for the coefficients for which we have a theoretical expectation for an effect in one direction. These include Minority (because we expect schools with high percentages of minority students to have smaller percentages of experienced teachers), interactions of district-level variables with Minority (because we expect Transfers and District size to exacerbate the negative effect of percent minority and Education to dampen the negative effect of percent minority), Growth (because we expect high rates of growth to be associated with lower percentages of experienced teachers), and Free/Reduced Meals and all associated interactions (for the same reasons as Minority).\n48. In analysis not shown, we also allowed the school size variable to enter the model nonlinearly, by adding a squared term and, separately, by replacing the school size variable with dummies for medium and large schools. While we found some evidence of nonlinearity in the effect of school size on percent experienced, these alterations to the model had no effect on our coefficient of interest-the interaction of transfer rights and percent minority. To keep the models simple, we present the results with school size modeled linearly.\n49. We use the natural log of the number of elementary schools to reduce the skew in its distribution.\n50. By itself, the number of elementary schools in a district is not associated with overall teacher experience.\n51. We also find that, on average, the percentage of experienced teachers is higher in districts with more educated adult populations.\n52. The results in Columns 1 and 2 change only slightly when we include Los Angeles Unified: The coefficient on the interaction between transfer rights and percent minority is −0.006 and statistically significant. 53. Our results in Columns 3 and 4, however, do not hinge on our choice of threshold. We have conducted this analysis using many other thresholds, and the basic patterns in the data are the same.\n54. When we include Los Angeles Unified in the large district sample, the coefficient on the interaction between transfer rights and percent minority is −0.012, significant at the 5% level.\n55. Note that this estimated difference is not statistically distinguishable from zero at conventional levels.\n56. Hanushek et al. (2004) find that the schools' academic achievement is also an important determinant of teacher choice among schools and districts. As we noted in an earlier footnote, however, we do not pursue models here that employ achievement as a measure of disadvantage because it is likely to be endogenous, given that the dependent variable is teacher experience. A school's high academic achievement may cause it to attract high percentages of experienced teachers, for example, but high percentages of experienced teachers would then tend to have a positive impact on achievement.\n57. We should also point out that both these articles on teacher sorting find that teachers who are themselves Black or Hispanic do not respond in the same way to the schools' racial composition and, indeed, appear attracted to schools that are highminority. That there may be differential effects among teachers is yet another issue that needs to be explored through further research. Only 20% of California teachers were Black or Hispanic during the time of our study, so any differential effects would seem unlikely to play much role in our findings.\n58. The data for percent enrolled in free and reduced-price meals are from the California Department of Education.\n59. There is reason to think, moreover, that because percent minority and percent free and reduced-price meals are so highly correlated, the significant negative coefficient on Transfers × Free/ reduced meals might actually be capturing some of the interactive effects of transfer rights and percent minority, which are not included in this model. We have investigated this by estimating a model that includes both percent minority and percent free and reduced-price meals, allowing the slopes of both measures to vary randomly. The results show that the interaction of transfer rights and percent minority is large, negative, and significant, while the interaction of transfer rights and free and reduced-price meals is actually positive and insignificant. As we explain above, we have concerns about including four random effects because of the demands that places on our data, but at a minimum, the results suggest that seniority-based transfer rights strengthen the negative relationship between percent experienced and percent minority-not percent free and reduced-price meals. On a separate note, when we include Los Angeles Unified in the model presented in Column 5, the coefficient on Transfers × Free/reduced meals decreases in magnitude to −0.004 and is statistically insignificant.\n60. Note, however, that this gap is not statistically distinguishable from zero at conventional levels.\n61. Moreover, when we replicate the models of Columns 1 and 2 using all districts and free and reduced-price meals rather than percent minority, the coefficients on the interaction of transfer rights and percent free and reduced-price meals are smaller and not statistically significant at conventional levels using a one-tailed test: −.003 (p = .18) for Column 1, and −0.003 (p = .11) for Column 2.\n62. As is often the case, there are various scenarios that might possibly give rise to endogeneity problems. We have discussed the one we consider most plausible. Another possibility is that districts with especially weak school boards may allow an unusual amount of teacher sorting (by experience) to take place across schools and may also accept strong seniority provisions in labor contracts-thereby making it appear that the seniority provisions are causing the sorting, when in fact, it is the weakness of the school boards. Or it may be that poorly run districts allow for more sorting but also provoke the emergence of especially strong unions, which then win strong seniority provisions in labor contracts. We do not think these possibilities are likely, but we do not have the hard data to explore them, and so for now, we can simply say that more research is needed before the causal linkages can be sorted out with real confidence."}]