[{"section_title": "Accelerating genomics-based surveillance for COVID-19 response in Africa", "text": "Timely sequencing of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) coupled with rapid data sharing has allowed researchers to develop countermeasures against the virus such as diagnostic tests and vaccines, 1 and assess transmission and evolution dynamics as the virus spreads globally. Despite the minimal resources available in the African continent, local experts have risen to the challenge and adopted genomics-based surveillance to guide the outbreak response. 2 As of June 19, 2020, a total of 568 SARS-CoV-2 genome sequences had been shared from 12 African countries and are providing insight into the ongoing epidemiology of the virus.\nEarly findings from genome sequencing have shown that SARS-CoV-2 strains circulating in Africa are assigned to 20 imported lineages, ranging from three lineages in Nigeria to ten in Kenya. 3, 4 The majority of the SARS-CoV-2 sequences are of B.1 (65%) and B.1.1 (15%) lineages, which are thought to be predominantly of European origin (appendix). The next most predominant lineage was A (5%), which originated in China. Therefore, sequencing has revealed that multiple lineages have been introduced into the continent.\nAnalyses of sequences collected in the early phase of the local epidemic in Kenya identified evidence of both imported cases and cases of community transmission, with evidence of transmission from the capital city of Nairobi to the coastal region of the country, before local restriction of movement between the two regions was implemented. 3 A study from South Africa that characterised the genomic epidemiology of SARS-CoV-2 in three large metropolitan areas (Gauteng, Pretoria, and KwaZulu-Natal) showed that; the reproductive rate was still high at the time of the study (effective reproduction number [R] was estimated to be 1·39, 95% CI 1·04-2·15), there were multiple introductions (predominantly B.1 and other B lineages from Europe), and that locally acquired nosocomial infection in Durban, South Africa during the early period of the epidemic was associated with an increase in death rates in the province. 5 Overall, these data show the utility of genomics to complement other tools in the response to, and containment of, the COVID-19 outbreak.\nCOVID-19 cases are slowly increasing in number in Africa and genetic mutations are expected to accumulate as the virus spreads. A recent study reported evidence of mutations in one of the diagnostic target sites on the coronavirus nucleocapsid (N) gene, which might have affected the accuracy of some diagnostic tests. 6 A wide variety of candidate vaccines targeting the spike protein (S) are currently being explored. D614Gmutant viruses are replacing the original Wuhan form of the virus as it is spread across the globe. This mutation has been associated with increased transmissibility of the virus. 7, 8 Analyses of sequences in Nigeria found four patients were infected with the spike D614G-mutant virus, 4 highlighting the need to monitor the evolution of the virus as it spreads in Africa.\nThe use of genomics to support the response to COVID-19 and containment of the virus in Africa is currently low. To address this suboptimal use of genomics, the Africa Centres for Disease Control and Prevention (CDC) Institute of Pathogen Genomics, in consultation with the Africa CDC led African Task Force for Coronavirus Preparedness and Response (AFTCOR) laboratory technical working group, is implementing various processes. First, resources are being mobilised to accelerate SARS-CoV-2 sequencing across the continent, leveraging available next-generation sequencing platforms within the continent, and resources and technical support is being provided to 16 countries. Second, a network of sequencing laboratories and genomics and bioinformatics experts is being brought together to share resources, expertise, and data. Third, protocols are being standardised to ensure generation of representative and reproducible data. Fourth, sample referral approaches are being coordinated, to network countries with limited sequencing capacity with regional laboratories.\nAs well as ongoing mobilisation of resources to support the COVID-19 outbreak response, it is crucial for Africa to develop sustainable approaches, with a vision to change the siloed pathogen-specific diagnostics methods and implement digital and genomic transformation in the public health system. In recognition of the revolutionary potential of genomic technology and computational power, African researchers are pioneering novel approaches and alliances to advance public health surveillance systems. SENTINEL, a new international initiative led by the African Centre of Excellence for Genomics of Infectious Diseases (ACEGID) in Nigeria and the Broad Institute, is utilising ultra-sensitive genomic technologies to develop a pandemic pre-emption system that detects viral threats in real time. Equally, the Public Health Alliance for Genomic Epidemiology (PHA4GE), a global initiative based at the South African National Bioinformatics Institute, University of the Western Cape, Cape Town, South Africa, has been working to improve access to and standardisation of public health bioinformatic tools and resources. There are also a number of other initiatives exploring the utility of genomics and bioinformatics tools for early detection and prevention of future pandemics. 9 Looking ahead, Africa CDC is working jointly with partners to develop systems that would integrate advanced pathogen genomic tools within the public health surveillance systems across the continent of Africa. This includes strengthening continental pathogen genomics capacity, establishing a multipathogen continental referral network, further training and workforce development, and bringing together a community of experts to foster sharing of experience, resources, and data. This integrated pan-African genomics surveillance platform will be supported by policies and guidelines to ensure the effective use of pathogen genomics data within public health systems. Establishing of continental pathogen genomics capacity within public health surveillance systems will enhance control of endemic infectious diseases and support the rapid response to COVID-19 and the containment of future outbreaks."}]