[{"section_title": "Abstract", "text": "Despite great focus on and public investment in STEM education, little causal evidence connects quantitative coursework to students' economic outcomes. I show that state changes in minimum high school math requirements substantially increase black students' completed math coursework and their later earnings. The marginal student's return to an additional math course is 10 percent, roughly half the return to a year of high school, and is partly explained by a shift toward more cognitively skilled occupations. Whites' coursework and earnings are unaffected. Rigorous standards for quantitative coursework can close meaningful portions of racial gaps in economic outcomes.\nFor acknowledgments and financial disclosure information, see http://www.nber.org/papers/w23063.\nJEL Classifications: I24, I28, J24, J31"}, {"section_title": "Introduction", "text": "At the 2013 White House Science Fair, President Obama said he was focused on how to \"create an all-hands-on-deck approach to science, technology, engineering, and math... and to make sure that all of us as a country are lifting up these subjects for the respect that they deserve.\" His administration's \"Educate to Innovate\" and \"Computer Science for All\" campaigns were the most recent in a long line of government initiatives focused on improving the mathematical and scientific skills of Americans. Such efforts date back to at least the 1958 National Defense Education Act, which used federal funds to spur curricular changes in the hopes of competing with the perceived superiority of the Soviet Union's scientific capabilities.\nThough STEM education has been a national imperative for at least six decades, recent efforts have been particularly focused on the need for individuals to be well-educated in math and science in order to succeed in a rapidly changing job market. A large literature has documented substantial and increasing economic returns to skill that may stem from skill-biased technological change (Katz and Murphy, 1992; Acemoglu and Autor, 2011) . Cognitive skills and mathematical skills in particular have shown high returns, although very recent evidence suggests a slowdown in demand for such skills perhaps because of the rapid substitution of computers for many routine tasks (Autor et al., 2003; Deming, 2015; Beaudry et al., 2016; Castex and Dechter, 2014; Autor and Dorn, 2013) .\nRacial gaps in mathematical skills are strikingly high. Over the last few decades, black 17 yearolds have generally scored about one standard deviation below their white counterparts on the National Assessment of Education Progress. Conditional on being employed, blacks are less likely than whites to report that their jobs require the use of high school level math on at least a weekly basis (Autor and Handel, 2013) . The labor market return to and racial gaps in cognitive skills are both sufficiently high that they together account for large proportions of racial gaps in economic outcomes (Neal and Johnson, 1996; Fryer, 2011) . We nonetheless have relatively little evidence about whether typical STEM education interventions can change students' skills and economic outcomes.\nI provide clear evidence that math coursework can impact earnings in economically mean-ingful ways. To do so, I construct an original, nationally representative time series of high school transcripts containing detailed information on students' completed coursework. I then exploit as a source of exogenous variation in math coursework the differential timing of state increases in high school graduation requirements triggered by the 1983 report \"A Nation at Risk\". A difference-indifference framework with state and high school class fixed effects shows these reforms increased the number of yearlong math courses black high school graduates completed by 0.35, consisting primarily of basic courses like pre-algebra and algebra. Black students in public schools and heavily minority schools saw the biggest increases, consistent with changed minimum requirements most affecting those with low ex ante levels of math achievement. White students' coursework was substantially less affected by these reforms.\nApplying the same difference-in-difference strategy to Census data shows that these math reforms increased the adult earnings of black high school graduates by between three and four percent. This implies the Mincerian return to an additional yearlong math course for the marginal student was about 10 percent, or half the return to a year of high school for such students. Earnings did not increase for white students, whose math coursework was largely unchanged, or for black high school dropouts, whose coursework was also likely unaffected by new graduation requirements. Reforms did not affect educational attainment, but blacks' increased earnings are partly explained by a shift toward occupations with higher cognitive skill requirements. Earnings increases are associated with increased coursework only in math and not in other subjects.\nThese results have three major implications. First, state-level minimum requirements can meaningfully change students' educational experiences, particularly for those students with low ex ante achievement. Second, coursework, particularly in math, can explain a large fraction of the return to a year of schooling. Third, closing racial gaps in math coursework can contribute substantially to the closing of racial gaps in earnings and other economic outcomes. The reforms studied here closed the majority of the black-white gap in the number of overall math courses completed and reduced by roughly one-tenth the black-white gaps in annual earnings and occupational cognitive skill. Given that these reforms largely increased coursework in basic math, interventions successful at closing racial gaps in more advanced math coursework might further reduce gaps in economic outcomes.\nThis research illuminates one channel through which returns to schooling may operate. Economists have been quantifying the association between years of schooling and earnings for at least fifty years, starting with simple multivariate regression models with few controls (Becker and Chiswick, 1966; Mincer et al., 1974) and continuing with more complex approaches that generally confirm substantial returns to schooling (Card, 2001; Heckman et al., 2006) . The use of compulsory schooling law changes as exogenous variation in educational attainment produces results largely consistent with earlier non-experimental literature (Acemoglu and Angrist, 2001; Oreopoulos, 2006) , although these results may be sensitive to empirical specification (Stephens and Yang, 2014; Devereux and Hart, 2010) . More recent research estimates large returns to college education through regression discontinuity designs around admissions thresholds (Hoekstra, 2009; Zimmerman, 2014) . Most of this work estimates returns to the total amount of time spent in school rather than the allocation of existing school time.\nThe reforms studied here provide evidence that changes in the amount of time spent in specific courses, namely math courses, can be a significant determinant of the labor market return to a year of schooling. Though identifying returns to specific courses and curricula is generally difficult because of endogenous selection, quantitative high school coursework and college majors are consistently associated with higher earnings (Altonji et al., 2012) . Recent work exploiting degree program admissions thresholds in international contexts shows that quantitative college majors have a positive impact on earnings (Hastings et al., 2013; Kirkeboen et al., 2016) . The only evidence on returns to individual college courses comes from the literature on remediation, which has little discernible impact on earnings perhaps because it diverts students from college-level courses into more basic courses (Martorell and McFarlin Jr, 2011; Scott-Clayton and Rodriguez, 2014) .\nSimilarly little evidence exists on returns to high school coursework, with early attempts to identify returns to math coursework based on identification strategies likely only partial successful at dealing with selection bias (Altonji, 1995; Levine and Zimmerman, 1995; Rose and Betts, 2004) . More recent work has exploited test-scored based eligibility thresholds to show that dou-bling instructional time in basic math courses improves both short-run achievement and mediumrun educational attainment for struggling students (Taylor, 2014; Cortes et al., 2015) . Only two other papers use quasi-experimental variation in high school coursework to identify earnings impacts, both focusing on advanced courses that affect college trajectories. 1 Jackson (2014) finds that targeted cash incentives to students and teachers in low-income urban schools increases Advanced Placement course-taking and performance, college persistence, and wages. Joensen and Nielsen (2009) use a Danish high school reform to estimate a roughly 30 percent earnings increase from an advanced math curriculum, partly due to increased college attainment. This work complements those papers by showing earnings returns to lower level math coursework even in the absence of significant increases in college attainment.\nThe structure of the paper is as follows. Section 2 describes the state reforms to high school graduation requirements. Section 3 summarizes the transcript and earnings data sets. Section 4 details the identification strategy and estimates the impact of reforms on math coursework.\nSection 5 estimates the impact of reforms on labor market outcomes. Section 6 concludes."}, {"section_title": "Reforms to Required Math Coursework", "text": "The increased graduation requirements that serve here as the exogenous source of variation in student coursework were prompted largely by the publication in April 1983 of \"A Nation at Risk,\" the final report of the National Commission on Excellence in Education (Gardner et al. 1983 ). The commission had been convened to address perceived declines in the quality of education experienced by American high school students. The first two sentences of the report read: \"Our Nation is at risk. Our once unchallenged preeminence in commerce, industry, science, and technological innovation is being overtaken by competitors throughout the world.\" The report continued by mentioning Japan, South Korea and Germany as countries making technological advances in industries where America had historically been dominant, concluding that \"Learning is the indispensable investment required for success in the 'information age' we are entering.\" 1 Sosa (2016) finds that state policies designed to increase teacher labor supply in quantitative fields increases high school math coursework and subsequent earnings. His central point estimate of a nine percent earnings rise per completed math course, though imprecisely estimated, is quite similar to this paper's estimates.\nThe commission identified as one of the primary causes of perceived educational decline the fact that \"Secondary school curricula have been homogenized, diluted, and diffused to the point that they no longer have a central purpose.\" Noting that American high school students earned 25 percent of their credits in \"physical and health education, work experience outside the school, remedial English and mathematics, and personal service and development courses,\" the commission proposed that state and local graduation requirements be strengthened dramatically. Specifically, the commission recommended that \"all students seeking a diploma be required to lay the foundations in the Five New Basics by taking the following curriculum during their 4 years of high school: (a) 4 years of English; (b) 3 years of mathematics; (c) 3 years of science; (d) 3 years of social studies; and (e) one-half year of computer science.\"\nThe vast majority of states reacted to the commission's recommendations by increasing the minimum number of courses in various subjects required for students to receive a high school diploma, though not necessarily to the levels that the commission had recommended. I collected documents on historical high school graduation requirements from the Education Commission of the States, much though not all of which information is also available through various versions of the US Department of Education's \"Digest of Education Statistics.\" I constructed for each state and for each graduating class of 1982 through 1994 the minimum number of math, science, social studies, English and other courses a student would need to complete in order to receive a high school diploma, where \"course\" refers to a full year of study.\nThough many states enacted increases in multiple types of coursework simultaneously, I focus largely on increased requirements in math, the subject most commonly addressed by these reforms, but later explore the impact of reforms to other subjects. Figure 1 shows the timing of these math reforms. Only six states enacted reforms applying to high school classes prior to 1987. The bulk of the reforms are roughly evenly split between the classes of 1987, 1988, and 1989 , with only one state enacting reforms after that period. This timing stems from state policymakers responding relatively quickly to \"A Nation at Risk\" by legislating increased graduation requirements in year Y (generally 1983, 1984, or 1985) to apply to students entering high school that year and thus graduating in year Y+4. Compared to the class of 1982, the class of 1994 faced higher minimum math requirements in 40 states, including Washington, DC. In contrast, science requirements increased in 32 states, social studies requirements in 23 states and English requirements in 18. Figure 2 shows the geography of pre-and post-reform math requirements. In 1982, the vast majority of states allowed students to graduate high school with zero or one completed math courses, while only a handful of states required a two course minimum and none required three.\nBy 1994, the vast majority of states required at least two math courses, and a number required three. Specifically, 31 of the reforming states increased their graduation requirements to two math courses, from either one (24 states) or zero (seven states). Only nine states increase their requirements to three math courses. 2 The vast majority of states that enacted reforms thus set their new minima lower than the commission's recommendation of three required math courses.\nVariation in the timing of reforms is not closely related to geography. Figure 3 maps the timing of math reforms, with darker shades representing later reforms. Nearly every region of the country contains both early-and late-reforming states and nearly every state borders another that reformed its math requirements in a different year. Variation in the timing of math reforms, coupled with the fact that such variation is not spatially concentrated, will help identify the causal impact of such reforms on coursework and labor market outcomes."}, {"section_title": "Data and Summary Statistics", "text": "No single data set exists that would allow linkage of math reform timing to information on high school coursework and labor market outcomes for students in high school around the years of these reforms. The few longitudinal studies that follow students from high school to the labor market (National Longitudinal Survey of Youth, High School and Beyond, National Education Longitudinal Study) cover too few graduating classes to be useful, while most traditional data sets used by labor economists (Census, Current Population Survey, Panel Survey of Income Dynamics) contain little or no information on high school coursework. I therefore use two separate data sets, a time series of high school transcript studies that I construct and Census data containing labor market outcomes. The transcript data allow estimation of a first stage impact of the reforms on coursework, while the Census data allow estimation of the reduced form impact of the reforms on earnings. The ratio of these two estimates can be thought of as the instrumental variables estimate of the impact of math coursework on earnings, for the marginal student whose coursework is affected by such reforms."}, {"section_title": "The Transcript Data", "text": "The primary challenge in estimating how these reforms affected students' coursework is that no data set contains detailed information on students' coursework on a class-by-class and state-bystate basis. The federal government does, however, collect a national sample of high school transcripts every few years through the National Center for Education Statistics (NCES). One of the earliest such collections occurred for the class of 1982, in the High School and Beyond Survey (HSB). Three more waves followed for the classes of 1987, 1990 and 1994 , in transcript studies associated with the National Assessment of Educational Progress (NAEP). For each of these waves, NCES collects from high schools around the country a set of student transcripts listing completed coursework, as well as each high school's handbook of course descriptions. The latter allows NCES to uniformly code courses that might have different names in different high schools, according to a scheme known as the Secondary School Taxonomy.\nI compile these four transcript collections into a single data set of students for whom I can identify both state of high school attendance and graduating class. 3 The resulting data set contains the 1982 wave as a purely pre-reform sample, the 1990 and 1994 waves as purely post-reform samples, and the 1987 wave as a mixture of states that had and had not yet enacted reforms.\nBecause the 1990 and 1994 waves include only high school graduates, I exclude dropouts from the earlier waves in order to make the samples comparable over time. My primary analysis focuses on black and white students because other subgroups, such as Hispanic and Asian students, are concentrated in a small number of states and are disproportionately born outside of the United States, making matching to Census respondents difficult for reasons I explain further below.\nFor each such student, the transcript data allow measurement of the number of courses for which the student received credit in various subject areas. 4 For simplicity, I divide math courses into two categories. \"Basic math\" includes vocational math, pre-algebra, algebra and geometry courses. \"Advanced math\" includes anything beyond geometry, such as algebra II, pre-calculus, calculus and statistics. I also compute the total number of completed courses in subjects outside of math. Apart from race and gender, relatively little information about individual students' family background is collected consistently across these four waves of transcript data. Though schools cannot be identified, I use as one proxy for family background and community characteristics the proportion of each school's transcripts collected from black or Hispanic students. I also observe whether a student's high school is public or private.\nFinally, I exclude from the analysis sample students who attended high school in the 11 states that did not enact reforms during this time period. Many of these states' constitutions specifically prohibit the state from imposing high school coursework requirements, reserving that right for local school districts. Such different legal structures make it unclear whether such states serve as a valid counterfactual for the other 40. 5 I therefore exclude them from the analysis and identify all impacts from variation in the timing of reforms, rather than differences in whether a state ever reformed its coursework requirements. The final transcript data set consists of about 9,000 black students and 41,000 white students who graduated in the high school classes of 1982, 1987, 1990 and 1994, from states that enacted math reforms at some point during this time period."}, {"section_title": "Census Data", "text": "Because the NAEP waves of the transcript data do not follow students beyond high school, I turn to the 5% Public Use Microdata Sample of the 2000 Census, a 1-in-20 national random sample of the US population. 6 . The main outcomes of interest in the Census are respondents' educational attainment, occupation and total personal earned income in the past calendar year (1999). Educa-tional attainment is reported as a categorical variable, from which I generate indicators for having completed high school, some college, a two-year college degree and a four-year college degree.\nI also generate a continuous measure of years of education by imputing 10 years to high school dropouts, 12 to high school graduates, 13 to those with some college, 14 to those with two-year degrees and 16 to those with four-year degrees.\nThe Census classifies occupations into nearly 500 categories according to the Standard Occupational Classification scheme. I merge these occupations with a measure of the cognitive and For an earnings measure, I focus on total personal earned income, which includes both wages and earnings from a respondent's business or farm. Limiting the analysis to total wages yields very similar results. I recode the few individuals with negative earnings as having zero earnings.\nI explore the impact of the math reforms on both mean earnings, which includes all respondents, and the natural logarithm of earnings, which includes only those with non-zero earnings. I also explore the impact of math reforms on the distribution of earnings.\nUnlike the transcript data, the Census data records neither respondents' high school classes nor the states in which they attended high school. I assign respondents to the high school class of the year they turned 18, the median and modal high school graduation age for Americans. I assume respondents attended high school in their states of birth, rather than their current state of residence, to avoid potential bias from endogenous migration driven by these math reforms.\nThough an imperfect measure of state of high school, state of birth is clearly exogenous to such reforms. 7 PUMS data from the 1990 Census shows that 84% of black 15 year-olds and 78% of white 15 year-olds still live in their state of birth, implying potential measurement error generated by using state of birth is likely small. This measurement error implies I may be slightly underestimating the impacts of these reforms on earnings.\nAssigning respondents their state of birth as a proxy for state of high school means that foreignborn Census respondents cannot be included in the analysis sample. This excludes a high fraction of Hispanic and Asian respondents, making it unlikely that the Census sample is comparable to the transcript sample, given that the latter includes but cannot separately identify students who are foreign-born but graduate from American high schools. I thus focus my analysis on black and white respondents for whom the two samples are comparable, showing results for Hispanic respondents, the only other subgroup of substantial size, in supplementary analyses.\nI take two other steps to make the Census sample more comparable to the transcript sample. show in later robustness checks that the longer pre-period improves the precision of the reforms' estimated earnings impacts but does not affect their magnitude. Second, I limit the Census sample to high school graduates, given that the transcript sample includes only such students. I show that math reforms do not affect high school completion rates so that this choice does not generate selection bias, and for completeness also present estimated impacts of these reforms on the earnings of high school dropouts.\nAs with the transcript sample, I exclude from the Census sample students who attended high school in states that did not enact math reforms. The final transcript data set consists of about 280,000 black adults and 1.8 million white adults who likely graduated in the high school classes of 1975 through 1994 from states that enacted math reforms at some point during this time period.\n7 All respondents in the final Census sample were born prior to the \"Nation at Risk\" report's publication."}, {"section_title": "Summary Statistics", "text": "Summary statistics for the transcript and Census samples are shown respectively in panels A and B of Table 1 During this time period, both black and white students completed an average of three math courses by the end of high school. The composition of this coursework differed greatly by race, with a higher fraction of black students' coursework coming from basic math courses. Though not shown here, black students completed an average of 1.2 very basic courses like consumer math, vocational math and pre-algebra, nearly double the 0.7 such courses completed by white students. Black students also completely substantially fewer advanced courses (0.6) than white students (0.9). Black high school graduates during this time period were completing a similar quantity of math coursework to white high school graduates but in substantially less advanced topics. Both black and white students completed about 20 additional courses in subjects outside of math.\nThe Census data shows that black respondents have much lower educational attainment than whites, even conditional on being high school graduates. Only 18 percent of black high school graduates in this sample have completed a four-year college degree, about half the rate at which whites earn such degrees. Annual earnings for black high school graduates in 1999 average $22,400, compared to $31,400 for whites. Conditional on reporting an occupation, black high school graduates work in occupations whose required cognitive skill is 0.1 standard deviation below the mean, or nearly 0.4 standard deviations less than the occupations of white high school graduates. The gap in occupational math skill is similar.\nAmong those who graduated high school in the 1980s and surrounding years, blacks lagged behind whites in both the amount of advanced math coursework completed and longer-run outcomes such as educational attainment, earnings and the cognitive and mathematical skill required by their occupations. The remainder of the paper attempts to estimate whether these gaps in math coursework and labor market outcomes are simply correlations driven by other underlying factors or whether math coursework itself can have a causal impact on labor market outcomes."}, {"section_title": "State Reforms and Math Coursework", "text": ""}, {"section_title": "Empirical Strategy", "text": "I use as a source of exogenous variation in completed math coursework the differential timing across states of the reforms induced by \"A Nation at Risk\". Though most states' reforms were one course increases, some states enacted apparently stronger reforms by moving from no statewide minima to two-and three-course minima. I exploit only the differential timing of the reforms and not their differing magnitudes for two reasons. First, the transcript data show that states with no initial requirements, such as California, had very few students graduating with no completed math coursework. This is likely due to local school districts setting minima higher than state requirements. Whether California's increase from zero to two courses is a stronger reform than Virginia's increase from one to two courses is thus unclear. Second, some states issue multiple types of high school diplomas that distinguish students by the difficulty of their completed coursework. Although I categorize states by the lowest requirements that allow graduation from high school, reforms to higher types of diplomas sometimes occurred simultaneously, clouding the issue of precisely how strong each state's reform was. The timing of the reforms is much less ambiguous.\nGiven the four available waves of transcript data, this means comparing changes in coursework between states whose increased requirements first applied to the classes of 1987 or earlier (\"early-reforming\") and states whose increased requirements first applied to the classes of 1988 through 1990 (\"late-reforming\"). Figure 4 shows the average number of completed math courses by state reform wave and graduating high school class. As shown in panel A, black high school graduates in the class of 1982 completed very similar amounts of math coursework in both earlyand late-reforming states, just under 2.6 courses. For the class of 1987, that number increased substantially in early-reforming states but much less so in late-reforming states. By the class of 1990, black high school graduates in late-reforming states had caught up to their counterparts in early-reforming states, with no further increases apparent once the reform period had ended.\nFor black students, the timing of the math reforms is closely connected to changes in completed math coursework, with increases in such coursework appearing only once a given graduating class in a given state is treated by the new requirements. Panel B shows that white students' math coursework is much less clearly connected to reform timing. White high school graduates in the class of 1982 completed somewhat different amounts of math coursework in early-and late-reforming states. Changes in those amounts do coincide with reform timing, with slopes between high school classes steeper at the expected times, but not nearly as clearly as for black students. Increases in math coursework grow in all states throughout this time period and even after the reform period is over. State reforms thus seem substantially more influential for the math coursework of black students than the math coursework of white students.\nTo more rigorously quantify the impacts of state reforms on math coursework, I run simple, baseline regression specifications of the form\nwhere M athCourses represents various measures of math coursework completed by student i in state s and high school class c and M athRef orm indicates whether that student was subject to an increased math requirement. State and class fixed effects (µ c and ν s ) are included so that the coursework impact α 1 is identified from the differential timing of within-state changes in math reform status. State fixed effects eliminate bias from the possibility that reform timing is connected to state-level factors that themselves affect math coursework. Class fixed effects eliminate bias from the possibility that reform timing is connected to nationwide shocks at a given point in time, such as national economic fluctuations or educational trends.\nRace and gender are the only two individual characteristics I consistently observe over the multiple waves of transcript data and in the Census data. I run most regressions separately by race, given both clearly documented racial gaps in educational outcomes and the lack of a better available proxy for childhood socioeconomic disadvantage. I include a gender indicator in all regressions. When pooling regressions by race, I include a full set of interactions between gender and race. Heteroskedasticity robust standard errors are clustered by state to allow for within-state serial correlation in the error term , a concern raised by the now well-known result of Bertrand et al. (2004) . Regressions are weighted by sampling weights standardized so that each class receives equal weight to account for different sample sizes across the four transcript studies. 8\nTo identify the impact of math reforms on labor market outcomes such as earnings, I apply the same empirical strategy to the Census data as I did to the transcript data, exploiting the differential timing of the reforms. I again run simple, baseline regression specifications of the form\nwhere Earnings represents the annual earnings (in 1999) or natural logarithm of those earnings for individual i who was born in state s and turned 18 in year c. All independent variables are the same as in the transcript regressions, so that β 1 identifies the reduced form impact of the reforms from within-state changes in earnings, controlling for class-specific shocks. 9 I again run most analyses separately by race, control for gender, cluster standard errors by state and use sampling weights standardized so that each class receives equal weight. 10\nBefore turning to regression estimates of the impact of math reforms on earnings, I explore their impact on educational attainment, the sign of which is theoretically ambiguous. Imposing stricter graduation requirements, such as exit exams, can make it harder for students, particularly disadvantaged ones, to complete high school (Dee and Jacob, 2007) . More rigorous high school curricula could, however, improve college enrollment and completion rates. The math reforms studied here appear to have neither of these effects. Table 4 Given that these reforms do not appear to affect high school completion rates, focusing subsequent analyses on adults with at least a high school degree should not generate selection bias. I focus on high school graduates for two reasons. First, this makes point estimates across the Census and transcript samples comparable, given that the latter consists only of high school graduates.\nSecond, most students drop out of high school within their first two years, so that increases in minimum math coursework requirements have less scope to affect their course choices. I therefore separately analyze the earnings impacts for high school dropouts, whose coursework likely 9 Even when I use the natural logarithm of earnings as an outcome, these are not typical Mincer earnings regressions because they do not control for educational attainment or for experience explicitly. Labor market experience is approximated by the class fixed effects, which are equivalent to controlling for a nationwide age profile in earnings. I omit educational attainment both because it is potentially endogenous to the reforms and because I want to run regressions that parallel as closely as possible the analysis of the transcript data.\n10 Unweighted regressions yield very similar results in all of the analyses that follow.\nis unchanged by these reforms. classes, all of whom were subject to reforms.\nFor black students, the timing of the math reforms appears closely connected to earnings.\nPanel B shows no such pattern for white students. White high school graduates in early-reforming states have slightly lower earnings than those in late-reforming states for nearly all high school classes before, during and after the reforms. Consistent with the evidence on math coursework, state reforms seem substantially more influential for the earnings of blacks than the earnings of whites."}, {"section_title": "Empirical Results", "text": "Estimates from equation 1, shown in Table 2 , confirm the visual evidence from Figure 4 . Black high school graduates subject to state reforms completed 0.35 more high school math courses than they otherwise would have, a 14 percent increase relative to the 2.54 courses the class of 1982 completed. That estimated impact is highly statistically significant, with an F-statistic of 28, suggesting the reforms provide a strong source of variation in math coursework for black students. Only 43 percent of black students in the class of 1982 completed at least three math courses. The reforms increased that proportion by nearly 15 percentage points. Given that many reforms specified a requirement of two math courses, this may indicate that state efforts triggered local school districts to increase their own requirements further, perhaps to distinguish themselves from the state minimum. The impact of reforms on white students was substantially weaker, raising the number of completed courses by a statistically insignificant 0.14 and the proportion completing at least three courses by a marginally significant seven percentage points.\nThough the reforms substantially increased the amount of math coursework completed by black students, nearly all of that increase was concentrated in basic math courses such as prealgebra, algebra and geometry. For black students, reforms increased the number of basic math courses completed by a highly statistically significant 0.28, the majority of which came from additional pre-algebra courses. The number of advanced math courses increased by a small and 8 Using these weights improves precision but has little effect on point estimates.\nstatistically insignificant 0.07. For white students, the rise in completed math coursework was similarly concentrated in basic courses, which increased by 0.11, while the number of completed advanced math courses was nearly unchanged.\nThe estimated math coursework impacts generated by the baseline specification are robust to a variety of alternative choices, as shown in Table A .2. Other educational reforms and economic conditions do not appear to explain the increases in math coursework, given the stability of estimates to inclusion of controls for the number of reforms in non-math subjects, an exit exam indicator, and the state unemployment rate in the year of high school graduation. Inclusion of state-specific linear time trends also leaves estimates largely unchanged. Excluding from the sample the five most populous states for blacks and whites only slightly diminishes the point estimates, suggesting that impacts are widespread and not driven by a small number of large states.\nIn contrast, what initially appears to be a large impact of reforms on Hispanic students' math coursework turns out to be driven by the five states where over 80 percent of such students are concentrated. Using only the remaining 35 states suggests little impact on Hispanic students' coursework but small sample size makes such point estimates very imprecise. As such, it is unclear what effect, if any, these reforms had on Hispanic students' math coursework.\nThe reforms' effects on math coursework appear at most slightly stronger for black males than females, as shown in Table A The transcript data allow me to explore two forms of heterogeneity by school type, which I do in Table 3 by interacting the reform indicator in the baseline specification with school types and controlling directly for school type. First, reform impacts are driven entirely by public schools and are statistically indistinguishable from zero in private schools, perhaps because state reforms did not legally apply to non-public schools. Second, for black students, reform impacts were larger in \"non-white\" schools, those with a higher concentration of black and Hispanic students than the median school that year. Both of these forms of heterogeneity by school type may stem from pre-existing differences across schools in levels of completed math coursework. Among black students in the class of 1982, those who attended private schools and white schools were already completing substantially more math coursework than their public school and non-white school counterparts. State reforms had the largest impact in schools with the most room for improvement.\nIn summary, state-level reforms to the minimum number of math courses required for high school graduation had large impacts on the completed coursework of black students and much smaller impacts on white students. Nearly all of the increase came from basic math courses such as pre-algebra, algebra and geometry. Effects were concentrated in public schools and indistinguishable from zero in private schools. Among black students, the reforms had stronger effects in schools with higher proportions of minority students. The large increase in basic math coursework among black students, particularly in largely minority schools, is consistent with reforms to minimum requirements having their greatest impact on students who ex ante would have been predicted to complete the least amount and quality of math coursework. I now turn to the Census data to estimate the impact of these reforms on labor market earnings.\nRegression estimates in Table 5 confirm the visual evidence. Being subject to math reforms increases earnings of black high school graduates by 3.3 percent, an impact that is both economically and statistically significant. This impact is not driven by a changing probability of having nonzero earnings, which can generate selection bias with a logarithmic specification. A specification that uses earnings as an outcome, and therefore includes those with zero earnings, shows that reforms increase black high school graduates annual earnings by a statistically significant $635.\nRelative to the class of 1982's annual earnings of $21,760, this represents a 2.9 percent increase.\nBoth specifications thus yield estimated impacts of similar magnitude.\nWhile these reforms increased black high school graduates' math coursework and subsequent earnings, groups whose coursework did not change substantially saw no earnings increase. For white high school graduates, the estimated impact of math reforms on earnings is close to zero and precise enough to rule out increases larger than 0.8 percent. Similarly, black and white high school dropouts saw no apparent increase in earnings. The only group whose earnings rose clearly in response to the math reforms was also the only group whose math coursework rose clearly in response to those reforms, making it unlikely that differential trends by race or educational attainment can explain these results.\nI explore this further in Table A .4, which shows that estimated earnings impacts generated by the baseline specification are robust to a variety of alternative specifications. As with the coursework results, controlling for other educational reforms and economic conditions leave earnings impacts largely unchanged or, if anything, slightly larger. Inclusion of state-specific linear time trends has nearly no impact on these estimates. Limiting the Census sample to the high school classes of 1982 through 1994, to more closely resemble the transcript sample, also changes little about these estimates. All specifications suggest that math reforms raised earnings of black high school graduates by between three and four percent and had little impact on whites' earnings. 12 The impact of math reforms on black high school graduates' earnings is driven by changes in the middle of the black income distribution, not the high end of the distribution. I run equation 2 using as outcomes indicators for having annual earnings above various multiples of $5,000. I report the resulting coefficients and confidence intervals in Figure 6 . There is no evidence that math reforms affect the probability of a black high school graduate being at the high end of the earnings distribution. Instead, changes are driven by increases in the probability of being in the middle of the distribution, with the largest impact a 1.5 percentage point increase in the probability of earning over $30,000. This seems consistent with reforms inducing additional basic math coursework that appears to pay off for middle-skilled workers, rather than advanced coursework that might pay off for high-skilled workers. Reforms appear not to affect the distribution of white high school graduates' earnings. Including high school dropouts in these samples reduces the estimated impacts but suggests similar shifts in the overall distribution of earnings. 13\n12 Earnings impacts on Hispanics are very imprecisely estimated zeroes. Figure A .1 also makes clear that, unlike for blacks and whites, the earnings profile of Hispanics differed greatly in the pre-period by reform timing. Hispanic adults in early-reforming states earned thousands of dollars more than their counterparts in late-reforming states. Earnings estimates are also difficult to compare to coursework estimates given the large numbers of Hispanics in the transcript sample who are likely excluded from the Census sample due to birth outside of the U.S.\n13 See Figure A. 2.\nThough math reforms did not alter educational attainment, one channel through which they raised blacks' earnings appears to be through increased cognitive skills. Absent a direct measure of such skills in either data set, I use occupational skill measures as a proxy for individual skills. Table   6 shows that black high school graduates subject to these reforms reported working in occupations requiring 0.04 standard deviations more cognitive skill. Using occupational mathematical skill yields a similar estimate. As with earnings, no changes in occupational skill are observed for white high school graduates or black or white high school dropouts. For black high school graduates in this sample, a one standard deviation increase in occupational cognitive skill is associated with increased earnings of about $6,200, conditional on state and high school class. This implies that a 0.04 standard deviation increase in such skill should translate to a roughly $250 increase in annual earnings, or over one-third of the observed effect of the reforms. Given that both occupation and occupational skill are measured with error here and that occupational skill is itself a noisy measure of individual skill, this may be a lower bound on the fraction of the earnings effect explained by occupational upgrading.\nAs with math coursework, the reforms do not appear to have had clear differential effects by gender. Table A .5 shows that, for black high school graduates, reforms had positive impacts on earnings and occupational cognitive skill for both men and women. Impacts were larger for male earnings relative to female earnings but larger for female occupational skills relative to male occupational skills. The differences in impact by gender for all outcomes and subgroups are, however, statistically insignificant.\nOne potential concern with my identification strategy is that math reforms were often accompanied by reforms to minimum coursework requirements in other subjects, making it difficult to attribute earnings increases to math coursework rather than other increased coursework. Panel A of Table A .6, which replicates the baseline specification, indeed shows that the timing of math reforms was associated with both increases in math coursework (0.35 courses) and non-math coursework (0.88 courses) for black high school graduates. In panel B, I include one additional control for the number of non-math subjects (science, social studies, English, other) for which reforms increased minimum requirements. The augmented specification shows that math reforms pre-dict only increased math coursework and that non-math reforms predict only increased non-math coursework. Most importantly, math reforms continue to predict increased earnings and occupational cognitive skill while non-math reforms have small or even negative impacts. This suggests that increased math coursework, and not coursework in other subjects, was responsible for the increased earnings of black high school graduates.\nTo estimate explicitly the extent to which these math reforms closed racial gaps in educational and labor market outcomes, I pool black and white high school graduates and run regressions interacting math reforms with race, of the form:\nThe coefficient on the black indicator, γ 3 , can be thought of as the average within-state blackwhite gap in a given outcome. The math reform indicator estimates the impact of reforms on whites, while the interaction term estimates the extent to which the reforms affected the relevant black-white gap. Table 7 shows the results of these regressions.\nComparison of the interaction term to the black indicator suggests that math reforms closed three-fourths of the 10 percentage point black-white gap in the probability of completing at least three math courses and two-thirds of the 0.22 course gap in overall math courses completed. Reforms had no apparent impact on the 0.38 course black-white gap in advanced math courses completed. The reforms also closed economically meaningful portions of labor market gaps. They reduced by nearly one-tenth the 26 percent gap in annual earnings, by nearly one-fifth the 15 percentage point gap in probability of earning at least $30,000 annually, and by more than one-tenth the 0.42 standard deviation gap in occupational cognitive skill. specification with class by survey year fixed effects. Table 8 "}, {"section_title": "State Reforms and Labor Market Outcomes", "text": ""}, {"section_title": "Conclusion", "text": "The math coursework reforms studied here induced black students to complete about 0.35 additional math courses and raised their earnings by 3.3 percent, suggesting each additional math course had a labor market return of about 10 percent. The Census data suggests the Mincerian return to an additional year of high school for black students is about 21 percent. 15 Math coursework explains roughly half of the apparent labor market return to a year of high school for such students. Increased earnings can be partly but not wholly explained by shifts toward more cognitively intensive occupations, suggesting real improvements in human capital and productivity. In this sense, the curricular reforms succeeded at least somewhat in achieving the goal of \"A Nation at Risk,\" helping black students leave high school with better labor market skills. As such, this paper provides clear evidence that curricular reform has the potential to help close the racial and socioeconomic earnings gaps that are the focus of so much research and public policy.\nThe increased graduation requirements studied here did not, however, have much impact on the majority of students. There is little evidence that higher minimum courseloads improved the productivity of most workers or their capacity to enter the math-intensive occupations that preoccupied the authors of \"A Nation at Risk.\" These increased requirements did not increase advanced math course completion or affect the probability of entering highly paid occupations in math-intensive fields like engineering. The new graduation requirements generally specified only the number of courses necessary and not the minimum set of skills students would need in order to graduate. As such, the reforms focused on the amount of time spent in class rather than the specific content learned. For relatively low-skilled groups of students, additional basic math courses may have had value, but high-skilled students would have benefited little from them and likely were already fulfilling the new minimum requirements.\nMore recent efforts have begun to focus not on the number of math courses completed by students but on the specific content to which students are exposed. High school exit exams that proliferated as a result of No Child Left Behind test such content. Subsequent state reforms to graduation requirements have increasingly identified specific courses required for students to complete.\nRecognition of racial and socioeconomic gaps in math coursework have prompted some states and districts to adopt \"Algebra for All\" policies that mandate or strongly encourage completion of algebra courses. Efforts to broaden participation in advanced math coursework has led to a more than tripling of the numbers of students taking Advanced Placement Calculus exams over the last 20 years. Future research may be able to identify whether such subsequent curricular interventions have labor market impacts that resemble the ones estimated here. No reform 1984-86 1987 1988 1989-90 Notes: The figure above shows the first high school class subject to increased math course requirements in each state. High school class 1984-87 1988-90 Reform wave (B) White students\nNotes: The figure above shows the average number of math courses high school graduates completed for credit, by high school class and reform wave. The first reform wave comprises states enacting math reforms between 1984 and 1987 and the second wave between 1988 and 1990. Panel A includes black students and panel B includes white students. Data come from the high school transcript studies described in the text, with averages computed using sampling weights standardized so that each class receives equal weight. Notes: Heteroskedasticity robust standard errors clustered by state are in parentheses (* p<.10 ** p<.05 *** p<.01). Each coefficient comes from a separate regression of a measure of math coursework on an indicator for being subject to increased math requirements, high school state and class fixed effects, and race-by-sex indicators. Regressions are weighted by sampling weights standardized so that each class receives equal weight. Outcomes in panel A are the overall number of full-year math courses completed for credit and an indicator for completing at least three math courses. In panel B, outcomes are the number of courses completed in pre-algebra, algebra or geometry, and math courses completed beyond geometry. Data come from the NCES transcript studies described in the text. The sample consists of those graduating high school in 1982, 1987, 1990 and 1994 from states enacting math reforms. Also shown is the mean value of the outcome for the class of 1982. Sample sizes are rounded to the nearest 10 students as required by NCES. Notes: Heteroskedasticity robust standard errors clustered by state are in parentheses (* p<.10 ** p<.05 *** p<.01). Each coefficient comes from a separate regression of overall math courses completed on an indicator for being subject to increased math requirements, school type indicators, interactions of math reform with school types, high school state and class fixed effects, and race-by-sex indicators. Regressions are weighted by sampling weights standardized so that each class receives equal weight. Non-white schools are those with a higher proportion of black and Hispanic students than the median school that year. Beneath each pair of coefficients is the p-value from a test of the equality of the two coefficients shown. Data come from the NCES transcript studies described in the text. The sample consists of those graduating high school in 1982, 1987, 1990 and 1994 from states enacting math reforms. Also shown is the mean value of the outcome for the class of 1982 for each school type. Sample sizes are rounded to the nearest 10 students as required by NCES. Notes: Heteroskedasticity robust standard errors clustered by state are in parentheses (* p<.10 ** p<.05 *** p<.01). Each coefficient comes from a separate regression of a measure of educational attainment on an indicator for being subject to increased math requirements, birth state and class fixed effects, and race-by-sex indicators. Regressions are weighted by sampling weights standardized so that each class receives equal weight. Outcomes in the first four rows are indicators for having obtained at least the specified level of educational attainment. The final row's outcome is years of education, generated by imputing 10 years to high school dropouts, 12 to high school graduates, 13 to those with some college, 14 to those with two-year college degrees and 16 to those with four-year college degrees. Data come from the 5-Percent Public Use Microdata Sample of the 2000 U.S. Census. The sample consists of the intended high school classes of 1975-1994 born in states enacting math reforms. Also shown is the mean value of the outcome for the intended high school class of 1982. Notes: Heteroskedasticity robust standard errors clustered by state are in parentheses (* p<.10 ** p<.05 *** p<.01). The top row of coefficients in each panel comes from a separate regression of a measure of math coursework on an indicator for being subject to increased math requirements, high school state and class fixed effects, and race-bysex indicators. The second row adds to the baseline specification the number of reforms in non-math subjects, an exit exam indicator, and the state unemployment rate in the year of high school graduation. The third row adds to the baseline specification state-specific linear time trends. The fourth row replicates the baseline specification but excludes the five most populous states for each demographic subgroup. Regressions are weighted by sampling weights standardized so that each class receives equal weight. Panel A's outcome is the overall number of math courses completed. Panel B's outcome is the number of courses completed in pre-algebra, algebra or geometry. Data come from the NCES transcript studies described in the text. The sample consists of those graduating high school in 1982, 1987, 1990 and 1994 from states enacting math reforms. Sample sizes are rounded to the nearest 10 students as required by NCES. Notes: Heteroskedasticity robust standard errors clustered by state are in parentheses (* p<.10 ** p<.05 *** p<.01). Each coefficient comes from a separate regression of a measure of math coursework on an indicator for being subject to increased math requirements, high school state and class fixed effects, and race indicators. Regressions are weighted by sampling weights standardized so that each class receives equal weight. Panel A's outcome is the overall number of math courses completed. Panel B's outcome is the number of courses completed in pre-algebra, algebra or geometry. Data come from the NCES transcript studies described in the text. The sample consists of those graduating high school in 1982, 1987, 1990 and 1994 from states enacting math reforms. Also shown is the mean value of the outcome for the class of 1982. Sample sizes are rounded to the nearest 10 students as required by NCES. Notes: Heteroskedasticity robust standard errors clustered by state are in parentheses (* p<.10 ** p<.05 *** p<.01).\nThe top row of coefficients in each panel comes from a separate regression of a measure of earnings on an indicator for being subject to increased math requirements, birth state and class fixed effects, and race-by-sex indicators. The second row adds to the baseline specification the number of reforms in non-math subjects, an exit exam indicator, and the state unemployment rate in the year of high school graduation. The third row adds to the baseline specification state-specific linear time trends. Regressions are weighted by sampling weights standardized so that each class receives equal weight. Outcomes are total personal earned income in calendar year 1999 (measured in thousands of dollars) and the natural logarithm of that income. Notes: Heteroskedasticity robust standard errors clustered by state are in parentheses (* p<.10 ** p<.05 *** p<.01). Each coefficient comes from a separate regression of a measure of earnings on an indicator for being subject to increased math requirements, birth state and class fixed effects, and race indicators. Regressions are weighted by sampling weights standardized so that each class receives equal weight. Outcomes are years of education attained, the natural logarithm of total personal earned income in calendar year 1999, and a standardized measure of the cog Notes: Heteroskedasticity robust standard errors clustered by state are in parentheses (* p<.10 ** p<.05 *** p<.01). Each coefficient in panel A comes from a separate regression of a measure of coursework or earnings on an indicator for being subject to increased math requirements, high school state and class fixed effects, and a female indicator. Panel B adds to the baseline specification the number of other academic subjects with increased requirements, including science, social studies, English and all other areas. Regressions are weighted by sampling weights standardized so that each class receives equal weight. Data in columns 1 and 2 come from the NCES transcript studies described in the text. Data in columns 3-5 come from the 5-Percent Public Use Microdata Sample of the 2000 U.S. Census. All samples include only black high school graduates."}]