[{"section_title": "", "text": "Because the information learned in mathematics and science is essential to becoming a knowledgeable and functioning individual as well as a contributing member of society, it is nearly universal across the world's countries that all school children study these subjects. An understanding of mathematics and basic scientific concepts can facilitate leading a productive personal life that includes maintaining good health habits, making informed financial decisions, and using effective problem-solving skills. At the national level, a citizenry well educated in mathematics and science is fundamental to improving medical, housing, and transportation conditions as well as to managing environmental issues and maintaining the economic health of the country. Specialized mathematics and science knowledge will be crucial in protecting our planet Earth for future generations. Now entering into its 20 th year of data collection, TIMSS is an international assessment of mathematics and science at the fourth and eighth grades. TIMSS 2015 is the most recent in the TIMSS series, which began with the first assessments in 1995 and has continued every four years-1999, 2003, 2007, and 2011. For countries with data back to 1995, TIMSS 2015 will provide the sixth in a series of trend measures collected over 20 years. Approximately 60 countries have TIMSS trend data, and new countries join TIMSS in each cycle. About 70 countries are expected to participate in TIMSS 2015. TIMSS 2015 continues the long history of international assessments in mathematics and science conducted by the International Association for the Evaluation of Educational Achievement (IEA). IEA is an independent international cooperative of national research institutions and government agencies that has been conducting studies of cross-national achievement since 1959. IEA pioneered international comparative assessments of educational achievement in the 1960s to gain a deeper understanding of the effects of policies across countries' different systems of education. As a program of the IEA, TIMSS has the benefit of drawing on the cooperative expertise provided by representatives from countries all around the world. TIMSS is directed by the TIMSS & PIRLS International Study Center at Boston College. In 2011, nationally representative samples of students in 63 countries and 14 benchmarking entities (regional jurisdictions of countries, such as states or provinces) participated in TIMSS. In total, more than 600,000 students participated in TIMSS 2011. The results for the TIMSS 2011 mathematics and science assessments were reported in two companion volumes: TIMSS 2011 International Results in Mathematics (Mullis, Martin, Foy, & Arora, 2012) and TIMSS 2011 International Results in Science (Martin, Mullis, Foy, & Stanco, 2012). These reports summarized trends in fourth and eighth grade students' achievement overall and at the TIMSS International Benchmarks. The reports also presented a rich array of information about the students' backgrounds and their attitudes toward mathematics and science, teachers' education and training, classroom characteristics and activities, and school contexts for learning and instruction in mathematics and science."}, {"section_title": "Policy Relevant Data about the Contexts for Learning Mathematics and Science", "text": "TIMSS uses the curriculum, broadly defined, as the major organizing concept in considering how educational opportunities are provided to students, and the factors that influence how students use these opportunities. The TIMSS Curriculum Model has three aspects: the intended curriculum, the implemented curriculum, and the attained curriculum (see Exhibit 1). These represent, respectively, the mathematics and science that students are expected to learn as defined in countries' curriculum policies and publications and how the educational system should be organized to facilitate this learning; what is actually taught in classrooms, the characteristics of those teaching it, and how it is taught; and, finally, what it is that students have learned and what they think about learning these subjects. Implemented Curriculum"}, {"section_title": "Attained Curriculum", "text": "Working from this model, TIMSS routinely compiles the TIMSS Encyclopedia with each assessment cycle to document education policies and the curriculum in mathematics and science in each of the participating countries. The two volumes of the TIMSS 2011 Encyclopedia  provide an important resource for helping to understand the teaching and learning of mathematics and science around the world, with particular emphasis on schooling through the eighth grade. A chapter prepared by each participant summarizes the structure of its education system, the mathematics and science curricula and instruction in primary and secondary grades, the teacher education requirements, and the types of examinations and assessments employed. To provide standard information across countries that supplements the chapters, countries complete a curriculum questionnaire about their mathematics and science curricula, school organizational approaches, and instructional practices. TIMSS also asks students, their teachers, and their school principals to complete questionnaires about their school and classroom instructional contexts for learning mathematics and science. Data from these questionnaires provide a dynamic picture of the implementation of educational policies and practices that INTRODUCTION can raise issues and provide avenues relevant to educational improvement efforts. TIMSS 2011 included nearly 20 context questionnaire scales about teaching and learning mathematics and science. Each context questionnaire scale was created using IRT methods; and to facilitate interpretation, the results were presented for three scale regions (most to least desirable, using scale score equivalents of response combinations to determine the cutpoints between the regions). Including the TIMSS 2015 Encyclopedia and questionnaire data, TIMSS 2015 will collect data on the following range of student contexts for learning mathematics and science: • National and community contexts; • Home contexts; • School contexts; and • Classroom contexts. One of the important findings from TIMSS 2011 was that an early start in school appears to be crucial in developing students' mathematics and science achievement. To examine students' early home experiences and preschool experiences in learning mathematics and science, TIMSS 2015 at the fourth grade will include a home questionnaire to be completed by students' parents and caregivers. The questionnaire will be similar to the Learning to Read Questionnaire that has been an important part of each cycle of PIRLS (Progress in International Reading Literacy Study) since its inception in 2001."}, {"section_title": "TIMSS and TIMSS Advanced in 2015", "text": "First conducted in 1995 and then again in 2008, TIMSS Advanced is the only international assessment that provides essential information about student achievement in advanced mathematics and physics. It targets students who are engaged in advanced mathematics and physics studies that prepare them to enter STEM (science, technology, engineering, and mathematics) programs in higher education. TIMSS Advanced assesses these students in their final year of secondary school, or as an option offered in 2015 for the first time, at the start of their STEM coursework in universities. With the current emphasis on college and career readiness and increasing global competitiveness in STEM fields, in 2015 TIMSS Advanced once again will be joined with TIMSS. This is the first time since 1995 that TIMSS together with TIMSS Advanced will provide countries with a complete profile of mathematics and science learning from elementary through the end of secondary school. For example, Norway (Grønmo & Onstad, 2013) examined its TIMSS Advanced 2008 data together with TIMSS 2007 data to learn how the domino effect that begins in elementary school can work up the educational ladder and impact achievement in students' final year of secondary school. Also, both TIMSS and TIMSS Advanced 2015 will provide trend data for the countries that participated in previous cycles of the assessments. More specifically, each country that participates in TIMSS Advanced 2015 gains critically valuable information on the following: • The numbers of students and the proportion of the overall student population who are participating in advanced mathematics and physics study at the end of secondary school; • The achievement of these students based on international benchmarks (advanced, high, and intermediate); and • A rich set of contextual data on curricula, teaching and learning strategies, teacher preparation, school resources, and student preparation and attitudes that can be used to guide education reform and policy planning in STEM fields. Detailed information about the TIMSS Advanced 2015 frameworks for the advanced mathematics and physics assessments is found in TIMSS Advanced 2015 Assessment Frameworks (Mullis & Martin, 2013)."}, {"section_title": "TIMSS Numeracy", "text": "TIMSS 2015 at the fourth grade has a new, less difficult mathematics assessment called TIMSS Numeracy. TIMSS Numeracy is being introduced in 2015 to assess fundamental mathematical knowledge, procedures, and problemsolving strategies that are prerequisites for success on TIMSS Mathematics-Fourth Grade. TIMSS Numeracy asks students to answer questions and work problems similar to TIMSS Mathematics-Fourth Grade, except with easier numbers and more straightforward procedures. TIMSS Numeracy is designed to assess mathematics at the end of the primary school cycle (4 th , 5 th , or 6 th grades) for countries where most children are still developing fundamental mathematics skills. Together with IEA's prePIRLS reading assessment, TIMSS Numeracy is intended to be responsive to the needs of the global education community and efforts to work towards universal learning for all children. As the debates INTRODUCTION shift from access for all to learning for all, ways to measure progress toward learning goals are needed. Because literacy and numeracy are fundamental to every child's education, prePIRLS and TIMSS Numeracy can contribute to helping countries and international organizations measure and improve learning outcomes for children and youth worldwide.\nTo provide a broad range of countries with avenues to measure numeracy learning outcomes, TIMSS Numeracy is being introduced in 2015. It is important to match the TIMSS Mathematics assessment to a country's educational development, and TIMSS Numeracy assesses the fundamental mathematical knowledge, procedures, and problem-solving strategies that are prerequisites for success on TIMSS Mathematics-Fourth Grade. TIMSS Numeracy asks students to answer questions and work problems similar to TIMSS Mathematics-Fourth Grade, except with easier numbers and more straightforward procedures. TIMSS Numeracy includes many of the same domains and topics as TIMSS Mathematics-Fourth Grade, but it is designed to assess mathematics at the end of the primary school cycle (4 th , 5 th , or 6 th grades) for countries where most children are still developing fundamental mathematics skills. Exhibit 4 shows the target percentages of testing time devoted to each of the TIMSS Numeracy content and cognitive domains. The TIMSS Numeracy content domains are described following Exhibit 4. The descriptions of the cognitive domains are the same as for the fourth and eighth grade and can be found in the last section of this chapter. 2. Add and subtract whole numbers and demonstrate knowledge of these operations in simple problem settings. 3. Multiply and divide whole numbers by one-digit numbers and demonstrate knowledge of these operations in simple problem settings. 4. Read data from tables, bar graphs, and pictographs; and use the data to solve simple problems. 5. Solve problems with whole numbers including those involving more than one operation, patterns, and simple number sentences. Fractions and Decimals 1. Recognize, compare, add, and subtract simple fractions (halves, thirds, fourths, fifths, sixths, eighths, and tenths). 2. Demonstrate knowledge of decimals including place value and ordering; and add and subtract one-place decimals."}, {"section_title": "The TIMSS 2015 Assessment Frameworks", "text": "Taken together, Chapters 1 and 2 of this publication contain frameworks for five different mathematics and science assessments. Chapter 1 contains the three frameworks for TIMSS Mathematics: • TIMSS Mathematics-Fourth Grade; • TIMSS Numeracy, a less difficult version of TIMSS Mathematics-Fourth Grade that is newly developed for TIMSS 2015; and • TIMSS Mathematics-Eighth Grade. Chapter 2 contains the two TIMSS Science Frameworks: • TIMSS Science-Fourth Grade; and • TIMSS Science-Eighth Grade. Chapters 1 and 2, respectively, describe in some detail the major content and cognitive domains in mathematics and science to be assessed at the fourth and eighth grades. For each subject at each grade, there is a description of the three to four major content domains (e.g, algebra, geometry, etc. in mathematics; and biology, chemistry, etc. in science), the topic areas within each content domain, and the specific topics within that topic area to be assessed. In the science fourth and eighth grade frameworks, each topic is elaborated further with specific objectives. Also, new for TIMSS 2015, there is a section describing the science practices to be addressed in the science assessments at fourth and eighth grades. These practices include skills from daily life and school studies that students use in a systematic way to conduct scientific inquiry, and are fundamental to all science disciplines. It is important to emphasize that the items in each TIMSS assessment cover a range of thinking skills as described within three cognitive domains: knowing, applying, and reasoning. For the most part, the items assess students' abilities to demonstrate their knowledge, apply what they have learned, solve problems, and reason through analysis and logical thinking. The knowing, applying, and reasoning cognitive domains describe the thinking students should be doing as they engage with the mathematics and science content, and are parallel for mathematics and science and across grades, but with different levels of emphasis depending on the subject and grade. Chapter 3 contains the TIMSS 2015 Contextual Framework describing the types of learning situations and factors associated with students' achievement in mathematics and science that will be investigated via the questionnaire data. Finally, Chapter 4 provides an overview of the TIMSS 2015 Assessment Design, including general guidelines for item development."}, {"section_title": "Updating the TIMSS Frameworks for the TIMSS 2015 Assessment", "text": "The TIMSS assessment frameworks for 2015 were updated from those used in the TIMSS 2011 Assessment Frameworks (Mullis, Martin, Ruddock, O'Sullivan, & Preuschoff, 2009). Updating the frameworks regularly provides participating countries opportunities to introduce fresh ideas and current information about curricula, standards, frameworks, and instruction in mathematics and science, which results in keeping the frameworks educationally relevant, creates coherence from assessment to assessment, and permits the frameworks, the instruments, and the procedures to evolve gradually into the future. For TIMSS 2015, the mathematics and science frameworks were updated using information from the TIMSS 2011 Encyclopedia . These updates were discussed by the TIMSS National Research Coordinators (NRCs) from the participating countries at their first meeting. Each participating country identifies an NRC to work with the international project staff to ensure that the assessments are responsive to the country's concerns. Following the discussion at the first NRC meeting, the NRCs consulted with their national experts and responded to a topic-by-topic survey about how best to update the content and cognitive domains for TIMSS 2015. Next, the TIMSS 2015 expert group, the Science and Mathematics Item Review Committee (SMIRC), conducted their own in-depth review of the frameworks, and worked with the international project staff to use the countries' survey results to further refine and update the TIMSS 2015 Assessment Frameworks. Using an iterative process, the frameworks as revised by the SMIRC were once again reviewed by the NRCs and updated a final time prior to publication. All children can benefit from studying and developing strong skills in mathematics. Primarily, learning mathematics improves problem-solving skills, and working through problems can teach persistence and perseverance. Mathematics is essential in daily life for such activities as counting, cooking, managing money, and building things. Beyond that, many career fields require a strong mathematical foundation, such as engineering, architecture, accounting, banking, business, medicine, ecology, and aerospace. Mathematics is vital to economics and finance, as well as to the computing technology and software development underlying our technologically advanced and informationbased world. This chapter presents the assessment frameworks for the three TIMSS 2015 mathematics assessments: • TIMSS Mathematics-Fourth Grade; • TIMSS Numeracy, a less difficult version of TIMSS Mathematics-Fourth Grade that is newly developed for TIMSS 2015; and • TIMSS Mathematics-Eighth Grade. As described in the Introduction, the TIMSS 2015 Mathematics Frameworks for the fourth and eighth grades build on TIMSS' 20-year history of assessments every four years since 1995, with this being the sixth assessment in the series. In contrast, TIMSS Numeracy is newly developed for 2015 as an alternative or supplement to TIMSS Mathematics-Fourth Grade for countries where many children are still developing fundamental mathematics skills. In general, the fourth and eighth grade frameworks are similar to those used in TIMSS 2011. However, there have been minor updates to particular topics to better reflect the curricula, standards, and frameworks of the participating countries as reported in the TIMSS 2011 Encyclopedia . Also, attention was paid to current international research and initiatives concerning mathematics and education, such as the Common Core State Standards for Mathematics (National Governors Association, 2010) developed in the United States, the Mathematics (Primary and Lower Secondary) Syllabi (Singapore Ministry of Education, 2006) used in Singapore, and the Mathematics Curriculum Guide (Primary 1-Secondary 3) (Education Bureau, Hong Kong SAR, 2002) used in Hong Kong. Each of the three assessment frameworks for TIMSS 2015 is organized around two dimensions: • Content dimension, specifying the subject matter to be assessed; and • Cognitive dimension, specifying the thinking processes to be assessed. Exhibit 2 shows the target percentage of testing time devoted to each content and cognitive domain for the TIMSS 2015 fourth and eighth grade assessments. The content domains differ for the fourth and eighth grades, reflecting the mathematics widely taught at each grade. There is more emphasis on number at the fourth grade than at the eighth grade. At the eighth grade, two of the four content domains are algebra and geometry. Because these generally are not taught as separable areas in primary school, the introductory or pre-algebra topics assessed at the fourth grade are included as part of number, while the geometric domain focuses on geometric shapes and measures. The fourth grade data domain focuses on reading and displaying data whereas at the eighth grade it includes more emphasis on interpretation of data and the fundamentals of probability (called \"chance\"). It is important to highlight that TIMSS assesses a range of problem-solving situations within mathematics, with about two-thirds of the items requiring students to use applying and reasoning skills. The cognitive domains are the same for both grades, but with a shift in emphasis. Compared to the fourth grade, the eighth grade has less emphasis on the knowing domain and greater emphasis on the reasoning domain. Following this brief introduction, the chapter begins with the fourth grade content domains, identifying the three main content domains and the assessment topics within each domain. As an option or supplement to TIMSS Mathematics-Fourth Grade, the TIMSS Numeracy Framework is presented in its entirety following the description of the fourth grade content domains, because it has been adapted from the fourth grade content domains but with less difficult topics. For ease of reference, the assessment emphasis for the cognitive domains also is included for TIMSS Numeracy. Next, Chapter 1 continues with the description of the TIMSS Mathematics-Eighth Grade content domains and, then, the descriptions of the cognitive domains for both the fourth and eighth grades."}, {"section_title": "Mathematics Content Domains-Fourth Grade", "text": "Exhibit 3 shows the TIMSS Mathematics-Fourth Grade content domains and the target percentages of testing time devoted to each. Each content domain consists of topic areas, and each topic area in turn includes several topics. Across the fourth grade mathematics assessment, each topic receives approximately equal weight in terms of time allocated to assessing the topic. "}, {"section_title": "Number", "text": "The number content domain consists of understandings and skills related to three topic areas. The number domain at the fourth grade is the only domain where items within the domain are not distributed equally across the TIMSS 2015 content topic areas. The fifty percent of the assessment devoted to Number is apportioned as follows: • Whole numbers (25%); • Fractions and decimals (15%); and • Expressions, simple equations, and relationships (10%). Because whole numbers provide the easiest introduction to operations with numbers, working with whole numbers provides the foundation of mathematics in primary school. As such, whole numbers are the predominant component of the number domain and students should be able to compute with whole numbers of reasonable size as well as use computation to solve problems. However, because objects and quantities often do not come in whole numbers, it is also important for students to understand fractions as the basis for many calculations. Students should be able to compare familiar fractions and decimals. In addition, at the fourth grade, pre-algebraic concepts also are part of the TIMSS assessment, including understanding the concept of variable (unknowns) in simple equations, and initial understandings of relationships between quantities.\nAt the eighth grade, the number domain consists of three topic areas: • Whole numbers; • Fractions, decimals, and integers; and • Ratio, proportion, and percent. Building on the number content domain at the fourth grade, eighth grade students should have developed proficiency with more complex whole number concepts and procedures as well as extended their mathematical understanding of rational numbers (fractions, decimals, and integers). Fractions and decimals are an important part of daily life and being able to compute with them requires an understanding of the quantities the symbols represent. Students should understand that fractions and decimals are single entities like whole numbers, and hold unique places on the number line. Students also should understand and be able to compute with integers, through movement on the number line or various models (e.g., thermometers, losses and gains). Rational numbers can be expressed in various forms, including ratios, proportions, and percents. A single rational number can be represented with many different written symbols, and students need to be able to recognize the distinctions among interpretations of rational numbers, construct relations among them, and reason with them. Number: Whole Numbers 1. Demonstrate understanding of whole numbers and operations (e.g., the four arithmetic operations; place value; and the commutative, associative, and distributive properties). 2. Compute with whole numbers in problem situations. 3. Find and use multiples or factors of numbers, identify prime numbers, and evaluate powers of numbers and square roots of perfect squares up to 144. Number: Fractions, Decimals, and Integers 1. Identify, compare, or order rational numbers (fractions, decimals, and integers) using various models and representations (e.g., number line); and know that there are numbers that are not rational. 2. Compute with rational numbers (fractions, decimals, and integers) including those set in problem situations. Number: Ratio, Proportion, and Percent 1. Identify and find equivalent ratios; and model a given situation by using a ratio and divide a quantity in a given ratio. 2. Convert among percents, proportions, and fractions. 3. Solve problems involving percents or proportions."}, {"section_title": "Number: Whole Numbers", "text": "1. Demonstrate knowledge of place value, including recognizing and writing numbers in expanded form; and represent whole numbers using words, diagrams, or symbols. 2. Compare, order, and round whole numbers. 3. Compute (+, −, ×, ÷) with whole numbers. 4. Solve problems set in contexts, including those involving measurements, money, and simple proportions. 5. Identify odd and even numbers; identify multiples and factors of numbers. Number: Fractions and Decimals 1. Recognize fractions as parts of wholes, parts of a collection, or locations on number lines, and represent fractions using words, numbers, or models. 2. Identify equivalent simple fractions; compare and order simple fractions; add and subtract simple fractions, including those set in problem situations. 3. Demonstrate knowledge of decimal place value including representing decimals using words, numbers, or models; compare, order, and round decimals; add and subtract decimals, including those set in problem situations. Note: Fourth grade fractions items will involve denominators of 2, 3, 4, 5, 6, 8, 10, 12, or 100. Fourth grade decimals items will involve decimals up to one and/or two places. Number: Expressions, Simple Equations, and Relationships 1. Find the missing number or operation in a number sentence (e.g., 17 + w = 29). 2. Identify or write expressions or number sentences to represent problem situations involving unknowns. 3. Identify and use relationships in a well-defined pattern (e.g., describe the relationship between adjacent terms and generate pairs of whole numbers given a rule)."}, {"section_title": "Geometric Shapes and Measures", "text": "We are surrounded by objects of different shapes and sizes, and geometry helps us visualize and understand the relationships between shapes and sizes. This topic area deals with understanding measurements, the coordinate plane, lines, and angles. It also covers surfaces and solids. The two topic areas in geometric shapes and measures are as follows: • Points, lines, and angles; and • Two-and three-dimensional shapes. At the fourth grade, students should be able to identify the properties and characteristics of lines, angles, and a variety of geometric figures, including two-and three-dimensional shapes. Spatial sense is integral to the study of geometry, and students will be asked to describe and draw a variety of geometric figures. They also should be able to analyze geometric relationships and use these relationships to solve problems. Students should be able to use instruments and tools to measure physical attributes such as length, angle, area, and volume; and to use simple formulas to calculate areas and perimeters of squares and rectangles. Geometric Shapes and Measures: Points, Lines, and Angles 1. Measure and estimate lengths. 2. Identify and draw parallel and perpendicular lines. 3. Identify, compare, and draw different types of angles (e.g., a right angle, and angles larger or smaller than a right angle). 4. Use informal coordinate systems to locate points in a plane. Geometric Shapes and Measures: Two-and Three-dimensional Shapes 1. Use elementary properties to describe and compare common two-and three-dimensional geometric shapes, including line and rotational symmetry. 2. Relate three-dimensional shapes with their two-dimensional representations. 3. Calculate perimeters of polygons; calculate areas of squares and rectangles; and estimate areas and volumes of geometric figures by covering with a given shape or by filling with cubes. Note: Fourth grade geometric shapes items will involve circles, triangles, quadrilaterals, and other polygons, as well as cubes, rectangular solids, cones, cylinders, and spheres."}, {"section_title": "Data Display", "text": "The explosion of data in today's information society has resulted in a daily bombardment of visual displays of quantitative information. Often the Internet, newspapers, magazines, textbooks, reference books, and articles have data represented in charts, tables, and graphs. Students need to understand that graphs and charts help organize information or categories and provide a way to compare data. The data display content domain consists of one topic area: • Reading, interpreting, and representing. At the fourth grade, students should be able to read and recognize various forms of data displays. Given a simple problem situation and the data that has been collected, students should be able to organize and represent the data in graphs and charts that address the questions that prompted the data collection. Students should be able to compare characteristics of data and to draw conclusions based on data displays. Data Display: Reading, Interpreting, and Representing 1. Read, compare, and represent data from tables, pictographs, bar graphs, line graphs and pie charts. 2. Use information from data displays to answer questions that go beyond directly reading the data displayed (e.g., solve problems and perform computations using the data, combine data from two or more sources, make inferences, and draw conclusions based on the data)."}, {"section_title": "Shapes and Measures", "text": "1. Identify and compare common geometric figures (lines, angles, and basic two-and three-dimensional shapes). 2. Compare, measure, and estimate lengths, areas, and volumes. 3. Solve problems involving measurements, including time and money."}, {"section_title": "Mathematics Content Domains-Eighth Grade", "text": "Exhibit 5 shows the TIMSS Mathematics-Eighth Grade content domains and the target percentages of testing time devoted to each. Each content domain consists of topic areas, and each topic area in turn includes several topics. Across the eighth grade mathematics assessment, each topic receives approximately equal weight in terms of time allocated to assessing the topic. "}, {"section_title": "Algebra", "text": "The topic areas in algebra are as follows: • Expressions and operations; • Equations and inequalities; and • Relationships and functions. Algebra is pervasive in the world around us, enabling patterns to be expressed as formulas so that computations do not need to be done again and again, and so that generalizations can be made about relationships. Students should be able to solve real-world problems using algebraic models and explain relationships involving algebraic concepts. They need to go beyond memorization to understand that when there is a formula about two quantities, if they know one, they can find the other quantity. This conceptual understanding can extend to linear equations for calculations about things that expand at constant rates (e.g., slope) and quadratic expressions to study motion (e.g., the paths of traveling objects such as rockets, comets, and baseballs). Functions are studied to find out what will happen to a variable over time, including when the variable will reach its highest or lowest value. Algebra: Expressions and Operations 1. Find the value of an expression given values of the variables. 2. Simplify algebraic expressions involving sums, products, and powers of expressions; and compare expressions to determine if they are equivalent. 3. Use expressions to represent problem situations. Algebra: Equations and Inequalities 1. Write equations or inequalities to represent situations. 2. Solve linear equations, linear inequalities, and simultaneous linear equations in two variables. Algebra: Relationships and Functions 1. Generalize pattern relationships in a sequence, or between adjacent terms, or between the sequence number of the term and the term, using numbers, words, or algebraic expressions. 2. Interpret, relate, and generate representations of functions in tables, graphs, or words. 3. Identify functions as linear or non-linear; contrast properties of functions from tables, graphs, or equations; and interpret the meanings of slope and y-intercept in linear functions."}, {"section_title": "Geometry", "text": "Extending the understandings of shapes and measures assessed at the fourth grade, students should be able to analyze the properties and characteristics of a variety of two-and three-dimensional figures and be competent in geometric measurement (perimeters, areas, and volumes). They should be able to solve problems and provide explanations based on geometric relationships. The three topic areas in geometry are as follows: • Geometric shapes; • Geometric measurement; and • Location and movement. Geometry: Geometric Shapes 1. Identify different types of angles and use the relationships between angles on lines and in geometric figures. 2. Identify geometric properties of two-and three-dimensional shapes, including line and rotational symmetry. 3. Identify congruent triangles and quadrilaterals and their corresponding measures; and identify similar triangles and use their properties. 4. Relate three-dimensional shapes with their two-dimensional representations (e.g., nets, two-dimensional views of three-dimensional objects). 5. Use geometric properties, including the Pythagorean Theorem, to solve problems. Note: Eighth grade geometric shapes items will include circles; scalene, isosceles, equilateral, and right-angled triangles; trapezoids, parallelograms, rectangles, rhombuses, and square quadrilaterals; as well as other polygons including pentagons, hexagons, octagons, and decagons. It also includes three-dimensional objects-prisms, pyramids, cones, cylinders, and spheres. Geometry: Geometric Measurement 1. Draw and estimate the size of given angles, line segments, and perimeters; and estimate areas and volumes. 2. Select and use appropriate measurement formulas for perimeters, circumferences, areas, surface areas, and volumes; and find measures of compound areas. Geometry: Location and Movement 1. Locate points and solve problems involving points in the Cartesian plane. 2. Recognize and use geometric transformations (translation, reflection, and rotation) of two-dimensional shapes."}, {"section_title": "Data and Chance", "text": "Increasingly, the more traditional forms of data display (e.g., bar graphs, line graphs, pie graphs, pictographs) are becoming more complicated and are being supplanted by an array of new graphic forms. By the eighth grade, students should to be able to read and extract the important meaning from a variety of visual displays. It is also important for eighth grade students to be familiar with the statistics underlying data distributions (e.g., mean, median, mode, and spread) and how these relate to the shape of data graphs. In order to avoid being misled by distorted representations of data, students also should understand how the creators of charts and graphics can misrepresent the truth. Finally, students should have an initial grasp of some concepts related to probability. The data and chance content domain contains three topic areas: Calculator Use at the Eighth Grade Although technology in the form of calculators and computers can help students learn mathematics, it should not be used to replace basic understanding and competencies. Like any teaching tool, calculators need to be used appropriately, and policies for their use differ across the TIMSS countries. Also, the availability of calculators varies widely. It would not be equitable to require calculator use when students in some countries may never have used them. Similarly, however, it is not equitable to deprive students of the use of a familiar tool. In order to give students the best opportunity to operate in settings that mirror their classroom experience, TIMSS has permitted calculator use at the eighth grade since 2003. Thus, if eighth grade students are accustomed to having calculators for their classroom activities, then the country should encourage students to use them during the assessment. On the other hand, if students are not accustomed to having calculators or are not permitted to use them in their daily mathematics lessons, then the country need not permit their use. In developing the new assessment materials, every effort will be made to ensure that the test questions do not advantage or disadvantage students either way, with or without calculators."}, {"section_title": "Mathematics Cognitive Domains-Fourth and Eighth Grades", "text": "In order to respond correctly to TIMSS test items, students need to be familiar with the mathematics content being assessed, but they also need to draw on a range of cognitive skills. Describing these skills plays a crucial role in the development of an assessment like TIMSS 2015, because they are vital in ensuring that the survey covers the appropriate range of cognitive skills across the content domains already outlined. The first domain, knowing, covers the facts, concepts, and procedures students need to know, while the second, applying, focuses on the ability of students to apply knowledge and conceptual understanding to solve problems or answer questions. The third domain, reasoning, goes beyond the solution of routine problems to encompass unfamiliar situations, complex contexts, and multi-step problems. These three cognitive domains are used for both grades, but the balance of testing time differs, reflecting the difference in age and experience of students in the two grades. For the fourth and eighth grades, each content domain will include items developed to address each of the three cognitive domains. For example, the number domain will include knowing, applying, and reasoning items as will the other content domains. Exhibit 6 shows the target percentages of testing time devoted to each cognitive domain for the fourth and eighth grade assessments. Knowing Facility in applying mathematics, or reasoning about mathematical situations, depends on familiarity with mathematical concepts and fluency in mathematical skills. The more relevant knowledge a student is able to recall and the wider the range of concepts he or she understands, the greater the potential for engaging in a wide range of problem-solving situations. Without access to a knowledge base that enables easy recall of the language and basic facts and conventions of number, symbolic representation, and spatial relations, students would find purposeful mathematical thinking impossible. Facts encompass the knowledge that provides the basic language of mathematics, as well as the essential mathematical concepts and properties that form the foundation for mathematical thought. Procedures form a bridge between more basic knowledge and the use of mathematics for solving problems, especially those encountered by many people in their daily lives. In essence, a fluent use of procedures entails recall of sets of actions and how to carry them out. Students need to be efficient and accurate in using a variety of computational procedures and tools. They need to see that particular procedures can be used to solve entire classes of problems, not just individual problems."}, {"section_title": "Applying", "text": "The applying domain involves the application of mathematics in a range of contexts. In this domain, the facts, concepts, and procedures as well as the problems should be familiar to the student. In some items aligned with this domain, students need to apply mathematical knowledge of facts, skills, and procedures or understanding of mathematical concepts to create representations. Representation of ideas forms the core of mathematical thinking and communication, and the ability to create equivalent representations is fundamental to success in the subject. Problem solving is central to the applying domain, with an emphasis on more familiar and routine tasks. Problems may be set in real-life situations, or may be concerned with purely mathematical questions involving, for example, numeric or algebraic expressions, functions, equations, geometric figures, or statistical data sets.\nItems in this domain require students to engage in applying knowledge of facts, relationships, processes, concepts, equipment, and methods in contexts likely to be familiar in the teaching and learning of science."}, {"section_title": "Determine", "text": "Determine efficient/appropriate operations, strategies, and tools for solving problems for which there are commonly used methods of solution."}, {"section_title": "Represent/Model", "text": "Display data in tables or graphs; create equations, inequalities, geometric figures, or diagrams that model problem situations; and generate equivalent representations for a given mathematical entity or relationship."}, {"section_title": "Implement", "text": "Implement strategies and operations to solve problems involving familiar mathematical concepts and procedures."}, {"section_title": "Reasoning", "text": "Reasoning mathematically involves logical, systematic thinking. It includes intuitive and inductive reasoning based on patterns and regularities that can be used to arrive at solutions to problems set in novel or unfamiliar situations. Such problems may be purely mathematical or may have real-life settings. Both types of items involve transferring knowledge and skills to new situations; and interactions among reasoning skills usually are a feature of such items. Even though many of the cognitive skills listed in the reasoning domain may be drawn on when thinking about and solving novel or complex problems, each by itself represents a valuable outcome of mathematics education, with the potential to influence learners' thinking more generally. For example, reasoning involves the ability to observe and make conjectures. It also involves making logical deductions based on specific assumptions and rules, and justifying results.\nItems in this domain require students to engage in reasoning to analyze data and other information, draw conclusions, and extend their understandings to new situations. In contrast to the more direct applications of science facts and concepts exemplified in the applying domain, items in the reasoning domain involve unfamiliar or more complicated contexts. Answering such items can involve more than one approach or strategy. Scientific reasoning also encompasses developing hypotheses and designing scientific investigations. Identify the elements of a scientific problem and use relevant information, concepts, relationships, and data patterns to answer questions and solve problems."}, {"section_title": "Analyze", "text": "Determine, describe, or use relationships among numbers, expressions, quantities, and shapes."}, {"section_title": "Integrate/Synthesize", "text": "Link different elements of knowledge, related representations, and procedures to solve problems."}, {"section_title": "Evaluate", "text": "Evaluate alternative problem solving strategies and solutions.\nEvaluate alternative explanations; weigh advantages and disadvantages to make decisions about alternative processes and materials; and evaluate results of investigations with respect to sufficiency of data to support conclusions."}, {"section_title": "Draw Conclusions", "text": "Make valid inferences on the basis of information and evidence.\nMake valid inferences on the basis of observations, evidence, and/or understanding of science concepts; and draw appropriate conclusions that address questions or hypotheses, and demonstrate understanding of cause and effect."}, {"section_title": "Generalize", "text": "Make statements that represent relationships in more general and more widely applicable terms.\nMake general conclusions that go beyond the experimental or given conditions; apply conclusions to new situations."}, {"section_title": "Justify", "text": "Provide mathematical arguments to support a strategy or solution. The development of an understanding of science is important for students in today's world if they are to become citizens who can make informed decisions about themselves and the world in which they live. Every day they will be faced with a barrage of information, and sifting fact from fiction and understanding the scientific basis of important social, economic, and environmental issues is possible only if they have the tools to accomplish this. Students in the early grades have a natural curiosity about the world and their place in it, thus it is appropriate for them to capitalize on this curiosity and start to learn science at a young age, especially because they can begin to use this knowledge to improve their own health and nutrition. Students' understanding of science should build throughout their schooling so that when, as adults, they are faced with decisions relating to such diverse issues as the treatment of diseases, climate change, and the applications of technology, they are able to act from a sound scientific basis. Across the world, there is an increased demand for those qualified to pursue the careers in science, technology, and engineering that drive the innovation and invention necessary for economic growth and improving the quality of life. To meet this demand, it is increasingly important to prepare significant proportions of students to enter advanced study in these areas. This chapter contains the frameworks for the TIMSS science assessments at the fourth and eighth grades. In general, these frameworks are similar to those used in TIMSS 2011. However, there have been minor updates to particular topics to better reflect the curricula of the participating countries as reported in the TIMSS 2011 Encyclopedia . Consideration also was given to current international research and initiatives in science and science education, such as the Framework for K-12 Science Education (National Research Council, 2012)  The content domains differ for the fourth and eighth grades, reflecting the nature and difficulty of the science that is widely taught at each grade. There is more emphasis at the fourth grade on life science than its counterpart, biology, at the eighth grade. At the eighth grade, physics and chemistry are assessed as separate content domains and receive more emphasis than at fourth grade, where they are assessed as one content domain (physical science). The three cognitive domains are the same at both grades, encompassing the range of cognitive processes involved in learning science concepts, and applying and reasoning with this knowledge, from the primary grades through the middle school years. In 2015, TIMSS Science also will assess science practices. These practices include skills from daily life and school studies that students use in a systematic way to conduct scientific inquiry and that are fundamental to all science disciplines. Increasing emphasis has been placed on science practices and science inquiry in many countries' current science curricula, standards, and frameworks. The TIMSS 2015 Science Framework takes the position that the understandings and skills required to undertake science practices cannot be assessed in isolation, but must be assessed in the context of one of the content domains, and draw upon the range of thinking processes specified in the cognitive domains. Therefore, some items in the TIMSS 2015 science assessment at both the fourth and eighth grades will assess one or more of these important science practices as well as content specified in the content domains and thinking processes specified in the cognitive domains. The next two sections of this chapter present the TIMSS 2015 science content domains for fourth and eighth grades, followed by a description of the cognitive domains, which are applicable to both grades. The chapter concludes with a description of the science practices, which is a new section for TIMSS 2015.\nUse evidence and science understanding to support the reasonableness of explanations, solutions to problems, and conclusions from investigations."}, {"section_title": "Science Content Domains-Fourth Grade", "text": "Three major content domains define the science content for the TIMSS Science-Fourth Grade assessment: life science, physical science, and earth science. Exhibit 8 shows the target percentages for each of the three content domains in the TIMSS 2015 Science assessment. Each of these content domains includes one or more major topic areas, and each topic area in turn includes several topics. Each topic is further described by specific objectives that represent the learning that students should accomplish within each topic. Across the fourth grade assessment, each objective receives approximately equal weight in terms of time allocated to assessing the objective. The verbs used in the performance objectives are intended to represent typical performances expected of fourth graders, but are not intended to limit performances to a particular cognitive domain. Each performance objective can be assessed drawing on any of the three cognitive domains."}, {"section_title": "Life Science", "text": "The study of life science at the fourth grade provides students with an opportunity to capitalize on their innate curiosity and begin to understand the living world around them. At this level, life science is represented by five topic areas: • Characteristics and life processes of organisms; • Life cycles, reproduction, and heredity; • Organisms, environment, and their interactions; • Ecosystems; and • Human health. At this level, students should begin to build a base of knowledge about how organisms function and how they interact with other organisms and with their environment. They also should learn fundamental concepts in reproduction, heredity, and human health that in later grades will lead to a more sophisticated understanding of how the human body functions. Life Science: Characteristics and Life Processes of Organisms"}, {"section_title": "Differences between living and nonliving things and what living things require to live:", "text": "A. Recognize and describe the differences between living and non-living things (all living things reproduce, grow, develop, respond to stimuli, and die; and nonliving things do not). B. Identify what living things require in order to live (they require air, food, water, and an environment in which to live). 2. Physical and behavioral characteristics of major groups of living things: A. Compare and contrast physical and behavioral characteristics that distinguish the following major groups of living things (insects, birds, mammals, fish, and flowering plants). B. Identify or provide examples of living things belonging to the following major groups of living things: insects, birds, mammals, fish, and flowering plants. C. Distinguish groups of animals with backbones from groups of animals without backbones."}, {"section_title": "Functions of major structures in living things:", "text": "A. Relate major structures in animals to their functions (teeth break down food, the stomach digests food, bones support the body, lungs take in air, and the heart circulates blood). B. Relate major structures in plants to their functions (roots absorb water and anchor the plant, leaves make food, the stem transports water and food, petals attract pollinators, flowers produce seeds, and seeds produce new plants)."}, {"section_title": "Responses of living things to environmental conditions:", "text": "A. Describe the effect of lack of water and lack of sunlight on plants. B. Describe how different animals respond to high and low temperatures, and to danger. C. Describe humans' bodily responses to exercise and to high and low temperatures. Life Science: Life Cycles, Reproduction, and Heredity"}, {"section_title": "Stages of life cycles and differences among the life cycles of common plants and animals:", "text": "A. Recognize that plants and animals change in form as they go through different stages of their life cycles; identify the general stages of the life cycles of plants and animals (birth, growth and development, reproduction, and death). B. Identify stages of the life cycles of plants (germination, growth and development, reproduction, and seed dispersal). C. Recognize, compare, and contrast the life cycles of familiar plants and animals, such as trees, beans, humans, frogs, and butterflies."}, {"section_title": "Inheritance and reproduction strategies:", "text": "A. Recognize that plants and animals reproduce with their own kind to produce offspring with features that closely resemble those of the parents; recognize and explain that some features are the result of interactions with the environment, such as a plant's height being related to the amount of sunlight it receives, or a baby animal not gaining weight because it is not getting enough food. B. Recognize and explain that some features that are inherited from parents help living things survive, such as the waxy coating on some plants' leaves helping the plants stay alive in dry climates or an animal's coloring helping it hide from predators. C. Identify and describe different strategies that increase the numbers of offspring that survive, such as a plant producing many seeds or mammals caring for their young. Life Science: Organisms, Environment, and their Interactions 1. Physical features or behaviors of living things that help them survive in their environment: A. Associate physical features of plants and animals with the environments in which they live, such as a webbed foot belonging to an animal living in the water or a thick stem and spines belonging to a plant living in the desert. B. Identify or describe examples of physical features or behaviors of plants and animals and how these help them survive in particular environments, such as hibernation helping an animal to stay alive when food is scarce or a deep root helping a plant survive in an environment with little water. Life Science: Ecosystems"}, {"section_title": "How plants and animals obtain energy:", "text": "A. Recognize that all plants and animals need food to provide energy for activity and raw materials for growth and repair. B. Explain that plants need sunlight to make their food, while animals eat plants or other animals to get their food. Relationships in a simple food chain: A. Complete a model of a simple food chain using common plants and animals from familiar communities, such as a forest or a desert. B. Describe the roles of living things at each link in a simple food chain (plants produce their own food, some animals eat plants, other animals eat the animals that eat plants)."}, {"section_title": "Interactions among living things in a community:", "text": "A. Describe predator-prey relationships and identify common prey and their predators. B. Recognize and explain that some living things in a community of living things compete with others for food or space."}, {"section_title": "The impact of humans on the environment:", "text": "A. Explain ways in which human behavior has positive and negative effects on the environment, including ways of preventing or reducing pollution. B. Provide general descriptions and examples of the effects of pollution on humans, plants, animals, and their environments. C. Identify or explain some methods of preventing disease transmission, including washing hands and avoiding people who are sick."}, {"section_title": "Ways of maintaining good health:", "text": "A. Describe everyday behaviors that promote good health, such as eating a balanced diet, exercising regularly, washing hands, brushing teeth, getting enough sleep, or wearing sunscreen. B. Identify common food sources included in a balanced diet, such as fruits, vegetables, or grains."}, {"section_title": "Physical Science", "text": "In the study of physical science at the fourth grade, students learn how many physical phenomena that they observe in their everyday lives can be explained through an understanding of physical science concepts. The topic areas for the physical science content domain at fourth grade include the following: • Classification and properties of matter and changes in matter; • Forms of energy and energy transfer; and • Forces and motion. Fourth grade students should develop an understanding of physical states of matter, as well as common changes in the state and form of matter; this forms a foundation for the study of both chemistry and physics in the middle and upper grades. At this level, students also should know common forms and sources of energy and their practical uses, and understand basic concepts about light, sound, electricity, and magnetism. The study of forces and motion emphasizes an understanding of forces as they relate to movements students can observe, such as the effect of gravity or pushing and pulling movements. B. Describe a solid as having a definite shape and volume, a liquid as having a definite volume but not a definite shape, and a gas as having neither a definite shape nor volume."}, {"section_title": "Physical properties as a basis for classifying matter:", "text": "A. Compare and sort objects and materials on the basis of physical properties, (weight/mass, volume, state of matter, ability to conduct heat or electricity, and whether an object floats or sinks in water). B. Identify properties of metals (conducting electricity, conducting heat) and relate these properties to uses of metals. C. Describe examples of mixtures and explain how they can be physically separated (using sifting, filtration, evaporation, or magnetic attraction). Note: Students in the fourth grade are not expected to differentiate between mass and weight. 3. Magnetic attraction and repulsion: A. Recognize that magnets have north and south poles and that like poles repel and opposite poles attract. B. Recognize that magnets can be used to attract some other materials or objects."}, {"section_title": "Physical changes observed in everyday life:", "text": "A. Recognize that matter can be changed from one state to another by heating or cooling. B. Describe changes in the state of water (melting, freezing, boiling, evaporation, and condensation) and relate these state changes to changes in temperature. C. Identify ways of increasing how quickly material dissolves in a given amount of water (temperature, stirring, and surface area); and compare the concentrations of two solutions with different amounts of solute or solvent."}, {"section_title": "Chemical changes observed in everyday life:", "text": "A. Identify observable changes in materials that make new materials with different properties (decaying, burning, rusting, and cooking). Physical Science: Forms of Energy and Energy Transfer"}, {"section_title": "Common sources and uses of energy:", "text": "A. Identify sources of energy, such as the Sun, flowing water, wind, coal, oil, and gas, and understand that energy is needed to move objects and for heating and lighting."}, {"section_title": "Light and sound in everyday life:", "text": "A. Relate familiar physical phenomena (shadows, reflections, and rainbows) to the behavior of light. B. Recognize that vibrating objects can make sound."}, {"section_title": "Heat transfer:", "text": "A. Recognize that heating an object can increase its temperature, and that hot objects can heat up cold objects. B. Identify examples of common materials that easily conduct heat."}, {"section_title": "Electricity and simple electrical systems:", "text": "A. Identify objects and materials that conduct electricity. B. Recognize that electrical energy in a circuit can be transformed into other forms of energy, such as light and sound. C. Explain that simple electrical systems, such as a flashlight, require a complete (unbroken) electrical pathway. Physical Science: Forces and Motion"}, {"section_title": "Familiar forces and the motion of objects:", "text": "A. Identify gravity as the force that draws objects to Earth. B. Recognize that forces (pushing and pulling) may cause and object to change its motion and compare the effects of forces of different strengths in the same or opposite direction acting on an object."}, {"section_title": "Earth Science", "text": "Earth science is the study of Earth and its place in the solar system, and at fourth grade focuses on the study of phenomena and processes that students can observe in their everyday lives. While there is no single picture of what constitutes an earth science curriculum that applies to all countries, the three topic areas included in this domain are generally considered to be important for students at the fourth grade to understand about the planet on which they live and its place in the solar system: • Earth's structure, physical characteristics, and resources; • Earth's processes and history; and • Earth in the solar system. At this level, students should have some general knowledge about the structure and physical characteristics of Earth's surface, and about the use of Earth's most important resources. Students also should be able to describe some of Earth's processes in terms of observable changes and understand the time frame over which such changes have occurred. Fourth grade students should also demonstrate some understanding about Earth's place in the solar system based on observations of patterns of change on Earth and in the sky. \nTopics covered in the teaching and learning of earth science draw on the fields of geology, astronomy, meteorology, hydrology, and oceanography, and are related to concepts in biology, chemistry, and physics. Although separate courses in earth science covering all of these topics are not taught in all countries, it is expected that understandings related to earth science topic areas will have been included in a science curriculum covering the physical and life sciences or in separate courses such as geography and geology. The TIMSS 2015 Science Framework identifies the following topic areas that are universally considered to be important for students at the eighth grade to understand about the planet on which they live and its place in the universe: • Earth's structure and physical features; • Earth's processes, cycles, and history; • Earth's resources, their use and conservation; and • Earth in the solar system and the universe. Eighth grade students are expected to have some general knowledge about the structure and physical features of Earth, including Earth's structural layers, soils, and the atmosphere. Students also should build a conceptual understanding of processes, cycles, and patterns, including geological processes that have occurred over Earth's history, the water cycle, and patterns of weather and climate. Students should demonstrate knowledge of Earth's resources and their use and conservation, and relate this knowledge to practical solutions to resource management issues. At this level, the study of Earth and the solar system includes understanding how observable phenomena relate to the movements of Earth and the Moon, and describing the features of Earth, the Moon, and other planets. D. Describe the movement of water from higher to lower elevation or below ground to above ground."}, {"section_title": "Water on Earth and in the air:", "text": "A. Recognize that water in rivers or streams flows from mountains to oceans or lakes. B. Recognize that water moves into and out of the air during common events such as cloud and dew formation, evaporation of puddles, and drying of wet clothes.."}, {"section_title": "Daily, seasonal, and historical processes on Earth:", "text": "A. Describe how weather (variations in temperature, humidity, precipitation in the form of rain or snow, clouds, and wind) can vary with geographic location. B. Describe how temperature and precipitation can change with the seasons and how these changes vary with location. C. Recognize that some remains (fossils) of animals and plants that lived on Earth a long time ago are found in rocks and make simple deductions about changes in Earth's surface from the location of these remains. Earth Science: Earth in the Solar System 1. Objects in the solar system and their movements: A. Identify the Sun as the source of heat and light for the solar system; describe the solar system as the Sun and a group of planets (including Earth) that revolves around the Sun. B. Recognize that the Moon revolves around Earth, and from Earth it looks different at different times of the month."}, {"section_title": "Earth's motion and related patterns observed on Earth:", "text": "A. Explain how day and night are related to Earth's daily rotation about its axis, and provide evidence of this rotation from the changing appearance of shadows during the day. B. Explain how seasons in the northern and southern hemispheres are related to Earth's annual movement around the Sun."}, {"section_title": "Science Content Domains-Eighth Grade", "text": "Four major content domains define the science content for the TIMSS Science-Eighth Grade assessment: biology, chemistry, physics, and earth science. Exhibit 9 shows the target percentages for each of the four content domains in the TIMSS 2015 science assessment. Each of these content domains includes one or more major topic areas, and each topic area in turn includes several topics. Each topic is further described by specific objectives that represent the learning that students should accomplish within each topic. Across the eighth grade assessment, each objective receives approximately equal weight in terms of time allocated to assessing the objective. The verbs used in the performance objectives are intended to represent typical performances expected of fourth graders, but are not intended to limit performances to a particular cognitive domain. Each performance objective can be assessed drawing on each of the three cognitive domains. At the eighth grade, students build on the foundational life science knowledge they learned in the primary grades, and develop an understanding of many of the most important concepts in biology. The biology domain includes six topic areas: • Characteristics and life processes of organisms; • Cells and their functions; • Life cycles, reproduction, and heredity; • Diversity, adaptation, and natural selection; • Ecosystems; and • Human health. Concepts learned in each of these topic areas are essential for preparing students for more advanced study. Eighth grade students should understand how structure relates to function in organisms and how organisms respond physiologically to changes in environmental conditions. They also should begin to build an understanding of cell structure and function and the processes of photosynthesis and cellular respiration. At this level, the study of reproduction and heredity provides a foundation for more advanced study of molecular biology and molecular genetics. Learning the concepts of adaptation and natural selection provides a foundation for understanding evolution, and an understanding of processes and interactions in ecosystems is essential for students to begin to think about how to develop solutions to many environmental challenges. Finally, developing a science-based understanding of human health enables students to improve the condition of their lives and the lives of others. "}, {"section_title": "The processes of photosynthesis and cellular respiration:", "text": "A. Describe or model the basic process of photosynthesis (requires light, carbon dioxide, water, and chlorophyll; produces food; and releases oxygen). B. Describe or model the basic process of cellular respiration (requires oxygen and food, produces energy, and releases carbon dioxide and water). Biology: Life Cycles, Reproduction, and Heredity"}, {"section_title": "Life cycles and patterns of development:", "text": "A. Compare and contrast the life cycles and patterns of growth and development of different types of organisms (mammals, birds, amphibians, insects, and plants). B. Describe factors that affect the growth of plants and animals."}, {"section_title": "Sexual reproduction and inheritance in plants and animals:", "text": "A. Recognize that sexual reproduction involves the fertilization of an egg cell by a sperm cell to produce offspring that are similar but not identical to either parent. B. Relate the inheritance of traits to organisms passing on genetic material to their offspring. C. Distinguish inherited characteristics from acquired or learned characteristics. Biology: Diversity, Adaptation, and Natural Selection"}, {"section_title": "Variation as the basis for natural selection:", "text": "A. Recognize that variations in physical and behavioral characteristics among individuals in a population give some individuals an advantage in surviving and passing on their characteristics to their offspring. B. Relate species survival or extinction to reproductive success in a changing environment (natural selection). 2. Fossils as evidence for changes in life on Earth over time: A. Draw conclusions about the relative length of time major groups of organisms have existed on Earth using fossil evidence. B. Describe how similarities and differences among living species and fossils provide evidence of the changes that occur in living things over time, and explain that the degree of similarity of characteristics provides evidence of common ancestry. Biology: Ecosystems"}, {"section_title": "The flow of energy in ecosystems:", "text": "A. Identify and provide examples of producers, consumers, and decomposers. B. Describe the flow of energy in an ecosystem (energy flows from producers to consumers and only part of the energy is passed from one level to the next). C. Draw or interpret energy pyramids or food web diagrams."}, {"section_title": "The cycling of nutrients in ecosystems:", "text": "A. Describe the role of living things in the cycling of oxygen and carbon through an ecosystem. B. Describe the role of living things in the cycling of water through an ecosystem."}, {"section_title": "Interdependence of populations of organisms in an ecosystem:", "text": "A. Describe and provide examples of competition among populations of organisms in an ecosystem. B. Describe and provide examples of predation in an ecosystem. C. Describe and provide examples of symbiosis among populations or organisms in an ecosystem, such as birds or insects pollinating flowers, birds eating insects on deer or cattle, or a tapeworm living in human intestines."}, {"section_title": "Factors affecting population size in an ecosystem:", "text": "A. Identify factors that limit population size, such as disease, predators, food resources, and drought. B. Predict how changes in an ecosystem, such as water supply, population changes, or migration, can affect available resources, and thus the balance among populations. Biology: Human Health 1. Causes, transmission, prevention, and resistance to diseases: A. Describe causes, transmission, and prevention of common diseases, such as influenza, measles, malaria, and HIV. B. Describe the role of the body's immune system in resisting disease and promoting healing. 2. The importance of diet, exercise, and lifestyle in maintaining health: A. Explain the importance of diet, exercise, and lifestyle in maintaining health and preventing illness, such as heart disease, high blood pressure, diabetes, skin cancer, and lung cancer. . Identify the dietary sources and role of nutrients in a healthy diet (vitamins, minerals, proteins, carbohydrates, and fats)."}, {"section_title": "Chemistry", "text": "At the eighth grade, students' study of chemistry extends beyond developing an understanding of everyday phenomena to learning the central concepts and principles that are needed for understanding practical applications of chemistry and undertaking more advanced study. The chemistry domain includes three topic areas: • Composition of matter; • Properties of matter; and • Chemical change. The study of the composition of matter focuses on differentiating elements, compounds, and mixtures and understanding the particulate structure of matter. The properties of matter topic area focuses on distinguishing between physical and chemical properties of matter and understanding the properties of mixtures and solutions and acids and bases. The study of chemical change focuses on the characteristics of chemical changes, the conservation of matter during chemical changes, and an introduction to the structure and properties of chemical bonds. "}, {"section_title": "Physical and chemical properties of matter:", "text": "A. Distinguish between physical and chemical properties of matter. B. Relate uses of materials to their physical properties, such as melting point and boiling point, the ability to dissolve many substances, and thermal conductivity. C. Relate uses of materials to their chemical properties, such as rusting and flammability."}, {"section_title": "Physical and chemical properties as a basis for classifying matter:", "text": "A. Classify substances according to physical properties that can be demonstrated or measured, such as density, melting or boiling point, solubility, magnetic properties, and electrical or thermal conductivity. B. Classify substances according to their chemical properties (metals/ nonmetals, and acids/bases)."}, {"section_title": "Mixtures and solutions:", "text": "A. Explain how physical methods can be used to separate mixtures into their components. B. Describe solutions in terms of substance(s) (solid, liquid, or gas solutes) dissolved in a solvent. C. Relate the concentration of a solution to the amounts of solute and solvent present. D. Explain how temperature, stirring, and surface area affect the rate at which solutes dissolve."}, {"section_title": "Properties of acids and bases:", "text": "A. Recognize everyday substances as acids or bases based on their properties (acids have a sour taste, react with metals and have pH less than 7; and bases usually have a bitter taste, feel slippery, do not react with metals, and have pH greater than 7). B. Recognize that both acids and bases react with indicators to produce different color changes. C. Recognize that acids and bases neutralize each other. Chemistry: Chemical Change"}, {"section_title": "Characteristics of chemical changes:", "text": "A. Differentiate chemical from physical changes in terms of the transformation (reaction) of one or more pure substances (reactants) into different pure substances (products). B. Provide evidence (temperature changes, gas production, precipitate formation, color change, or light emission) that a chemical change has taken place. C. Recognize that oxygen is needed in common oxidation reactions (combustion, rusting, and tarnishing) and relate these reactions to everyday activities such as burning wood or preserving metal objects."}, {"section_title": "Matter and energy in chemical changes:", "text": "A. Recognize that matter is conserved during a chemical change and that all of the atoms present at the beginning of the reaction are present at the end of the reaction, but they are rearranged to form new substances. B. Recognize that some chemical reactions release energy (heat and/or light) while others absorb it and classify familiar chemical reactions (such as burning, neutralization, and cooking) as either releasing heat or absorbing heat."}, {"section_title": "Chemical bonds:", "text": "A. Recognize that a chemical bond is caused by the forces between atoms in a compound and that the atoms' electrons are involved in this bonding."}, {"section_title": "Physics", "text": "As in the chemistry domain, students' study of physics at the eighth grade extends beyond understanding the scientific basis of common everyday observations to learning many of the central physics concepts that are needed for understanding practical applications of physics or for undertaking advanced study later in their education. The physics domain includes five topic areas: • Physical states and changes in matter; • Energy transformation and transfer; • Light and sound; • Electricity and magnetism; and • Forces and motion. Eighth grade students should be able to describe processes involved in changes in the state of matter and relate states of matter to the distance and movement among particles. They also should be able to identify different forms of energy, describe simple energy transformations, apply the principle of conservation of total energy in practical situations, and understand the concepts of heat and temperature. Students at this level also are expected to know some basic properties of light and sound, relate these properties to observable phenomena, and solve practical problems involving the behavior of light and sound. In the topic area of electricity and magnetism, students should be familiar with the electrical conductivity of common materials, current flow in electric circuits, and the difference between simple series and parallel circuits. They also should be able to describe properties and uses of permanent magnets and electromagnets. Students' understanding of forces and motion should now extend to knowing the general types and characteristics of forces and how simple machines function. They should understand the concepts of pressure and density and be able to define motion and predict qualitative changes in motion based on the forces acting on an object. A. Recognize that atoms and molecules in matter are in constant motion and the differences in relative motion and distance between particles in solids, liquids, and gases; apply knowledge about the movement of and distance between atoms and molecules to explain the physical properties of solids, liquids, and gases (volume, shape, density, and compressibility). B. Relate changes in temperature of a gas to changes in its volume and/ or pressure and changes in the average speed of its particles; relate expansion of solids and liquids to temperature change in terms of the average spacing between particles."}, {"section_title": "Changes in states of matter:", "text": "A. Describe melting, freezing, boiling, evaporation, condensation, and sublimation as changes of state resulting from heating and cooling. "}, {"section_title": "Forms of energy and the conservation of energy:", "text": "A. Identify different forms of energy (kinetic, potential, mechanical, light, sound, electrical, thermal, and chemical). B. Describe common energy transformations, such as combustion in an engine to move a car, photosynthesis, or the production of hydroelectric power and recognize that the total energy of a closed system is conserved."}, {"section_title": "Heat transfer and thermal conductivity of materials:", "text": "A. Relate the transfer of energy from an object or an area at a higher temperature to one at a lower temperature to heating and cooling. B. Recognize that hot objects cool off and cold objects warm up until they reach the same temperature as their surroundings. C. Compare the relative thermal conductivity of different materials. Physics: Light and Sound"}, {"section_title": "Properties of light:", "text": "A. Describe or identify basic properties of light (transmission through different media; finite speed; reflection, refraction, absorption, and splitting of white light into its component colors). B. Relate the apparent color of objects to reflected or absorbed light. C. Solve practical problems involving the reflection of light from plane mirrors and the formation of shadows. D. Interpret simple ray diagrams to identify the path of light and to locate images produced by lenses and mirrors (real images only)."}, {"section_title": "Properties of sound:", "text": "A. Recognize that sound is a wave phenomenon and is characterized by loudness (amplitude) and pitch (frequency). B. Describe some basic properties of sound (the need for a medium for transmission, reflection and absorption by surfaces, and relative speed through different media). C. Relate common phenomena, such as echoes, to the properties of sound. Physics: Electricity and Magnetism 1. Conductors and the flow of electricity in electrical circuits: A. Classify materials as electrical conductors or insulators. B. Identify diagrams representing complete circuits (series and parallel) and distinguish how the flow of electrical current differs between series and parallel circuits. C. Describe factors that affect electrical currents in series or parallel circuits, such as number of batteries and/or bulbs."}, {"section_title": "Properties and uses of magnets and electromagnets:", "text": "A. Describe the properties of permanent magnets (attraction/repulsion; and strength of the magnetic force varies with distance). B. Describe the properties that are unique to electromagnets (the strength varies with current and number of coils, the magnetic field can be turned on and off, and the poles can switch). C. Describe uses of permanent magnets and electromagnets in everyday life, such as in a compass, doorbell, or recycling factory. Physics: Forces and Motion"}, {"section_title": "Common forces and their characteristics:", "text": "A. Describe common mechanical forces, including gravitational, normal, friction, elastic, and buoyant forces, and weight as a force due to gravity. B. Recognize that forces have strength, direction, and a point of application. C. Recognize that for every action force there is an equal and opposite reaction force."}, {"section_title": "Effects of forces:", "text": "A. Demonstrate basic knowledge of how simple machines function, such as levers and ramps. Explain pressure in terms of force and area. C. Describe effects related to pressure, such as atmospheric pressure decreasing with altitude, water pressure increasing with depth, and evidence of gas pressure in balloons. D. Explain floating and sinking in terms of density differences and the effect of buoyant force."}, {"section_title": "Motion and changes in motion:", "text": "A. Define speed of an object as change in position (distance) over time and acceleration as change in speed over time. B. Recognize that the motion of an object is determined by its speed and the direction in which it is moving. C. Predict qualitative one-dimensional changes in motion (if any) of an object based on the forces acting on it."}, {"section_title": "Components of Earth's atmosphere and atmospheric conditions:", "text": "A. Recognize that Earth's atmosphere is a mixture of gases; and identify the relative abundance of its main components (nitrogen, oxygen, water vapor, and carbon dioxide), and relate these components to everyday processes. B. Relate changes in atmospheric conditions (temperature and pressure) to the altitude. Earth Science: Earth's Processes, Cycles, and History"}, {"section_title": "Geological processes during Earth's history:", "text": "A. Describe the general processes involved in the rock cycle, such as the cooling of lava, heat and pressure transforming sediment into rock, and weathering. B. Identify or describe physical processes and major geological events that have occurred over millions of years, such as plate movement, volcanic activity, mountain building, and weathering. C. Explain the formation of fossils and fossil fuels. 2. Earth's water cycle: A. Diagram or describe the processes in Earth's water cycle (evaporation, condensation, and precipitation) and recognize the Sun as the source of energy for the water cycle. B. Describe the role of cloud movement and water flow in the circulation and renewal of fresh water on Earth's surface."}, {"section_title": "Weather and climate:", "text": "A. Distinguish between weather (day-to-day variations in temperature, humidity, precipitation in the form of rain or snow, clouds, and wind) and climate (long-term typical weather patterns in a geographic area). 2. Features of Earth, the Moon, and other planets: A. Compare and contrast certain physical features of Earth (atmosphere, temperature, water, distance from the Sun, period of revolution and rotation, and ability to support life) with the Moon and other planets. B. Recognize that it is the force of gravity that keeps the planets and moons in orbits as well as pulls objects to Earth's surface."}, {"section_title": "Science Cognitive Domains-Fourth and Eighth Grades", "text": "The cognitive dimension is divided into three domains that describe the thinking processes students are expected to use when encountering the science items developed for TIMSS 2015. The first domain, knowing, addresses the student's ability to recall, recognize, and describe facts, concepts, and procedures that are necessary for a solid foundation in science. The second domain, applying, focuses on using this knowledge to generate explanations and solve practical problems. The third domain, reasoning, includes using evidence and science understanding to analyze, synthesize, and generalize, often in unfamiliar situations and complex contexts. These three cognitive domains are used at both grades, however the target percentages for each domain vary between fourth and eighth grade in accordance with the increased cognitive ability, instruction, experience, and breadth and depth of understanding of students at the higher grade level. The percentage of items that involve knowing is higher at the fourth grade while the percentage of items that ask students to engage in reasoning is higher at the eighth grade. While there is some hierarchy across the three domains (from knowing to applying to reasoning), each domain contains items representing a full range of difficulty. Exhibit 10 shows the target percentages for each of the three cognitive domains at the fourth and eighth grades. For the fourth and eighth grades, each content domain includes items developed to address each of the three cognitive domains. For example, the life science content domain will include knowing, applying, and reasoning items, as will the other content domains. The following sections further describe the thinking processes that define the cognitive domains."}, {"section_title": "Knowing", "text": "Items in this domain assess students' knowledge of facts, relationships, processes, concepts, and equipment. Accurate and broad-based factual knowledge enables students to successfully engage in the more complex cognitive activities essential to the scientific enterprise."}, {"section_title": "Recall/Recognize", "text": "Identify or state facts, relationships, and concepts; identify the characteristics or properties of specific organisms, materials, and processes; identify the appropriate uses for scientific equipment and procedures; and recognize and use scientific vocabulary, symbols, abbreviations, units, and scales."}, {"section_title": "Describe", "text": "Describe or identify descriptions of properties, structures, and functions of organisms and materials, and relationships among organisms, materials, and processes and phenomena."}, {"section_title": "Provide Examples", "text": "Provide or identify examples of organisms, materials, and processes that possess certain specified characteristics; and clarify statements of facts or concepts with appropriate examples."}, {"section_title": "Compare/Contrast/ Classify", "text": "Identify or describe similarities and differences between groups of organisms, materials, or processes; and distinguish, classify, or sort individual objects, materials, organisms, and process based on given characteristic and properties."}, {"section_title": "Relate", "text": "Relate knowledge of an underlying science concept to an observed or inferred property, behavior, or use of objects, organisms, or materials."}, {"section_title": "Use Models", "text": "Use a diagram or other model to demonstrate knowledge of science concepts, to illustrate a process cycle relationship, or system, or to find solutions to science problems."}, {"section_title": "Interpret Information", "text": "Use knowledge of science concepts to interpret relevant textual, tabular, pictorial, and graphical information."}, {"section_title": "Explain", "text": "Provide or identify an explanation for an observation or a natural phenomenon using a science concept or principle."}, {"section_title": "Synthesize", "text": "Answer questions that require consideration of a number of different factors or related concepts."}, {"section_title": "Formulate Questions/ Hypothesize/Predict", "text": "Formulate questions that can be answered by investigation and predict results of an investigation given information about the design; formulate testable assumptions based on conceptual understanding and knowledge from experience, observation, and/or analysis of scientific information; and use evidence and conceptual understanding to make predictions about the effects of changes in biological or physical conditions."}, {"section_title": "Design Investigations", "text": "Plan investigations or procedures appropriate for answering scientific questions or testing hypotheses; and describe or recognize the characteristics of well-designed investigations in terms of variables to be measured and controlled and cause-and-effect relationships."}, {"section_title": "Science Practices in TIMSS 2015", "text": "Scientists engage in scientific inquiry by following key science practices that enable them to understand the natural world and answer questions about it. Students of science must become proficient at these practices to develop an understanding of how the scientific enterprise is conducted. These practices include skills from daily life and school studies that students use in a systematic way to conduct scientific inquiry. The science practices are fundamental to all science disciplines. Five practices that are fundamental to scientific inquiry are represented in TIMSS 2015: 1. Asking questions based on observations-Scientific inquiry includes observations of phenomena in the natural world with unfamiliar characteristics or properties. These observations lead to questions, which are used to formulate testable hypotheses to help answer those questions. 2. Generating evidence-Testing hypotheses requires designing and executing systematic investigations and controlled experiments in order to generate evidence to support or refute the hypothesis. Scientists must relate their understanding of a science concept to a property that can be observed or measured in order to determine the evidence to be gathered, the equipment and procedures needed to collect the evidence, and the measurements to be recorded. 3. Working with data-Once the data are collected, scientists summarize it in various types of visual displays and describe or interpret patterns in the data and explore relationships between variables."}, {"section_title": "4.", "text": "Answering the research question-Scientists use evidence from observations and investigations to answer questions and support or refute hypotheses."}, {"section_title": "5.", "text": "Making an argument from evidence-Scientists use evidence together with science knowledge to construct explanations, justify and support the reasonableness of their explanations and conclusions, and extend their conclusions to new situations. These science practices cannot be assessed in isolation, but must be assessed in the context of one of the science content domains, and by drawing upon the range of thinking processes specified in the cognitive domains. Therefore, some items in the TIMSS 2015 science assessment at both the fourth and eighth grades will assess one or more of these important science practices as well as content specified in the content domains and thinking processes specified in the cognitive domains. In today's technologically-centered society, understanding how to improve student learning in mathematics and science is vital for educational policy makers, as well as principals, teachers, and parents. A strong foundation in mathematics and science is crucial for student's academic and professional development, and fundamental to the prosperity and welfare of the global community. The TIMSS 2015 Context Questionnaire Framework establishes the foundation for the background information collected in TIMSS 2015. Through the TIMSS 2015 Encyclopedia and context questionnaires, TIMSS collects data about how educational systems throughout the world deliver and promote learning in mathematics and science. These data on system structure, school organization, curricula, teacher education, and classroom practices reveal many pathways to teaching and learning. In particular, when compared across countries and in relation to student achievement, this information can provide insight into effective educational strategies for development and improvement. Participating countries each contribute a chapter to the TIMSS 2015 Encyclopedia and complete questionnaires to provide important information about their national policies and curricula for teaching and learning mathematics and science. Students in the fourth or eighth year of schooling typically have gained most of their mathematics and science learning at school and at home, influenced to some extent by experiences outside of school. Community, school, classroom, and home environments that support each other can create extremely effective climates for learning. To reflect this situation, the TIMSS 2015 Context Questionnaire Framework encompasses five broad areas: • National and community contexts; • Home contexts; • School contexts; • Classroom contexts; and • Student characteristics and attitudes toward learning. The context questionnaires that accompany the mathematics and science assessments are an essential component of TIMSS data collection. The students as well as their parents, teachers, and school principals complete questionnaires covering a wide array of policy relevant information about the country's home and school contexts for teaching and learning mathematics and science. The student questionnaires also ask about attitudes toward learning mathematics and science."}, {"section_title": "National and Community Contexts", "text": "Cultural, social, political, and economic factors all contribute to the backdrop of student learning. At the national and community level, key educational policy decisions are made about how to best implement the curriculum, given these contextual factors. The success a country has in providing effective mathematics and science instruction depends on a number of interrelated national characteristics and decisions: • Economic resources, population demographics, and geographic characteristics; • Organization and structure of the educational system; • Student flow; • Language(s) of instruction; • Intended mathematics and science curriculum; • Teachers and teacher education; and • Monitoring curriculum implementation. Economic Resources, Population Demographics, and Geographic Characteristics A country's economic resources, demographic characteristics, and geographic characteristics can have a tremendous impact on the relative ease or difficulty of implementing a uniformly rigorous curriculum. • Economic Resources-Countries have different levels of wealth and vary in how that wealth is distributed. At the national level, economic resources and socioeconomic equity tend to be linked to favorable contexts for fostering student achievement (Chiu & Khoo, 2005). Having economic resources enables better educational facilities and a greater number of well-trained teachers and administrators. Financial resources also provide the opportunity to invest in education through widespread community programs and by making materials and technology more readily available in classrooms. • Population Demographics-The size and diversity of a country's population can increase the challenges involved in curriculum implementation. Some countries have a diversity of ethnic groups, cultures, and languages, and immigration can add to the diversity of the population. The curriculum and the educational system must be flexible enough to foster student achievement for this heterogeneous population. • Geographic Characteristics-The sheer size of a country can pose challenges to curriculum implementation. This is especially true if part of the population is isolated in remote parts of the country."}, {"section_title": "Organization and Structure of the Educational System", "text": "Some countries have highly centralized educational systems in which most policy-related decisions are made at the national or regional level. In these systems, often there is a great deal of educational uniformity in terms of curriculum, textbooks, and general policies. Other countries have more decentralized systems in which many important decisions are left to local governments and schools. This decentralized structure results in greater variation in how schools operate and how students are taught. Research has found that the level of centralization of standardized assessments tends to be associated with greater educational equality (Van de Werfhorst & Mijs, 2010) and higher student outcomes (Bishop & Wößmann, 2004;Jürges, Schneider, & Büchel, 2005)."}, {"section_title": "Student Flow", "text": "Student flow refers to how students in an educational system progress through school. For TIMSS 2015, the student flow themes that are highly relevant include age of entry, pre-primary education, the prevalence of grade retention, and educational tracking and streaming. • Age of Entry-The age of entry to formal education is particularly important for understanding achievement at the fourth grade. Due to the complexity of the cognitive demands, students in countries that begin formal schooling at a younger age do not necessarily receive much formal instruction in mathematics, and particularly in science, in their first year of schooling, whereas students starting school at a somewhat older age may receive formal instruction immediately. • Preprimary Education-Even before they begin formal primary school, children may receive considerable exposure to literacy, numeracy, and science activities as part of their pre-primary educational experience. As described in the TIMSS 2011 Encyclopedia (Mullis, Martin, Minnich, Stanco, Centurino, & Castle, 2012), countries vary dramatically in their policies and practices with regard to early (pre-primary) education. TIMSS 2011 supported research findings that pre-primary school can have a positive effect on academic achievement during primary school (Berlinski, Galiani, & Gertler, 2009;Tucker-Drob, 2012), with longer duration of pre-primary education associated with higher achievement (Sammons et al., 2002). • Grade Retention-Grade retention practices differ among countries. This variation has been explained as an effect of differing educational policies, cultural norms, and diverging perspectives on the advantages of holding students back (Goos et al., 2013). Because TIMSS is a grade-based study, the degree of grade retention can be an important factor to consider when evaluating achievement results. Research has shown that grade retention does not have a positive relationship with student achievement or the emotional wellbeing of the child (Hattie, 2009;Jimerson, 2001). • Tracking-Some educational systems promote policies that steer schools to group students by ability level so that students can learn at a pace that reflects their skills in the subject. Other systems recommend tracking students at an early age by assigning students to different schools that provide academic or vocational routes. Studies on within-school tracking or ability grouping have produced mixed results (OECD, 2010; Schoffield, 2010), although studies have shown that ability grouping can be beneficial for high achieving students (Schoffield, 2010), as can offering accelerated programs to high-achievers (Steenbergen-Hu & Moon, 2011). A breadth of literature has suggested that early educational between-school tracking can exacerbate differences in student achievement (Hanushek & Wößmann, 2006;Marks, 2005;Schütz, Ursprung, & Wößmann, 2008;Van de Werfhorst & Mijs, 2010). Both within-school tracking and between-school tracking also can influence student self-concept (Chmielewski, Dumont, & Trautwein, in press), an important predictor of student achievement. The timing of the tracking is especially relevant to analyzing TIMSS' eighth grade results."}, {"section_title": "Language(s) of Instruction", "text": "A multilingual population can increase the challenge of the implementation of advanced mathematics and science curricula. TIMSS and other studies have consistently shown a learning gap associated with students who do not speak the language of instruction in the home (Entorf & Minoiu, 2005;Schnepf, 2007;Trong, 2009). Multilingual countries across the world have different policies for educating the population. For example, some countries have one commonly spoken language, and other countries are a historically multilingual population, and immigration can increase language diversity."}, {"section_title": "Intended Mathematics and Science Curriculum", "text": "Whether formulated at the national, community, or school level, curricular documents define and communicate expectations for students in terms of the knowledge, skills, and attitudes to be developed or acquired through their formal mathematics and science education. The nature and extent of these curricular goals can vary across and within educational systems, and differences also exist in how the curricular goals are kept current in the face of a changing society and workplace, and with technological advances. Although mastery of the subject typically is a major focus of mathematics and science curricula, countries differ considerably in how mastery is defined and how the curriculum specifies that mastery should be achieved. For example, acquiring basic skills, memorizing rules, procedures or facts, understanding mathematical concepts, applying mathematics to \"real-life\" situations, communicating or reasoning mathematically, and problem solving in everyday situations are several approaches to teaching mathematics that have been advocated in recent years and are implemented to varying degrees in different countries. In science, focus on acquiring basic science facts, understanding and applying science concepts, emphasis on formulating hypotheses, designing and conducting investigations to test hypotheses, using inquiry-based learning, and communicating scientific explanations are teaching strategies that are emphasized in some countries more than in others. Similarly, differences in the structure of the science curriculum as separate or integrated subjects can result in different experiences for students in different countries."}, {"section_title": "Teachers and Teacher Education", "text": "Policies on teacher education can facilitate the successful implementation of the intended curriculum, and TIMSS collects information about how countries educate teachers in content and pedagogical approaches specified in the curriculum. As described in the TIMSS 2011 Encyclopedia, training may be an integral part of the teacher education curriculum or it may be included in professional development programs for practicing teachers."}, {"section_title": "Monitoring Curriculum Implementation", "text": "Many countries have systems in place for monitoring and evaluating curriculum implementation, and for assessing student achievement. Commonly used methods include national or regional standardized tests, school inspections, audits, and teaching observations."}, {"section_title": "Home Contexts", "text": "Parents or guardians and the general home environment are very influential on children's upbringing and their success in school. In order to better understand the effects of the home, TIMSS 2015 will collect data through both the student questionnaire and a new home questionnaire, which will be completed by the student's parents or caregivers. Through these two questionnaires, information will be gathered on the following: • Home resources for learning; • Language(s) spoken in the home; • Parental educational expectations and academic socialization; • Early literacy, numeracy, and science activities."}, {"section_title": "Home Resources for Learning", "text": "Home resources for learning encompass important socioeconomic characteristics of the parents, such as their education level, together with home supports for learning and emphasis on educational activities. In educational research, the most influential background factors on student achievement tend to be those that measure socioeconomic status of the parents or caregivers, often indicated through proxy variables such as parental level of education, income, occupational class, and, more generally, home resources (Bradley & Corwyn, 2002;Dahl & Lochner, 2005;Davis-Kean, 2005;Martin, Foy, Mullis, & O'Dwyer, 2013;Sirin, 2005;Willms, 2006). With the evolution of technology, children are increasingly spending time interacting with new digital media like ebooks, tablets, and smart phones (Gutnick, Robb, Takeuchi, & Kotler, 2011;Rideout, Foehr, & Roberts, 2010). Research has shown that parents are generally accepting of children spending their time playing on digital media, including certain video games, because they believe that such activities lead to proficiency with computers and technology, important skills for academic and career success (Takeuchi, 2011). For example, if used correctly, educational applications (apps) for mobile devices and other digital media devices can be effective, supplementary early learning tools for young children (Chiong & Shuler, 2010;Lieberman, Bates, & So, 2009)."}, {"section_title": "Language(s) Spoken in the Home", "text": "Students who do not speak the language of instruction in the home can be disadvantaged in learning mathematics and science in school, and often there is at least an initial learning gap because students must learn the concepts and content of the mathematics and science curricula through a new language (Entorf & Minoiu, 2005;Schnepf, 2007;Trong, 2009)."}, {"section_title": "Parents Educational Expectations and Academic Socialization", "text": "Parents convey their expectations to their children and provide educational goals for them (Hong & Ho, 2005;Jeynes, 2005). Academic socialization is the process of stressing the importance of education, and includes parents and children talking about the value of education, discussing future educational and occupational expectations for the child, and helping children draw links between schoolwork and its real-world applications (Hill & Tyson, 2009;Taylor, Clayton, & Rowley, 2004). Academic socialization also can be subject-specific. For example, parents can convey the value they place on science or mathematics, and this can be associated with achievement in the subject (Hong, Yoo, You, & Wu, 2010;Sun, Bradley, & Akers, 2012). Sometimes socialization can be subtle, conveyed by the parents' occupations or hobbies (Dabney, Chakraverty, & Tai, 2013), but it also can be more direct, such as parents encouraging children to participate in particular extracurricular activities and bringing children on field trips or museum visits (George & Kaplan, 1998). TIMSS 2011 results have shown a relationship between students' educational expectations and their achievement. The socioeconomic status of the parents is highly related to a student's educational expectations, as is the selectivity and composition of the school that the student attends (Sikora & Saha, 2007). Research has found that students may reevaluate their educational expectations over time as they receive more information on their abilities and the opportunities that may be presented, although the extent of this adaptation process continues to be debated (Andrew & Hauser, 2011;Morgan, 2005)."}, {"section_title": "Early Literacy, Numeracy, and Science Activities", "text": "In many contexts, reading ability can be essential to learning and achieving in mathematics and science. Early parental involvement in children's literacy activities can impact early literacy development, and have long-lasting effects on children's literacy as they age (Melhuish et al., 2008;Senechal & LeFevre, 2002). Small children who engage in early numeracy activities in their homes and pre-school can stimulate their interest in mathematics and enhance the development of their abilities (Claessens & Engel, 2013;Melhuish et al., 2008;Sarama & Clements, 2009). These activities include playing with blocks or construction toys, saying counting rhymes or singing counting songs, playing games involving shapes, and playing other types of games that involve quantitative reasoning. A child's early experiences with science may include visiting the zoo, building things, and visiting science museums. These early experiences could shape both the student's attitude towards science and knowledge of the subject. Students who have early numeracy skills and science knowledge when entering school often have higher achievement in primary school (Duncan et al., 2007;Princiotta, Flanagan, & Hausken, 2006). In an analysis of TIMSS and PIRLS 2011 data, Gustafsson, Hansen, and Rosén (2013) found that early childhood activities including both literacy and numeracy activities predict student ability when entering primary school and student achievement on the TIMSS subjects at the fourth grade, after controlling for other predictors in a structural equation model. This research found a gender discrepancy in early childhood activities, with parents reporting more early childhood literacy-oriented activities for girls and more early childhood numeracy-oriented activities for boys."}, {"section_title": "School Contexts", "text": "A school's environment and organization can influence the ease and effectiveness of reaching curricular goals. Accepting that an effective school is not simply a collection of discrete attributes, but rather a well-managed integrated system where each action or policy directly affects all other parts, TIMSS focuses on a set of well-researched school quality indicators: • School location; • School composition by student socioeconomic background; • Instruction affected by mathematics and science resource shortages; • Teacher availability and retention; • Principal leadership; • School emphasis on academic success; and • Safe, orderly, and disciplined school."}, {"section_title": "School Location", "text": "Depending on the country, schools in urban areas may have access to more resources (e.g., museums, libraries, bookstores) than schools in rural areas. In some countries, schools in urban areas may provide for a more supportive environment because of better staffing conditions and the student population coming from economically more advantaged backgrounds (Erberber, 2009;Johansone, 2009). In contrast, in other countries, schools in urban areas are located in neighborhoods with considerable poverty, little community support, and sometimes even in areas of considerable crime and violence (Milam, Furr-Holden, & Leaf, 2010)."}, {"section_title": "School Composition by Student Socioeconomic Background", "text": "Since the Coleman report (Coleman et al., 1966), there has been a great emphasis on how the socioeconomic status of the collective students in the school can influence individual student achievement (Martin, Foy, Mullis, & O'Dwyer, 2013;Rumberger & Palardy, 2005;Sirin, 2005). Research has found that a school with many socioeconomically disadvantaged students can be overwhelmed by a culture of futility, in which education and schooling are viewed as an exercise having little or no future (Agirdag, Van Houtte, & Van Avermaet, 2012). The correlation between lower socioeconomic status and lower achievement may be able to be partially explained by other school factors. For example, in some countries, schools with students from lower socioeconomic status are taught by less qualified teachers (Akiba, LeTendre, & Scribner, 2007;Clotfelter, Ladd, & Vigdor, 2010)."}, {"section_title": "Instruction Affected by Mathematics or Science Resource Shortages", "text": "The extent and quality of school resources also are critical for quality instruction (Greenwald, Hedges, & Laine, 1996;Lee & Barro, 2001;Lee & Zuze, 2011). These may include resources as basic as well-trained teachers or adequate classroom space and other school facilities (Schneider, 2002). Results from TIMSS indicate that students in schools that are well resourced generally have higher achievement than those in schools where shortages of resources affect the capacity to implement the curriculum. Two types of resources-general and subject-specific-affect curriculum implementation. General resources include teaching materials, supplies, school buildings and grounds, heating/ cooling and lighting systems, classroom space, audio-visual equipment such as electronic white boards and projectors, and computers (including tablets such as iPads). Subject-specific resources for mathematics and science may include computers and computer software, calculators, laboratory equipment, and instructional materials."}, {"section_title": "Teacher Availability and Retention", "text": "The retention of well-prepared mathematics and science teachers is especially important in countries where there is a scarcity of teachers in these fields. TIMSS studies and other research have shown that in some countries it can be difficult for schools to recruit mathematics and science teachers (Ingersoll & Perda, 2010). TIMSS 2011 results showed higher achievement for schools that provide good working conditions for teachers. A manageable workload, adequate facilities, and the availability of instructional materials are important ingredients to fostering productive working conditions and promoting teacher satisfaction (Johnson, 2006;Johnson, Kraft, & Papay, 2012). In addition, a positive school environment can lead to greater teacher job satisfaction and self-efficacy, which in turn can increase student learning (Caprara, Barbaranelli, Steca, & Malone, 2006). Schools can support teachers and increase retention by providing competitive salaries, a reasonable number of teaching hours, adequate workspace, and good equipment. While the physical conditions of the school are important, the social conditions of the school can be essential to retaining teachers and fostering student achievement. Important social factors in a school include a positive school culture, collaboration among teaching staff, and the leadership of the principal (Johnson et al., 2012). The transition from university to a school teaching position can be difficult. Consequently, in many countries a large percentage of new teachers leave the profession after only a few years of teaching (APPA, 2007;Guarino, Santibañez, & Daley, 2006;Hancock & Scherff, 2010). The extent to which schools take an active role in the acculturation and transition of new teachers may be important for maintaining a stable teaching force. Mentoring programs, modeling of good teacher practice by peers, and induction programs designed by experienced teachers within the school may be important aids to the beginning teacher (Moskowitz & Stephens, 1997;Tillmann, 2005)."}, {"section_title": "Principal Leadership", "text": "Although often removed from classroom teaching, research has shown that a principal can affect student achievement. A characteristic of a successful principal is being able to articulate the mission of the school (Witziers, Bosker, & Krüger, 2003). As such, an effective school leader brings coherence to the \"complexities of schooling\" by aligning the structure and culture of a school with its core purpose (DuFour, Eaker, & DuFour, 2005). This includes guiding the school in setting directions and seeking future opportunities, monitoring that the school's goals are met, as well as building and sustaining an effective learning environment and a positive school climate. Successful principals often are involved in guiding the teaching process as instructional leaders and ensuring that teachers receive the necessary training and development to produce high achievement among the students (Robinson, Lloyd, & Rowe, 2008). Within the constraints of the educational system, it is up to the principal to ensure that the instructional time, and in particular the time devoted to mathematics and science, is sufficient for the purposes of curriculum implementation. It is also up to the principal to oversee school-level instructional policies, such as grouping arrangements."}, {"section_title": "School Emphasis on Academic Success", "text": "Overall, the success of a school also can be attributable to a school's emphasis on academic success, or the school's expectation of academic excellence. TIMSS 2011 results showed an association between academic achievement and the school emphasis on academic success, a construct based on the literature on academic optimism (Hoy, Tarter & Hoy, 2006;McGuigan & Hoy, 2006;Wu, Hoy, & Tarter, 2013). Indicators of school emphasis on academic success include school administrators' and teachers' expectations for successful curriculum implementation and student achievement, parental support for student achievement, and the student's desire to achieve. Research also has found that teacher collaboration can increase student learning (Goddard, Goddard, & Tschannen-Moran, 2007;Wheelan & Kesselring, 2005). Teachers who discuss their work with colleagues and collaborate in planning and implementing lessons usually feel less isolated and are less likely to leave teaching (Johnson, Berg, & Donaldson, 2005).The collective education of a school's teachers also can be essential to its academic success. From as early as first grade, research has linked the collective teacher education in mathematics in a school to student achievement (Croninger, Rice, Rathbun, & Nishio, 2007), suggesting that collaboration among teachers with strong educational backgrounds can create an emphasis on academic success within the school and facilitate the implementation of the curriculum. Collective efficacy among the teachers of the school and general trust that faculty members have for parents and students are additional attributes of a well-functioning school (Hoy et al., 2006;McGuigan & Hoy, 2006;Wu et al., 2013). Schools that encourage and welcome parental involvement are more likely to have highly involved parents than schools that do not make an effort to keep parents informed and participating (Jeynes, 2005). High levels of parental involvement can improve student achievement, as well as students' overall attitude toward school (Dearing, Kreider, & Weiss, 2008;Jeynes, 2005;Jeynes, 2007;Taylor, Pearson, Clark, & Walpole, 2000). In effective schools, the principal and teachers collaborate to ensure that the curriculum is appropriately implemented in the classrooms. In addition to testing and value-added models, research has found that classroom observations and student surveys can provide important information about the effectiveness of teaching practices (Bill & Melinda Gates Foundation, 2013)."}, {"section_title": "Safe, Orderly, and Disciplined School", "text": "Respect for individual students and teachers, a safe and orderly environment, and constructive interactions among administrators, teachers, parents, and students all contribute to a positive school climate and lead to higher student achievement (Greenberg, Skidmore, & Rhodes, 2004). The sense of security that comes from having few behavioral problems and little or no concern about student or teacher safety at school promotes a stable learning environment. A general lack of discipline, especially if students and teachers are afraid for their safety, does not facilitate learning and is associated with lower academic achievement (Milam et al., 2010;Stanco, 2012). Schools where there are clear rules and more fairness have atmospheres of greater discipline and safety (Gottfredson, Gottfredson, Payne, & Gottfredson, 2005). Bullying among students is a threat to the school learning environment. Bullying is aggressive behavior that is intended to harm students who are physically or psychologically less strong, and takes a variety of forms ranging from name calling to inflicting physical harm. Bullying causes distress to victims, leads to low self-esteem, and makes victims feel like they do not belong (Glew, Fan, Katon, & Rivara, 2008), and research shows that bullied students are less likely to achieve in school (Glew et al., 2008;Rothon, Head, Klineberg, & Stansfeld, 2011). With the prevalence of the Internet, cyberbullying is a new form of bullying that unfortunately appears to be common among students, and, like other bullying, leads to low self-esteem, distress, and poor achievement (Mishna, Cook, Gadalla, Daciuk, & Solomon, 2010;Tokunaga, 2010). Unlike bullying, the process of cyberbullying can be shrouded in a cloud of anonymity for the Internet bully."}, {"section_title": "Classroom Contexts", "text": "Because most of the teaching and learning in school takes place in the classroom, successful learning is influenced by the classroom environment and instructional activities. TIMSS 2015 focuses on the following proven practices that improve teaching and learning: "}, {"section_title": "Teacher Preparation and Experience", "text": "The preparation and competence of teachers is critical (Darling-Hammond, 2000;Hill, Rowan, & Ball, 2005), and prospective teachers need coursework to gain knowledge in the subjects that they will teach and to understand about how students learn, as well as to learn about effective pedagogy in teaching mathematics and science. In mathematics especially, students have been shown to benefit from teachers who have extensive coursework in the subject (Wayne & Youngs, 2003). In addition to teacher education and training, teacher experience is essential, and the first years of teaching experience are especially important for teacher development (Harris & Sass, 2011;Leigh, 2010). However, research also has found that teachers continue to develop after five years of experience, and that this development can positively affect student achievement (Harris & Sass, 2011). Content-focused professional development also is important for fostering student achievement in mathematics and science, and exposing the teacher to recent developments within the field. Professional development through seminars, workshops, conferences, and professional journals can help teachers increase their effectiveness and broaden their knowledge (Blank & de las Alas, 2009;Yoon, Duncan, Lee, Scarloss, & Shapley, 2007). With education, training and experience, teachers should feel prepared and confident to teach the TIMSS mathematics and science topics. Research has shown that teachers' confidence in their teaching skills not only is associated with their professional behavior, but also with students' performance and motivation (Bandura, 1997;Henson, 2002)."}, {"section_title": "TIMSS Mathematics and Science Topics Taught", "text": "A major focus of the implemented curriculum is the extent to which the mathematics and science topics in the TIMSS frameworks are covered in the classroom. TIMSS addresses this question by asking the mathematics and science teachers of the participating students to indicate whether each of the topics tested has been covered in class in current or previous years, as well as the percentage of time in class devoted to each of the TIMSS mathematics and science content domains."}, {"section_title": "Classroom Instructional Resources and Technology", "text": "A growing aspect of instruction is the use of technology in the classroom, and teachers' familiarity and comfort with technology is increasingly important. Teachers' decisions to use technology in the classroom can result from their beliefs, attitudes, and comfort levels, as well as access to training and materials (Mueller, Wood, Willoughby, Ross, & Specht, 2008;Russell, Bebell, O'Dwyer, & O'Connor, 2003). Computers, tablets such as iPads, and the Internet provide students tools to explore concepts in depth, trigger enthusiasm and motivation for learning, enable students to learn at their own pace, and provide students with access to vast information sources. Besides giving students access to the Internet, computers can serve a number of other educational purposes. At the classroom level, some schools are well-equipped with resources so that instruction can be delivered with the support of digital projectors or interactive whiteboard technology. At the student level, while initially limited to learning drills and practice, now computers are used in a variety of ways including tutorials, simulations, games, and applications. Software enables students to pose their own problems, and explore and discover mathematics and scientific properties on their own. Computer software for modeling and visualization of ideas can open a whole new world to students and help them connect these ideas to their language and symbol systems. Instructional video games and interactive simulations have been shown to engage students in mathematics and science, and be associated with student learning and achievement (Kebritchi, Hirumi, & Bai, 2010;Vogel et al., 2006). For computers to be integrated effectively into instruction, teachers have to feel comfortable using them and receive adequate technical and pedagogical support. Nonetheless, research has confirmed the positive effects of the use of computer technology in the classroom on mathematics achievement in particular (Li & Ma, 2010), and student learning in general (Liao & Chen, 2007;Tamim, Bernard, Borokhovski, Abrami, & Schmid, 2011). The nascent research on the effectiveness of instruction using mobile devices like tablets has shown primarily mixed results (Carr, 2012;Looi et al., 2011); the right fit between the technology, the software, and the instruction is essential for implementation. Calculator use varies widely among, and even within, countries. Many countries have policies regulating access to and use of calculators, especially at the earlier grade levels. Calculators can be used in exploring number recognition, counting, and the concepts of larger and smaller. They can allow students to solve numerical problems faster by eliminating tedious computation and thus become more involved in the learning process. How best to make use of calculators, and what role they should have, continue to be questions of importance to mathematics curriculum specialists and teachers. Research has found that calculator use was positively related to achievement when the calculator was used both during instruction and testing. However, mixed results were found when the calculator was not included as part of the testing process (Ellington, 2003). Overall, students who use calculators tend to have better attitudes towards mathematics than students who do not use calculators (Ellington, 2003;Hembree & Dessart, 1986). With the increasing functionality and accessibility of digital devices such as computers, tablets, and smart phones, the use of handheld calculators may be decreasing as students increasingly use applications to perform the calculations once done only on a calculator."}, {"section_title": "Instructional Time", "text": "At the school level, the relative emphasis and amount of time specified for mathematics, science, and other subjects up through various grade levels can greatly affect the opportunities to learn. Results from TIMSS show that there is variation between countries in the intended instructional time prescribed by the curriculum and the actual time of implementation in the classroom. On average, however, there is very close agreement between the curriculum guidelines and teachers' reports about the implementation. Research has shown that it is especially important that instructional time be used effectively toward the learning goals and not spent on secondary activities unrelated to the instructional content. Homework is one way many teachers extend instruction and evaluate student learning. The amount of homework assigned for mathematics and science varies both within and across countries. In some countries, homework is assigned typically to students who need it the most. In other countries, students receive homework as an enrichment exercise. Strong students may spend less time on homework because they use their time more efficiently (Trautwein, 2007;Won & Han, 2010). For these reasons, it has been argued that the effect of homework may be better encapsulated by measures of homework frequency than homework time (Trautwein, 2007). In addition, there is evidence homework is more effective for older students and higher achieving students (Hattie, 2009)."}, {"section_title": "Instructional Engagement", "text": "According to McLaughlin et al. (2005), student content engagement focuses the student's \"in-the-moment\" cognitive interaction with the content. \"Learning occurs through the cognitive engagement of the learner with the appropriate subject matter knowledge\" (McLaughlin et al., 2005, p.5). Engagement can take place when students listen to the teacher, conduct lab experiments, or solve a mathematics problem. Engagement has been conceptualized as the idea that a student's \"in-the-moment\" mindset is torn between engagement with instruction and distractions that are unrelated to the topics in the class (Yair, 2000). The challenge for the teacher is to use effective methods of instruction to maintain student engagement in the content, activating the students cognitively Lipowsky et al., 2009). A well-managed classroom and a supportive classroom environment can facilitate this engagement process (Klieme et al., 2009;Lipowsky et al., 2009). Research has shown that effective classroom management allows for better engagement with teaching and learning, and higher achievement outcomes as it focuses the class and instructional time on the topic (Fauth et al., in press;Lipowsky et al., 2009;Marzano, Marzano, & Pickering, 2003;Wang, Haertel, & Walberg, 1993). Effective teachers are strong classroom managers, who build trust with the students and limit disruptions to the instruction (Stronge, Ward, & Grant, 2011). Teachers can be strong classroom managers by ensuring that rules are clear, taking effective disciplinary action, building optimal studentteacher relationships, and maintaining an alert and objective mindset during instruction (Marzano et al., 2003). Effective teachers are able to create an optimal classroom environment by providing clear purpose and \"strong guidance\" for the classroom while encouraging cooperation among the students and an environment of respect between students as well as between students and the teacher (Marzano et al., 2003). Supportive teacher-student relationships are important not only to foster achievement (Cornelius-White, 2007;Marzano et al., 2003), but also to increase student participation as well as student motivation and interest to learn the subject (Cornelius-White, 2007;Fauth et al., in press). Motivation can be facilitated, according to self-determination theory (Deci & Ryan, 1985), by creating an environment that fosters a sense of relatedness, competence, and autonomy. A classroom environment that is overly controlling can stifle student motivation because it removes the student's sense of autonomy (Niemiec & Ryan, 2009). Teachers can nurture the development of student motivation in a subject by creating an environment that allows students to work autonomously, while providing support, guidance, and positive feedback (Ryan & Deci, 2000). A socially welcoming school environment or classroom also can provide a sense of relatedness by giving students a sense of belonging (Goodenow & Grady, 1993). Teachers can create this supportive environment by providing positive feedback, listening and responding to students' questions, and being empathetic to students' needs (Reeve, 2002). Students are more engaged in student-centered learning, when they are working individually or with their peers rather than listening to a teacher lecture or watching a video (Shernoff, Csikszentmihalyi, Schneider, & Shernoff, 2003;Yair, 2000). An effective teacher ensures that students are actively involved in their own learning process. Peer-tutoring, small group work, and peer mentoring are effective strategies that promote student engagement and are linked to achievement (Hattie, 2009;Springer, Stanne, & Donovan, 1999). When comparing cooperative, competitive, and individualistic learning models, research points to the effectiveness of cooperative learning over competitive and individualized learning, although competitive learning does produce better results than individualized learning (Roseth, Johnson, & Johnson, 2008). Successful teachers engage students in new content by linking the new material and concepts to the students' prior knowledge and understanding (Kleime et al., 2009;McLaughlin et al., 2005). Concept mapping (Nesbit & Adesope, 2006) and advance organizers (Hattie, 2009;Stone, 1983) are two proven strategies for linking prior learned concepts to new concepts. Students also are more engaged when they are challenged and face greater cognitive demands (Shernoff et al., 2003;Yair, 2000). However, the challenges of the tasks should be perceived to be attainable for the students. In this respect, effective teaching is setting challenging yet attainable goals for each student and supporting the students in reaching the goals (Hattie 2009;Klein, Wesson, Hollenbeck, & Alge, 1999). In setting goals, it is important that students understand the process of achievement, what outcome is expected, and why the goal is important for the learning process (Hattie, 2009;Martin, 2006). Teachers can make their expectations for the outcomes clear through strategies that include mastery learning (Kulik, Kulik, & Bangert-Drowns, 1990) and worked examples (Crissman, 2006). Effective teachers also find means to emphasize the relevance of the learning task (Yair, 2000). A learning cycle that focuses on spaced practice, in which students are exposed to the content in different ways on multiple occasions over time, increases retention of the learned content or skill (Donovan & Radosevich, 1999;Hattie, 2009). In mathematics, effective teaching strategies include small group learning (Springer et al., 1999), peer instruction (Baker, Gersten, & Lee, 2002), problembased learning (Haas, 2005), and technology-aided instruction (Haas, 2005). In science, research has shown higher achievement to be associated with the increased frequency of doing hands-on activities in science, student discussion of measurements and results from hands-on activities, and students working with others on a science activity or project as well as with increased frequency of reading textbooks and writing longer answers about science (Braun, Coley, Jia, & Trapani, 2009). Similar to pedagogical theory in other domains, strategies for effective teaching in science include linking new content to students' prior knowledge and interests, collaborative learning strategies, teacher-student questioning interaction, and inquiry-based instruction (Schroeder, Scott, Tolson, Huang, & Lee, 2007). The effectiveness of the science laboratory sessions often depends on how the teacher structures the student learning experience, and how the laboratory experience dovetails with classroom instruction (Singer, Hilton, & Schweingruber, 2006)."}, {"section_title": "Classroom Assessment", "text": "Teachers have a number of ways to monitor student progress and achievement. TIMSS results show that teachers devote a fair amount of time to student assessment, whether as a means of gauging what students have learned to guide future learning, or for providing feedback to students, teachers, and parents. The frequency and format of assessment are important indicators of teaching and school pedagogy, and research has shown that frequent testing can lead to improving student achievement (Başol & Johanson, 2009). Informal assessments during instruction help teachers identify needs of particular individuals, evaluate the pace of the presentation, and adapt the instruction. Formal tests, both teacher-made and standardized assessments, typically are used to make important decisions about the students, such as grades, or about schools for accountability purposes. Teachers use a variety of formats and test a wide range of contents and cognitive skills. The types of questions included in tests and quizzes can send strong signals to students about what is important."}, {"section_title": "Student Characteristics and Attitudes Toward Learning", "text": "An important topic in educational research is the relationship between student attitudes toward a subject and students' academic achievement. In policy circles, there is debate around whether helping students develop positive attitudes toward mathematics and science should be an explicit goal of the curriculum. In educational research, there are numerous theories on how student motivation and confidence can lead to engagement and academic achievement. TIMSS 2015 includes information about the following: • Student readiness to learn; • Student motivation; • Student self-concept; and • Student characteristics."}, {"section_title": "Student Readiness to Learn", "text": "In order for students to engage in a task or a goal, it is crucial that they are physiologically ready and possess the prerequisite knowledge to engage in the content (McLaughlin et al., 2005). Results from TIMSS 2011 indicated that many students, even in the most developed countries, struggle to pay attention in class due to hunger and sleep deprivation. Research has identified nutritional problems to be a barrier to student learning, with school breakfast programs suggested as a possible solution (Taras, 2005). Likewise, sleep deprivation has been found to be related to lower achievement (Dewald, Meijer, Oort, Kerkhof, & Bögels, 2010), and may be associated with the early start times at certain schools (Perkinson-Gloor, Lemola, & Grob, 2013), as well as the socioeconomic status of the student (Buckhalt, 2011). In addition to physiological readiness, students also need to have the prerequisite knowledge to engage with the content because \"every new thing that a person learns must be attached to what the person already knows\" (McLaughlin et al., 2005, p. 5). In other words, for students to learn, they need to be able to connect the new content to prior knowledge."}, {"section_title": "Student Motivation", "text": "In addition to students' readiness to learn, their motivation to learn is essential to academic success. The source of academic motivation and how it can be facilitated within the school, classroom, and home has been a recurrent area of research (Bandura, 1997;Csikszentmihalyi, 1990;Deci & Ryan, 1985). Students have different levels of motivation for each distinct task and subject area. Most of the literature separates motivation into two distinct constructs: intrinsic motivation and extrinsic motivation. Intrinsic motivation is an \"energizer of behavior\" (Deci & Ryan, 1985, p.32). Students who are intrinsically motivated to learn mathematics or science find the subject to be interesting and enjoyable (Deci & Ryan, 1985). Although it is theorized that all human beings are born with intrinsic motivation to learn, the home and school can either facilitate or suppress this inner motivation. Extrinsic motivation refers to the drive that comes from external rewards like praise, career success, money, and other incentives. Research consistently shows that intrinsic motivation is more closely related to achievement than extrinsic motivation (Becker, McElvany, & Kortenbruck, 2010;Vansteenkiste, Timmermans, Lens, Soenens, & Van den Broeck, 2008). Indeed, some research points to external rewards dampening a student's intrinsic motivation (Deci, Koestner, & Ryan, 1999). Nevertheless, most students do not have an intrinsic motivation to learn all subjects, and therefore fostering motivation through extrinsic rewards may be a necessary course of action for a teacher or a parent. In these cases, research has found that successful students internalize their extrinsic motivation to increase performance, in an environment that cultivates feelings of relatedness, competence, and autonomy (Ryan & Deci, 2000;Deci & Moller, 2005)."}, {"section_title": "Student Self-Concept", "text": "Students' perceived competence in a subject is linked to their subject specific self-concept. If students believe that academic tasks are outside the scope of what can be completed successfully, students will view the exercise as futile, and this will affect their motivation. In contrast, if students are confident, they are more likely to persevere to successfully complete the school task (Bandura, 1997). Self-concept is often estimated relative to students' peers or experiences, and is a multi-dimensional construct; that is, students have distinct mathematics and science self-concepts (Marsh & Craven, 2006)."}, {"section_title": "Student Characteristics", "text": "For decades there has been concern about girls lagging behind in mathematics and science. Currently, the majority of research shows the achievement difference between boys and girls in mathematics and science to be minimal (Coley, 2001;Lindberg, Hyde, Peterson, & Linn, 2010;McGraw, Lubienski, & Strutchens, 2006). TIMSS has shown that there is no large overall difference in average mathematics and science achievement between boys and girls across participating countries, although the situation varies from country to country. "}, {"section_title": "Overview", "text": "The TIMSS 2015 international assessment of student achievement at the fourth and eighth grades each include a large number of mathematics and science items (about 350 to 450) together with sets of questionnaires that gather information on the educational and social contexts for achievement. Central to TIMSS' mission is the measurement of student achievement in mathematics and science in a way that does justice to the breadth and richness of these subjects as they are taught in the participating countries and that monitors countries' improvement or decline by tracking trends in student performance from one assessment cycle to the next. This requires an assessment that is wide ranging in its coverage of mathematics and science and innovative in its measurement approach. Conducted on a four-year cycle, with each assessment linked to the one that preceded it, TIMSS provides regular and timely data for educators and policy makers on trends in students' mathematics and science achievement. In addition to measuring trends in achievement at the fourth and eighth grades, administering TIMSS at the fourth and eighth grades every four years provides the opportunity to monitor achievement changes within a grade cohort, as the fourth grade students in one TIMSS cycle become the eighth grade students in the next cycle. The sixth in the TIMSS series of assessments, TIMSS 2015 is the first TIMSS assessment since 1995 to be accompanied by TIMSS Advanced, an international assessment of advanced mathematics and physics at the end of secondary schooling for students with advanced preparation in these subjects (Mullis & Martin, 2013). Participating in TIMSS Advanced 2015 as well as in TIMSS 2015 at the fourth and eighth grades provides data on student achievement in mathematics and science spanning the entire primary and secondary education system. Further, the TIMSS fourth grade mathematics and science assessment data complement PIRLS, IEA's Progress in International Reading Literacy Study, which assesses reading comprehension at the fourth grade every five years."}, {"section_title": "Student Populations Assessed", "text": "TIMSS assesses the mathematics and science achievement of students in their fourth and eighth years of formal schooling. Participating countries may choose to assess one or both populations, according to their policy priorities and resource availability. Because in TIMSS the number of years of formal schooling (four or eight) is the basis for comparison among participating countries, the TIMSS assessment is targeted at the grade levels that correspond to these. The TIMSS target populations are defined as follows. At the fourth grade, the TIMSS target grade should be the grade that represents four years of schooling, counting from the first year of ISCED Level 1. At the eighth grade, the TIMSS target grade should be the grade that represents eight years of schooling, counting from the first year of ISCED Level 1. ISCED is the International Standard Classification of Education developed by the UNESCO Institute for Statistics and provides an international standard for describing levels of schooling across countries (UNESCO Institute of Statistics, 2012). The ISCED system describes the full range of schooling, from preprimary (Level 0) to doctoral study (Level 8). ISCED Level 1 corresponds to primary education or the first stage of basic education. Four years after this would be the target grade for fourth grade TIMSS, and is the fourth grade in most countries. Similarly, eight years after the first year of ISCED Level 1 is the target grade for eighth grade TIMSS, and is the eighth grade in most countries. However, given the cognitive demands of the assessments, TIMSS wants to avoid assessing very young students. Thus TIMSS recommends that countries assess the next higher grade (i.e., fifth grade for fourth grade TIMSS, and ninth grade for eighth grade TIMSS) if, for fourth grade students, the average age at the time of testing would be less than 9.5 years, and, for eighth grade students, less than 13.5 years. Reporting Student Achievement TIMSS 2015 will provide a comprehensive picture of the mathematics and science achievement of fourth and eighth grade students in each participating country. This will include achievement in each of the content and cognitive domains (as defined in Chapters 1 and 2) as well as overall mathematics and science achievement. Consistent with the goal of a comprehensive description of mathematics and science achievement, the complete TIMSS 2015 assessment consists of a large pool of mathematics and science questions (known as items) at each grade level. However, to keep the assessment burden on any one student to a minimum, each student is presented with only a sample of the items, as described in the next section. Following data collection, student responses are placed on common mathematics and science scales at each grade level to provide an overall picture of the assessment results for each country. One of the major strengths of TIMSS is its measurement of trends over time in mathematics and science achievement. The TIMSS achievement scales provide a common metric on which countries can compare students' progress in mathematics and science from assessment to assessment at the fourth and eighth grades. The TIMSS mathematics and science achievement scales were established in 1995, separately for each subject and for fourth and eighth grades, so that 100 points on the scale was equal to one standard deviation across all of the countries that participated in TIMSS 1995, and the scale midpoint of 500 was equal to the international average across those countries. Using items that were administered in both 1995 and 1999 assessments as a basis for linking the two sets of assessment results, the TIMSS 1999 data also were placed on the scale so that countries could gauge changes in students' mathematics and science achievement since 1995. This was done separately for mathematics and science and for fourth and eighth grades. Using similar procedures, the data from TIMSS 2003, TIMSS 2007, and TIMSS 2011 were placed on the TIMSS scale, as will be the data from TIMSS 2015. This will enable TIMSS 2015 countries that have participated in TIMSS since its inception to have comparable achievement data from 1995, 1999, 2003, 2007, 2011, and 2015, and to plot changes in performance over this 20-year period. As previously mentioned, in addition to the achievement scales for mathematics and science overall, TIMSS 2015 will construct scales for reporting relative student performance in each of the mathematics and science content and cognitive domains defined in the TIMSS 2015 Assessment Frameworks. More specifically, in mathematics at the fourth grade there will be three content scales, corresponding to the three content domains-number, geometric shapes and measures, and data display-and four at the eighth grade-number, algebra, geometry, and data and chance. In science, there also will be three content scales at fourth grade-life science, physical science, and earth science-and four at the eighth grade-biology, chemistry, physics, and earth science. The TIMSS 2015 Assessment Frameworks also specify three cognitive domains, knowing, applying, and reasoning, which span the mathematics and science content at both grades. Reporting scales will be constructed for each cognitive domain in mathematics and science at each grade level."}, {"section_title": "TIMSS 2015 Student Booklet Design", "text": "A major consequence of TIMSS' ambitious reporting goals is that many more questions are required for the assessment than can be answered by any one student in the amount of testing time available. Accordingly, TIMSS 2015 uses a matrix-sampling approach that involves packaging the entire assessment pool of mathematics and science items at each grade level into a set of 14 student achievement booklets, with each student completing just one booklet. Each item appears in two booklets, providing a mechanism for linking together the student responses from the various booklets. Booklets are distributed among students in participating classrooms so that the groups of students completing each booklet are approximately equivalent in terms of student ability. TIMSS uses item response theory scaling methods to assemble a comprehensive picture of the achievement of the entire student population of a country from the combined responses of individual students to the booklets that they are assigned. This approach reduces to manageable proportions what otherwise would be an impossible student burden, albeit at the cost of greater complexity in booklet assembly, data collection, and data analysis. To facilitate the process of creating the student achievement booklets, TIMSS groups the assessment items into a series of item blocks, with approximately 10-14 items in each block at the fourth grade and 12-18 at the eighth grade. As far as possible, within each block the distribution of items across content and cognitive domains matches the distribution across the item pool overall. As in the TIMSS 2011 assessment, TIMSS 2015 has a total of 28 blocks, 14 containing mathematics items and 14 containing science items. Student booklets were assembled from various combinations of these item blocks. Following the 2011 assessment, 8 of the 14 mathematics blocks and 8 of the 14 science blocks were secured for use in measuring trends in 2015. The remaining 12 blocks (6 mathematics and 6 science) were released into the public domain for use in publications, research, and teaching, to be replaced by newlydeveloped items for the TIMSS 2015 assessment. Accordingly, the 28 blocks in the TIMSS 2015 assessment comprise 16 blocks of trend items (8 mathematics and 8 science) and 12 blocks of items newly developed for 2015. As shown in Exhibit 11, the TIMSS 2015 mathematics blocks are labeled M01 through M14 and the science blocks S01 through S14. Blocks with labels ending in odd numbers (01, 03, 05, etc.) contain the trend items from the 2011 assessment, as do blocks ending in 06. The remaining blocks with labels ending in even numbers contain the items developed for use for the first time in TIMSS 2015. Fourth grade students are expected to spend, on average, 18 minutes on each item block, and eighth grade students, 22½ minutes. Consequently, the 28 blocks of fourth grade items are estimated to contain almost 8½ hours of testing time and the eighth grade blocks about 10½ hours. From past experience with TIMSS, National Research Coordinators from participating countries agreed that the testing time for any one student should not be increased from previous assessments. Thus, as in the past, the assessment time for each student booklet must fit into 72 minutes for the fourth grade and 90 minutes for the eighth grade. An additional 30 minutes for a student questionnaire also was planned at each grade level. In choosing how to distribute assessment blocks across student achievement booklets, the major goal was to maximize coverage of the framework while ensuring that every student responded to sufficient items to provide reliable measurement of trends in both mathematics and science. A further goal was to ensure that achievement in the mathematics and science content and cognitive domains could be measured reliably. To enable linking among booklets while keeping the number of booklets to a minimum, each block appears in two booklets. In the TIMSS 2015 booklet design, the 28 assessment blocks are distributed across 14 student achievement booklets (see Exhibit 12). The fourth and eighth grade booklet designs are identical, although the fourth grade blocks contain 18 minutes of assessment items and the eighth grade blocks 22½ minutes. Each student booklet consists of four blocks of items: two blocks of mathematics items, and two of science items. In half of the booklets, the two mathematics blocks come first, and then the two science blocks, and in the other half the order is reversed. Additionally, in most booklets two of the blocks contain trend items from 2011 and two contain items newly developed for TIMSS 2015. For example, as may be seen from Exhibit 12, students assigned Booklet 1 complete two blocks of mathematics items, M01 and M02, and two blocks of science items, S01 and S02. The items in blocks M01 and S01 are trend items from TIMSS 2011, while those in M02 and S02 are items new for TIMSS 2015. Similarly, students assigned Booklet 2 complete two science blocks, S02 and S03, followed by two mathematics blocks, M02 and M03. S02 and M02 contain the new items and S03 and M03 the trend items. As summarized in Exhibit 13, each student completes one student achievement booklet consisting of two parts, followed by a student questionnaire. The individual student response burden for the TIMSS 2015 assessment is the same as in 2011-that is, 72 minutes for the assessment and 30 minutes for the questionnaire at the fourth grade, and 90 minutes and 30 minutes, respectively, at the eighth grade. Countries participating in TIMSS aim for a sample of at least 4,500 students to ensure that there are enough respondents for each item. The 14 student booklets are distributed among the students in each sampled class according to a predetermined order, so that approximately equal proportions of students respond to each booklet."}, {"section_title": "Question Types and Scoring Procedures", "text": "Students' knowledge and understanding of mathematics and science are assessed through a necessarily large range of questions in each subject. The fourth grade assessment typically consists of about 350 items (175 in mathematics and 175 in science) and the eighth grade assessment about 450 items (also half in mathematics and half in science). The TIMSS assessments primarily use two item (question) formats: multiple-choice and constructed-response. At least half of the total number of points represented by all the items will come from multiple-choice items. Each multiple-choice item is worth one score point. Constructed-response items generally are worth one or two score points, depending on the nature of the task and the skills required to complete it. In developing assessment items, the choice of item format depends on the mathematics or science being assessed, and the format that best enables students to demonstrate their proficiency."}, {"section_title": "Multiple-Choice Items", "text": "In TIMSS, multiple-choice items provide students with four response options, of which only one is correct. These items can be used to assess any of the behaviors in the cognitive domains. Multiple-choice items allow valid, reliable, and economical measurement of a wide range of content in a relatively short testing time. However, because they do not allow for students' explanations or supporting statements, these items may be less suitable for assessing students' ability to make more complex interpretations or evaluations. In assessing fourth and eighth grade students, it is important that linguistic features of the items be developmentally appropriate. Therefore, the items are written clearly and concisely. The response options also are written succinctly in order to minimize the reading load of the item. The options that are incorrect are written to be plausible, but not deceptive. For students who may be unfamiliar with this test item format, the instructions given at the beginning of the test include a sample multiple-choice item that illustrates how to select and mark an answer."}, {"section_title": "Constructed-Response Items", "text": "For this type of test item students are required to construct a written response, rather than select a response from a set of options. Because they allow students to provide explanations, support an answer with reasons or numerical evidence, draw diagrams, or display data, constructed-response items are particularly well-suited for assessing aspects of knowledge and skills that require students to explain phenomena or interpret data based on their background knowledge and experience. The scoring guide for each constructed-response item describes the essential features of an appropriate and complete response. The guides focus on evidence of the type of behavior the item assesses. They describe evidence of partially correct and completely correct responses. In addition, sample student responses at each level of understanding provide important guidance to those who will be rating the students' responses. In scoring students' responses to constructed-response items, the focus is solely on students' achievement with respect to the topic being assessed, not on their ability to write well. However, students need to communicate in a manner that will be clear to those scoring their responses. In addition, scoring guides are designed to enable, for each item, identification of the various successful, partially successful, and unsuccessful approaches. Diagnosis of common learning difficulties in mathematics and science as evidenced by misconceptions and errors is an important aim of the study. Because constructed-response items constitute an important part of the assessment and are an integral part of the measurement of trends, it is very important for scoring guides to be implemented consistently in all countries and in each data collection year. To ensure consistent application of the scoring guides for trend items in the 2015 assessment, IEA has archived samples of student responses to the TIMSS 2011 assessments from each country; these are used to train scorers in 2015 and to monitor consistent application of the guides for those items appearing in both assessments."}, {"section_title": "Score Points", "text": "In developing the assessment, the aim is to create blocks of items that each provide, on average, about 15 score points at the fourth grade and about 18 score points at the eighth grade. Item blocks contain a variety of item types, including multiple-choice items (1 point each) and constructed-response items (typically 1 or 2 points) that allow for partial as well as full credit. The exact number of score points and the exact distribution of item types per block varies somewhat. Releasing Assessment Material to the Public TIMSS 2015 is the sixth in the TIMSS series of regular four-year studies, and provides data on trends in mathematics and science achievement over a 20-year period, from 1995 through 1999, 2003, 2007, and 2011, to 2015. TIMSS will be administered again in 2019, 2023, and so on into the future. With each assessment, as the international reports are published, many items are released to provide the public with as much information as possible about the nature and contents of the assessment. At the same time, the measurement of trends is safeguarded by keeping secure a substantial proportion of the items. As items are released, new items will be developed to take their place. According to the TIMSS 2015 design, 6 of the 14 assessment blocks in each subject will be released when the assessment results for 2015 are published, and the remaining 8 will be kept secure for use in later assessments. The released blocks will include three blocks containing trend items from 2007, two blocks of trend items from 2011, and one block of items used for the first time in 2015. The released items will be replaced with new items before the next survey cycle, in 2019."}, {"section_title": "TIMSS Numeracy 2015 Assessment Design", "text": "The assessment design for TIMSS Numeracy 2015 consists of 10 blocks of numeracy items (10-15 per block) as shown in Exhibit 14. As the inaugural year for TIMSS Numeracy, all of the items are newly developed for 2015. Two TIMSS Numeracy 2015 item blocks-N02 and N08-will consist of TIMSS 2015 mathematics items-item blocks M02 and M08, respectively, from the fourth grade assessment. The numeracy item blocks will follow the same development guidelines described in the Question Types and Scoring Procedures section with respect to the use of multiple-choice and constructed-response items. Students taking the TIMSS Numeracy assessment are expected to spend, on average, 18 minutes on each item block, similar to the TIMSS fourth grade assessment. Consequently, the 10 blocks of items are estimated to contain 3 hours of testing time. The 10 numeracy blocks are distributed across 5 student achievement booklets, as shown in Exhibit 15, with each booklet consisting of four blocks of numeracy items. To enable linking among booklets while keeping the number of booklets to a minimum, each block appears in two booklets. Similar to the TIMSS fourth grade assessment, the assessment time for each student booklet is 72 minutes, with an additional 30 minutes for a student questionnaire. The TIMSS Numeracy 2015 design calls for the release of 4 of the 10 numeracy item blocks. Among the four released numeracy blocks will be one of the two shared TIMSS 2015 assessment blocks. The released items will be replaced with new numeracy items, including one new TIMSS item block, before the next survey cycle, in 2019."}, {"section_title": "Background Questionnaires", "text": "An important purpose of TIMSS is to identify the procedures and practices that are effective in improving students' learning in mathematics and science. To better understand the contextual factors detailed in Chapter 3 that affect students' learning, TIMSS administers background questionnaires to students, their teachers, and their school principals. In 2015, for the first time the fourth grade TIMSS assessment will include a home questionnaire for students' parents and caregivers that will collect information about students' home backgrounds and early learning experiences. TIMSS also administers curriculum questionnaires to specialists to collect information about educational policies and the national contexts that shape the content and implementation of the mathematics and science curricula across countries. Finally, the TIMSS Encyclopedia provides a more qualitative description of mathematics and science education in the participating countries."}, {"section_title": "Student Questionnaire", "text": "A questionnaire is completed by each student who takes the TIMSS assessment. This questionnaire asks about aspects of students' home and school lives, including basic demographic information, their home environment, school climate for learning, and self-perception and attitudes toward mathematics and science. While some questions are identical in the fourth and eighth grade versions, the language is simplified in the fourth grade version and specific content is altered to be appropriate for the respective grade level. The student questionnaire requires 15-30 minutes to complete."}, {"section_title": "Home Questionnaire (Fourth Grade Only)", "text": "The parents or caregivers of each student taking the TIMSS fourth grade assessment are asked to complete a questionnaire. This questionnaire asks about home resources for literacy and numeracy, early childhood literacy, and numeracy, and science activities, the child's reading and quantitative readiness T I M SS 2 0 1 5 F R A M E W O R K S : when beginning school, parents' attitudes to reading and mathematics, as well as parental education and occupation. This questionnaire requires 15-30 minutes to complete."}, {"section_title": "Teacher Questionnaires", "text": "A teacher questionnaire is completed by the teachers of mathematics and science to the students sampled to take part in the TIMSS testing. This questionnaire is designed to gather information on teacher characteristics as well as the classroom contexts for teaching and learning mathematics and science, and the topics taught in these subjects. In particular, the teacher questionnaire asks about teachers' backgrounds, their views on opportunities for collaboration with other teachers, their job satisfaction, and their education and training as well as professional development. The questionnaire also collects information on characteristics of the classes tested in TIMSS, instructional time, materials, and activities for teaching mathematics and science and promoting students' interest in the subjects, use of computers, assessment practices, and homework. The fourth and eighth grade versions of the questionnaire are similar, with specific content targeted to teachers at the specific grade level. Although the general background questions are parallel across versions, questions pertaining to instructional and assessment practices, content coverage, and teachers' views about teaching the subject matter are tailored toward mathematics or science. Many questions, such as those related to classroom activities are specific to the classes sampled for TIMSS. This questionnaire requires about 30 minutes of teachers' time to complete."}, {"section_title": "School Questionnaire", "text": "The principal of each school participating in TIMSS is asked to respond to this questionnaire. It asks about school characteristics, instructional time, resources and technology, parental involvement, school climate for learning, teaching staff, the role of the principal, and students' school readiness. It is designed to take about 30 minutes."}, {"section_title": "Curriculum Questionnaires", "text": "The National Research Coordinator in each country is responsible for completing the mathematics and science curriculum questionnaire, drawing on the expertise of curriculum specialists and educators. The questionnaire is designed to collect basic information about the organization of the mathematics and science curriculum in each country, and about the content of these subjects intended to be covered up to the fourth and eighth grades. It also includes questions on attrition and retention policies, the local or national examination system, as well as goals and standards for mathematics and science instruction."}, {"section_title": "TIMSS 2015 Encyclopedia", "text": "The TIMSS 2015 Encyclopedia provides context for mathematics and science instruction in the participating countries. Information from the curriculum questionnaire is reported along with a chapter prepared by each country providing information about the countries' education systems and policies, including emphasis placed on mathematics and science. In addition, each country summarizes its mathematics and science curriculum including information about instructional time and the use of instructional materials, equipment, and technology. Teachers' educational training and professional development also is described, as well as information about examinations and assessments. Yoon, K.S., Duncan, T., Lee, S.W.-Y., Scarloss, B., & Shapley, K.L. (2007). Reviewing the evidence on how teacher professional development affects student achievement (Institute of Education Sciences Report No. REL 2007-No.033). Washington, DC: U.S. Department of Education. T I M SS 2 0 1 5 F R A M E W O R K S : APPENDIX A TIMSS (Trends in International Mathematics and Science Study) is the largest ongoing undertaking of IEA, an international cooperative of national research institutions and government agencies that has been conducting studies of crossnational achievement since 1959. With a Secretariat in Amsterdam, a large Data Processing and Research Center in Hamburg, and more than 60 member countries, IEA is headed by Executive Director Hans Wagemaker. It takes extreme dedication on the part of many individuals around the world to make TIMSS a success. TIMSS is a truly global, cooperative enterprise made possible by the work of individuals around the world on overall project tasks and within each of the participating countries. The TIMSS & PIRLS International study Center at Boston College, led by Executive Directors Ina V.S. Mullis and Michael O. Martin, is responsible for the direction and management of TIMSS, together with PIRLS (Progress in International Reading Literacy Study). To carry out these two ambitious international studies, the TIMSS & PIRLS International Study Center works closely with the IEA Secretariat in Amsterdam and the IEA Data Processing and Research Center in Hamburg. Also, Statistics Canada is responsible for school and sampling activities and Educational Testing Service in Princeton, New Jersey provides guidance on psychometric methodology. In particular, a great deal of the credit for TIMSS is due the National Research Coordinators designated by the participating countries to be responsible for the complex tasks involved in implementing the studies in their countries. With each new assessment cycle of a study, one of the most important tasks is to update the assessment frameworks. Updating the TIMSS assessment frameworks for 2015 began in September of 2012, and has involved extensive input and reviews by individuals at the TIMSS & PIRLS International Study Center, the IEA, the TIMSS 2015 National Research Coordinators, and the two TIMSS expert committees: the TIMSS 2015 Science and Mathematics Item Review Committee, and the TIMSS 2015 Questionnaire Item Review Committee. Of all the individuals around the world that it takes to make TIMSS a success, the intention here is to specifically acknowledge some of those persons who had particular responsibility and involvement in developing and producing the TIMSS 2015 Assessment Frameworks. "}, {"section_title": "TIMSS 2015 Science and Mathematics Item Review Committee", "text": "The Science and Mathematics Item Review Committee (SMIRC), comprised of internationally recognized mathematics and science experts, reviewed and recommended updates for the TIMSS 2015 Mathematics and Science Frameworks. The SMIRC also reviews the TIMSS 2015 items at key points in the development process. "}]