[{"section_title": "Introduction", "text": "Between 1972 and 2004, the proportion of students who expected to earn at least a bachelor's degree increased from 50.2% to 74.9%. More significantly, the proportion of students in this group who expected to obtain a graduate or professional degree more than tripled from 12.6% in 1972 to 38.3% in 2004 (Ingels & Dalton, 2008). Aside from self-expectations, the US Bureau of Labor Statistics (2017) showed that the proportion of students who went to college also increased with two in every three high school graduates enrolled in a college in 2016. This trend of \"college-for-all\" emphasises the norm that students can and should attend college, even if they are ill prepared for it (Rosenbaum, 1997). The same trend, however, also led to more than 6.2 billion USD spent for students who did not return for their second year of college (Schneider, 2010). Given this trend of more students expecting to enrol in college but fewer than these actually graduating, could students' stability of self-expectations (rather than just their expectations at a particular point in time) better predict their eventual educational attainment? In this research, the term self-expectation refers to the student's judgement of how far in school he or she will go. For instance, some students believe they will terminate their education by high school; others anticipate they will complete a doctoral degree. More than showing how expectation stability affects educational outcomes, the research also explores how expectations at different points in time (i.e., earlier or later expectations) differentially influence these outcomes. Could earlier expectationsthose made during high schoolbe more predictive because they can substitute for better motivation at an earlier point in time? Or could later expectationsthose that are judged while in collegebe more predictive because students have more realistic expectations based on their past academic experiences? As the effects of stable, unstable, and later expectations are investigated, the article also probes the sociodemographic characteristics influencing the stability of expectations. Thus, the research poses three questions: (1) How does expectation stability predict later educational outcomes? (2) How do earlier or later expectations predict these same outcomes? (3) How do the sociodemographic details differ among the expectation stability groups? In this research, the primary objective is to provide evidence for the longer term effects of stable and later expectations in the context of a college-for-all atmosphere in the United States. It is important to understand how these expectationsmore than just time-specific onesare predictive of long-term outcomes. The secondary and more practical motivation is to understand at which time points students' high or low expectations can have a more critical influence on their outcomes. By knowing the effects of earlier and later expectations, educators may also know at which points to encourage students to have high expectations or at least protect them from thinking about low expectations."}, {"section_title": "Data and methods", "text": "Data for this research were collected over four waves of the Education Longitudinal Study of 2002(ELS:2002, with a sample of US high school students who were in 10th grade during 2002. This dataset obtained from the National Center for Education Statistics included 15,244 students from 751 schools. After the first survey, the participants took surveys in 2004 when they were high school seniors, in 2006 when they would have been in college, and in 2012 when their eventual life situations could be discerned. In all four waves from 2004 to 2012, participants were asked about their expectations for how far they will go in school. Missing data from ELS:2002 came from at least two sources: the \"Don't Know\" response to the question on expectations, and attrition from the panel. Although there were at least 80% of respondents per wave, the cumulative effect of missing data was substantial since 35% have missing data in at least one of the survey waves. Although some students had \"Don't Know\" as a response, this was considered as a missing value since it failed to carry any meaning about having either high or low expectations. Following Johnson and Reynolds (2013), data were imputed for those who were unsure of their expectations. Appendix 1 shows the patterns of missingness, particularly in terms of how those with complete data differed from those with missing data in each wave of the ELS:2002. While providing further justification for imputation, these patterns also show one limitation of the sample, specifically that those with missing data also had lower standardised maths test scores and socioeconomic-status index. To handle missing data, I first tested if the data were missing completely at random through STATA/MP's Little's test of missing value patterns (Li, 2013). When testing for the missingness of the independent variables, Little's test gave a value of χ 2 62.75 (p < 0.001), denoting that the data were not missing completely at random. When dependent variables were added, Little's test gave a value of χ 2 13,235.32 (p < 0.001). Small p values suggest that the missingness of the variables was not random and that missing data points from a wave could be overrepresented in particular categories. After the test for the data's missingness, I used the multiple imputation scheme in STATA/MP through the imputation by chained equation (ICE) command. The reported regression estimates were the average coefficients from analysing five different datasets with imputed values for those with missing data (Royston, 2004). Compared to listwise deletion, it is preferable to use multiple imputation since it retains observations with incomplete information and protects the data from bias owing to selective attrition (Saunders et al., 2006)."}, {"section_title": "Dependent variables", "text": "To understand how stable, unstable, and later expectations affected later educational outcomes, I used two dependent variables that approximate these salient consequences. The first variable measuring college enrolment was a dichotomous variable coded 1 if a student was enrolled in college in 2006, and 0 otherwise. The second variable measured whether the participant obtained at least a bachelor's degree 2012, that is, 10 years after they were in 10th grade. It was coded 1 if the student earned a bachelor's degree, a post-baccalaureate or master's degree, or a doctoral degree by 2012, and 0 if the person had no 4-year post-secondary credentials. It was possible that a person was not enrolled in a 4-year degree in 2006 but still obtained a bachelor's degree. This may either be because the person had been unable to take the survey that year or because the person had gone back to college without being in college in 2006."}, {"section_title": "Independent variables", "text": "Independent variables for this study measured stable, unstable, and later expectations. The original data asked students how high they thought their educational attainment would be, and it had seven categories for expectations: less than high school, high school graduation, complete a 2-year college, not complete a 4-year college, graduate from college, obtain a master's degree, or obtain a PhD, MD, or other advanced degrees. This variable was asked during the first three waves of the ELS:2002, even when students were already in college. It did not, however, merely mirror their reality since some students may not be enrolled in college but still expect to attend and complete a degree in a 4-year institution. For simplicity, these were grouped into three categories with students (1) not expecting a 4-year degree, (2) expecting a bachelor's degree, or (3) expecting a graduate degree inclusive of Master's, PhD, or MD. Data for all waves were recoded into these three categories. For the base year, Table 1 shows the distribution of students' expectations. From the 15,244 students, 17% did not expect to graduate from a 4-year college, 35% expected to graduate from college, 38% expected to pursue graduate studies, and 10% did not know how far they would go in college. To measure the stability or instability of expectations, six categories were created to approximate movement of expectations from the first three waves (2002,2004,2006). Stable high were those who had stable college and graduate degree expectations, while stable low were those who in all three waves did not expect to attain a 4-year degree. Risers were those who started out with low expectations but expected higher expectations subsequently, while fallers were those who initially had high expectations but eventually reduced their expectations. Volatile high means the student had high expectations in 2002 and 2006 but had lower expectations in 2004, while volatile low means that the student had low expectations in 2002 and 2006 but had higher expectations in 2004. When logistic regressions were done, volatile high was used as reference group because it provided a good comparison for those that either positively or negatively predicted the dependent variables. The same variable had been used as reference group in other published data analyses (see Bozick et al., 2010). The bottom part of Table 2 shows the percentage of the sample belonging to each group. Stable high expectations were found among 31.12% of the sample, 24.88% were considered fallers, and 17.63% were risers. Those with volatile high, volatile low, and stable low expectations represented 10.68%, 7.15%, and 8.53% of the sample, respectively.  "}, {"section_title": "Control variables", "text": "Since educational attainment could be influenced by factors aside from expectations, these needed to be controlled and accounted for. Thus, I included variables that controlled for academic, socioeconomic, and demographic variations. Since expectations and achievement may be affected by prior academic achievement, the students' 10thgrade standardised maths test score was used as one control variable. It had a mean value of 50.72, and minimum and maximum values of 10 and 90. To control for the effect of socioeconomic placement, the student's base year SES data were used. The SES variable was a composite variable consisting of parents' educational attainment, occupation, and combined family income. This was the standardised measure of the family's socioeconomic position designed by the National Center for Educational Statistics. Table 1 shows the mean at 0.04 with a standard deviation of 0.74. Other demographic details that could have affected expectations and subsequent attainment were gender and ethnicity. The sample was almost equally divided in terms of gender with 49.71% Males. There were also 56.95% Whites, 13.25% Blacks, 14.54% Hispanics, 9.58% Asians, and 5.67% Native Americans and Pacific Islanders."}, {"section_title": "Analytic strategy", "text": "Two sets of logistic regressions were performed on the dependent variables. The first set measured the effect of expectation stability or instability on educational outcomes, while the second set measured the effect of earlier or later expectations on the same outcomes. The full logistic regression model can be expressed as follows, where f i is the log odds of either enrolling in a 4-year college or graduating from college. P 1 is the probability of the binomial outcome (e.g., 1 = enrolled in a 4-year college). In the model, X i is a vector for the main independent variables. For the first set of regressions, X i included the categories for expectation stability. For the second set of regressions, it included the expectations in 2002, 2004, and 2006. For controls, Z i is a vector of sociodemographic characteristics like SES, gender, and ethnicity while W i is a control for prior academic achievement, measured through a 10th-grade standardised maths test. The α is a constant, while the β's are regression coefficients. Rather than use log odds, I provided the odds ratio to facilitate a more intuitive interpretation of the results. An odds ratio of 1 meant that the independent variable had no effect on the outcome. An odds ratio greater than 1 meant that the probability of the outcome occurring tended to increase with every one-unit addition in the independent variable. Conversely, an odds ratio of less than 1 meant that the odds of the outcome occurring decreased with every one unit addition (Bland & Altman, 2000). In Tables 3  and 4, statistical significance was provided with the asterisks after the odds ratio. To know what characteristics were evident for the different expectation stability groups, I also provided the demographic details for each of the six stability groups (e.g., stable high, volatile high, risers). I showed the gender and racial differences per group as well as their mean scores for SES and the 10th-grade standardised maths test. Table 2 shows the percentage of students who were enrolled in college in 2006 and graduated from college by 2012 for every expectation stability group (Stable High, Volatile High, …). In 2006, those with stable high expectations had 73.64% of their group enrolled in college while those with stable low expectations (i.e., those who did not expect a college  degree) had less than 3% of their group enrolled in a 4-year college. Fallers and those with volatile high and low expectations had less than 40% of their group enrolled in a 4-year college, while risers had more than 55% of their group in a 4-year college."}, {"section_title": "Results", "text": ""}, {"section_title": "Expectation stability and attainment", "text": "Graduation from a 4-year college showed similar trends. Students with stable high expectations had the largest proportion of college graduates, while those with stable low expectations had the smallest proportion. More students with volatile high expectations finished college (34.42%) than those with falling or volatile low expectations (22.52% and 20.82%, respectively). However, risers still had more students graduate at 55.98%. Although the descriptive data showed salient differences between expectation stability groups, these could be influenced by other factors such as prior achievement, initial socioeconomic status, or ethnicity. Thus, Table 3 provides results from logistic regressions of the outcomes on expectation stability. These regressions included control variables, such as ethnicity, SES, gender, and prior maths test scores. For expectation stability, the reference group was the volatile high group and coefficients were expressed as odds ratios (OR). In terms of entering college, the odds were only statistically significant for those with stable high, stable low, and riser status. Net of sociodemographic realities, those with stable high expectations were almost 3 times more likely to enter college than the volatile high group (OR 2.89, p < 0.001), while those with stable low expectations had their chances of going to college reduced significantly (OR 0.10, p < 0.001). Those with rising expectations were also more likely to enrol in college (OR 1.96, p < 0.001) but not as much as those with stable high expectations. Interestingly for the odds of graduating from college by 2012, all the groups had statistically significant results, which meant that they differ substantially from students with volatile high expectations. For the stable high group, their likelihood of graduation was only 68% more than that of the reference group (OR 1.68, p < 0.001). Although there were no significant differences between volatile high, volatile low, and fallers in the previous regression on college enrolment, fallers and those with volatile low expectations were less likely than the volatile high group to graduate from college (OR 0.52 and 0.62, respectively, p < 0.001). The overall data illustrate how stability and instability of expectations can influence future outcomes and how these expectations can actually have dissimilar effects, depending on which long-term outcome was being investigated."}, {"section_title": "Later expectations and attainment", "text": "Aside from knowing how expectation stability affected subsequent attainment, the research looked at how earlier or later expectations affected educational outcomes. Did students' earlier expectations better predict their outcomes, or were later expectations more predictive? Table 4 shows expectations during the different waves: when participants were in 10th grade, 12th grade, and 2 years after high school (supposedly, when most students were in their second year of college). Similar sociodemographic control variables were used from the previous table. Within each year level, odds ratios were presented for those who did not expect to go to college and those who expected to go to graduate school. The reference group was the group of students who expected to graduate from a 4-year college. In terms of the odds of entering college, those who did not expect to go to college were less likely than those with college expectations to enrol in college. In addition, the effect of not expecting college became more salient as time progressed. A student who did not expect to go to college in 10th grade cut his or her likelihood of entering college in half (OR 0.53, p < 0.001), but the impact became more salient in 12th grade and 2 years after high school (OR 0.21 and 0.26, p < 0.001). The expectations of pursuing graduate studies paint a different picture because 10th-grade expectations did not have any statistically significant effect. Meanwhile, the effect of the graduate studies expectations in 12th grade and the second year of college increased the odds of entering college by 25% and 67% (p < 0.001). In terms of college graduation, students who did not expect to finish a 4-year college degree at the different grade levels were less likely to graduate from college. Those with lower expectations in 10th grade had an odds ratio of 0.65 (p < 0.05), while those in 12th grade had an odds ratio of 0.24 (p < 0.001). Finally, those who still had these expectations 2 years after high school had an odds ratio of 0.14 (p < 0.001). However, for those who expected graduate degrees, this was only statistically significant during the third wave of the study. During this third wave, when students were supposedly in second-year college, those who expected to pursue graduate studies were twice as likely to graduate from college than those who only expected a college degree (OR 2.05, p < 0.001). Possibly, as students progressed in their studies, they became better at gauging their eventual attainment or they became more aware of the possibilities of graduate school during this period."}, {"section_title": "Demographic data for different expectation stability groups", "text": "To understand whether sociodemographic patterns drove differences in expectations, Table 5 presents cross-tabulations comparing the sociodemographic details of differences in students' expectation stability. Although baseline information showed that the gender distribution was evenly distributed, differences were observed across expectation stability groups. For students with stable high expectations, 45% were male (55% female), and for those with stable low expectations, 66% were male (34% female).  5 also shows how there were striking differences in the mean SES of the different groups. Those who had stable high and stable low expectations had a mean SES of 0.34 and −0.43, respectively. Risers had a mean SES of 0.08, and those with volatile high expectations had −0.03. Fallers had a mean SES of −0.07, and those with volatile low expectations had −0.12. Mean maths test scores were also different per expectation stability group: Stable high and stable low had 55.18 and 43.03 points, respectively. Risers and volatile high had 51.17 and 50.16 points, respectively, while fallers and volatile low had 49.68 and 46.71 points, respectively. Some differences were also detected in terms of ethnic composition. The stable high group was composed of 60.83% Whites and 12.28% Asians. However, the stable low group was composed of 59.43% Whites and 3.93% Asians. For the volatile low group, there were only 49.46% Whites, but there were 18.12% Blacks and 18.44% Hispanics."}, {"section_title": "Discussion", "text": "In the present social context of college-for-all, where most students expect at least a college degree but not all are prepared for its rigours (Goyette, 2008;Rosenbaum, 1997), it is important to ask how these expectationsincluding their stability and when they were madeactually influence long-term outcomes. Are high expectations fast becoming meaningless when most people are working towards college degrees? Or are their effects still far ranging, net of social and economic factors? The present research found that stable and later (i.e., those made after high school) expectations still significantly influence later life outcomes, but their effects are different per outcome. Some results provide interesting and counter-intuitive insights into the dynamics of stable and later expectations. The first to third findings answer the question: How does the stability or instability of self-expectations predict long-term educational outcomes? The last finding answers the question: How do earlier or later expectations predict these outcomes? First, those who have stable high and rising expectations were more likely to enter and graduate from college. Similar to the findings of Bozick and colleagues (2010), those who had stable expectations of going to college or graduate school increased their odds of entering college, but this association was reduced in their odds of graduating from college. Similar trends happened for those with rising expectations. These high expectations illustrated how certain students have \"future-oriented cognition\", which then affected their current behaviour and future attainment (Beal & Crockett, 2010). This finding highlighted the importance of keeping stable or having rising expectations in order to increase one's likelihood of entering into and graduating from college. A second finding provided the reverse trend for those with falling and volatile low expectations as they were as likely as those with volatile high expectations to enter college but are much more likely to drop out of college. Thus, fallers did not have problems with entering college but experienced problems with staying in it. It was possible that these falling or levelled expectations were due in part to the difficulties experienced in college, absence of supports, and/or chronic lack of structural opportunities (MacLeod, 2009;Strayhorn, 2009;Trinidad, 2018). Although these students have had high expectations for themselves during at least one point in time, they may have also experienced some blocks that made them unable to graduate from college. Such personal and structural blocks could have been reasons why their expectations fell or were volatile. Coming from this insight about falling and volatile low expectations influencing longterm outcomes, interventions can be created not only for students to have high expectations at the beginning of their studies but also for students' high expectations to be prevented from falling much later in life. Bailey, Duncan, Odgers, and Yu (2017) wrote about the need for sustaining high-quality environments in order to prevent intervention effects from fading out. Thus, interventions can come in the form of pushing students to have high expectations and, more importantly, finding ways of sustaining these high expectations. Third, students who consistently expected not to achieve a 4-year degree have reduced the odds of entering and graduating from college. This finding aligns with studies on students with low expectations who were either unmotivated to continue their schooling or lacked economic opportunities such that studying further did not give any added value (Hanson, 1994;Walkey, McClure, Meyer, & Weir, 2013). In a context where most people try to pursue college, these students did not even think at any time period that they would be able to finish a college degree. Descriptive data indicated that gender and socioeconomic status predicted these stable low expectations; this is similar to findings from other research on how males and those from lower SES groups were more likely to have low expectations (Feliciano & Rumbaut, 2005;Hanson, 1994). Studies have suggested that these low expectations were in part affected by lower expectations of parents and teachers (Benner & Mistry, 2007;Trusty, 1998;Wood, Kaplan, & McLoyd, 2007). Other studies also pointed to the impact of schools where students were influenced into not expecting as much for themselves (Dupriez, Monseur, Van Campenhoudt, & Lafontaine, 2012;Trinidad, 2019). Given the many factors that could affect the stability of low expectations, interventions can come in the form of disrupting these low expectations by providing positive role models (Lockwood, Marshall, & Sadler, 2005) and showing future opportunities for someone who nurtures high expectations (Murry, Berkel, Gaylord-Harden, Copeland-Linder, & Nation, 2011). Lockwood and colleagues (2005) highlighted the importance of personal models who can inspire students with low expectations, and they showed how they may be able to achieve certain educational and economic milestones given these role models. On the other hand, Murry and colleagues (2011) studied that one reason for low expectations and poor outcomes in resource-poor environments was the perceived, and real, lack of opportunities. This was why it was necessary for students to also be exposed to different possibilities for careers and alternative life trajectories. Lastly, in terms of earlier or later outcomes, the expectations of not finishing a 4-year degree had far stronger effects than expectations for graduate school. Those who did not expect a college degree in any of the three time points reduced their college entrance and graduation rates. However, expectations for graduate school were only salient and statistically significant 4 years after the first survey, when most students were already in their second year of college. On the one hand, the results highlighted how low expectations had harmful effects at any point in time. On the other hand, it also emphasised how important high expectations were later in life. This specific finding furthers past studies that only looked at the effect of educational expectations at a singular point in time (Buchmann & Hannum, 2001;Kay et al., 2016). Critics, however, are quick to point out that encouraging higher education for lowachieving students may be a waste of time and resources. However, one research study showed that higher expectations even for low-achieving students were actually advantageous (Martin & Gardner, 2016). Thus, it would be better if students were given opportunities to heighten their expectations for further education, instead of having reduced expectations. These opportunities could come in the form of increasing cultural capital as students become aware of the value of school and of what they can achieve with their degrees (Stockfelt, 2016)."}, {"section_title": "Limitations", "text": "Several limitations must be acknowledged in this present study. First, the analysis involved a sample that was in 10th grade in 2002. More recent longitudinal samples are needed for continuing study. Although the present dataset was used because of the presence of variables measuring long-term educational outcomes, future research may investigate how the influence of expectations have changed with the growing accessibility to college and student loans. Second, the imputation of data may raise questions about the results, since certain data points have been imputed based on patterns of the whole data set. However, the alternative of deletion of missing data would have biased the sample, because those who had complete data were also more likely to finish college and were from more socially advantaged positions (Johnson & Reynolds, 2013). Additionally, it can be seen in Appendix 1 that there were significant differences between those who have complete data and those with at least one data point missing. It was thus justified to do imputation despite the limitations acknowledged in the methods section. Lastly, with the present data it would have been possible to create different regressions for subpopulations (according to gender or ethnicity). Some scholars may want to undertake this as a future study to examine the effects of expectation stability for each of these subpopulations."}, {"section_title": "Conclusion", "text": "With more students aspiring for higher education but not necessarily finishing it, do expectations still matter? Beyond singular expectations in high school, expectation stability predicted significant educational milestones. The present research suggests that stable high and rising expectations increase the odds of entering and graduating from college while volatile low and falling expectations influence lower likelihood of graduation. Unfortunately, those with stable low expectations or who have had low expectations at any time may be less likely to attain these educational outcomes. These findings highlight two key practical insights: First is the need for students to not only have high expectations but to have these expectations remain stable even during college. In this regard, interventions may be set up such that expectations during college are not abruptly reduced due to social, economic, or scholastic difficulties. Second is the need to protect students from low expectations since expectations of less than college at any pointand more so, during the student's early adulthoodhave crucial long-term negative impacts. If schools and parents are unable to increase the student's expectations, the other goal is simply to prevent low expectations from settling in. As more students are given opportunities to pursue college, the stability of their expectations becomes more important than just their expectations at particular points in time. Expectation stability's effects can strongly influence different educational outcomes, and this stability can itself be a way of knowing how students make sense of their realities, blocks, challenges, and opportunities. Given the uses of expectation stability, this concept can further nuance the importance given to time-specific expectations influencing longterm outcomes."}]