[{"section_title": "Abstract", "text": "Introduction: Reference tissue model (RTM) is a compartmental modeling approach that uses reference tissue time activity curve (TAC) as input for quantification of ligand-receptor dynamic PET without blood sampling. There are limitations in applying the RTM for kinetic analysis of PET studies using [\n11 C]Pittsburgh compound B ([ 11 C]PIB). For region of interest (ROI) based kinetic modeling, the low specific binding of [ 11 C]PIB in a target ROI can result in a high linear relationship between the output and input. This condition may result in amplification of errors in estimates using RTM. For pixel-wise quantification, due to the high noise level of pixel kinetics, the parametric images generated by RTM with conventional linear or nonlinear regression may be too noisy for use in clinical studies. Methods: We applied RTM with parameter coupling and a simultaneous fitting method as a spatial constraint for ROI kinetic analysis. Three RTMs with parameter coupling were derived from a classical compartment model with plasma input: an RTM of 4 parameters (R 1 , k′ 2R , k 4 , BP) (RTM4P); an RTM of 5 parameters (R 1 , k 2R , NS, k 6 , BP) (RTM5P); and a simplified RTM (SRTM) of 3 parameters (R 1 , k′ 2R , BP) (RTM3P). The parameter sets [k′ 2R , k 4 ], [k 2R , NS, k 6 ], and k′ 2R are coupled among ROIs for RTM4P, RTM5P, and RTM3P, respectively. A linear regression with spatial constraint (LRSC) algorithm was applied to the SRTM for parametric imaging. Logan plots were used to estimate the distribution volume ratio (DVR) (=1 + BP (binding potential)) in ROI and pixel levels. Ninety-minute [ 11 C]PIB dynamic PET was performed in 28 controls and 6 individuals with mild cognitive impairment (MCI) on a GE Advance scanner. ROIs of cerebellum (reference tissue) and 15 other regions were defined on coregistered MRIs. Results: The coefficients of variation of DVR estimates from RTM3P obtained by the simultaneous fitting method were lower by 77-89% (in striatum, frontal, occipital, parietal, and cingulate cortex) as compared to that by conventional single ROI TAC fitting method.\nThere were no significant differences in both TAC fitting and DVR estimates between the RTM3P and the RTM4P or RTM5P. The DVR in striatum, lateral temporal, frontal and cingulate cortex for MCI group was 25% to 38% higher compared to the control group (p ≤ 0.05), even in this group of individuals with generally low PIB retention. The DVR images generated by the SRTM with LRSC algorithm had high linear correlations with those from the Logan plot (R 2 = 0.99). Conclusion: In conclusion, the RTM3P with simultaneous fitting method is shown to be a robust compartmental modeling approach that may be useful in [ 11 C]PIB PET studies to detect early markers of Alzheimer's disease where specific ROIs have been hypothesized. In addition, the SRTM with LRSC algorithm may be useful in generating R 1 and DVR images for pixel-wise quantification of [ 11 C]PIB dynamic PET."}, {"section_title": "Introduction", "text": ""}, {"section_title": "2006). [ 11 C]PIB is the most widely used PET imaging agent (the other is [", "text": "18 F]FDDNP) in research studies aimed at improving early detection of AD, monitoring progression of Aβ deposition in the brain, and evaluating anti-amyloid and other therapies to stop progression of AD (Shoghi-Jadid et al., 2002; Mathis et al., 2005; Mintun, 2005; Nichols et al., 2006; Nordberg, 2004; Small et al., 2006; Wu et al., 2005) .\nThe standard compartmental model with plasma input as well as model-independent spectral analysis and graphical analysis (Logan plot) with plasma input was used for [ 11 C]PIB kinetic analysis Verhoeff et al., 2004) . Consistent results from the two previous studies demonstrated that (1) a 2-tissue compartmental model provided better curve fitting than 1-tissue compartmental model; (2) the Logan plot with plasma input is a robust approach to estimate [ 11 C]PIB distribution volume (DV) as compared to the 2-tissue compartmental model; and (3) there was no significant difference in the DV estimates for reference tissue (cerebellum) between controls and AD patients. The plasma input is usually obtained by arterial blood sampling during the PET study period, and tracer metabolism in plasma is corrected using the HPLC technique. This procedure is laborious and is associated with experimental errors and risks to subjects, particularly in the context of frequent longitudinal follow-up. Thus, the ability to conduct accurate studies without arterial sampling will increase the feasibility of [ 11 C]PIB for clinical practice and increase recruitment and retention of participants within the context of large, longitudinal studies. To quantify [ 11 C]PIB dynamic PET without arterial blood sampling, compartmental model with the plasma input derived from dynamic image data, graphical analysis (Logan plot) and a simplified reference tissue model (SRTM) with reference tissue input, and standardized uptake value ratio (SUVR) or target to reference tissue concentration ratio were evaluated (Edison et al., 2007; Fagan et al., 2006; Kemppainen et al., 2006; Lopresti et al., 2005; Price et al., 2005) .\nReference tissue model is a compartmental modeling approach that uses the reference tissue time activity curve (TAC) as input (Cunningham et al., 1991; Gunn et al., 2001; Morris et al., 2005; Watabe et al., 2000) . In contrast to graphical analysis, the parameters of reference tissue model are estimated by fitting the model to the full time course of tissue TAC measured by PET. Analogous to the classical compartmental model with plasma input, the reference tissue model can be used to predict and simulate tissue tracer kinetics with given model parameters and reference tissue input. Compared to graphical analysis, the reference tissue model is commonly used to extract more physiological information from measured tracer kinetics, such as the relative tracer transport rate constant from vascular space to tissue. In addition, reference tissue models have been extended for kinetic analysis of dynamic PET with pharmacological challenges or cognitive activation during PET (Alpert et al., 2003; Votaw et al., 2002; Watabe et al., 1998; Zhou et al., 2006a) .\nOn the other hand, in theory, there is a limitation in using reference tissue models for the tissue tracer kinetics of low or even negligible specific binding. This is because the low and negligible specific binding of [ 11 C]PIB in target tissue can result in a high linear relationship between the output and input for the reference tissue model. This situation may amplify the errors noticeably in estimates obtained through the reference tissue model. For example, a convergence problem in nonlinear fitting of SRTM to [ 11 C]doxepin ROI TAC occurred in tissues of low H 1 receptor binding protein (BP) (Suzuki et al., 2005) . It was also reported that the estimates of low BP obtained by conventional nonlinear SRTM fitting were not reliable in [ 11 C]PIB and [ 11 C]SB-13 PET studies (Verhoeff et al., 2004; Zhou et al., 2006b ). Previous [ 11 C]PIB studies have reported that BP was close to 0, or the distribution volume ratio DVR (= 1 + BP) was close to 1, in most cortical regions in controls. Estimates of PIB retention were also low in brain regions with negligible Aβ load in MCI and AD patients Price et al., 2005) . It has been demonstrated that the accuracy of estimates can be improved by simultaneously fitting a compartmental model with plasma input or reference tissue input to multiple ROI TACs (Buck et al., 1996; Cunningham et al., 2004; Endres et al., 2003; Ginovart et al., 2001; Raylman et al., 1994; Zhou et al., 2006b) . For this approach, the coupled parameter or parameters can be estimated simultaneously for all ROIs. In contrast, the coupled parameter estimated by fitting the model to each single ROI TAC, the conventional ROI TAC model fitting procedure, usually varies among ROIs and this is not consistent with model assumption.\nThe use of higher order reference tissue models, i.e., more compartments used for target and reference tissues, has been proposed to reduce the bias of BP or DV ratio of target tissue to reference tissue (DVR) estimates from the SRTM Kropholler et al., 2006; Wu and Carson, 2002; Zhou et al., 2006c) . In this study, three reference tissue models were used for ROI kinetic modeling and their estimates were compared to investigate if there are any significant improvements using higher order reference tissue models. To obtain reliable estimates of model parameters, reference tissue models with parameter coupling were derived and implemented by simultaneous fitting for ROI based quantification. As a comparison, a reference tissue model with the conventional single ROI TAC fitting method was also applied to same ROI data set.\nThe parametric images that represent both the spatial distribution and quantification of the physiological parameters are generated by fitting a tracer kinetic model to the measured individual pixel TACs. However, due to the inherent high noise level of pixel kinetics of PET, the parametric images generated by conventional linear or nonlinear fitting are usually less accurate than those obtained by model fitting with spatial-temporal analysis (Gunn et al., 2002; Kimura et al., 1999; Turkheimer et al., 2003a; Zhou et al., 2002 Zhou et al., , 2003 . In this study, a linear regression with spatial constraint algorithm (LRSC) we previously developed (Zhou et al., 2003) was applied to the SRTM model for pixel-wise quantification of [ 11 C]PIB kinetics. The R 1 and DVR images generated by the SRTM with the LRSC algorithm were compared to the estimates from ROI kinetic analysis and pixel-wise Logan plot. The [ 11 C]PIB dynamic PET data for 28 controls and 6 individuals with MCI were used in the study."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Theory of reference tissue model with parameter coupling", "text": "The reference tissue model is derived from classical compartmental model theory by eliminating plasma input with reference tissue TAC. In clinical ligand-receptor PET studies, a 2-tissue compartmental model with plasma input (Fig. 1) is commonly used to fit the measured reversible tracer kinetics for both target and reference tissues (Huang et al., 1986; Koeppe et al., 1991; Mintun et al., 1984; Price et al., 2005) . The tracer kinetics described by Fig. 1 are based on the following assumptions: (1) rapid equilibrium between free and nonspecific binding in target tissue is attained; (2) the concentrations of tracer are homogenous in vascular space (C P ), free plus nonspecific binding compartment (C F + NS ), and specific binding compartment (C S ) for target tissue, free and nonspecific binding compartments (C F and C F + NS ) for reference tissue; and (3) the transport of tracer between compartments has first order kinetics. Based on above assumptions, the tracer kinetics in target and reference tissues are described by the following differential equations:\nReference tissue model assumes that the tissue tracer activity contributed from vascular space is negligible, i.e., C T = C F + NS + C S , and C R = C F + C NS , where C T and C R are the tracer concentrations in target and reference tissues measured by the PET scanner, C F + NS (0) = C S (0) = C F (0) = C NS (0) = 0, K 1 (ml/min/ml) is the transport rate constant from vascular space to target tissue, k 2 (1/min) is the efflux rate constant from free plus nonspecific compartment to blood, k 3 (1/min) is the rate of specific receptor binding, and k 4 (1/ min) is rate of dissociation from receptors, K 1R (ml/min/ml) is the transport rate constant from vascular space to reference tissue, k 2R (1/min) is the efflux rate from free compartment in reference tissue to blood, k 5 (1/min) is the rate constant of nonspecific receptor binding, and k 6 (1/min) is rate of dissociation from nonspecific binding. One common measure of tracer binding kinetics is the DV. The tracer DV in tissue or compartment is defined as the ratio of the tracer concentration in tissue or compartment to the tracer concentration in plasma at equilibrium condition. The primary measure for quantification of ligand-receptor dynamic PET is BP that is defined as BP = f 2 B′ max / K D , where f 2 is the free fraction of tracer in the free and nonspecific binding compartment, B′ max (nM) is the available receptor density for tracer binding, and K D (nM) is the tracer equilibrium dissociation constant. BP is an index of tracer specific binding to receptor (Huang et al., 1986; Mintun et al., 1984) . In terms of model micro-parameters, BP in target tissue, DV in free plus nonspecific binding compartment (DV F + NS ), in target tissue (DV T ), and in reference tissue (DV REF ) can be expressed as BP = k 3 /k 4 , DV F + NS = K 1 / k 2 , DV T = (K 1 / k 2 )(1 + k 3 /k 4 ), and DV REF = (K 1R / k 2R ) (1 + k 5 / k 6 ). The essential assumption to derive the reference tissue model is that the tracer distribution of volume in free plus nonspecific binding compartment is identical between reference tissue and target tissue, i.e., DV F + NS = DV REF . The estimation of micro-parameters can be affected by spatial heterogeneity of tracer kinetics, and so the estimated values may not be consistent with the assumed physiological meaning (Cunningham et al., 2004; Herholz et al., 1990; Reimold et al., 2004; Zhou et al., 1997) . Thus, the reliable and robust estimate for BP is often estimated as BP = DV T / (\nis the distribution volume ratio between target and reference tissues.\nThe DVR or BP can be estimated directly by reference tissue models using the reference tissue TAC as input. The reference tissue model derived from a 2 compartments for both target and reference tissues (Fig. 1 ) has 7 parameters, and it usually results in model identity problems in clinical situations (Kropholler et al., 2006; Wu and Carson, 2002) . The following three reference tissue models with lower orders of model configuration described in Fig.  2 were re-derived for models incorporating parameter coupling and were compared in the present study."}, {"section_title": "Full reference tissue model with parameter coupling-RTM4P", "text": "A conventionally employed full reference tissue model with 4 parameters (R 1 , k 2 , k 3 , k 4 ) is shown in Fig. 2A . Under the assumption that rapid equilibrium is attained between free and nonspecific binding in reference tissue, the tracer concentration in reference tissue (C R ) is modeled with a single compartment. The reference tissue model with four parameters (R 1 , k′ 2R , k 3 , k 4 ) (RTM4P) is then derived from 2 compartments for target tissue and 1 compartment for the reference tissue as below.\nThe tracer kinetics in target and reference tissue described by Fig. 2A follow Eqs. (1), (2), and (5) as below.\nwhere k′ 2R (1/min) is the efflux rate from reference tissue to blood. Based on the assumption on DV F + NS , i.e.,\n, By applying a Laplace transform to Eqs. (1), (2) and (5) with initial conditions C F + NS (0) = C S (0) = C R (0) = 0, the operational equation for RTM4P can be expressed by parameters of R 1 , k′ 2R , k 4 , and BP:\nwhere\n, and is the mathematical operation of convolution. The k′ 2R and k 4 are the coupled parameters among all ROIs for RTM4P. \"Watabe\" reference tissue model with parameter coupling-RTM5P\nSymmetrically, the configuration for the second reference tissue model is usually referred to as the \"Watabe\" reference tissue model with parameters (R 1 , k′ 2 , k 2R , k 5 , k 6 ) (see Fig. 2B ; Endres et al., 2003; Gunn et al., 2001; Kropholler et al., 2006; Millet et al., 2002; Watabe et al., 2000) . With the assumption of rapid equilibrium between free plus nonspecific binding and specific binding, tracer concentration C T for target tissue can be modeled by a single compartment. Therefore, in addition to Eqs. (3) and (4) for tracer kinetics in reference tissue, the tracer kinetics in target tissue follows Eq. (7).\nwhere k′ 2 is the transport rate constant from target tissue to blood. Note that k′ 2 = k 2 / (1 + BP), and\nThe operational equation for RTM5P is then expressed by parameters of R 1 , k 2R , NS, k 6 , and BP as below.\nÞÀP. For RTM5P, the parameters k 2R , NS, and k 6 are coupled among all ROIs."}, {"section_title": "SRTM with parameter coupling-RTM3P", "text": "The last reference tissue model with configuration demonstrated by Fig. 2C is commonly referred as the SRTM with parameters (R 1 , k 2 , and BP) . The model with configuration Fig. 2C assumes that the tracer concentrations in target and reference tissues can be modeled by a single compartment. The tracer kinetics in target and reference tissues for the SRTM are therefore determined by Eqs. (5) and (7).\n, and the SRTM with (R 1 , k′ 2R , BP) is referred to as RTM3P for consistency in this study. The operational equation for the RTM3P is then written as Eq. (3).\nThe k′ 2R implies only one parameter coupled among all ROIs for RTM3P."}, {"section_title": "Simultaneously fitting model to all ROI TACs", "text": "To embody the physiological assumptions into the model fitting process for the reference tissue model with parameter coupling, and to reduce the variability of estimates, simultaneously fitting a model to all ROI TACs has been used in ligand-receptor dynamic PET (Buck et al., 1996; Cunningham et al., 2004; Endres et al., 2003; Raylman et al., 1994; Zhou et al., 2006b,c) . For the above three reference tissue models with parameter coupling, the cost functions to be minimized for RTM3P, RTM4P, and RTM5P are:\nWhere M is the number of time frames for dynamic PET scans and N is number of ROI TACs, t i is the mid time of ith frame of dynamic PET scanning, w i is the duration of ith frame of dynamic PET scanning, C j (t i ) is the measured jth ROI's tracer concentration at ith frame. The jth ROI's tracer concentration at time t i is determined by f RTM3P , f RTM4P , and f RTM5P with the parameters R 1 j , BP j for jth ROI and the coupled parameters k′ 2R , (k′ 2R , k 4 ) and (k 2R , NS, k 6 ) for RTM3P, RTM4P, and RTM5P, respectively. The Marquardt With the assumption of rapid equilibrium between free plus nonspecific binding and specific binding, the total concentration in target tissue C T is modeled by a single compartment. (C) Under the assumptions from A and B, the tracer concentration in target tissue (C T ) and reference tissue (C R ) can be modeled by a single compartment. C P is the tracer concentration in vascular space as input function. K 1 to k 6 , K 1R , k′ 2 , k 2R , and k′ 2R are the transport rate constants between compartments.\nalgorithm, a conventional nonlinear regression algorithm, was used to minimize cost function (Marquardt, 1963) .\nFor comparison, the parameters of the reference tissue models were also estimated by fitting RTM3P, RTM4P, and RTM5P to each single ROI TAC. In contrast, the cost function for fitting model to individual jth ROI TAC is:\nfor RTM3P, RTM4P, and RTM5P, respectively. To compare with previous results , DVR was calculated as BP + 1 after model fitting. The Akaike information criterion (AIC) (Akaike, 1976; Turkheimer et al., 2003b) was calculated for simultaneous fitting. The AIC for the reference tissue model with conventional single ROI fitting method was calculated as P N j¼1 AICðROI j Þ."}, {"section_title": "Linear regression with spatial constraint for parametric imaging", "text": "Based on the results from ROI kinetic analysis (the estimates of R 1 , and DVR from RTM3P, RTM4P, and RTM5P were almost same, see Comparison of reference tissue models), the SRTM model was used to generate parametric images. To improve the accuracy of pixel-wise estimates, a LRSC algorithm was applied to Eqs. (10) and (11) to generate R 1 , and DVR images, respectively (Zhou et al., 2003) .\nTo perform pixel-wise statistical analysis, all the parametric images were spatially normalized to the standard space (pixel size: 2 × 2 mm 2 , slice thickness 2 mm) using SPM2 (statistical parametric mapping software; Wellcome Department of Cognitive Neurology, London, UK). Because the R 1 images contain greater structural information, the R 1 images generated by LRSC were used to determine the parameters of spatial normalization. These transformation parameters were applied to all generated parametric images for each subject. Two iterations of the spatial normalization process were performed: (1) the parameters obtained by normalizing R 1 images to the R 1 template generated in our previous [\n11 C] raclopride study (Zhou et al., 2003) , and (2) mean R 1 images obtained by first iteration were used as a template for the second iteration."}, {"section_title": "Logan plot with reference tissue input", "text": "The standard Logan plot with reference tissue input was used for estimation of the DVR of [\n11 C]PIB binding in previous studies Mintun et al., 2006) . As compared to the standard Logan plot with reference tissue input, one advantage of the simplified Logan plot with reference tissue input is that it eliminates the need to estimate the mean of k′ 2R (Logan et al., 1996) . The simplified Logan plot given by Eq. (12) was proposed for ROI based [ 11 C]PIB kinetic analysis in this study.\nTo obtain robust DVR estimates for pixel TACs of high noise levels, the simplified Logan plot in bilinear form as below was used to generate DVR images.\nwhere t* = 40 min. For comparison, the standard Logan plot using Eq. (14) was also applied to the ROI TACs to estimate ROI DVR in the study.\nwhere P k V 2R is a population average value of k′ 2R . The\nestimated by a 2-tisue compartment, 4-parameter model with plasma input was 0.08/min for controls (n = 5), 0.07/min for MCI (n = 5) and AD (n = 4) . The P k V 2R was also fixed at 0.149/min and 0.2/min for Logan plot with reference tissue input in [ 11 C]PIB PET studies by Lopresti et al. (2005) , respectively. Note that the P k V 2R estimated by RTM3P for controls (n = 28) and MCIs (n = 6) was 0.05/min in our current study (see Results). To investigate the effects of P k V 2R on the DVR estimates, we estimated DVR with a fixed series of P k V 2R values from 0.03/min to 0.5/min and compared these to the simplified Logan plot approach given by Eq. (12)."}, {"section_title": "Human [ 11 C]PIB imaging and data acquisition", "text": "Subjects were 34 of the first 36 participants (excluding one with a clinical stroke and one with missing PET time frames due to scanner error) evaluated with [\n11 C]PIB as part of the ongoing neuroimaging substudy of the Baltimore Longitudinal Study of Aging (BLSA) (Resnick et al., 2000 (Resnick et al., , 2003 . At initial enrollment, BLSA neuroimaging participants were free of dementia and other central nervous system disorders, severe cardiovascular disease, and metastatic cancer (detailed in Resnick et al., 2000) . [\n11 C]PIB studies were initiated in June 2005, and participants had been followed for up to 12 years with structural and functional imaging studies. Evaluation of diagnostic status followed established BLSA procedures, using prospective follow-up information (detailed in Gamaldo et al., 2006) . All participants received a detailed physical examination, including medical history updates and laboratory screening, neuropsychological testing, and assessment by the Clinical Dementia Rating (CDR) (Morris et al., 2001 ) scale in conjunction with the [ 11 C]PIB study. The CDR scores were typically based on informant interviews (spouse, child, or close friend) conducted by a certified examiner. Participant data were reviewed at a consensus diagnostic confe-rence if the Blessed-Information-Memory-Concentration (BIMC; Blessed et al., 1968 ) test score was 3 or above or if the informant or subject CDR score was 0.5 or above. Diagnoses were made at consensus diagnostic conferences using DSM-III-R (APA, 1987) criteria for dementia and the NINCDS-ADRDA criteria (McKhann et al., 1984) using neuropsychological diagnostic tests and clinical data. A diagnosis of mild cognitive impairment not meeting criteria for dementia was made for participants who had cognitive impairment (typically memory) but did not have functional loss in activities of daily living. One participant in the present study met stringent diagnostic criteria for mild cognitive impairment and five additional participants scored 0.5 on the CDR scale, reflecting very mild cognitive impairment. Normal controls had scores of 0 on the CDR and were considered cognitively normal by our diagnostic procedures. It is important to emphasize that the MCI participants in this study are identified within the context of prospective longitudinal follow-ups and represent very mild cases of cognitive impairment in contrast to those followed in other studies who typically present with memory complaints.\nStructural magnetic resonance imaging (MRI) scans and [ 11 C] PIB dynamic PET were acquired for each participant. MRI and PET imaging are typically performed on the same visit, but a major renovation of the MRI research scanners coincided with the initial PIB imaging studies. MRI scans were acquired within 3 days of the PET scan for 16 participants and within 1 to 2 years for 15 participants. Excluding 3 individuals, where it was necessary to use an MRI obtained 4, 5, and 10.5 years prior, respectively, the mean (SD) interval between MRI and PET was 0.6 (0.8) years.\nMRI scans for anatomic localization were performed on a 1.5 Tesla GE Signa system using a spoiled gradient recalled acquisition sequence (124 slices with image matrix 256 × 256, pixel size 0.93 × 0.93 mm, slice thickness 1.5 mm). Dynamic PET [\n11 C]PIB studies were performed on a GE Advance scanner. The PET scanning was started immediately after intravenous bolus injection of 14.45 ± 1.01 (n = 34, range 11.02 to 16.36) (mean ± SD hereafter for \"±\") mCi [\n11 C]PIB with a specific activity of 4.29 ± 1.49 (n = 34, range 0.96 to 6.83) Ci/μmol. Dynamic scans were acquired in 3D mode with acquisition protocol of 4 × 0.25, 8 × 0.5, 9 × 1, 2 × 3, 14 × 5 min (total 90 min, 37 frames). To minimize motion during PET scanning, all participants are fitted with thermoplastic face masks for the PET imaging. Ten-minute 68 Ge transmission scans acquired in 2-D mode were used for attenuation correction of the emission scans. Dynamic images were reconstructed using filtered back projection with a ramp filter (image size 128 × 128, Fig. 3 . The coefficient of variation of DVR estimates (= 100 * (mean / (standard deviation))) for the control group (n = 28) and MCI group (n = 6). The DVR estimates were obtained from the RTM3P model with simultaneous fitting and single ROI TAC fitting methods. Regions of interest are numbered as: 1: caudate, 2: putamen, 3: thalamus, 4: lateral temporal, 5: mesial temporal, 6: orbital frontal, 7: prefrontal, 8: occipital, 9: superior frontal, 10: parietal, 11: anterior cingulate, 12: posterior cingulate, 13: pons, 14: midbrain, 15: white matter. pixel size 2 × 2 mm, slice thickness 4.25 mm), which resulted in a spatial resolution of about 4.5 mm FWHM at the center of the field of view. MRIs were coregistered to the mean of the first 20 min dynamic PET images using SPM2 with a mutual information method. In addition to the reference region (cerebellum), 15 ROIs (1: caudate, 2: putamen, 3: thalamus, 4: lateral temporal, 5: mesial temporal, 6: orbital frontal, 7: prefrontal, 8: occipital, 9: superior frontal, 10: parietal, 11: anterior cingulate, 12: posterior cingulate, 13: pons, 14: midbrain, 15: white matter) were manually drawn on the coregistered MRIs Lopresti et al., 2005) and copied to the dynamic PET images to obtain ROI TACs for kinetic analysis. The ROI estimates were also obtained by applying ROIs to parametric images."}, {"section_title": "Results", "text": ""}, {"section_title": "Control and mild cognitive impairment (MCI) group", "text": "There were 28 individuals (17 males, 11 females, age range 55-92 years, 78.6 ± 8.1) with CDR = 0 that were classified as the normal control group, and 6 individuals (2 males, 4 females, age range 77-89, 83.0 ± 4.2) in the MCI group. The difference in age between the control and MCI groups was not statistically significant."}, {"section_title": "Improvements in estimates by model fitting with parameter coupling", "text": "The variation in DVR from RTM3P estimates from conventional single ROI TAC fitting method (cost function determined by single ROI TAC) was reduced remarkably by the simultaneous fitting method in caudate, putamen, and most cortical regions in the control group. As demonstrated by Fig. 3 , the coefficients of variation (CV), defined as 100 mean/(standard deviation) of DVR estimates, from the conventional method were reduced from 77% to 89% in caudate, putamen, orbital frontal cortex, prefrontal cortex, occipital cortex, superior frontal cortex, parietal cortex, anterior cingulate cortex, and posterior cingulate cortex in control group. The DVR estimated by the simultaneous fitting method was comparable to those estimated by the conventional method for the ROIs of thalamus, lateral temporal, mesial temporal cortex, pons, midbrain, and white matter in control group. For the MCI group, an improvement in the DVR estimates for the simultaneous fitting Fig. 4 . The mean plus standard deviation of k′ 2R estimates from the RTM3P model with simultaneous fitting and single ROI TAC fitting methods for the control group (n = 28) and MCI group (n = 6). k′ 2R is the efflux rate constant from reference tissue (cerebellum) to blood. The mean of k′ 2R estimates over 15 ROIs after single ROI TAC fitting is also shown. Regions of interest are numbered as: 1: caudate, 2: putamen, 3: thalamus, 4: lateral temporal, 5: mesial temporal, 6: orbital frontal, 7: prefrontal, 8: occipital, 9: superior frontal, 10: parietal, 11: anterior cingulate, 12: posterior cingulate, 13: pons, 14: midbrain, 15: white matter. method relative to the conventional method was only found in the occipital cortex.\nThe mean plus standard deviation of k′ 2R of RTM3P is shown in Fig. 4 . k′ 2R , the efflux rate constant from reference tissue to blood, is expected to be the same for all ROIs in the RTM3P model but shows high variation in estimates from the conventional single ROI TAC fitting method. The estimates of k′ 2R vary from 0.01 ± 0.02 for prefrontal cortex to 0.15 ± 0.05 for thalamus in the control group, and from 0.01 ± 0.01 for occipital cortex to 0.14 ± 0.05 for thalamus in the MCI group. If k′ 2R is estimated by the mean over all 15 ROIs, i.e., k V 2R ðmeanÞ ¼ ð\n, the k′ 2R (mean) is significantly lower than that estimated by the simultaneous fitting approach (paired t test, p < 0.01) for the control group. The k′ 2R (mean) in the control group tends to be lower than that in the MCI group (0.04 ± 0.01 versus 0.05 ± 0.01, p = 0.09), while the coupling method yields greater similarity between k′ 2R for the control and MCI groups (0.05 ± 0.01 versus 0.05 ± 0.01, p = 0.42). R 1 estimates from the conventional and simultaneous fitting methods do not differ significantly (p = 0.77). It was also found that R 1 estimates from the conventional fitting method were high linearly correlated with those from the simultaneous fitting method as R 1 (simultaneous fitting) = 0.96R 1 (conventional) + 0.03 (R 2 = 0.95).\nThe reduction of variation for k′ 2R and DVR estimates in parametric space for the simultaneous fitting approach is at the cost of higher residual sum of squares in kinetic space (cost function values) or AIC as compared to the conventional single ROI fitting approach. For the RTM3P model, the AIC of model fitting with the simultaneous fitting approach is higher (6 ± 3)% than that from the conventional fitting method. Note that the better fit or lower AIC mostly occurs in ROIs of lower DVR (< 1.5). Representative TACs are shown for a control in Figs. 5A1 and A2 and an MCI individual in Figs. 5B1 and B2. As demonstrated by Fig. 5 , the fitted ROI TACs from the simultaneous fitting and single ROI TAC fitting methods were quite comparable visually for (6 ± 3)% difference in AIC. Fig. 5 also illustrates that, as DVR increases, for example in posterior cingulate cortex, from controls to MCI, the difference in the fitted curves between the simultaneous fitting approach and conventional method tends to be smaller."}, {"section_title": "Comparison of reference tissue models", "text": "The results presented above suggest that estimates of the reference tissue model from the conventional single ROI TAC fitting method show high variability under conditions of low binding. Thus, in this section we base our comparison of parameter estimates from different reference tissue models on the simultaneous fitting approach. The AICs from SRTM3P, SRTM4P, and SRTM5P were − 3184. 39 ± 205.68, − 3194.23 ± 195.01, and − 3194.08 ± 201.67 , respectively. Compared to RTM3P, there were no significant reductions in AIC by RTM4P (paired t test, p = 0.84) or RTM5P (paired t test, p = 0.85). Thus, there was no significant improvement in model fitting in kinetic space from RTM4P and RTM5P, as compared to RTM3P. Consistently, Fig. 6 shows that the estimates of R 1 , and DVR from RTM3P were almost identical ]PIB dynamic PET studies from a control subject A (panels A1 and A2) and from a MCI subject B (panels B1 and B2). The fitted curves are from a reference tissue model RTM3P (R 1 , k′ 2R , BP) with a simultaneous ROI TAC fitting approach (A1 and B1) and a conventional single ROI TAC fitting method.\nto those estimated from RTM4P and RTM5P. The k′ 2R estimates from all three models were 0.05 ± 0.01 (n = 34), and there were no significant differences for k′ 2R among the three models (p = 0.52 for RTM3P versus RTM4P and p = 0.71 for RTM3P versus RTM5P). Note that the k′ 2R was calculated as k 2R / (1 + NS) after fitting for RTM5P. The coupled parameter k 4 estimates of RTM4P were 0.56 ± 0.24 and 0.40 ± 0.22 for controls and MCI subjects, respectively, and not significantly different (p = 0.16). For RTM5P, the estimates of NS (= k 5 / k 6 ) were 0.17 ± 0.30 and 0.13 ± 0.24 for control and MCI, respectively (p = 0.76, not significant). The estimates from RTM5P for the coupled parameter k 6 were 0.80 ± 0.23 and 0.63 ± 0.45 for control and MCI, respectively (p = 0.40, not significant)."}, {"section_title": "DVR estimates from Logan plots", "text": "The linear correlations between the DVR from Logan plot (simplified version) and the standard Logan plot with predetermined Thus, the DVR estimates from the Logan plot using the simplified version employed in this study are almost the same as those from the standard Logan plot with the P k V 2R in the reported range. This observation is consistent with previous findings that the P k V 2R effect on DVR estimates for the Logan plot is negligible Mintun et al., 2006) .\nThe estimates of DVR from RTM3P had high linear correlations with those from the simplified Logan plot as DVR(Logan plot) = 0.87 DVR(RTM3P) + 0.15 with R 2 = 0.91. Paired t test showed no significant differences between the DVR estimates from Logan plot and those from RTM3P (p = 0.37)."}, {"section_title": "Parametric images", "text": "The DVR images generated by Logan plot were visually comparable with those generated by SRTM with LRSC approach. The linear correlations between the ROI values calculated on the DVR images generated by Logan plot and those calculated on DVR images generated by SRTM with LRSC were:\nDVRðSRTM with LRSCÞ ¼ 1:03DVRðLogan plotÞ À 0:07\nThe ROI estimates of DVR from ROI TAC based Logan plot were identical to those calculated directly on DVR images generated by Logan plot:\nDVRðROI TACÞ ¼ 1:00DVR ðROI on parametric imageÞ À 0:00 with R 2 ¼ 1:00:\nThe statistics of DVR images in standard space showed that the standard deviation of DVR pixel estimators from SRTM with LRSC method was about 9% on average lower than those from the Logan plot in control group, and 1% on average lower for the MCI group. The mean images of R 1 and DVR for the control (n = 28) and MCI (n = 6) groups with the mean MRI (n = 34) images are shown by Fig. 7 . The R 1 images of the control group are visually similar to the R 1 images of the MCI group. The R 1 estimates from ROI TAC fitting by RTM3P had Compared to DVR images, R 1 images provided gray-white matter contrast consistent with that shown on the MRIs. This suggests that (1) R 1 can be used for MRI-PET coregistration; (2) R 1 can be used to determine spatial normalization parameters and provide a template for spatial normalization, for both control and MCI groups. Fig. 7 demonstrates that (1) in controls, DVR shows the highest values in thalamus, brain stem, and white matter; (2) the DVRs of mesial temporal cortex, thalamus, occipital cortex, brain stem, and white matter were similar in the control and MCI groups, and (3) the DVRs of caudate, putamen, and cortical regions, including frontal, lateral temporal, parietal, and cingulate, in the MCI group were higher than those in the control group. The quantitative comparison of estimates between control and MCI groups is given in the following section."}, {"section_title": "Comparison of estimates between control and MCI groups", "text": "The comparison of ROI estimates between control and MCI groups is summarized in Table 1 . The R 1 and k′ 2R estimates from the control group were similar to those from the MCI group. The DVR estimates from RTM3P were significantly greater than 1 (or BP > 0) in control and MCI groups for all 15 ROIs. However, the DVR estimates from Logan plots were not significant greater than 1 (or BP > 0) in mesial temporal cortex for both control and MCI groups (p = 0.052 and 0.24 for control and MCI, respectively), and not significantly greater than 1 (or BP > 0) in prefrontal cortex for the control group (p = 0.057). The difference in DVR between control and MCI groups was consistent across different estimates. Based on RTM3P, the DVRs in frontal and cingulate cortex for the MCI group were 38% higher on average than those for the control group. The DVRs in caudate, putamen, and lateral temporal cortex for the MCI group were 25% higher on average than those for the control group. There were no significant differences in DVRs between the control and MCI groups for thalamus, mesial temporal cortex, occipital cortex, pons, midbrain, and white matter, although there was a trend for the DVR for thalamus to be higher in the MCI compared to control group (p = 0.11). Similar statistical inferences were also obtained for Logan plot and parametric image approaches."}, {"section_title": "Discussion", "text": "Three reference tissue models, RTM3P, RTM4P, and RTM5P, were compared for 28 controls and 6 individuals with MCI, who had been studied using [\n11 C]PIB dynamic PET studies. Compared to the RTM3P model, RTM4P and RTM5P models did not yield significant improvements in AIC or estimates. It is notable that Table 1 Statistics of ROI based estimates for control (n = 28) and MCI (n = 6) groups these results were based on a sample with relatively low cerebral [ 11 C]PIB specific binding. To generalize this comparison of the three models, it will be important to evaluate the three reference tissue models for [ 11 C]PIB PET with AD patients in future studies. In general, the performance of reference tissue models is dependent on the tracer kinetics in target tissue and reference tissue. For example, the underestimation of BP from SRTM was significantly reduced by a reference tissue model derived from 1 compartment for target tissue and 2 compartments for reference tissue (equivalent to RTM5P) in [ 11 C]carfentanil and [ 11 C] diprenorphine dynamic PET studies (Zhou et al., 2006c) . As compared to a 2-tissue compartment model with plasma input, the underestimation of [ 11 C]flumazenil BP estimates was (15 ± 0.6)%,\n(1 ± 1)%, and (15 ± 0.5)%, for RTM3P, RTM4P, and RTM5P, respectively (Zhou et al., 2006c) . Variability in the estimates of DVR and k′ 2R was noticeably reduced by the simultaneous fitting approach. Simultaneous fitting of multiple ROI TACs to the model of coupled parameters can be viewed as an approach that applies spatial constraints in parametric space to the model fitting in kinetic space at the ROI level (Zhou et al., 2002 (Zhou et al., , 2003 . However, as the DVR increases, for example in tissues with high density of Aβ, these improvements tend to be smaller. In other words, the DVR estimates from the conventional SRTM (R 1 , k 2 , BP) model fitting tend to be similar to those from RTM3P(R 1 , k′ 2R , BP) with simultaneous fitting methods if DVR ≫ 1 (e.g., DVR ≥ 2 or BP≥ 1). To compare the data from our study to previous results, a concentration ratio (CR) based semi-quantitative method was applied to the measured dynamic PET data for DVR estimates. As demonstrated by Fig. 8 , the DVR estimated by CR was more sensitive to the pre-determined time frame. Consistent with TACs in Fig. 6 , the mean of first 20 min scan [\n11 C]PIB images appears to be an appropriate time frame in trade off between contrast (gray matter versus white matter) or structural information and image noise level. The spatial distribution of CR images tends to be stable in time frames after 40 min post tracer injection. The CR over frames from 40 to 90 min is higher (13 ± 9)% than the DVR estimated from the Logan plot. However, the CR and Logan plot are highly correlated: CRð½40 90Þ ¼ 1:39DVRðLogan plotÞ À 0:33ðR 2 ¼ 0:94Þ:\nThe ROI based kinetic analysis showed that the statistical power to distinguish between control and MCI group for CR ([40 90] ) method is the same as that for the Logan plot and the RTM3P or SRTM model. These results were quite consistent with previous results .\nIt is important to note that 11 C]PIB in spatial accumulation over brain tissues in MCI or AD patients, and less structural information, the CR images from the later phase are not recommended for use in spatial normalization or as a template. Fig. 9 showed that the statistical power to distinguish between controls and MCI individuals by DVR estimates from RTM3P fitting tends to be stable if PET study time is more than 60 min. The difference in DVR from RTM3P between 60 min and 90 min study is less than 4% in the ROIs including caudate, putamen, thalamus, cortex, pons, and midbrain for both controls and MCI. Compared to a 90 min study, the DVR in white matter from a 60 min study is higher by 12% for controls and 10% for MCI group on average. In addition to DVR estimates from RTM3P, the R 1 estimates from SRTM model with linear regression provide relative tracer transport rate (from blood) information, and R 1 images appear reliable for MRI-PET coregistration and spatial normalization. Taking these factors into consideration, the reference tissue model RTM3P is suggested for kinetic analysis, especially where shorter (< 90 min) PET imaging times are required.\nIn summary, reference tissue models with parameter coupling were derived and implemented by simultaneous model fitting for ROI kinetic analysis. A previously developed parametric imaging algorithm, linear regression with spatial constraint for the SRTM model, was evaluated. For comparison, the Logan plot with reference tissue input was applied to both ROI kinetic analysis and parametric imaging. Twenty-eight controls and six MCI participants, imaged with [\n11 C]PIB dynamic PET, were evaluated in this study. Compared to conventional individual ROI TAC fitting, the variation of DVR estimates was reduced by the simultaneous ROI fitting approach, especially in tissues of low or negligible specific binding in this group of individuals with generally low PIB retention. There were no significant differences in both ROI TAC fitting and DVR estimates between the RTM3P and the RTM4P or RTM5P with simultaneous fitting for parameter estimation. As it produces similar results to the more complex RTM4P and RTM5P models, the simpler RTM3P model is proposed for ROI TAC based kinetic analysis in studies using [ 11 C]PIB PET. Thus, we compared the R 1 and DVR images generated by the SRTM with LRSC algorithm to those from the RTM3P ROI kinetic analysis and the DVR images from Logan plot. The RTM3P with simultaneous fitting method is shown to be a robust compartmental modeling approach that may be useful in [ 11 C] PIB PET studies to detect early markers of Alzheimer's disease where specific ROIs have been hypothesized, especially in situations where PIB retention is not high. In addition, the SRTM with LRSC algorithm is recommended for generation of R 1 and DVR images for pixel-wise quantification of [ 11 C]PIB dynamic PET."}]