[{"section_title": "Abstract", "text": "[1] A new World Ocean atlas of monthly temperature and salinity, based on individual profiles for 2003 , is constructed and compared with the World Ocean Atlas 2001 (WOA01), the World Ocean Atlas 2005 (WOA05), and the data assimilation analysis from the Coupled Data Assimilation (CDA) system developed by the Geophysical Fluid Dynamics Laboratory (GFDL). First, we established a global data management system for quality control (QC) of oceanic observed data both in real time and delayed mode. Delayed mode QC of Argo floats identified about 8.5% (3%) of the total floats (profiles) up to December 2007 as having a significant salinity offset of more than 0.05. Second, all QCed data were gridded at 1°by 1°horizontal resolution and 23 standard depth levels using six spatial scales (large and small longitudinal, latitudinal, and cross-isobath) and a temporal scale. Analyzed mean temperature in WOA21c is warm with respect to WOA01 and WOA05, while salinity difference is less evident. Consistent differences among WOA01, WOA05, and WOA21c are found both in the fully and subsampled data set, which indicates a large impact of recent observations on the existing climatologies. Root mean square temperature and salinity differences and offsets of the GFDL's CDA results significantly decrease in the order of WOA01, WOA05, and WOA21c in most oceans and depths as well. This result suggests that the WOA21c is of use for the collocated assessment approach especially for high-performance assimilation models on the global scale. "}, {"section_title": "Introduction", "text": "[2] The gridded World Ocean Atlas (WOA) of the National Oceanographic Data Center (NODC) has been widely used in the ocean modeling community as initial and boundary conditions and as verification data for numerical models. The original WOA product [Levitus, 1982] was updated in 1994 [NOAA, 1994] , 1998 [NOAA, 1998 ], 2001 [Levitus, 2002, hereinafter [Levitus, 2006, hereinafter referred to as WOA05] as new data, particularly Argo profiling floats since the 21st century, became available .\n[3] Black dots of Figure 1 show the horizontal distribution of observation data at 700 m depth in August for the recent 5 years. It is evident that areas where the data are insufficient to produce a reliable analysis field have been decreasing over time, thanks to the successful international Argo project (data available at http://www.argo.net). The Argo array includes more than 3000 robotic floats and is currently providing over 100,000 temperature and salinity profiles worldwide each year. This high-density profile array, without seasonal and spatial bias, makes it possible to produce the three-dimensional oceanic state in near real time. Schmid et al. [2007] described the real time data management methodologies for the global Argo array and pointed out the great potential of Argo profiles for an improved climatology. Ingleby and Huddleston [2007] also developed their new historical database including recent Argo profiles and emphasized the importance of the quality control (QC) process.\n[4] The Argo data covering most of the global oceanic database in the 21st century should be used with the higher QC called ''delayed mode'' because the data cannot be calibrated during their 4 -5 year observation period. However, most of the researchers including NODC have used the Argo data with their own mid level quality checks, even though two algorithms for delayed mode QC had already been developed by Wong et al. [2003] (hereinafter referred to as WJO03) and Böhme and Send [2005] (hereinafter referred to as BS05) and recommended by the Argo community. This means that there have been no corrections for salinity sensor drift in most previous analyses and climatologies using Argo data. As for the temperature, there are almost no differences between real time and delayed mode Argo data, so analyses using temperature data in real time are not seriously compromised. However, some systematic pressure sensor problems affecting temperature and salinity analyses are being reported [Willis et al., 2007; Uchida and Imawaki, 2008] , which will be discussed later in this paper.\n[5] Coriolis (one of the Argo Global Data Assembly Center (GDAC)) has operated the Coriolis Analysis System (CAS). This system produces weekly gridded fields of global temperature and salinity. It also considers the sensor drift with QC algorithms as described by Gaillard et al. [2008] , however their analysis is only limited in the Atlantic Ocean. In this study, we documented a global oceanic data management system mostly based on the delayed mode Argo data set, and produced monthly mean gridded fields of temperature and salinity for 2003 -2007 . This global objective estimate (hereinafter referred to as WOA21c) will be an important database in determining the accurate rate of the oceanic change as well as the quantitative assessment of numerical models. This study is organized as follows: section 2 describes the data used in this study; methodologies for QC and optimal interpolation (OI) are followed in section 3; section 4 analyzes WOA21c comparing with WOA01 and WOA05; section 5 deals with the assimilation assessment. As a target model for our validation, we used the latest results for 2003 -2007 from the state-of-the-art fully Coupled Data Assimilation (CDA) system developed at Geophysical Fluid Dynamics Laboratory (GFDL) [Zhang et al., 2007; , Detection of multidecadal oceanic variability within a coupled ensemble data assimilation system, submitted to Journal of Geophysical Research, 2008] . A summary and conclusion are given in section 6."}, {"section_title": "Data", "text": "[6] The Global Temperature-Salinity Profile Program (GTSPP) has assembled and distributed the up-to-date global temperature and salinity data transmitted by the Global Telecommunication System (GTS). In this study, we used ''best-copy'' data from the GTSPP Continuously Managed Database (CMD). This best-copy data file replaces the real time low-resolution (accuracy) one when NODC provides the full resolution, or fully processed and QC data (data available at http://www.nodc.noaa.gov/ GTSPP).\n[7] As we mentioned in the introduction, autonomous profiling data observed from Argo floats should be used with higher-quality delayed mode. In the Argo data which have been transmitted via GTS within 24 h and stored in the GTSPP CMD, there are no enough information for the delayed mode QC [Carval et al., 2006] . Therefore, we constructed another data-mirroring system from the GDAC in charge of the global Argo data assembling and distribu- tion in NetCDF format with a full salinity accuracy and QC flag. We identified all PFL (autonomous profiling Argo floats) types from the mixed GTSPP data set and then replaced them with the new Argo data set from GDAC.\n[8] We also excluded all BT (Bathythermograph) data types (mostly MBT (Mechanical Bathythermograph) and XBT (Expendable Bathythermograph)) from the mixed GTSPP data set; that is, we used only data types with both temperature and salinity profiles. Moreover, this new data set does not show the systematic warm bias found in XBT, which will be discussed in chapter 4. As shown in Figure 4 , 25.6% of total profiles used in this study are from GTSPP. MRB (moored ocean buoys) data are taking up the large part of our GTSPP data set that had been separated from all PFL and BT types. Most of them are from the Tropical Atmosphere Ocean (TAO) project and restricted around the particular observation points with relatively high temporal observation intervals. The important contribution of this GTSPP data is that they fill in data sparse regions especially around the equatorial Atlantic Ocean where many of the Argo floats with incorrect pressure sensor removed in our analysis were distributed.\n[9] We will use this database based on both temperature and salinity profiles in a series of follow-up studies investigating the global variability of density, steric height, and velocity (transport) fields as well as the corresponding model assessments. We also expect that the GTSPP data identified from Argo and XBT data could be used for checking any systematic biases of in situ data in separate studies."}, {"section_title": "Methods", "text": ""}, {"section_title": "Quality Control", "text": "[10] The QC system for the global temperature and salinity profile data has been developed. First, we carried out the initial data processing with conventional QC based on the NODC technical report [Boyer and Levitus, 1994] and Argo's real time QC manual [Wong et al., 2006] . This conventional QC consists of the real time QC flag check, duplication check for pressure and cycle, impossible value check for position and date, monotonically increasing check for pressure, range/spike/gradient check for temperature and salinity, and visual inspection for suspect data. The majority of profiles (87.3%) passed this conventional QC test (Figure 4) .\n[11] For the autonomous profiling data observed from Argo floats, we applied another separate QC process (delayed mode QC) investigating an artificial salinity offset (including drift). By comparing Argo floats to neighboring hydrographic data, every float with significant salinity offset has been eliminated or corrected. First, we excluded all floats (2.1% of total Argo floats that passed the conventional QC) observed in marginal seas (East/Japan Sea and Mediterranean Sea) from our study, since they should be investigated with a specified regionally adapted QC system [Park and Kim, 2007] . Recently, systematic biases associated with incorrect pressure have been discovered in the some fraction of Argo floats mainly in SOLO (Sounding Oceanographic Lagrangian Observer) floats with FSI (Falmouth Scientific, Inc.) or SBE (SeaBird Electronics, Inc.) conductivity-temperature-depth (CTD) sensors (data available at http://www-argo.ucsd.edu/Acpres_offset2.html).\nWe checked them again on the basis of the Argo gray list provided by Argo community. Argo gray list contains float information with pressure sensor problem as well as other problems such as battery, location and frozen profiling. In this study these profiles were almost completely removed through the QC flag check in our conventional QC routine. We also excluded the premature floats younger than about 100 days (in case the total cycle number is less than 10) since they cannot provide the reliable salinity trend for the delayed mode QC and some of them show the serious biocide wash off problem as well. The recommendation of the Argo community is that there needs to be 6 months of data to be able to quantify the pattern in salinity drift for delayed mode QC. For most of the floats used in this study, a 21-profile criterion has been applied to calculate the time evolution of the potential conductivity slope correction term. We used smaller criteria started from 11-profile series only for some particular rapid biocide wash-off case suggested by WJO03.\n[12] Up to December in 2007, only 25% of total Argo floats have completed a delayed mode QC at each Argo Data Assembly Center (DAC). For about 75% remaining Argo floats that have not been undergone (or completed) the delayed mode QC, we employed WJO03's method except for some cases. For the floats observed in the North Atlantic (15.8% of total Argo floats that need delayed mode QC), we applied BS05's method that considers the hydrographic structure following the large-scale contours of the potential vorticity only in the North Atlantic. Finally we carried out the visual inspection again on the basis of the historical database and neighboring recent floats. This final process takes a long time, but it is very necessary in order to confirm if the calibrated salinities are artificial offsets or natural variability.\n[13] Figure [14] Among the 3,937 floats (328,841 profiles), which have passed the conventional QC, 336 floats (9,861 profiles) show a salinity offset of more than 0.05. This is about 8.5% (3%) of the total floats (profiles). Figure 3a shows the spatial distribution of Argo profiles with salinity offset. This offset has been simply calculated by the difference between the conventional QCed salinity and the delayed mode QCed one averaged from the surface to the parking depth of each profile. Most floats with salinity offset have been found around the costal areas associated with high levels of biological activity causing the biofouling. The Atlantic Ocean also shows the high density of Argo floats with salinity offsets comparing to other oceans, which might be related to the floats age (Most autonomous floats in the early stage of Argo project were deployed around the Atlantic Ocean). Figure 3b shows the same distribution with Figure 3a except on the basis of Argo float types with different CTD sensors. Salinity offsets of more than 0.05 have been found to all float types; that is, there is no significant relationship between salinity drift and particular sensor problems discovered in the some fraction of SOLO floats.\n[15] We have summarized all QC procedures with every single rejection percentage using the flowchart in Figure 4 ."}, {"section_title": "Optimal Interpolation", "text": "[16] QCed data for global temperature and salinity profiles have been optimally interpolated to monthly 1°grid after the linear vertical interpolation for the 23 standard depths from 10 m to 1500 m. The OI method used in this study is originally based on the Gauss-Markov theorem which gives a linear estimate that is unbiased and optimal in the least square sense. This provides an estimate of the uncertainty (error variance) that takes into account the distribution of the data used [Bretherton et al., 1976; McIntosh, 1990] . Following is the overall OI algorithms that were similarly used in this study during the delayed mode QC. Observation data used for this OI version are also selected by three-step criteria guaranteeing no spatial bias, which would be efficient for the objective analysis studies dealing with autonomous float data. Therefore, we picked up and modified this approach.\n[17] The covariance of the data is assumed to be Gaussian with the decay scales determined by four different parameters following Hadfield et al. [2007] : a longitudinal scale (Lx), a latitudinal scale (Ly), a cross-isobath scale (F), and a temporal scale (t). In this study, each spatial scale consists of large (Lx 1 , Ly 1 , F 1 ) and small scales (Lx 2 , Ly 2 , F 2 ), respectively. We determined the scale values at Lx 1 = 10°, Ly 1 = 5°, F 1 = 0.5, Lx 2 = 5°, Ly 2 = 3°, F 2 = 0.25, t = 35 days with careful consideration on the basis of the number of the data within the selected correlation scales. The spatial scales are anisotropic, with Lx greater than Ly to reflect the predominant zonal currents in the ocean interior.\n[18] The objective estimate (T(S) obj ) of the temperature (salinity) at each grid point of standard depths is given by\ndenotes the set of selected ''N'' temperature (salinity) profiles to the grid point being interpolated to and hdi denotes the mean value of the set d. For the insufficient observed data and smoothing effect, most of the previously documented mapping methods have taken the climatology such as WOA01 as a mean value hdi.\nIn this study, we use the mean value of N based on observed data set instead of climatology in order to avoid any contamination of ocean state in the 21st century from the climatology based on the historical data set, mainly in the 20th century.\n[19] N is selected on the basis of three criteria, following both WJO03 and BS05:\n[20] 1. One third of total data points within Dx i,g 2 /Lx 1 2 + Dy i,g 2 /Ly 1 2 + F i,g 2 /F 1 2 < 1 (i.e., within the e-folding distance of the covariance function to be used) are randomly selected. Dx and Dy are the spatial distances between the observed data (subscripts i) and the grid point (subscripts g) in zonal and meridional directions, respectively. F is the fractional distance in potential vorticity representing the cross-isobath separation. F is calculated using the following formula,\nwhere PV is the barotropic potential vorticity, f/H, f is the Coriolis parameter and H is the full ocean depth. The inclusion of the cross-isobath separation considers the tendency of ocean currents to follow the bathymetry (BS05). We did not make any estimated value at the grid point where the total data points within the e-folding distance of the covariance function are less than 10 (See the blank areas in Figure 1 ).\n[21] 2. From the remaining data points, one third of the profile data within the shortest generalized distance scaled by the large length scales, Dx i,g 2 /Lx 1 2 + Dy i,g 2 /Ly 1 2 + F i,g 2 /F 1 2 are selected.\n[22] 3. Again from the remaining data points, one third are selected that have the shortest spatial and temporal separation factor using the short length scales and the temporal scale, Dx i,g 2 /Lx 2 2 + Dy i,g 2 /Ly 2 2 + F i,g 2 /F 2 2 + Dt i,g 2 /t 2 . Dt is the temporal difference between the observed date and 15th day of each month to be mapped. Using these threestep criteria, a set of profiling data is provided, which is not spatially biased (WJO03 and BS05).\n[23] w is the weighing matrix (w = CdgÁ[Cdd + IÁ hh\n) including data-grid (Cdg) and data-data (Cdd) covariance matrix and random noise (hh 2 i). As in the papers by WJO03 and BS05, a two-stage mapping is also employed. In the first stage, the covariance is a function of the large-scale spatial separation only: obj (1) is a large-scale estimate without respect to temporal variability or small-scale features.\n[25] In the second stage, the residuals from the first stages are mapped to the grid point using (1), but with a covariance that is a function of the small-scale spatial and temporal separation. [26] The second stage estimate T(S) obj(2) thus resolves the small-scale features.\n[27] The final objective estimate at each grid point is then the sum of the two stage of mapping (T(S) obj = T(S) obj(1) + T(S) obj (2) ). Therefore this objective estimate is composed of selected observed data close to the grid point in space and time relative to the spatial (Lx 1 , Ly 1 , F 1 , Lx 2 , Ly 2 , F 2 ) and temporal (t) scales. The final error variance of the objective estimate is taken form the second-stage mapping [McIntosh, 1990] :\nCdg(x, y, t) Â Cdd(x, y, t) À1 Â Cdg(x, y, t) T where the overbar is an average over all mapped residuals."}, {"section_title": "Comparison With WOA", "text": "[28] The WOA21c analysis, based on the high-quality profile data set for 2003 -2007 , has been compared to WOA01 and WOA05 on global and basin scales.\n[29] Figure 5 shows the horizontal distribution of annual temperature and salinity fields at 10 m depth. WOA21c clearly depicts the large-scale gradient patterns associated with temperature and salinity fronts and a large pool of homogenous water. The error variance of temperature is large in the Kuroshio, Gulf stream, Agulhas, and Brazil current regions. In addition to the strong western boundary currents, the variability of fresh water flux makes the error variance of salinity increase near the equatorial ocean and major run off regions. At the 1500 m depth as shown in Figure 6 , Mediterranean outflow can be found both in temperature and salinity fields. The horizontal distribution of a water mass (salinity range from 34.2 to 34.5) is very clear both in WOA01 and WOA21c. Large error variance at 1500 m depth is shown around the Mediterranean outflow and Antarctic circumpolar current regions.\n[30] Overall horizontal distribution patterns of temperature and salinity of WOA21c is in agreement with the WOA01. However, there are significant differences between the WOA21c and WOA01. Overall warming in WOA21c is apparent. Freshening (Salting) at 10 m depth is seen throughout the North Pacific (Atlantic). Another freshening signal is found throughout the Western Pacific, while salting is shown over the South Pacific Ocean. These results are in agreement with previous studies focusing on the (multi) decadal variation of salinity in global or basin scale Polyakov et al., 2005; Boyer et al., 2007; Delcroix et al., 2007] .\n[31] Most likely, the primary reason for this difference between WOA21c and WOA01 is related to the water mass variability on interannual, decadal, or longer timescale. For instance, ocean surface water during 2003 to 2007 happened to be particularly warm and fresh over much of the North Pacific. Another potential issue is related to the sampling bias of observation data and the discrepancy of analysis methods between WOA21c and WOA01. In this study, a sampling experiment was carried out using additional climatology, WOA05. WOA05 employed very similar methods on the data QC and objective analysis compared to WOA01, but WOA05 used more recent observation up to February 2005 (WOA01 is up to August 2001) [Levitus, 2006] .\n[32] Figures 7a and 7c show the global mean (0°-360°, 60°S-60°N) temperature and salinity in the upper ocean (10 -700 m) estimated by WOA01, WOA05, and WOA21c, respectively. Dotted lines are fully sampled annual cycle of WOA01 (black) and WOA05 (green). Solid lines are subsampled WOA01 (black) and WOA05 (green) data based on the distribution of WOA21c (red) spatially and monthly Figure 1 ), significant differences still exist. Subsampled WOAs (solid lines) have no seasonal amplitude as well. The fully sampled annual phase reflects the peak warming in Austral summer since two thirds of the world's oceans lie in the Southern Hemisphere. Therefore, undersampling around the Southern Hemisphere appears to be the primary cause of the discrepancy in the global ocean scale. Other data-sparse regions around marginal seas and the central Atlantic Ocean where most of the SOLO floats with FSI and SBE CTD sensors had been deployed could be other sources for discrepancy, even though GTSPP data somewhat filled these data-sparse areas as mentioned in chapter 2. This result suggests that the observation data density for 2003 -2007 is not adequate to resolve the absolute global temperature and salinity.\n[33] However, the difference among WOAs shows the consistent variability in time regardless of the sampling issue. Dotted black lines in Figures 7b and 7d indicate the difference between fully sampled WOA05 and WOA01. Solid black lines show the same information for subsampled data. In general, temperature of WOA05 is higher than that of WOA01. This warming difference is apparent during boreal summer both in fully and subsampled data. For the salinity difference, salting is dominant during boreal summer and vise versa both in fully and subsampled data. It is also important that the consistent trends have been found at the difference results between WOA21c and WOA01 (solid red lines whose scales have been divided by 5°C and 4 psu, respectively). In this study, our emphasis is not a investigating the absolute temperature and salinity of individual ocean but the relative difference among WOAs, so that hereafter we will deal with only subsampled WOAs.\n[34] Figure 8 shows the vertical difference of the annual mean temperature and salinity among WOA21c, WOA01, and WOA05 for each ocean basin from 10 m to 1500 m depth. Over most of the major ocean basins, warm differences in WOA21c are dominant over all depths except for the mid (100 -1000 m) layer of the South Pacific and the Indian Ocean. For the salinity, the North Pacific exhibits a strong freshening around upper layer. In contrast, all other areas experience salting biases, while slight freshening is evident below mid (200 -800 m) layer. When the difference between the WOA21c and WOA05 is calculated (blue lines in Figure 8 ), it is obviously smaller than the result between WOA21c and WOA01 (red lines in Figure 8 ) in all regions and all depths. Statistical values such as bias and root mean [35] Recently, two kinds of instrument biases that might cause the difference between WOA21c and WOA01 (WOA05) have been reported. One is the warm bias in XBT data associated with the fall-rate equations [Gouretski and Koltermann, 2007; Willis et al., 2007; Wijffels et al., 2008] . These XBT data were already used in WOA01 and WOA05 (not in WOA21c). As shown in this study, WOA21c is warmer than WOA01 and WOA05 in general. Without the XBT bias in existing climatologies, presumably, WOA21c would be warmer than the others. The other bias is the large-scale cold bias in Argo data that is related to the systematic pressure sensor error [Uchida and Imawaki, 2008] . This case is in addition to the SOLO floats as mentioned in previous chapter. Since the observation in the 21st century is relying mainly on Argo floats, this case causes a negative bias on the global heat content and steric height as well as our WOA21c. When this Argo systematic bias would be identified and corrected again, WOA21c would be warmer than WOA01 (WOA05), too. Even though we consider these two possible systematic biases, it is apparent that the analyzed mean temperature in WOA21c is warm with respect to WOA01 (WOA05). We expect that more detailed analyses unveiling these instrument biases will be completed by further studies."}, {"section_title": "Assimilation Validation", "text": "[36] In this section, we present the collocated assimilation model assessment approach by using WOA01, WOA05, and WOA21c, respectively. So far, most large-scale assimilation studies have applied their assimilation systems in the perfect model (twin experiment) context in which an arbitrary model simulation result is considered as a true status. One of the reasons for this perfect model assumption is that assimilation performance is hard to validate using real observations because a reasonable true status based on observations have been unknown because of the data density and quality problems on a global scale. However, most oceanographic communities want to check the base model performance and assimilation results in the real oceanic state by applying the real interannual forcing. Therefore, they have used WOA01 (WOA05) as a data source for their large-scale data-model comparison. In this study, we developed the monthly three-dimensional gridded fields (WOA21c) representing the global ocean state in the 21st century, so that it will be interesting and meaningful to address the direct model-data comparison result using WOAs.\n[37] As a target model for our validation, we used the latest results for 2003 -2007 from the fully CDA system developed at GFDL (hereinafter referred to as GFDL CDA 21c). Since GFDL CDA 21c used no flux restoring based on climatology, this validation using WOAs will be meaningful. This assimilation system employed two-step data assimilation procedure for an Ensemble Kalman Filter under a local least squares framework with superparallelized technique applied to GFDL's coupled climate model (CM2) [see Zhang et al., 2007, Figure 2] . The ocean component of CDA is the fourth version of the Modular Ocean Model (MOM4) configured with 50 vertical levels (22 levels of 10-m thickness each in the top 220 m) and 1°by 1°horizontal B-grid resolution, telescoping to 1/3°meridional spacing near the equator. A totally independent ensemble initial condition for CDA is formed by combining the atmosphere and land states at 0000 UTC 1 January of years 1973, 1974, 1975, 1976, 1977, and 1978 with the ocean and ice state at 0000 UTC 1 January 1976 of the GFDL IPCC historical run using temporally varying Green House Gas and Natural Aerosol (CHGNA) radiative forcing from 1861. The IPCC control and historical runs themselves were initialized by spinning up the CM2 for 380 years from the previous integration [Stouffer et al., 2004] with 1860 fixed year radiative forcing. Since 1976, oceanic observations (World Ocean Database (WOD) for the 20th century assimilation and Argo profiles for the 21st century assimilation) were assimilated into the CDA with careful consideration of temperature and salinity covariance (See Figures 5 and 6 in the paper by S. Zhang et al. (submitted manuscript, 2008) ). A significant improvement in the data assimilation's skill is seen when the Argo observation data is included, which is strongly related to the data coverage of Argo network since the sampling coverage has a large impact on the inferred temperature variability as pointed out by AchutaRao et al. [2006] . More details about CDA system and previous assimilation results in the 20th and 21st century can be found in the papers by Zhang et al. [2007] and S. Zhang et al. (submitted manuscript, 2008) .\n[38] In this section, we will show the latest CDA results using a direct comparison with our new gridded data set. In order to undertake the model-data comparison, all WOAs with 1°by 1°horizontal resolution and 23 standard depth levels were projected to the model grids. We converted in situ temperatures of all WOAs into potential temperatures as well.\n[39] Figures 10, 11, 12, 13, 14, 15, 16, and 17 show the vertical structure of the potential temperature and salinity averaged over individual ocean basins for 2003 -2007 , and the corresponding time series at 15 m, 205 m, 618 m, and 1364 m depth, respectively. As we mentioned in Figure 7 , it should be noted that grid points where the observation data are insufficient to produce reliable mapping estimates have been excluded from the box average in the same manner for WOA21c, WOA01, WOA05, and GFDL CDA 21c.\n[40] In general, GFDL CDA 21c is in line with WOAs. However, GFDL CDA 21c has systematic bias underestimating the salinity below 205 m depth except for the Atlantic Ocean (The North Atlantic (Figure 12 ) shows no significant model bias and the South Atlantic (Figure 13 ) overestimates the salinity below 600 m depth). These freshening biases gradually decrease in time associate with the dynamic adjustment process. This tendency can be clearly found at the 205 m depth in the Southern Hemisphere (South Pacific (Figure 11 ), South Atlantic (Figure 13 ), South Indian (Figure 15 ), Antarctic Ocean ( Figure 16 ) and World Ocean (Figure 17) ). In the 21st century, we have almost same amount of salinity profiles compared to the temperature from Argo floats (In the 20th century, only temperatures profiles were dominant mainly from MBT and XBT). Increase of uniform salinity profiles makes it possible for assimilation system to adjust the simulated salinity field to the observation especially below the surface layer in the Southern Hemisphere over time. For the surface, there is little tendency of salinity adjustment because the fresh water flux (precipitation minus evaporation) from the atmospheric data assimilation strongly affects the oceanic condition as a surface boundary condition. Adjustment for the temperature has already been reached before 2003 year because of high sampling from MBT and XBT in the 20th century (see Zhang et al., submitted manuscript, 2008, Figure 7) .\n[41] GFDL CDA 21c shows the consistent biases with WOA21c when it compared to the WOA01 and WOA05 as shown in the previous section (Warming in all oceans, freshening in the North Pacific and the Antarctic Ocean, and salting in the North Atlantic). This result reflects the large assimilation effects for 2003 -2007 . Figure 18 shows the vertical difference of the annual mean temperature and salinity for individual ocean basins in 2007. Red lines are mean differences between GFDL CDA 21c and WOA21c in 2007, which exactly represents the model biases. Figure 19 shows the root mean square temperature and salinity difference and offset of GFDL's CDA result compared to the WOA21c, WOA01, and WOA05 averaged from 10 m to 1500 m depth over the individual oceans in 2007. It is evident that statistical values dramatically decrease when we used WOA21c for the assimilation validation. These differences significantly decrease in the order of WOA01, WOA05, and WOA21c, which reflects the consistent trend of oceanic climate change as discussed in the previous section. In general, it should be noted that it is likely to underestimate the assimilation performance from the GFDL's CDA when we use the climatology such as the WOA01 or WOA05 as the data set for the model assessment. However, there are some areas where the model agreement is better with WOA01 (WOA05) than with WOA21c. For instance, when we take a look at the temperature (salinity) at 100 m depth of the Antarctic Ocean (North Indian) in 2007 (Figure 18 ), model seems to have no bias compared to WOA01 (WOA05), even though there is an apparent cold (fresh) bias compared to the WOA21c. We claim that this is an overestimating case when we use the existing climatologies for the model assessment."}, {"section_title": "Summary and Conclusions", "text": "[42] We have presented and analyzed a new monthly gridded data set of global temperature and salinity. The product is based on the compilation of the identified GTSPP and Argo data from 2003 to 2007. The main improvement of our climatology as compared to previous studies is that is based on the high-quality profile data set with no systematic errors (XBT fall-rate equation problem, Argo pressure sensor (SOLO floats identified to date) and salinity offset problem). In this study we employed WJO03's and BS05's methods to complete delayed mode QC for 3,937 Argo floats that have not undergone (or completed) the delayed mode QC at the respective DACs. 8.5% (3%) of total Argo floats (profiles) show the significant salinity offset of more than 0.05 and they are mostly found around the coastal areas and the Atlantic Ocean.\n[43] In order to undertake the comparison with existing climatology and assimilation result, the observed data were optimally interpolated in space and time using six spatial scales (large and small longitudinal, latitudinal, and crossisobath) and one temporal scale. This three-dimensional gridded field retains more realistic and detailed structures, since no merging with background fields such as climatological mean or model outputs has been applied. The warm difference in the 21st century is apparent from 10 m to 1500 m depth, while salinity change is different in every ocean and depth. At 10 m depth, large-scale freshening is seen throughout the North and western Pacific, while salting is shown over the subtropical South Pacific and the North Atlantic. The North Pacific exhibits a strong freshening up to 600 m depth. In contrast, all other areas experience a salting period with slight freshening below mid (200 -800 m) layer. We expect that physical interpretations on the oceanic variability in the 21st century will be followed in further studies.\n[44] Our new data set has been applied to the assimilation assessment. The CDA system based on GFDL's climate model is clearly in line with WOAs except for some systematic salinity bias below the surface layer. However, these biases gradually decrease over time associated with the increasing of salinity profiles especially in the Southern Hemisphere. The best fit with model results is WOA21c in most ocean and depth, which indicates the assimilation effects for 2003 -2007 . Bias and RMSE of temperature and salinity difference significantly decreases from WOA01 to WOA21c in most ocean basins.\n[45] In this study, we emphasized the large impact of recent observation on the existing climatology and the success of the CDA system developed at GFDL. Our new data set based on individual profiles from Argo and GTSPP in near real time will be updated every month. This updated WOA21c will be used for an operational prediction model as their initial and boundary condition as well as their validation source in the 21st century simulation, while WOA01 (WOA05) will be continuously used for model spin-up and validation source for the hindcasting studies including a numerical scheme development. This highquality data set both in temperature and salinity field makes various follow-up studies possible as well. Our next multidecadal CDA will be consistently compared against the same data set, and more detail assessments will be addressed around ocean basins where model biases are conspicuous. We will investigate the variability of not only temperature and salinity fields, but also density and velocity (transport) by using additional sea level data. This must precisely quantify the model sensitivities to resolve the physical processes, numerical choices, and assimilation effects. These studies can also help evaluate existing or future ocean observing systems in terms of advanced quality control especially for in situ data biases associated with the particular sensor problem, sampling errors, objective analysis methods, and a strong link between the observational and numerical oceanographic communities, which is very important."}]