[{"section_title": "Abstract", "text": "We use the American Recovery and Reinvestment Act (ARRA), a large stimulus package passed into law to combat the Great Recession, to estimate the effect of R&D and science spending on local employment. Unlike most fiscal stimuli, the R&D and science portion of ARRA did not target counties with poor economic conditions but rather was awarded following a peer review process, or based on innovative potential and research infrastructure. We find that, over the program's five-year disbursement period, each one million USD in R&D and science spending was associated with twenty-seven additional jobs. The estimated job-year cost is about $15,000.\nJEL Codes: E24, E62, E65, H59, I28, O38."}, {"section_title": "", "text": "plier on R&D and science and an aggregate multiplier on all government spending.\nWe treat the measurement of a fiscal multiplier on R&D and science spending as an empirical question. While discrepancies among multiplier estimates in the literature may reflect differences in macroeconomic conditions, the form of the stimulus (e.g., tax cuts, direct spending, or transfers), data sources, or the estimation approach, we investigate the possibility that differences in the spending purpose directly affect the multiplier.\nWe abstract away from the general equilibrium effects of fiscal stimulus and estimate a local multiplier. Note that a local multiplier is a different indicator than the national multiplier in a Keynesian model. The national multiplier represents the value (in dollars of GDP or number of jobs) created after the government adds a dollar of stimulus to a closed economy. The national multiplier is higher when interest rates are low [Woodford, 2011] , higher during recessions [Auerbach and Gorodnichenko, 2012] , and lower for temporary increases in government spending [Baxter and King, 1993] . The local multiplier measures the change in the output or employment after adding a dollar of government spending to a smaller open economy, such as state or county, relative to other open economies within a fiscal union [Nakamura and Steinsson, 2014] . Unlike the national multiplier, the local multiplier estimated here is not sensitive to macroeconomic changes, like changes in the interest rate, that are common to all economies in a fiscal union. It is still affected by labor underutilization during recessions, as that varies across counties.\nThe variation used to estimate local multipliers comes from county-or state-level differences. Local fiscal multipliers, especially at the county level, may be estimated more precisely than a national multiplier because of a larger sample size. They, however, are sensitive to attenuation bias from measurement error in the location of spending. This paper uses new, more carefully constructed measures of the location of ARRA spending in order to reduce attenuation bias. Local multipliers are also sensitive to spillover effects from cross-county or cross-state mobility: they are increased by labor mobility if spending attracts in-migration to counties that receive more spending and they are decreased by mobility in consumption if employees spend their additional income in neighboring counties or states.\nWe examine changes in employment in response to federal spending on R&D and science in the context of the American Recovery and Reinvestment Act (ARRA). The ARRA was signed into law in February 2009. Its goal was to provide a large federal stimulus to reduce the toll of recession on the American economy. The large size and the speed of disbursement were two important aspects of ARRA. It generated a quantitatively significant, largely unanticipated shock to government spending. 3 As we discuss further below, R&D spending was particularly unanticipated, making it especially approapriate for estimating causal effects.\nWhile most ARRA spending targeted areas hit hard by the recession, the geographic allocation of R&D and science spending was intended to be exogenous to economic conditions. The allocation was based on a peer review process or the availability of resources to carry out research projects. For example, when the stimulus bill was passed, National Science Foundation (NSF) program officers funded deserving proposals they had not previously had the resources to fund. Approximately 80% of stimulus-backed awards went to projects submitted prior to ARRA. The National Institutes of Health (NIH), on the other hand, issued a call for new proposals to be funded under ARRA [?] . Even there, the recipients had to be institutions that were prepared to submit a credible NIH proposal under a very tight deadline, so the geographic allocation primarily reflected local scientific capability.\nEven though these grants were allocated based on scientific merit or capability, they were not assigned randomly. This presents a challenge in measuring the effect of ARRA research spending on local employment. The counties receiving ARRA research awards may be different from other counties in ways that influence employment trends. In addition to controlling for factors affecting employment and modeling a change in employment trend for each county, we employ a two-stage strategy to reduce endogeneity problems. First, we estimate the probability of selection into receiving ARRA research funds and construct an inverse Mills ratio term to capture it. A county's research intensity is the main predictor of selection into receiving ARRA research award and award's size. We use two dummy variables as excluded covariates of research intensity: whether a county has a research university and whether there is at least one person employed in R&D and science services in the county prior to the recession. We estimate a cross-county IV regression on a subsample of counties with R&D and science awards to estimate the effect of ARRA research awards on the change in employment. We use the inverse Mills ratio from the selection equation and two new instruments: the natural logarithm of doctoral degrees issued in a county in 2010 and the number of individuals employed in R&D and science per capita in 2007, in the cross-county IV regressions.\nWe find that during ARRA disbursement period, which lasted from 2009 to 2013, 27 jobs were added in response to one million USD in ARRA stimulus on R&D and science. Traditionally, the multiplier is presented in a form of a job-year cost. Converting our baseline result into job-year cost is not straightforward because the disbursement of ARRA funds took place over five years, the average length of a project exceeded two years, and the data on yearly payments are not available at the county-level. Taking all these into account leads to an estimated $15,000 USD per job-year, one of the lowest estimates in the recent literature on fiscal multipliers.\nBy providing an estimate of the fiscal multiplier on R&D and science spending, we contribute to the economics literature in two ways. First, we contribute to the literature on fiscal multipliers. We provide the first estimate of the multiplier on R&D and science spending. We also contribute to the literature on the effect of R&D and science on local economy. Hausman [2012] measures the effect of university innovation on long-term economic growth of local economies. She finds that an additional $10 million of the Department of Defense (DOD) funding or $7 million of NIH funding before 1980 generated an additional job per county-industry after 1980. Dinerstein et al. [2014] find no evidence of employment growth in counties around universities in response to federal research funds. We study federal spending on R&D and science in general, not just spending on universities or in university counties, and focus on the short-term effects on local employment during and after the Great Recession, and find much larger effects."}, {"section_title": "Empirical Model", "text": "Our goal is to evaluate the effect of ARRA R&D and science spending on the change in local employment at the county level. We start with a simple model which estimates the average number of jobs created in a US county over ARRA disbursement period in response to a million USD in research spending. In our baseline specification, we use the change in employment from 2009 to 2013, a time period over which ARRA funds were disbursed to recipients in full, to capture all the spending shocks that accrued due to ARRA. The equation below captures this framework:\nEmp \nwhere Emp c,t is employment in county c in year t, Pop c,t is population in county c in year t, ARRA Res c is total ARRA spending on research in county c in 2009-2013, X c is a vector of control variables, α s is a state-level shock, and ε c is an error term. This specification follows estimation strategies in earlier literature on cross-sectional fiscal multipliers [Chodorow-Reich et al., 2012; Wilson, 2012] . The minor difference is that we are estimating county-level multiplier. State-level multipliers are more common in the earlier studies.\nThe counties which received research awards under ARRA are, on average, larger than all other counties. 4 To account for that, we scale the outcome variable and all ARRA variables by the population averaged over disbursement period following the standard practice in the literature. We scale employment-based control variables by the population averaged over respective time periods.\nWe estimate the effect of ARRA research spending on employment at the county level. Because US counties are open economies, we have to account for spillover effects from different sources: worker spending outside a county, cross-county mobility for job opportunities, and mis-measurement of money flows from primary contractors to subcontractors and vendors. There is an important difference between attenuation due to open economy and due to mismeasurement or misreporting of the geography of spending. The spillovers from cross-county spending and labor mobility are inherent in the level of analysis. We test whether factor mobility is driving the estimates, but it doesn't necessarily make the estimates wrong. The location of spending, on the other hand, is a measurement issue, and we address that by providing a precise match between ARRA spending and geographic location of all recipients, including vendors and subcontractors.\nThe spillover effects of the worker spending in other counties and mis-measurement of money flows cause the attenuation of estimates. The worker cross-county mobility leads to the overestimation of the effect. We control for spillover effects in two ways: track subcontractor and vendor transactions to their zipcodes 5 and control for ARRA research spending in adjacent counties. It is also possible that some counties received more ARRA stimulus in general due to seniority and political weight of their representatives. We proxy this \"clout\" with ARRA spending on all other issues.\nWe control for a number of factors which are correlated with the pace of economic recovery. We include the change in employment from 2007 to 2009 because counties that lost fewer jobs during recession might have less room to add new jobs during recovery. The postrecession employment changes might differ between urban and rural counties or depend on the fraction of manufacturing jobs in a county. For this reason, we add an indicator for metropolitan county and per capita count of individuals employed in manufacturing before recession. We also include state fixed effects to account for differences in post-recession recovery across states. Even after controlling for different characteristics of a county that are relevant to the changes in employment, we cannot exclude the possibility of county-specific trends. To alleviate this issue, we use prior data to model county-specific trends in employment changes over five-year periods on a rolling basis. We then extrapolate out of sample to predict the change in employment from 2009 to 2013 for each county.\nWe rely on a number of ARRA features to reduce concerns about strategic hiring and reallocation of funds. The stimulus was largely unanticipated by the final recipients. This is especially true for research spending. It does not fall under the areas traditionally subsidized during recessions and was not expected to be a part of ARRA until the last moment. This situation is somewhat unique as anti-recessionary spending is often anticipated.\nWe address the possibility of substitution between ARRA research awards and other sources of R&D and science funding. There is no evidence of substitution between ongoing federal spending on R&D and science and ARRA research awards. The federal government gave out ARRA stimulus in addition to the federal R&D and science awards. The latter were trending flat over the past decade. Figure 1 from Hourihan [2015] , shows ARRA R&D spending as a \"bump\" on top of a flat trend in federal stimulus for R&D. While somewhat less likely, it is possible that some recipients, mostly large universities, are not budget constrained and there is a substitution between ARRA research funds and institutions' own resources. However, universities' own institutional spending on R&D continued to increase over this time period according to the Higher Education Research and Development (HERD) survey. Recent economics lit-erature provides evidence that federal aid caused universities to increase their investment in research and human capital [Dinerstein et al., 2014] . The same study acknowledges a slight reduction in endowment spending for private universities and state appropriations for public universities. These findings can be interpreted as a substitution effect but it is not sizable.\nYet, there are challenges in measuring the effect of ARRA research spending on local employment. The awards are not assigned randomly. There is a possibility that the counties receiving ARRA research awards are different from other counties. We use a Heckman-type correction to account for non-random selection of counties into receiving ARRA research awards. We estimate the probability of a county receiving an ARRA research award using all control variables and two good predictors of a county receiving ARRA research stimulus. They are a dummy for a research university in a county and a dummy for having any people employed in R&D and science services in a county before the recession. We estimate the following selection equation using probit:\nwhere Res Uni c is the dummy variable for a county with research university, Res County c,2007 is the dummy for a county with employment in R&D and science services in 2007, δ s is a state-level shock, and υ c is an error term.\nWe construct an inverse Mills ratio,λ c , using predicted values from the estimated probit model. The inverse Mills ratio corrects the bias from non-random selection of counties into receiving ARRA research stimulus in a sample of counties with non-zero ARRA research awards.\nWe need to account for the endogeneity of ARRA research stimulus. This endogeneity is, in principle, less serious than for other types of federal spending, such as spending on unemployment or housing. Research awards are not assigned based on the socio-economic conditions of a county. Recipients received ARRA funds based on peer review, innovative potential, or existing infrastructure for scientific and technological discovery. Even though research awards are not based on socio-economic conditions of a county, they cannot be considered independent of them. The data show that counties with large research awards are more populous, urban, affluent, and have more complex industrial structure. One possibility is that counties with large research awards grow faster than counties with small awards. Another possibility is that counties with large research awards can smooth recessions better and have little room to add new jobs during the recovery.\nWe employ an instrumental variable strategy to account for resulting endogeneity. We use two different predictors of ARRA research stimulus, a natural logarithm of doctoral degrees awarded at the universities in a county in 2010 and the number of people employed in R&D and science services per capita before recession, as instruments. We also include the inverse Mills ratio,λ c , in the first stage to correct for the selection bias in ARRA counties with research \nwhere κ s is state-level shock, and η c is the error term."}, {"section_title": "Data", "text": "Total ARRA spending was an estimated $831 billion 6 , including contract, grant, and loan awards, expansion of entitlement programs, such as food stamps and unemployment insurance, direct grants to states, Medicaid match program, tax benefits and federal government consumption and investment. We will focus on ARRA transfers to individuals, businesses, and local institutions. The total amount of ARRA contract, grant, and loan awards reported by recipients is approximately $278 billion, or about one-third of all ARRA spending. 7 This number does not include other components of ARRA. Our main data source is the Cumulative National Summary of ARRA recipient reports. 8 The data contains reports from local governments, private entities, and individuals on the amount of stimulus received under ARRA.\nThe data on the Cumulative National Summary of Recipient Level Reports has a multi-level structure. Figure 1 provides an example to illustrate the hierarchy of ARRA award recipients in the data.\nWe observe the flow of funds from primary contractor to subcontractors and vendors. Most recipients disclose a place of performance (POP) with a five-digit zip code. We supplement zip codes from vendors' DUNS using Dun & Bradstreet Unique Partner Identification Key. We then map zip codes to US counties using US Census Zip Code Tabulation Area, look-up feature of Melissa Data, and HUD USPS zip code crosswalk files. Zip codes that cover two or more 6 Original estimate was $787 billion. It was later adjusted up, to $831 billion [Congressional Budget Office, 2012] . 7 Author calculations based on the recipient reports in the Cumulative National Summary. 8 We downloaded the last version of these reports from the Federal Procurement Data System on October 26, 2015. The data collection at recipient level was finalized on September 30, 2015. There will be no further updates to this data set [?] . Before September 2015, this data was hosted on Recovery.gov. counties were assigned weights based on the county population share in the zip code using HUD USPS zip code crosswalk file. Table 1 presents the results of matching recipients' POPs to US counties. We match $270,334 million of ARRA awards from the Cumulative National Summary to a POP in a US county. Because ARRA reports allow us to trace both disbursement to a primary recipient as well as subcontracts we are able to trace spending with a high degree of local specificity. In other words, these data provide new and heretofore unused information about the national geography of R&D stimulus spending and thus support the local, countylevel, models we estimate.\nCounty level spending data are matched to public information about employment. We use data on total county employment and county employment in the private sector from the Bureau of Labor Statistics (BLS) Quarterly Census of Employment and Wages (QCEW). 9 We use annual average employment because we do not know specific dates of ARRA spending shocks to county employment. 10 We use data on total employment in a county to account for both direct and indirect job creation following ARRA stimulus and avoid the issue of overestimating the number of jobs if employees are switching jobs to fill in the positions funded by ARRA in the same county [Jones and Rothschild, 2011] .\nWe use the QCEW for a control variable, the number of manufacturing jobs per capita in a county before the recession. For the number of people employed in R&D and science, we use data on county-level employment in scientific research and development services (NAICS (2012) code 5417) from the US Census County Business Patterns.\nThe literature in economics does not provide an established definition of research spending. We thus calculate two alternate measures of R&D spending that rely on the missions of federal agencies that made grants and the purposes reported specifically for ARRA spending. Calculating those measures relies on two data sources, the Catalog of Federal Domestic Assistance (CFDA) and \"Where Does the Money Go?\" map from the Recovery.gov website, to define ARRA funds which contribute to R&D and science.\nFor every US county, we track research spending under ARRA to the zipcodes within its borders and also to the adjacent counties. We determine adjacent counties using US Census data on county adjacency from 2010.\nAll employment and ARRA spending variables are scaled by county population from the US Census Annual Estimates of the Resident Population by County. 9 The Cumulative National Summary of ARRA recipient reports contains information on the number of jobs reported by ARRA recipients. We do not use this data for three reasons. First, they do not account for the jobs created indirectly, by recipients spending their income in the local economy. Second, the jobs are reported by the primary contractor and should represent the sum of all jobs created or retained by primary contractor as well as its vendors, subcontractors, and their sub-vendors. We can not track these jobs to the geographic location of subcontractors, vendors, and sub-vendors. Third, these job numbers are approximations resulting from primary contractors' uncertain knowledge about the linkage of ARRA spending to a specific job, as well as recipients' lack of incentive to calculate them precisely. 10 The Federal Procurement Data System provides the data on spending disbursed over five-year period from 2009 to 2013 and spending disbursed in Q4 2013. We, therefore, can not construct a panel as the timing of disbursement at a quarter-level is not available.\nTo control for the type of county, we identify metro counties using Rural-urban Continuum Codes (2013) published by the US Department of Agriculture and counties with research universities using the Carnegie Classification (2010) and the Post-secondary University Survey (2013) published by the US Department of Education. We obtain the number of doctorate degrees awarded in a county from the Carnegie Classification (2010).\nThe variables and their data sources are summarized in Table 2 ."}, {"section_title": "Definition of Research Spending", "text": "We employ two definitions of R&D and science spending. Our main definition is based on the CFDA numbers: we identified 24 numbers describing scientific and research activities funded under ARRA. The CFDA numbers which mention the following are classified as research funding: research, science, census, statistics, policy evaluation, data, surveys, studies, laboratories, analysis, university building capacity. The CFDA numbers that mention library, education, including higher education, conservation, museums, training are not classified as research funding. Complete list of research CFDA numbers and allocated funds are in Table 3 . The secondary definition comes from \"Where does the money go?\" section of the Recovery.gov website. The section depicted a map with locations of ARRA recipients. The users could search an award based on different characteristics, including its purpose. All funds labeled \"for R&D and Science\" enter our secondary definition.\nThe data on the type of funds released on the Recovery.gov website were matched to the outlays data from the Cumulative National Summary. 11 We use two definitions to recover missing values. We classify transactions with missing CFDA numbers based on the Recovery.gov data. Similarly, the transactions that were not matched to the data from \"Where Does the Money Go?\" feature are classified as R&D and science based on their CFDA number. The comparison of two definitions is in Table 4 . Because our coding of CFDA numbers allows us to identify not only spending by traditional science agencies (e.g. the National Institute of Health and National Science Foundation) as well as programs within other agencies that are focused on R&D, the estimate of research spending using that definition is higher than that reported by the Recovery.gov. Tables 5 and 6 show the breakdown of ARRA spending by year. Table 5 breaks ARRA awards by the year in which they were assigned to recipient, while Table 6 shows the year of the 11 The data on the purpose of funds is only available for primary contractors and subcontractors. We assume the same purpose for their vendors. The data on the purpose of funds does not have id variable award key. We used award number and order number as id variables. Some of the values are either missing or inconsistent with corresponding variables in the main data. We matched 99.02% of transactions, which represent 87.08% of outlay amounts, based on three variables: award type, award number, and order number."}, {"section_title": "Descriptive Analysis", "text": "final report filed by recipients indicating work completion. We can see that the majority of awards were assigned in 2009 and completed in 2013. The pattern is similar for research and non-research awards with one caveat. While the percentage of awards assigned early, in 2009, is similar -59% of research awards and 62% of non-research awards, research projects took longer to complete. Sixty percent of recipients of research awards filed final report in the last year (2013) as compared to 44% of recipients of non-research awards. The average time between receiving an award and filing a final report is 772 days for non-research projects and 890 days for research projects. 12 This finding is consistent with the notion that R&D and science projects are more long-term and uncertain, but may also have to do with standard university reporting practices for grant awards. Tables 7 and 8 contain the data on the counties with the largest amounts in research awards under ARRA. Table 7 shows that the counties with the largest aggregate amounts are located on the coasts or in large metropolitan areas. Among the top 25 counties, five are in California, each grossing at least 400 million USD in total ARRA funds on research, two are in It is important to remember that counties with the largest aggregate amounts of research awards are not necessarily the most research-intensive. After scaling ARRA awards by population the coastal areas and counties with large cities are no longer prominent. Figure 2 displays the largest recipients of research spending under ARRA in aggregate and per capita terms at a county level. A little over half of all the counties received some research funds between 2009 and 2013. However, the distribution of awards, even when examined per capita, is skewed. About one-third of all counties received more than 5 USD per capita over five years. 382 counties received more than 50 USD per capita, 244 more than 100 USD per capita, and 34 counties more than 500 USD per capita.\nThe list of counties with the largest amounts in research awards is different if compiled on per capita basis. Suffolk county in Massachusetts and Washtenaw County in Michigan are the only counties from Table 7 to appear in Table 8 , which displays the top 25 counties on per capita basis.\nSome of the counties enter Table 8 due to low population numbers. If the denominator in the per capita definition of research awards is small, even 10 million USD in federal awards over five years will place a county at the top of the list, as evidenced by Esmeralda County in Nevada. Three Nevada counties as well as three remote boroughs in Alaska, Morrow County in Oregon, and Pontotoc County in Mississippi are low population counties which received federal funds for Renewable Energy Research and Development. Orange County in North Carolina, Washtenaw County in Michigan, Tompkins County in New York, and Suffolk County in Massachusetts are homes to large research universities. Delphi Corp, a recipient of a large grant in Conservation R&D, has one of its main offices in Kokomo, Howard County. Los Alamos County is on the list due to the grants of the Los Alamos National Laboratory from the National Science Foundation (NSF) and the Department of Energy (DOE). Anderson County in Tennessee is a home of the Oak Ridge National Laboratory. Marinette County in Wisconsin is on the list mainly because of the two large contracts of Marinette Marine Corp. with the NSF and the National Oceanic and Atmospheric Administration (NOAA). Table 9 compares counties with research spending and counties with spending on all other purposes. Between 2009 and 2013, every county received some ARRA awards for purposes other than research. About half of all counties received ARRA stimulus for R&D and science in the same time period. The counties with research awards are more populous, urban, twice as likely to have a research university, and have more individuals employed in scientific research and development services. More doctoral degrees are awarded in the counties with ARRA research awards. They are similar to all other counties in the share of individuals employed in manufacturing and the increase in the unemployment rate during the Great Recession.\nTables 10 and 11 examine the geographical dispersion of ARRA awards. Table 10 includes all awards. Table 11 excludes awards with only one recipient. 13 We separate awards with many recipients because subcontractors and vendors change the geography of spending. They are often overlooked at a less granular analyses of fiscal spending, resulting in attenuated estimates. Both tables show the same pattern: primary contractors on research awards are more likely than primary contractors on non-research awards to have subcontractors and vendors outside their zip code, county, and state. However, the relative amounts they are sending to other zip codes and counties are smaller than corresponding amounts sent by primary contractors on all other awards. Primary contractors on research send, on average, 12% of the total award amount outside their zip code, including 10% of the total amount going outside the county. Corresponding percentages for primary contractors on non-research awards are 17 and 13. The pattern reverses at the state level. Primary contractors on research awards send, on average, 8% of total award amounts outside their state, while primary contractors on non-research awards do so with only 3% of award amounts. This pattern is inconclusive about the \"stickiness\" of research awards in comparison to all other awards. However, it is evident that research contractors have more remote subcontractors and vendors. This finding is expected as research contracts require specialized materials, processes, and services. Table 12 shows summary statistics for the 3,102 counties in the sample. The top panel 13 By default, these awards have all transactions and 100% amount in the same zip code, county, and state. They constitute about 60% of all awards in the data.\nshows details on outcome variables, total employment and private sector employment, denoted as changes per capita. On average, total county employment per capita rose by about 0.8% between 2009 and 2013. During the same time period, average private sector employment increased by about 1%.\nThe next panel shows the details on ARRA spending variables. A little over half of all counties received some federal funds on research under ARRA. The average amount was $34 per capita over five years, from 2009 to 2013. In contrast, every US county received some ARRA funds for purposes other than research and the average amount is more than twenty times higher, $824 per capita, over the same period.\nWe use two instruments, an indicator that a county has a research university and an indicator that a county has at least one person employed in R&D and science in 2007, in the selection equation. We use three instruments, different from the first two, in the first stage of IV regression. They are the number of individuals employed in R&D per capita in 2007, the natural logarithm of doctoral degrees awarded in 2010, and the inverse Mills ratio. According to the Carnegie Classification (2010), 205, or 6.5% of, US counties have a research university. According to the County Business Patterns, only 11.3% of US counties have at least one individual employed in R&D in 2007. On average, a county had 304 individuals employed in R&D for every million residents. In contrast, there were, on average, 46,257 individuals employed in manufacturing per million residents in the same year. The numbers for the doctoral degrees are similarly skewed. On average, there were 19 doctoral degrees awarded in a US county in 2010, but the 90 th percentile is zero.\nThe bottom panel contains information on employment change during the recession. On average, between 2007 and 2009, total employment in a county fell by 1.5%. The corresponding number for private sector employment is 1.6%."}, {"section_title": "Baseline Results", "text": "Heckman Correction Table 13 presents the estimates from the probit regression 14 used to correct for selection of counties into receiving ARRA research awards. The outcome variable is a dummy for a county with non-zero ARRA spending on research. Column 1 shows the results of the baseline regression. Column 2 presents the same regression as in Column 1 using the secondary definition of research spending. Column 3 gives results for the same regression as in Column 1 substituting total employment with private sector employment.\nThe counties with ARRA research awards are different from the rest of the country. They are more urban, more likely to have a research university and individuals employed in R&D and science, and are more likely to be surrounded by the counties that also received ARRA research 14 We present marginal effects for easier interpretation of coefficients.\nstimulus. According to the baseline specification, at least one R&D job in a county in 2007 increases the probability of receiving ARRA research awards by 33%. A research university in a county increases the probability of receiving ARRA research awards by 55%. Urban counties are, on average, 24% more likely to receive ARRA research awards. One thousand USD in ARRA research awards per capita received by adjacent counties increases the probability of the focal county getting ARRA research funds by 39%, suggesting that this spending, like other R&D measures, is subject to agglomeration effects. One standard deviation increase in employment in manufacturing per capita increases the probability of receiving ARRA research funds by 4%.\nNegative coefficients on the change in employment during recession suggest that counties that were later awarded ARRA stimulus on research fared better during the recession. The consequences of that are not clear. The counties with ARRA research awards may have slower growth rates because there is less room for new jobs during the recovery, or higher postrecession growth rates because they, in general, have better socio-economic profiles, or a mix of both.\nWe use the estimates from the Heckman correction regression to construct the inverse Mills ratio. We include it in the first stage regression on a subsample of counties with ARRA research awards. It corrects for the selection of counties into receiving ARRA stimulus for R&D and science by controlling the part of the error term for which selection into getting funded affects the funding amount. Table 14 provides first-stage results of the IV regression. In all specifications, the instruments are good predictors of the endogeneous variable, ARRA spending on research. The baseline specification shows that conditional on receiving ARRA stimulus, one extra person employed in R&D and science before the recession, increases research spending under ARRA by 15,300 USD. Likewise, a one percent increase in awarded doctorates in a county increases ARRA research spending by 19 USD per capita. These magnitudes are large. From descriptive statistics, we know that less than one-tenth of all counties received more than 100 USD in ARRA spending on research per capita. However, the number of counties where any doctorate degrees were awarded in 2010 is small -312. The number of counties with more than a thousand people employed in R&D and science services in 2007 is even smaller: 89."}, {"section_title": "First Stage", "text": "The inverse Mills ratio from the selection model is positively signed but not statistically significant in all three specifications. It suggests that unobserved factors that make counties more likely to get ARRA stimulus on research are also associated with larger amounts in stimulus per capita but the relationship is not statistically significant.\nThe robust first-stage F-statistic in the baseline specification is 17. The same statistic in the regression which uses our second definition of R&D and science spending is 21. The F-statistic in private employment regression is 28. Table 15 presents an endogeneous OLS regression in Column 1 and second-stage results of the IV regressions in Columns 2-4. The outcome variable in each regression is the change in employment in a county from 2009 to 2013 per capita. The OLS estimate of the jobs multiplier is 14 with a p-value below 0.01. The coefficient on the IV estimate is much higher, 27, with a p-value below 0.01. Between 2009 and 2013, on average, a county added 27 new jobs in response to one million USD in ARRA research spending. The estimate is roughly the same if we use the secondary definition of ARRA research spending. The majority of jobs, 23 out of 27, were in the private sector."}, {"section_title": "Main Results", "text": "The OLS estimate is much smaller than the IV estimate suggesting a negative correlation between the change in employment and unobserved characteristics of counties with high research spending. This finding is consistent with the notion that these counties had less room to add new jobs during the recovery.\nThe effect of an increase in research spending per capita in adjacent counties is positive and statistically significant in IV specifications. We scale the coefficient by the average of the ratio of the population in adjacent counties to the population of the focal county to make the coefficient comparable to the coefficient in the change in employment in the focal county. The coefficients range from 0.9 to 1.2 and are statistically significant. The OLS coefficient equals 0.3 and is not statistically significant. This result rules out negative spillover effects of research spending. The IV specifications suggest that there are positive spillover effectsa county adds jobs in response to research spending in adjacent counties. The coefficients in IV regressions imply one additional job added in a county in response to one million USD in research spending in adjacent counties. Overall, our baseline estimate suggests that one million USD in R&D stimulus spending generated 27 jobs in the county that received the award and one job in counties adjacent to it.\nThe coefficients on all other ARRA spending are negative and significant. They display a well-known selection effect: federal stimulus goes disproportionately to the counties with worse economic conditions. The initial economic conditions in these counties mask improvements from the federal stimulus. This variable is included as a control and we are not instrumenting for it.\nAmong other control variables, a dummy for urban counties is consistently positive and significant across all specifications, the number employed in manufacturing before recession is positive and statistically significant in IV specifications, and the change in employment due to recession changes sign based on specification and is not statistically significant. The countyspecific trend in employment change is positive but not statistically significant across all specifications."}, {"section_title": "Robustness Checks", "text": "In Table 16 , we build the baseline model one variable at a time. The unconditional effect of instrumented ARRA research spending on a sample of counties with ARRA research awards is 36 additional jobs. All control variables impact the coefficient. The largest reduction in the magnitude of the coefficient comes from adding an indicator for Metro County to the model suggesting strong positive correlation between the size of ARRA research spending per capita and a level of urbanization. The changes in the coefficient of interest from the addition of control variables to the model indicate positive correlation between the size of ARRA research spending and the size of ARRA research spending in adjacent counties and negative correlation between the size of ARRA research spending and the size of all other ARRA spending, in per capita terms. Across all specifications in Table 16 , the coefficient on ARRA research spending varies from 22 to 42.\nThe three instrumental variable regressions from Table 15 , including the baseline specification, are presented in Table 17 with omitted selection stage and inverted Mills ratio. The coefficients are larger than respective main results, ranging from 32 to 38. This result suggest large selection bias in ARRA award assignments stemming from underlying capabilities of a county to carry out R&D and science activities.\nIn Table 18 , we evaluate the robustness of baseline results by splitting the sample. One possible concern is that the baseline results are driven by coastal counties with developed research infrastructure, such as California and Massachusetts. In the first column, we report baseline estimates after dropping counties in Massachusetts and California. The estimate changes very little, from 27 to 25 jobs in response to one million USD in ARRA research spending over the five year period. It remains statistically significant with p-value less than 0.01.\nThe second column shows results for counties without research universities. 15 This time the change is more pronounced. The coefficient reduces by one third, from 27 to 18 jobs, but is still significant. This finding suggests that the results are disproportionately driven by counties with research universities. It is hardly surprising as ARRA research stimulus is complimentary to the infrastructure for R&D and science.\nThe third column checks if results are affected by remote, low populated counties and boroughs in Nevada and Alaska. They received high per capita research awards which are low in aggregate terms. The baseline specification omitting Alaska and Nevada shows a coefficient almost identical to the coefficient obtained from the baseline suggesting that counties in Nevada and Alaska were on average very similar in their return to ARRA research spending to the average county in the sample.\nFinally, the fourth column checks if large metropolitan areas with top 25 aggregate ARRA research award drive the results. The change is rather large with coefficient dropping to 21 but not as large as omitting counties with research universities.\nWe also check for the possibility that our main result may be driven by spurious correlation. We estimate the baseline regression omitting the main variable of interest, ARRA research spending, and the county-specific change in employment trend 16 using OLS:\nwhere X * c is a vector of control variables without the change in employment trend,κ s is statelevel shock, andη c is an error term.\nWe predict the change in employment using control variables for several time periods before the recession 17 (2009-2002, 2009-2003, 2009-2004 etc.) and for several time periods after the recession (2009-2010, 2009-2011, etc) . In the absence of spurious correlation, the effect of ARRA research spending is included in the residuals of post-recession regressions but should not be present in the residuals of pre-recession regressions. We construct predicted ARRA research spending using a linear combination of instruments from the first-stage regression (the number of persons employed in R&D per capita in 2007, the natural logarithm of doctoral degrees awarded in a county in 2010, and the inverse Mills ratio from the selection equation). We regress the residuals from the employment regressions on predicted ARRA spending on research. The results are in Figure 3 . The estimated coefficient is around zero for pre-recession periods indicating that conditional on control variables there is no spurious correlation between the change in employment and instrumental variables. Positive and significant coefficients in the post-recession period are picking up the correlation between the effect of ARRA spending included in the residual and instrumental variables."}, {"section_title": "Discussion", "text": ""}, {"section_title": "Job-Years", "text": "We assess the magnitude of our main result by calculating the yearly cost of a job. In the data, we do not observe yearly payments to recipients but we can examine the relationship between ARRA awards and the change in employment over different lengths of time. Table 19 period. If we assume that all new jobs lasted for the whole year and no new jobs were created in response to ARRA after 2013, then the total number of job-years created in response to one million USD in ARRA research spending is the sum of the coefficients from four regressions in Table 19 . We get a total of 66 job-years with a standard error of 13. 18 We interpret this result with caution because an overidentification test fails for regressions on the change in employment in 2009-2010 and 2009-2011 . A similar result using OLS is 30 job-years with a standard error of 2 (Table 20) . These estimates convert to approximately 15,000 USD per job-year using our baseline specification and 33,000 USD per job-year using endogenous OLS regression suggesting large selection bias. Regardless of any longer term economic benefits that accrue to R&D supported by ARRA spending, these investments resulted in significant employment stimulus effects. The cost is further reduced if we add jobs created in adjacent counties to our calculation."}, {"section_title": "State-level Results", "text": "In order to compare our findings to other published models, we attempt to estimate baseline results at the state level. We have to make changes to the main specification to obtain statelevel estimates. First, we are no longer applying the Heckman correction because there is no selection into receiving ARRA spending on research at the state level. Every state was awarded some R&D and science funding between 2009 and 2013. We can no longer include control for ARRA research spending in adjacent counties. Instead of a dummy variable controlling for metro counties, we add a state-level measure of urbanization, defined as the number of metro counties in a state.\nThe instrumental variable strategy has to be modified as well. The number of doctoral students aggregated at a state level is no longer a good predictor of ARRA R&D and science spending. Therefore, we no longer include it as an instrument. Without the inverse Mills ratio from the selection model and the number of doctoral students as instruments, we are left with Employed in R&D and science per capita (2007) as the only instrument in our baseline specification. Due to small sample size, we use conventional standard errors.\nWe present the state level results in Table 21 . We are not able to obtain a precise estimate of the effect of ARRA R&D and science spending. The coefficient on the main variable of interest is large, larger than comparable magnitudes at the county level, but so are standard errors. The robust first stage F-statistic for the main regression is 12.82. Table 21 provides no evidence of negative spillover effects within a state. If researchintensive counties were to \"steal\" already employed people from other counties in a state, the coefficient estimate in the state-level regression should be smaller than the respective estimate at the county-level.\nThe magnitude of the coefficient suggests that the variation in the effect of ARRA spending across states within a region is larger than the variation across counties within a state."}, {"section_title": "Comparison to the Estimates in the Literature", "text": "We compare our baseline estimate to the results in recent studies using similar methodology. 19 We find that our multiplier is large in comparison to the results in other studies. 20 Wilson [2012] applies cross-state IV methodology to analyze the effect of ARRA grants on total non-farm employment. The estimated effect suggests a cost of $125,000 per job-year in the first year of disbursement. It is higher than our estimate of $15,000 per job-year, or our state-level results, which are not measured precisely. Shorter time-horizon, the analysis at the county level, the possibility of jobs created by ARRA lasting past the first year, as well as the possibility of the R&D and science spending having a higher multiplier can explain the differences between our estimate and a smaller estimate in Wilson [2012] .\nChodorow-Reich et al. [2012] apply similar methodology to estimate the effect of ARRA Medicaid reimbursements at a state level. They use past Medicaid spending per capita as an instrument for ARRA stimulus and find a cost of $26,000 per job-year. Conley and Dupor [2013] find a much smaller multiplier, $202,000 per job-year, using ARRA obligations. Leduc and Wilson [2013] estimate employment regression 21 as part of their study of the flypaper effect. They estimate a cost of job-year as $62,500 for highway grants over a three year period (2008) (2009) (2010) (2011) .\nThese papers estimate effects within the first two years of ARRA, at the state level and using the data on the federal grants to states with a breakdown by agency. Our baseline estimate comes from county-level data from the direct recipients of ARRA contracts and grants. The data are broken down by CFDA numbers, a more granular measure than the breakdown by funding department, over five years of full ARRA disbursement. Feyrer and Sacerdote [2011] use ARRA recipient-level reports on all types of spending at the county level in the first twenty months of ARRA disbursement and estimate a cost of $400,000 per job year. They locate about $85 billion in spending at the county level, while we locate about $270 billion. They also estimate state-level effect of approximately $111,000 per job year. 22 Similarly to Feyrer and Sacerdote [2011] , our state-level estimates are higher than the county-level estimates. They attribute it to the positive spillover effects on employment. A non-ARRA paper estimating multiplier at the county level is Serrato and Wingender [2016] . 19 We are not comparing our estimates to the results from macroeconomic models, such as Blinder and Zandi [2010] and reports by the CEA and CBO. The direct comparison of local and national multipliers requires a number of assumptions which do not hold in our case.\n20 Chodorow-Reich [2017] contains a review of the recent literature on geographic cross-sectional fiscal spending multipliers.\n21 Employment regressions are in Table 8 of 2014 working version of their 2017 paper. 22 We take the estimate in Column 1 of Table 3 because the specification is closest available comparison to our specification.\nThey document a cost of $30,000 per job year.\nA direct comparison of our study to recent literature is complicated by the differences in methodology, data sources for employment and ARRA spending, and the time period during which the stimulus was disbursed to recipients. It is, however, evident that our estimate of the R&D and science multiplier is larger than the estimates of the common multiplier or multipliers on other types of spending in the recent literature. In other words, our findings at the county level imply both that R&D spending has significant stimulus effects and that those effects are larger than those that have been reported for many other types of federal stimulus."}, {"section_title": "Conclusion", "text": "We examine the impact of ARRA R&D and science spending on local employment. Crosscounty IV regressions indicate that ARRA spending on R&D and science has substantively large, positive, statistically significant effects on employment at the county level. We find that between 2009 and 2013, the full ARRA disbursement period, 27 jobs were added in response to one million in spending on research. The majority of jobs, 23 out of 27, were in private sector. Additional analysis provides an estimate of the cost per job-year. We find that 66 jobyears were created from one million USD in ARRA research funds which converts to the cost of about $15,000 per job-year. Split sample regressions suggest that the effect is larger for counties with research universities.\nOverall, the effect of ARRA spending on R&D and science estimated in our paper is larger than comparable results for federal stimulus in general as well as federal stimulus on health or infrastructure. In addition to any longer term returns realized to discovery and training conducted in the course of ARRA funding R&D, there are substantial short term employment returns to public investments in science and research. Grant description: This project will utilize high-throughput genetic technologies in a major longitudinal behavioral study and renew the biomedical research community by building scientific partnerships for the integration of behavioral and genetic science. The 7,000 individual participants to be genotyped will be added to a database of 13,000 being constructed under an earlier ARRA project. The data comes from the recipient reports in the Cumulative National Summary. The ARRA spending on research is defined by the CFDA numbers associated with R&D and science. Notes: The data in the table comes from the Cumulative National Summary of ARRA Recipient Reports. The total amount constitutes about one-third of the total ARRA package. The data in the table is split by the year in which ARRA award was assigned. ARRA spending on research is defined using selected CFDA numbers. The discrepancy between Tables 5 and  6 comes from missing values in award date variable. Notes: The data in the table comes from the Cumulative National Summary of ARRA Recipient Reports. The total amount constitutes about one-third of the total ARRA package. The data in the table is split by the year in which recipients filed a final report upon work completion. ARRA spending on research is defined using selected CFDA numbers. The discrepancy between Tables 5 and 6 comes from missing values in award date varible. Notes: The table contains summary statistics separately for counties with non-zero ARRA spending on research in comparison to all other counties. The unit of analysis is a county. ARRA spending on research is defined using selected CFDA numbers. Notes. The table shows the dispersion of ARRA research awards in comparison to all other ARRA awards. The data are summarized using all awards, including awards with one recipient (primary contractor). The top panel shows the percent of transactions with place of performance (POP) outside primary contractor's zip code, county, and state. The bottom panel shows the percent of award amount received by the subcontractors and vendors registered outside primary contractor's zip code, county, and state. ARRA spending on research is defined using selected CFDA numbers. Notes. The table shows the dispersion of ARRA research awards in comparison to all other ARRA awards. The data excludes awards with one recipient (primary contractor). The top panel shows the percent of transactions with place of performance (POP) outside primary contractor's zip code, county, and state. The bottom panel shows the percent of award amount received by the subcontractors and vendors registered outside primary contractor's zip code, county, and state. ARRA spending on research is defined using selected CFDA numbers. Notes: The table contains Heckman correction for the selection of counties into receiving ARRA research awards. The first column shows baseline regression. ARRA spending on research is defined using selected CFDA numbers. The second column shows the same regression using secondary definition of research spending based on \"Where does the money go?\" section of the Recovery.gov website. The third column shows regression using private sector employment, instead of total employment, in the county-specific change in employment trend and the change in employment per cap (2007) (2008) (2009) Notes: The table contains the first stage of IV regressions. The first column shows baseline regression. ARRA spending on research is defined using selected CFDA numbers. The second column shows the same regression using secondary definition of research spending based on \"Where does the money go?\" section of the Recovery.gov website. The third column shows regression using private sector employment, instead of total employment, in the county-specific change in employment trend and the change in employment per cap (2007) (2008) (2009) Notes: The first column shows endogeneous OLS regression. The second column shows the second stage of the baseline IV regression. ARRA spending on research is defined using selected CFDA numbers. The third column shows the same regression as the one in the second column using secondary definition of research spending based on \"Where does the money go?\" section of the Recovery.gov website. The fourth column shows regression with private sector employment, instead of total employment, in the outcome variable as well as the county-specific change in employment trend and the change in employment per cap (2007) (2008) (2009) . In all regressions, a county is the unit of analysis. The sample in the first column includes all US counties. The sample in columns 2-4 includes all US counties receiving ARRA research stimulus in [2009] [2010] [2011] [2012] [2013] . The outcome variable is the change in employment from 2009 to 2013 divided by the population averaged over the same period of time. ARRA spending on research is an exogeneous variable in the first column and an endogeneous variable in columns 2-4. It is instrumented by a natural logarithm of the number of doctoral degrees awarded at the universities in a county, the number of individuals employed in R&D and scientific services per capita in 2007, and a Heckman correction term. The Heckman correction term is an inverse Mills ratio of the predicted values from the probit regression of the probability of receiving ARRA research stimulus on all control variables and two other instruments: dummies for a county with research university and a county with employed in R&D and science in 2007. ARRA spending on research in adjacent counties and all other ARRA spending are included as controls. All three variables are in millions of USD paid in 2009-2013, divided "}, {"section_title": "Figures and Tables", "text": ""}, {"section_title": "Notes:", "text": "The table contains the second stage of the baseline IV regressions with omitted controlled variables gradually building the full model in the last column. The unit of analysis is a county. ARRA spending on research is defined using selected CFDA numbers.\nRobust standard errors clustered on state are in parentheses.\np<0.1, ** p<0.05, *** p<0.01. Table 15 on a sample of all US counties with omitted selection stage. The unit of analysis is a county. ARRA spending on research is defined using selected CFDA numbers. Robust standard errors clustered on state are in parentheses. p<0.1, ** p<0.05, *** p<0.01. Notes: The table shows the second stage of the baseline IV regression on split samples. The sample in the first column excludes counties in Massachusetts and California. The sample in the second column excludes all counties with research universities. The sample in the third column excludes counties in Nevada and Alaska. Finally, the sample in the fourth column excludes the top 25 counties with the highest ARRA research spending. In all regressions, a county is the unit of analysis. The sample includes the counties with non-zero ARRA research awards. ARRA spending on research is defined using selected CFDA numbers. The outcome variable is the change in employment from 2009 to 2013 divided by the population averaged over the same period of time. ARRA spending on research is an endogeneous variable. It is instrumented by the natural logarithm of the number of doctoral degrees awarded at the universities located in a county, the number of individuals employed in R&D and scientific services per capita in 2007, and a Heckman correction term. The Heckman correction term is an inverse Mills ratio of predicted values from the probit regression of the probability of receiving ARRA research stimulus on all control variables and two other instruments: dummies for a county with research university and a county with employed in R&D and science in 2007. The dummy for a county with research university is omitted from the construction of Heckman correction term because the sample excludes counties with research universities. County with Research University is an indicator which equals one if a county has R1, R2, or R3 University by the definition in Carnegie Classification (2010). ARRA spending on research in adjacent counties and all other ARRA spending are included as controls. All three variables are in millions of USD paid in 2009-2013, divided by the population averaged over the same period of time. Additionally, ARRA spending on research in adjacent counties is scaled by the average of the ratio of the population in adjacent counties to the population of the focal county to simplify coefficient interpretation. The state fixed effects are absorbed to allow for standard errors to be clustered at the state level. Notes: The table contains the regression coefficients used in calculating the cost of a job-year. Each column is the second stage of the baseline IV regression on a different outcome variable. The outcome variable is the change in employment over the time period at the top of each column divided by the population in a given county averaged over the same period of time. The unit of analysis is a county. ARRA spending on research is defined using selected CFDA numbers. The sample includes all US counties with non-zero ARRA research awards. Robust standard errors clustered on state are in parentheses. p<0.1, ** p<0.05, *** p<0.01. Notes: The table contains the regression coefficients used in calculating the cost of a job-year. Each column is an endogeneous regression as in Column 1 of Table 15 on a different outcome variable. The outcome variable is the change in employment over the time period at the top of each column divided by the population in a given county averaged over the same period of time. The unit of analysis is a county. ARRA spending on research is defined using selected CFDA numbers. The sample includes all US counties. Robust standard errors in parentheses. * p<0.1, ** p<0.05, *** p<0.01. Notes: The first column shows endogeneous OLS regression. The second column shows the second stage of the baseline IV regression. ARRA spending on research is defined using selected CFDA numbers. The third column shows the same regression using secondary definition of research spending based on \"Where does the money go?\" section of the Recovery.gov website. The fourth column shows regression with private sector employment, instead of total employment, in the outcome variable as well as the state-specific change in employment trend and the change in employment per cap (2007) (2008) (2009) "}]