[{"section_title": "Introduction", "text": "Childhood overweight and obesity is a major problem in the United States (U.S.). Although obesity prevalence in youth has been stable over the past decade, 1 rates have significantly increased since 1999, 2 and overweight and obesity rates remain high. 2,3 From 2011 to 2012, 31.8% of children and adolescents were overweight or obese (OW/OB), and 16.9% were obese. 1 Being OW/OB as a child may predict obesity in adulthood. 4,5 Ethnic-immigrant groups, including Asians, experience disparities in obesity. 6 Asians constitute the fastest-growing racial/ethnic group in the U.S., growing by 29.8% from 2009 (5.1% of the U.S. population) to 2015 (6.4% of the U.S. population). 7 When considered overall, Asian-American children have lower overweight and obesity prevalence than other racial/ethnic groups. 1,3 In one study, 26.3% of 4-year-old Asian-American children were OW/OB, as compared to 36.0% of white children. 8 However, there were differences in overweight/obesity rates based on Asian ethnicity: 15.6% of Asian Indians versus 34.7% of Vietnamese children. In addition, the obesity risk for Asian-American children from foreign-born mothers may be half that of Asian-American children from U.S.-born mothers. 8 One possible reason for differences in obesity risk is acculturation, or the process by which individuals from one culture adopt to another culture. 9 Acculturation may be positively related to obesity and obesogenic behaviors, including increased body mass index (BMI), preference for Western foods, and increased intake of omega-6 fatty acids. [10][11][12][13] However, research with children has been mixed, at least among Latinos. 14 In addition, most studies investigating acculturation and weight status have been cross-sectional. 10 Few studies have explored the relationship longitudinally. One longitudinal study of Asian, Hispanic, and non-Hispanic white early adolescent females found no association between overweight status and acculturation over time, 15 whereas another study of immigrant women from the former Soviet Union found an inverse correlation between acculturation and BMI change over 10 years. 16 Other studies have found positive relationships between acculturation and weight status longitudinally. 17,18 Sons of black, Asian, or Hispanic immigrants who moved to the U.S. as adults were heavier and gained more weight than sons of U.S. natives, and sons gained weight faster if their parents were English-proficient. 17 As an additional confounder, the relationship between acculturation and weight status is complicated by socioeconomic status (SES). 19 SES and acculturation are interconnected, such that SES may modify the relationship between acculturation and obesity. For example, lower acculturation may be protective against poor health outcomes for lower SES individuals. In addition, while acculturation is related to obesity, SES is also independently related to obesity. 20 A study of Chinese-American children found higher SES children to have more westernized dietary behaviors, 21 which may lead to obesity and other diseases. 22 Few studies have disentangled the SES-acculturation relationship in relation to obesity and health outcomes. The long-term relationship between acculturation and weight status in children remains unclear. More research is needed, especially among Asians, who have experienced both acculturation and increased childhood obesity. 11,13 The availability of kindergarten and second grade anthropometric data from the U.S.'s Early Childhood Longitudinal Study, Kindergarten Class of 2010-11 (ECLS-K:2011) 23 provided an opportunity to evaluate the relationship between acculturation and BMI change during the early school years, when there may be excess BMI gains. 24 The purpose of the current study was to examine the association between acculturation and BMI change in a sample of Asian-American children. We hypothesized increases in BMI with acculturation (i.e., transition to OW/OB), given that acculturation has been identified as a childhood obesity risk factor. 13 Secondary aims were to compare changes by Asian ethnic group and examine interactions between acculturation and SES."}, {"section_title": "Methods", "text": ""}, {"section_title": "Data and sample", "text": "We used data from the ECLS-K:2011, a nationally-representative, longitudinal study of U.S. children attending kindergarten in 2010-2011. 23  Mulligan and colleagues. 23 The student and parent response rates were 87% and 74%, respectively, for the first data collection. For this study, we used data from the spring of kindergarten (when acculturation was measured) and spring of second grade (the most recent wave of available data at the time of study). Participants were excluded if they were missing a child assessment and/or parent interview at either wave. Only children who were of Asian descent with at least one foreignborn parent were included in our analyses. Missing data for the rest of our covariates were multiply imputed for five complete datasets. The final sample size comprised 1,200 children (rounded to the nearest 50, per our restricted data user agreement). Rice University's Institutional Review Board determined this study to be exempt."}, {"section_title": "Measures", "text": ""}, {"section_title": "Anthropometrics", "text": "Based on height and weight, we calculated BMI and classified each child as healthy weight (HW) (BMI<85th percentile), overweight (BMI≥85th and <95th percentile), or obese (BMI≥95th percentile). 25 Using kindergarten and second grade data points, four weight change groups were created: 1) consistently HW, 2) consistently OW/OB, 3) healthy weight change (i.e., OW/OB to HW), and 4) unhealthy weight change (i.e., HW to OW/OB). 26 In our models, we Family household and SES measures were obtained from parent interviews. These measures included highest level of education for the child's mother (no high school degree or high school degree), family structure (living with two biological parents or not), and number of siblings in the household. In addition, poverty status was measured using federal poverty level (FPL) threshold status of the household, based on income-to-poverty ratios. Families were categorized as being 200% or above FPL, 100-200% FPL, or below 100% FPL. English proficiency was assessed using four questions measuring how well the mother spoke, read, wrote, and understood someone speaking English (α=.97). Each question was coded on a four-point scale from 1 (very well) to 4 (not well at all). We then reverse-coded and summed the items, so that higher scores represented better English proficiency (range: 4-16). Percentage of mother's life spent in the U.S. was calculated based on 1) mother's current age and 2) age when she first moved to the U.S. (i.e., age at arrival). We subtracted the age at arrival from her current age, and divided the difference by her current age. Larger values represented a higher percentage of the mother's life spent in the U.S."}, {"section_title": "Statistical analyses", "text": "We utilized multinomial logistic regression to predict weight change, with \"consistently HW\" as the reference category. Chinese children served as the comparison group because they are the largest Asian ethnic group in the U.S. 7 and were the reference group in multiple studies of Asian-American childhood obesity. 8,28 The first model included ethnicity, child's age, sex, household, and SES factors. The second model added the acculturation measures. Although we tested models with each acculturation measure entered separately, results when both were simultaneously included did not differ substantively, so we presented the model with both. Percentage of mother's life spent in the U.S. was normally distributed, while English proficiency was not (i.e., approximately 40% of mothers scored the maximum of 16). The final model added acculturation x SES interaction terms. We also tested interactions between Asian ethnicity and each acculturation measure, but found no evidence that acculturation processes operated differently by ethnicity and thus did not include those results. Finally, we generated predicted probabilities, with adjustments for all covariates, to illustrate the overall probability of weight change by acculturation x SES. All analyses were conducted using STATA/SE (Version 14.0, 2015, StataCorp LP, College Station, Texas, USA), with statistical significance defined as p<.05."}, {"section_title": "Results", "text": "Demographic, household, and acculturation characteristics In terms of acculturation, Filipino mothers had the highest mean English proficiency score of 14.3, followed by South Asian and \"other ethnicity\" mothers. \"Other ethnicity\" mothers had the highest mean percentage of life spent in the U.S. (47.5%)."}, {"section_title": "Weight change categories", "text": "Overall, 72.3% of children were HW in kindergarten and in second grade (see Table 1). By contrast, 16.5% were OW/OB at both time points, 7.8% had an unhealthy weight change from HW to OW/OB, and 3.4% transitioned from OW/OB to HW. Filipino children had the highest rate of being consistently OW/OB (24.8%) and lowest rate of being consistently HW (62.9%). In contrast, Chinese children had the lowest rate of being consistently OW/OB and highest rate of being consistently HW, confirming their use as the comparison group in our multinomial logistic regressions for predicting weight change. Models 1a-3a in Table 2 presents odds ratios (ORs) and 95% confidence intervals from multinomial logistic regression models predicting the \"consistently OW/OB\" category, with \"consistently HW\" as the reference category. With all covariates included, Filipino children (when compared to Chinese children) had higher odds of being in the \"consistently OW/OB\" category than \"consistently HW,\" as did older children (model 2a). Acculturation was not a significant predictor until model 3a, when the interaction term between English proficiency and mother's education was added. Specifically, for children whose mothers lacked a high school degree, the likelihood of the child being \"consistently OW/OB\" increased as mother's English proficiency increased, but not as much for children whose mothers had a high school degree (Figure 1). Similarly, the probability of being \"consistently HW\" increased with English proficiency, but only for children whose mothers had a high school degree. An interaction between mother's English proficiency and poverty status operated in the same way (results available upon request). There were no significant interactions for percentage of mother's life spent in the U.S and either SES measure. [Insert Table 2 here] [Insert Figure 1 here] Regarding weight change, there were no ethnic, household, or SES differences in the odds of being in the \"unhealthy weight change\" or \"healthy weight change\" group ( Table 2, models 2b and 2c), relative to the \"consistently HW\" group. However, child's sex and age predicted unhealthy weight change, so that boys and older children had higher odds of being in the \"unhealthy weight change\" group. In addition, mothers with greater English proficiency had children with lower odds of being in the \"unhealthy weight change\" (model 2b) and \"healthy weight change\" (model 2c) groups, relative to \"consistently HW\" group. Unlike for the \"consistently OW/OB\" group, there were no acculturation x SES interactions for the weight change groups (models 3b and 3c), meaning that increased English proficiency decreased the probability of unhealthy or healthy weight change, regardless of mother's education (Figure 1)."}, {"section_title": "Discussion", "text": "To our knowledge, the current study was the first to examine acculturation and BMI change, as well as ethnicity and BMI change, in Asian-American children. Overall, most children were HW in kindergarten and second grade; only 27.7% of children were OW/OB in kindergarten and/or second grade. This finding is consistent with data from the ECLS, Birth Cohort: 26.3% of 4-year-old Asian-American children were OW/OB. 8 Another study reported lower rates of 9.0% and 19.9% in children aged 2-5 and 6-11 years, respectively, 1 but this study was cross-sectional and may mask changes in overweight and obesity over time. A longitudinal study found higher rates of overweight and obesity: only 59.8% were persistently non-OW/OB from kindergarten to fifth grade, whereas 15.2% were chronically OW/OB, 9.6% were late-onset OW/OB, 8.8% were early-onset OW/OB, and 6.7% became HW. 29 However, this study covered a longer age period and sampled children from southeast Texas, so the rates may not reflect Asian-American children nationally, especially given higher rates of overweight and obesity in Texas than the U.S. 30 More research is needed to understand weight change in this population, in order to identify points for intervention. A comprehensive approach should target causes of weight change year-round, with particular emphasis in the summer, when Asian children may be more likely to increase their weight status. 31,32 In addition, overweight and obesity prevalence differed between Asian ethnic groups, with Filipino children having the highest odds of being OW/OB in both kindergarten and second grade. These findings partly corroborate another study that found Filipino, Southeast Asian, and mixed Asian ethnicity adolescents to be more likely to be overweight than Chinese adolescents, 28 whereas another study found Vietnamese children to be at highest risk. 8 These studies had relatively small numbers of children representing the different Asian ethnic groups (e.g., 100 Filipinos in the current study), so replication is needed in larger samples to draw strong conclusions about which groups are most at risk. Despite small samples and different findings, all these studies support the heterogeneity in obesity rates within Asians and highlight the need for disaggregated research. 33 Combining all Asians misrepresents the risks experienced by particular groups, given their differences in SES, immigration histories, access to resources, and beliefs/practices. 34 Interventions may need to be culturally-tailored for each group, although more research is needed in this area. There have been limited obesity interventions for Asian-American children, and most have targeted Chinese-American children, [35][36][37][38][39] so efforts are needed to identify strategies for obesity intervention in Filipino and other at-risk Asian populations. This study also found acculturation, specifically mother's English proficiency, to be a significant predictor of weight change. The odds of weight change, whether unhealthy or healthy, relative to staying HW, were less in children of more English proficient mothers. In other words, children of more English proficient, or acculturated, mothers were more likely to be HW in both kindergarten and second grade, than to improve or worsen their weight status, which was an unexpected finding. Given previous research demonstrating a positive relationship between acculturation and overweight/obesity, 10 we expected acculturation to be related to unhealthy weight change in our sample. However, our findings corroborate some studies that found a negative association between parental acculturation and Asian-American children's weight status. [40][41][42][43] Unfortunately, all these studies were cross-sectional and conducted by one research group using similar samples, making interpretation and comparison difficult. Longitudinal research has resulted in mixed findings, [15][16][17][18] so more research is needed. Relatedly, many acculturation-related studies have focused on diet, demonstrating less healthful dietary behaviors (and therefore obesity) with greater acculturation. [44][45][46] In contrast, it is also possible that greater acculturation may lead to more healthful behaviors, such as mothers with higher English proficiency having higher healthcare utilization 47 or quality of healthcare. 48 These avenues may potentially offset dietary changes and lead to lower obesity with acculturation. More research is needed to investigate other avenues through which acculturation may influence health. Mother's English proficiency also increased the probability of a child being consistently OW/OB, but more so for children whose mothers had low education. This finding demonstrates the interconnectedness of acculturation and SES, so that lower levels of acculturation may be protective against BMI growth and negative health outcomes for economically disadvantaged groups, perhaps through healthier food intake patterns, retention of social norms, and social support. 19,49 Multiple assimilation theories recognize that acculturation may vary based on social and economic contexts of reception, such that groups may acculturate into different social strata (e.g., the relatively healthy lifestyle of high SES or relatively unhealthy lifestyle of low SES). 49 More research is needed to investigate the SES-acculturation relationship in relation to obesity and health outcomes, in order to better identify intervention targets, because acculturation's impact on health outcomes and behaviors may depend on SES and other factors. Interventions to prevent consistent overweight/obesity may need to focus on families with low SES but high English proficiency, while interventions to prevent weight gain should focus on families with high English proficiency, regardless of SES. Overall, we found household measures to not be related to weight change. In other studies, children with single mothers or no siblings were more likely to be obese or have larger BMI increases, [50][51][52][53][54] as were children in families headed by cohabiting biological or step-parents or a relative. 53,54 However, these studies included diverse samples, not just Asians. One study of Asian-American families found little evidence of family structure influencing self-rated health and psychological distress, 55 so more research is needed to understand family structure in Asians. It is also possible that there was little diversity in family structure in our sample (i.e., 92.2% lived with two biological parents and the average number of siblings was 1.1) to adequately investigate the relationship between family structure and overweight/obesity. Different measures across studies may yield different, difficult-to-compare findings. 56 As exemplified in this study, English proficiency was a significant predictor of weight change, while percentage of life spent in the U.S. was not. The correlation between the two acculturation measures was .23, essentially due to the heterogeneity of the Asian sample: some mothers had high English proficiency but little time in the U.S. and vice versa. It is also possible that the two acculturation measures assess different things: language proficiency may measure access to health information and services, rather than cultural adaptation or change. 27 Findings should be interpreted in the context of the acculturation measure. Relatedly, because there were few children of U.S.-born parents in the ECLS-K:2011 dataset, and because the acculturation measures may not apply in the same way to this group, we limited analyses to children of at least one foreign-born parent and were unable to include generation status in analyses. As another limitation, one measure of SES was mother's highest level of education. We were unable to standardize education, given the likelihood that degrees were obtained from a variety of countries with different educational systems and standards, so we chose a dichotomous category to minimize differences across schooling systems. Next, we used BMI to measure overweight and obesity, which may underestimate obesity-related risks. 57 Especially in Asian populations, there may be elevated risks of adiposity and obesity-related diseases at lower BMI levels. 58,59 Lastly, findings from this study may not be generalizable to Asian children in other countries."}, {"section_title": "Study limitations and strengths", "text": ""}, {"section_title": "Conclusion", "text": "The present study contributes to acculturation, ethnicity, and weight change research among Asian-American children. First, Filipino children had the highest overweight and obesity risk in kindergarten and second grade, which enhance our understanding of Asian-American childhood obesity and disparities. Second, acculturation (specifically mother's English proficiency), but not household or SES measures, was a significant predictor of weight change in unexpected directions, suggesting that mother's acculturation may be related to a child being consistently HW. With the acculturation x SES interaction term, mother's English proficiency was also a significant predictor of being consistently OW/OB, so that children from less educated households were at greater risk of being consistently OW/OB with acculturation, than children from more educated households. Research is needed to verify these findings and use more comprehensive acculturation and obesity measures. funding agencies in the public, commercial, or not-for-profit sectors. Tom Baranowski was funded in part with federal funds from the USDA/ARS under Cooperative Agreement No. 58-6250-0-008. Table 1. Demographic, household, acculturation, and weight characteristics for the full sample and by ethnicity, n=1,200 Asian-American children of foreign-born mothers, ECLS-K:2011 Table 2. Multinomial logistic regression models predicting weight change categories from kindergarten to second grade, n=1,200 Asian-American children of foreign-born mothers, ECLS-K:2011 \"Consistently Overweight/Obese\" \"Unhealthy Weight Change\" \"Healthy Weight Change\" "}]