[{"section_title": "", "text": "Because farm income is so variable, consumption is likely to be a more stable indicator of the household's long-term standard of living than is its current income level. Households dependent on variable income sources are less likely than others with more stable incomes to adjust household consumption-which depends on longer term income expectations-in response to annual variations in household income-which are more likely to be temporary. When income is temporarily low, households with substantial wealth can draw down or borrow against their savings to maintain their standard of living; when income is temporarily high, they will be less inclined to expand discretionary purchases than similar households with more stable sources of income."}, {"section_title": "What Did the Study Find?", "text": "We cannot track individual households over time to measure changes in consumption as income varies from year to year. Instead, we examined differences in spending behavior among all farm households during 2006. As expected, farm households consumed a larger share of current household income than all U.S. households when household income was low, but as household income increased, the increases in farm household consumption were smaller than for all U.S. households. To further test the role of variable household income on consumption, we compared two groups of farm households that vary in their iv"}, {"section_title": "Farm Household Well-Being:Comparing Consumption-and Income-Based Measures / ERR-91", "text": "Economic Research Service / USDA exposure to income variability from self-employment-those operating farms with annual sales of $100,000 or more (for whom, in the aggregate, farm income contributes more than half of household income) and those operating farms with annual sales of less than $10,000 and an operator with a primary occupation other than farming (for whom, in the aggregate, farm income contributes a small negative amount to household income). We found a similar pattern-on average, the $100,000+ farm households had higher consumption when incomes were low and lower consumption when incomes were high relative to households with similar levels of income operating very small rural-residence farms.\nWhen households are ranked from lowest to highest based on current income levels, farm households have higher income per person than all U.S. households at all but the lowest level of household income. The net effect of predominantly higher income, but a lower tendency to increase consumption as income increases, is that the farm household distribution of consumption is very similar to that of all U.S. households. Farm households appear to have higher consumption at the low end of the distribution, and lower consumption at the upper end of the distribution, compared with all U.S. households. Analogously, the relative levels of disadvantage are reversed when we switch from an income-poverty rate to a consumptionpoverty rate, calculated by comparing household consumption to the census poverty threshold. The consumption poverty rate is lower for persons in farm households than for persons in all U.S. households. The divergence in income and consumption measures between farm and all U.S. households is even greater when we focus on households that operate farms with sales of $100,000 or more, which are more exposed to the income risks of self-employment.\nAt the individual household level, there is not a close mapping between the income and consumption measures for farm households compared with U.S. households. Among households that rank in the bottom 20 percent for household income, farm households are far more likely to rank high in the consumption distribution than are all U.S. households, indicating farm households are more likely either to view their income as temporarily low, or to have suffi cient wealth to spend more than they earn. Analogously, among households that rank in the top 20 percent of the income distribution, farm households are far more likely to rank low in the consumption distribution than are U.S. households, indicating they view their current income as temporarily high. The greater divergence implies that income is a less effective proxy for consumption-an indicator of long-term standard of living-for farm households than for most other U.S. households. Consequently, consumption indicators are an important complement to income indicators for understanding farm household well-being.\nEconomic Research Service / USDA\nEconomic Research Service / USDA Ideally, we would conduct the test of income variability and consumption with panel data. However, lacking panel data capturing the same farm households across multiple years, we test for consumption smoothing across income levels in our cross-sectional data for 2006. The underlying assumption is that greater income dispersion at a point in time is associated with greater intertemporal variability as well, so that current incomes at the low and high ends of the distribution are less likely to be representative of long-term, or \"permanent,\" income for farm households than for all U.S. households. For example, the operators of large farms, who have the highest average household income but whose farm income is most variable from year to year, are disproportionately represented at both the top and bottom of the income distribution.\nWe compare how patterns of consumption-smoothing relative to income levels differ between household groups with more and less income variability. We fi rst compare farm households and all U.S. households. In addition, among farm households, we compare households operating farms with annual sales greater than $100,000 and households operating very small rural-residence farms (with sales less than $10,000 and a principal operator whose primary occupation is not farming).\nEconomic Research Service / USDA Though very small rural-residence farms represent about 40 percent of U.S. farms, they produce a negligible portion of total sales. On average, farm income in this group is negative (-$8,245 in 2006) . Total household income is a third higher than for all U.S. households, but the shares of income deriving from self-employment income (from farm and nonfarm sources) and from wages and salary are comparable to those of all U.S. households. The share with negative household income cannot be reported due to small sample size, but the estimate is substantially smaller than the overall farm household share (6.0 percent).\nIn contrast, farms with $100,000 or more in sales represented 16 percent of farms and produced 89 percent of total sales in 2006. On average, the selfemployment share of household income (66.9 percent) is three times that of all farm households, and the share with negative household income (13.7 percent) is more than twice that of the average farm household.\nEconomic Research Service / USDA\nEconomic Research Service / USDA \"all else\" shares double from 14 percent to 28 percent for farm households and from 16 percent to 33 percent for all U.S. households (table 5) .\nEconomic Research Service / USDA sumption levels at the upper end of the income distribution. At the same time, we are unable to rule out such measurement error.\nEconomic Research Service / USDA\nEconomic Research Service / USDA Relative Well-Being of Farm and All U.S."}, {"section_title": "Introduction", "text": "How does farm household economic well-being compare to that of the typical U.S. household? The answer depends upon whether well-being is measured by available resources or by standard of living. Past research has relied primarily on measures of current-year money income and wealthindicators of resources available to the household. Many analysts agree that capturing standard of living by measuring goods and services consumed in the current year is an alternative measure of well-being with a number of advantages (Cutler and Katz, 1991; Hurd and Rohwedder, 2006; Johnson et al., 2005; Jorgenson, 1998; Meyer and Sullivan, 2003; and Rogers and Gray, 1994) . Households tend to smooth consumption over time, given temporary increases or decreases in income, in order to maintain their standard of living. Consequently, consumption better approximates lifetime well-being for a given household than current-year income.\nTheory and empirical evidence imply a more pronounced difference between money income and consumption for households less reliant on money income and/or where income is highly variable across years. The literature has studied two populations where income is a poor proxy for a consumption measure of well-being: low-income populations, who receive private and public transfers from outside of the household and who may have higher underreporting of income (Jorgenson, 1998; Meyer and Sullivan, 2003; Slesnick, 2001) ; and the elderly, who have relatively high levels of wealth but low current income (Hurd and Rohwedder, 2006) . This report focuses on another population for which income may be a weak proxy for standard of living: farm households which, like other selfemployed households, typically have more variable income and higher wealth than the average U.S. household."}, {"section_title": "2", "text": ""}, {"section_title": "Well-Being of Farm Operator Households Versus All U.S. Households: Income and Wealth Measures, 1996-2006", "text": "First, we defi ne who is a farmer and identify the data sources for our reporting. We then report on patterns of well-being using traditional measures: income, wealth, and joint income-wealth."}, {"section_title": "Defi nitions and Data Sources", "text": "To identify our target population-households of principal operators of family farms-we start with USDA's defi nition of a farm (\"any place from which $1,000 or more of agricultural products were produced and sold, or normally would have been sold, during the year\"). Because we are interested in the households of the principal farm operators, we restrict our analysis to \"family farms,\" those in which majority ownership of the farm business is held by the operator and relatives of the operator. Most farms (96 percent in 2006) are family owned and operated. For family farms, we identify the principal operator of the operation, and collect information for that individual's household. About 10 percent of family farms have other operators who live in separate households; these households are not included in the population. 1 In this section, we use the full family-farm sample from USDA's Agricultural Resource Management Survey (ARMS), a joint effort by ERS and the USDA National Agricultural Statistics Service, to describe the demographics and economics of farm households. (See Appendix A for more information about data sources.) ARMS is a major source of information for reporting offi cial USDA statistics on farm income and farm household income and wealth. 2 The calculation of household income in ARMS includes: a detailed calculation of farm income, based on farm output, revenue, expenses, and depreciation; the allocation of farm income among stakeholders, including the principal operator, and the nonfarm income of the principal operator's household from earned and unearned sources. 3 ARMS also reports farm and nonfarm household wealth and household expenditure data. For all U.S. households, we rely on the Current Population Survey for income data and the triennial Survey of Consumer Finance for wealth data. Tables 1 and 2 report income-and wealth-based measures of household wellbeing for principal farm operator and all U.S. households for 1996-2006."}, {"section_title": "Income, Wealth, and Joint Income-Wealth Measures", "text": "Following Slesnick (2001) , we start with the three standard well-being measures, all based on household money income for a given year: the level of income at the midpoint of the population (median household income); the dispersion, or inequality, of income across households (the Gini coeffi cient 4 ); and the share of households below a minimum threshold of income adequacy (the Census poverty rate).\nIn the 1930s, the per capita income for farm household members was about half that of nonfarm households (USDA, 1984) . 5 In the 1970s, median farm household income approached that of all U.S. households-in some years, 1 For multiple-operator farms, a principal operator is identifi ed during the annual process of collecting economic information from farm businesses. About 40 percent of farms have more than one operator; however, for three-quarters of the farms with multiple operators, the farm is operated by a husband-wife team, so that both operators are part of the same \"principal operator\" household on which we focus.\n2 See ERS Briefi ng Rooms on Farm Income and Costs (http://www.ers. usda.gov/Briefi ng/FarmIncome/), Farm Household Economics and Well-Being (http://www.ers.usda.gov/Briefi ng/ WellBeing/), and ARMS (http://www. ers.usda.gov/Briefi ng/ARMS/) for more information.\n3 Other net self-employment income is elicited directly from the respondent, as in the Current Population Survey. Though the CPS survey manual indicates that self-employment income is to be reported net of depreciation, this guidance does not appear on the survey form in CPS. Checks comparing farm self-employment income between CPS and ARMS suggest that the typical respondent does not deduct depreciation, resulting in lower estimates of farm self-employment income in ARMS than in CPS. 4 The Gini coeffi cient is a ratio with values between 0 and 1: 0 corresponds to perfect equality (everyone having exactly the same income) and 1 corresponds to perfect inequality (where one person has all the income, while everyone else has zero income). Consequently, a low Gini coeffi cient indicates a more equal income or wealth distribution, while a high Gini coeffi cient indicates a more unequal distribution. it was above the median for all U.S. households, and in other years, it was below it. Since 1998, median income for farm operator households has exceeded median income of all U.S. households by 3 to 21 percent (table 1) .\nIncome levels are more disparate among farm households, as refl ected in consistently higher Gini coeffi cients, than among all U.S. households. However, the Gini coeffi cients are converging: the Gini for all U.S. households rose from 0.455 in 1996 to 0.470 in 2006, implying widening income inequality, whereas the Gini for farm households fell from 0.647 to 0.582. Two other measures of dispersion, the ratio of income at the 80th and 20th percentiles and at the 90th and 10th percentiles, focus specifi cally on the distance between the upper and lower tails of the distribution. For the 80:20 ratio, farm and all U.S. households do converge in 2006 to the same value; for the 90:10 ratio, the gap is shrinking (table 1) . Further, farm households have consistently higher income-based poverty rates (14.4 percent for farm households versus 12.3 percent for U.S. households in 2006) and larger shares with negative household income each year (5-8 percent of farm house- holds, compared with 0.1 percent for all U.S. households across the period) (table 1).\nThe greater income variability among farm households from one year to another can be attributed to the greater share of self-employment income among farm households. Self-employment income is more likely to be negative in a given year due to the variability of business results, as well as to variability in how much production is allocated to inventory rather than sales in a given year and in depreciation expenses from recent capital expenditures. For all U.S. households, the share of income from self-employment averages about 5 percent over 1996-2006 ( Recognizing the variability of income across years and the importance of wealth to sustain consumption amid temporary declines in income, introduced a four-quadrant well-being indicator. It separates households into low-and high-income and low-and high-wealth, using the U.S. household medians for money income and wealth as the dividing lines. The combination of low income and low wealth is interpreted as an indication of \"economic disadvantage.\" Using 2000 data, 6 percent of the U.S. farm population was in the low-income/low-wealth category. As the wellbeing of farm households (both income and wealth) improved over the next 6 years, the share of disadvantaged households fell to 3 percent in 2006. Figure 1 compares the four-quadrant distributions of farm and all U.S. In this chapter, we explore why patterns of consumption behavior may differ for farm households relative to all U.S. households. Then, we outline our approach for constructing consistent consumption measures in the Consumer Expenditure (CE) and ARMS survey data."}, {"section_title": "Consumption Behavior of Farm Households Versus All U.S. Households", "text": "In its simplest form, the permanent income hypothesis (PIH) of consumption and savings behavior posits that the choices made by consumers are determined not by current income but by longer term income expectations. 7 The concept of permanent income is based on the lifetime earning capacity of household real wealth, which includes both physical (real property and fi nancial) and human (education and experience) assets. Measured current income typically contains a permanent component, which is anticipated and planned, and a transitory element, which may be unexpected. The concept of consumption differentiates outlays that result in current enjoyment of goods and services from those that refl ect (at least in part) savings for future enjoyment, including the purchase of durable goods such as housing or vehicles, and fi nancial assets such as retirement accounts and insurance.\nA major implication of the permanent income hypothesis is that-in the face of current income variability around permanent income-consumers will seek to allocate resources in order to smooth the marginal utility of consumption relative to current income. Household groups with higher shares of transitory income, such as the households of farm operators and other selfemployed individuals, are predicted to have lower propensities to consume from current income. Indeed, Friedman (1957) cited this explanation for his fi nding that the elasticity of consumption with respect to current income was lower for farmers than for nonfarmers.\nWhereas 15 years ago the literature interpreted the PIH theory as badly dated, more recent re-formulation of the theory, combined with improved data availability, has reinvigorated this line of research. 8 In recent years, a number of empirical studies have explored predictions from various versions of the permanent income hypothesis. DeJuan and Seater (2006) , analyzing CE data, found that the income-elasticity of consumption is lower for households with greater transitory income. Whittaker and Effl and (2009), using 2003-05 ARMS data, found that increases in relatively stable nonfarm income have a greater impact on farm household spending than do increases in farm production income, which can vary from year to year because of weather, crop failures, animal losses, and/or commodity price fl uctuations.\nThe theory predicts that the level of income variability is an important driver of the extent of consumption-smoothing behavior. Mishra and Sandretto (2002) document the substantial intertemporal variability of farm household income over the past seven decades, and suggest that variability has not declined during this period."}, {"section_title": "8", "text": ""}, {"section_title": "Creating Consistent Expenditure and Consumption Measures With ARMS and CE Data", "text": "In our analysis, consumption refers to own-household consumption during the current year. The household consumption measure of standard of livingthe value of service fl ows received by the household in the current period-is closely related to living expenses (current expenditures), but differs in key ways, requiring three (sometimes impractical) adjustments:\n• The fi rst adjustment is to separate the investment or savings component of expenditures from current consumption. For consumer durables such as housing and vehicles, this can be done by replacing current outlays with the estimated annual fl ow of consumer services. Also, expenditures that represent savings-such as on disability/life insurance and retirement plans-are excluded from the consumption measure. Some argue that education and health expenditures are more appropriately interpreted as investments and should be excluded, but we do not attempt to do so here.\n• A second adjustment is to separate out net expenditures on other households, such as alimony and child support, gifts, and charitable contributions.\n• A third adjustment is to capture goods and services consumed without private economic transactions (and therefore without household fi nancial expenditures)-including leisure, public goods, and in-kind transfers (such as Medicare direct payments to health providers).\nThe categories in the current ARMS living expense (or household expenditure) questions were modeled after the major categories used in the Consumer Expenditure (CE) Survey, the most comprehensive source of expenditure data for U. for more details of the mapping between CE and ARMS categories and other aspects of the construction of the consumption measures in the two survey data sets.)\nThe CE survey collects data on over 200 expenditure items, whereas the ARMS survey now collects data on 10 items. Survey research indicates that the estimated value of an aggregate that depends on summing many components varies with the number of components that are measured. The reasoning is that each component is composed of subcomponents, and respondents will not remember all the subcomponents when reporting the value of the component (Weinberg et al., 1999) . Thus, increasing the number of components that are queried will tend to increase the aggregate of the components. 9\nBy this logic, the ARMS could have a tendency to understate total expenditures. Consequently, we recognize that the ARMS data may be subject to a downward bias, particularly for the aggregated category \"all else.\" In its offi cial reporting of CE data, BLS does not report a consumption measure. However, a number of researchers have calculated a consumption measure from CE data (Johnson et al., 2005; Sullivan, 2003, 2009 ).\nWe make parallel adjustments to expenditure data in CE and ARMS in order to calculate consistent consumption measures from the two surveys.\nThe fi rst set of adjustments relates to separating out savings components of expenditures. For the two durable goods, housing and vehicles, we replace expenditures with the value of estimated service fl ows for shelter and vehicle services. We retain education expenditures (in \"all else\") and health expenditures (as a separate item), but drop expenditures on personal insurance and retirement plans in the analysis samples to calculate consumption for both survey samples.\nThree categories are treated as disposable goods and services (i.e., their expenditures are included directly in the consumption measure)-food, health care, and all else. And in order to drop contributions to other households from our measure of consumption, we exclude the ARMS expenditure category \"charitable contributions and contributions to other households\" and the CE category \"cash contributions.\" 10 CE and ARMS provide limited opportunities to capture goods and services consumed without private economic transactions-our consumption measure does not include leisure, public goods, or barter. One in-kind transfer captured in the food category for both data sets-at least in concept-is food purchased with food stamps. 11 In addition, ARMS allows us to include for farm households \"in-kind farm production for household consumption.\""}, {"section_title": "Calculating Per-Person Equivalence Measures", "text": "Household consumption is subject to economies of scale, where two (or more) people can attain a given standard of living more cheaply in one household than in separate households. To achieve comparability in the perperson standard of living across households of different sizes, we adjust the household income and consumption measures with an equivalence scale. Following Johnson et al. (2005) , we use the single-parameter, constantelasticity equivalence scale, an approach used more frequently in 9 The ARMS question eliciting the \"all else\" measure specifi cally mentions all of the major categories of consumption in the CE survey included in the \"all else\" category, including entertainment, apparel, household furnishings and equipment, education, child (or adult) care, personal care and services; the only major categories not mentioned are alcohol, tobacco products, and reading, which represented 1.1 percent, 0.7 percent, and 0.3 percent of U.S. household consumption in 2006.\nEconomic Research Service / USDA international comparisons of inequality (Johnson and Shipp, 1999) . This particular scale is given by the square root of family size and indicates that the resources for a two-person household must be 41 percent (and not 100 percent) more than those of a single-person household for the two households to have an equivalent standard of living. Table 3 reports descriptive statistics for the fi ve data samples employed in our analysis. For the two main populations, principal farm operator households and all U.S. households, the primary samples are derived from the 2006 ARMS and CE, respectively. We create three additional sub-samples to support within-survey comparisons. Within CE, we pool observations over 3 years (2005) (2006) (2007) to create a sample of households that report receiving farm income. Within ARMS, we create two farm household subsamples that vary greatly in their exposure to income variability from self-employmenthouseholds operating farms with $100,000 or more in sales and households operating farms with $10,000 or less in sales, in which the principal operator has a primary occupation other than farming (very small rural-residence farms)."}, {"section_title": "Data Analysis Samples and Descriptive Statistics", "text": ""}, {"section_title": "Primary Analysis Samples: All Farm Households (ARMS) and All U.S. Households (CE)", "text": "Detailed expenditure data are only requested on one of the fi ve ARMS questionnaires; consequently, the sample used to analyze consumption data is a subset (N = 4,683) of the full 5-questionnaire sample (N = 20,342) for 2006. For the consumption analysis, we use CE data (which are collected on a quarterly basis) from 2006. The distributions of demographic and economic variables in the analysis samples used in this section are very similar to those in the larger samples used in the income and wealth analysis (CPS for U.S. households, and the ARMS full sample for farm households), though we highlight below some differences in the income distributions. (See Appendix A for more details on the data sources and the benchmarking of the analysis samples.)\nFor the CE sample of all U.S. households and the ARMS sample of all farm households, mean values of various demographic and economic characteristics expected to affect the consumption measures are reported in columns 1 and 2 of table 3. Average household size is essentially the same for households of principal farm operators and all U.S. households (2.7 versus 2.5 persons). Not surprisingly, the average age of principal farm operators (57) is greater than for the reference person in CE households (49); however, the average number of farm household members over age 65 is only slightly greater (0.5 versus 0.3 person). Farm operators are much more likely to live in a nonmetro area than all U.S. households (60.6 percent versus 14.6 percent), but have comparable rates of college and post-college education.\nTurning to income measures, we observe the familiar pattern of higher household income for farm operator households relative to all U.S. households. However, both analysis samples appear to understate income relative to the larger samples analyzed in table 1. The income distribution for U.S. households is lower in the CE data than the CPS, throughout the distribution Economic Research Service / USDA (Appendix table A2 ). The share of total household income from (farm and nonfarm) self-employment received by all households is much higher for farm households (22.7 percent) than for all U.S. households (6.0 percent), as expected.\nThe CE collects limited information on wealth, but it does report whether the residence is rented or owned by the household and the market value of an owned home. The fi rst critical difference regarding home ownership between the two populations is that three-quarters of farm operator households report they live in a residence owned by the farm. Virtually all of the rest (around 20 percent) report owning their own home, with only 2 percent reporting that they rent their dwelling. In contrast, among all U.S. households, two-thirds report owning their own home and one-third report renting. Market value of homes is comparable across the two groups for households that own their own home. But for those farm households whose home is owned by the farm, the market value of their residence averages 72 percent of homes owned by all U.S. households."}, {"section_title": "Farm Households (CE)", "text": "Within the CE sample of all U.S. households, we create a farm subsample by selecting any household that reported farm income. To get suffi cient sample size, we pool CE observations from 2005 to 2007. The resulting sample size of 1,235 includes repeat observations of the same unit (up to four quarters in total). (In its statistical analysis, BLS treats each quarterly observation as independent.) The CE farm sample scales up to a U.S. population of around 1.7 million farm households, about 15 percent short of the USDA's count of 2.0 million principal farm operators. The defi cit becomes 23 percent if one takes into account that the CE sample includes households of secondary operators as well.\nDifferences in demographic and economic characteristics suggest the CE sample is an imperfect proxy for the farm population, as defi ned by USDA.\nHousehold income averages about 10 percent higher in the CE farm sample than in ARMS. The wage/salary share is higher in the CE sample (62.0 percent versus 53.6 percent), while the self-employment share and share with negative household income are lower."}, {"section_title": "Diversity Within the Farm Sector: Farms with Sales of $100,000+ and Very Small Rural-Residence Lifestyle Farms (ARMS)", "text": "We exploit the diversity of the farm sector by comparing two farm household subgroups in ARMS-one that is not much exposed to the risks of selfemployment income variability (households operating farms with annual sales of $10,000 or less, with an operator whose primary occupation is other than farming-very small rural-residence farms) and one that is exposed to such risks (households operating farms with annual sales of $100,000 or more)."}, {"section_title": "13", "text": ""}, {"section_title": "Household Expenditure and Consumption Levels", "text": "We focus fi rst on farm households, exploring which components contribute most to differences between farm household consumption and expenditures. We then turn to benchmarking the new ARMS measure against the CE measure. The largest difference between farm expenditures and consumption is attributable to the housing component. The ARMS expenditure measure is substantially lower than consumption because three-quarters of farm households Economic Research Service / USDA report they live in a residence owned by the farm, and so incur no outlays for shelter. Because the consumption measure includes a value for housing shelter services for that group, the average value of housing shelter services jumps to $10,993 from an average expenditure value of $1,472, and the value of total housing (which also includes operating costs) increases from $6,137 in mean expenditures to $15,658 in mean consumption. This adjustment raises total farm household expenditures by 26 percent."}, {"section_title": "Comparing Expenditure and Consumption Measures for Farm Households", "text": "Replacing current outlays for vehicle purchases with estimated vehicle services made little difference on the aggregate level, resulting in a reduction relative to total expenditures of less than 0.5 percent. On the individual level, however, consumption is lower than expenditures for those who purchased vehicles in 2006, and higher for those who did not.\nIncluding the market value of farm production for household consumption adds less than 1 percent to the consumption estimate. (The value of food purchased with food stamps, another in-kind source, cannot be distinguished from other food expenditures.) The deductions of (1) retirement savings and life/disability insurance and (2) contributions to individuals outside the household represent 7.2 percent and 4.7 percent of total expenditures, respectively (table 4) . The shares of consumption/expenditures accounted for by health care and food are higher for farm households than for all U.S. households; the shares spent on housing and \"all else\" are lower, with transport shares essentially the same. The absolute size of the differences in consumption levels between farm and all U.S. households is greatest for health care (+$2,488), followed closely by housing (-$1,744). The major difference in housing is in \"shelter services,\" which refl ects the lower housing values in nonmetro areas (Jolliffe, 2006) , where farm households are much more prevalent. Higher health care expenditures among farm households are consistent with fi ndings in other studies using alternative farm household data sets (Access Project, 2007) . 12 12 A recent study compared health expenditure data from ARMS for farm households with data from the Medical Expenditure Panel Study for all U.S. households, which allows for more detailed decomposition of the differences (Jones et al., 2009) . Health expenditures tend to be higher for all types of insurance coverage (including lack of insurance) among farm households compared to all U.S. households; however, the predominant source of the difference is the larger share of nonelderly farm households holding private direct-purchase insurance (17.9 percent for farm households versus 6.5 percent for all U.S. households), the type with the highest average household health expenditures ($7,389 for all U.S. households compared to $9,110 for farm households).\nEconomic Research Service / USDA"}, {"section_title": "The Relationship Between Household Consumption and Income", "text": "In this section, we assess whether the relationships between income and consumption for farm and all U.S. households are consistent with the prediction that households exposed to greater income variability will smooth consumption from current income more than households with more stable income over time. The fi rst test is to compare the patterns of average equivalentconsumption to average equivalent-income across equivalent-income categories. We fi rst compare the patterns for all U.S. versus all farm households. To assess the reasonableness of the ARMS results, we compare the patterns in consumption shares (food, health, etc.) by type across the income categories. Subsequently, to avoid the noise introduced into the comparison as a result of using two different surveys with different elicitation approaches for expenditures, we conduct in-survey comparisons within CE and ARMS.\nThe second test will compare the consistency of individual household rankings (by quintile in the distributions) for consumption and for income, among farm households versus all U.S. households."}, {"section_title": "Propensity To Consume From Current Income: Farm Versus All U.S. Households", "text": ""}, {"section_title": "ARMS Farm Households and CE All U.S. Households", "text": "We fi rst explore the hypothesis that farm households budget or moderate consumption to a greater extent than all U.S households, analyzing data from the best sources for each population-ARMS for farm households, and CE for all U.S. households. To do this, we split households in each population into six equivalent-income categories. Figure 3 illustrates the value of mean equivalent-consumption associated with mean equivalent-income for each population. Table 5 reports the values, along with additional economic data to provide insight into the extent of income risk-bearing and wealth (to support spending) within the category.\nThe lowest equivalent-income category is for households with negative household income-where self-employment losses exceed other sources of income. (By separating this group out, the interpretation of shares of income from wages or self-employment income is much cleaner.) The income shocks typically needed to generate negative household income are likely transitory, so we expect that permanent income may be substantially higher for households with negative current income. For example, nearly 6 percent of farm households had negative income in 2006 (compared to 0.2 percent for all U.S. households), but their average household net worth of $1.3 million is comparable to farm households with equivalent-income of $70,000-$124,999 (table 5). The average share that self-employment provides of total household income is negative in the second income category ($1-$19,999) for farm households, but increases to over 50 percent in the top two income groupings ($125,000-$224,999 and $225,000 and above).\nEconomic Research Service / USDA As expected, the ratio of consumption to income decreases as income increases for both farm households and all U.S. households. Also as expected, the fl atter consumption-income relationship for farm households illustrates their lower propensity to increase consumption with higher income in a given year, in order to accommodate greater income variability from year to year.\nOur expectation is that, when income is unexpectedly low, farm households will be less inclined to cut back essentials such as food compared to similar households with more stable income, and when income is unexpectedly high, they will be less inclined to expand discretionary purchases. To assess whether we observe such behavior, we also report-for each equivalentincome category-the consumption shares for the fi ve consumption components. We expect food shares will decline and \"all else\" shares will increase with income, except for the group with negative household income-we anticipate this group has positive and substantially higher permanent income, and so will display patterns comparable to a higher equivalent-income category.\nThe trends across income levels in consumption shares by type are comparable in the two populations: consumption shares for food, housing, health careand for farm households, home consumption-basically decrease as income grows; shares for transportation increase until the upper tail of the distribution, where they decrease; and shares of \"all else\" increase across income levels. Households with negative household income are an exception to the pattern. For the most part, shares of \"all else\" consumption are lower for farm households; however, the rates of increase in the shares are the same for farm and all U.S. households. From the lowest (positive) to the highest income category, "}, {"section_title": "20", "text": ""}, {"section_title": "CE Farm Households and CE All U.S. Households", "text": "Farm households retain a fl atter consumption-income relationship (than all U.S. households) when measured with CE data (fi g. 4), though the line is not as fl at as with ARMS data (fi g. 3). This pattern is consistent with expectations, given that, in the two highest income categories, the self-employment income shares for CE farm households are about half that of ARMS farm households (14 and 29 percent for CE farm households versus 31 and 49 percent for ARMS farm households). Less dependent on self-employment income, CE farm households are more likely to have more stable income.\nConsumption shares for farm households relative to all U.S. households in the CE data are consistent with ARMS for some commodities (housing is again lower and medical care higher for CE-farm households than for CE-all U.S. households), but diverge for others (the food share is lower and the \"all else\" share is higher for CE-farm households). Also, the patterns in CE farm consumption shares appear more random, attributable in part to the small sample sizes for individual income categories. Still, as elsewhere, food shares tend to decline with income and \"all else\" shares tend to increase.\nGiven the small sample sizes and presumed differences in risk exposure between cohorts, it seems unwarranted to interpret the differences between the CE and ARMS farm households as indicating understatement of conNote: For the two population groups, each point represents the mean equivalent-income, equivalent-consumption pair for the following equivalent-income categories: (<$0, $1-19,999, $20,000-$39,999, $40,000-69,999, $70,000-124,999, and $125,000-224,999 "}, {"section_title": "21", "text": ""}, {"section_title": "Propensity To Consume From Current Income: Households of Farms with Sales of $100,000+ Versus Households of Very Small Rural-Residence Farms", "text": "We exploit the diversity of the farm sector by comparing two farm household subgroups in ARMS-one that is not much exposed to the risks of self-employment income variability (very small rural-residence farms) and one that is (farms with annual sales of $100,000 or more). For households of large farms, equivalent-income is higher on average, but is also more dispersed: it is more likely to be negative and is more likely to be above $225,000 (table 6) . As expected, households operating these large farms have a lower propensity to consume from current income than households operating very small rural-residence farms (fi g. 5).\nWe again report shares for the fi ve components of consumption. Perhaps due to the smaller sample size, the patterns are less clear than with all farm households. The strongest trends are consistent with our predictions: the food share declines with income and the \"all else\" share increases with income (with one income category out of the pattern for each household type).\nNote: For the two population groups, each point represents the mean equivalent-income, equivalent consumption pair for the following equivalent-income categories: (< $0, $1-$19,999, $20,000-$39,999, $40,000-$69,999, $70,000-$124,999, $125,000-$224,999) . There is insufficient sample size to report the < $0 and $225,000 + categories for very small rural-residence farm households. See table 6 for data.\nDefinitions: Large farms: farms with sales of $100,000 or more. Very small rural-residence farms: farms where the principal operator indicates his primary occupation is other than farming, and whose farm has sales of $10,000 or less this year. Home consumption of farm produce na 0% 0% 0% 0% 0% na 0%\nNotes: To take account of differences in household size and economies of scale in standard of living, we adjust total household income and total household consumption by an equivalence scale (the square root of household size). Defi nitions: Large farms: farms with sales of $100,000 or more. Very small rural-residence farms: farms where the principal operator indicates his primary occupation is other than farming, and whose farm has sales of $10,000 or less this year. Median per-person equivalent-income is $40,493 for very small rural residence farms, and $42,103 for $100,000+ sales farms in this sample. na = insuffi cient sample to report.\nSource: USDA, Economic Research Service using ARMS analysis sample, 2006."}, {"section_title": "23", "text": ""}, {"section_title": "Consistency in Household Ranks in Income and Consumption Distributions", "text": "The lack of a close mapping between current income and consumption measures for farm households compared to all U.S. households can be attributed to the greater discrepancy they experience between permanent income and current income. As such, current income is a weaker proxy for current standard of living for farm (and other self-employed households) than for all U.S. households.\nThe two-way distributions in table 7 were inspired by the earlier work of Rogers and Gray (1994) , who compared quintiles of income to quintiles of outlays for all U.S. households using 1992 CE data. If current income were a good predictor of consumption, we would expect households to be concentrated along the diagonals, where the household quintile ranking in the consumption distribution matches its ranking in the income distribution; alternatively, if the two were uncorrelated, a random distribution would suggest 20 percent in each cell in the income row.\nEquivalent-income and equivalent-consumption quintiles: For U.S. households, the diagonal cells have the largest share of households along each row in the income-consumption table. The effect is strongest for the fi rst and fi fth quintiles: notably, 58 percent of households in the lowest income quintile are in the lowest consumption quintile, and 56 percent of households in the highest income quintile are in the highest consumption quintile. The other diagonal cells have about one-third of their row totals. Farm households are more likely to be off-diagonal. For example, among farm households, those in the lowest income quintile are much more likely to be in one of the three highest consumption quintiles than is evident for all U.S. households (39 percent of farm versus 22 percent of all U.S. households). Analogously, farm households in the highest income quintile are much more likely to be in the three lowest consumption quintiles (34 percent of farm versus 15 percent of all U.S. households)."}, {"section_title": "Income-wealth quintiles:", "text": "The fi nal two-way comparison in table 7 is income versus net worth quintiles for farm households. The divergence in ranking between income and wealth is particularly strong for those in the fi rst income-quintile (53 percent of which are in the top three wealth quintiles). This is consistent with households that operate commercial farms with an extensive asset base experiencing large income dips in a given year.\nIn sum, the extensive divergence in quintile ranking between income and consumption indicates that current farm household income is more variable than the long-term, or permanent, household income that drives consumption.\nSince wealth provides a source of assets to draw down or to borrow against during temporary income shortfalls, the even stronger pattern of divergence between income and wealth quintiles for farm households further supports this inference."}, {"section_title": "25", "text": ""}, {"section_title": "Households, as Indicated by Income and Consumption", "text": "Household income of farm households, compared to all U.S. households, is higher at the mid-point of the distribution, but also is more dispersed-lower at the low end of the distribution and higher at the high end; as a result, farm household income is higher at all deciles but the fi rst, compared to all U.S. households (fi g. 6). Farm households also have a lower tendency to increase consumption as income increases than do all U.S. households. What, then, is the net effect of these countervailing patterns on the distribution of consumption levels in the two populations?\nTo illustrate the different perspectives on relative well-being of farm and all U.S. households afforded by income and consumption measures, table 8 presents the values at each decile of the income and consumption distributions for the two populations. As a benchmark for the income data in the smaller consumption-analysis samples, column 1 of table 8 reports the value of equivalent-income at each decile, using CPS for all U.S. households and the full ARMS sample (with data from all fi ve survey versions) for farm households. Columns 2 and 3 report the values at the deciles of equivalent-income and equivalent consumption, respectively, using the CE (for all U.S. households) and the ARMS (for all farm households) consumption-analysis samples.\nComparing the distribution of equivalent-income in columns 1 and 2 indicates that the ARMS consumption-analysis sample understates farm household income (relative to the full ARMS sample) at the 90 th percentile and the CE income distribution understates all U.S. household income (relative to CPS) throughout the distribution. As a result, the farm household dominance in household income appears even greater in column 2 relative to column 1, except at the 80 th and 90 th percentiles. In column 3, we see that the net effect of predominantly higher income, but a lower propensity to consume as income increases, is that the farm household distribution of consumption is very similar to that for all U.S. households. The similarities are strongest for the 30 th , 40 th , and 50 th percentiles of the distribution. At the tails of the distributions, the pattern appears to be reversed from that of the income distribution: farm households appear better off at the low end of the distribution and worse off at the high end of the distribution, relative to all U.S. households.\nWe need to qualify the results at the upper end of the distribution because we are not able to rule out the possibility that measurement error could understate consumption levels at the upper end; in addition, there is attrition from the sample of the highest-income farm households, resulting in lower income at the 90 th percentile.\nOur fi nal indicator of well-being focuses on the low end of the distributionincome and consumption poverty rates. A convention in the literature is to calculate consumption poverty by comparing a household's consumption level to the census poverty threshold for the composition of that household, used to determine offi cial income-based poverty rates. If consumption is a better indicator of standard of living for households where money income is less predominant as a resource and/or where income is highly variable across years, then consumption poverty may be a better measure of economic disadvantage than the offi cial census income-based measure (Jorgenson, 1998; Meyers and Sullivan, 2003; Slesnick, 2001) . The census poverty threshold incorporates an adjustment for household size (including age composition), one that is different from the equivalency measure employed in our data analysis. Consequently, poverty rates are calculated on total income and total consumption measures.\nFor the farm population (based on the ARMS analysis sample), poverty drops from 13.8 percent (14.4 percent in full ARMS sample) based on the offi cial census income-poverty measure to 7.8 percent for the consumption-poverty measure. For all U.S. households (based on the CE analysis sample), poverty drops from 11.8 percent (12.3 percent in CPS) based on the offi cial Census income-poverty measure to 9.2 percent for the consumption-poverty measure. Whereas farm households have a higher income-poverty rate, they have a lower consumption-poverty rate than all U.S. households.\nIn table 9 and fi gure 7, we report the per-person equivalent-income and equivalent-consumption distributions for households operating $100,000+ sales farms and very small rural-residence farms, two farm household subgroups that differ substantially in the extent of exposure to income variability from self-employment. Per-person equivalent-income is much more dispersed for households operating the larger farms than for households operating the very small farms, a pattern that affects both tails of the distribution: the larger-farm household income is lower at the low end of the distribution (indeed negative until the 14 th percentile compared to below the 2 nd percentile for the very small farms), and higher at the high end of the distribution. However, the propensity to consume is suffi ciently lower among the larger-farm households that the consumption distributions are very similar. Analogously, the income-poverty rates are quite divergent (22 percent for $100,000+ sales farms versus 7 percent for very small rural-residence farms), but the consumption-poverty rates are roughly 6 percent for both groups. To further understand the relative well-being of farm households, it is also instructive to compare all U.S. households (table 8, fi gure 6) with the subgroup of large-farm households (table 9, fi gure 7). Though large family farms (farms with sales of $100,000 or more) represent only 16 percent of farms, they produced 89 percent of total farm sales in 2006. At the low end of the income and consumption distributions, large-farm households have substantially lower equivalent-income, but higher equivalent-consumption, than the population of all family-farm households-which further increases the farm-all U.S divergence on the two measures. The differences at the low end are refl ected in the poverty rates: income poverty is 22 percent among persons living in large-farm households, compared to 14 percent for persons in all farm households and 12 percent for all U.S. households; whereas consumption-poverty is 6 percent for persons living in large-farm households, compared to 8 percent in all farm households and 9 percent in all U.S. households.\nAt the high end of the income and consumption distributions, large-farm households have substantially higher equivalent-income, but-due to their higher exposure to income risk and their lower marginal propensity to consume-only slightly higher equivalent-consumption than all family-farm households. As a result, at the upper end of the consumption distribution, the consumption levels of large-farm households are very similar to those of all U.S. households. "}, {"section_title": "Conclusions", "text": "ERS publishes indicators of economic well-being for farm operator households. To date, the focus has been on income-and wealth-based measures calculated from the annual survey of farm households conducted by USDA (ARMS). In this report, we present estimates of a consumption measure for farm households calculated using revised ARMS expenditure questions, and benchmark the measure against the Bureau of Labor Statistics' Consumer Expenditure Survey (CE).\nTo assess the possibility of distortions introduced into the comparison from using surveys with different elicitation methods for expenditures, we conducted within-survey comparisons: within CE, we compared data for a sample of farm households created by pooling data for 2005-07 with data for all U.S. households; within ARMS, we compared data for two farm household subgroups that diverge substantially in their degree of reliance on farm income. The results support the reasonableness of the fi ndings.\nCiting extensive literature on household well-being, we argue on conceptual grounds that current consumption of goods and services provides an important complement to income and wealth in characterizing household economic well-being. Whereas income and wealth are important indicators of resources, current consumption is an indicator of current material standard of living. Further, consumption provides useful information about a household's lifetime standard of living because, when households face temporary increases or decreases in income relative to long-term income expectations, they tend to smooth consumption relative to variable income in order to maintain a standard of living linked to their long-term income expectations.\nAt an individual household level, there is not a close mapping between the income and consumption measures for farm households, compared with all U.S. households. Also, across the population, the consumption measure provides a different perspective than income and wealth on the distribution of well-being among farm households relative to all U.S. households. Farm households appear to have higher equivalent-income than all U.S. households at all income deciles but the lowest. But farm households, which are exposed to greater income volatility, have lower marginal propensities to consume from current income. The net effect is that the distribution of consumption appears to be similar for farm and all U.S. households. However, for farm households, the data suggest that consumption is higher at the low end of the distribution and lower at the high end of the distribution relative to all U.S. households.\nAnalogously, using poverty rates as an indicator of disadvantage within the populations, the relative levels of disadvantage are reversed when we switch from an income-poverty rate to a consumption-poverty rate, calculated by comparing household consumption to the census poverty threshold employed in offi cial U.S. income poverty statistics. Whereas the income poverty rate is higher, the consumption poverty rate is lower for farm households relative to all U.S. households. The divergence in income-and consumption-poverty rates between farm and all U.S. households is even greater when we focus on households that operate farms with sales of $100,000 or more, which are more exposed to the income risks of self-employment.\nEconomic Research Service / USDA collecting economic information from farm businesses. 3 The unit of observation, then, is the household of the principal operator."}, {"section_title": "Expenditure/consumption analysis sample:", "text": "To analyze consumption and expenditures, we use a sample constructed from questionnaire version 1, the only version in which detailed household expenditure data are elicited. Currently, USDA does not impute values of the living expense component variables. The set of variables is subject to substantial nonreporting, resulting in a net loss of 28 percent of the farm population. We also select for study two subgroups within the farm household population: farm operator households of farms with sales of $100,000 or more (\"large\") and farm operator households of very small rural-residence farms (those where the principal operator indicates an occupation other than farming as his primary occupation, and whose farm has annual sales of $10,000 or less).\nTo assess the implications of using the smaller version 1 sample with attrition due to missing data, we report in Appendix table A1 descriptive statistics for key demographic and economic variables for the expenditure/consumption analysis sample (N=4,683), the full version 1 sample (N=6,457), and the full sample across the fi ve versions of the survey (N=20,342). We fi nd that the values in the analysis sample generally were very similar to the larger samples. Among the demographic variables, the analysis-sample values of all variables-including operator age, household composition by age category, and education-were within +/-5 percent of the full-sample values.\nAmong the variables characterizing the distributions of farm household income and wealth, the only variable that was substantially different was median debt level. Since, on average, debt is a small fraction of assets, the difference is not refl ected in net wealth."}, {"section_title": "Current Population Survey, Annual Social and Economic Supplement", "text": "The Annual Social and Economic Supplement (ASEC) of the Current Population Survey (CPS) is designed to provide timely and detailed estimates of income, poverty and health insurance coverage, and to measure change in those estimates at the national level. The sample is scientifi cally selected to represent the civilian noninstitutional population living in the U.S. The unit of observation is the household. About 70,000 households are interviewed each year.\nAnalysis sample: Because CPS collects data for a larger sample relative to CE, we use CPS to calculate estimates of well-being measures based on household money income for all U.S. households (tables 1 and 2). We also use it to benchmark the CE data, including the estimates of household 3 About 40 percent of farms have more than one operator; however, for three-quarters of the farms with multiple operators, the farm is operated by a husband-wife team, so that both operators are part of the principal operator household on which we focus. About 10 percent of family farms have other operator households associated with the farm, for which no data are collected."}, {"section_title": "36", "text": "Farm "}, {"section_title": "Survey of Consumer Finance (Federal Reserve Board)", "text": "The Survey of Consumer Finance (SCF), a triennial survey published since 1989, is the major source of wealth estimates for the U.S. population.\nThe SCF unit of analysis differs somewhat from that in ARMS, CPS, and CE. Most of the data in the survey are intended to represent the fi nancial characteristics of a subset of the household unit referred to as the \"primary economic unit\" (PEU). In brief, the PEU consists of an economically dominant single individual or couple (married or living as partners) in a household and all other individuals in the household who are fi nancially interdependent with that individual or couple. Typically, around 4,500 economic units are interviewed for the main portion of the survey."}, {"section_title": "Analysis sample:", "text": "This survey is the source of data for household wealth distributions for all U.S. households in table 2."}, {"section_title": "Consumer Expenditure Survey", "text": "The Consumer Expenditure Survey (CE) is a nationally representative sample conducted by the Bureau of Labor Statistics, designed to provide a continuous summary of the spending habits of U.S. households. Expenditure data are reported at the level of the consumer unit, which is defi ned as either a group of individuals who are related by blood or marriage, a single or fi nancially independent individual, or two or more persons who share resources. Interview data are collected from consumer units fi ve times over a 13-month period, every 3 months over fi ve calendar quarters. In the fi rst interview, data on demographic characteristics for each member of the consumer unit age 14 and over and an inventory of major durable goods of the consumer unit are collected. In interviews 2-5, expenditure data for the consumer unit for the prior quarter are collected. Employment and income information are collected in interview 2\nAppendix Economic Research Service / USDA (which is carried over to interviews 3 and 4) and interview 5. (CE also includes a separate diary survey providing more detailed information on smaller or more frequent expenditures that are more diffi cult to recall.) In total, around 7,100 households participated each quarter in 2006.\nExpenditures consist of the transaction costs, including excise and sales taxes, of goods and services acquired during the interview or recordkeeping period. Expenditure estimates include expenditures for gifts, but exclude purchases or portions of purchases directly assignable to business purposes. Also excluded are periodic credit or installment payments on goods or services already acquired; however, interest applied to these balances is included in expenditures. The full cost of each purchase is recorded, even though full payment may not have been made at the date of purchase. CE elicits consumer-unit totals for multiple categories of income, using an open-ended format. If respondents indicate they do not know the exact amount, they are asked a followup question by a value-code elicitation format (the top code is $50,000 and up).\nMany articles have documented measurement error in the income measure reported in CE, which results in substantial underestimates of income, on average. More recently, the Consumer Expenditure Survey has implemented multiple imputation of income data, starting with the publication of the 2004 tables. In multiple imputation, several estimates are made for the same consumer unit, and the average of these estimates is published.\nAll U.S. household analysis sample: We use the individual interview data from the CE survey to report household expenditures and consumption measures for all U.S. households, and for comparisons of consumption and income within individual households.\nTo benchmark the CE sample, we compare CE and CPS estimates of key variables in Appendix table A2. In particular, we are interested in the comparison of the income distribution. We observe in Appendix table A2 that the demographic and family composition characteristics have similar values in the CPS and CE samples. However, at each of the decile cutpoints, the values of income are underestimated between 6 and 12 percent, with the greatest underestimate occurring at the 10th percentile.\nEconomic Research Service / USDA owning their residence through the household rather than through the farm business."}, {"section_title": "CE:", "text": "To calculate housing shelter services for all U.S. households from CE data, we follow standard practice and use the self-reported rental equivalence value obtained from the consumer unit. Consumer units who own their own home are asked, \"If someone were to rent your home today, how much do you think it would rent for monthly, unfurnished and without utilities?\" For respondents who do not know the rental equivalence of their home, CE reported an imputed value.\nTransportation service fl ows CE: To calculate transportation services for all U.S. households, we calculate the user cost of capital based on Slesnick (1994 Slesnick ( , 2001 ) and others. In their formulation, the service fl ow in a given year from an asset = (r+d), where r = interest rate and d = depreciation rate. Starting with the original purchase price reported in CE, their formula is: St = (r+d)(1-d)s * P0, where P0 is the original purchase price and s = age of the vehicle. We assume, as Slesnick does, that r =.05 and d =.10."}, {"section_title": "ARMS:", "text": "To calculate transportation services for farm households, we employ the same approach as with CE data. Since ARMS data include the current asset value, the calculation simplifi es to .15*household-owned current asset value."}]