[{"section_title": "Introduction", "text": "[2] Based on the physical properties and mass of the world ocean as compared to other components of Earth's climate system, Rossby [1959] suggested that ocean heat content may be the dominant component of the variability of Earth's heat balance. Recent work [Levitus et al., 2000[Levitus et al., , 2001 has confirmed Rossby's suggestion. Warming of the world ocean due to increasing atmospheric greenhouse gases was first identified in a report by Revelle et al. [1965]. The delay of atmospheric warming by increasing greenhouse gases due to initial heating of the world ocean was suggested by the National Research Council [NRC, 1979]. Here we present new yearly estimates for the 1955 -2003 period for the upper 300 m and 700 m layers and pentadal (5-year) estimates for the 1955 -1959 through 1994 -1998 period for the upper 3000 m of the world ocean. [3] The heat content estimates we present are based on an additional 1.7 million (S. Levitus et al., Building ocean profile-plankton databases for climate and ecosystem research, submitted to Bulletin of the American Meteorological Society, 2004) temperature profiles that have become available as part of the World Ocean Database 2001 [Conkright et al., 2002]. Also, we have processed approximately 310,000 additional temperature profiles since the release of WOD01 and include these in our analyses. Heat content computations are similar to those described by Levitus and Antonov [1997]. Here we use 1957-1990 as the reference period for our estimates."}, {"section_title": "Global and Basin Time Series", "text": "[4] Figure 1 shows yearly estimates of ocean heat content for the upper 300 and 700 m layers and pentadal estimates for the upper 3000 m of the world ocean. It shows that a large part of the change in ocean heat content during the past 50 years has occurred in the upper 700 m of the world ocean. [5] For the world ocean the linear trend of heat content (0 -3000 m layer for 1955 -1998) is 0.33 Â 10 22 J year À1 (corresponding to a rate of 0.20 Wm À2 [per unit area of Earth's total surface area]) representing an increase in heat content of 14.5 Â 10 22 J (corresponding to a mean temperature increase of 0.037°C). For the Atlantic, Pacific, and Indian Oceans the increases of heat content (linear trends) are respectively 7.7, 3.3, and 3.5 Â 10 22 J. As with our previous work, it is the Atlantic Ocean that contributes most to the increase in heat content. Ocean heat content time series for individual ocean basins as well as the world ocean with confidence intervals added are in the auxiliary material 1 . Table A1 in the auxiliary material gives the change in heat content (based on the linear trend for each basin) and the basin average change in temperature. The linear trends used to compute these changes are given in Table A2 along with the corresponding heat storage estimates (time derivative of heat content per unit area). In Table A2 the values are per unit area of the corresponding ocean basin as opposed to the values given above which are given per unit area of the Earth's surface. [6] One dominant feature of the curves in Figure 1 is the large decrease in ocean heat content beginning around 1980. The 0 -700 m layer exhibits a decrease of approximately 6 Â 10 22 J between 1980 and 1983. This corresponds to a cooling rate of 1.2 Wm À2 (per unit area of Earth's total surface). Most of this decrease occurs in the Pacific Ocean. Figure A4 shows the interpentadal difference in zonally averaged heat content by 100-m thick layers for the Pacific for (1986 -1990) minus (1977 -81). Most of the net decrease occurred at 5°S, 20°N, and 40°N. Gregory et al. [2004] have cast doubt on the reality of this decrease but we disagree. Inspection of pentadal data distributions at 400 m depth (not shown here) indicates excellent data coverage for these two pentads. [7] As previously noted [Levitus, 1989;Levitus et al., 2000], large temperature anomalies are observed for the North Atlantic at 1750 m depth. However, the net contribution to the global heat content integral by these anomalies is small. Figure A5 shows heat content integrals for the North Atlantic which indicate that the contribution of the 1000-3000 m layer is 1.3 Â 10 22 J which is about 9 percent of the global increase (0 -3000 m layer) during this period. We note that this does not mean this region is unimportant for climate change, only that its net contribution to the global integral of ocean heat content is relatively small.  Figure 2) is positive at most latitudes with the largest increase in the upper layer of the world ocean with one notable exception. There is a large negative trend centered at about 150 m depth in the equatorial region and southern hemispheric tropics. Examination of Figures A6 -A8 shows that much of this cooling occurs in the Pacific Ocean. This may be associated with the reversal of polarity of the Pacific Decadal Oscillation [Stephens et al., 2001] during the late-1970s. The Indian Ocean exhibits subsurface cooling along 10°S. Two other regions of cooling include the North Pacific around 40°N and the North Atlantic centered at 60°N. It is well known that the subarctic gyre of the North Atlantic has been cooling during recent decades. Levitus et al. [1994 documented a linear cooling trend of about 0.13°C at 125 m depth based on Ocean Weather Station ''C'' data during 1948 -85 with quasi-decadal oscillations of about 2.0°C range. Dickson et al. [2002] documented the cooling and freshening of the deep waters of the Labrador Sea since the early-1970s which has resulted in the cooling of the deep waters of the entire subarctic gyre of the North Atlantic . The Pacific cooling trend at 40°N may represent movements of the large-scale front in this region [e.g., Minobe, 2002], or it may represent changes in the temperature of this frontal region. In the Southern Hemisphere there is a positive linear trend extending to 1100 m depth centered at 40°S. In addition to our earlier work, Southern Ocean warming between the 1950s and 1980s has been documented by Gille [2002] based on in situ observations including PALACE float data. Based on in situ data Willis et al. [2004] have documented a positive linear temperature trend centered along 40°S for 1993-2003and Cabanes et al. [2001 have inferred a linear trend in this region based on a comparison of altimeter data and in situ data for 1993 -98."}, {"section_title": "Liner Trend of Zonally Integrated Heat Content as a Function of Depth", "text": ""}, {"section_title": "Earth's Heat Balance", "text": "[9] To understand the variability of the Earth's climate system it is important to estimate the contributions of different terms in Earth's heat balance. In Figure 3 we update earlier estimates [Levitus et al., 2001] of the different components of Earth's heat balance. In addition to our new ocean heat content estimate, an additional term in the Earth's heat balance now available is the variability of the heat content of Earth's lithosphere. Beltrami et al. [2002] used temperature profile data from boreholes to make this estimate. They estimate that Earth's continents warmed by 0.9 Â 10 22 J during the past 50 years. This value is of the same order as the warming of the Earth's atmosphere during this period and the heat of fusion associated with possible melting of the Antarctic continental glacier assuming an estimated maximum melting rate [Houghton et al., 2001]. Inspection of Figure 3 indicates that the world ocean is responsible for approximately 84% of the estimated possible total increase of heat content of the Earth system for 1955 -1998."}, {"section_title": "Discussion and Perspective", "text": "[10] In terms of the causes of the increase in ocean heat content we believe that the long-term trend as seen in these Figure 1. Time series of yearly ocean heat content (10 22 J) for the 0 -300 and 0 -700 m layers and pentadal (5-year running composites for 1955 -59 through 1994-98) ocean heat content (10 22 J) for the 0 -3000 m layer. Each yearly estimate is plotted at the midpoint of the year; each pentadal estimate is plotted at the midpoint of the 5-year period.  records is due to the increase of greenhouse gases in the Earth's atmosphere [Levitus et al., 2001]. In fact, estimates of the net radiative forcing of the Earth system [Hansen et al., 1997] suggest the possibility that we may be underestimating ocean warming. This is possible since we do not have complete data coverage for the world ocean. However, the large decrease in ocean heat content starting around 1980 suggests that internal variability of the Earth system significantly affects Earth's heat balance on decadal time-scales. [11] After publication of our previous work [Levitus et al., 2000], one question put to us is that since atmospheric greenhouse gases such as carbon dioxide, methane, etc. are well mixed in the atmosphere, why isn't the ocean responding uniformly? There are two reasons one does not expect uniform heating of the ocean from the observed increase in greenhouse gases. The first is that the natural and anthropogenic aerosols are not well mixed geographically and can have a substantial effect on regional warming rates. This has been documented for the northern Indian Ocean by Ramanathan et al. [2001aRamanathan et al. [ , 2001b who estimate a decrease of absorbed surface solar radiation exceeding 10 Wm À2 over much of the Indian Ocean due to aerosols. Also, the Houghton et al. [2001] report documents the geographical variability of various aerosols, ozone, black carbon, etc. that affect the amount of radiation available to enter the world ocean. The second reason is that any change in the Earth's radiative balance may induce global and regional changes in the circulation of the atmosphere and ocean which could in turn affect the net flux of heat across the air-sea interface on a regional basis. [12] We quantify a relation between heat and temperature anomalies of the ocean and atmosphere for the purpose of documenting how the climate system works. The heat content (H o ) associated with a mean temperature anomaly of the world ocean, DT o (°C), can be written: in which the m o is the mass of the ocean (1.4 Â 10 21 kg), c po is the specific heat of seawater at constant pressure at the sea surface (4 Â 10 3 J(°C-kg) À1 ). Similarly, the heat content (H a ) associated with a mean temperature anomaly of the atmosphere, DT a (°C), can be written: in which m o is the mass of the atmosphere (5.3 Â 10 18 kg) and c pa is the specific heat of dry air at constant pressure (1 Â 10 3 J(°C-kg) À1 ). The values in these two relations have been taken from Gill [1982] and Curry and Webster [1999]. By equating these two relations we find that DT a = 1056 (DT o ). Thus, a mean temperature change of 0.1°C of the world ocean would correspond roughly to a mean temperature change of 100°C of the global atmosphere if all the heat associated with this ocean anomaly was instantaneously transferred from the ocean to the atmosphere. This of course will not happen but this computation illustrates the enormous heat capacity of the ocean versus the atmosphere. [13] Our discussion here has not been to minimize the impacts of warming of the lower atmosphere due to increasing greenhouse gases, we are simply placing Earth's heat balance in perspective. The response of the Earth's climate system to changes in radiative forcing is often cast as the response of the Earth's surface temperature to these forcings. This is understandable because we live at the Earth's surface and there has been a lack of subsurface ocean data with which to conduct Earth system heat balance studies. Improved scientific understanding requires that we study the response of all components of the Earth's heat balance, of which the world ocean is the dominant term. [14] Electronic versions of the yearly and pentadal heat content fields used here and data distribution maps by yearly and pentadal compositing periods are available at http://www.nodc.noaa.gov/OC5/indprod.html. [15] Acknowledgments. This work was supported by the NOAA Climate Change Data and Detection Program with support from DOE. We thank many scientists, IODE data centers, and project data centers for their contributions of data to the ICSU World Data Center system which has allowed us to build the database used in this work. We also thank our colleagues at the Ocean Climate Lab. for their efforts in constructing the World Ocean Database. The views, opinions, and findings contained in this report are those of the authors, and should not be construed as an official NOAA or U.S. Government position, policy, or decision. 1 Figure S1. Time series  of yearly ocean heat content (10E+22 J) for the upper 300 m of the world ocean and individual ocean basins. Vertical lines through each yearly estimate represent plus and minus one standard error of the estimate of heat content. The linear trend is plotted as a red line. The percent variance accounted for by this trend is given in the upper left corner of each panel.    Percent variance accounted for by the linear trend of ocean heat content for the Pacific Ocean shown in Figure S6."}, {"section_title": "Figure 11", "text": "Percent variance accounted for by the linear trend of ocean heat content for the Atlantic Ocean shown in Figure S7."}, {"section_title": "Figure 12", "text": "Percent variance accounted for by the linear trend of ocean heat content for the Indian Ocean shown in Figure S8. Table T1. Change in ocean heat content (10+22J) and mean temperature (C) as determined by the linear trend for the world ocean and individual basins."}, {"section_title": "Ocean", "text": "Change in heat content and mean temperature as basin determined by linear trend 0-300 m 0-700 m 0-3000 m (1955-2003) (1955-2003) (1955-59) "}]