[{"section_title": "Abstract", "text": "Five years of SMOS L-band brightness temperature data intercepting a large number of tropical cyclones (TCs) are analyzed. The storm-induced half-power radio-brightness contrast (ΔI) is defined as the difference between the brightness observed at a specific wind force and that for a smooth water surface with the same physical parameters. ΔI can be related to surface wind speed and has been estimated for ~ 300 TCs that intercept with SMOS measurements. ΔI, expressed in a common stormcentric coordinate system, shows that mean brightness contrast monotonically increases with increased storm intensity ranging from ~ 5 K for strong storms to ~ 24 K for the most intense Category 5 TCs. A remarkable feature of the 2D mean ΔI fields and their variability is that maxima are systematically found on the right quadrants of the storms in the storm-centered coordinate frame, consistent with the reported asymmetric structure of the wind and wave fields in hurricanes. These results highlight the strong potential of SMOS measurements to improve monitoring of TC intensification and evolution. An improved empirical geophysical model function (GMF) was derived using a large ensemble of colocated SMOS ΔI, aircraft and H*WIND (a multi-measurement analysis) surface wind speed data. The GMF reveals a quadratic relationship between ΔI and the surface wind speed at a height of 10 m (U10). ECMWF and NCEP analysis products and SMOS derived wind speed estimates are compared to a large ensemble of H*WIND 2D fields. This analysis confirms that the surface wind speed in TCs can effectively be retrieved from SMOS data with an RMS error on the order of 10 kt up to 100 kt. SMOS wind speed products above hurricane force (64 kt) are found to be more accurate than those derived from NWP analyses products that systematically underestimate the surface wind speed in these extreme conditions. Using co-located estimates of rain rate, we show that the L-band radio-brightness 2 Please note that this is an author-produced PDF of an article accepted for publication following peer review. The definitive publisher-authenticated version is available on the publisher Web site.\ncontrasts could be weakly affected by rain or ice-phase clouds and further work is required to refine the GMF in this context.\n► 5 years of SMOS radiometer L-band data intercepts with tropical cyclones are analyzed. ► The storm-induced brightness contrast ΔI monotonically increases with their intensity. ► In average, the brightest ΔI is found in the right-hand side quadrants of the storms. ► A quadratic relationship relates ΔI and the 10 m height surface wind speed (SWS). ► SWS can be retrieved from SMOS with an RMS error of 5 m/s up to 50 m/s."}, {"section_title": "", "text": "Please note that this is an author-produced PDF of an article accepted for publication following peer review. The definitive publisher-authenticated version is available on the publisher Web site.\ncontrasts could be weakly affected by rain or ice-phase clouds and further work is required to refine the GMF in this context."}, {"section_title": "Introduction", "text": ""}, {"section_title": "58", "text": "The measurement of surface wind speed in Tropical Cyclones (TC) is of primary importance for 59 improving storm tracks and intensity forecasts. Unfortunately, obtaining accurate direct or remote 60 measurements at the sea surface level in the extreme conditions of a TC remains a significant challenge 61 (Ulhorn et al., 2007; Powell, 2010, Knaff et al., 2011) . Active remote sensing methods of wind 62 measurement saturate in hurricane force winds (e.g., Donelly et al., 1999) and suffer heavily from rain 63 contamination in the TC's eye wall and outer rain band regions (Weissman et al., 2002) . In recent years 64 microwave radiometry has played an important role through the successful development and application 65 of the Stepped Frequency Microwave Radiometer (SFMR) that is the National Oceanic and Atmospheric 66 Administration (NOAA)'s primary airborne sensor for estimating surface wind speed in hurricanes 67 (Uhlhorn et al., 2007) . The SFMR instrument measures the brightness temperature of the ocean surface 68 using six distinct C-band frequencies, including frequencies which permit the measurement, and 69 correction for, both rain and surface wind speed. Unfortunately, the SFMR is limited by aircraft range in 70 the North Atlantic and Eastern Pacific and there is still no equivalent sensor capability flying in space 71 today. Most available active and passive orbiting sensors operating in the low microwave frequency 72 bands show poor surface wind speed retrieval performances above hurricane force, largely because of 73 the difficulty to precisely separate wind from rain effects (Powell, 2010) . 74\nPromising new approaches are nevertheless currently under development based on different 75 sensor technologies. One of these approaches is based on the new capabilities of the Advanced 76\nMicrowave Scanning Radiometer 2 (AMSR-2) on board the GCOM-W satellite (Zabolotskikh et al., 77 2015) . The method developed by Zabolotskikh et al. (2015) to retrieve sea surface wind speed and rain 78 in tropical cyclones involves the combination of brightness temperature data acquired at the six C-and 79 X-band channels of AMSR-2. Contrarily to the previous AMSR and AMSR-E sensor series, which only 80 operated a single ~6.9 GHz channel, AMSR-2 is now also equipped with an additional C-band channel 81 at 7.3 GHz designed to mitigate for Radio-Frequency Interference (RFI). Using this new channel help to 82 separate the respective contributions from the wind-induced and rain-induced emissivitysignal : this has 83 been efficiently exploited in the multi-frequency algorithm of Zabolotskikh et al. (2015) . Other promising 84 approaches for spaceborne remote sensing of high surface wind speeds include the exploitation of active 85 cross-polarization C-band SAR data (see Horstmann et al., 2013) , and L-band GPS bistatic scatterometry 86 (Ruf et al., 2013) wind observations in TCs and severe weather. This is because upwelling radiation at 1.4 GHz (L-band) 92 is significantly less affected by rain and atmospheric effects than at higher microwave frequencies (Reul 93 et al., 2012) . SMOS provides multi-angular L-band brightness temperature images of the Earth over a 94 ~1000 km swath at about ~43 km nominal resolution. SMAP performs simultaneous measurement of L-95 band brightness temperature, at spatial resolutions of about 40 km across the entire swath ~1000km wide 96 (Entekhabi et al., 2014) . Both missions provide data with global coverage in about 3-days due to their 97 large swath. In the context of TC surface wind speed retrieval, the Aquarius sensor is limited because of 98 the low spatial resolution of the three L-band microwave radiometers (~100 km) and the relatively 99 narrow width of their swaths (~300 km when combining all 3 beams), resulting in a global revisit time 100 of only 7 days. While the combination of passive and active L-band measurements is an emerging and 101 promising approach for surface wind speed retrieval in extreme conditions, in this paper, we shall focus 102 only on the brightness temperature signatures of TCs as observed by the SMOS radiometer between 103"}, {"section_title": "2010-2015. 104", "text": "The first demonstration of SMOS L-band passive microwave data could be used to retrieve 105 meaningful surface wind speed in TCs has been provided in . The L-band microwave 106 brightness temperature contrast of the sea surface, defined as the difference between the brightness 107 temperature observed at surface level at some wind force and the brightness temperature of the smooth 108 water surface with the same physical parameters (temperature and salinity), were evaluated. The induced 109 radio-brightness contrasts observed by SMOS as it intercepted storm Igor, a category 4 hurricane, at 110 several stages of its evolution during 11 to 19 September 2010, were co-located and compared to 111 observed and modelled surface wind speed products. From this dataset, a first Geophysical Model 112 Function (GMF) was proposed to describe the relation between the half power L-band radio-brightness 113 contrast of the ocean with the surface wind speed modulus at a height of 10m (U10). The radio-brightness 114 contrast is defined by: 115 ∆I = ∆ (Th+Tv)/2\n(1) 116\nwhere Th and Tv are brightness temperature in horizontal and vertical polarization, respectively. ∆I was 117 found to increase quasi-linearly with increasing wind speed with a significant change of sensitivity 118 ( ∆ ⁄ ) from ~0.15 K/(kt) below hurricane force (~64 kt) to ~0.36 K/(kt) above. The GMF was used 119 to retrieve surface wind speed from SMOS data over independent storm Igor intercepts. The radii of 34, 120 50, 64 knots and of the maximum surface wind speeds (that are used to show the bi-dimensional 121 evolution of the surface wind speed structure), were shown to be consistent with the NOAA/Geophysical 122 Fluid Dynamic Laboratory (GFDL) hurricane model solutions and the H*WIND analyses (Powell et al., 123 1998) from the Hurricane Research Division (HRD) of the Atlantic Oceanographic and Meteorological 124\nLaboratory. The authors concluded that the surface wind speed modulus over ~40 km pixels can be 125 retrieved with a root mean square error of ~10kt (~5m/s). 126\nHeavy rain and ice clouds in the atmosphere have a potential impact on the L-band radio-127 brightness contrasts, and sea state effects remain rather uncertain and could also be sources of larger 128 amplitude local errors on the retrieved surface wind speed. These effects were not considered in the GMF 129 of Reul et al. (2012) . The effect of rain and the atmosphere on radio emission from the sea surface is 130 certainly weaker at L-band than it is at the higher frequencies . Atmospheric 131 contributions are dominated by absorption and emission due to oxygen at L-band and can be corrected 132 with negligible errors (Yueh et al., 2001 ) with respect the magnitude of the wind-induced surface radio-133 brightness contrasts. The absorption due to rain of upwelling radiations is also two order of magnitude 134 larger at C-band frequencies compared to those at L-band (see Fig2b in Reul et al., 2012) . Nevertheless, 135 breaking and streak generation are also strongly dependent on wave growth, wave-wave and wave-162 current interaction, water depth and the changing (turning) direction of winds. The physics of wave 163 breaking generation processes within hurricanes is complicated by the rapidly turning winds that generate 164 cross-seas and higher sea state in the forward right-hand quadrant of storms in the northern hemisphere 165 (and in the left-hand quadrant for the southern hemisphere). The velocity of forward movement of the 166 storm, the maximum wind velocity, and radius of maximum wind for a given storm as well as the duration 167 of wind action with respect group velocity of waves, are key parameters known to play an important role 168 in determining both the magnitude and spatial distribution of the waves generated within storm quadrants 169 (Young, 2003; MacAfee and Bowyer, 2005, Kudryavtsev et al., 2015) . The wave field is thus more 170 asymmetric than the corresponding wind field, mainly due to the \"extended fetch\" which exists to the 171 right (left in the Southern hemisphere) of a translating hurricane due to relative wind/wave motions. It 172 is worth noting that the effects of wave-current interaction on surface foam formation may also be 173 important for hurricanes in some areas, e.g. in the U.S., due to the strong influence of either the Gulf 174\nStream (Western Atlantic) or the Loop Current (Gulf of Mexico). Yet, the impact on the radio-brightness 175 contrast at L-band of wave and wave breaking development and variability in storm quadrants is still 176 poorly known. Thus, algorithms for wind speed retrieval from L-band microwave radiometry must be 177 developed that are sensitive to these effects using a statistically significant number of storm samples from 178 which a new GMF can be derived. 179\nIn this paper, we present results of a study conducted to extend the initial work of Reul et al. 180 (2012) and gain further insight into wind, rain, and sea state effects on L-band radio brightness contrasts. 181\nWe systematically produced L-band SMOS radio-contrasts and high wind speed retrievals and generated 182 a global database of SMOS intercepts with all TC events that developed over the global ocean during the 183 period January 2010 to April 2015. Data and processing are described in the first section. We then show 184 several examples of the SMOS radio-contrast signal and retrieved winds for various representative 185 storms. In part three, we analyse the statistical properties of the L-band brightness temperature contrasts 186 as function of storm sectors and storm intensity to illustrate the capability of L-band passive microwave 187 data to provide a metric for intensity change in TCs. We then validate SMOS retrieved winds based on 188 the first GMF derived by Reul et 2011). Data were first processed to provide a level 3 daily gridded SSS field at a spatial resolution of 238 0.25° × 0.25° for the complete year. Composite weekly products were then generated for each storm 239 using a 7-day running mean and a 0.5° spatial window. The SSS was further bi-linearly interpolated to 240 15 km resolution to evaluate the brightness contrast ΔTB induced by salinity and temperature changes 241 alone. Reul et al. (2012) estimated that SSS errors on the order of ∼0.5 pratical salinity scale (the accuracy 242 of weekly CATDS products in the tropics) will translate into maximum wind speed bias of ~1 m/s. 243\nNevertheless, large tropical river plumes (Amazon, Mississipi) can exhibit significant SSS variability on 244 time scales less than a week (eg. tidal effects, currents, sudden increase in the river discharge): using SSS 245 fields estimated from preceeding weekly data in such high variability areas may be an additional source 246 of local error on the retrieved wind speed. which was confirmed in the observations over hurricane Igor . In this paper we will 276 consider the half total power: 277\n(5) 279 280 and for clarity, we shall drop the overbar notation. Unless specified, ΔI will therefore always refer to the 281 incidence angle-averaged half-power quantity. Surface wind speed modulus is finally retrieved from ΔI 282 data using the bi-linear GMF proposed in Reul et al. 2012 , hereafter referred to as GMF1. 283"}, {"section_title": "Storm Tracks and Intensity 284", "text": "Tropical cyclone \"best track\" data (Jarvinen et al. 1984 visual inspection revealed discrepancy between the best tracks interpolated storm-center location, the 85 308\nGHz and the SMOS fields (e.g., cases when the centre is very easily detectable on SMOS data by visual 309 inspection but displaced from best track or 85 GHz's estimates). The bearing of the storm center main 310 motion at SMOS acquisition time was also estimated from the time interpolated 6-hourly best-track data. 311"}, {"section_title": "2.3", "text": "Surface wind speed products 312 SMOS retrieved winds are compared with a set of alternative surface wind speed datasets including 313\nNumerical Weather products and retrieved surface winds from either the SFMR operated aboard the 314 NOAA and Air Force aircrafts or H*WIND analyses (Powell et al., 1998) . Both data are available from 315 the Hurricane Research Division (HRD) of the Atlantic Oceanographic and Meteorological Laboratory. 316\nThe SFMR was specifically developed to measure hurricane-force ocean surface winds and is typically 317 mounted on aircraft that makes reconnaissance flights with radial passes through the center of TCs. The 318 SFMR measures the nadir brightness temperatures between 4.5 and 7.2 GHz and the data available are 319 processed with a 10-second running mean to derive surface wind speeds and rain rates using dedicated 320 To validate and re-analyse the SMOS GMF, we also used H*WIND two-dimensional surface wind 324 analysis products (Powell et al., 1998) . The H*WIND analysis uses a combination of all available surface 325 and near surface wind observations collected over a period of several hours from multiple platforms (i.e., 326 SFMR wind speeds, GPS dropwindsondes, tail Doppler radar, geostationary operational environmental 327 satellite (GOES) cloud track winds, surface ships and buoy data as well as satellite observations (such as 328\nQuikSCAT, WindSat and ASCAT), etc.). The analysis procedure adjusts each data set to a common 329 elevation and exposure and creates a 6 km resolution surface wind field for each TC in a \"storm-centric\" 330 moving coordinate system. The wind speed represents the one-minute sustained wind velocity at 10-m 331 height reference. These objectively analyzed wind products are used routinely as guidance for operational 332 TC forecast and advisory products, including the determination of wind radii (e.g., radius of maximum 333 wind and at 34, 50, and 64 kt winds) by hurricane forecasters at the National Hurricane Center and the 334 Central Pacific Hurricane Center. The H*WIND accuracy is highly dependent on the quality of the 335 dataset and data coverage used as input. Although it is imperfect, it is the best 2D surface truth currently 336 available. Note that these fields are only freely available now until 2013, post 2013 data will be made 337 available for non-commercial research purposes (M. Powell, pers. Comm.). 338\nPrior to making comparisons with SMOS data, all SFMR and H*WIND measurements are 339 adjusted for the time difference between SMOS acquisitions by shifting the movement of the storm centre 340 according to the time difference. This results in adjusted flight tracks such that SFMR and H*WIND 341 measurements have the same location with respect to the centre of the storm at the time of the SMOS 342 acquisition as they actually had when they were recorded. This adjustment does not consider any storm 343 rotation. The storm's movement is derived from the best track information from IBTrACS. We 344 considered all SFMR and H*WIND observations available within ±12 hours from SMOS data. The two 345 closest H*WIND wind fields in time before and after a SMOS overpass of a given TC available ±12 346 hours from SMOS were linearly interpolated to the SMOS acquisition time. To assess the performance 347 of SMOS winds, comparisons were performed with both SFMR and H*WIND products kept at their 348 original spatial resolution, respectively 3 and 6 km, but smoothed to match the SMOS average spatial 349 resolution by using a running spatial 2D Gaussian windows (Brinkman and Bodschwinna, 2003) with 350 standard deviation equal to 43 km. 351\nNote that Hurricane surface winds are strongly dependent on the averaging time attributed to the 352 wind observations, the roughness of the underlying surface, and height of the wind measurements above 353 the sea surface. The NHC best track maximum sustained surface wind is defined as the maximum one-354 minute wind observed at a height of 10 m. Here, all the other wind products are also referred to a 10 m 355 height. The H*WIND averaging time is also one minute, so that the SMOS retrieved wind speeds derived 356 using the GMF of Reul et al. (2012) are calibrated based on a one-minute averaging period. However, 357 the SMOS spatial resolution is much coarser and a better approach, more consistent with the spatial 358 resolution of SMOS, is to use the maximum 10-minute wind as used by most of world's operational 359 centers outside of the USA. Therefore, all wind speed value derived based on a 1 minute averaging period 360 were adjusted to a 10-minute standard: 10-minute averaged wind speed are ~7% smaller than 1-minute 361 averages (Harper et al., 2008) . 362\nThe performance of SMOS winds in storms with respect to numerical weather forecast fields from 363 ECMWF and NCEP operational models are assessed using ECMWF 10-m equivalent neutral wind data 364 that are also used as auxiliary information in the SMOS operational SSS Level 2 processor. Six-hourly 365 GFS NCEP wind speed products were also co-located in space and linearly interpolated in time with 366 SMOS acquisition and compared to paired SMOS/H*WIND data. 367"}, {"section_title": "Rain data 368", "text": "We use satellite rainfall rate estimates from the CMORPH products ( With regard to spatial resolution, although the precipitation estimates are available on a grid with a 387 spacing of 8 km (at the equator), the resolution of the individual satellite-derived estimates is coarser 388 than that -more on the order of 12 x 15 km. The finer \"resolution\" is obtained via interpolation. Similarly 389 to the wind speed products, we estimated the rain rate on the SMOS 15km resolution grid by averaging 390 the CMORPH data using a 2D Gaussian window of 43 km width. The two closest CMORPH fields in 391 time (before and after a SMOS overpass of a given storm) are linearly interpolated to the SMOS 392 acquisition time. 393 To estimate the 'average' statistical properties of ΔI and its relationship to storm intensity and storm 447 sector, each SMOS intercept with a storm was processed as follows: 448"}, {"section_title": "SMOS STORM Database", "text": "1) The storm center was determined at the time of SMOS acquisition by interpolating linearly in 449 space and time the storm track 6-hourly IBTracks data to the SMOS acquisition time, 450\nMicrowave 85 GHz data from SSMI15-16-17-18, TMI or AMSRE that were acquired within less 451 than ±1 hour from SMOS intercepts were then used to check the determination of the storm center 452 locations estimated from the best-track data. If 85 GHz images were available within less than 453 ±half an hour from SMOS, the location of the storm centre was determined using these data. 454\nOtherwise, the storm centre location was bi-linearly interpolated in space and time from the two 455 closest 85 GHz observations acquired just before and after SMOS acquisition. A visual check 456 was further performed to check consistency between SMOS-derived storm centre location, best-457 track location, and 85 GHz interpolated locations. In case of a significant mismatch, the centre 458 determined from the 85 GHz data was used by default. Fig. 3 shows an example for a SMOS 459 intercept with hurricane Jova on 10 October 2011 as it developed in the eastern Pacific into a 460\nCategory 3 storm before it landed in western Mexican coasts. SMOS intercepted the storm at 461 12:32 Z. The best-track linearly-interpolated storm centre location at that hour (Fig. 3, top left) "}, {"section_title": "482", "text": "For convenience, we arbitrarily choose to rotate all ΔI distributions to a \"northern-hemisphere\" common 483 coordinate system display geometry (see example for Jova in Fig. 3 , which was actually heading towards 484 the northeast at the SMOS acquisition time). Using the storm centre locations estimated at the SMOS 485 acquisition times all ΔI data were further re-gridded at 15 km spatial resolution on a storm-centric 486 coordinate system with west-east and north-south axes spanning a spatial domain of 500 km on each side 487 of the storm centre. The heading of the storm translation motion was then estimated from the best-track 488 interpolated data at the SMOS acquisition time and the ΔI fields were rotated to align all storm translation 489 directions to a common axis. Note that the fields were reflected around that axis (i.e. to flip the wind 490 fields in left/right direction) for the southern-hemisphere storms to account for the different veering wind 491 directions in both hemispheres. SMOS winds were not adjusted to account for the storm translation speed 492 but only rotated based on the motion direction. 493"}, {"section_title": "Statistical distributions of ΔI as function of storm intensity and sectors", "text": ""}, {"section_title": "495", "text": "We compute the 2D distributions of the mean and standard deviation of L-band ΔI as function of the 496 different Saffir-Simpson TC categories for all storms in our database and plot the result in Fig. 4 using 497 storm-centric coordinates (ie. all storms have been consistently rotated to point \"North Up\"). The mean 498 distributions of ΔI coherently increase with the increasing TC intensity. The radii within which the 499 brightest ΔI values are found for each category reduces as the storm intensity increases, consistent with 500 the reported evolution of the highest surface wind distribution in TCs (Holland, 1980 "}, {"section_title": "523", "text": "Note that the colour scale range is changing from top to bottom panels. 524 525 Fig. 5 highlights the storm quadrant and intensity dependencies of SMOS ΔI for all tropical 526 cyclones in our database. The mean brightness contrast is clearly seen to monotonically increase with 527 storm intensity within a ~200 km radius from the storm centre. The mean ΔI amplitude ranges from about 528 5 K for tropical storms up to ~24 K for the most intense category 5 cyclones. There is no evidence of ΔI 529 saturation and the brightness increases between TC categories by ~3-4 K. The step change from Category 530 4 to Category 5 is more significant (~8 K) but this result is not robust given that only 3 Category 5 events 531 were intercepted by SMOS. There is evidence of a right-hand-side asymmetry and the maxima of ΔI is 532 always found in the north-east and south-east quadrants. The typically calm inner-core wind structure is 533 difficult for SMOS to resolve when the radii of maximum wind is less than ~43 km (the mean spatial 534 resolution of the SMOS data) and is most noticeable for the intense wind conditions (category 4 and 535 above) where the radial structure of the TC is typically compressed. Given the varying SST conditions encountered for all the storms, in what follows, the SMOS ΔI will be 568 now expressed in terms of the storm wind-excess emissivity: 569\nΔe=ΔI/sst (6) 570 7. (a,c,e,g ) superimposed SMOS retrieved wind speed using the GMF of Reul et al (2012, color in blue. The retrieved wind speed from SMOS is shown in red using GMF1 and in magenta using GMF2. 597\nThe x-axis shows the time lag between SFMR acquisitions and SMOS ones. 598 599\nTo minimize the potential impact of structural evolution of the storm between SMOS and SFMR 600 acquisition times, we further selected only those data pairs with |Δt |<6 h to derive a new GMF. Biases 601 in SFMR wind data induced by high rain-rates were also corrected according to Klotz As can be seen, while rather close to the first bi-linear GMF estimate, the new fit based on SMOS and 615 SFMR wind speed co-located pairs is a nonlinear function of the wind speed. In particular, the new GMF 616\nshows that the storm-induced excess emissivity is almost wind-speed independent for winds below ~20 617 kt. In the intermediate wind speeds ranging from 20 to 50 kt, the new GMF lies below the old linear 618 relationship indicating an underestimation of the retrieved wind speed from SMOS data using the linear 619 empirical law or Reul et al (2012) . This is particularly evidenced in Fig 7h, which shows an 620 underestimated SMOS retrieved wind in that range using GMF1, further corrected using GMF2. Note 621 for this particular case that most of the differences between GMF1 and GMF2 is related to the use of 622 climatological SSS for GMF1 and SMOS SSS for GMF2. In the highest wind speed regime (>50 kt), the 623 new GMF function shows a systematically higher value than the linear approach. It is interesting to note 624 that the new GMF exhibits similar dependencies with wind speed when compared to the excess 625 emissivity vs. wind speed law deduced for the C-band SFMR data (Uhlhorn et al. 2007 ; Klotz and 626 . 627"}, {"section_title": "Systematic comparisons between SMOS and H*WIND 628", "text": "The SMOS-SFMR co-located dataset (Fig. 7) shows that the Reul et al (2012) Given the time-lag constraints in the SMOS-SFMR data co-location and data selection used when 635 building the GMF, inevitably only a small number of match-ups were available in the highest wind speed 636 regime with very little data above hurricane force (>64 kt). To increase our confidence in the statistical 637 reliability of the GMF and to increase the quantity of co-located pairs at the highest winds, we constructed 638 an extended database of SMOS Δe, retrieved SMOS surface wind speed (using Reul et al (2012) GMF 639 as a first guess) and H*WIND 2D surface wind speed fields. 30 cases were found for which either SMOS 640 data were available within < ±0.5 h from an H*WIND or when the two closest H*WIND wind fields in 641 time (before and after a SMOS overpass of a storm) was available within 6 h. In the latter case, an 642 interpolation in time of the two closest storm-centric H*WIND SWS fields was performed at the SMOS 643 time. 644\nFor illustration, Fig. 9 and 10 show two examples of SMOS/H*WIND comparisons. Fig. 9 shows the 645 results for Hurricane Leslie as it developed to a TC on 7 September 2012 at 22:19 Z. The RMS difference 646 between SMOS and H*WIND SWS fields is ~7 kt. As shown, the structure of both wind fields are very 647 consistent, with maximum winds found in the north-west quadrant at a radial distance of about 150 km 648 with the maximum wind radii at 34 and 50 kt matching closely between both products in the NW and SE 649 quadrants. Nevertheless, small residual biases are seen in the two other quadrants, with SMOS winds 650 lower than H*WIND and a smaller 34kt radius in the SW quadrant 651 652 653 654 669 670 671 SMOS winds are slightly higher than H*WIND in the NE quadrant at radial distances between 100 and 672 200 kms (Fig. 9 c,d ). Considering the co-located CMORPH data, the rain rate reached more than 20 673 mm/h at some locations in the highest wind speed band found in this quadrant corresponding to retrieved 674 SMOS winds slightly higher than H*WIND (Fig. 9 e, f) . 675\nThe second example (Fig 10) shows the case of Hurricane Katia as it reached a Category 2 intensity. 676\nHere again, the match between both SMOS and H*WIND wind speed fields is rather good in general 677 (RMS ~7.2 kt), with consistent estimates of the maximum wind radius and value (around 80 kt), and of 678 the 50 and 64 kt wind radii. However, SMOS retrieved winds at 34 kt exhibit a slightly smaller wind 679 radii than the H*WIND product. This is consistent with the behaviour expected from the bilinear GMF 680 according to SMOS/SFMR matchups. Contrary to the case of hurricane Leslie (Fig.9) , the intense rain 681 region (with rain rates >20 mm/h) is now associated with underestimated SMOS winds with respect 682 H*WIND. As the impact of precipitation is inconsistent it appears that this is not the principal process 683 responsible for the observed biases in SMOS winds versus H*WIND (see Fig. 9 and Fig. 10 e, f) . We use 30 2D fields of co-located SMOS ΔI and H*WIND (an alternative and spatially complete 694 'ground-truth' dataset) and re-analysed the SMOS wind GMF. Fig. 11 shows the Δe as function of 695 H*WIND 1-minute sustained winds that have been spatially averaged to 43 km corresponding to the 696 mean SMOS spatial resolution. In between 20 kt and ~50 kt, the GMF derived based on H*WIND fields 697 shows a very similar structural form to the GMF derived using only SFMR data: it is systematically found 698 lower at a given wind speed than the bi-linear GMF1 of Reul et al (2012) . This might be expected as 699 SFMR data are used as key input data to derive the H*WIND analyses. In the wind speed regime over 700 50 kt, the H*WIND derived GMF is very similar to the GMF of Reul et al (2012) "}, {"section_title": "706", "text": "As H*WIND and SFMR-based fits are very similar in the low to moderate wind speed range and, given 707 the fact that the H*WIND GMF includes the SFMR data and provides a much larger number of paired 708 data for the high wind regime, we use (Eq. 7) as the new reference GMF for retrieving surface winds 709 from SMOS L-band radio-brightness contrasts data. Hereafter, we referred to this new GMF as GMF2. 710"}, {"section_title": "Potential Impact of Rain 711", "text": "The previous GMFs were built assuming that there is no impact of rain and sea state on the L-band 712 contrasts. Using CMORPH co-located 2D observations, all data used to build up the H*WIND derived 713 GMF have been characterized in terms of rain rate. Fig. 12 (top) shows the bin-averaged Δe as function 714 of wind speed for rain free and rainy conditions. Unfortunately, data showing rain-free conditions are 715 only available up to a wind speed of 50 kt. For surface winds of >20 kt, the rain free Δe at a given wind 716 speed is systematically lower than the equivalent Δe measured in rainy-conditions. The differences in Δ 717 e between rainy and non-rainy conditions reach a maximum of ~0.01 at 50 kt, which for a typical SST of 718 28°C would translate into a 3 K bias in ΔI due to rain. ~75 kt, with all observations in rainy conditions lying close around the bi-linear GMF. This suggests that 735 precipitation is not directly responsible for the difference of emissivity between the rain-free and rainy 736 conditions but perhaps a problem with the classification of rain-free data. The departure observed in Fig.  737 12 at high winds (> 75 kt) and heavy rain conditions (>10mm/h) is likely to be an artefact due to the low 738 number of observations in these conditions although more data are required to draw a firm conclusion. 739\nSmall ice particles are known to exist between the eye wall and outer rain bands of TC. In addition, 740 graupel ice pellets are often collocated with the radius of maximum tangential wind (Houze et al., 1992) . 741\nHurricanes are usually glaciated everywhere above the −5°C vertical level and stratiform cloud areas are 742 dominated by snowflakes at these levels (Black and Hallett., 1986) . The variation of ice phase cloud 743 characteristics at the top of TC and the contribution of these clouds and ice hydrometeors to the L-band 744 emission might be a plausible source for the observed rain/rain-free differences in Δe. Nevertheless, to 745 the authors knowledge no suitable data characterizing the upper atmosphere in terms of ice-phase content 746 is available to estimate that effect. 747"}, {"section_title": "Validation of SMOS winds and relative accuracy with ECMWF and NCEP 748", "text": "The SMOS GMF given in Eq. "}, {"section_title": "784", "text": "As shown in Table- 1, the RMS and mean differences between H*WIND products and the three surface 785 wind speed products are very similar considering the full wind speed range between 0 and 100 kt. 786\nHowever, above ~64 kt, the SMOS wind speed accuracy outperforms NWP winds with rms and mean 787 differences between SMOS and H*WIND data of about 8.1 kt and 4.3 kt, respectively whereas both 788 NCEP and ECMWF products both saturate with increasing wind speed leading to significant biases and 789 root mean square differences greater than 20 kt in the high wind speed range when compared to 790 H*WIND. 791 We have shown that the 'average' L-band brightness temperature excess is a monotonically increasing 792 parameter with increasing storm intensity. The highest wind regions often extending over domains of, or 793 smaller than, 100 km, with very significant wind speed gradients found over small distances relative to 794 the SMOS spatial resolution, particularly in the eyewall region. Given the relatively low spatial resolution 795 of the SMOS instrument (~43 km) maximum sustained wind speeds, a key parameter in all 796 parameterization of hurricane wind field dynamics, are retrieved from SMOS but lacking small-scale 797 features (this was clearly seen when comparing SMOS wind retrievals with SFMR aircraft measurments). To assess the quality of the maximum wind speed inferred from SMOS products, we compared the 803 maximum wind derived from Eq. 7 computed for each of the 300 storms in the SMOS-STORM database 804 to the 6-hourly Best Track maximum wind interpolated to the SMOS acquisition time. The comparison 805 between both estimates is shown in Fig. 14 which shows that the maximum wind derived from SMOS 806 correlates well with the Best-track maximum sustained wind. The RMS difference is nevertheless higher 807 than it was found for all-wind speed comparisons, reaching ~14.5 kt. An underestimation of the 808 maximum wind is also systematically visible in the SMOS products above ~75 kt. The spatial-smoothing 809 effect of the satellite sampling, with a predominant impact in the very high wind and high gradient regions 810 is thought to be the cause of this underestimation. 811 intercepts have been carefully selected to provide the highest quality measurements available covering 816 the full range of storm intensities on the Saffir-Simpson Wind Scale. The storm-induced half-power 817 radio-brightness contrast, ΔI, was estimated for each SMOS intercept with storms and expressed in a 818 common storm-centric coordinate system. The 2D mean and standard deviation of the ΔI were further 819 evaluated for each storm intensity class of the Saffir-Simpson Wind Scale. The average distribution of Δ 820 I show that the mean brightness contrast amplitude coherently increases with increasing TC intensity. 821"}, {"section_title": "Conclusions and perspectives", "text": "The radii within which the brightest ΔI values are found for each TC category is found to diminish as 822 the storm intensity increases, consistent with the reported evolution of the highest surface wind 823 distribution in TC (Holland, 1980) . The mean brightness contrast is monotonically increasing with storm 824 intensities from about 5 K for tropical storms up to ~24 K for the most intense category 5 cyclones 825 without showing saturation above hurricane force (64 kt) illustrating the potential of the SMOS data for 826 better monitoring TC intensification. A remarkable feature of the mean ΔI fields is that the maxima of 827 ΔI are systematically found on the right-hand side quadrants of the storms. This is consistent with the 828 reported asymmetric structure of the wind and wave fields in TC conditions: the maximum wind speed 829 and sea surface height generally occur in the right-hand quadrants of storms (in the northern-hemisphere) 830 because of the relative wind and extend-fetch effects created by a translating storm. For category 1-5 831 TCs, the ΔI standard-deviation exhibits a quasi-annular distribution around the storm centre, with local 832 minima at the centre, consistent with the relatively calm eye of a TC. For storm intensities above and 833 including category 4 on the Saffir Simpson Wind Scale, the SMOS instrument is not able to resolve the 834 detailed structure of TC eye winds for those most intense storms that have a maximum wind radii below 835 the SMOS pixel size (~43 km). 836\nA revision of the bi-linear GMF proposed by Reul et al. (2012) has been derived using a much larger 837 ensemble of co-located SMOS, SMFR flight track data and analysed 2D H*Wind fields. We found that 838 the L-band radio-brightness contrast evolves quadratically with surface wind speed and we propose an 839 empirical parametric law relating ΔI and the 10 m height surface wind speed 10 . Major differences 840 with the GMF of Reul et al. (2012) are found in the low to moderate wind speed regimes. Use of the new 841 GMF will help reduce observed biases in the SMOS surface wind retrievals below 50 kt. 842\nUsing co-located rain rate estimates from CMORPH, we shown that the L-band radio-brightness 843 contrasts measured in TC rain-free conditions do not evolve similarly with wind speed compared to those 844 acquired during precipitation events. Differences as large as 3K translate into maximum surface wind 845 speed errors of ~20 kt below hurricane force (~64 kt) and ~10 kt above. Larger errors are found in the 846 lowest wind speed regime because of the smaller sensitivity of the ΔI function to wind speed below 847 hurricane force. However, further classification of these data as function of increasing rain rate for fixed 848\nwind speed values did not reveal any significant dependencies with increasing rain rate. This seems to 849 indicate that other geophysical contributions are responsible for the observed differences in ΔI during 850 rain-free and rainy conditions. The variation of ice phase hydrometeor characteristics at the top of 851 cyclones and the associated varying contributions of clouds to the L-band emission might be a plausible 852 source. 853 854 Fig. 15 . Synoptic structure of the surface wind field in Tropical Cyclones as retrieved from SMOS data 855 as function of the Saffir-Simpson High Wind intensity scale. Average 2D wind fields from SMOS are 856 contoured at levels of 34 (thick dark blue), 44 (thin blue), 50 (thick cyan), 64 (thick red), 80 (gray) and 857 94 (thick chesnut) kt. The thick black arrow is indicating the averaged storm propagation direction. 858 859 860\nNeglecting the potential rain/ice impacts, we compared SMOS, ECMWF and NCEP winds to a large 861 ensemble of H*WIND 2D fields spatially averaged at the SMOS ~43 km nominal spatial resolution. 862\nUsing the GMF of Reul et al. (2012) , results showed that the surface wind speed in TCs can be retrieved 863 from SMOS data with an RMS error on the order of 8-9 kt up to 100 kt. Better performance is expected 864 with a new quadratic GMF. SMOS wind product performances when compared to H*WIND 'ground-865 truth\" data in the hurricane wind speed range (above 64 kt) are found to be a factor 3 to 4 better than the 866 those from the NWP products: NWP fields significantly underestimating the surface wind speed in 867 extreme conditions. The maximum wind speed estimated from SMOS was shown to be consistent with 868 best-track wind analysis estimates with and RMS error of ~14 kts. This degraded accuracy for the wind 869 maxima is thought to be caused by 1) the spatial-smoothing effect of the SMOS instrument sampling in 870 the high-wind gradient zones of the eyewalls and 2) a potentially higher effect of cloud ice and cloud on 871 the L-band emissivity in these regions. 872\nApplying the new quadratic GMF function to the average radio-brightness contrasts estimated as 873 function of storm intensities, we are now in a position to provide a synoptic view of the surface wind 874 field observed by an L-band passive sensor in tropical cyclones. This allows us to study TC structural 875 evolution as function of increasing TC intensities as shown in Fig 15. As the storm intensity increases, 876 the wind speed above a certain threshold spreads within a quasi-circular domain of almost constant radii: 877 ~200 km for winds above 34 kt, 120 km for winds above 50 kt and ~75 km for winds above 64 kts. 878\nFollowing the approach of Chavas et al., (2015) who used historical datasets of QuickSCAT satellite 879 scatterometer observations to analyse the wind structures in the outer region of tropical cyclones at large 880 radii, the SMOS synoptic wind structure could be used to assess the quality of available Hurricane wind 881 models (e.g. Holland, 1980) "}]