[{"section_title": "Introduction", "text": "At the beginning of 2020 the world faced an outbreak of COVID-19 -severe acute respiratory syndrome caused by SARS-CoV-2 coronavirus. [1, 2] . More than 20 million people were infected during the first 8 months of the pandemic. To slow down the spread of the disease WHO put significant effort into supporting scientific research and the development of diagnostics, vaccines and medications against COVID-19 [3] , multiple platforms were established to monitor real time distribution of the disease all over the world [4] .\nPhylogenetic analysis has attributed SARS-CoV-2 to the genus of Betacoronavirus in the Coronaviridae family [5, 6] . Despite the name and the genetical similarity, SARS-CoV-2 is not a direct descendant of previously described SARS-CoV virus. Rather it has independently originated during the evolution [7] . Growing number of full genome sequences of SARS-CoV-2 have revealed multiple mutations and deletions in coding and non-coding regions of the virus [8] . However, SARS-CoV-2 has a relatively low mutation rate due to high accuracy of the enzymes involved in virus replication [9] .\nThe first step of coronavirus entry into the cell is its interaction with the surface receptors of the host. These receptors include angiotensin-converting enzyme 2 (ACE2) for SARS-CoV and SARS-CoV-2 [10] [11] [12] and CD26 for MERS-CoV [13] . Spike (S) glycoprotein is responsible for the interaction of SARS-CoV-2 with ACE2. This protein contains a receptor binding domain (RBD) that interacts with the N-terminal peptidase domain of ACE2 with Kd of 14.7 nM [14] [15] [16] . Cryogenic electron microscopy has revealed a molecular structure of АСЕ2*RBD protein complex [14, 15] . Due to its' important role and a unique structure, RBD is considered as one of the main targets for the development of neutralizing antibodies against SARS-CoV-2.\nIn addition to the mentioned above, S protein of SARS-CoV-2 contains peptide sequences that may bind to MHC and serve as an effective epitope for the generation of antibodies [17] . It was previously shown that S and N proteins of SARS-CoV induce prominent and prolonged T-cell immune 4 responses [18] , which is consistent with recent observation for SARS-CoV-2 [19] . With its currently evolving role S protein might serve as a promising antigen for the development of vaccines against SARS-CoV-2 [20] . To this date, more than 20 vaccines based on the S protein are undergoing clinical trials [21] .\nBesides the vaccines, development of diagnostics is critically important to stop the spreading of COVID-19. Majority of tests for SARS-CoV-2 are being performed using reverse transcription polymerase chain reaction (PCR) on swabs from the nasopharynx or upper respiratory tract.\nAdditionally, computed tomography of the chest is used to confirm the diagnosis, but its results are nonspecific and can often coincide with other diseases, therefore the diagnostic value of this method is limited [22, 23] . Serological tests of the immune response of patients are also important as presence of specific antibodies allows to determine the prevalence of COVID-19 in the society and identify people who can potentially be immune to the infection. It was also proposed to use an immunoassay to evaluate the response to the vaccination [24, 25] . Although the presence of neutralizing antibodies can only be confirmed by specific tests using virus-like particles [26] , high titers of IgG detected by immunoassay have been shown to positively correlate with the amount of neutralizing antibodies. To avoid the emergence of virus resistance to the antibodies, administration of cocktails containing multiple therapeutic antibodies was proposed as a treatment strategy [27, 28] .\nCurrently the manufacturing of antibodies shares one of the leading places on the marked together with the production of vaccines [29] . The number of mAbs based drugs approved for the clinic is growing every year. In addition to human or humanized neutralizing antibodies proposed as a \"magic bullet\" for the treatment of COVID-19 [30] , there is now a high variety of antibodies produced in different species against all proteins of the SARS-CoV-2. These antibodies cannot be directly used to treat patients with COVID-19, but they serve as an important tool for both basic scientific research and for the development of vaccines and diagnostic kits for SARS-CoV-2. Unfortunately, none of these 5 antibodies were developed in the Russian Federation. However, during the pandemic it is crucial to have a local source of the antibodies suitable for researches and diagnostics of COVID-19.\nIn the present study we describe the development of hybridoma cells that produces mAbs against RBD of SARS-CoV-2 S protein. We also performed extensive characterization of the obtained mAbs and describe their usage for various applications."}, {"section_title": "Plasmid Construction", "text": "The DNA fragment encoding RBD of SARS-CoV2 was amplified by PCR using primers S2_for (AAA AGC TAG CAA TGG CAC GAT AAC TGA CGC) and S2_rev (AAT TAA GCT TAA ACA CAT TTG ACC CAG TTG AGT A) from pTwist-EF1a-nCoV-2019-S-2xStrep plasmid kindly provided by Dr. Nevan J. Krogan [31] . Resulting DNA fragment was cloned into NheI/HindIII sites of pET28a+ plasmid (Novagen) to generate pET28-S plasmid. The absence of unwanted mutations in the inserts and vector-insert boundaries was verified by sequencing."}, {"section_title": "Recombinant protein expression and purification", "text": "To produce RBD fragment of S protein in bacterial cells BL21 (DE3) Codone+ RIL E. coli cells (Agilent) were transformed with pET28-S plasmid. Bacteria were incubated at 37 o C on shaker until OD600 reached 0.7. Next, IPTG was added to a final concentration 1mM and bacteria were incubated for an additional 4 hours at 37 o C. 200 ml media with bacteria were centrifuged for 15 min, 5000 g at "}, {"section_title": "Cell Culture", "text": "HEK293 and HT1080 cells were grown in Dulbecco's modified Eagle's medium (DMEM) supplemented with 10% (v/v) fetal bovine serum (FBS), 2mM L-glutamine, 1mM Na-pyruvate and penicillin-streptomycin mixture (100μg/ml). Transfection was performed with Lipofectamine LTX reagent (Thermo Fisher) according to the manufacturer's protocol. Transfected cells were stained or injected into mice 48 hours after transfection. X63 myeloma and hybridoma cells were grown in DMEM/F12 medium supplemented with 15% (v/v) FBS, GlutaMAX (Thermo Fisher), 1mM Napyruvate and penicillin-streptomycin mixture (100μg/ml). HAT or HT supplements (Sigma) were added at different time points after fusion as described previously [32] . "}, {"section_title": "Production of ascites", "text": "Ascites were prepared to obtain large quantities of mAbs [32] . Briefly, mice were intraperitoneally injected with 200μl of FIA. Five days later, mice were intraperitoneally injected with 2.5*10 6 of hybridoma cells in 150μl of PBS. After 12 days, mice were sacrificed and ascitic fluid was harvested from the intraperitoneal cavity and centrifuged at 20 000g at 4 °C for 15 min."}, {"section_title": "Enzyme-linked immunosorbent assay", "text": "Enzyme-linked immunosorbent assay (ELISA) was performed as described previously [33] . Briefly, 0.5 μg of RBD isolated from E. coli; RBD isolated from or HEK293 cells or 0.5 μg of a control protein isolated from E. coli were immobilized on wells of 96 well EIA plate (Corning). After blocking with 1% BSA in TBST (20 mM Tris pH 7.6, 150 mM NaCl, 0.1% Tween20) wells were incubated with culture medium from hybridoma cells diluted 1:1 in TBST; mouse serum diluted 1:700 in TBST; or ascitic fluid diluted in TBST. After washing with TBST wells were incubated with HRP-conjugated anti-mouse secondary antibodies (Thermo Fisher) (1:10000 dilution in TBST) and developed with 1-\nStep Ultra TMB-ELISA Substrate Solution (Thermo Fisher) according to the manufacturer's protocol."}, {"section_title": "Immunoblotting", "text": "Immunoblotting (WB) was performed as described previously [34] . Briefly, cells were lysed in RIPA buffer (150 mM NaCl, 1% NP40, 0.5% Na-deoxycholate, 0.1% SDS, 50 mM Tris pH 8.0, Protease inhibitor cocktail (Sigma)) on ice for 30 min and then centrifuged at 18 000g, 4 o C for 10 min.\nSupernatant was used for SDS-PAGE. Alternatively, cells were lysed by boiling at 100°C for 10 minutes in 0.5% SDS and subsequently used for deglycosylation and SDS-PAGE. After electrophoreses proteins were transferred to PVDF membrane and incubated overnight with culture medium from hybridoma cells diluted 1:1 in TBST. After washing membrane was incubated with HRP-conjugated anti-mouse secondary antibodies (Thermo Fisher) (1:4000 dilution in TBST with 5% 8 nonfat dry milk). Membranes were developed with SuperSignal West Pico PLUS chemiluminescent substrate (Thermo Fisher) and analyzed on ImageQuant LAS 500 imager (GE Healthcare)."}, {"section_title": "Deglycosylation", "text": "Deglycosylation of S protein from the lysate of HEK293 cells transfected with pTwist-EF1a-nCoV-2019-S-2xStrep plasmid was performed as described previously [35] using PNGase F (New England Biolabs)."}, {"section_title": "Immunofluorescence microscopy", "text": "HT1080 cells were plated in wells of Lab-Tek II chamber and co-transfected with pTwist-EF1a-nCoV-2019-S-2xStrep and pTagGFP2-C (Evrogen) plasmids. Two days after transfection cells were washed with phosphate buffered saline (PBS) and fixed with 4% PFA in PBS for 15 min at room temperature.\nCells were washed 2 times with PBS and incubated with culture medium from hybridoma cells diluted 1:1 in PBS or with mouse serum diluted 1:700 in PBS. After 5 washes with PBS cells were incubated with AlexaFluor555-conjugated anti-mouse secondary antibodies (Thermo Fisher) (1:500 dilution in PBS) and subsequently stained with DAPI. Images were captured with a DIAPHOT 300 fluorescent microscope (Nikon)."}, {"section_title": "Generation of SARS-CoV2 pseudovirus particles", "text": "HEK293FT cells in T75 flask were cotransfected with 6 μg of pTwist-EF1a-nCoV-2019-S-2xStrep plasmid, 9 μg of psPAX2 plasmid and 12 μg of pCDH-GFP-IRES-Puro plasmid [36] . Next day culture media was changes and 72 hours later media with viruses was collected and filtered through 0.4 μm filter. Pseudoviruses were concentrated by ultracentrifugation as described previously [37] . PCR was performed on LightCycler 96 Instrument (Roche) as described previously [36] ."}, {"section_title": "Antibody sequencing", "text": "Sequencing of mRNAs encoding heavy and light chains of antibodies was performed using 5′ SMART RACE method as described previously [38] with slight modifications. First strand of cDNA was "}, {"section_title": "Mice immunization with S protein of SARS-CoV2.", "text": "Animal immunization is the first step in the development of mouse mAbs. There are multiple proposed protocols to create antibodies against different types of proteins and each of them has certain benefits and drawbacks. Thus, immunization with DNA vectors or cells overexpressing target protein on their surface allows production of antibodies against native protein which has correct folding and proper post-translational modifications [39, 40] . On the other hand, immunization with synthetic peptides or recombinant protein fragments enables the development of antibodies specific for a certain part of amino acid sequence without contamination of antibodies raised against oligosaccharides decorating the protein [41] . In the current study, we applied combined protocol and first immunized animals with recombinant RBD fragment purified from E. coli and next injected mice with cells overexpressing full length S protein.\nOn the first step, we expressed and isolated RBD of S protein from E. coli under denaturing conditions (Fig. 1A) . Despite multiple attempts, we were unable to design a refolding protocol that could allow us to obtain a soluble protein in a buffer suitable for immunization. Therefore Interestingly, FIA allowed to obtain a significantly higher titer of specific antibodies as opposed to FCA (Fig. 1C) . This result indicates that insoluble RBD is highly immunogenic and does not require any stimulating additives for the development of immune response. Similar data were obtained previously during animal immunization with the surface protein of the Zika virus [41] .\nNext, Immunofluorescence staining (IF) of cells overexpressing full length S protein with mice serum demonstrated that antibodies raised against insoluble RBD could detect native S protein (Fig.   1D) . Therefore, both insoluble RBD and full length S protein expressed on the surface of mammalian cells have common epitopes indicating that these proteins could be used for the production and selection of antibodies against SARS-CoV2. 44 days after the first immunization splenocytes were purified from the mice and subsequently fused with X63 myeloma cells. After the fusion cells were seeded on 20 96-wells plates and 3 weeks later 120 hybridoma monoclones were obtained. mAbs produced by these clones were tested by enzyme-linked immunosorbent assay (ELISA) against RBD purified from HEK293 cells ( Fig. 2A) . Primary screening 11 with the protein that was purified from the different sources (compared to the protein used for immunization) allowed us to exclude clones that produced antibodies against various contaminants that inevitably present in the samples used for immunization. It is important to note that RBD expressed in HEK293 cells presumably has glycosylation pattern which is similar to that of native S protein and therefore mAbs interacting with RBD from HEK293 most likely could interact with full length S."}, {"section_title": "Selection of hybridoma cells secreting mAbs against S protein of SARS-CoV2.", "text": "Total of fourteen hybridomas that demonstrated the strongest immunoreactivity against RBD were chosen for further analysis. We performed immunoblotting (WB) with the culture medium from our clones to detect S protein in the lysates of human cells that were transfected with plasmids encoding full length S protein or GFP as a control. Representative WBs are shown on figure 2B . Interestingly, two clones which had highest immunoreactivity in ELISA experiment failed to detect S protein on WB. Therefore, mAbs produced by these cells are probably nonspecific. Another important observation is that most of the tested mAbs were able to detect endogenous human protein with molecular weight of approximately 60 kDa. It is possible that this protein may have a common epitope with RBD of S protein from SARS-CoV2."}, {"section_title": "Establishment of monoclones producing antibodies against S protein of SARS-CoV2.", "text": "It is well known that hybridoma cells are characterized by the high degree of genetical instability during the first passages. Thus, descendants of a single hybridoma cell will most likely produce different antibodies at early time points after fusion [42] . Therefore, we chose hybridoma #11 which showed highest immunoreactivity against full length S protein (Fig. 2B) and subcloned these cells to obtain true monoclones. Culture media from 17 subclones of hybridoma #11 were tested by ELISA against RBD purified from E. coli, RBD purified from HEK293, and control protein purified from E. coli (Fig. 3A) .\nBased on our results, we picked 3 subclones for further analysis. Subsequent WB analysis demonstrated that all monoclones produce mAbs with higher specificity compared to the original hybridoma #11 (Fig. 3B) . It is interesting to note that mAbs from monoclone #11/13 which showed highest signal against RBD purified from E. coli but not against RBD purified from HEK293 (Fig.   3A) were only able to detect endogenous 60 kDa human protein and showed weak binding to full length S protein. Therefore, it is possible that recombinant insoluble RBD has high epitope similarity to the undetermined endogenous protein."}, {"section_title": "Characterization of mAbs against S protein of SARS-CoV2.", "text": "Based on our results (Fig. 3) we chose mAbs produced by monoclone #11/9 for further characterization. First, we used immunofluorescence staining to test if these mAbs were able to bind to native nondenatured S protein. Images on figure 4A shows that mAbs #11/9 specifically stain human cells that overexpress S protein and have little or no binding to the neighboring nontransfected cells. Therefore, mAbs #11/9 were able to detect RBD fragment in ELISA experiment; full length denatured S protein in WB; and full length native S protein on a cell surface as demonstrated by IF microscopy.\nIt was previously shown that RBD undergoes extensive glycosylation in human cells [43] . Therefore, we aimed to test if glycosylation affects binding of mAbs #11/9 to the S protein. To this end, we treated lysate of cells overexpressing S protein with deglycosylating enzyme PNGase F. Figure 4B demonstrates that deglycosylation decreases molecular weight of S protein by at least 30 kDa, however it has no effect on the intensity of staining with mAbs #11/9. Thus, it is reasonable to conclude that the region of S protein that interacts with mAbs #11/9 is not masked by glycoside groups of the protein.\nRBD plays the key role in the virus infection by interacting with the surface protein ACE2."}, {"section_title": "Hence antibodies against RBD can effectively block infection of human cells with SARS-CoV2 [26].", "text": "To test the effect of mAbs #11/9 on the infection rate, we obtained SARS-CoV2 pseudovirus particles that encode GFP. We used these particles to transduce HT1080 cells which were previously shown to be highly susceptible for the infection with SARS-CoV [44] . Unfortunately, we were unable to reach more than 5% transduction efficiency. Therefore, to quantify the effect of mAbs #11/9 on the infection 13 rate, we determined the level of DNA encoding GFP that was incorporated into the genome of HT1080 cells after the transduction with pseudoviruses. Our results demonstrate that the presence of mAbs #11/9 decreases the infection rate of SARS-CoV2 pseudovirus particles by at least two folds (Fig. 4C) .\nFinally, we aimed to produce mAbs #11/9 in higher quantities and test how these mAbs will recognize S protein when used in the different concentrations. For this reason, we injected two mice with corresponding hybridoma cells and 12 days later both animals formed ascites. In total 6 ml of ascitic fluid was collected. We used this ascites for serial dilution ELISA with RBD purified from E.\ncoli. According to our data, mAbs #11/9 from ascites were able to detect recombinant RBD but not a control protein in as high as 1:1000 000 dilution (Fig. 4D) , indicating an efficient binding of the antibodies to the antigen."}, {"section_title": "Identification of amino acid sequences of mAbs #11/9. During last few decades genetically modified", "text": "antibodies (humanized antibodies, single-domain antibody and etc.) were proven to be highly effective for various therapeutic and diagnostic applications [45] . One of the techniques for the production of such antibodies is based on the cloning of the previously identified variable domain sequences from mAbs into the artificially designed vectors encoding constant regions of the antibodies. Therefore, we aimed to determine the amino acid sequence of mAbs #11/9 which it responsible for the binding to S protein. For this reason, we amplified cDNA encoding heavy and light chains of mAbs by 5′ SMART RACE method. Using primers specific to k or λ chains we demonstrated that mAbs #11/9 contains only k light chain (Fig. 5A) . Sequencing of PCR products revealed the nucleotide and amino acid sequence of variable domains of mAbs #11/9 (Fig. 5B) . Bioinformatic analysis showed that both light and heavy chains do not contain in frame stop codons, have the correct position of the conserved amino acids and that the corresponding nucleotide sequences have not been published previously. Therefore, the obtained sequences most likely represent viable antibodies originating from murine splenocytes 14 but not abortive rearrangement products which theoretically could appear from X63 myeloma cells that were used for fusion."}, {"section_title": "Discussion", "text": "In this study we describe the development of mAbs against RBD fragment of SARS-CoV2 S protein. Both components can be easily obtained using standard well established methods. Therefore, we believe that the protocol applied in this study might be useful for the rapid development of mAbs against viral proteins. It became clear during the pandemic of COVID19 that such necessity may indeed arise in the future.\nAlthough the aim of this study was to create mAbs to S protein, we have also obtained a set of data that might be useful for the development of the vaccines against COVID19. Thus, we demonstrated that two injections of RBD mixed with FIA might be sufficient for the emerging of antibodies that can target full length native S protein. On the other hand, it might be worth to note that most of the mAbs that were established during this study could also bind to endogenous protein from human cells. Therefore, further studies are needed to investigate possible cross reactivity of antibodies that arise against SARS-CoV2 S protein. 15 Another interesting observation could be made during comparison of WBs on figures 3B and 4B. Latter one has much stronger band that corresponds to S protein. Same cells were used for both WBs, however for figures 4B we performed cell lysis by boiling in SDS solution, while for WB on figures 3B cells were lysed on ice in RIPA buffer. Therefore, the discrepancy in WBs might be attributed to the fact that S protein is tightly anchored to the cell membrane and therefore harsh conditions are required for its' efficient extraction, while a standard lysis protocol leaves most of S protein in the pellet that contains insoluble cell fragments.\nFinally, it is important to note, that for rigorous characterization of the mAbs obtained in this study further experiments are needed. Thus, here we only used culture medium from hybridoma cells or ascitic fluid in which the exact concentration of mAbs was not determined. If the mAbs developed here prove to be useful, it will be important to repeat some of the experiments with purified antibodies taken at various concentrations. This will allow to determine the optimal concentration of mAbs for each application and to calculate the Kd of antibody-antigen binding. Also it will be interesting to repeat experiment with inhibition of cell infection using different experimental models and cell lines.\nHowever, we believe that the most useful result of the current study is, firstly, the hybridoma cells that are able to produce mAbs against SARS-CoV2 in any quantity needed and, secondly, the amino acid sequence of mAbs against RBD. Knowledge of these sequence might be useful for the development of the cocktails of neutralizing antibodies against COVID19.\nIn summary, we developed novel mAbs that might serve as an important tool for the scientific research of SARS-CoV2 and also could help in the establishing of diagnostic and treatment methods for COVID-19 patients. Significant advantage of these mAbs is the presence of corresponding hybridoma cells which could produce these antibodies in nearly any quantity with comparatively little costs. "}]