[{"section_title": "Abstract", "text": "Background: Even minor abnormalities of early child development may have dramatic long term consequences. Accurate prevalence rates for a range of developmental impairments have been difficult to establish. Since related studies have used different methodological approaches, direct comparisons of the prevalence of developmental delays are difficult. The understanding of the key factors affecting child development, especially in preschool aged children remains limited. We used data from school entry examinations in Bavaria to measure the prevalence of developmental impairments in pre-school children beginning primary school in 1997-2009. "}, {"section_title": "Background", "text": "Despite exposure to a variety of risk factors, most preschool children do not show delays in physical, mental and emotional development [1, 2] . Accurate prevalence rates for a range of developmental impairments have been difficult to establish and comparisons across studies are hampered by the use of different methodologies. However, there is some evidence that the prevalence of child developmental delays has increased over recent years [3] . Developmental deficits at the time of school enrolment were also linked to a later success in school. For example Duncan et al. [4] demonstrated in a metaanalysis of six studies that the levels of development at the school entry in math, reading and attention skills were the strongest predictors of later success in school. Identifying developmental delays prior to school entry and providing appropriate interventions can likely help improve school outcomes.\nIn German speaking countries, the term \"developmental delay\" has a broad meaning [5, 6] . In contrast, experts in English speaking countries tended to focus mainly on motor and cognitive deficits when assessing developmental delays, while disorders of speech, emotion and psychological development were often not included or considered [7] [8] [9] . Furthermore, even within Germany developmental disorders were generally not classified consistently, and there are large variations among the studies that have been published to date [10] [11] [12] [13] [14] [15] [16] [17] [18] [19] [20] .\nIn 2008, our group published data on rates of childhood impairments in consecutive cohorts of Bavarian children entering school from 1997 to 2005 [21] . The primary aim of the previous analysis was to describe and compare prevalences of disorders of development over time. In the current analysis, we use data from thirteen years (1997) (1998) (1999) (2000) (2001) (2002) (2003) (2004) (2005) (2006) (2007) (2008) (2009) ) and extend our previous findings by analysing additional factors influencing development."}, {"section_title": "Methods", "text": "Before entering primary school, all children in the federal state of Bavaria in Germany are examined by the local Child and Youth Health Services in the so-called school-enrolment-examination [22, 23] . The data for all children entering school in the District of DingolfingLandau in Bavaria has been collected for the years 1997-2009. The assessment consisted of a comprehensive physical, psychological and behavioural assessment that has been developed by the Public Health Service of Bavaria. The examination was designed to provide information to the department of education for the purpose of facilitating changes in education policy and to allow early intervention for children at risk [24] . The assessment was based on a modified manual established in 1997 by the Working Group \"School and Youth Health Care in Public Health Service\" [25] . Four areas with twelve associated subareas of individual delays were defined ( Table 1) . The inability to pass a specific test was classified as a developmental delay.\nDiagnosis and documentation of delays forming base for the current study was conducted by the investigation team of School Health Services in the District of Dingolfing-Landau. During the whole study period this team remained unchanged. The use of routinely collected and anonymised data for the current analysis was reviewed by the ethic committee of the University of Bremen and exemption was granted."}, {"section_title": "Statistical analysis", "text": "We used the software package SPSS 17.0 to calculate the prevalence of developmental delays. Using uni-and multivariable logistic regression models, crude and adjusted associations between developmental delays and selected factors were determined. To assess the influence of age, three age groups (up to 5.49 years vs. between 5.50 to 6.5 years vs. 6.51 years and older) were defined. Sex, nationality and having siblings (any versus no) were entered as binary variables in the models."}, {"section_title": "Results", "text": ""}, {"section_title": "Study population", "text": "During the 13 years of observation period, 13,279 preschool children were examined. For 97 of them, the data was incomplete, so the final study sample contained 13,182 children. The median age was 5.93 years (standard deviation (SD) +/−0.39) and there were 51.7% boys and 48.3% girls. The majority of children had German nationality (88.7%) and most had at least one sibling (79.8%)."}, {"section_title": "Prevalence of developmental impairments", "text": "We found the highest prevalence of impairment in the area of pronunciation (13.8%), followed by fine motor impairments (12.2%), and impairments of memory and concentration (11.3%) ( Table 2 ). In contrast, very low rates of impairments existed for rhythm of speech (3.1%) and abstraction (3.2%). The percentages of children with developmental delays for the remaining seven subareas of delays were between 4.0% (for calculation) and 9.7% (for grapho-motor coordination).\nYounger children (<5.5 years) demonstrated the highest rates of fine motor impairments (21.0%), compared to 11.1% and 7.8% for the intermediate (5.5-6.5 years) and older age groups (>6.5 years) respectively. For most impairments, increasing age reduced rates of delays, with the exception of visual perception, abstraction, rhythm of speech and grammar for which older children had higher rates of development delays.\nBoys had significantly higher rates of impairments in all subareas of development. Some differences were found between children of German nationality and those with a non-German nationality: children with migration background had higher rates of impairment in nearly all areas of development, except for pronunciation and rhythm of speech. We also found differences between children with and without siblings. Children with no siblings did better in the areas of motor functioning and pronunciation, but worse in psychosocial development ( Table 2 ).\nFactors associated with the presence of developmental delays (uni-and multivariable analysis)\nIn comparison to the reference group of the youngest children, the risk was reduced by 22% and 68% for age groups 5.50-6.50 years and 6.51 years or older in subareas of fine motor coordination, grapho-motor coordination, grammar, memory and concentration, arithmetic and psychosocial development (Table 3 ). This agespecific effect increased to a maximum of 73% for the subarea of fine motor coordination in adjusted model (Table 4) .\nWith the lowest risk increase of 42% for psychosocial development and the highest risk increase of 222% for fine motor coordination, male gender was a strongest risk factor among those analysed for all subareas of delays in individual development (Table 3) . With a maximum increase of risk in the subarea of fine motor coordination (45%) and grapho-motor coordination (16%) the risk increased even further in multivariable regression analysis. Only for grammar, there was a decreased risk of impairment found in boys ( Table 4 ).\nThe influence of the non-German nationality was strong, with a maximum risk increase of 178% for the subarea of grammar and 173% for psychosocial development. Although children with non-German nationality had a reduced risk of disorders for the rhythm of speech (a 35% protection effect) and pronunciation (32%), in all other 10 subareas their risk was increased (Table 3) . Only minimal differences were seen between crude and adjusted associations in all subareas of development delays for the influence of nationality (Table 4) .\nThe presence or absence of siblings had no important influence on the studied developmental impairments. Some weak positive and negative effects were identified, but these did not reach statistical significance. The one exception was a the increased risk for disorders of pronunciation for children with siblings (OR 1.31, 1.14-1.50)."}, {"section_title": "Discussion", "text": "In international comparison, school entrance examinations differ in their form and implementation from country to country. Because of methodical differences, a direct comparison of impairments reported in different studies is difficult. Previous research has tended to focus on only one or two areas of delays rather than conducting a complete assessment of multiple dimensions [7] [8] [9] [10] [11] [12] [13] [14] [15] [16] [17] [18] [19] [20] [26] [27] [28] [29] [30] [31] . In this respect, our study provides a more comprehensive perspective."}, {"section_title": "Strengths and limitations of the study", "text": "The major strength of this study is the large, locally representative sample from a clearly defined geographical area. Since examinations used for assessment of developmental delays were mandatory before school enrolment, the selection bias was minimised. Furthermore, the assessment of developmental delays was conducted by a single team using standardised methods, preventing inter-observer variation. However, there are also several limitations. Data from the studied population might not be representative for the whole Germany -in fact one can expect differences based on variation in social status and local ethnicity mix. Furthermore, we were not able to assess the parental socio-economic status, which is potentially an important confounder of childhood development. Also, we were not able to study the consequences of the observed delays for the long term development. This should be subject of additional studies in the future."}, {"section_title": "Prevalence of development delays", "text": "In 2003, a taxonomy and assessment protocol for developmental delays was published by American medical specialists [8] . Based on this classification of \"global development delays\", there were the domains of \"gross/fine motor\", \"speech/language\", \"cognition\", \"social/personal\" and \"activities of daily living\" [7, 30, 31] . The nomenclature in our study was based on the first four \"domains\", but used twelve \"subdomains\" of development following the local German conventions.\nIn our study population, approximately every 16 th child showed impairments in \"gross motor skills\", every 8 th child in \"fine motor coordination\" and slightly less than every 10 th child in \"grapho-motor coordination\". The rates of delays observed in our study for gross motor coordination were lower and for \"fine and grapho-motor coordination\" were higher than the rates for the whole of Bavaria. For comparison, 84.7% of 129,597 preschool children in Bavaria in [2004] [2005] were able to stand on one leg (a test for gross motor coordination) and 90.8% were able to make a regular hand-coordination-test (a test for fine-and graphomotor development) [32] . Similar prevalences were found in health reports from Baden-Württemberg (in 1998: 6.5% for gross motor coordination, 4.5% for fine body coordination and 7.5% for grapho-motor coordination) [16] and from Hesse (disorders of \"coordination\" for the years 1998-2005 on average around 8.5%) [13] . It is interesting that according to the results of the Early Childhood Longitudinal Study Birth Cohort (ECLS-B), in which children born in 2001 were assessed with respect to their development by three consecutive surveys over six years (preschool wave 2005/06; kindergarten wave 2006 and 2007), partly a significantly higher prevalence of impaired gross motor skills was found [33] . This difference in the prevalence between the Bavarian and U.S. children may have been caused mainly by different study designs: American children were examined methodically in a highly differentiated way, while the school entrance examinations in Germany were just screening examinations.\nProblems of pronunciation were the most common developmental delay in our study. In the domain of \"speech\", delays in \"grammar\" and \"rhythm of speech\" were less common, with all other types of impairment being far less frequent. Comparatively lower rates for disorders of language (1999: 0.4% in \"rhythm of speech\" and 2.2% for \"dysgrammatism\") were found for the State of Baden-Württemberg in previous studies [16] . In contrast, in Hesse, significantly higher prevalences were observed, with approximately 11%-15% of the children having delays in speech in the cohorts of 1998-2005 [13] . The main reason for differences may be the different tests used in school entry examinations in the various states of Germany.\nThe high prevalence of over 10% for delays of memory and concentration was unexpected, whereas the frequencies of 3.2% to 6.8% for the remaining four subareas of cognitive development were not so surprising given previous findings [1] [10] , and for the District of Mettmann for both years 2000 and 2003 (20.1% vs. 22.2%) for the subarea of \"visual perception\" [15] . Generally, the investigation of cognitive delays in preschool children did not receive sufficient attention over a long time period [1] . Only recently the situation is changing [29] .\nWe identified problems of psychosocial development in every 15 th child in our survey. Until recent years, there appears to have been little interest in the assessment of psychosocial impairments. To some degree, psychosocial adjustment has been seen as a vague criterion, difficult to operationalize and not suitable for objective quantification. Nonetheless, it has become clear that it forms an important part of child development, and attempts to assess it are important [34] . Substantial differences were found in the rates of psychosocial problems in other regions in Germany in data published by Public Health Services. In the State of Hesse, 4.5%-5.0% of children had disorders of psychosocial functioning [13] , compared to 8.3% for the State of SchleswigHolstein and 13.6% in the District of North Friesland [14] . Thus, our prevalence figures are on the lower end in comparison with other regions in Germany. However, different methodologies and diagnostic approaches make direct comparison of these figures difficult. Developing more uniform and standardised assessment tools and diagnostic categories would be important to collate data from different regions and countries, and effectively utilise it for research and public health interventions."}, {"section_title": "Factors associated with development delays", "text": "Many factors negatively affecting child development have been identified in the literature, however the precise magnitude of effects remains difficult to establish. Some attempts to measure these influences have been made over recent years. The effect of visiting a kindergarten [24] , the influence of migration status [35] and the effects of selected behavioural and environmentrelated factors [1] on the development of preschool children were estimated. However, since these studies were all from the district of Dingolfing-Landau, it is not clear to what degree the same factors operate in other regions of Germany or in other countries.\nInteresting aspect are the effects of age. The basis for assessing the level of development were the so-called milestones of child development [36] . These developmental milestones describe the acquisition of skills up to a defined age of the child [37, 38] , and 95% of children in the targeted age group are expected to have these skills. Given the reference to age, the younger children at the school entry examination might not developed yet the required skills [5] . Children with many or substantial delays will not be recommended for school entrance, but rather asked to delay the start of school for one year. Still, some children with developmental delays enter school and this is the group which would potentially benefit from interventions following school entry examination. In contrast, higher risks for the oldest group were rather surprising. One possible explanation is that there was some selection bias and those who were older at examination were not included in an earlier examination due to a perceived immaturity. In such case, the developmental delays identified in this group might indicate a more serious problem than among the younger children who might just be too young at the time point of examination and obtained the required skills shortly thereafter.\nThe strongest and consistent association we detected was related to the effect of sex on development. More boys than girls were affected by disorders of development in all areas we tested. This higher prevalence for delays in boys has been a consistent finding in the literature on childhood development [2] . A sex ratio of 1 to 2-4 for girls to boys has been already described for most developmental disorders in the previous analysis using a subset of the current data [1] . Our current analysis provided additional insights into how sex affects specific subareas of functioning. Male gender increased the risk of developmental impairments by 38%-222% for all subareas of development. In addition, only small changes of this effect were found in the adjusted regression models. The exact reasons for this sex differences in development have not yet been established, though many theories have been proposed [39] .\nIn previous research, we studied the effect of having migrant status (non-German nationality) on developmental disorders [35] . We showed that more children with a non-German nationality demonstrated delays in motor, cognition and psychosocial development than other children. The elevated risk for preschool children with a nonGerman nationality in the current study in ten of twelve subareas of development was not unexpected. However, this indicated that among migrant children there can be specific stressors and developmental impediments that warrant further exploration and possibly tailored interventions. No doubt, one important reason for this observation can be a language barrier, which may be an important risk factor for some developmental delays, but may also make the assessment process biased.\nIn the past, primarily psychologists analysed the subject of the influence of siblings on child development [40, 41] . Until a few years ago, no significant interest was paid from the public health point of view to the influence that the presence or absence of siblings has on child development in this age group. Thus, only a small number of reports in public health area can be identified which explored this issue [14, 32] , but the specific effect on the prevalence of developmental delays in the target group of school beginners has not been examined in a quantitative way as done in this study. Having siblings was not associated with most areas of development apart from pronunciation difficulties. This finding persisted despite a simultaneous adjustment for migration background. This contrasts with a study by Minnett et al. who found positive influence of siblings on development of children [42] . Our findings were possibly affected by the fact that we could not adjust for socio-economic status.\nSchool entrance examinations were carried out during the period from November to April of calendar year. New school year in Bavaria begins always in the middle of following September. Thus, the preschoolers were assessed on average six months before entering primary school. During this period there is enough time for support measures if developmental delays were diagnosed in school entry examination. In this context, it should be noted that school entry examination is the only mandatory testing in the Federal Republic of Germany for children, but no standardised intervention measures are implemented for those who do not pass the examination or display deficits. For children with developmental deficits a specialized treatment can be recommended on individual basis, for example speech therapy, occupational therapy or supportive courses in sports."}, {"section_title": "Conclusions", "text": "Data from our study suggests that developmental delays of speech and cognition are particularly common in school entry examinations. In particular, boys and migrant children appear at high risk of developmental problems, which may warrant tailored intervention strategies. "}]