[{"section_title": "", "text": "There has been considerable interest in recent years concerning the low prevalence of women and underrepresented minorities in the information technology (IT) workforce. Traditionally this focus was motivated by concerns regarding equity. This interest was augmented during the 1990s because of the key role the IT sector played in the economic expansion and the concern that a shortage of IT workers existed. Increased participation of women and underrepresented minorities was seen as one way by which the IT workforce could be \"grown.\" The focus of much of this discussion concerned how the pipeline leading to careers in IT could be expanded, making careers in IT more attractive and accessible for women and minorities. A case in point is the Carnegie Mellon initiative, \"unlocking the clubhouse door,\" which focused on recruiting and attracting women and minorities, with considerable success, into IT programs at Carnegie Mellon University (Margolis and Fisher 2002). The size of the IT workforce, of course, depends not only on the pipeline in; it also depends on the pipeline out. If individuals leave the IT workforce for another occupation, or leave to exit the labor force, the size of the IT workforce is diminished. The major focus of this study is to examine factors related to retention and how retention varies by gender and underrepresented minority status. The focus of this study differs from that of most studies concerning women and underrepresented minorities in the IT workforce or, more generally, in the STEM (science, technology, engineering and math) workforce. Most articles look at why women and underrepresented minorities leave STEM fields while students; few examine retention after the career has begun, as we do here. Preston (2004) and Bentsen (2000) are two exceptions. Preston, who focuses on women in science and engineering, finds that mentors play an important role in whether women exit their field of training after starting their career. Bensten, who examines IT careers specifically, focuses on policies directed at retention. She is particularly struck by the National Security Agency's (NSA) ability to retain the women that they hire. She quotes Bernard Norvell, an NSA technical director for Human Resources Services, as saying: \"We can appeal to women with continuing-ed programs, onsite child-and elder-care responsibilities and fitness centers. These things are big sellers, very enticing to women.\" (Bensten 2000, p. 8). 1 The importance of retention in determining the size and mix of the IT workforce can be illustrated by examining the composition of the 1999 IT workforce as measured by SESTAT and determining the shrinkage that occurred between 1993 and 1999. We estimate that the female IT workforce in 1999 would have been 28,000 larger if women trained in IT and working in IT in 1993 had been retained in IT in 1999; 83,000 larger if women who had worked in IT without formal training in IT in 1993 were working in IT in 1999. Combined this would have meant that the female IT workforce would have been 40 percent larger in 1999 than it was. 2 By comparison, the male IT workforce would have been about a fourth larger if men working in IT occupations in 1993 had been retained in IT occupations in 1999. Retention would have increased the underrepresented minority IT workforce by about 50 percent in 1999. Taken 1 The Report of the Congressional Commission on the Advancement of Women and Minorities in Science, Engineering and Technology Development makes a similar point (p. 52) when it states: \"Issues of work and family balance are of paramount concern to women employed in SET fields. Policies and benefits such as extended parental leaves, part-time work options, onsite child care facilities, and greater scheduling flexibility are needed. Access to quality, reliable, affordable child care is key to the retention of working parents.\" 2 We estimate that the 1999 female IT workforce, as measured by SESTAT, was about 278,000, which includes 206,669 who were retained and 72,000 who were recruited into the IT workforce between 1993 and 1999. The 40 percent calculation uses 1999 as the base; the percent increase would have been about 35 percent if the 1993 base had been used instead. together, these differential retention rates mean that the IT workforce would have been more representative of the U.S. population in 1999 than it was. Statistics for the study come from the Scientists and Engineers Statistical Data System (SESTAT) compiled by the National Science Foundation. 3 The SESTAT data integrates three separate surveys overseen by SRS of individuals who have a college degree or higher who are either working in a science and engineering occupation or trained in science and engineering. The three surveys are: the Survey of Doctorate Recipients, the National Survey of College Graduates and the National Survey of Recent College Graduates. This paper is organized into 5 parts. In section II we briefly describe the SESTAT database as well as our definition of what it means to be IT trained or working in an IT occupation. Section III describes the IT workforce, first, in terms of formal training in IT, including estimates of the size of the IT workforce in 1993 and 1999 and second, in terms of who is employed in IT occupations. We are particularly interested in drawing inferences concerning retention of the IT workforce and how these patterns differ by gender and minority status. The econometric analysis is presented in Section IV where the issue of retention of the IT trained is studied using a multinomial approach. Particular attention is paid to how retention varies by gender and underrepresented minority status. Conclusions are drawn in Section V."}, {"section_title": "II. The SESTAT Database", "text": "The SESTAT data integrates three separate surveys overseen by the Science Resources Statistics (SRS) unit of the National Science Foundation: the Survey of Doctorate Recipients (SDR), the National Survey of College Graduates (NSCG) and the National Survey of Recent College Graduates (NSRCG). Although it is the best available database for the research we propose, SESTAT has several shortcomings. First, as is true with other databases, the SESTAT definition of IT occupations fails to capture all jobs where IT work is occurring. Second, SESTAT underrepresents four groups of scientists and engineers in the United States in 1995 and subsequent years. These are: (a) new immigrants with science and engineering (S&E) degrees earned outside the U.S. who entered the U.S. after 1990 and did not subsequently receive a degree in the U.S.; (b) college grads without S&E degrees who were not working in S&E occupations in 1993 but were in S&E occupations at a later date; (c) associate degree holders working in the S&E workforce; (d) individuals who lack any formal degree but who are working in the S&E workforce. In addition, no one over the age of 75 is included in the sample. A third shortcoming of SESTAT is that individuals without S&E training who began working in IT occupations in 1993 or later are not included. Fourth, and of importance for this study, programming, both as an occupation, and as a field of education, is not defined by SESTAT as being in S&E. This does not mean that programmers are excluded from SESTAT. It does, however, mean that they are not intentionally counted by SESTAT. Thus, individuals who worked as computer programmers in 1993 are only included in SESTAT if they received a degree in a S&E field and individuals who were trained in programming are only included in SESTAT if they were working in an S&E occupation in 1993. A final limitation of the data is that degrees awarded from business schools are excluded from the definition of S&E degrees regardless of content. For our purposes, this means that degrees in computer and information sciences awarded by business schools are missed in our definition of formal training. 4 Table 1 summarizes the content of the SESTAT database. 5 Individuals who earned S&E doctorates U.S. through academic year 1996 and indicated they planned to stay in the U.S. at time degree was received. Individuals who earned S&E doctorates in U.S. through academic year 1998 and indicated they planned to stay in the U.S. at time degree was received."}, {"section_title": "Defining IT Trained and IT Occupations using SESTAT", "text": "Defining IT training and IT occupations is not a straightforward task. This is because IT skills are often learned as part of a larger educational program or because for many older workers IT degrees were not awarded when they were in school. It is also because many individuals learn IT skills on the job, eschewing any formal educational training. Recently, two reports have drawn on data from SESTAT to analyze the IT workforce. The first of these is Building a Workforce for the Information Economy (National Research Council); the second is the IT Data Project (Ellis and Lowell). We draw heavily on these reports in defining IT occupations as well as IT training. We consider individuals to be formally trained in IT if they received one or more degrees "}, {"section_title": "III. Retention Six Years Later", "text": "The primary focus of this research is whether individuals who are working in IT occupations in one time period are working in IT occupations at a later date. We focus on two distinct groups of IT workers: those with formal training in IT and those who are not formally trained in IT. Persistence is measured by whether the individual is retained in an IT occupation in the six year interval from 1993 to 1999. Descriptive statistics are presented in Table 2 for the 1,058,989 1993 IT workers (weighted cases) who responded to both the 1993 and 1999 surveys. We find that the IT workforce was primarily white (83.6%) and male (70.3%). Before discussing the retention results, we note that informal training plays an important role in drawing people into the IT workforce. To wit, by inference we see that over 60% of the 1993 IT workforce was classified 6 Recall that programming was not included as a S&E field of training nor occupation in SESTAT so that the only programmers included in SESTAT are those who were trained in an S&E field and work as programmers or individuals not trained in S&E but working in S&E occupations in 1993. as not having formal IT training, using the above definitions. 7 We also note that the proportion without formal training is slightly higher among women than it is among men. Retention among the million plus 1993 IT workers is approximately seven in ten. About a quarter of those who were in IT in 1993 are now in a non-IT occupation; approximately 6 percent are no longer working. Most of these are out of the labor force, but a small percent are unemployed. We see that whites had a higher retention rate (70.3%) than African Americans (66.6%) but the retention rate for Hispanics was slightly higher (71.6%) than that for whites, while that for Asians was considerably higher (79.0%). The differential in retention rates by gender is striking: 73.2% of men who were working in IT in 1993 are working in IT in 1999 while 65.7% of the women who were working in IT are in IT in 1999. The differential is explained in part by a higher proclivity of women to move from IT positions to not working; the movement of women to non-IT positions is somewhat comparable to that of men. By way of contrast, the lower retention rate for African Americans compared to whites reflects a movement into non-IT occupations, not a movement into the \"no work\" category. Retention also varies by training status: those with formal training in IT are considerably more likely to remain in IT than those without formal training (80.4% vs. 65.1%). This pattern holds across gender and minority status."}, {"section_title": "Section IV. Multinomial Analysis of Retention", "text": "Here we examine the factors explaining the odds that those working in IT in 1993 are retained in IT occupations in 1999. Three possible outcomes can be observed for each individual in 1999: (1) to remain in an IT occupation (WORK IT); (2) to work in a non-IT occupation (WORK NOT-IT); and (3) to not work (NO WORK). Given these three possibilities, the estimation procedure we use is multinomial logit. Econometric theory tells us that from an efficiency standpoint it is preferable to estimate a multinomial logit model than a series of separate binomial logit models comparing the log odds of one outcome versus another (Allison, 1999, p. 123). For ease of exposition, we present not only the actual logit coefficients from the estimated models 8 but also the more easily interpreted odds-ratio. By way of example, for a dummy variable such as female, a value of 1.0 of the odds-ratio indicates that the odds of the event in question occurring are the same for women as for men, the benchmark. An odds-ratio greater than 1.0, for example, 1.5, tells us that the odds of the event in question occurring for women are 1.5 times those for men. (In other words, the odds are 50% higher for women than for men). An odds-ratio less than 1.0, for example, 0.4, indicates that the odds for women are just 0.4 times the odds for men (or that the odds for men are 1.0/0.4 or 2.5 times the odds for women.) 9 The odds-ratios are computed by taking the exponent of the log-odds for each variable. We also indicate whether each parameter estimate is statistically significant and whether we can reject the null hypothesis that all the parameters in the model have no affect on the odds-ratios. This is indicated by the statistical significance of the likelihood-ratio test ( -2 Log L). A glossary of the variables used in the models estimated appears in the Appendix. Table 3 presents the sample statistics. The logit results are presented in Table 4. In order to demonstrate the increased insight gained by using the mutinomial approach, we first present a simple logit equation, estimating the odds that an individual remains in an IT occupation vs. leaves an IT occupation, either to work in another occupation or to not work, being either out of the labor force or unemployed. These logit results are presented in column 1 of Table 4.  Notes: Estimates indicated by XXX are statistically significant at the .01 level, XXX at the .05 level, and XXX at the .10 level. na means that the parameter could not be estimated because of the lack of variation within the category. Variables indicated by \"f\" times the variable name denotes an interaction with the female dummy variable. We find strong evidence that retention relates to training, but the story is somewhat nuanced. There is no evidence that across the board those with one or more IT degrees are more likely to be retained than those without an IT degree. Rather, retention relates to whether the IT degree is the latest degree that the individual had in 1993. Thus, while those with an undergraduate degree in computer science but an MBA are not significantly more likely to be retained, than those with an undergraduate degree in business but a masters in computer science are. And the odds are of a striking magnitude: those whose IT degree is their latest degree are more than two times as likely to be retained as those who are IT trained but have received a subsequent, non-IT degree. We also find that those who took additional training of a non-IT nature during the 1990s', arguably with the goal of changing careers, are .36 as likely to be retained as those who did not. Surprisingly enough, we find that taking additional IT training during the six year interval is not significantly related to retention. This may be due to the strong degree of multicolinearity between \"itlatest93\" and \"addit.\" Among those without formal IT training who were working in IT in 1993, individuals trained in \"other science\" and \"other engineering\" (to distinguish them from training in IT) are significantly more likely to be retained than the benchmark group (education, humanities and the health professions). Age (age93) increases the odds of being retained in IT but the odds increase more slowly as one ages, as shown by the negative age-squared term (agesq93). We find no evidence that retention is related to citizenship status, but we do find that retention is related to a change in citizenship status. Those who became permanent residents during the six year period are significantly less likely (at the ten percent level) to be retained than natives. This may reflect their freedom from H-1B visa status (and holding an IT job) upon gaining permanent residency in the United States. For our purposes, we are particularly interested in the effects that gender and race/ethnicity have on retention, as well as family status variables that may differentially affect retention by gender and minority status. We find differences by gender to be statistically significant, other things being equal. Indeed, the odds that a woman remains working in IT are .785 those of a man remaining in IT. This is an important result in the sense that the introduction of other variables does not \"explain away\" the gender effects we saw above in the descriptive data. In terms of minority status, we find that African Americans are .78 as likely to be retained in an IT occupation as are whites (the benchmark). The coefficient is significant at the 10 percent level. We find no evidence that retention, other things being equal, differs between the Hispanic and other group, and whites; neither do we find any evidence that retention significantly varies between Asians and whites, other things being equal. We are able to observe several changes with regard to family status during the period. Specifically, we can determine if the respondent got married, became single or began to parent a child six or younger during the period. We enter all three change variables into the analysis. We find no statistical evidence that those who changed marital status or parenting status were any less likely to be retained than those who did not change status. In order to examine whether the effects differ by gender, we interact \"female\" with the change in status variables. We find that at the 10% level of significance, women IT workers who became single during the period are more likely to be retained than men who became single during the period. We find no evidence that for either men or women the addition of a young child in the household affects retention. 10 Finally, we comment on the variable \"selfemp\" which measures whether the individual was working for her or him-self as an IT worker in 1993. Our priors are that retention is related to self employment, the notion being that self employment provides more flexibility. We find no statistical support for this prior. Indeed, instead we find that the self employed were less likely to be retained. The right hand panel of Table 4 presents the multinomial logit results comparing three options, rather than one: the odds of staying in an IT position relative to leaving and taking a position in a non-IT occupation (Work IT vs. Work Not-IT); the odds of remaining in an IT occupation vs. not working (Work IT vs. No Work); and the odds of leaving an IT occupation to work in a non-IT occupation vs. leaving an IT occupation to not work. The results clearly indicate that increased insight can be gained when the choices are modeled as multiple outcomes vs. either or. This is especially the case for the gender and race/ethnicity variables. For example, we find that African Americans are significantly less likely to remain in IT vs. moving to a different occupation (column 2). Indeed, the odds that they stay are .70 those of whites (column 2). The odds of remaining in IT vs. leaving the work force are not significantly related to being African American, but the odds of working in a non-IT occupation vs. not working are significantly higher for African Americans. To wit, compared to whites, African Americans are more than twice as likely to be working in non-IT occupations as not working. Stated differently, we find evidence that blacks leave IT for another occupation; they do not leave IT to leave the labor force or because they are unemployed. Indeed, other things equal, they are much more likely than whites to be working in a non-IT occupation than to not work. By way of contrast, in the multinomial logit model we find that gender is insignificantly related to remaining in IT vs. switching to another occupation (column 2); but women are significantly more likely to not work, regardless of whether the benchmark is remaining in IT vs. not working (column 3) or working in another occupation vs. not working (column 4). And the effects are reasonably large with women being only about .45 percent more likely to stay in the work force than men (or men being about 2.2 times more likely to stay than women). We also find evidence that adding young children to the family has differential effects by gender; women who began parenting young children during the period are significantly more likely to not be working, whether it is in IT or a non-IT occupation than are men who began parenting during the period. The effects are quite strong, with women being between .23 and .31 less likely to be working than men who added young children to their families. Clearly, the work force status of female IT workers is more sensitive to the arrival of children than is the workforce status of men. The reader is reminded that the results presented above are conditional on the individual being in an IT occupation in 1993, regardless of whether the individual was IT trained or not IT trained. In order to ascertain whether these results vary by training status, we re-estimate the model for those with IT training (Table 5) and those without IT training (Table 6). The results suggest that some differences do exist. In particular, while the coefficients on female remain approximately the same (in terms of significance and sign), the coefficients on the interaction term with children do not. Instead, we find that adding children does not differentially affect the work status by gender of those with formal IT training. However, it does differentially affect the workforce status of women who had been working in IT who were not formally trained in IT (Table 6). We do not know the root cause of this differential. A possibility is that the \"trained\" group of women is more committed to the workforce than those who are not trained. The results also suggest some variation by minority status when the sample is split between the trained and the non-trained, but care must be taken given the small number of African Americans in the study which in and of itself may explain the change in significance. Several other interesting results emerge when the sample is split between those with formal training and those without formal IT training For example, we now see that the variable indicating whether the individual were self-employed has a nuanced role depending upon training status. IT workers in 1993 who were formally trained in IT and who were self-employed in 1993 are significantly less likely than those who were not self employed to leave IT for another occupation. However, IT workers in 1993 who were not formally trained in IT and who were self-employed in 1993 are not less likely to leave IT for another occupation. They are, however, significantly more likely to leave IT for the \"no work\" category. It is also worth noting that the change in visa status variable \"gotperm\" is only significant for those 1993 IT workers who did not have formal training. Specifically, it is those who became permanent residents between 1993 and 1999 who were not formally trained in IT who are significantly more likely to leave IT for a non-IT occupation after they became permanent citizens; not those with formal training. This suggests that the H-1B visa hypothesis noted above applies to those without formal training, not those with formal training. Perhaps the former group is less committed to the occupation than the latter group and sees IT work primarily as a means to becoming a permanent resident. Notes: Estimates indicated by XXX are statistically significant at the .01 level, by XXX at the .05 level, and XXX at the .10 level. na means that the parameter could not be estimated because of the lack of variation within the category. Variables indicated by \"f\" times the variable name denotes an interaction with the female dummy variable. Notes: Estimates indicated by XXX are statistically significant at the .01 level, by XXX at the .05 level, and XXX at the .10 level. na means that the parameter could not be estimated because of the lack of variation within the category. Variables indicated by \"f\" times the variable name denotes an interaction with the female dummy variable."}, {"section_title": "V. Conclusions.", "text": "This study examines factors related to whether an individual working in IT is retained in an IT occupation. We are particularly interested in whether and why retention varies by gender and minority status. For purposes of analysis we use the SESTAT data, focusing on those who are in the sample in both 1993 and 1999. Our empirical results are conditional on the individual working in IT in 1993. We find that women and African Americans are less likely to be retained in an IT occupation than are men and whites. Moreover, this result is sustained when we estimate a logit model, holding other variables constant. This means that we are not able to \"explain away\" why women and African Americans are less likely to be retained than men and whites. We find no evidence that Hispanics and other underrepresented minorities are less likely to be retained than whites. We find that differences exist between women and African Americans that manifest themselves when the data are analyzed using a multinomial logit model. Indeed, we find that the lower retention rate of women compared to men is due to the fact that women are more likely not to work. It is not because women leave IT for non-IT jobs. By way of contrast, the lower retention rate of African Americans is due to their leaving IT for other occupations. It is not because African Americans are observed not working in 1999. We also find that the retention of women is significantly related to whether they begin parenting a young child during the period while the retention of men is not significantly related to the arrival of young children. Interestingly enough, it is the women who lack formal training in IT who are affected by the presence of young children, not women who are trained in IT. Several other results are also worth noting. For example, we find no evidence that being selfemployed enhances the probability of retention. Indeed, among those with IT training, it reduces it. Our results also suggest that temporary residents who lack formal training in IT and become permanent residents during the period are less likely to be retained than natives. This may reflect their freedom from H-1B visa status. We conclude that policies directed towards retention will have differential outcomes depending upon the group in question. For example, with regards to retention, our results suggest that women, especially those without formal IT training, would be likely to respond to initiatives that provide on-site child care, thus making it less likely that they leave the labor force. By way of contrast, our results suggest that African Americans would be more likely to be responsive to initiatives that make IT occupations more appealing relative to non-IT jobs. Such initiatives could include mentoring and continuing education programs. We must emphasize that the analysis is limited in several respects. First, it only examines patterns of retention for individuals who qualify to be included in the SESTAT data. It also has not identified the extent to which the results reflect discrimination. A case in point is that we cannot infer whether the finding that African Americans are more likely to work in non-IT occupations than are whites is due to discrimination. Another limitation is that the small number of underrepresented minorities in the sample means that we cannot simultaneously analyze how retention varies by minority status and gender. The results are also limited to the extent that they may be clouded by the strong labor market that existed for IT workers in the late 1990s, partly because of issues related to Y2K. In future work, we hope to examine how the labor market influences patterns of retention and recruitment by studying the relationship between retention and recruitment and local labor market conditions."}]