[{"section_title": "Abstract", "text": "a b s t r a c t a r t i c l e i n f o\nSalt marsh Foraminifera Glacio-isostatic adjustment Greenland fingerprint Florida Late Holocene relative sea-level (RSL) reconstructions can be used to estimate rates of land-level (subsidence or uplift) change and therefore to modify global sea-level projections for regional conditions. These reconstructions also provide the long-term benchmark against which modern trends are compared and an opportunity to understand the response of sea level to past climate variability. To address a spatial absence of late Holocene data in Florida and Georgia, we reconstructed~1.3 m of RSL rise in northeastern Florida (USA) during the past 2600 years using plant remains and foraminifera in a dated core of high salt-marsh sediment. The reconstruction was fused with tide-gauge data from nearby Fernandina Beach, which measured 1.91 ± 0.26 mm/year of RSL rise since 1900 CE. The average rate of RSL rise prior to 1800 CE was 0.41 ± 0.08 mm/year. Assuming negligible change in global mean sea level from meltwater input/removal and thermal expansion/contraction, this sea-level history approximates net land-level (subsidence and geoid) change, principally from glacio-isostatic adjustment. Historic rates of rise commenced at 1850-1890 CE and it is virtually certain (P = 0.99) that the average rate of 20th century RSL rise in northeastern Florida was faster than during any of the preceding 26 centuries. The linearity of RSL rise in Florida is in contrast to the variability reconstructed at sites further north on the U.S. Atlantic coast and may suggest a role for ocean dynamic effects in explaining these more variable RSL reconstructions. Comparison of the difference between reconstructed rates of late Holocene RSL rise and historic trends measured by tide gauges indicates that 20th century sea-level trends along the U.S. Atlantic coast were not dominated by the characteristic spatial fingerprint of melting of the Greenland Ice Sheet."}, {"section_title": "Introduction", "text": "Relative sea level (RSL) is the net outcome of several simultaneous contributions including ocean mass and volume, the effect changing ice sheet mass on geoid and crustal height, ocean dynamics, and glacio-isostatic adjustment (GIA; e.g. Shennan et al., 2012) . During the late Holocene (last~2000-3000 years), RSL change along the passive U.S. Atlantic margin was dominated by spatially-variable land subsidence and geoid fall. The primary driver of these two processes was (and continues to be) GIA caused by the retreat of the Laurentide Ice Sheet and the collapse of its pro-glacial forebulge (e.g. Peltier, 2004) . However, other processes such as dynamic topography caused by mantle flow associated with plate tectonic motion (e.g. Rowley et al., 2013) and sediment compaction (Miller et al., 2013 ) also contribute to long-term RSL trends through vertical land motion. For convenience we use the term \"land-level change\" to refer to the net effect of GIA-induced geoid change and vertical land motion from all sources (Shennan et al., 2012) . To isolate climate-related sea-level trends and compare reconstructions from different regions, it is necessary to quantify rates of land-level change (e.g. Church and White, 2006) . These estimates are important for coastal management and planning because in many regions subsidence will be a principal reason for regional Marine Geology 357 (2014) 90-100 modification of global sea-level projections (e.g. Kopp et al., in press; Nicholls and Cazenave, 2010) . Approaches to estimate the contribution of land-level change to past and projected RSL include:\ni. Earth-ice models that assume no meltwater input during the late Holocene and attribute predicted RSL trends solely to GIA (Peltier, 2004) ; ii. Permanent global positioning stations (GPS) that directly measure net vertical motion from GIA and other processes (e.g. Sella et al., 2007; Woppelmann et al., 2009) . The short time series of measurements currently causes large (but decreasing) uncertainties in estimated land-level trends. GPS measurements do not incorporate GIA-induced changes in the geoid; iii. Paired satellite altimetry and tide-gauge datasets; iv. Basal RSL reconstructions that assume late Holocene meltwater input was negligible (like Earth-ice models) until~1850 CE and attribute RSL trends solely to land-level change (e.g. Engelhart et al., 2009) , thereby also capturing land-level changes from processes other than GIA.\nEarth-ice models predict that the contribution of GIA to RSL varies systematically with distance away from the former centers of glaciation. Along the east coast of North America this pattern is clear in RSL reconstructions, which show that the rate of late Holocene subsidence is greatest along the U.S. mid-Atlantic coast (up to 1.4 mm/year in New Jersey and Delaware) with decreasing rates to the north and south (Engelhart et al., 2009 (Engelhart et al., , 2011a (Engelhart et al., , 2011b . However, the absence of RSL reconstructions prevented estimation of subsidence rates in Florida and Georgia. It is important to constrain the late Holocene RSL history of this region to support coastal planning, to provide geological data for testing Earth-ice models, and to fill the spatial gap between the existing RSL datasets that are available for the U.S. Atlantic coast (Engelhart and Horton, 2012) and Caribbean (Milne et al., 2005; Milne and Peros, 2013) .\nDetailed reconstructions of late Holocene RSL allow investigation of the response of sea level to climate variability (e.g. the Medieval Climate Anomaly and Little Ice Age) and show that historic sealevel rise (either reconstructed or measured by tide gauges) exceeds the background rate that persisted for several previous centuries or longer (e.g. Donnelly et al., 2004) . Existing reconstructions from the Atlantic coast of North America indicate that RSL departed positively and negatively from a linear trend at intervals during the last 2000 years and prior to the onset of historic rates of rise (Gehrels, 2000; Gehrels et al., 2005; Kemp et al., 2011a Kemp et al., , 2013a . Spatial differences in the timing, sign, and magnitude of these trends may be indicative of the mechanisms causing RSL change (e.g. Clark and Lingle, 1977; Mitrovica et al., 2009; Yin et al., 2010) .\nTo estimate the rate of late Holocene land-level change and describe sea-level trends in northern Florida (Fig. 1) we reconstructed RSL change during the past~2600 years using plant macrofossils and foraminifera preserved in a dated core of salt-marsh sediment from Nassau Landing. We estimate the rate of late Holocene (pre-1800 CE) RSL rise using noisy-input Gaussian process regression and compare it to historic tide-gauge measurements from Fernandina Beach and reconstructions from elsewhere on the U.S. Atlantic coast. We evaluate the possible role of GIA and ocean dynamics as drivers of past, present, and future RSL change in the southeastern United States."}, {"section_title": "Study area", "text": "We used sediment recovered in gouge cores to investigate the stratigraphy underlying numerous salt marshes between Jacksonville, FL and St. Mary's, GA (Fig. 1) . Nassau Landing had the thickest and most complete sequences of high salt-marsh peat that we identified in the region.\nWe selected core NLM2 from Nassau Landing for detailed analysis because it included a 1.0 m thick unit of salt-marsh peat with abundant , and tidal benchmark at the Nassau Landing site. (C) Stratigraphy described in the field from gouge cores collected along transect X-X′. Core NLM2 (in red) was selected for detailed analysis and collected using a Russian corer. (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.) and in situ macrofossils of high-marsh plants (Juncus roemerianus and Cladium jamaicense) and was typical of the sediment sequence underlying the site (Fig. 1C) . Cores for laboratory analysis were collected using a Russian corer to prevent compaction and contamination during sampling. The cores were placed in rigid plastic sleeves, wrapped in plastic and kept in refrigerated storage. Below the high salt-marsh peat was 0.75 m of organic silt that included sparse J. roemerianus macrofossils and became less organic with depth. This unit overlies gray mud with no visible organic material that extended to at least 4.0 m below the marsh surface in NLM2. We did not recover any longer cores to establish the thickness of the gray mud or to identify the sedimentary unit underlying it. No cores described at Nassau Landing included deeper units of salt-marsh peat. Models of sediment compaction indicate that RSL reconstructions from saturated, shallow salt-marsh peat sequences without overburden are unaffected by autocompaction (Brain et al., 2012) . The Nassau Landing salt marsh is a platform marsh and typical of the ecology and geomorphology of marshes in the study region. Low-marsh floral zones are largely absent because there is a pronounced step change in elevation between the tidal channel and salt-marsh platform, which is up to 3.5 km wide in some places along the Nassau River. Peatforming plant communities are restricted to the salt-marsh platform and are vegetated by mono-specific stands of Juncus roemerianus that are replaced with mixed stands of J. roemerianus, Cladium jamaicense, and Iva frutescens at locations inland of the tidal channels reflecting the attenuation of tides by J. roemerianus stems and the low tolerance of C. jamaicense to salinity rather than a distinct zone of elevation (e.g. Brewer and Grace, 1990; Ross et al., 2000) . The marsh platform spans a narrow range of elevations in the uppermost part of the tidal frame from mean high water (MHW) to highest astronomical tide (HAT). Hardwood hammocks occupy uplands and well-drained slopes above HAT within and around the tidally-flooded marsh (Platt and Schwartz, 1990) . Water monitoring by the Department of Environmental Protection since 1996 CE shows that close to the coring site the Nassau River has an average salinity of 9.2‰. The great diurnal tidal range (mean lower low water, MLLW, to mean higher high water, MHHW) at the NOAA tide station adjacent to the coring site (\"Boggy Creek\") is 0.98 m. No HAT datum is available for Boggy Creek, so one was estimated as being 25% of the great diurnal tidal range above MHHW based on the tidal frame reported for Fernandina Beach. This approach assumes that the relationship between tidal datums is unchanged among estuaries in northeastern Florida and between sites located along the course of an estuary from sites relatively close to the coast (e.g. Fernandina Beach) to sites located upriver (e.g. Nassau Landing; Fig. 1 ). The validity of these assumptions can be tested on the St. John's River in Florida (~22 km south of Nassau Landing; Table 1 ) because tide gauges with reported HAT values extend from Mayport at the coast to Racy Point, which is 100 km upriver. This suite of tide gauges show that the height of HAT above MHHW falls from 28% of tidal range at Mayport to 15.4% at Racy Point. This indicates that our estimate of HAT at Nassau Landing is conservative. Cores and modern surface samples were related to tidal datums by leveling directly to the Boggy Creek tidal benchmark ( Fig. 1 ) using a total station and real time kinematic satellite navigation. The core-top altitude of NLM2 was 0.55 m above MTL."}, {"section_title": "Methods", "text": ""}, {"section_title": "Developing a chronology for NLM2", "text": "The accumulation history of NLM2 was established using an agedepth model (Bchron; Haslett and Parnell, 2008; Parnell et al., 2008) . The input for the model was a composite chronology comprised of radiocarbon ages (Table 2 ) and chronohorizons recognized by pollution and pollen markers of known age ( Fig. 2; Table 3 ). Chronohorizons were treated as having a uniform probability distribution and radiocarbon ages were calibrated using the IntCal09 dataset (Reimer et al., 2011) . No weighting was applied to any age estimates and a super long run of 10 million iterations was used to develop the age-depth model (Fig. 3) .\nTen sub-surface stems (culms) of Juncus roemerianus were separated from the sediment matrix and cleaned under a binocular microscope to remove contaminating material such as rootlets or adhered sediment particles before being dried at~45°C. These macrofossils are accurate markers of paleo-marsh surfaces because they grow close to the marsh surface (Eleuterius, 1976) and are relatively short lived (~3 years; Eleuterius, 1975) . The age-depth modeling approach we applied incorporated a vertical uncertainty (specified as sample thickness in model input) in the relationship between plant macrofossils and the paleo-marsh surfaces they represent. This approach is more flexible than applying a universal, discrete correction for each type of dated plant macrofossil. The ten samples were radiocarbon dated at the National Ocean Sciences Accelerator Mass Spectrometry (NOSAMS) and underwent standard acid-base-acid pretreatment.\nPrior to isotopic and elemental analysis, 1-cm thick slices of NLM2 were dried and ground to a homogenized fine powder. Every other 1-cm thick section in the upper 30 cm of NLM2 was analyzed for 137 Cs and 210\nPb after a sub-sample of the homogenized powder was weighed into vials that were sealed and stored for at least four weeks to achieve equilibrium and allow in growth of 222 Rn daughters prior to counting. Activity of 137 Cs in NLM2 was measured for 24-48 h by gamma spectroscopy using net counts at the 661.7 keV photopeak on a low-background, high-purity Germanium well detector at the Yale University Environmental Science Center. Although measured, 210 Pb was not included in the age-depth model for NLM2 because 210 Pb chronologies are derived from an accumulation model resulting in age-depth estimates that are not independent of one another. Since Bchron treats paired measurements of age and depth as independent, the inclusion of a 210 Pb-derived chronology would bias the age-depth model by unfairly and implicitly weighting it toward the multiple 210 Pb estimates that are typically positioned at 1 cm or 2 cm intervals (Kemp et al., 2013a (Kemp et al., , 2013b Pb-derived age estimates so that they sum to an importance equivalent to any single age-depth input such as a radiocarbon date.\nFor elemental analysis by mass spectrometry, a 0.25 g subsample of the homogenized powder was dissolved in Savillex™ PFA (Teflon) vials by a HF/HClO 4 /HNO 3 mixed concentrated acid attack. Once dry, the sample was redissolved in 25 ml of 1.6 M HNO 3 . Pb and isotope ratio determinations were made using a quadrupole ICP-MS instrument (Agilent 7500 series) fitted with a conventional glass concentric nebulizer. For elemental analyses, the samples were further diluted at a 1:40 ratio with 1% HNO 3 /HCl mixture on the day of analysis. The instrument was calibrated with multi-element chemical standards (SPEX Table 1 Relationship between tidal range and mean higher high water (MHHW) reported for select NOAA tide gauges in northeastern Florida. CertPrep™) of varying concentration to cover the expected range in the sample. The calibration was validated by additional standards obtained from a separate source to those used in calibration. Reference materials (including BCR-2) were carried through the same analytical procedure as samples as an additional check. The BCR-2 reference material basalt from the Columbia River and was produced and certified by the U.S. Geological Survey. This was chosen as the British Geological Survey long-term quality control for lead isotope ratio analysis because it is highly homogeneous with reliable and certificated isotope values at background lead concentrations. Detection limits for each element were calculated as the 3σ uncertainty of total procedural blanks. The detection limits for Pb and V were b 0.3 mg/kg and b 0.2 mg/kg for Cu. The Pb isotope ratio analysis was performed on samples individually diluted to give a 208 Pb + response of c. 500-800 kcps, the maximum value for the detector whist maintaining linearity in the pulsecounting mode. Measurements were made as ten, 30 s integrations to allow calculation of individual sample statistics. All ratios were corrected for blanks; mass bias being corrected by repeated analysis of C values were measured in an aliquot of gas collected from the combusted sample and expressed relative to the Pee Dee Belemnite (PDB) standard. Cs activity. Changes in the pollen assemblage were related to historical land use changes. Gray bands represent depth range for each marker horizon (dashed lines) and were used as sample thickness in the age-depth model. In some cases the gray bands from adjacent pollution markers may overlap with one another. Note that the depth scale is different for the panel showing pollen abundance. The detection limit for Pb and V is b0.3 mg/kg and for Cu is b0.2 mg/kg. SRM981 (NIST). Quality control was performed by repeated analysis of an in-house UK ore lead \"GlenDenning\" and the BCR-2 reference mate- the accuracy of the measured values was within error of those defined in Baker et al. (2004) . Palynomorphs (pollen and fern spores) were isolated from 1-cm thick core samples using standard palynological preparation techniques (Traverse, 2007) . To calculate palynomorph concentration (grains/g), one tablet of Lycopodium spores was added to 0.5-1.5 g of dry sediment. Samples were treated with HCl to remove carbonates and HF to remove silicates, acetolyzed (1 part H 2 SO 4 :9 parts of acetic anhydride) in a boiling water bath for 10 min, neutralized, and treated with 10% KOH for 10 min in a 70°C water bath. After neutralization the coarse and clay fractions were removed by sieving with 149 μm and 10 μm nylon mesh. Samples were swirled in a watch glass to remove mineral matter as necessary. After staining with Bismarck Brown, palynomorph residues were mounted on microscope slides in glycerin jelly. A minimum of 300 pollen grains and spores were counted from each sample to determine relative abundance."}, {"section_title": "Reconstructing paleomarsh elevation and relative sea level", "text": "Paleomarsh elevation (PME) is the tidal elevation at which a sample was originally deposited. It is reconstructed using the analogy between modern sea-level indicators and their counterparts preserved in the sedimentary record. In temperate latitudes, salt-marsh plants and foraminifera are widely employed as sea-level indicators because their observable, modern distribution is intrinsically linked to the frequency and duration of tidal inundation by ecological preferences and tolerances that vary among species (e.g. Scott and Medioli, 1978; Wright et al., 2011) . On the Atlantic coast of North America, this results in the zonation of plants into high and low salt-marsh ecosystems that are recognized in sediment cores by identification of plant macrofossils and sediment texture (e.g. Gehrels, 1994; Niering et al., 1977; van de Plassche, 1991) . According to Eleuterius and Eleuterius (1979) environments characterized by more than 75% Juncus roemerianus on the U.S. Gulf coast are flooded by about 8% of high tides, equating to a total annual inundation period of b 1.3% and tidal elevations above mean higher high water (MHHW). A similar distribution is observed on salt-marsh platforms in northeastern Florida (and elsewhere along the southeastern U.S. coast), where the lowest elevation of mono-specific zones of J. roemerianus in brackish settings is approximately MHW (e.g. Hughes, 1975; Kemp et al., 2010; Kurz and Wagner, 1957; Wiegert and Freeman, 1990; Woerner and Hackney, 1997) . Therefore high salt-marsh peat is classified as having accumulated at an elevation between MHW and HAT (e.g. Engelhart and Horton, 2012; van de Plassche, 1991) . Under current tidal conditions at Nassau Landing this range corresponds to an elevation of 0.58 ± 0.14 m above MTL based on our estimate of HAT.\nThe plant community at the time of sediment deposition was described by comparing plant macrofossils preserved in sediment cores described in the field and laboratory with modern examples (e.g. Niering et al., 1977; Warner, 1988) . Foraminifera were counted wet under a binocular microscope after core samples were sieved under running water to disaggregate the sediment and retain material sized between 63 μm and 500 μm. A minimum of 100 dead individuals were counted or the entire sample was counted if fewer than 100 were present. We assigned a PME to samples in NLM2 based on plant macrofossil remains that were supported by independent evidence from assemblages of foraminifera.\nIn most cases, down core changes in foraminifera (even within a continuous high-marsh peat) represent subtle disequilibrium between sediment accumulation and RSL rise. This requires PME to be estimated for each sample using a technique such as a transfer function (e.g. Gehrels, 2000; Horton, 1999) . There is a strong relationship between transfer function precision and tidal range demonstrating that reconstructions derived from settings with small tidal ranges have a correspondingly small vertical uncertainty (e.g. Callard et al., 2011) . However, in regions with very small tidal range this relationship is less robust. Barlow et al. (2013) compiled examples of transfer functions developed for salt-marsh foraminifera and showed that the average uncertainty was 10.1% of tidal range (when at least 50% of the tidal range was sampled in the training set). At locations where the tidal range was less than 1.0 m, the average uncertainty of three transfer functions was 16.2% of tidal range. This reduction in relative precision could reflect a changing relationship between tidal elevation and inundation where wind-driven water levels and distance inland are increasingly influential at smaller tidal ranges. At Nassau Landing (0.98 m tidal range) a transfer function precision of 16.2% would result in a vertical uncertainty in reconstructed PME of ± 0.16 m compared to ± 0.14 m for classification of a high salt-marsh peat. Under these (and similar) conditions development and application of a transfer function to reconstruct PME are unlikely to offer a significant advantage over classification. Therefore it was not necessary to develop and apply a transfer function to reconstruct PME at Nassau Landing and this level of complexity was avoided.\n3.3. Quantifying rates of relative sea-level change RSL was reconstructed by subtracting PME from measured sample elevation (depth in a core with a known surface elevation). The new reconstruction and annual tide-gauge data from Fernandina Beach (1898- 2013 CE) were used to describe and quantify patterns of RSL change in northeastern Florida. To fuse these two independent data sources into a single record, we smoothed the tide-gauge data to remove inter annual, red noise-like variability following the method of Kopp (2013) . To analyze the data, we apply a noisy-input Gaussian process regression methodology similar to that used by Kopp (2013) for tide-gauge analysis, although treating all data as though observed at a single spatial location (Fernandina Beach is approximately 23 km from Nassau Landing; Fig. 1) . A similar approached was used by Miller et al. (2013) for examining proxy data and tide-gauge data from New Jersey. The vertical uncertainty of reconstructed RSL was treated as a normally-distributed 2σ range. Age errors estimated from the 95% confidence interval output by Bchron were approximated as normally distributed and treated as ± 2σ. Uncertainty on calibrated ages was transformed to vertical uncertainty using the noisy-input Gaussian process methodology of McHutchon and Rasmussen (2011) . We fit the data to a Gaussian process with a prior mean of zero and prior covariance function k(t 1 ,t 2 ), where t 1 and t 2 are two different ages. We employ the sum of (1) a Matérn covariance function with amplitude σ m 2 , scale factor τ, and order ν, (2) white noise with amplitude σ n 2 , and (3) an offset with amplitude σ d 2 to correct for datum mismatches between the tide gauge and the proxy data:\nwhere C(r,v,γ) is a Matérn covariance function, δ is the Kronecker delta function (equal to 1 if t 1 = t 2 and 0 otherwise), I i is an indicator equal to 1 if I is a proxy observation and 0 otherwise, Γ is the gamma function and K ν the modified Bessel function of the second kind. We set the hyperparameters σ m , τ, γ, σ n and σ d by finding their maximum likelihood values. The resulting hyperparameters are σ m = 1190 mm, τ = 4.13 ky and ν = 1.1. The parameter σ n = σ d = 0 mm, implying that both high-frequency variability and datum offsets are within the noise of the observations.\nPaleomarsh elevation was reconstructed using plant macrofossils and foraminifera preserved in the dated interval of NLM2. The upper 1.0 m of NLM2 was comprised of a brown high salt-marsh peat and contained abundant and in situ plant macrofossils of Juncus roemerianus and Cladium jamaicense (Fig. 1C) . Between 1.0 m and 1.75 m the core was comprised of organic silt including preserved J. roemerianus remains between 1.0 m and 1.25 m. Reconstruction of RSL was limited to the upper 1.25 m of the core because of a lack of reliable material for radiocarbon dating and paleoenvironmental interpretation below this depth. The plant macrofossils in NLM2 indicate that the core accumulated in a high salt-marsh environment above MHW and below HAT (e.g. Eleuterius and Eleuterius, 1979; Engelhart and Horton, 2012; van de Plassche, 1991) . The presence of C. jamaicense macrofossils also indicates low-salinity conditions (Brewer and Grace, 1990) , similar to those present at the site today.\nIn NLM2, the assemblage of foraminifera in 66 samples from 2 cm to 130 cm (Fig. 4) was dominated by Ammoastuta inepta (70% of total individuals). Modern assemblages of A. inepta on the U.S. Atlantic coast occupy low-salinity environments and high tidal elevations close to MHW and MHHW (Kemp et al., 2009 (Kemp et al., , 2013b . In a small number of samples the abundance of other species exceeded 20% (Arenoparrella mexicana at 52 cm, 54 cm, and 56 cm; Jadammina macrescens at 24 cm and 50 cm; Miliammina petila at 2 cm and 4 cm; and Tiphotrocha comprimata at 20 cm), likely reflecting short-lived environmental changes such as local salinity fluctuations or population blooms (Kemp et al., 2011b) . At depths of 26-30 cm there were five or fewer foraminifera in each 1-cm thick core sample. The species present in these samples were A. inepta, J. macrescens and T. comprimata and the individual tests were only unusual in their scarcity. This interval does not correspond to any visible change in sediment composition. Intervals of low test abundance are not uncommon in cores of salt-marsh sediment (e.g. Gehrels et al., 2002 Gehrels et al., , 2006 Kemp et al., 2013a Kemp et al., , 2013b ) and may be caused by test dissolution, low rates of reproduction, patchy distributions of living foraminifera, or dilution of test concentration by the rate of sediment accumulation. Foraminifera data are provided in Appendix A.\nGiven the homogenous nature of preserved plant macrofossils and foraminiferal assemblages in NLM2, we assigned a PME of 0.58 m above MTL ± 0.14 m to all samples in NLM2 with counts of foraminifera reflecting deposition in a high salt-marsh environment between MHW and HAT. This suggests that the rate of sediment accumulation was equal to the rate of sea-level rise and that the Nassau Landing marsh maintained its elevation in the tidal frame sincẽ 600 BCE (Kirwan and Murray, 2007; Morris et al., 2002) . Therefore, RSL is equal to the history of sediment accumulation described by an age-depth model. RSL was reconstructed by subtracting PME from the measured altitude of samples in NLM2. The age of each sample was estimated by the age-depth model. From 590 BCE to 2010 CE, reconstructed RSL at Nassau Landing rose by 1.27 m ± 0.09 m (2σ; Fig. 5B ). Between 1900 CE and 2012 CE the Fernandina Beach tide gauge measured 1.9 ± 0.3 mm/ year of RSL rise ( Fig. 5A ; Kopp, 2013) . We fused these two records to quantify RSL changes in north Florida. The Gaussian process fit to the records indicates that the mean rate of RSL rise in northern Florida was 0.41 ± 0.08 mm/year (2σ) from 700 BCE to 1800 CE (Fig. 5) . The first 40-year period where the rate of RSL rise exceeded this background rate with probability P N 0.95 was 1850 CE to 1990 CE (P = 0.96; Fig. 5D ). To compute the probability that 20th century RSL rise in northern Florida was without precedent in the late Holocene, we sampled the posterior probability distribution generated by the Gaussian process model, taking into account the covariance among time points (Miller et al., 2013) . This analysis showed that it was virtually certain (P = 0.99) that the 20th century rate of RSL rise was greater than the average rate during any of the previous 26 centuries. After correction for 0.41 ± 0.08 mm/year of land-level change, the Fernandina Beach tide gauge indicates that sea level in northern Florida rose at~1.5 ± 0.3 mm/year, consistent with the global mean of~1.7 ± 0.2 mm/year (Church and White, 2011) . PME and RSL data are available in Appendix A."}, {"section_title": "Results", "text": ""}, {"section_title": "Age-depth model", "text": "Calibrated radiocarbon ages showed that the upper 125 cm of NLM2 spans the period since~600 BCE (Fig. 3) . Measured δ 13 C values on the radiocarbon dated macrofossils identified as Juncus roemerianus (− 28.3‰ to − 25.1‰) are similar to the value (-27.0‰) reported for J. roemerianus in modern Florida wetlands (Choi et al., 2001 Pb), and changes in pollen identified pollution and environmental horizons of known age (Table 3 ; Fig. 2 ). Interpretation of the elemental and isotopic profiles was based on national production records (e.g. USGS, 1998) and regional pollution histories (Jackson et al., 2004; Kamenov et al., 2009 ). Each chronological horizon was assigned an age and depth error (Table 3 ). The age error is an estimate of the uncertainty of identifying a specific date in historical records and the lag between emission and deposition. The depth error recognizes that age horizons could be associated with multiple, adjacent depths in the core, where not every 1-cm thick sample was analyzed for elemental, isotopic, or pollen composition. We assumed that changes in production and consumption caused a corresponding change in emissions that were transported by constant prevailing wind patterns and deposited from the atmosphere on to the salt-marsh surface within a few years (Graney et al., 1995) and without isotopic fractionation (Ault et al., 1970) . Since emissions per unit of production or consumption must have changed over time, we recognized chronohorizons in NLM2 using trends rather than absolute values. Maximum Pb trends (Gobeil et al., 2013; Lima et al., 2005) . After 1920 CE, changes in Pb isotopes reflect emissions from leaded gasoline prior to its phasing out in North America (Facchetti, 1989) . We recognized horizons matched to 1965 CE and 1980 CE that resulted from the changing mixture of leaded gasoline in the U.S. (Hurst, 2000) . Changes in Pb isotope ratios at 1870 CE and 1900 CE were correlated to the regional history of coal combustion (Jackson et al., 2004) . Introduction of V to the environment is principally from industrial and domestic combustion of fuel oil (Hope, 2008) . Its volatility ensures that influx of V is most likely from an atmospheric source. The change from heavy to distilled oils since the 1970s reduced V emissions (Kamenov et al., 2009) , therefore the peak concentration was assigned an age of 1975 CE ± 5 years.\nChanges in pollen percent abundance provided two age-depth estimates. The decline in Pinus at 21 cm was attributed to the logging of pine trees in northern Florida which gathered pace after the Civil War and assigned an age of 1865 CE. Increased Ambrosia at 13 cm was attributed to the regional expansion of agroforestry (pine plantations) with the arrival of the Rayonier Company and assigned an age of 1935 CE. We developed an age-depth model for core NLM2 (Fig. 3) using the Bchron package for R (v.3.1.5; Parnell et al., 2008) . The model included all dating results (radiocarbon and chronohorizons) and generated an age estimate (with 95% confidence interval) for each 1-cm thick level from 0 cm to 125 cm in NLM2. Inclusion of all age-depth results (with chronological and vertical errors) in the model ensures that it takes all uncertainty into consideration. The average uncertainty in modeled age was ± 64 years and none of the original age-depth results were shown to be incompatible with others given their uncertainties. Agedepth data is presented in Appendix A."}, {"section_title": "Discussion", "text": ""}, {"section_title": "Rate of land-level change in northern Florida", "text": "Earth-ice model predictions indicate that the reconstructed rate of late Holocene subsidence (0.41 ± 0.08 mm/year) is representative of regional, late Holocene RSL trends between approximately Cape Canaveral, FL (28.5°N) and Savannah, GA (32°N; Fig. 6 ). The new reconstruction extends southward the spatial extent of land-level changes estimated from geological data and demonstrates that the rate of subsidence in northern Florida conforms to the pattern observed further north along the U.S. Atlantic coast in RSL reconstructions (Engelhart et al., 2009 ) and in modeling of tide-gauge data ( Fig. 7 ; Kopp, 2013) . It is also in agreement with data from the U.S. Gulf coast located at a similar latitude and distance from the Laurentide Ice Sheet, which reconstructed long-term RSL rise to be 0.6 mm/year, including 0.45 mm/ year from GIA and 0.15 mm/year from flexure of the Mississippi delta (Yu et al., 2012) . Land subsidence of 0.41 mm/year should accordingly be included in regional projections of RSL rise in northern Florida for purposes of coastal planning and management.\nThe ICE6G-VM5a (C) Earth-ice model (Argus and Peltier, 2010; Argus et al., 2014; Peltier et al. , submitted for publication) predicts 1.00 m of RSL rise from GIA over the last 2000 years (linear rate of 0.5 mm/year) at Nassau Landing. This rate is in agreement with the new RSL reconstruction. The small (~0.1 mm/year) difference is at the margins of the reconstruction precision and could be attributed to processes that counteract GIA. Up to 0.047 mm/year may be from isostatic uplift caused by karstifaction of the Florida platform, although the model used to calculate this estimate did not account for GIA (Adams et al., 2010) . Dynamic topography may also contribute to the difference between predicted and reconstructed RSL (Rowley et al., 2013) , but is likely to be a negligible effect over the timescales under consideration. Small changes in ocean mass or volume could also explain the difference since they are zero in the Earth-ice model for the time period under consideration. A full assessment of model fit in Florida and Georgia requires"}, {"section_title": "Ammoastuta inepta", "text": "A. mexicana M. petila T. comprimata J. macrescens Relative Abudance (%) Fig. 4 . Abundance of the five most common species of foraminifera preserved in 1-cm thick samples from NLM2. The light gray horizontal bar across all plots represents an interval where foraminifera were present but sparse. These samples were not used to reconstruct relative sea level."}, {"section_title": "Depth (cm)", "text": "longer RSL records because the misfit between models and predictions reported elsewhere along the U.S. Atlantic coast is most apparent in middle and early Holocene data (Engelhart et al., 2011a (Engelhart et al., , 2011b . A GPS station 5.5 km from the Fernandina Beach tide gauge measured subsidence of 3.58 ± 0.30 mm/year and was recognized as anomalous compared to the data from Charleston, Miami Beach, and Key West (Wöppelmann et al., 2009; Yin and Goddard, 2013) . GPS station JXVL (~12 km from Nassau Landing) measured uplift of 1.0 ± 2.6 mm/year (1σ), over 3.6 years (Sella et al., 2007) . Although this wide error bound includes the rates estimated using the Earth-ice model and the Nassau Landing RSL reconstruction, accurately estimating rates of land-level change using GPS in northern Florida will require waiting for longer time series and/or more instruments to reduce uncertainty and allow a more meaningful comparison among approaches. It is also important to note that GPS stations do not measure the same parameter as RSL reconstructions; GPS stations are sensitive only to vertical land motion and not the geoid component of GIA."}, {"section_title": "Late Holocene relative sea-level trends", "text": "The linearity of reconstructed RSL in northern Florida before the late 19th century is in contrast to similar reconstructions from North Carolina and New Jersey that identified periods of late Holocene sea-level rise prior to the onset of historic trends (Kemp et al., , 2013a . The non-synchronous timing of sea-level rise in New Jersey (250 CE to 750 CE) and North Carolina (950 CE to 1375 CE) coupled with the linearity of sea level in Florida suggests that these features were unlikely generated by radiocarbon calibration and a physical explanation is needed to explain the spatial pattern displayed by the reconstructions.\nChanges in the strength and position of the Gulf Stream would cause spatially-variable sea-level rise along the Atlantic coast of North America (e.g. Ezer et al., 2013; Levermann et al., 2005; Yin et al., 2009) . Modeling studies suggest that a 1 Sv change in Gulf Stream transport (currently~31 Sv) would generate a 0.5-2 cm sea-level change along the U.S. Atlantic coast north of Cape Hatteras (Bingham and Hughes, 2009; Ezer, 2001; Kienert and Rahmstorf, 2012) . A weaker Gulf Stream causes a RSL rise along the U.S. east coast and a stronger Gulf Stream causes a RSL fall (e.g. Ezer, 2001) . Locations south of Cape Hatteras (including Nassau Landing) are unaffected by this process because of the proximity of the Gulf Stream to the coast. Changes in Gulf Stream strength occur as part of trends and variability in Atlantic meridional overturning circulation (AMOC; Bryden et al., 2005; Cunningham et al., 2007; Srokosz et al., 2012) and in response to changing patterns of atmospheric winds and pressure over periods of months to years (such as those that occur as part of the North Atlantic Oscillation; NAO) (e.g. Lozier, 2012) . For example, direct measurements show that the strength of the Gulf Stream in the Florida Current is anticorrelated with the NAO (Ezer et al., 2013) . From 2002 to 2011 CE, comparison of sea-level variability measured by tide gauges along the U.S. mid-Atlantic coast with altimetry measurements of the sea-surface gradient across the Gulf Stream indicates that changes in Gulf Stream strength resulted in sea-level changes along the U.S. Atlantic coast (Ezer et al., 2013) .\nLong-term (multi-century) changes in AMOC and Gulf Stream strength may result from climate-driven changes in North Atlantic water density (Lund et al., 2006; Lynch-Stieglitz et al., 1999) . In the Florida strait, Gulf Stream strength was 3 Sv less than present during the Little Ice Age (Lund et al., 2006) and 10-17 Sv less at the Last Glacial Maximum (Lynch-Stieglitz et al., 1999) . Assuming that the separation of the Gulf Stream from the coast remained at Cape Hatteras (Matsumoto and Lynch-Stieglitz, 2003) , the Little Ice Age change would have produced a small sea-level rise in North Carolina and New Jersey (b6 cm), but not in Florida. To explain the magnitude of late Holocene sea-level changes in North Carolina and New Jersey (approximately 10-30 cm) as a consequence of variability in Gulf Stream strength would require a greater sensitivity than that predicted by current models or a process that amplifies the resulting sea-level trends. Furthermore, the Little Ice Age is characterized by stable or falling sea level in both reconstructions possibly because the ocean dynamic effect was overwhelmed by another contribution working in the opposite direction such as ocean mass and volume changes in a cooler climate.\nSince 1850-1890 CE, RSL rise in northern Florida has exceeded the long-term background rate of change (Fig. 5D) . After removing 0.41 ± 0.08 mm/year of land-level change, the Fernandina Beach tide gauge indicates that sea level in northern Florida rose at~1.5 mm/year, consistent with the global mean of~1.7 ± 0.2 mm/year (Church and White, 1900 1910 1920 1930 1940 1950 1960 1970 1980 Relative Sea Level (m, 1980-1999) (Fig. 8) . In each case the historic rate of rise exceeded the long-term background rate and the difference was shown to increase from north to south reaching a maximum at Charleston, SC. It was cautiously proposed that this spatial trend could be a sea-level fingerprint caused by melting of the Greenland Ice Sheet, with the caveat that other processes (e.g. steric effects) could also produce a similar spatial pattern and that additional records from Florida and Georgia were needed to further test this hypothesis. We extend this comparison further south along the U.S. Atlantic coast with the new Nassau Landing reconstruction and by using the rates of RSL change at tide-gauge stations (including Fernandina Beach) computed by Kopp (2013) to account for differences in tide-gauge record length (Fig. 8 ). This analysis suggests that the maximum difference between rates of rise estimated from RSL reconstructions and measured by tide gauges likely occurs in Maryland or Virginia and does not conform to the proposed north-south pattern caused by melting of the Greenland Ice Sheet. If present, the spatial fingerprint of Greenland melt is masked by a combination of reconstruction uncertainty and other spatially-varying contributors to RSL change, such as 20th-century changes in ocean dynamics."}, {"section_title": "Conclusions", "text": "Absence of data previously prevented the rate of land-level change from being estimated in Florida and Georgia using RSL reconstructions. We used plant macrofossils and foraminifera preserved in a core of dated salt-marsh sediment from Nassau Landing to reconstruct RSL during the last~2600 years. The new reconstruction was fused with tidegauge measurements from Fernandina Beach. The resulting RSL record was analyzed using a Gaussian process model that estimated the rate of RSL rise from 700 BCE to 1800 CE to be 0.41 ± 0.08 mm/year, which we attribute to long term land-level change principally from glacio-isostatic subsidence. This is in agreement with the spatial pattern of RSL change reconstructed along the U.S. Atlantic coast, where late Holocene rates of rise are greatest in the mid-Atlantic region and decrease gradually southward. RSL rise at Nassau Landing was linear until the late 19th or early 20th century. The linearity of reconstructed late Holocene sea level in northern Florida is in contrast to locations further north (North Carolina and New Jersey) where positive and negative sealevel trends are thought to be a consequence of climate variability. A strong ocean dynamic component may explain this spatial pattern. Kopp, 2013) , where positive values indicate relative sea level fall. Geological data are linear regressions fitted to 19 regional groups of sea level index points from the last 4000 years, with 1σ error bars (Engelhart et al., 2009 ). The Nassau Landing rate is the mean rate of RSL rise estimated by the Gaussian process model from 700 BCE to 1800 CE with a 2σ error term. Estimates from modeling of tide-gauge records are the regionally-coherent linear component of RSL rise generated by Kopp (2013) , which are taken to be equivalent to land-level change. The estimate from the Gulf Coast (Yu et al., 2012) was derived from linear regression of reconstructed RSL. Select tide-gauge locations are labeled for orientation. The Gaussian process model demonstrates that it was virtually certain (P = 0.99) that the rate of 20th century RSL rise in northern Florida exceeded average rates in each of the previous 26 centuries. The difference between long-term RSL rise reconstructed in northern Florida and historic RSL rise measured by the Fernandina Beach tide gauge is 1.5 mm/year. Comparison of this difference to locations further north indicates that 20th century sea-level rise along the U.S. Atlantic coast cannot be explained solely by the characteristic spatial fingerprint of melting of the Greenland Ice Sheet. Regional sea-level projections for the 21st century should be modified to include an additional 0.41 mm/year from land-level change for regional planning and management purposes in northern Florida. Tide-gauge RSL trend 1900 -2012 CE (Kopp, 2013 Late Holocene reconstructed RSL trend (Engelhart et al., 2009 (Engelhart et al., , 2011 this (Engelhart et al., 2011a (Engelhart et al., , 2011b , the addition of the Nassau Landing reconstruction and Fernandina Beach tide gauge, and tide-gauge rates estimated by Kopp (2013) to account for differences in record length. (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.)"}]