[{"section_title": "Abstract", "text": "For more information on the USGS-the Federal source for science about the Earth, its natural and living resources, natural hazards, and the environment, visit http://www.usgs.gov or call 1-888-ASK-USGS For an overview of USGS information products, including maps, imagery, and publications, visit http://www.usgs.gov/pubprod\nTo order this and other USGS information products, visit http://store.usgs.gov Any use of trade, product, or firm names is for descriptive purposes only and does not imply endorsement by the U.S. Government.\nAlthough this report is in the public domain, permission must be secured from the individual copyright owners to reproduce any copyrighted materials contained within this report. \nThe U.S. Geological Survey (USGS) is committed to providing the Nation with reliable scientific information that helps to enhance and protect the overall quality of life and that facilitates effective management of water, biological, energy, and mineral resources (http://www.usgs.gov/). Information on the Nation's water resources is critical to ensuring long-term availability of water that is safe for drinking and recreation and is suitable for industry, irrigation, and fish and wildlife. Population growth and increasing demands for water make the availability of that water, measured in terms of quantity and quality, even more essential to the long-term sustainability of our communities and ecosystems.\nThe USGS implemented the National Water-Quality Assessment (NAWQA) Program in 1991 to support national, regional, State, and local information needs and decisions related to water-quality management and policy (http://water.usgs.gov/nawqa). The NAWQA Program is designed to answer: What is the quality of our Nation's streams and groundwater? How are conditions changing over time? How do natural features and human activities affect the quality of streams and groundwater, and where are those effects most pronounced? By combining information on water chemistry, physical characteristics, stream habitat, and aquatic life, the NAWQA Program aims to provide science-based insights for current and emerging water issues and priorities. During 1991 to 2001, the NAWQA Program completed interdisciplinary assessments and established a baseline understanding of water-quality conditions in 51 of the Nation's river basins and aquifers, referred to as Study Units (http://water.usgs.gov/nawqa/studyu.html).\nNational and regional assessments are ongoing in the second decade (2001)(2002)(2003)(2004)(2005)(2006)(2007)(2008)(2009)(2010)(2011)(2012) of the NAWQA Program as 42 of the 51 Study Units are selectively reassessed. These assessments extend the findings in the Study Units by determining water-quality status and trends at sites that have been consistently monitored for more than a decade, and filling critical gaps in characterizing the quality of surface water and groundwater. For example, increased emphasis has been placed on assessing the quality of source water and finished water associated with many of the Nation's largest community water systems. During the second decade, NAWQA is addressing five national priority topics that build an understanding of how natural features and human activities affect water quality, and establish links between sources of contaminants, the transport of those contaminants through the hydrologic system, and the potential effects of contaminants on humans and aquatic ecosystems. Included are studies on the fate of agricultural chemicals, effects of urbanization on stream ecosystems, bioaccumulation of mercury in stream ecosystems, effects of nutrient enrichment on aquatic ecosystems, and transport of contaminants to public-supply wells. In addition, national syntheses of information on pesticides, volatile organic compounds (VOCs), nutrients, trace elements, and aquatic ecology are continuing.\nThe USGS aims to disseminate credible, timely, and relevant science information to address practical and effective water-resource management and strategies that protect and restore water quality. We hope this NAWQA publication will provide you with insights and information to meet your needs, and will foster increased citizen awareness and involvement in the protection and restoration of our Nation's waters.\nThe USGS recognizes that a national assessment by a single program cannot address all water-resource issues of interest. External coordination at all levels is critical for cost-effective management, regulation, and conservation of our Nation's water resources. The NAWQA Program, therefore, depends on advice and information from other agencies-Federal, State, regional, interstate, Tribal, and local-as well as nongovernmental organizations, industry, academia, and other stakeholder groups. Your assistance and suggestions are greatly appreciated. \nRegression models for predicting atrazine concentrations in streams were updated by incorporating refined annual atrazine-use estimates and by adding an explanatory variable representing annual precipitation characteristics. The updated Watershed Regressions for Pesticides (WARP) models enable improved predictions of specific pesticide-concentration statistics for unmonitored streams.\nSeparate WARP regression models were derived for selected percentiles (5th, 10th, 15th, 25th, 50th, 75th, 85th, 90th and 95th), annual mean, annual maximum, and annual maximum moving-average (21-, 60-, and 90-day durations) concentration statistics. Development of the regression models involved the same model-development data, model-validation data, and regression methods as those used in the original development of WARP. The original WARP models were based on atrazine-use estimates from either 1992 or 1997. This update of the WARP models incorporates annual atrazine-use estimates. In addition, annual precipitation data were evaluated as potential explanatory variables.\nThe updated WARP models include the same five explanatory variables and transformations that were used in the original WARP models, including the new annual atrazine-use data. The models also include a sixth explanatory variable, total precipitation during May and June of the year of sampling. The updated WARP models account for as much as 82 percent of the variability in the concentration statistics among the 112 sites used for model development, whereas previous WARP models accounted for no more than 77 percent. Concentration statistics predicted by the 95th percentile, annual mean, annual maximum and annual maximum moving-average concentration models were within a factor of 10 of the observed concentration statistics for most of the model development and validation sites.\nOverall, performance of the models for the development and validation sites supports the application of the WARP models for predicting atrazine-concentration statistics in streams and provides a framework to interpret the predictions in terms of uncertainty. For streams where direct measurements of atrazine are lacking, the updated WARP model predictions can be used to characterize the probable values of atrazine-concentration statistics for comparison to specific water-quality benchmarks.\nRegression models for predicting atrazine concentrations in streams were updated by incorporating refined annual atrazine-use estimates and by adding an explanatory variable representing annual precipitation characteristics. The updated Watershed Regressions for Pesticides (WARP) models enable improved predictions of specific pesticide-concentration statistics for unmonitored streams.\nSeparate WARP regression models were derived for selected percentiles (5th, 10th, 15th, 25th, 50th, 75th, 85th, 90th and 95th), annual mean, annual maximum, and annual maximum moving-average (21-, 60-, and 90-day durations) concentration statistics. Development of the regression models involved the same model-development data, model-validation data, and regression methods as those used in the original development of WARP. The original WARP models were based on atrazine-use estimates from either 1992 or 1997. This update of the WARP models incorporates annual atrazine-use estimates. In addition, annual precipitation data were evaluated as potential explanatory variables.\nThe updated WARP models include the same five explanatory variables and transformations that were used in the original WARP models, including the new annual atrazine-use data. The models also include a sixth explanatory variable, total precipitation during May and June of the year of sampling. The updated WARP models account for as much as 82 percent of the variability in the concentration statistics among the 112 sites used for model development, whereas previous WARP models accounted for no more than 77 percent. Concentration statistics predicted by the 95th percentile, annual mean, annual maximum and annual maximum moving-average concentration models were within a factor of 10 of the observed concentration statistics for most of the model development and validation sites.\nOverall, performance of the models for the development and validation sites supports the application of the WARP models for predicting atrazine-concentration statistics in streams and provides a framework to interpret the predictions in terms of uncertainty. For streams where direct measurements of atrazine are lacking, the updated WARP model predictions can be used to characterize the probable values of atrazine-concentration statistics for comparison to specific water-quality benchmarks."}, {"section_title": "Introduction", "text": "Pesticide concentrations in streams vary widely across the United States. Each pesticide has a unique pattern of occurrence because factors such as pesticide use, application practices and timing, climate, and watershed characteristics vary geographically (Gilliom and others, 2006) . Because of the geographic and temporal complexity of pesticide occurrence and concentrations, adequate monitoring of pesticide concentrations in the numerous streams in the United States that are potentially affected by pesticides is prohibitively expensive-particularly at sampling frequencies high enough to reliably estimate the necessary concentration statistics for assessing potential adverse effects on aquatic ecosystems or humans. The lack of adequate data on pesticide concentrations in most streams creates a need for tools that can be used to predict pesticide concentrations for streams that are not sufficiently monitored. Although such estimates cannot replace direct measurements when reliability requirements are high, they are useful for the initial screening-level steps of risk assessment and for efficiently guiding intensive monitoring. Larson and others (2004) , using watershed characteristics as explanatory variables, developed and applied regression models for predicting annual frequency distributions of atrazine concentrations in streams. These Watershed Regressions for Pesticides (WARP), which originated from the work of Larson and Gilliom (2001) , have been expanded to predict annual maximum and annual maximum moving-average concentrations of atrazine for 21-, 60-, and 90-day durations (Stone and others, 2008) . For streams with inadequate direct measurements of atrazine, the WARP model predictions can be used to characterize the probable values of atrazine-concentration statistics for comparison to specific water-quality benchmarks. For example, during the initial screening-level steps of risk assessment, water-quality benchmarks for evaluating potential concerns for human health or aquatic life are compared to estimated environmental concentrations, which for atrazine are represented by the various concentration statistics.\nWARP is based on empirical relations between pesticide concentrations observed at monitoring sites and selected watershed characteristics available nationally-such as pesticide use-and soil and hydrologic characteristics. The development of WARP by Larson and others (2004) was based on atrazine-use estimates that were derived for Census of Agriculture reporting years 1992 and 1997. Subsequently, annual pesticide-use estimates became available for the entire model-development period (1992) (1993) (1994) (1995) (1996) (1997) (1998) (1999) (2000) (2001) . Estimated pesticide use in a watershed is the most influential variable in the WARP models for predicting pesticide concentrations in a stream (Larson and others, 2004) . Thus, incorporation of the annual pesticide-use estimates into the WARP models was expected to enhance model performance."}, {"section_title": "Purpose and Scope", "text": "This report describes updated WARP models for predicting atrazine concentration in streams. Improvements over previous work (Larson and others, 2004; Stone and others, 2008) include the incorporation of annual atrazine-use estimates on crops and the addition of annual precipitation data as potential explanatory variables. The WARP models are based on the most complete year of observations for each of the 112 sampling sites. The updated WARP models predict atrazine concentrations for selected percentiles of the annual frequency distribution (5th, 10th, 15th, 25th, 50th, 75th, 85th, 90th, and 95th) , as well as the annual mean, annual maximum, and annual maximum moving averages (21-, 60-, and 90-day durations)."}, {"section_title": "Methods", "text": "Methods used in this study included obtaining atrazineconcentration data, estimating annual agricultural atrazine use, estimating watershed characteristics, and developing and evaluating regression models to predict atrazine-concentration statistics."}, {"section_title": "Atrazine-Concentration Data Used for Model Development and Validation", "text": "Atrazine-concentration data from the 112 sampling sites used by Larson and others (2004) and Stone and others (2008) were used in this study. The sampling-site selection is discussed in detail in Larson and others (2004) , and site locations are shown in figure 1. Data from these 112 sites were collected for the U.S. Geological Survey (USGS) National Water-Quality Assessment (NAWQA) and National Stream Quality Accounting Network (NASQAN) programs from 1992 through 2001. Sample collection for the NAWQA program followed procedures described by Shelton (1994) ; sample collection for the NASQAN Program followed protocols of the U.S. Geological Survey (1997 to present).\nModel-validation data collected from 25 sampling sites by the Water Quality Laboratory (WQL) of Heidelberg College in Tiffin, Ohio, the Acetochlor Registration Partnership (ARP), and the USGS, previously used by Larson and others (2004) and Stone and others (2008) , were also used in the present study. Information about the WQL and ARP monitoring programs is provided in Richards and Baker (1993) , Richards and others (1996) , and Acetochlor Registration Partnership (2009). Locations of model-validation sampling sites for WQL and USGS are shown in figure 1. ARP sampling sites are not shown in figure 1 because these sites are associated with drinking-water sources, which are confidential. Larson and others (2004) used 26 model-validation sites, but this study used 25 because 1 site was sampled during a year for which annual atrazine-use data were not available. The concentration statistics (annual percentiles, mean, maximum, and maximum moving averages) used in model development for the present study are the same as those used by Larson and others (2004) and Stone and others (2008) ."}, {"section_title": "Watershed Characteristics Used as Explanatory Variables", "text": "WARP models are an empirical regression approach to modeling that evaluates a large number of potential explanatory variables that could affect or indicate an influence on pesticide transport and runoff. Statistical procedures are used in the WARP model development to select explanatory variables on the basis of their ability to reproduce observed pesticide concentrations."}, {"section_title": "Estimation of Atrazine Use", "text": "Atrazine use, as expressed by the fourth-root of use intensity (amount of atrazine used in a watershed divided by the watershed area), was the most important explanatory variable for predicting atrazine concentrations in the original WARP models (Larson and others, 2004) . Atrazine-use data used in these original models were temporally static. Specifically, the atrazine use for a watershed was represented by a single value for either the 1991-94 period or the 1994-98 period (Larson and others, 2004) because actual annual atrazine-use estimates were not available. This update of the WARP models uses annual atrazine-use estimates that were made possible through obtaining proprietary annual use data from DMRKYNETEC, Inc. (DMRK).\nThe process of computing annual atrazine use in a watershed, based on county-level use estimates, followed the same methods as described in Larson and others (2004) . Areal weights of specific types of agricultural land for each county intersected by the watershed were computed. The areal weights were multiplied by county-level atrazine use on each individual agricultural land type to determine the countylevel atrazine use within the watershed for the individual land types. Total atrazine use in each watershed was estimated by summing the apportioned county-level atrazine-use estimates in the watershed.\nCounty-level estimates of atrazine use were obtained by integrating annual crop-reporting-district atrazine-use data on individual crops obtained from DMRK with annual countylevel crop acreage information from public sources (Gail Thelin, U.S. Geological Survey, written commun., 2009). Annual county-level crop acreage data were obtained from the Census of Agriculture for 1992, 1997, and 2002 and from National Agricultural Statistics Service (NASS) annual reports for years not reported by the Census of Agriculture.\nThe estimates of atrazine use derived by the methods described above represent agricultural use. There are no nationally available county-level estimates for nonagricultural use of atrazine or other pesticides. The primary use of atrazine is application to agricultural crops (Kiely and others, 2004) ; therefore, the lack of information on nonagricultural use likely has a minimal effect on the regression analysis."}, {"section_title": "Other Watershed Characteristics", "text": "The many watershed characteristics evaluated as potential explanatory variables in the WARP model development are listed in table 1. Potential explanatory variables representing land use and population, agricultural management practices, soil properties, physical watershed characteristics, weather and climate characteristics, and hydrological properties were considered. These watershed characteristics are the same used by Larson and others (2004) , with the exception of the annual precipitation characteristics and the improved annual atrazineuse intensity, which were added for this update of the WARP models. All variables considered during model development are available for the conterminous United States."}, {"section_title": "Statistical Analysis", "text": "A regression approach was used in the development of the WARP models. Statistical methods used to support the regression approach include transformations of response and explanatory variables, selection of explanatory variables, analysis of model fit, and estimation of prediction intervals."}, {"section_title": "Regression Methods", "text": "Some of the atrazine-concentration statistics computed for sites included in the regression analysis were censored at the long-term reporting level. Conventional least-squares methods for estimating parameters of the explanatory model, using either the entire sample or the subsample of uncensored observations, yield biased and inconsistent estimates when data are censored (Judge and others, 1985) . However, a tobit regression model can be used with censored observations (Judge and others, 1985; Tobin, 1958) . For this study, the parameters of the tobit regression model were estimated by using maximum likelihood methods, as described in Larson and others (2004) . Maximum likelihood methods implemented Land use and population "}, {"section_title": "AG", "text": ""}, {"section_title": "Variable Description", "text": "Weather in the survreg procedure (Therneau, 1999) in the statistical analysis program S-PLUS (Insightful Corporation, 1999) were used to estimate the parameters of the regression models.\nMeasures of goodness of fit, such as the standard deviation of the residual error (commonly referred to as the root mean square error) or the coefficient of multiple determination (R 2 ), used for conventional least-squares regression analysis, cannot be computed for the tobit regression model. The standard deviation of residual error is alternatively referred to as the \"scale parameter\" in maximum likelihood estimation. Estimates of the scale parameter from the maximum likelihood procedure provide only asymptotically unbiased estimates of the standard deviation of the residual error when estimated from sample data (Aitkin, 1981) . These estimates, on average, underestimate the true standard deviation. The bias is a function of the sample size and degree of censoring, and it is expected to be minimal for models with lower percentages of censored observations. In the remainder of this report, biased estimates of the standard deviation of residual error are referred to as \"scale\" in figures and tables. Several pseudo R 2 (pR 2 ) measures suitable for use with the tobit regression model have been proposed in the literature as alternatives to R 2 . For this study, pR 2 was calculated by using the method of Laitila (1993) . As with conventional R 2 , the pR 2 ranges from 0 to 1 and is an estimate of the proportion of the variation in the response variable explained by the regression model (0 indicates no variation explained; 1 indicates all variation is explained)."}, {"section_title": "Transformations of Response and Explanatory Variables", "text": "The maximum likelihood methods used for estimating the parameters of the regression models require that the relation between the variables be linear in the parameters and that the residual error be identically and normally distributed. Departures from these requirements can result in flawed estimates of model coefficients. One means of addressing departures from model assumptions is through transformation of either the response or the explanatory variables or both (Neter and others, 1985) .\nVarious transformations were considered to minimize departures from the requirements of the maximum likelihood methods used. The logarithm of concentration was used as the response variable throughout model development. For the explanatory variables, logarithmic, square-root, and fourthroot transformations, as well as the untransformed value, were considered during development of the regression models.\nBecause the response variable is a logarithmic transformation, concentrations predicted by the model (after retransformation) are the median concentrations expected for sites that have a given set of explanatory values, rather than the mean concentrations. Predicted concentration statistics were not adjusted for transformation bias because estimates of median values of the statistics were considered more appropriate for the purposes of this study."}, {"section_title": "Selection of Explanatory Variables", "text": "A stepwise approach was used for selection of explanatory variables to include in the regression models. The StepAIC procedure of Venables and Ripley (1999) , implemented in S-PLUS, was used for the initial selection of explanatory variables to include in the regression models. The StepAIC procedure, based on Akaike's Information Criterion (Akaike, 1974) , balances model goodness of fit with the number of parameters needed to achieve that fit. The procedure attempts to quantify the concept of model parsimony by choosing simpler models over complex ones unless a complex model substantially improves the fit of the model.\nVariable selection began with evaluation of transformations for each potential explanatory variable. The StepAIC procedure was used to evaluate each variable and its transformations together as a group. Untransformed and transformed explanatory variables were also evaluated by plotting them against the response variable to see whether the relation was approximately linear and whether residual errors were approximately identically and normally distributed. The StepAIC procedure and the plot evaluation determined whether the untransformed or transformed (logarithmic, square-root, or square) variable would be used in the explanatory variable selection process.\nVariable selection continued with 43 potential explanatory variables, too many to include in the StepAIC procedure at one time. So, groups of 12 variables were randomly selected and then evaluated with the StepAIC procedure. The random selection and evaluation of variables was repeated 1,000 times. Variables selected 100 percent of the time for all models by the StepAIC procedure were retained, and the random selection (groups of 12, including the retained variables) and StepAIC evaluation process was repeated again. Variables selected greater than 50 percent of the time by the StepAIC procedure for all repetitions were retained and typically represented less than half of the original number of explanatory variables. A subsampling, cross-validation approach was used to evaluate the remaining potential explanatory variables. The data were randomly divided into two subsamples of equal size, and the StepAIC procedure was used to evaluate the potential explanatory variables for both subsamples. The random subsampling and evaluation with the StepAIC procedure was repeated multiple times. Variables selected by the StepAIC procedure for a majority of the repetitions were retained and subjectively evaluated for reasonableness and their overall contribution to explaining the variation in atrazine-concentration statistics. In addition, potential explanatory variables not selected were individually evaluated to determine whether adding any of these variables would improve the ability of the model to explain variation in atrazine-concentration statistics without making the model overly complex. (See example in table 2.) The same explanatory variables were used in all the final models, and this approach simplifies the data requirements for application of the models. Extra consideration was given to variables selected for the 95th percentile, annual maximum, and the annual maximum moving-average models because the percentage of censored data was less for these concentration statistics than for lower-percentile concentration statistics. Coefficients of the models for the various concentration statistics were determined independently, and no constraint prevents the prediction of a concentration for a low percentile from exceeding the concentration prediction for a higher percentile. Use of the same explanatory variables in all the final models reduced how often this occurred. Statistical methods for estimating correlated models are not available for regressions with censored observations.\nInteractions between variables were not considered as potential explanatory variables because of the already large number of potential explanatory variables evaluated for the models. To have included interactions would have resulted in thousands of additional potential explanatory variables."}, {"section_title": "Analysis of Model Fit", "text": "Diagnostics for censored regression (Escobar and Meeker, 1992) available in the survreg procedure in the S-PLUS program (Insightful Corporation, 1999) were used to assess influential observations. Variance inflation factors were used for detecting the presence of multicollinearity among explanatory variables (Neter and others, 1985) . Box and whisker plots (Tukey, 1977) were used to qualitatively assess model performance ( fig. 2) . These boxplots summarize a group of data by showing a measure of central tendency (the median), the variation (interquartile range), the range (shown by the whiskers, which extend to 1.5 times the interquartile range when extreme values are present), and extreme values (lower/upper outside values shown by individual points). Boxplots were used for displaying the distribution of model residuals and comparing residuals among groups of data (for example, different regions of the country).\nComparisons between predicted concentration statistics and concentration statistics computed from observations are made frequently in the discussion of model performance. Terms used for these comparisons are defined here for clarity. Concentration statistics generated by the WARP models are referred to as \"predicted concentration statistics,\" and concentration statistics computed from observations are referred to as \"observed concentration statistics.\" Predicted concentration statistics within a factor of 10, or \"order of magnitude,\" of the observed concentration statistics are between one-tenth and 10 times the observed concentration statistic. For example, for an observed concentration statistic of 3 μg/L, predicted concentration statistics from 0.3 to 30 μg/L are within a factor of 10 of the observed concentration statistic; predicted concentration statistics from 0.6 to 15 μg/L are within a factor of 5. "}, {"section_title": "Estimation of Prediction Intervals", "text": "Prediction intervals were approximated by using normal theory and the t-distribution; that is, methods for ordinary least square regression were used, but these methods yield only approximate results when applied to censored data. The standard errors were estimated from the maximum likelihood scale parameter by use of the adjustment suggested by Aitkin (1981)."}, {"section_title": "Atrazine Models", "text": "The models for the selected percentiles, the annual mean, the annual maximum, and the annual maximum moving-average atrazine-concentration statistics have the form:\n( 1) where UI is the atrazine-use intensity, annual agricultural use in the watershed (kilograms) divided by watershed area (square kilometers); PMJN is the total precipitation during May and June of the year of sampling (millimeters); K is the soil erodibility factor (K-factor) from Universal Soil Loss Equation (USLE); WA is the watershed area (square kilometers); R is the rainfall erosivity factor (R-factor) from USLE; and PERDUN is the percentage of streamflow due to Dunne overland flow.\nStatistics for all models are given in table 3. Regression coefficients and statistics were based on model fit using tobit regression. Values of pR 2 ranged from 0.63 for the 5th percentile model to 0.82 for the annual mean model, meaning that the models accounted for 63 to 82 percent of the variability in the concentration statistics among the 112 sites used for model development. Concentration statistics predicted by these models represent the expected median value of the concentration statistic for all sites with the same values for the explanatory variables. Larson and others (2004) found that fourth-root of atrazine-use intensity in the watershed, as the fourth-root transformation, was the most important explanatory variable in the original WARP models. The same is true in the present update of the WARP models. Models using just (UI) 1/4 as Total precipitation during May and June of the year of sampling (PMJN) is significant (p<0.05) in the higher percentile, annual mean, annual maximum, and annual maximum moving-average models (table 3) . For the majority of sites, the months of April through June include the highest atrazine application period. High precipitation during May and June, after atrazine application, increases atrazine runoff to streams. This increase is consistent with the positive coefficient observed for PMJN in all models."}, {"section_title": "Analysis of Significant Explanatory Variables", "text": "Soil erodibility factor (K-factor) is significant (p<0.05) in all the models except for the 5th-, 10th-, and 25th-percentile models (table 3). The coefficient for K-factor is positive in all models. The K-factor is an index that indicates the susceptibility of soil to erosion (Brooks and others, 1991) . The positive coefficient for K-factor in the regression models implies that more runoff of atrazine occurs in areas susceptible to soil erosion. As discussed in Larson and others (2004) , this does not mean that atrazine is being transported on eroded soil particles, because atrazine is primarily transported in the dissolved phase in runoff water. The positive relation between K-factor and atrazine concentrations in the stream may indicate that areas with high K-factor soils have a relatively high potential for the formation of runoff during precipitation, resulting in an increased potential for transport of atrazine from application areas to streams.\nWatershed area, as the square-root transformation, was significant (p<0.05) in all models except for the 5th-and 10th-percentile, annual maximum, and annual maximum 21-day moving-average models (table 3). The coefficient for watershed area was positive in all models. Larson and Gilliom (2001) listed three factors that may contribute to the positive relation between watershed area and atrazine concentration in streams. First, the contribution of water from multiple small streams to a large river can result in elevated concentrations that are sustained for a longer time than in the individual streams because the timing of pesticide application and subsequent runoff can vary among the individual streams. Second, in some small streams, the highest concentrations may not have been sampled because concentrations of pesticides may remain elevated for relatively short periods. The computed concentration statistics for the higher percentiles and annual maximum for these small streams may be biased low, further strengthening the positive relation between watershed area and concentration reflected in the coefficients for the watershed-area variable in the regression models. Third, for some streams with large watersheds, pesticide use is concentrated in a relatively small farmed area of the watershed, wheras the remainder of the watershed is largely untreated. The use-intensity value for these watersheds may be relatively low, despite high use in the farmed areas. It is likely that more water is contributed to the stream through runoff from the farmed areas than from nonagricultural areas, especially in arid regions where crops are irrigated. For these cases, the watershed-area variable may act as a correction factor, accounting for the high concentrations in these streams despite relatively low use-intensity values for the watersheds as a whole (Larson and others, 2004) .\nRainfall erosivity (R-factor), as the logarithm transformation, was significant (p<0.05) in all models except for the 5th-and 10th-percentile models (table 3) . The coefficient for R-factor was positive in all models. The R-factor is an index that characterizes the energy of storms in a specific area, averaged over a number of years (Brooks and others, 1991) . The positive coefficient implies that more runoff of atrazine occurs in areas of high-energy rainstorms.\nPercent Dunne overland flow (PERDUN) was significant (p<0.05) in all the models (table 3). The coefficient for PER-DUN was negative in all models. PERDUN is the percentage of streamflow generated by overland flow from precipitation falling on saturated soils (Dunne overland flow). The negative coefficient for PERDUN implies that atrazine concentrations were lower in areas where Dunne overland flow contributions to streamflow were high. Generally, near-stream lowland and wetland areas that quickly become saturated contribute more Dunne overland flow to streams than areas that are well drained. Lowland and wetland areas are less likely to be cropped and less likely to have been treated with atrazine. Dunne overland flow may be a source of relatively atrazinefree water and may act to dilute concentrations of atrazine in streams that receive a higher percentage of Dunne overland flow (Larson and Gilliom, 2001 )."}, {"section_title": "Model Performance", "text": "The discussion, tables, and figures describing model performance in this report are for the 95th-percentile, annual mean, annual maximum, and annual maximum 21-, 60-, and 90-day moving-average WARP models. Model performance was evaluated by assessment of (1) goodness of fit and residual errors for the model-development sites, (2) residual errors for the model-validation sites, and (3) uncertainty in model predictions. Each is described below."}, {"section_title": "Model-Development Sites", "text": "Regression-model results for the model-development sites are shown in figure 3 . For the models shown, most of the predicted concentration statistics are within a factor of 10 of the observed concentration statistics at the development sites.\nResidual errors were calculated by subtracting the predicted concentration statistics from the observed concentration statistics; therefore, residual errors less than zero indicate overprediction of the concentration statistic, and residual errors greater than zero indicate underprediction. A residual error of zero indicates exact agreement, and residuals of -1 and +1 indicate that the prediction for a given site was 10 times and one-tenth of the observed concentration statistic, respectively. Boxplots of the residual errors from the models show the performance of the models with respect to watershed area ( fig. 4 ) and geographic region ( fig. 5 ) of the model-development sites.\nPredictions of atrazine-concentration statistics are not substantially biased with respect to watershed area, as indicated by figure 4. For this plot, watershed areas of the 112 model-development sites were divided into quintiles (that is, the first quintile contains the smallest 20 percent of watershed areas, the second quintile contains the second smallest 20 percent, and so on). Residual errors are similar for all five groups, which together cover more than five orders of magnitude in watershed area (17 to 2,965,000 km 2 ). Predictions of atrazine-concentration statistics have no substantial regional bias, as indicated by figure 5. The regional groupings used for this plot were based on the U.S. Department of Agriculture Farm Resource Regions (U.S. Department of Agriculture, 2000), which categorized agricultural regions of the conterminous United States on the basis of climate, topography, soil types, and dominant agricultural activities. The nine Farm Resource Regions were consolidated into five regions for the present study ( fig. 6 ) so that each region would have sufficient sites for the computation of statistics summarizing model fit."}, {"section_title": "Model-Validation Sites", "text": "The selected models were applied to concentration data from the 25 validation sites, and plots of the predictions for these sites are shown in figure 7. Predicted concentration statistics from the selected models are within a factor of 10 of the observed concentration statistics for most of the sites.\nThe updated WARP model predictions for the validation sites are not substantially biased ( fig. 8 ), even though predictions from the previous WARP models were biased low for most of the validation sites (Larson and others, 2004; Stone and others, 2008) . The incorporation of the annual atrazine-use estimates and the PMJN explanatory variable into the WARP models appears to have reduced the low prediction bias seen with application of the previous WARP models to the validation-site data."}, {"section_title": "Uncertainty in Model Predictions", "text": "Uncertainty in the prediction of a concentration statistic can be expressed in terms of a prediction interval (PI) for a specified confidence level-the confidence level used in this study is 95 percent. Conceptually, each predicted concentration statistic is the median estimate of the particular concentration statistic (percentiles, annual mean, annual maximum, and annual maximum moving averages) for all the stream sites that have the same combination of values for the explanatory variables. The PI is the range of values for a concentration statistic within which 95 percent of the actual concentration-statistic values are expected to occur for all stream sites with the same values of explanatory variables. In addition, the PI can be interpreted as the range within which the actual concentration statistic for an individual site and year is expected to fall 95 percent of the time.\nThe PIs for the selected models are shown as green lines in figure 3 . Concentration statistics are expressed as logarithms, resulting in symmetrical intervals for the PI. (The high and low bounds of the intervals are the same distance from the predicted value.) However, expressing the concentration statistics as logarithms obscures the fact that the intervals are skewed-the upper part of the PI interval covers a wider range of values than the lower part. Comparison of the PIs (green lines) to the predicted concentration statistics within a factor of 10 of the observed concentration statistics (red lines) shows that the PIs are largest for the annual maximum model and smallest (PIs less than a factor of 10) for the annual mean model ( fig. 3) . The PI is a function of the fit of the model and the amount of variability explained by the model. The annual mean model has a better model fit and explains more variability (scale = 0.40; pR 2 = 0.82) than the annual maximum model does (scale = 0.54; pR 2 = 0.76). The levels of uncertainty for the 95th-percentile, annual mean, annual maximum, and annual maximum movingaverage (21-, 60-, and 90-day) models are compared in figure  9 . PI size is represented as the ratio of the upper boundary of the interval to the predicted concentration statistic. (This is the same as the ratio of the predicted concentration statistic to the lower boundary of the interval.) The extreme values (shown as asterisks) represent the same sites in each model, which have one or more explanatory variables that are relatively extreme in value when compared to values for the rest of the sites. For example, the highest ratio for each of the models, shown by highest asterisks in each boxplot, is for the Mississippi River at St. Francisville, La., which has a watershed area far greater than the rest of the sites. PIs for the annual maximum model extend to a factor of about 13 to 14 above and below the predicted annual maximum concentration statistic for most sites, whereas PIs for all other models extend to a factor of only 7 to 11. Annual maximum 90-day moving average A l l d a t a N = 1 1 2 Q u i n t i l e 1 N = 2 2 Q u i n t i l e 2 N = 2 3 Q u i n t i l e 3 N = 2 2 Q u i n t i l e 4 N = 2 3 Q u i n t i l e 5 N = 2 2 LOGARITHM OF THE OBSERVED CONCENTRATION STATISTIC MINUS LOGARITHM OF PREDICTED CONCENTRATION STATISTIC Annual maximum 60-day moving average "}, {"section_title": "Comparison to Previous WARP Models", "text": "The updated WARP models include the same five explanatory variables and transformations that were used in the original WARP models: use intensity, K-factor, watershed area, R-factor, and percentage of streamflow from Dunne overland flow. However, the atrazine-use-intensity variable in the updated WARP model is now based on annual atrazine-use estimates rather than estimates for 1992 or 1997. The updated WARP models also include a sixth explanatory variable, total precipitation during May and June of the year of sampling. Addition of this sixth explanatory variable explains more variability without making the models overly complex. "}, {"section_title": "RATIO OF UPPER BOUNDARY OF PREDICTION INTERVAL TO PREDICTED ATRAZINE CONCENTRATION STATISTIC", "text": "Model performance values (pR 2 and scale parameter) for the 5th-percentile updated WARP model and the previous WARP model are comparable. However, the updated models for the other atrazine-concentration statistics show improvement over the previous WARP models in terms of pR 2 and the scale parameter (table 4) .\nDifferences in model performance between the updated and previous WARP models can be seen in terms of their residual errors, as shown in figure 10 . The updated WARP models generally have a smaller variation (interquartile range shown by the box) and range (shown by the whiskers) of residual errors than the previous WARP models."}, {"section_title": "Model Limitations", "text": "Use of the regression models for predicting atrazine-concentration statistics, and the WARP methodology in general, are subject to several limitations that are important to consider when applying the models.\n1. The sampling frequencies of the model-development sites were not sufficient to reliably characterize the highest concentrations during a year. Thus, application of the models to predict the annual maximum concentration is expected to underpredict the actual annual maximums.\n2. The regression models are designed for prediction of atrazine-concentration statistics for streams of the conterminous United States. Although the 112 sites used for model development represent a wide variety of environmental settings and a large range of watershed areas, it is likely that other watersheds within the United States have one or more characteristics outside the ranges of the watershed parameters used to develop the models. Application of the models to streams draining such watersheds would result in increased uncertainty in predicted concentrations.\n3. The models were developed by using concentration data from streams. Application of the models to lakes or reservoirs will result in biased predictions because of the influence of water storage on the temporal distribution of concentrations.\n4. The atrazine-use data used in the models are estimates for applications to agricultural land only. Substantial nonagricultural use of atrazine in a watershed could result in underprediction of atrazine concentrations in a stream, if such use cannot be estimated. Table 4 . Comparison of updated WARP models to previous WARP models.\n[WARP, Watershed Regression for Pesticides; MA, moving average ; Pseudo R-square, R-squared value for tobit regression; Scale, tobit regression analogue of the root mean squared error obtained from ordinary least squares regression. Previous WARP pseudo R-square and scale values were obtained from Larson and others (2004) and Stone and others (2008 "}, {"section_title": "Summary and Conclusions", "text": "Regression models were developed for predicting selected percentiles (5th, 10th, 15th, 25th,50th, 75th, 85th, 90th , and 95th), annual mean, annual maximum, and annual maximum moving-average (21-, 60-, and 90-day) atrazineconcentration statistics for streams, using nationally available data on watershed characteristics and atrazine use. Concentration statistic predictions generated by these models can be used to characterize the levels of atrazine for comparison to specific water-quality benchmarks for evaluation of potential concerns regarding human health and aquatic life.\nSeparate models were developed for the selected percentiles, annual mean, annual maximum, and the annual maximum moving-average concentration statistics. The updated WARP models include the same five explanatory variables and transformations that were used in the original WARP models. The updated WARP models also include a sixth explanatory variable, total precipitation during May and June of the year of sampling. Comparison of pR 2 , scale parameter, and residual errors between the updated WARP models and previous WARP models show better model performance for the updated models.\nThe models accounted for 63 to 82 percent of the variability in concentration statistics among the 112 sites used for model development. Uncertainty in predicted concentration statistics was expressed in terms of prediction intervals. For the 95th percentile, annual mean, annual maximum, and annual maximum moving-average (21-, 60-, and 90-day) models, 95-percent prediction intervals extend to a factor of 7 to 14 above and below the predicted concentration statistic in most cases.\nResults for the 25 model validation sites with the 95th percentile, annual mean, annual maximum, and annual maximum moving-average (21-, 60-, and 90-day) models show that concentration statistics were predicted within a factor of 10 of the observed concentration statistics in nearly all cases. The updated WARP models show no substantial bias for the validation sites, an improvement over the previous WARP models that showed a low bias for the same validation sites.\nAdequate monitoring of pesticide concentrations in the numerous streams in the United States is prohibitively expensive, particularly for sampling frequencies that are high enough to reliably estimate the concentrations statistics needed for risk assessments. The WARP models are tools for predicting pesticide concentrations in unmonitored or inadequately monitored streams. Overall, performance of the models for the development and validation sites supports the application of the WARP models for predicting atrazine concentrations in streams and provides a framework to interpret the predictions in terms of uncertainty. For streams where direct measurements of atrazine are lacking, the WARP model predictions for atrazine concentrations can be used to characterize the probable levels of atrazine for comparison to specific water-quality benchmarks."}]