[{"section_title": "Abstract", "text": "In September 2013, 2248 students from 36 junior high schools in Shaanxi Province underwent assessment of visual acuity (VA), completed a questionnaire about their spectacle use and were administered a standardized mathematics examination. Among 2,248 students (mean age 13.6 years, 52% male), visual impairment was present in 699 (31%, 95% Confidence Interval 29-33%). Spectacle wear was observed in 360 of 966 children needing glasses (37%). Ownership of spectacles among children needing glasses was associated with poorer uncorrected vision in the better-seeing eye (P <0.001) and paternal educational (p=0.001), but not age, sex, boarding at school, both parents having out-migrated for work or maternal education. Spectacle ownership among children with visual impairment was associated with better test performance (P=0.035). Therefore, visual impairment and non-wear of spectacle were common. Wearing spectacles was associated with better academic performance in this cross-sectional analysis, consistent with recent trial results among younger children."}, {"section_title": "Introduction", "text": "In both rural and urban areas of China, the prevalence of visual impairment due to refractive error among children is high, 1,2 and rises with age. 3 Despite the ease and safety of correcting refractive error with prescription eyeglasses, a significant proportion of rural children needing spectacles in China neither own nor wear them. [4] [5] [6] [7] Many previous reports on refractive error prevalence among Chinese children are either rely on samples from limited areas or employ unclear sampling methodology. 5 A small number of studies have sampled western rural areas, but have focused on primary schools students. 5, 8 To our knowledge there has not been a large, population-based study of visual impairment among secondary school students in western China, home to approximately 15 million 13 to 15 year-olds. 9 Uncorrected refractive error has been associated with reversible decrement in self-reported visual function among school-aged children. 10 In addition, two recent randomized, controlled trial have demonstrated statistically significant improvement in academic performance with provision of free spectacles. 11, 12 However, data linking spectacle ownership/wear and school performance remain sparse, particularly in the large populations of Asia, where rates of uncorrected refractive error are high. [13] [14] [15] Factors determining the purchase and wear of spectacles are also not well understood.\nWe report on the results of a study of visual impairment, spectacle wear and academic performance in a randomly sampled population of junior high school students in Shaanxi, a middle-income province 9 in western China."}, {"section_title": "Methods", "text": "The protocol for this study was approved in full by Institutional Review Boards at Stanford University (Palo Alto, USA, No.24847). Permission was received from the local Board of Education and the principals of all schools involved. The principles of the Declaration of Helsinki were followed throughout."}, {"section_title": "Sampling", "text": "In September-October 2013, a list of all 36 rural junior high schools in three randomly selected counties (Yuyang, Hengshan and Jingbian) in Yulin prefecture was obtained, and all children in one randomly-selected class in each of the 7 th and 8 th grades were enumerated."}, {"section_title": "Questionnaires", "text": "Enumerators (trained graduate students from Shaanxi Normal University) administered a questionnaire to collect information on student and family characteristics, including grade level, sex, boarding status at school, and parental schooling and migration status. The same team also administered a timed (25 minutes) and proctored mathematics examination to all students in the selected classes. Items were selected with the help of local educators from a bank of questions developed by the Trends in International Mathematics and Science Study (TIMSS) testing service. 16 Mathematics was chosen for testing to reduce the effect of home learning on performance and better focus on classroom learning. Children were defined as having spectacles if they were able to produce them when asked, having previously been told to bring them to school that day."}, {"section_title": "Visual acuity (VA) assessment", "text": "Children underwent VA screening by a local team of one nurse and one staff assistant who had previously been trained by optometrists and ophthalmologists from ZOC. Visual acuity was tested separately for each eye at a distance of 4 meters using Early Treatment Diabetic Retinopathy Study (ETDRS) 17 tumbling E charts (Precision Vision, La Salle, Illinois) in a well-lighted, indoor area of each school. Visual acuity was measured without refractive correction for all children, and with habitually-worn correction for those children having eyeglasses.\nEach child started testing from the 6/60 line. If the orientation of at least four of the five optotypes was correctly identified, the child was next examined on the 6/30 line.\nIf one or no optotypes were missed, testing continued at 6/15 and proceeded line by line to 6/6. In case of failure to correctly identify 4 or more optotypes on a line, the line immediately above was tested until the child identified at least four of the five optotypes on a single line. The lowest line read successfully was recorded as the VA for the eye undergoing testing. If the top line could not be read correctly at a distance of 4 meters, the subject was directed to stand at 1 meter from the chart, and to read it as outlined above. In this case, the VA recorded was divided by 4.\nVisual impairment (VI) was defined as presenting VA <= 6/12 in the better eye, and was stratified into mild (presenting VA <=6/12 to 6/18 in the better-seeing eye), moderate (<6/18 to 6/60) and severe (<6/60 ) according to categories proposed in the WHO International Statistical Classification of Disease 10 th Revision (ICD10). 18 "}, {"section_title": "Statistical Methods", "text": "We used log of the Minimum Angle of Resolution (logMAR) to denote VA . An increase of 0.1 logMAR units indicates a decrease of one line on an ETDRS chart. A higher logMAR value is indicative of worse vision. 19 We compared various potential predictors of visual impairment in simple and multiple regression analyses. To explore the association between visual impairment and children's scores on the standardized math test, we employed parametric Ordinary Least Squares regression methods. Regression models controlled for age, sex, spectacle ownership, boarding status, home county, parental education, and parental migration status. In order to explore potential factors determining ownership of spectacles, we employed Ordinary Least Square models including age, sex, uncorrected VA, boarding status, home county, parental education, parental migration status, including only students with uncorrected visual acuity <= 6/12 in the better-seeing eye that could be improved to >= 6/9 in at least one eye with glasses."}, {"section_title": "Results", "text": "Among 2248 students undergoing vision screening (48% girls, mean age 13.6 +/-1.1years), 100% completed vision screening, mathematics testing and all questionnaires.\nVI was present in 699 (31.1%; Table 1 ). Female sex (P < 0.001), older age (P = 0.05) home residence of Hengshan county, higher levels of maternal education (P = 0.006) and parental out-migration for work were associated with any VI, while boarding at school and paternal education level were not ( Table 1) ."}, {"section_title": "INSERT TABLE 1 HERE", "text": "Among children with poor uncorrected vision, 360 (37%) were observed owning spectacles. In simple regression models, uncorrected VA (P < 0.001), home residence in Hengshan county (P < 0.0001), home residence in Jingbian county (P < 0.0001) were associated with wearing spectacles (Table 2) . Age, male sex, boarding status, maternal education, paternal education, and parental migration status were un-associated with spectacle wear in the simple or multiple models ( Table 2 )."}, {"section_title": "INSERT TABLE 2 HERE", "text": "In multiple regression models of score on the mathematics examination, younger age (-0.227 SD, 95% Confidence Interval [CI] -0.283, -0.171, P < 0.001), wearing spectacles (0.147 SD, 95% CI 0.007, 0.288 P = 0.04), boarding at school (0.144 SD, 95% CI 0.003, 0.286 P = 0.05) and home residence in Hengshan county (0.217 SD, 95% CI 0.059, 0.374 P = 0.01) were associated with better scores, while paternal education, VA and sex were not (Table 3) ."}, {"section_title": "INSERT TABLE 3 HERE", "text": ""}, {"section_title": "Discussion", "text": "Only about 37% of secondary school children needing glasses in this rural, western China cohort were wearing them, which is consistent with studies from other regions in China showing high rates of unmet need among rural children. 8, 20 In a study conducted in the same region, 15% of elementary school children needing glasses were observed wearing them. 8 Unfortunately, data on the reasons for non-wear are not available from the current study, but a possible reason for the lower rates of spectacle use among younger children with refractive error is the well-documented and widespread belief in China that spectacle wear will harm the vision of young children. 3, 21, 22 This view appears to be particularly strongly-held with respect to younger children, perhaps explaining the lower rates of wear among primary 8 versus middle school children using the identical protocol in nearby areas of western China. A recent large trial has in fact shown spectacle wear to be protective of, rather than harmful to children's vision, 23 but the belief remains pervasive, and is focused principally on the youngest children. Our finding that wear of spectacles was highest in children with the most severe levels of uncorrected VA is also consistent with previous studies, though also as previously noted, 3, 24 rates of wear are from ideal.\nThese low rates of wear among visually impaired children is of particular concern in view of recent trial evidence that the provision of spectacles can significantly improve educational outcomes. 11, 12 Our finding in the current study that children owning spectacles had better performance on a study-specific mathematics test are consistent with this result, and with most, 13, 25 but not all 26 of the limited previous non-trial data.\nThe difference in scores between children having uncorrected VA <= 6/12 in the better-seeing eye with and without spectacles in the current study (0.147 SD) was greater than the observed effect of parental education on math test score outcome, and is the equivalent to roughly a semester of additional learning. 27 The significantly higher scores seen among younger children in each grade may reflect the fact that older children have been held back for poor school performance.\nIn the context of a cross-sectional, uncontrolled study such as the current investigation, we cannot exclude the possibility that the association between spectacle wear and learning could have been confounded by other factors, such as myopia or socio-economic status. Regarding the former, our data show that children with worse uncorrected VA (principally due to myopia in this setting) were more likely to wear spectacles, and myopia is also known to be associated with academic accomplishment. 28 Similarly, higher socioeconomic status would be expected to be associated with greater likelihood of spectacle purchase, and has also been linked with academic accomplishment. 29 Unfortunately, we did not collect data on either refractive error or socioeconomic status that might have allowed us to explore and adjust for such possible confounding.\nThese results have a clear message for program planners: much work remains to be done to improve wear of spectacles among rural Chinese children with refractive error, and the visual burden among those without spectacles is quite significant.\nEducational interventions directed at children, teachers and parents, and explaining the safety and value of spectacle wear have shown rather limited 5 or no 30 success in increasing rates of wear in recent randomized trials in China. Conversely, provision of free spectacles has recently been shown to double rates of both observed and self-reported wear in randomized trials. 11, 12 The educational benefits of spectacle wear in the classroom underscores the need for sustainable strategies to remove barriers to ownership and wear of spectacles.\nStrengths of the current study include randomized population sampling, careful duplication of previously-utilized protocols and equipment 4 in order to measure rates of wear for different age groups in a rural population, and our having administered a study-specific test in order to assess the impact of spectacle wear on education, as has been rarely done. The most obvious weakness of the current report is its cross-sectional design, making it difficult to elucidate with certainty the direction of any causal association between spectacle wear and educational outcomes. Further, we did not collect data on myopia and socio-economic status which might have allowed us to exclude these as sources of confounding in the observed relationship between spectacle wear and test outcomes. Finally, all of these schools were selected from a single prefecture in rural western China; hence application of these results to other settings must be made with caution.\nDespite these limitations, results from this study provide further evidence of an association between spectacle wear and academic performance, as well as suggestive evidence of important differences in rates of spectacle wear between age groups in rural\nChina. Both of these findings are of potential importance to program planners in formulating strategies to alleviate the burden of uncorrected myopia in rural China. Note: a logMAR is based on presenting VA in this table."}]