[{"section_title": "Abstract", "text": "The early days of the field of medical image computing (MIC) and computerassisted intervention (CAI), when publishing a strong self-contained methodological algorithm was enough to produce impact, are over. As a community, we now have substantial responsibility to translate our scientific progresses into improved patient care. In the field of computer-assisted interventions, the emphasis is also shifting from the mere use of well-known established imaging modalities and position trackers to the design and combination of innovative sensing, elaborate computational models and fine-grained clinical workflow analysis to create devices with unprecedented capabilities. The barriers to translating such devices in the complex and understandably heavily regulated surgical and interventional environment can seem daunting. Whether we leave the translation task mostly to our industrial partners or welcome, as researchers, an important share of it is up to us. We argue that embracing the complexity of surgical and interventional sciences is mandatory to the evolution of the field. Being able to do so requires large-scale infrastructure and a critical mass of expertise that very few research centres have. In this paper, we emphasise the need for a holistic approach to computer-assisted interventions where clinical, scientific, engineering and regulatory expertise are combined as a means of moving towards clinical im- * Corresponding author Email addresses: s.ourselin@ucl.ac.uk (Sébastien Ourselin), m.emberton@ucl.ac.uk (Mark Emberton), t.vercauteren@ucl.ac.uk (Tom Vercauteren)"}, {"section_title": "", "text": "pact. To ensure that the breadth of infrastructure and expertise required for translational computer-assisted intervention research does not lead to a situation where the field advances only thanks to a handful of exceptionally large research centres, we also advocate that solutions need to be designed to lower the barriers to entry. Inspired by fields such as particle physics and astronomy, we claim that centralised very large innovation centres with state of the art technology and health technology assessment capabilities backed by core support staff and open interoperability standards need to be accessible to the wider computer-assisted intervention research community.\nKeywords: Computer-assisted intervention; valley of death; medical devices; health technology assessment"}, {"section_title": "The need for clinical impact in CAI research", "text": "Whether we like it or not, researchers, clinicians and funders are becoming very much impact driven. In the healthcare domain, articulating societal impact through a scientific and technology-focused research programme is challenging. However, making research matter by, showing a strong focus on a clinical area and, eventually demonstrating an improvement in patient care, is much easier. As such, we believe that the future of computer-assisted intervention (CAI) will be driven by the need for clinical impact. With this in mind, it is important to rely on efficient means of translating research into the clinic that also allow us to reach for scientific excellence."}, {"section_title": "The challenge of translation", "text": "The impact that CAI already had in clinical practice is undeniable. Surgical and interventional sciences (SIS) have historically been guided only by direct vision and touch. SIS have been and still are undergoing a paradigm shift as new technologies for data fusion, tool tracking, intra-operative imaging and sensing are introduced. Image-guided intervention (IGI) and computerassisted intervention have already enabled greater surgical precision, resulting in reduced tissue trauma, co-morbidity and complications, in addition to shortened procedures and hospital stays.\nHowever, far too little CAI research has reached the clinic, despite initial CAI systems appearing over 20 years ago. One major reason for this, is the substantial infrastructure and breadth of expertise required to design, implement and validate complete clinical-grade systems. Currently, many scientific and technological developments are being pursued across a disparate group of research laboratories highly specialised in a limited number of engineering and clinical areas. The barriers to translation arising from the heavily regulated clinical environment, the cost of the required infrastructure and the lack of open interfaces and interoperability standards among interventional devices are enormous. We believe that having a very broad set of relevant skills and know-how as illustrated in Fig. 1 (scientific expertise; clinical expertise; quality and regulatory affairs; good manufacturing practices; scalable engineering implementation; clinical trials; health economics; technology transfer) in large unified centres open to the broad research community will be key to go beyond these barriers and develop disruptive interventional systems that can be transferred to industry and become clinical standard of care."}, {"section_title": "Broadening the scope of the research field", "text": "Optimal clinical outcomes by contemporary CAI systems are hindered by predominant reliance on anatomical images, insufficient integration with innovative sensing, actuation and therapeutic devices as well as challenging demands in terms of skilful equipment handling and data interpretation. The potential to broaden the focus of CAI research and go beyond these limitations is there though. Existing CAI systems make suboptimal use of the large amount of data generated before and during interventions. Few, if any, clinically available systems effectively combine pre-and intra-operative imaging and information despite computational tools having the potential robustness and accuracy to carry out this task. Current surgical instruments and intra-operative imaging and sensing devices do not fully exploit physiologic and pathologic tissue responses and only a very limited subset have been integrated in CAI systems. There is also significant untapped potential to optimise the surgical environment by increasing the consideration and management of interactions between the multiple devices and software solutions present in the interventional suite.\nIt is our opinion that pathologically, anatomically and physiologically optimal surgery can be achieved by combining diagnostic-quality imaging and sensing with ergonomic smart instruments. Anatomical cues, which have been driving interventional therapies for centuries, will eventually be augmented by physiological and pathological insights."}, {"section_title": "Infrastructure to overcome the translation barriers", "text": "The paucity of translated CAI research can be explained by the existing gap between where the research typically ends and the level of development and validation that the industry requires to invest in the commercialisation of an innovative technology with a bearable risk. Waiting for the industry to fill the gap is certainly utopian. Furthermore, injecting more funding at a project level is probably not the most efficient and cost-effective means of crossing the proverbial MedTech's \"Valley of Death\".\nLarge-scale academic translational research platforms endowed with highlytrained, multidisciplinary teams could underpin several projects and act as a conduit to: demonstrate impact in clinical trials up to phase-III; improve translational success rate; shorten bench-to-bedside time; increase technology transfer through spin-off creation and licensing agreements.\nTo be succesful, these translational platforms need to embrace the complexity of surgical and interventional sciences. The CAI community need to go beyond animal experiments and push for strong Health Technology Assessment (HTA) programmes that focus on evaluating the clinical impact of the developed technology. To this end, the translational platforms undoubtedly need to be associated with major teaching and research hospitals but also need to create international networks where technology developed in one centre can be clinically evaluated in another centre. System integration for CAI hardware and software devices need to be designed with modularity and interoperability in mind to ensure we capitalise on previous developments.\nAgile Quality Management Systems (QMS) need to be designed to take into account the specific needs of the CAI researchers but ensure the safety of the devices that are translated to the clinic and lower the barrier of technology transfer."}, {"section_title": "Stronger Health Technology Assessment", "text": "Translational platforms will provide the required infrastructure to translate clinically effective and affordable innovation to the bedside. They will foster an ecosystem of projects focusing on key scientific, technological or clinical questions. The platform will raise the quality of the research deliverables to clinical standards which will allow for the evaluation of the clinical relevance of a proposed device.\nWith sufficient trust in the development process of the devices in the translational plateform, each plateform will be able to engage with other international centres to set up multi-institutional HTA projects and assess the clinical impact of the most promising innovative interventional systems.\nEven with adequate resources, translating interventional devices into clinical applications and evaluating their potential patient benefit is a complex task given the regulations controlling introduction of novel devices into the operating theatre or interventional suite. To streamline the HTA ambition and initiate small and large clinical studies and trials, the platforms will need to leverage strong system integration capabilities and rely on robust quality management. This will enable the completion of robust clinical trials applications including compliant technical files and provide the necessary trust among the network of translational plateforms.\nBy performing stronger clinical evaluation of disruptive CAI technology, not only will we increase the clinical impact but also will we learn more about what really matters to the clinicians and also will we make the technology much more attractive to potential commercial partners by making the commercialisation risks much more supportable."}, {"section_title": "Modular System Integration", "text": "One of the key challenges of translating a medical device out of a research lab into an interventional suite is that of integration within the interventional workflow. Many research projects fail to reach this maturity, especially for complex interventions requiring manipulation, dissection, and navigation through soft, deformable tissue using a large variety of different tools. This is because many research groups approach it from a scientific and technological perspective, solving a single piece of the puzzle, and do not have a long-term strategic system integration plan.\nFrom a platform perspective, several technological challenges that are often overlooked in CAI research actually manifest as clinical-translation roadblocks. The common characteristics of these challenges revolve around (a) lacklustre clinician experience stemming from inappropriate workflow integration, tool interaction, form factor and interface design, (b) inability to implement research tools in theatres due to a lack of a common scalable platform to interact with interventional clinical data sources and tools, (c) stringent data security and management requirements, (d) lack of devicedesign iterations and adherence to quality management standards throughout the design lifecycle, (e) poor understanding of sterilisation and device safety requirements. To successfully translate novel algorithms and devices without incurring massive redevelopment costs, all these issues need to be addressed in advance and in a holistic fashion.\nExperienced system integration teams working within a quality management framework is a cornerstone of the translational platforms we envision. They will need to leverage Design Thinking approaches (Yock et al., 2015) at an early stage in the development of the research to deliver lightweight ergonomic user interfaces, robust and scalable modular systems supporting both hardware and software innovations, secure patient data handling and safe hardware components.\nInteroperability standards need to be extended past imaging file format. The DICOM Working Group 24 (WG24) has been established to develop DICOM objects and services related to image-guided interventions (Treichel et al., 2012) but interoperability questions need to receive more attention from the CAI research community in order to move the field towards vendorneutral interfaces to control interventional devices. Common interfaces for plug-and-play integration of a broad set of innovative devices that deliver anatomical, physiological and pathological data or perform tissue manipulation are needed. Interaction between scientists and hardware/software system integration research engineers will allow for robust systems that operate as intended, are user-proof, fail gracefully, and easily integrate in clinics."}, {"section_title": "Agile Quality Management", "text": "Medical devices are subject to increasingly stringent regulations to ensure safety and clinical efficacy. The costs associated with developing a regulatory compliant product from prototypes developed without proper quality management (as common in the academic research setting) are often substantial. Effective and efficient transfer between academic researchers and commercial parties is frequently logistically difficult and time-consuming. Moreover, clinical studies to provide high-quality supporting data on clinical efficacy are also essential, but are typically highly resource-intensive, expensive, and rely on partnerships with clinical research teams that SMEs, which constitute a large proportion of the medical device sector, are usually unable to support. All of these factors present substantial barriers to translating technologies up to clinical adoption.\nOur vision is that of a sustainable pipeline that enables early stage technology stemming from CAI research to be further developed into verifiably safe medical devices that are ready for large-scale HTA and that can be efficiently transferred to commercial parties. To realise this pipeline and address the above issues, resources to support the development of medical devices (including both hardware and software) in an agile QMS respectful of both research needs and internationally recognised best development practice are needed. The primary benefits of implementing an agile QMS are the ability to accelerate and reduce the risk of clinical translation by providing a formalised framework for medical technology development that is much closer to that adopted in industry. This will also lead to a substantial increase in the commercial value of CAI research. Finally, clinical evaluation as part of a development process that is mindful of regulatory compliance will strengthen the links between scientists, engineers and clinicians. An agile QMS will also support the implementation of robust clinical data systems that enable tracking of real patient outcomes, which is key to clinical efficacy assessment.\nTo be of further benefit, an agile QMS will need to work in close interaction with other regulatory compliant entities, including existing certified QMSs in industry, to ensure that technology transfer to commercial parties can indeed happen efficiently. The rationale is to significantly reduce the need for, and burden of, re-engineering device/system prototypes developed as part of academic research into a regulatory-compliant clinical prototype or commercial product. This will also require the implementation of robust processes for evaluating the technical merits and regulatory risks associated with CAI research technology."}, {"section_title": "Creating large-scale open CAI research infrastructures", "text": "We have made the case that a critical mass of expertise and large-scale infrastructures are needed to generate clinical impact from CAI research. One of the pitfalls of implementing the translational platforms that can gather the required breadth of infrastructure and expertise is to concentrate and restrict CAI research to a handful of exceptionally large research centres. The competitive advantage of a research team could therefore slide from scientific excellence to shear group size and access to funding.\nA few years ago, a situation not so dissimilar was at risk of happening in the MIC community when access to clinical data and to privately held software repository became a competitive advantage. The advent of 1) massive open datasets such as coming from the Alzheimer's Disease Neuroimaging Initiative (ADNI) (Mueller et al., 2005) , 2) grand challenges such as the Retrospective Registration Evaluation Project (West et al., 1997) , and 3) open software toolkits such as ITK, VTK and 3D Slicer (Pieper et al., 2006) , has been transformative to the MIC field.\nIn the CAI domain, where real-time interaction with innovative hardware devices is primordial, having access to similar retrospective datasets, validation challenges and open-source software such as IGSTK (Enquobahrie et al., 2007) , OpenIGTLink (Tokuda et al., 2009) , PLUS (Lasso et al., 2014) and NifTK ) is a very important step but does not adequately cover the hardware aspects and is not enough to offset the competitive advantage provided by the massive infrastructure required for translational CAI research. In the specific subfield of medical robotics, the RAVEN-II platform (Hannaford et al., 2013) provides an appreciated step forward but does not address the question of infrastructure needs. To provide realistic environments for designing and evaluating CAI systems, we believe it is essential to have dedicated-for-research mock operating theaters and interventional suites endowed with as open as possible, state-of-the-art equipement: CT scanner, interventional MRI, rotational X-ray 3D imaging system, ultrasound system, surgical robots, classical therapeutic instruments, therapeutic lasers, optical and EM tracking systems, surgical endoscopes, surgical neuro-and ophthalmic-microscopes, realistic phantoms, surgical lights, operating table, insufflators, etc. Achieving this goal requires going beyond what the current most advanced surgical innovations centres such as the US P41-funded National Center for Image Guided Therapy (NCIGT) and its flagship Advanced Multimodality Image Guided Operating (AMIGO) facilities (Jolesz, 2014) or the IRCAD facilities (Marescaux and Diana, 2015) provide. We need a stronger focus on translating hardware and software developments, and wide collaboration networks with joint international funding mechanisms.\nWhile the scale of the infrastructure required does not quite approach that in very infrastructure-heavy fields such as particle physics and astronomy, lessons can be learned from how these fields mitigate the risk of the research being concentrated in a handful of research teams.\nCERN, the European Organization for Nuclear Research, operates the largest particle physics laboratory in the world. It employs just under 2,400 people, knowing that there are 10 times more engineers and technicians employed by CERN than research physicists. What provides the bulk of CERN research output are its 10,000 visiting scientists from over 600 universities over the world. The CAI translational platforms will similarly need to foster international collaborations. Visiting scientists should be provided with full access to the platform infrastructure and expertise during their visit and should be allowed to rely on the data acquired during their visit to pursue their research. Appropriate contractual agreements will of course be required to cover the confidentiality, and intelectual property (IP) requirements.\nTrade-offs between IP protection to increase technology transfer and research openness to increase scientific impact will need to be designed. It is interesting to also look at the European Southern Observatory (ESO), an organisation that focuses on the design, construction and operation of powerful ground-based observing facilities for astronomy. Technology transfer at ESO has for example opened the market for active and adaptive optics which is now gaining traction in the biomedical imaging field. Data from ESO results in over two peer-reviewed publications per day. Visiting astronomers have exclusive access to their scientific data for about a year after which the data is made publicly available for further research.\nIn the CAI translational platforms, creating holistic communities that spans clinicians, engineers, regulatory specialists, and entrepreneurs in residence and allowing individuals to work side-by-side and interact freely within these interdisciplinary environments will be key success enabler."}, {"section_title": "A biased view on emerging research themes", "text": "Having pledged that large-scale open translational research infrastructures will allow the CAI research field to move towards stronger clinical impact, it is now interesting to consider what the emerging research topics are that will keep the field active and thriving in the years to come. Far from aiming for exhaustivity, we will provide a biased, personal view on this question.\nIt is clear that the surgeon's workspace and assessment of the surgical site are severely limited in image-guided intervention and minimally invasive surgery. This increases the importance of detailed surgical planning and surgical navigation and calls for improved pre-and intra-operative imaging and sensing as well as ergonomic actuation and tissue manipulation.\nWe envision three important overlapping directions in which the CAI research will move to address these challenges in the future. Physiological navigation will replace the current, mostly anatomical, navigation. Clinical team experience considerations will move the field beyond the analysis of established workflow of the surgeon towards proposing optimised workflows in terms of cognitive and ergonomic workload for the complete clinical team. Precision instrumentation research will focus on designing devices that both sense physiological/pathological information and interact with tissue to deliver therapy."}, {"section_title": "Physiological navigation", "text": "Almost all current surgical navigation systems rely on rigid, static 3D representations of human anatomy with pathology being manually delineated from conventional diagnostic imagery. Navigation has had a major impact in orthopaedics and neurosurgery. This is illustrated in Fig. 2 where fusion of pre-and intra-operative imaging is used to improve resection in the context of epilepsy surgery (Duncan et al., 2016) . The potential elsewhere is however still to be realised. We suggest a paradigm shift will happen in which the full range of physiological information from a wide range of sensors is used in conjunction with data-driven learning and computational modelling to: (1) better assess the current status of the tissue being manipulated; (2) better predict tissue motion; (3) better assess impact of the intervention on normal tissue; and, (4) better predict the outcome of the therapeutic or interventional process.\nFirst, novel imaging, sensing and data fusion techniques will be sought to generate much more accurate ways to precisely assess the state and extent of any abnormality as well as identify and locate structures at risk, thereby enabling better prognosis for disease spreading and its effect on function. In cancer, this might take the form of novel molecular-based precision-targeted therapy for pre-malignant disease that requires removal to reduce the risk of future malignant transformation. In orthopaedics this might involve better prediction of the cascade of events that lead to severe arthritic damage to the knee, hip or shoulder joints. By fusing and integrating novel technologies in the interventional workflow, detection and prediction both pre-operatively and intra-operatively will be inproved.\nSecond, learnt motion models to better predict the motion and tissue distortions associated with autonomous motion (e.g. breathing, cardiac motion, gut peristalsis, bladder filling etc.), or with patient positioning and weight loss or gain that might take place between pre-operative imaging and therapy will be proposed .\nThird, physiological modelling will better predict iatrogenic harm, i.e. caused by the intervention itself. All ablative procedures and all surgery result in iatrogenic damage to adjacent tissues or tissues that prevent access. The balance between complete treatment but excessive harm on one side and inadequate but \"safe\" treatment on the other is currently made subjectively by the clinician. It is likely that this balance is far from optimal in many situations. The likelihood of a particular procedure harming the surrounding normal tissues varies significantly between tissue types and patients. For example, in prostate cancer, harm to normal prostate tissue has relatively low impact while harm to the adjacent vascular bundles, rectal wall or urethra can have a profound effect. In neurosurgery, some parts of the brain are remarkably resilient to damage while other eloquent areas (e.g. speech or movement areas) are extremely sensitive to damage. The boundaries between the two are tight and often difficult to determine. Appropriate models will improve surgical planning and guidance (Hayashi et al., 2015) . Such systems could also help explain surgical or interventional risks to patients as part of the informed consent.\nFourth, physiological modelling will better predict the interventional processes. For surgery, this involves modelling tissue resection, tissue-remodelling and inflammation. For radio-frequency / high-intensity focused ultrasound / micro-wave ablative processes, this entails modelling the physical processes of heat transport; etc. Whenever possible, computational models will be driven by real-time monitoring to extrapolate and improve the assessment of the therapy. Coupling affordable sensing technologies with accurate modelling based on patient-specific data will be an area of significant interest and rapid development.\nThere is a crucial balance between learnt models from observation and models informed by an understanding of physiological and patho-physiological processes. This balance will evolve over time to produce accurate predictive assessment of interventional outcome coupled with multi-modal sensory guidance."}, {"section_title": "Clinical team experience", "text": "The performance and capabilities of the surgical team need to be enhanced not only by facilitating better training, but also through end-to-end ergonomic design and effective online information management to improve the clinical experience, identify real-time workflow-related risks and inform the team about how to ensure optimal patient safety.\nModern therapeutic environments, from operating theatres to endoscopy suites, are increasingly complex, with poorly integrated intra-operative de-vices, sensors and support infrastructures. Furthermore, existing surgical / interventional training systems only offer over-simplified representations of basic generic skills that are not specifically adapted to the patient undergoing therapy. This leads to long learning curves, imposes a heavy cognitive and ergonomic workload on the clinical team, and slows the uptake of novel interventional tools. As a consequence of suboptimal design, limited training, understanding and support, new technologies are often introduced in theatre but are then left under-utilised. To tackle this problem, advanced training centres are emerging for specialist surgical skills training. Yet, the opportunity to use these training centres for quantitative skills and clinical workload assessment and for driving the research towards an improved clinical experience has not yet been fully realised.\nA first research focus will rely on developing the sensory and computational tools to understand, measure, and evaluate operator behaviour within the interventional setting. Skill and workflow analysis are the most mature components of clinical behaviour analysis, with techniques developed to provide patient-and surgery-specific training systems. This will be develop further by combining multi-sensory data over multiple scales, from entire theatre track spaces (providing information about user interactions) down to vision-based instrument end effector localisation and tissue tracking. The context at the various scales that the interventional environment workflows require will be leveraged to introduce a step change to previous skills and workflow analysis methodologies that have mostly been relying on motion tracking and analysis. Crucially, these workflows will involve the full clinical team and not only the trainee or expert surgeon.\nA second research focus will rely on context-awareness to improve user experience of the clinical team and inform clinical decision support systems, thus paving the way to introducing some automation in theatre. Indeed, despite recent efforts and the introduction of integrated interventional suites, there is little coordinated effort to optimise theatre and interventional suite ergonomics, workflow and operation in routine practice. Theatre staff lack the analytical tools and information to help them plan and refine the ergonomics and use of equipment during surgery, as well as tools that provide real-time decision support and coordination during an intervention. CAI research will develop the interfaces and effective information delivery systems to help staff optimise the use of surgical equipment, theatre and interventional suite ergonomics, and to provide critical safety information, such as radiation levels in different parts of the catheter lab or endoscopy suite. Task-driven information compression providing the right information at the right time will be designed to reduce intra-operative cognitive workload. Workflow analysis and automation will allow for ergonomic, procedure-specific integration of surgical devices in the complex, safety-critical environment of the therapeutic suite. Research in assistive technology will provide solutions to compensate for the reduced workspace and dexterity in minimally-invasive therapy."}, {"section_title": "Precision instrumentation", "text": "The interventional suite of the future will not only optimise the clinical team ergonomic and cognitive load by streamlining the interventional workflow, but will also feature a shift from external imaging systems with passive interventional devices to smart miniature devices that allow the interventionist to understand local tissue properties through integrated imaging and sensing, and deliver optimal local therapy accordingly. CAI research will develop tracked interventional tools that allow for imaging with molecular and microstructural contrast, providing dexterity for flexible physiological access and for therapy at the micron-scale level.\nMolecular and microstructural visualisation of tissue will be delivered by a combination of modalities such as endoscopic multi-spectral photoacoustic (Beard, 2011) , all-optical pulse-echo ultrasound imaging (Colchester et al., 2014) , targeted fluorescence imaging and different forms of endomicroscopy (Thiberville et al., 2007) . By tailoring the imaging to the application, differentiation between tissue types will be achieved, thus directly coupling the output of precision instruments to the research in physiological navigation. Molecular image contrast will be valuable in a wide range of percutaneous procedures such as peripheral nerve blocks, for identifying critical structures including vessels and nerves that are invisible in X-ray fluoroscopy, and beyond the field of view of external ultrasound (Mari et al., 2015) .\nSpatial tracking of medical devices will be crucial to interpret the acquired high-resolution images of tissue in the macroscopic intervention-level context. Novel tracking means such as coded ultrasonic tracking, in which ultrasound transmissions from external imaging probes are received by sensors integrated within the medical devices, and Fibre-Bragg gratings will determine the location and orientation of devices with greater accuracy and integration flexibility. These technologies will enable multi-scale fusion of pre-operative and intra-operative anatomical images with the molecular-level information provided by other instruments. With spatial tracking, cartographies of pathological locations can be created. Image and data compounding will provide high-resolution volumetric images of large field-of-views to support physiological navigation.\nPrecise actuation at microscopic and macroscopic scales will be achieved using micro-manufactured super-elastic components, electroactive polymers, and pneumatically actuated microtubes in combination with shape sensing using patterned carbon nanotube -PDMS composite polymer skins, and Fibre-Bragg gratings. These actuator technologies will form the backbone of steerable surgical tools, which will allow access to hard-to-reach or currentlyimpossible-to-reach anatomical regions, such as accessing the brain and optic nerve by flexing around the ocular cavity, safely reaching the deepest regions of the human cochlea, or navigating the spinal canal to individually address damaged nerve roots, vascular malformations and disc herniations (Bergeles et al., 2015) .\nMultimodal sensing technologies will be developed using sub-micrometre 3D printing as well as soft and flexible photolithography to integrate arrays of flexible and minimally-invasive sensors directly on the interventional tool (Schneider et al., 2015) . Equipped with flexible patterned surfaces for e.g. force, pressure, and temperature sensing, microscale interactions with the manipulated tissue will be recorded. This sensory information will enable tissue property mapping at high spatial resolution for precise surgical guidance and smart co-manipulation of the instruments, allowing the interventionist to focus on executing the macroscopic level of complex surgical plans. These new precision instruments will thus blend into existing workflows, and this minimal disruption of clinical protocols will facilitate their clinical translation.\nThe advances in local imaging, tracking, and actuation will be brought together to facilitate the delivery of novel therapies to specific tissue targets, minimising collateral damage. Novel instruments will enable pressure-safe delivery of microvolumes of stem cells, genes, and drugs for localised treatments. In ophthalmology, for example, force-perceptive ultra-precise instrument for accessing and delivering sight-restoring stem cells into the subretinal layers could providing a cure to Age-Related Macular Degeneration blindness (Carr et al., 2013) . Further, high-intensity focused ultrasound (HIFU) effected and monitored using optical carbon-nanotube-PDMS-composite-based ultrasound transmitters embedded into interventional instruments will allow for precise tumour ablation and traversal of vascular occlusions to treat hard to reach pathological regions. "}, {"section_title": "Smart instrumentation", "text": "Figure 3: Example building blocks of a holistic approach to computer-assisted intervention in the context of epilepsy surgery (top row) and fetal surgery (bottom row) (Pratt et al., 2015) ."}, {"section_title": "Conclusion", "text": "In the year to come, the success of computer-assisted intervention research will be evaluated by the clinical impact resulting from its scientific results. Given the important infrastructure and expertise required to make CAI research clinically usable and relevant to the clinical teams, the temptation to leave the translation step to the industry is strong but not efficient.\nWe have argued that large-scale open translational CAI research infrastructures need to be created and need to foster international collaborations beyond algorithms and software. A holistic approach embracing the complexity of surgical and interventional sciences needs to be taken throughout all the clinical steps, illustrated in Fig. 3 , from the consolidation of prior knowledge, to the design and exploitation of smart instrumentation and to long-term outcome analysis.\nThe interventional systems resulting from the upcoming CAI research will not only make existing interventions easier, safer, and more precise, but will become enablers for new and currently impossible surgical applications."}]