[{"section_title": "Abstract", "text": "IMPORTANCE Lower educational attainment is associated with a higher risk of dementia. However, less clear is the extent to which other socioeconomic markers contribute to dementia risk. OBJECTIVE To examine the relationship of education, wealth, and area-based deprivation with the incidence of dementia over the last decade in England and investigate differences between people born in different periods. DESIGN, SETTING, AND PARTICIPANTS Data from the English Longitudinal Study of Ageing, a prospective cohort study that is representative of the English population, were used to investigate the associations between markers of socioeconomic status (wealth quintiles and the index of multiple deprivation) and dementia incidence. To investigate outcomes associated with age cohorts, 2 independent groups were derived using a median split (born between 1902-1925 and 1926-1943). MAIN OUTCOMES AND MEASURES Dementia as determined by physician diagnosis and the Informant Questionnaire on Cognitive Decline in the Elderly. RESULTS A total of 6220 individuals aged 65 years and older enrolled in the study (median [interquartile range] age at baseline, 73.2 [68.1-78.3] years; 3410 [54.8%] female). Of these, 463 individuals (7.4%) had new cases of dementia ascertained in the 12 years between 2002-2003 and 2014-2015. In the cohort born between 1926 and 1943, the hazard of developing dementia was 1.68 times higher (hazard ratio [HR] = 1.68 [95% CI, 1.05-2.86]) for those in the lowest wealth quintile compared with those in the highest quintile, independent of education, index of multiple deprivation, and health indicators. Higher hazards were also observed for those in the second-highest quintile of index of multiple deprivation (HR = 1.62 [95% CI, 1.06-2.46]) compared with those in the lowest (least deprived) quintile.\nIn an English nationally representative sample, the incidence of dementia appeared to be socioeconomically patterned primarily by the level of wealth. This association was somewhat stronger for participants born in later years.\n(Reprinted) 723\nQuestion What is the association between various socioeconomic markers and dementia incidence?\nFindings This longitudinal cohort study found that lower wealth in late life, but not education, was associated with increased risk for dementia, suggesting that people with fewer financial resources were at higher risk. No substantive differences were identified in relation to the area of neighborhood deprivation; an age-cohort effect was observed, highlighting that socioeconomic inequalities were more robust among people born in later years.\nMeaning The association between socioeconomic status and dementia incidence in a contemporary cohort of older adults may be driven by wealth rather than education."}, {"section_title": "", "text": "D ementia is one of the most feared medical conditions worldwide; it represents a significant global challenge to health and social care. 1, 2 Recent evidence suggests that dementia rates have decreased in the last few decades in the United Kingdom and other parts of Western Europe. [3] [4] [5] Similarly, in the United States, the Framingham Heart Study has shown that age-specific incidence rates of dementia have decreased by almost 20% within the last few decades, and the greatest declines were apparent in individuals with higher educational attainment relative to more basic educational attainment. 6 Education may serve different roles in the development of dementia: it is a proxy for early-life experiences and (parental) socioeconomic status (SES); it is related to future employment prospects, income, and wealth; it determines occupational exposures and characteristics of adult life (eg, job complexity, work stress, environmental exposures); and it provides lifelong skills for optimal mental abilities and mastery. Education is also thought to be a marker of cognitive reserve, which appears to be protective against cognitive impairment and dementia risk, offering an increased neural network and compensatory mechanisms throughout the life course, even when individuals are facing neuronal death. 7 Recent systematic reviews have highlighted that low educational level was associated with a higher risk of dementia incidence 8 as well as with greater risk of dementia-related death. 9 Some of this evidence highlights that the role of education varies according to period and sociocultural context. The variation in country-specific regulations on compulsory schooling and variations in measurement could account for the differences reported in the literature.\nMoreover, given that education is typically completed many decades before dementia onset, other individual and area-based components of SES, such as wealth, income, and area deprivation, may provide a more accurate indication of current socioeconomic resources. Also, at older ages, accumulated wealth represents a more robust measure of socioeconomic resources than income or occupation alone. 10, 11 There are relatively few studies to date that have used socioeconomic indicators other than education to investigate dementia risk. A recent analysis of the Health and Retirement Study compared various SES markers, including parental education (an early-life indicator) and education and income (adult and late-life indicators) associated with late-life memory performance and decline. These findings indicated that income was most strongly associated with decline, although education was the most influential determinant of baseline memory. 12 Another aspect of socioeconomic position involves neighborhood characteristics and the area of deprivation level, which combines information from multiple domains such as income, employment, education, skills, training, health, disability, crime, and barriers to housing into a single measure. Previous results from the English Longitudinal Study of Ageing (ELSA) showed that the index of multiple deprivation (IMD), the official measure of deprivation in England, was associated with cognitive performance in older age independently of education and SES. These findings indicated that older women had lower cognitive scores if they lived in an area clas-sified in the bottom 20% of IMD when compared with those in the top (least deprived) quintile. 13 In contrast, Meyer et al 14 showed that neighborhood SES had limited effects on executive function, independent of personal characteristics such as education and ethnicity. They also showed that individuals with dementia living in neighborhoods with higher SES experienced faster rates of decline before further statistical adjustment for education and ethnicity. 14 These findings are consistent with the cognitive reserve hypothesis, which acknowledges a rapid cognitive deterioration for people with higher education once the pathological process associated with dementia has been initiated. 7 However, findings from the Seoul Dementia Management Project 15 showed there were no additive or synergistic effects between individual-level and districtlevel of SES, highlighting that the individual level contributed more to the development of cognitive impairment than the district-level SES.\nWe aimed to describe dementia incidence in a nationally representative cohort of British older adults and to investigate the association with different socioeconomic markers, both via the individual characteristics (education and wealth) and group-level characteristics (IMD). A second objective was to examine the role of socioeconomic markers between 2 independent age cohorts (those born from 1902 to 1925 and from 1926 to 1943)."}, {"section_title": "Methods", "text": ""}, {"section_title": "Data", "text": "The English Longitudinal Study of Ageing (ELSA) is a large, multidisciplinary study representative of the English population both in terms of socioeconomic profile and geographic region. 16 There have been 7 waves of data collection over a follow-up period of up to 12 years, providing detailed information on health, well-being, and socioeconomic circumstances. We used all the available data spanning 12 years across wave 1 (2002-2003) to wave 7 (2014-2015). Refreshment samples were recruited at waves 3, 4, 6, and 7. For the current analyses, we included only participants aged 65 years and older who were free of dementia at their baseline assessment at either wave 1 or through the refreshment sample of wave 4 ( Figure 1 for sample selection).\nEthical approval for each one of the ELSA waves was granted by the National Research Ethics Service (London Multicentre Research Ethics Committee). All participants provided informed consent."}, {"section_title": "Study Variables", "text": "Dementia Ascertainment Dementia occurrence was determined at each wave using an algorithm based on a combination of self-reported or informant-reported physician diagnosis of dementia or Alzheimer disease or a score above the threshold of 3.38 on the 16question Informant Questionnaire on Cognitive Decline in the Elderly. 17 This questionnaire is administered to an informant (eg, a family member or a caregiver), who can evaluate the changes in the everyday cognitive function. Each item is scored from 1 (much improved) to 5 (much worse). The validity of this scale was previously examined, 18 and the threshold used has both high specificity (0.84) and sensitivity (0.82). 19"}, {"section_title": "Socioeconomic Indicators", "text": "We measured SES at baseline, including individual characteristics (education and wealth) and area-based characteristics (IMD). Educational attainment was classified into 4 categories: (1) having a university degree or higher; (2) having completed A-levels or the equivalent, which is comparable with high school graduation; (3) having completed education below the A-level; and (4) lacking formal qualifications. Wealth was calculated by summing wealth from property, possessions, housing, investments, savings, artwork, and jewelry, and net of debt 16 ; this was divided into quintiles. The index of multiple deprivation (IMD) is a composite measure which combines multiple area-level SES indicators into a single deprivation score. 20 We used the 2004 IMD for England (in which 1 was least deprived and 5 was most deprived). The highest levels of wealth, education, and IMD were used as the reference group."}, {"section_title": "Covariates", "text": "Based on previous findings, 21 we considered baseline age, sex, marital status (married vs unmarried or widowed), and baseline health (eg, history of stroke, coronary heart disease, hypertension, and diabetes mellitus as potential confounders). Being male, married, and having no health conditions were used as the reference groups."}, {"section_title": "Age Cohorts", "text": "To investigate the change in incidence rates over the last decade, we derived 2 groups: age cohort I (who were born between 1902-1925) and age cohort II (who were born between 1926-1943). This derivation was generated using a median split of all birth years ( Figure 1 )."}, {"section_title": "Statistical Analyses", "text": "Incidence rates of dementia were computed by age and sex per 1000 person-years. We performed χ 2 tests to ascertain if there were significant differences between SES groups. To summarize the relationship between SES characteristics and dementia incidence, Cox proportional hazards models with age as the underlying time variable were used to calculate hazard ratios (HRs) and accompanying 95% CIs. 22 We present the results from 4 models: model 1 included unadjusted HRs; model 2 included sex and marital status; model 3 included model 2 with further adjustment for baseline health indicators (stroke, hypertension, diabetes, and cardiovascular disease), and model 4 included model 3 and further adjusted for the additional socioeconomic indicators. We used a forward stepwise approach and the Akaike Information Criterion to select the model of best fit. Given that the original IMD quintile classification was slightly underpowered, we conducted a sensitivity analysis with the IMD regrouped into a binary variable (with quintile 1 [Q1] set to 1 and Q2-Q5 set to 2).\nThe survival time was calculated using participants' baseline age at study entry until the age they were found to be experiencing dementia, the point of their death, or the end of the study period (the last wave before dropout, or wave 7, which ran in 2014-2015). The Schoenfeld residual test was used to test the proportional hazards assumption of the models. 23 For individuals who did not report an exact diagnosis date or for those whose dementia was ascertained with Informant Questionnaire on Cognitive Decline in the Elderly, we considered the midpoint between the wave where dementia was first ascertained and the previous wave where it was not. Mortality data were used for participants who had provided written consent for linkage to official records from the National Health Service central register; the records available the time of these analyses continued until February 2013. All analyses were weighted using the baseline crosssectional weights derived in ELSA to ensure the sample is representative of the English population. 24 Given that death is often considered a competing risk for dementia incidence, we conducted supplementary analyses using a modification of the Fine and Gray Subdistribution Hazards model 25 to account for the competing risk of death, as described elsewhere 26 (eFigure 1 in the Supplement). All analyses were conducted in Stata SE, Version 14 (StataCorp). Statistical significance was considered to be at or below the .05 level. Additional details are noted in the eAppendix in the Supplement."}, {"section_title": "Results", "text": "The sample included in these analyses was composed of 6220 individuals, accounting for 43 218 person-years (median follow-up duration, 7 years; range, 1-12 years). Of these, 463 (7.4%) were classified with dementia during the surveillance period, and 1971 (31.7%) died. The baseline median age was 73.2 years (interquartile range, 68.1-78.3 years), while the median age at the time of dementia ascertainment was 82.7 (interquartile range, 78.2-87.8 years). The sample included 6220 people, of whom 3410 (54.8%) were female and 2810 (45.8%) male, 3682 (59.2%) married, and 3288 (52.5%) without formal educational qualifications. Only 1049 of 6220 participants (16.9%) attended university. More men were educated to university degree level than women, while more women had no formal educational qualifications (χ 2 3 , 338.28; P ≤ .001). The baseline median wealth for the overall sample was £15 100 (approximately $21,470; interquartile range [IQR], £2700-£62 546 [$3839-$88 935.30]); for the lowest quintile, the median wealth as £120 (approximately $170.63; IQR, £0-£700 [$0-$995.34]), increasing to £180 000 ($255 936.94; IQR, £117 000-£309 100 [$166 375.78-$439 544.91]) in the highest quintile. Except for stroke, which showed no clear SES gradient, all other health conditions (cardiovascular disease, diabetes, and hypertension) were inversely associated with each one of the SES markers (results presented in eTable 1 of the Supplement).\nAge-adjusted and sex-adjusted incidence rates for the full ELSA sample and each specific age cohort are presented in Table 1 and Figure 2 . The overall incidence rate (IR) was 11.32 per 1000 person-years (95% CI, 10.34-12.41 per 1000 personyears). As anticipated, there was a significant increase in dementia IRs with age from an incidence of 4.38 (95% CI, 3.49-5.57) in people aged 65 to 69 years to 24.69 (95% CI, 21.20-28.91) for those 80 years or older. The comparison between the 2 distinct age-periods cohorts shows a 30% reduction in the IRs of dementia for the overlapping age group of 75 to 79 years who were born between 1902 and 1925 (IR, 20.29; 95% CI, 16.45-25.28) and those born later between 1926 and 1943 (IR, 13.59; 95% CI, 10.33-18.20) (Table 1 ). There were no significant sex differences in the IRs of dementia (eTable 1 in the Supplement)."}, {"section_title": "Individual and Area-Based Socioeconomic Markers", "text": "The multivariable analyses are summarized in Table 2 . Education was not significantly associated with dementia inci-dence, but wealth was a strong indicator. Per model 4, the hazards of developing dementia were higher for those in the lowest 2 quintiles of wealth (Q4: HR, 1.39; 95% CI, 1.00-1.95; and Q5: HR, 1.50; 95% CI, 1.05-2.13; P for trend = .04), compared with those in the highest quintile (Q1), independently of covariates, education, and area-level socioeconomic characteristics ( Table 2 and Figure 3 ).\nArea-based characteristics measured with IMD were also associated with dementia incidence. In contrast with individuals in the least-deprived areas (IMD Q1), the remaining 4 quintiles showed an increase in the hazard risk of developing dementia in model 1 (Q2: HR, 1.44; 95% CI, 1.08-1.90; to Q5: HR, 1.45; 95% CI, 1.06-1.99; P for trend = .04). However, only the association with the second-highest quintile (Q2: HR, 1.41; 95% CI, 1.06-1.87) maintained statistical significance in the fully adjusted model, independent of the other individual markers of SES.\nResults from the first sensitivity analysis showed that those in the lowest 4 quintiles of IMD combined had increased risks of developing dementia (HR, 1.32; 95% CI, 1.03-1.69; model 4) compared with those living in the least deprived area (eTable 2intheSupplement)."}, {"section_title": "Individual and Area-Based Socioeconomic Markers Within Age Cohorts", "text": "An investigation of age cohort showed that education was significantly associated with dementia for participants born between 1926 and 1943 (age cohort II), but not for those born earlier in the century (age cohort I). In age cohort II, there was a greater hazard risk of dementia for those with no education than those educated at university levels (HR, 1.43; 95% CI, 1.01-2.04; model 1). However, this association was no longer significant once health conditions had been entered, per model 3.\nWealth also seemed to have a stronger association with dementia incidence within age cohort II, although this was not statistically significant. The association of IMD with subsequent dementia was comparable in age cohort II and the full sample, while differences between IMD quintiles were not present for age cohort I in models 1, 2, and 3, before adjusting for other SES markers.\nOur additional analyses considering the competing risk of death showed a similar pattern of decline in dementia incidence over time (eFigure 2 in the Supplement) and a stronger association between dementia incidence and all the SES markers including education, but with no age-cohort effects (eTable 3intheSupplement)."}, {"section_title": "Discussion", "text": "In a representative sample of the English population aged 65 years and older, we found a positive association between lower wealth and dementia incidence that was independent of education, arealevel deprivation, and covariates. This suggests a higher risk for individuals with fewer financial resources. The association was more consistent for participants born after 1926 compared with those born earlier in the 20th century. Additionally, there was evi-dence for reduced incidence among participants born more recently. However, the 2 age cohorts overlap only for the group aged 75 to 79 years. Differences between age cohorts in the incidence of early-onset vs later-onset dementias may also be present. There are several possible explanations for the strong association of wealth with subsequent health outcomes. Wealth is an indicator of socioeconomic resources, and it could represent a gateway to more mentally stimulating environments independent of the level of educational attainment. Previous ELSA findings have shown that increased wealth facilitates greater digital literacy, which is in turn associated with a reduced risk of dementia. 27 Furthermore, increased financial status could provide broader access to cultural resources and behaviors (eg, reading, theaters, social clubs) or increased social networks, which could ultimately contribute to higher cognitive reserve. 7, 28 The integrated psychosocial resource model proposed by Matthews and Gallo 29 argues for the accumulation of psychosocial and physical protective factors. However, in our analyses, the relationship between wealth and dementia remained statistically significant even after controlling for healthrelated conditions associated with dementia.\nThere is also evidence that persistent SES disadvantage is associated with impaired physiological functioning, 30 increased risk of depression, 31 vascular disease, and stroke. 32 Other factors, such as reduced exercise, poor diet, 33 and inflammatory vascular risk factors, 34 may also play a part in the association between low SES (as defined by wealth) and increased dementia risk. Our data showed a differential SES distribution for the health conditions modeled as covariates in these analyses, except for stroke, which showed no clear SES gradient. Further work on the ELSA data could explore these mechanisms in more detail to be able to disentangle the mediating role of psychological, cardiovascular, and metabolic functions on the association between SES markers and dementia.\nThe lack of a contextual, area-based SES effect on dementia incidence is also notable. Previous ELSA findings have documented a link between neighborhood deprivation and cognitive functioning, independent of individual markers of SES, showing that individuals living in the most deprived area of England had significantly lower cognitive scores compared with those living in the most affluent regions. 13 Our study found an inconsis-tent association between the area deprivation (IMD) and dementia incidence, with higher rates for individuals in the second quintile of IMD compared with the top quintile (who were least deprived). The reasons for this are not clear. Associations were observed for the lower IMD quintiles in first stages of covariates adjustment, but these were no longer significant when individuallevel SES indicators were considered. This suggests that much of the effect of area deprivation is explained by the individual characteristics of the people living in those areas, rather than the features of the areas themselves.\nIn this cohort, education was not a robust predictor of dementia incidence. Given that this association was no longer significant after age and sex were taken into account, it is possible that this might be a specific cohort effect in the English population born and educated in the period surrounding the World War II. Support for this speculation comes from an extensive population cohort collaboration (the Epidemiological Clinicopathological Studies in Europe), which showed no apparent protective effect of education on the clinical presentation of dementia (eg, accumulation of pathology, pathological severity, and level of compensatory mechanisms for cognitive impairment). 35 Their findings showed that individuals with higher education had heavier brains, suggesting greater cognitive reserve, but they were not necessarily able to compensate for the accumulation of vascular and neurodegenerative pathologies. However, the role of education might be sensitive to sociocultural context. Similar to our findings, other investigations from the Rotterdam Study, 36 the Rochester Epidemiology Project, 37 and the Baltimore Longitudinal Study of Aging 38 reported a lack of association between dementia incidence and education.\nIn contrast, findings from the Health and Retirement Study 39 indicated that higher education was associated with a lower risk of dementia prevalence between 2000 and 2012, and in the Kungsholmen study, 40 education remained significantly associated with dementia following adjustment for occupational class. Moreover, in the Canadian Study of Health and Aging, 41 fewer years of education were associated with an increased risk of lateonset Alzheimer disease incidence, while subsequent results from a 10-year follow-up (1991-2001) within the same study showed that high complexity of work with people or things was associated with a reduced risk of most dementia types (Alzheimer and vascular dementia). 42 These findings indicate a protective effect of the occupational demands on the brain achieved through a lifetime occupational exposure. It is therefore possible that individuals born before the World War II may not necessarily have been able to access higher education (because of military service, financial restrictions, and limited university place availability) but may have gained access to intellectually challenging jobs and growth opportunities after the war."}, {"section_title": "Strengths", "text": "To our knowledge, this is the first longitudinal study to examine multiple facets of SES characteristics at individual and group levels simultaneously in association with dementia incidence within an age-cohort context. Through the extensive monitoring of biennial interviews and a long-term follow-up, we were able to use an integrative approach to study the association between various socioeconomic factors and dementia incidence. Furthermore, we Error bars indicate 95% CIs."}, {"section_title": "Research Original Investigation", "text": "Individual and Area-Based Socioeconomic Factors Associated With Dementia Incidence in England \nIndividual and Area-Based Socioeconomic Factors Associated With Dementia Incidence in England benefited from a more detailed assessment of wealth than what is available in most studies to date, because this measure was computed on the basis of accurate information on multiple individual components rather than broad categorization of assets."}, {"section_title": "Limitations", "text": "This study also has limitations. Given that the ascertainment of dementia diagnosis is still challenging in the UK health services and elsewhere, it is likely that the presented dementia IRs are underestimated. Other common issues such as nonresponse and subsequent attrition are familiar to most longitudinal surveys. 43 Moreover, because of a relatively small sample of dementia cases, we did not explore the IRs of dementia by specific typology (eg, Alzheimer disease, vascular, mixed). Although ELSA is a demographically representative cohort, the race/ethnicity is 97% white 16 and we were therefore unable to investigate the effects that race/ ethnicity might have on the outcome of dementia. Furthermore, we did not investigate the difference in dementia incidence by geographical regions, given the high collinearity with IMD. Lastly, as in any observational study, we cannot exclude the risk of confounding by other factors. Avenues for future exploration include examining the mediating role of cardiovascular disease, lifestyle factors, medical care and other risk factors that could influence the association between SES and dementia."}, {"section_title": "Conclusions", "text": "In a nationally representative sample of English people 65 years and older, the hazard risk of dementia incidence was associ-ated with socioeconomic indicators, notably wealth. Socioeconomic inequalities were more marked in individuals born in later years (from 1926 onwards) than in those born earlier (between 1900 and 1925). Public health strategies for dementia prevention should target socioeconomic gaps to reduce health disparities and protect those who are particularly disadvantaged in addition to addressing vascular risk factors such as hypertension, diabetes mellitus, smoking, and heart disease. "}, {"section_title": "eAppendix. Supplementary materials description.", "text": "There were significant differences between individuals with cardiovascular disease by levels of education, ² (3), 7.60, P≤.05, wealth, ² (4), 29.00, P≤.001 and IMD, ² (4), 26.30, P≤.001.\nSignificant differences were also observed between individuals with diabetes by levels of education, Table 2 presents the results of the sensitivity analysis conducted with the index of multiple deprivation (IMD) categories regrouped into a binary variable."}, {"section_title": "Supplementary analyses were conducted using a modification of the Fine and Gray, Subdistribution", "text": "Hazards model 31 , described by Chang and colleagues 32 .\nIn the first stage of these analyses, we constructed a propensity model to estimate the probability of having dementia at the last observed follow-up for each participant, using a logistic regression model in which we included education, wealth, IMD, sex, marital status, stroke, hypertension, diabetes and CVD. Age was not included because we investigated age-cohort effects in these analyses. In this propensity model, those who developed dementia were considered as \"events\", while participants who remained alive and not classified with dementia until the end of the study, were considered \"nonevents\". Each individual (including those who died without developing dementia) was assigned a corresponding propensity score by calculating the estimated probability.\nIn the second stage, the propensity scores for those who died without developing dementia were used to reclassify them into the main event (dementia or death with a high probability of having dementia) or competing risk event (death with a low probability of having dementia). The threshold used for the reclassification of those who died into high versus the low probability of having had dementia was the median propensity score among those who developed dementia (median=0.11). Individuals who died were reclassified as having had dementia if their propensity score was above the threshold, or as competing event (death with a low probability of dementia) if their propensity score was below the "}]