[{"section_title": "", "text": "7.2 Summary of Results ........................................................................................... 7.3 Benefits of this Research ................................................................................... 7.4 Limitations ......................................................................................................... 7.5 Suggestions for Future Research ....................................................................... 7.6 References .......................................................................................................... VITA ................................................................................................................................. viii Table 2.1. Average annual number of tropical cyclones that develop in selected ocean basins, based on data from 1981-2010. Taken from Landsea and Delgado (2013)….…..14 Table 2.2. Ocean basins, sub-basins and countries represented in the global literature review of observed storm surge information…………………………………………….15 Table 2.3. Top 10 tropical cyclone-induced surge levels in the Western North Pacific from 1880-2013. Compiled from the following sources: Arafiles and Alcances (1978), PAGASA (1987), Henderson (1988), Bankoff (2003), Mai et al. 2006;Neumann et al. 2012;Needham (2013).………………………………………………………………….23 Table 2.4. The top 10 highest Northern Indian Ocean tropical cyclone-induced storm surge levels, from ……...……………….…………………………….39 Table 2.5. The top 10 highest Northern Indian Ocean fatality total from tropical cyclones, from ; and ………....……………………………….43 Table 2.6. Top 10 Western North Atlantic tropical cyclone-induced surge levels, from 1880-2012. Multiple events tied for ninth-place, so this list contains 13 events. Compiled from the following sources: Garriott (1898); U.S. Corps of Engineers (1935); U.S. Army Engineer District (1962); Sugg and Pelissier (1968); ; Hebert (1976); Schuck-Kolben (1990); Pielke et al. (2003); Landsea et al. (2004); Anonymous (2007); Drye (2007); Mandia (2010); and .……………………………………………………………….…………………...49 Table 2.7. Atlantic Basin tropical cyclone fatalities by region, from Rappaport and Fernandez-Partagas (1995)……………………………………………………………....54 Table 2.8. Population statistics for the U.S. coastal counties and parishes along the Gulf of Mexico in 1900Mexico in , 1950Mexico in , and 2000  …………………….54 Table 2.9. Top 10 tropical cyclone-induced surge levels in Australia, New Zealand and Oceania, from 1880-2013. Compiled from the following sources: Whittingham (1958); Nelson (1975); Harper (1998); Australia Bureau of Meteorology (2000); Emergency Management Australia (2006); Australia Bureau of Meteorology (2006); Anonymous (2010); and Australia Bureau of Meteorology (2014a)………………………………….69 Table 2.10. Numeric counts of storm surge and storm tide observations by basin. Taken from SURGEDAT database……………………………………………………………..82 Table 2.11. Summary statistics for storm surge observations in selected basins. Surge counts indicate the number of surge events that have exceeded the threshold. Counts of 1, 2, and 3 m surges in China provided by . All other data provided by SURGEDAT database…………………………………………………………………...87 Table 2.12. The number of storm surge/ storm tide events per decade exceeding various threshold levels. Rates of 1, 2, and 3 m storm surges in China derived from . All other values derived from SURGEDAT database…………………..………88 Table 2.13. Deaths in tropical cyclones since 1700-1997, from ………………………………………………………………………………….…94 Table 3.1. Frequency of the 14 landfall classes, with a determination of inclusion/ exclusion in this study…………………………………………………………………..134  Table 3.3. Multiple R-Squared values correlating storm surge heights vs. winds at 3-hour increments preceding landfall. Correlation tests were run on data from 1880-2011 (117 events) and 1960-2011 (63 events). These values are plotted in Figure 3.7a…………..147 Table 3.4. Multiple R-Squared values of surge vs. actual and exponential wind speeds for data from 1960-2011 (63 events). The exponential power that produced optimal fit is also listed…………………………………………………………………………………….149 Table 4.1. Landfall/ surge event types that were removed from analysis in Chapter 3. A total of 72 events were removed from the analysis……………………………………..177 Table 4.2. Comparison of storm surge heights, hurricane size and maximum sustained wind speed at 18 hours before landfall for the 13 Florida Keys surge events analyzed in this study. Data compiled from , , , Landsea et al. (2007), , and Hagen et al. (2012)…………184 Table 4.3. Spearman rank order correlations measuring the relationship between storm surge heights and radius of 63 km/hr (34-kt), 93 km/hr (50-kt), and 119 km/hr (64-kt) winds……………………………………………………………………………………186 Table 4.4. Correlation between Rmax sizes and the radius of 63 km/hr (34-kt), 93 km/hr (50-kt) and 119 km/hr (64-kt) winds. All of these correlations are inverse, meaning there is a negative relationship between the variables………………………………………..189"}, {"section_title": "LIST OF TABLES", "text": "x Table 5.1 The number of observations provided by circles with 8-km (5-mile), 16-km (10-mile), and 40-km (25-mile) radii at 26 locations along the U.S. Gulf Coast. The latitude and longitude values depict the coordinates of circle centers………………….208 Table 5.2. Physical Homogeneity Index (PHI) classification provided by circles with 8km (5-mile), 16-km (10-mile), and 40-km (25-mile) radii……………………………..210 Table 5.3. Comparison of water levels at Galveston and interior portions of Galveston Bay, from tropical cyclones that made landfall between Corpus Christi and Galveston, Texas, and produced at least 2 m storm surge/ storm tide in Galveston Bay. Adapted from Zoch (1949); U.S. Weather Bureau (1959); U.S. Army Corps of Engineers (1962); National Hurricane Center (1983); National Hurricane Center (1989); Federal Emergency Management Agency (2009)………………..……………………………..214 Table 5.4. Sea-level trends for 26 locations along the U.S. Gulf Coast. Data provided by ; Galloway et al. (1999); National Oceanic and Atmospheric Administration (2013); and U.S. Department of Transportation (2013)……………….216 Table 5.5. Subsidence rates near Baytown, Texas, from 1906-2013…………………...221 Table 5.6. The height of MSL, MLW and MLLW at locations along the U.S. Gulf Coast. The difference between MSL and MLW or MSL and MLLW were used for tidal datum adjustments. Data provided by National Oceanic and Atmospheric Administration (2014)…………………………………………………………………………………...224 Table 5.7. Comparison of observed storm surge/ storm tide events at each location and the number of events ≥ than the 0.91 m threshold used in the Point Process method….230 Table 5.8. Storm surge return levels (m) for 26 locations along the U.S. Gulf Coast, using the Point Process Model………………………………………………………………..234 Table 5.9. Storm surge return levels (m) for 26 locations along the U.S. Gulf Coast, using Logarithmic Plotting……………………………………………………………………236 Table 5.10. Return periods of the maximum water level at each site using the Point Process Model and Logarithmic Plot…………………………………………..………242 Table 5.11. Expected water level exceedences above specific return periods…………244 Table 5.12. Actual exceedences above return levels using the PP method…………….245 Table 5.13. Actual exceedences above return levels using the LP method…………….246 xi Table 5.14. Two-tailed KS Statistic. Lower values indicate a better fit between observed and expected values…………………………………………………………………….247 Table 5.15. Comparison of 100-yr water levels at Galveston. Adapted from Stoeten (2013), page 55. Original table included first three studies, and results referenced to , from presentation at Galveston in Oct. 2012. These results were for entire Upper Texas Coast, and have therefore been removed from this table.…………………………………………………………………………………….249 Table 5.16. Tidal errors as percentage of the 100-year water level. Tidal data provided by NOAA Tides and Currents………………………………………………………...……253 Table 6.1. Storm surge return levels (m) for 26 locations along the U.S. Gulf Coast, using Logarithmic Plotting……………………………………………………………………277 Table 6.2. The number of oil refineries and electric power plants assigned to each of the 26 cities with adequate storm surge data……………………………………………….285 Table 6.3. Number of facilities and proportion of facilities flooded by each storm surge return level along U.S. Gulf Coast. Return levels are localized but these data are compiled from a basin-wide count…………………………………………………...…286 Table 6.4. The number of power plants flooded by various storm surge return levels at 26 locations along the U.S. Gulf Coast. 100-yr refers to the height of the 100-year storm surge level……………………………………………………………………………....289 Table 6.5. The number of refineries flooded by various storm surge return levels at 26 locations along the U.S. Gulf Coast. 100-yr refers to the height of the 100-year storm surge level……………………………………………………………………………....290 xii LIST OF FIGURES Figure 1.1. The location and height of peak storm surge levels along the U.S. Gulf Coast since 1880. Each circle represents a unique surge event. Adapted from …………………...………………………………………..…………………5 Figure 1.2. The location and height of more than 400 high-water marks produced by Hurricane Ike in 2008. Adapted from Doran et al. (2009); Federal Emergency Management Agency (2009); and Berg (2010)…………………………………………...6      .9. Time series of storm surge and storm tide observations for the four major basins that are impacted by tropical cyclone-generated storm surges…………………..91 Figure 3.1. Hourly storm position and observed high water marks for Hurricane Andrew. The storm passed closest to the location of peak surge more than five hours before the center of circulation actually crossed the coast…………………………………………133 Figure 3.2. The 14 landfall/surge classification types. An example storm is provided for each type……………………………………………………………………………..…136 Figure 3.3. Hurricane Humberto formed into a tropical storm 24 hours before the time of COO. Therefore, no observations are available for 27, 30, 33 and 36 hours before landfall………………………………………………………………………………….142 xiii Figure 3.4. Hurricane Charley was centered over the Gulf of Mexico for approximately 12 hours before COO in Southwest Florida. Therefore, no observations are included in the analysis from 15 through 36 hours before landfall, when the cyclone was centered over the Caribbean Sea………………………………………………………………....143 Figure 3.5a (left) and 3.5b (right): LOESS (red line) and linear (black line) regression models for relationship between maximum sustained wind speeds and surge magnitudes. Orange circles depict observed events………………………………………………….145    4.1. LOESS (black line) and linear (red line) regression models for the relationship between surge heights and the radius of maximum winds (nmi). Orange circles depict observed events………………..…………………………………………182 Figure 4.2. LOESS (black line) and linear (red line) regression models for the relationship between surge heights and radius of 93 km/hr (50-kt) winds (nmi) at 18 hours before landfall. Orange circles depict observed events…………………..………187 Figure 5.1. The NOS tide gauge at Calcasieu Pass, Louisiana, malfunctioned shortly after water levels exceeded 1.22 m (4 feet) on September 24, 2005, during Hurricane Rita's storm surge……………………………………………………………………………...205 Figure 5.2. The NOS tide gauge at Galveston Pier 21, Texas, malfunctioned after water levels exceeded 3.05 m (10 feet) on September 13, 2008, during Hurricane Ike's storm surge. The gauge began recording water levels again once the peak surge passed…….205 Figure 5.3. The storm surge web tool enables users to select surge data for coastal communities. In this screen shot, a user has selected all observed storm surge and storm tide heights within 16 km (10 miles) of Corpus Christi, Texas…………………...……207 Figure 5.4. A geodetic datum adjustment at Galveston, Texas, reduced the storm tide level for Hurricane Rita from 1.43 m above NGVD29 to 0.91 m above the \"annual datum\" of 2005. Rita's storm surge impacted Texas and Louisiana on September [23][24]2005. Data adapted from Knabb et al. (2006) and National Oceanic and Atmospheric Administration (2013)…………………………………………………………………..222 xiv Figure 5.5. Tidal datum adjustment at Key West reduced the storm tide for Hurricane Alma from 1.07 m above MLW to 0.87 m above MSL. Data adapted from  and National Oceanic and Atmospheric Administration (2014)………………………..223  Figure 5.9. Storm surge return levels and observed storm surges for the U.S. Gulf Coast produced by Logarithmic Plotting………………………………………………...……238 Figure 5.10. Return level plot using a probabilistic modeling approach on thousands of synthetic surge scenarios, provided by Stoeten (2013), page 56. The blue line estimates return levels at the Open Coast, which pertains to Galveston City, and the red line predicts storm surge levels closest to Baytown, Texas. These water levels are considerably lower than my data-driven estimates……………………………………..241 Figure 5.11. Water level heights generated by Hurricane Ike in 2008. This image shows that proximity to landfall is not the only important factor that influences storm surge heights. Note that Shell Beach (city 11) observed higher water levels than Morgan City (city 9) and Grand Isle (city 10), even though Ike made landfall at Galveston (city 5). Adapted from Doran et al. (2009); Federal Emergency Management Agency (2009); Berg (2010)……………………………………………………………………………...……250 Figure 6.1. Storm surge return levels and observed surge events for 26 cities along the U.S. Gulf Coast. This graphic was produced in Chapter 5……………………..………278 Figure 6.2. The location of oil refineries, power plants, and cities with surge data……283    "}, {"section_title": "Background", "text": "Through the ages, people have used observed facts to validate and test scientific theories. In the 4 th Century B.C., Greek philosopher Aristotle supported a method of logic called inductive reasoning, whereby scientific theories are built on observed facts. He applied this methodology in many ways; for example, he theorized that the world was round based on observations, such as the curvature of Earth's shadow on the moon during a lunar eclipse (Martin 2005). In our modern world, the fruits of inductive reasoning surround us. For example, the development of the electric motor, radio, television, computer and cell phone all rely on properties of electricity and magnetism that were discovered by British scientist Michael Faraday in the 19 th century. Although Faraday made discoveries through meticulous experiments and careful observations, much of his work was not readily accepted, as it contradicted the most advanced theories of his day (Hirshfeld 2006). In the past decade, tropical cyclone-generated storm surges have emerged as a major scientific problem that we do not understand very well. Hurricane Katrina's devastating storm surge in 2005 was a turning point in this field, as this massive dome of water defied the best scientific theories of the time. For example, when Katrina struck, the National Oceanic and Atmospheric Administration generalized that a category-3 hurricane would likely generate a storm surge ranging from 2.7-3.7 m ). However, Katrina generated an 8.47-m storm surge , which was the highest surge level ever recorded in the United States . This massive storm surge surprised the public and scientists alike. What was most surprising about this massive dome of water is that it was noticeably higher than the devastating storm surge generated in 1969 by Hurricane Camille along the same coastline, even though Camille made landfall as a category-5 hurricane  and Katrina as a category-3 hurricane . Following Katrina, many papers investigated the mechanisms by which tropical cyclones generate storm surge. These papers found that in addition to maximum sustained winds, other tropical cyclone parameters influence storm surge heights, including cyclone size , cyclone forward speed (Rego and Li 2009), as well as coastline shape and offshore bathymetry Resio and Westerink 2008;Westerink et al. 2008;). As if on cue, several hurricanes after Katrina demonstrated the importance of hurricane size for generating storm surge. In 2008, Hurricane Ike generated a 5.33-m storm surge along the Texas Coast, even though the storm made landfall as a category-2 hurricane . At that time, the National Oceanic and Atmospheric Administration (NOAA) generalized category-2 hurricanes as having the potential to generate surge levels from 1.8 -2.4 m . Soon after this event, NOAA removed storm surge height estimates from the Saffir-Simpson Scale. In 2012, Hurricane Isaac generated a storm tide exceeding 4.3 m in Southeast Louisiana , even though the storm strengthened to a category-1 hurricane just hours before landfall. Isaac's large size likely contributed to this large storm tide, as the storm produced tropical storm force winds extending 333 km (180 nmi) from the center of circulation for several days before making landfall . Later in 2012, Hurricane Sandy produced a devastating storm surge that killed 147 people and inflicted approximately $50 billion in damage along the U.S. Mid-Atlantic Coast . Although Sandy tracked towards the New Jersey coast as a category-1 hurricane , the storm generated a broad wind field, as tropical storm force winds extended 778 km (420 nmi) and hurricane force winds extended 333 km (180 nmi) from the center of circulation . These destructive storm surges confirmed that the category of a hurricane at landfall, which is based upon the maximum sustained wind speed, does not always correlate well with surge heights, as even category-1 and -2 hurricanes sometimes generate massive storm surges. Another area of research that has received much attention involves improving our understanding of storm surge vulnerability at specific locations. This topic became especially important after Hurricane Katrina inflicted more than $100 billion in losses , and insurance premiums increased dramatically in many coastal areas (Green et al. 2007;Mowbray 2007;Warner 2007). The Federal Emergency Management Agency (FEMA) has addressed this topic by reevaluating storm surge risk along the U.S. Atlantic and Gulf Coasts, as the agency has collaborated with the National Hurricane Center to determine storm surge potential for specific areas. FEMA is using this updated information to create new Flood Insurance Rate Maps (FIRM), which consider the risk of both freshwater and saltwater flooding. While these studies have advanced our understanding of coastal flooding, they have relied on modeling, and therefore contain a limited amount of observed data to validate the results. For example, the National Hurricane Center relied on the Sea, Lake and Overland Surges from Hurricanes (SLOSH) model to predict maximum potential surge heights in coastal areas .  used a highresolution finite volume coastal ocean model to simulate storm surge potential in Tampa Bay. Other efforts utilized the ADvanced CIRCulation model (ADCIRC) to investigate storm surge processes and potential (Westerink et al. 2008;Kerr et al. 2013 (Needham 2010). In this thesis, I developed the first storm surge database for the U.S. Gulf Coast. This dataset identified the location and height of peak storm surge for 193 unique surge events in the region from 1880-2009, compiling data from federal government sources, academic literature and newspaper archives. Portions of this thesis were published as a peer-reviewed journal article that documented the steps for creating the database, while providing an updated list of surge events in the region since 1880 . This article provided a map of historic storm surge activity in the region (Figure 1.1), which revealed that the northern and western Gulf Coast, as well as the Florida Keys, have observed many highmagnitude storm surges since 1880, while the West Coast of Florida has observed less storm surge activity. This article also provided a name for the database, which we called The Storm Surge Database, using the abbreviation SURGEDAT. Figure 1.1. The location and height of peak storm surge levels along the U.S. Gulf Coast since 1880. Each circle represents a unique surge event. Adapted from . Although SURGEDAT provided new insights into storm surge climatology, a major limitation of this dataset was that it only identified the location and height of the peak storm surge. However, large hurricanes often generate extensive storm surges that inundate hundreds of kilometers of coastline. To make SURGEDAT more useful, I led a research team to develop the dataset more extensively. In this process, we identified all high water marks for all tropical cyclones along the U.S. Gulf Coast since 1880, separated storm surge from storm tide observations, and referenced datums, or vertical lines from which high water observations are measured. This expansion generated considerably more data than the first version of SURGEDAT; for example, a map of Hurricane Ike's storm surge and storm tide observations now contained more than 400 high-water marks, instead of just the peak water level (Figure 1.2). Figure 1.2. The location and height of more than 400 high-water marks produced by Hurricane Ike in 2008. Adapted from Doran et al. (2009); Federal Emergency Management Agency (2009); and . We also expanded coverage to include the U.S. Atlantic Coast, following Beckage (2012), who developed the first peak storm surge database for this region. As of June, 2013, we had identified more than 7,600 high-water marks in the United States, including 5,200 along the Gulf Coast, and the updated SURGEDAT database was featured on the front page of Eos Transactions ). This updated version of SURGEDAT provided the first credible database for empirical storm surge analysis. This was timely, as destructive storm surges have inflicted damage from Texas to New York during the past decade, and scientific research published on this topic until this time took a modeling approach."}, {"section_title": "Objective", "text": "This dissertation builds on the momentum created by SURGEDAT to analyze surge data and build an even more extensive global database. This effort seeks to answer the following six research questions (or categories of questions): 1) How many storm surge observations are available globally, and for which ocean basins are these records provided? 2) How does storm surge along the U.S. Gulf Coast fit into a global context? How frequently does this basin experience high and low storm surges, and how do those levels of activity compare to other basins? 3) How well do storm surge heights along the U.S. Gulf Coast correlate with tropical cyclone wind speeds at and before landfall? 4) How important is tropical cyclone size for generating storm surge along the U.S. Gulf Coast? 5) How vulnerable are specific cities along the U.S. Gulf Coast to storm surge? For example, what is the 100-year storm surge level for various locations, and which statistical method(s) produce the best analysis? 6) How vulnerable is energy infrastructure to storm surge inundation along the U.S. Gulf Coast?"}, {"section_title": "Organization", "text": "The dissertation is divided into seven chapters. The first chapter provides an introduction, the last chapter a conclusion, and the five chapters in between provide analysis of storm surge data. Four of the five analysis chapters investigate storm surge along the U.S. Gulf Coast, while the other provides a global literature review of observed storm surge data. Specifically, the chapter titles are as follows: Chapter 1) Introduction Chapter 2) A Review of Tropical-Cyclone Generated Storm Surges: Global Data Sources, Observations and Impacts I conducted the global literature review in Chapter 2, and then investigated the processes by which tropical cyclones generate storm surge in Chapters 3 and 4. These two chapters have already been adapted into peer-reviewed journal articles that have been accepted for publication by Earth Interactions. I investigated the vulnerability of specific locations to storm surge in Chapter 5, and then applied these results to a study on the vulnerability of energy infrastructure to storm surge in Chapter 6. I intend to submit Chapters 2, 5, and 6 for publication after I defend my dissertation and apply minor alterations. While the chapters of this dissertation answer many questions about storm surge, they also are bound by limitations in data availability and analytical methodology. After questions are answered in each chapter, new questions are posed and future avenues for scientific research are presented. However, this work provides a pioneering step towards building a credible, global storm surge database, as well as several studies that demonstrate the usefulness of observed data for scientific analysis in the field of storm surge research.  . This publication is available on the Web at: http://www.nhc.noaa.gov/pdf/nws-nhc-6.pdf. CHAPTER 2. A REVIEW OF TROPICAL-CYCLONE GENERATED STORM SURGES: GLOBAL DATA SOURCES, OBSERVATIONS AND IMPACTS"}, {"section_title": "References", "text": "\nAschkenasy, J.  Three major environmental factors threaten energy production in this region: hurricanes, storm surges and subsidence/sea-level rise. These natural hazards have inflicted large economic losses, which are estimated to be $14 billion/year (Entergy 2012). These hazards work together, as strong hurricane winds generate high waves and storm surges, which are exacerbated by subsidence and sea-level rise. Hurricanes that form in the Gulf of Mexico, or track into the Gulf from the Atlantic Ocean or Caribbean Sea, are a threat from June -November every year. These storms frequently threaten the entire region, from Texas to Florida. For example, 12 of 18 cities along the Gulf Coast observe hurricane strikes every 10 years or less , and each of the five Gulf Coast states contain at least one of these 12 cities with active hurricane-strike climatologies. These storms have produced some of the strongest winds on Earth observed at a coastline. For example, Hurricane Camille produced maximum sustained winds of 85 m s -1 at landfall, which was only exceeded by Super Typhoon Haiyan in the Philippines in 2013 . Hurricanes have caused approximately $3.7 trillion (2010 dollars) in asset damage over past century in Alabama, Mississippi, Louisiana and Texas Entergy 2012 Katrina and Rita caused a record breaking $15 billion in losses to energy markets, twothirds of which were associated with physical damage to energy infrastructure (Kaiser et al. 2009). The combination of an active hurricane climatology and shallow bathymetry provides the ingredients for devastating storm surges in this region. This region observes an average of 18 storm surges ≥ 1 m and one storm surge ≥ 5 m every decade, which is the second highest frequency of storm surges in the world exceeding these thresholds, ranking the region behind the Bay of Bengal of high-magnitude storm surges and East Asia for low-magnitude storm surges (see Chapter 2). Hurricane Katrina generated an 8.53-m storm tide in Mississippi , which was the highest storm tide ever observed in the Western Hemisphere (see Chapter 2). Hurricane Camille produced a 7.5-m storm tide in the same area in 1969 . In 1900, the Galveston Hurricane generated a 6.1-m storm tide at Galveston, Texas , and killed at least 8,000 people , in the deadliest natural disaster in U.S. history . In addition to damaging infrastructure and rendering facilities inoperable for a period of time, high storm surges in the region have also triggered hazardous material releases. As Hurricane Camille's storm surge inundated Venice, Louisiana, hazardous materials, including oil, were released from loading and petroleum storage facilities (U.S.\nAmerican Society of Civil Engineers, 2010: So, You Live Behind a Levee! 28 pp. Report available on the Web at: http://content.asce.org/files/pdf/SoYouLiveBehindLevee.pdf."}, {"section_title": "Introduction", "text": "Tropical cyclone-generated storm surges are among the most deadly and costly global catastrophes. The most severe storm surge events have killed hundreds of thousands of people and inflicted extraordinary economic losses. For example, the 1970 Bhola Cyclone generated a 9.1-m storm surge in Bangladesh that killed approximately 300,000 people (Frank and Husain 1971;, while the 1900 Galveston Hurricane produced a 6.1-m storm surge ) that killed at least 8,000 people  in the deadliest natural disaster in U.S. history . More recently, Hurricane Katrina inflicted the most costly natural disaster in the history of the United States, as losses from this storm exceeded $100 billion . From a broader perspective, storm surge may have killed as many as 2.6 million people during the past 200 years (Nicholls 2003), or an average of 13,000 people annually. This rate fits well with the estimate of 10,000 to 15,000 annual storm surge deaths since 1850, provided by Nicholls (2006), and an annual rate of 15,000 surge deaths provided by . Most years observe less than this number of surge deaths, as several mega-catastrophes in the historical record, like the 1970 Bhola Cyclone, substantially increase the annual fatality average. Nonetheless, as many as 250 million people who live lower than the maximum storm surge level (Intergovernmental Panel on Climate Change 1994) are vulnerable to inundations from storm surge every year. Unfortunately, a thorough literature review reveals an absence of review papers that summarize available information related to global storm surge observations. In addition, the absence of a credible, global storm surge database leaves coastal populations and stakeholders unaware of coastal flooding events that have already impacted vulnerable areas. Such information would be valuable to people living in high-risk areas, as well as professionals in the fields of emergency management and law enforcement, insurance, construction, urban planning, health care, science and engineering. This chapter addresses this void in the literature by providing a global review of tropical cyclone-generated storm surge data sources, observations and societal impacts. Surge impacts are not intended to provide a comprehensive overview of all impacts experienced by this hazard, but rather a general overview of the effects of storm surge inundation on various regions. A summary of surge impacts by basin also demonstrates that certain regions are severely impacted by storm surge inundations even though the magnitude or frequency of surges may be relatively modest compared to other regions. Historical impacts do not necessarily depict the current vulnerability of these basins and sub-basins to storm surge. The development of technological innovations in the 20 th and 21 st centuries, such as wireless communications, radio, television, telephones, meteorological satellites, and, more recently, millions of personal computers networked through the World Wide Web, have worked together to inform vulnerable coastal populations of impending disasters. However, in certain regions, the coastal population has dramatically increased during the past several decades, placing millions of additional lives at risk, and perhaps countering the benefits of technological innovations. Storm surge observations found in this literature review are added to SURGEDAT, a global storm surge database . This archive provides the location and height of peak storm surge observations around the world since 1880. An interactive Web map of these data is available at http://surge.srcc.lsu.edu. The geographic scope of this chapter focuses primarily on the ocean basins that are most vulnerable to tropical cyclone-generated storm surges. Landsea and Delgado (2013) provide a list the following seven ocean basins as the most active to tropical cyclone (TC) activity: 1) Atlantic, 2) Northeast/ Central Pacific, 3) Northwest Pacific, 4) Northern Indian, 5) Southwest Indian, 6) Southeast Indian, and 7) Southwest Pacific. They also list the average annual number of TCs exceeding 17 m s -1 per basin (Table   2.1), which varies from 26 TCs/ year in the active Northwest Pacific, to a minimum of 4.8 TCs per year in the Northern Indian Ocean. Australia, New Zealand and Oceania; and 6) Southwest Indian Ocean. Table 2.2 provides a list of these regions as well as the major countries included in this chapter, while Figure 2.1 provides a world map depicting these regions. English titles or abstracts. In many of these cases, the body of the article was in Chinese, which was then translated into English for this literature review. This review focuses on tropical-cyclone generated storm surges, although extratropical cyclones and strong frontal passages sometimes cause severe coastal flooding events, particularly in higher latitudes outside the subtropics. For example, Northern Europe has experienced many coastal flood events in its history, particularly in Germany,  (Soriano 2003), and several articles he authored have become foundational for developing storm surge climatology in the region (Arafiles and Alcances 1978;Arafiles et al. 1984). Bankoff (2003) provides a comprehensive overview of natural hazards in the Philippines, including typhoons, storm surges and tsunamis. The China Meteorological Administration (2014) maintains the CMA Tropical Cyclone Data Center, which provides best-track typhoon data, satellite reanalysis data, and information related to landfalling typhoons, observed wind and rainfall. Various reanalysis projects highlighted on this website provide typhoon data as far back as 1893. However, the site does not provide observed storm surge data. China's National Maritime Bureau has produced storm surge statistics in Chinese . Most storm surge observations for China from English literature or Chinese literature with English abstracts or titles are made available through peer-reviewed journal articles. Various authors have provided summaries of the highest surge observations by time period or geographic region, which provides insight into the maximum surge potential along the coast of China. For example, Le (2002) provides the peak storm surge and storm tide heights for 18 typhoons that struck China from 1949-1997. Other sources provide the maximum water levels for 18 locations in Guangdong Province (Ma 2003;Zhang 2009). Most of these locations include at least 40 years of observations, and some records extend more than 50 years. Liu (2002) provides a similar list of peak storm surge levels for 25 cities in southeast China, for data ranging from 1949-1990. These sources summarize the highest water levels in the most surge-prone locations. The Tokyo Typhoon Center, a Regional Specialized Meteorology Center (RSMC), affiliated with the Japanese Meteorological Agency (JMA), provides TC best track data for Japan from 1951-2013, as well as a summary of TC strikes per month for this same time period. However, the typhoon center and JMA have not provided historical storm surge records in English. Gilmore et al. (1995) have provided climatological summaries for various ports in Japan, including high-water marks and storm surge history for some locations. For example, they provide a list of storm surge heights for Tokyo, Japan, during six typhoons that struck from 1911. Also, Kawai (1999 and Kawai et al. (2009) provide storm surge observations from various typhoons to strike Japan. The Joint Typhoon Warning Center (JTWC), a task force of the U.S. Navy and Air Force, provides TC reports for the Western North Pacific from 1959 -2012 (Joint Typhoon Warning Center 2014). Although these reports contain detailed information about TC tracks and intensities, as well as rain and wind observations, they generally do not provide storm surge observations. However, in some cases, these reports provide flood depths over small islands or atolls, which are essentially storm surge observations, because most of the water in these floods comes from the sea. For example, a JTWC report states that Typhoon Ophelia in 1960 put 0.61 m of water over Ulithi Atoll, a small island in the present-day Federated States of Micronesia (Joint Typhoon Warning Center 1960). As the elevation of this island is approximately 1.22 m, the maximum surge level in this storm was approximately 1.83 m."}, {"section_title": "Storm Surge Observations", "text": "Approximately one-third of the world's TCs develop in the Western North Pacific basin (Elsner and Liu 2003), making this region the most active area on Earth for TCs. An annual average of 26.6 TCs formed in this basin during the 57-year period of 1951(Japan Meteorological Agency 2009. In this basin, TCs are called typhoons. These coastal flooding events were comprised of 73 storm-surge observations, 45 stormtide observations, plus the high-water mark from Super Typhoon Haiyan in 2013, which combines storm tide plus waves. As field teams record high-water marks from this event, more accurate storm surge and storm tide observations that eliminate the effects of waves should become available. Throughout much of East Asia, typhoons often generate enormous waves that rise well above observed storm surge levels, because relatively deep bathymetry near the coastline enables wave energy to approach close to the coast before dissipating. For example, Typhoon Doug in 1994 generated a storm surge level from 1.5 -3 m near Lungtung Harbor, Taiwan, however, the storm generated destructive waves that reached a height of 20 m ).\nScientific literature provides a total of 57 storm surge or storm tide observations for the Northern Indian Ocean. Fifty-three of these observations occurred in the Bay of Bengal, along the coastlines of eastern India, Bangladesh, Myanmar and Sri Lanka, while four observations are provided from the Arabian Sea, along the coast of Western India, Pakistan and Oman. The oldest record, a 12-m storm surge that struck India in 1737 , is one of the earliest surge observations in the world. Most observations in this basin are more recent; 54 of these records occurred since 1952. Most of these surge events occur before (April-May) or after (October-November) the summer monsoon season (Ali 1996;Jakobsen et al. 2006;Fritz et al. 2010), although some cyclones occurred in June, September and December.\nThese sources provided 134 high-water observations for Australia and Oceania. Storm surge heights were provided by 105 of these observations, storm tide heights were given for 25 observations, and four data records provided the level of storm tide and waves. Observations that include waves are usually removed from storm surge/ storm tide datasets, however, in these four cases, the high-water marks that include waves are the only available observations and were therefore included in the data. These data are provided from tide gauges, debris lines, field surveys and estimation of storm surge/ storm tide levels based on water depth above ground level. In some cases, storm tide observations include the datum from which they were  Table 2.9 provides a list of the top 10 highest water levels in the region. The three highest magnitude events exceed 9 m; two of these events occurred in Queensland, Australia. Western Australia contains four observations ranked in the top 10 of this region, while three records in this list were located in Northern Territory. All of the water levels in the top-10 list are ≥ 6 m. These data suggest that storm surge is a hazard that seriously threatens at least three states and thousands of kilometers of coastline in Australia. Uncertainty surrounds several unusually high storm surges during the early portion of Australia's surge archive. The highest profile of these events was TC Mahina, which supposedly generated the highest-magnitude event in Australia's history in 1899, when a 13.7-m storm surge was observed near Barrow Point, south of Bathurst Bay (Nelson 1975). Although more literature is available for this surge event than any other in the region, some uncertainty exists regarding the actual storm surge height. This  Granger and Smith (1995) provide a storm tide estimate of 14 m and suggest that this extreme magnitude represents a 1 in 1000 to 1 in 10,000 year event for this region. Observations from other sources range from 12.19 to 14 m (Whittingham 1958;Harper 1998;Terry 2007) However, some doubt exists over the actual water level generated by Mahina. Nelson (1975) indicates that this water level estimate is unreliable. Notation from Harper (1998, pg. 22) indicates that Mahina's reported storm surge height is, \"unknown, unreliable or an estimate only.\" Nott and Hayne (2000) have cast some doubt upon this extraordinary storm surge magnitude after conducting field surveys in the region around Ninian Bay. Multiple transects in this area show that marine deposits were not found greater than 5 m above HAT. Such findings support the notion that Mahina's storm surge was less than 5 m, with the exception of some areas of wave run-up. Numerical models support these lower storm surge heights (Nott and Hayne 2000). Several other storm surge levels from the early portion of Australia's surge history are uncertain as well. In 1882, a 9.2-m storm tide described as a tidal wave submerged the Twin Islands near Cossack, in Western Australia (Nelson 1975). Based on this description, it is possible that this water level includes waves or wave run-up. Some uncertainty also surrounds a potentially massive storm surge that may have struck near Cape Tribulation, Queensland, in 1934. Two government sources provide a storm surge height of 9.1 m for this event (Emergency Management Australia 2006; Australia Bureau of Meteorology 2014), however, Harper (1998) provides a surge height of ≥ 1.8m for this event in a thorough list of Queensland storm surge observations. However, It is possible that the observation from Harper (1998), which was provided for Port Douglas, is an accurate water level but not the maximum storm surge level for this event. Maximum water levels of 9.2 and 9.1 m were added to SURGEDAT for these storms, however, I was less certain of these water levels than events in which multiple, credible sources confirm similar surge heights and locations. The islands of Oceania located farthest from the Equator experience more TCs and storm surges than those islands at lower latitudes (De Scally 2008). This pattern likely occurs because the Coriolis effect, which enables TCs to spin, is stronger at higher latitudes and negligible near the Equator. The highest observed water levels in Oceania generally range from 4-6 m. In some cases, such storm surge heights may completely wash over low-lying islands (Spennemann 1996;De Scally 2008). Six of the seven highest storm surge observations in the region range from four to 5.5 m. The 7-m storm surge observed in Fiji's Lau Island Group during TC Tomas in 2010 (Anonymous 2010) is noticeably higher than the other observations and an outlier for this region. As this record was provided in a news article rather than a scientific source, the confidence of this observation is somewhat lower than other data in the region. TCs often produce tremendous wave heights in Oceania, which may flood locations that are inland or elevated above the storm surge level. For example, in February 1990, TC Ofa made a direct hit on the island of Upolu in Samoa. Although the storm surge level on Upolu was only 1.6 m (Rearic 1990;Solomon and Forbes 1999), coastal flooding was severe, particularly east of Apia, where coastal protection was limited and the reef was narrow. Significant wave heights were 8.1 m at a buoy south of Samoa (Solomon and Forbes 1999). Wave heights on the island of Niue were approximately 18 m, comparable to the height of cliffs at some locations (Solomon and Forbes 1999). In 1987, TC Sally generated a maximum wave height of 12 m at a buoy off the north coast of Raratonga in the Cook Islands (Croad 1989; Barstow and Haug 1994;Solomon and Forbes 1999). Although TCs sometimes impact New Zealand, storm surges are not considered a major hazard in comparison to other countries (Heath 1979;Murty and Flather 1994;Goring 1995 \nRelatively deep bathymetry off the coast of Réunion suppresses storm surge levels along the coast of this island (Mayoka 1998). However, storm swells which form into large waves impact the island, particularly along the northern and eastern coasts (Mayoka 1998). Swells from Cyclone Colina in 1993 exceeded 9 m in height just 2 km off the north shore of Réunion (Mayoka 1998). Heavy rainfall has historically threatened Réunion more than storm surge or high waves. In fact, TCs that have struck Réunion have produced some world record rainfall totals. For example, TC Denise in 1966 dumped more than 1.8 m of rain in 24 hours at a settlement called Foc-Foc, which is a world record one-day rainfall total (Cerveny et al. 2007). Cyclone Hyacinthe dumped more than 5 m of rain on the same location in a 12day period in January, 1980 (Mayoka 1998). Although Madagascar experiences the most intense TC strikes in this region, few storm surge observations are available. A modeling analysis of three tropical separate cyclones in early 1994 estimates that each storm produced storm surge elevations of at least 4 m, with combined surge and wave setup elevations reaching 5 m in each event (Naeraa and Jury 1998). Peak surge levels may have reached 6 m, while waves that inundated the coast may have reached 10 m on Madagascar during that catastrophic cyclone season (Naeraa and Jury 1998; Chang-Seng and Jury 2010). However, independent observations are not available to validate these modeling results. Although TCs sometimes strike Mozambique, this country observes a relatively modest amount of TC activity when compared to other locations in this basin, like Madagascar. Less than 5% of TCs in the South Indian Ocean basin make landfall on the mainland of southeast Africa, and those that strike are generally weak (Bettinger and Merry 2012). Nonetheless, historical literature documents 13 intense TCs that have struck Mozambique from 1956-2008 (Queface and Tadross 2009;INGC 2009). In the absence of observed storm surge observations in the literature, the Sea, Lake, and Overland Surge from Hurricanes (SLOSH) model has been used to estimate storm surge potential along the Mozambique coast (Neumann et al. 2013). Storm surge levels in Mozambique may be lower than other countries along the Southwest Indian Ocean because TCs tend to approach the country from the east or northeast, and often cross Madagascar and weaken before striking the African mainland. Also, Madagascar may block large swells and storm surge that develop in the Indian Ocean, thereby shielding the African coast from much of the displaced water. However, rising sea levels threaten to exacerbate future coastal flooding associated with storm surges in Mozambique (Chemane et al. 1997;Dasgupta et al. 2009)."}, {"section_title": "The Philippines", "text": "The archipelago of the Philippines may be affected by TCs more than any nation on Earth. From 1948From -1990 typhoons entered the Philippines Area of Responsibility (PAR), which means this region observes approximately 20 typhoons per year (Soriano 1992;Bankoff 2003). During that period, 384 typhoons made landfall in the Philippines, or about nine typhoons per year on average (Arafiles et al. 1984;Soriano 1992). The country observes storm surges approximately four to six times per year (Arafiles et al. 1984). The most intense TC s ever recorded have been observed near the Philippines. Typhoon Tip in 1979 tracked through the eastern section of the PAR, but remained off shore and eventually tracked north, making landfall in Japan (Dunnavan and Diercks 1980). While east of the Philippines, this typhoon became the most intense TC in world history, registering a minimum central pressure of 870 mb (Dunnavan and Diercks 1980;Cerveny et al. 2007). Typhoon Haiyan in 2013 made landfall in Samar and Leyte, while maintaining maximum sustained winds of 87 m s -1 , which was the strongest sustained wind at landfall for any TC in world history . Due in part to the high number of super typhoons that have struck the Philippines, this nation has recorded the highest storm surge levels in East Asia. The four highest storm surges in East Asia exceeded 6.5 m and all occurred in the Philippines (Table 2.3). Typhoon Didang generated a 9.14-m storm surge in 1968 at Narvacan, Illocos Sur, in the northwestern portion of Luzon (Arafiles and Alcances 1978;Henderson 1988). Further research should be conducted on the accuracy of this surge level because it is substantially higher than other surges in western Luzon, and was presumably caused by wrap-around winds on the back side of a typhoon that clipped the northern tip of the island, while tracking towards the northwest. Although the strong typhoons strike northern Luzon more than any other area of the Philippines (Bankoff 2003), the islands of Samar and Leyte, including portions of the Eastern Visayas region of the Philippines, have more frequently observed high-magnitude storm surges. The Typhoon of Samar and Leyte generated a 7.3-m storm tide in 1897 (Bankoff 2003), followed by a 7.0-m storm surge from the Typhoon of Leyte and Cebu in 1912 (Arafiles and Alcances 1978;PAGASA 1987). In 2013, Typhoon Haiyan generated a destructive coastal flooding event at Tacloban, on the island of Leyte. The water level reached approximately 6.50 m at the Tacloban Airport, however, such measurements are preliminary and include a combination of storm tide and waves (Needham 2013). Various sources provide insight into the timing of storm surges in the Philippines. For example, historical records indicate that the 7.3-m storm tide persisted for at least three hours in southern Leyte during the 1897 typhoon (Bankoff 2003). Typhoon literature also reveals that storm surges sometimes rapidly strike the Philippines. For example, a storm surge struck the community of Tarol so suddenly in 1908 that many people did not have time to flee to safety. According to Arafiles and Alcances (1978, pg. 366), \"It was about 4 A.M. of the 13 th , when we observed that the water was rising and beginning to flood the lowland of the town, but no one gave this fact any importance as it is usual, when a typhoon passes, that the water of the river rises about a meter. But at about 6 A.M. almost suddenly the waves of the sea like mountains of water precipitated themselves upon the barrio of Tarol destroying houses and whatever they met in their way. The level of the sea rose so rapidly that only some of the inhabitants had time to escape and save their lives.\" More recently, Typhoon Haiyan's storm surge struck the city of Tacloban nearly instantaneously, as a wall of water more typical of a tsunami than a storm surge destroyed much of the city in a matter of minutes (Weber 2014). Strong offshore winds blowing from north to south over San Pedro and San Pablo Bay initially impeded the rising storm surge while Haiyan's center was positioned east of Tacloban, but as the eye of the typhoon approached the city, sustained winds at approximately 87 m s -1 suddenly blew in from the southeast and pushed a massive wall of water towards the city (NOVA 2014). This sudden storm surge inflicted catastrophic flooding in the city of Tacloban and surrounding areas. Table 2.3. Top 10 tropical cyclone-induced surge levels in the Western North Pacific from 1880-2013. Compiled from the following sources: Arafiles and Alcances (1978), PAGASA (1987), Henderson (1988), Bankoff (2003), Mai et al. (2006);Neumann et al. (2012); Needham (2013) The coastal configuration of the Philippines, including the shape, orientation and position of its many islands, bays and gulfs, has a strong influence on storm surge characteristics in the Philippines (Arafiles and Alcances 1978;Soriano 1992). This ingredient likely explains why storm surges can suddenly inundate coastal communities in this nation. In contrast to broad, open coastlines that often experience gradual water level rises as TCs approach, the Philippines sometimes experiences rapid water level rises when intense winds in the eyewall of a typhoon suddenly blow massive amounts of water into bays or narrow inlets of water. The complex coastal configuration of the Philippines also produces very localized surge levels (Soriano 1992) that can vary substantially over the distance of just several km. The Philippines is also vulnerable to tsunami inundations, as the archipelago experiences earthquakes and volcanoes that sometimes generate seismically-induced water-level rises. At least 27 tsunamis have been reported since 1603, with waves crests exceeding 25 m in the most severe events (Bankoff 2003). Unfortunately, a severe tsunami occurred in 1897, the same year that the Typhoon of Samar and Leyte produced a destructive storm surge. During the tsunami, the ocean rose 6 m above its bed along the Philippine coast (Bankoff 2003).\nStorm surges have killed more people in the Philippines than other typhoon hazards, such as heavy rain or strong wind (Soriano 1992). For example, storm surge was responsible for 1,923 of the 2,074 typhoon-related fatalities in 1984 (Soriano 1992). Storm surge also likely killed the majority of the 14,159 people Philipinos who died from typhoons from 1948(Soriano 1992. Super Typhoon Haiyan's storm surge was likely the deadliest in the history of the Philippines. The storm killed approximately 8,000 people (Aon Benfield 2014), most of whom died in storm surge on the islands of Leyte and Samar, including the city of Tacloban. The storm inflicted 13 billion U.S. dollars in economic losses (Aon Benfield 2014). Approximately 1,300 deaths from the Typhoon of Samar and Leyte in 1897 were directly caused by the devastating storm surge (Arafiles and Alcances 1978). Typhoon Irma's storm surge in 1981 drowned at least 100 people, storm surge caused many of the deaths in Typhoon Nitang in 1984, and surge caused 200 of the 882 fatalities in the Bicol region during Typhoon Nina in 1987 (Henderson 1988). Less deadly and lower-magnitude storm surge events have sometimes inundated the region around Manila Bay. Water levels in these events have reached as high as 2 m ( Perez et al. 1999). However, this is the most densely populated region in the archipelago, and even modest water-level rises cause extensive damage and displace large numbers of people. Densely populated areas around Manila Bay, such as Navotas and Malabon, may adapt to gradual sea level increases associated with climate change, but will not likely survive storm surge events (Perez et al. 1999). Storm surge also impacts the agricultural sector in the Philippines. Such impacts may be especially pronounced in areas where coastal mangroves have been converted to agriculture or aquaculture, such as fish-breeding ponds (Primavera 2000). Storm surge inflicted an annual average of $968,000 in losses from 1970-1986 in the Philippines (Henderson 1988)."}, {"section_title": "China", "text": "China's extensive coastline exposes the country to frequent typhoon strikes and inundations from storm surges. This irregular coastline is one of the longest in the world, measuring a distance of greater than 18,000 km on the mainland and more than 32,000 km when including the coastline of numerous islands (Han et al. 1995). During the 50year period from 1952-2001, China observed an average of seven typhoon strikes per year and a maximum of 12 typhoon strikes in the most active years (Xuejie et al. 2002). China's National Maritime Bureau has provided statistics on the frequency of storm surge events along the coast of China. During the 50-year period from 1949-1998, storm surges exceeding 1m were observed 270 times, surges exceeding 2m were experienced 48 times, while surges greater than 3 m occurred 15 times ). These statistics reveal that surges frequently strike China, with an annual rate of 5.4 surges exceeding 1m, 0.96 surges greater than 2m, and 0.3 surges exceeding 3m. Scientific literature in English or in Chinese with English abstracts or titles provided coastal flooding observations for 76 historical typhoons that have struck China. These records are comprised of both storm surge and storm tide observations. The body of many articles was written in Chinese, which was translated to English. Fortunately, the terms \"storm surge\" and \"tide\" often translated directly from Chinese to English, however, a common term for storm surge is translated directly into English as \"highest water rising.\" The highest storm surge level observed in China occurred in July, 1980, as Typhoon No. 8007 generated a storm surge of 5.94 m at Nandu Tide Gauge in the city of Leizhou, Guangdong Province (Liu and Wang 1989;Ma 2003, Zhang 2009. This tide gauge has consistently observed high storm surge levels, as four of the six highest water levels observed in coastal flooding events in China were recorded at this location, according to available scientific literature. These storm surge observations include a 3.52m surge produced by Typhoon No. 8616 in 1986(Le 2002, a 3.84-m surge produced by Typhoon No. 9111 in 1991 (Le 2002), and a 3.66-m surge generated by Typhoon No. 0312 in 2003 (Ma 2004). A devastating storm surge that did not peak at Nandu Tide Gauge occurred in 1956, when Typhoon No. 5612 generated a storm surge that exceeded 5 m along the shore of Hangzhou Bay, east of Hangzhou, Zhejiang Province (Wang et al. 1991;Le 2002). Although an English literature review does not capture data for the majority of the storm surge events that have struck China, various peer-reviewed journal articles summarize the highest observed water levels by location or the peak water level produced by different typhoons (Le 2002;Lui 2002;Ma 2003;Zhang 2009). These summaries ensure that the largest storm surges in the history of China are documented in the scientific literature.\nThe most deadly typhoons to impact coastal East Asia during the twentieth century both struck China, killing 50,000 people in 1912 and 60,000 people in 1922 (National Oceanic and Atmospheric Administration 1999). Although the number of deaths caused by storm surge in these events is not available, several sources provide evidence that the 1922 typhoon generated a storm surge that devastated the region around the city of Swatow, China. A New York Times article (Anonymous 1922a) reports that the typhoon generated a destructive storm surge in this region, while the Monthly Weather Review (Anonymous 1922b, pg. 435) recounts that a storm surge accompanied the storm, and that, \"houses that escaped being blown down were washed away by the waters which spread over the whole country side, and the loss of life was enormous.\" Since 1950, the most deadly storm surge events in China have killed between 1,000 and 2,000 people. Typhoon 6903 was the deadliest recent surge event in Guangdong Province, killing 1,554 people in 1969 (Zhang 2009). Typhoon Fred (Typhoon 9417) generated the most fatal surge in Zhejian Province, killing 1,216 people in 1994 (Le 2000). Some sources indicate that typhoons killed 300,000 people in China in the 1880s (Frank and Husain 1971;, however, considerable uncertainty remains regarding the timing of this event and magnitude of fatalities. Frank and Husain (1971) state that the Chinese typhoon occurred in 1881,  provides the year as 1886, and Gunn (2008) reports that an intense typhoon struck Vietnam in 1881. Bankoff (2003) indicates that a major typhoon struck Indo-China in 1881, but provides a total of 20,000 fatalities. While these sources suggest a catastrophic typhoon struck Southeast Asia sometime in the 1880s, these conflicting accounts cast doubt upon the details, specifically, the extraordinary number of deaths-five times the next highest fatality total in this region. Storm surges cause more economic loss than any other marine hazard in China (Le 2000). The surge generated by Typhoon 9615 in 1996 inflicted the most severe economic loss of any storm surge in Guangdong Province, totaling approximately 129 billion Yuan, or 20 billion U.S. dollars (Zhang 2009). Typhoon Winnie in 1997 caused 33.7 billion Yuan or approximately 5.5 billion U.S. dollars in economic loss (Le 2000), while Typhoon Fred in 1994 inflicted damage totaling 17.8 billion Yuan or nearly 3 billion U.S. dollars in Zhejian Province (Le 2000). The high population density along the coast of China increases the destructive potential for storm surges, as the 1-m coastal flood plain contains approximately 73 million people (Han et al. 1995). Past storm surge events in China have therefore caused considerable damage. For example, Typhoon Fred ruined 520 km of seawalls, flooded 189 towns and inundated more than 22 million people (Le 2000), even though the maximum surge level in this event was only 2.69 m (Le 2002). Storm surges in China also inflict severe damage on several economic sectors, including agriculture and the energy industry. Typhoon No. 9615 in 1996, for example, flooded 44,400 km 2 of farmland in Guangdong Province, the most of any surge event in the history of that province (Zhang 2009). Storm surges also threaten the onshore and offshore energy industry, including coastal nuclear and thermal power plants (Fengshu and Xinian 1989). Typhoon No. 9711 in 1997 shut down the tidal power station at Beishakou and damaged infrastructure on the Shengil oil field (Le 2000)."}, {"section_title": "Japan", "text": "From 1951-2007, an average of 5.6 typhoons per year came within 300 km of the four main Japanese islands (Japan Meteorological Agency 2008), while the number of typhoon landfalls in these islands averaged 2.9 per year (Grossman and Zaiki 2009). Many of these typhoons generated low-magnitude storm surges, however, at least two typhoons in modern-day Japan have generated substantial surges that have exceeded 3 m. In 1959, Super Typhoon Vera generated a storm surge between 3 and 4 m along the northern coastline of Ise Bay, near the city of Nagoya (Kawai 1999;Donovan and Grossi 2009). Due to the severe inundation around Ise Bay, the Japan Meteorological Agency called the storm \"Isewan.\" The storm inundated over 310 km 2 of land (Donovan and Grossi 2009). Typhoon Bart generated a storm surge with a similar magnitude in 1999, producing a surge of approximately 3.5 m in Yatsushiro Bay (Kawai et al. 2009). The timing of this surge event was unfortunate, as it occurred near the time of spring tide, enabling water to reach the roofs of single-story houses (Kawai et al. 2009). As Japan is positioned off the coast of East Asia, it is also vulnerable to coastal flooding produced by non-tropical systems, such as extratropical storms and frontal passages. Most of Japan is far enough north to observe strong cold front passages, and strong winds behind such fronts sometimes produce minor coastal flooding along westor north-facing shores, as strong winds push water from the Sea of Japan onshore. For example, the port of Otaru, which is situated on north-facing Ishikari Bay, observed a 1.7-m surge in 1951 that was produced by a non-tropical system (Gilmore et al. 1995). Historically, tsunamis have generated higher-magnitude coastal flooding events than storm surges in Japan. The most severe tsunami in Japan's history occurred in March, 2011, when a 9.0-magnitude earthquake off the east coast of Japan generated a tsunami as high as 19.5 m on the Sendai Plain of Tohoku (Mori et al. 2011). Wave runup from this tsunami reached a height of 38.9 m in Iwate Prefecture (National Geophysical Data Center 2012). In 1946, an 8.1-magnitude earthquake produced a 5-6 m tsunami on the east and south coasts of Shikoku, as well as along the east coast of the Kii Peninsula on Honshu (MCEER 2014). The Great Tokyo Earthquake of 1923 generated waves as high as 6 m on the Boso and Izu Peninsulas (MCEER 2014).\nTyphoon Vera inflicted the greatest losses of any Japanese storm surge. The storm killed 4,687 people (Kawai 1999), and most of these fatalities were caused by the severe storm surge (Donovan and Grossi 2009). The storm surge inflicted heavy losses on the city of Nagoya, turning the harbor into a \"sea of dead\" (Joint Typhoon Warning Center 1959, pg. 189), while enormous waves killed 300 people and destroyed 250 homes in the town of Handa, southeast of Nagoya (Joint Typhoon Warning Center 1959). Wind and surge damage from this event totaled $260 million in 1959 dollars (Joint Typhoon Warning Center 1959). The storm damaged 834,000 buildings, nearly half of which were damaged by flooding (AXCO 2009). Industrial losses near the harbor of Nagoya were also severe (Donovan and Grossi 2009). More recently, in 2004, Typhoon Chaba generated record-high storm tides at the ports of Takamatsu and Uno, Japan, flooding 16,799 houses above floor level in Japan (Kohno et al. 2009). Tsunamis in Japan have caused even greater losses of life and property. As of March, 2012, The National Police Agency of Japan reported 15,854 deaths and more than 3,000 people missing from the March 2011 tsunami (National Geophysical Data Center 2012). This tsunami also caused a serious accident at the Fukushima Nuclear Power Plant, damaged nearly 250,000 homes, and may carry a price tag as high as 25 trillion yen or more than 24 billion U.S. dollars (Mimura et al. 2011). Earthquake-generated tsunamis in Japan also killed 31,000 people in 1498 and 13,000 people in 1771 (National Geophysical Data Center 2012). Some sources indicate that a typhoon in Japan killed 250,000 people in 1923 (Frank and Husain 1971;. Such a catastrophe would rank among the most deadly typhoons in global history and make this event more than 50 times as deadly as any other typhoon in Japan's history. Investigation into this event reveals that an intense earthquake struck near Tokyo in 1923, and catastrophic fires resulting from the quake killed more than 100,000 people (Himoto 2007;Schencking 2008). The unfortunate timing of a passing typhoon fanned the flames into a raging inferno that was responsible for more than 90% of the deaths (Himoto 2007). While this nearby typhoon may have exacerbated the tragedy, it was not the initial cause of this disaster, and no sources indicate that storm surge contributed to this catastrophe."}, {"section_title": "Vietnam and Thailand", "text": "Destructive storm surges are less common in the history of Vietnam and Thailand than countries to the north and east, like China and the Philippines. Vietnam and Thailand are located near the southern edge of the active typhoon belt in the Western North Pacific, and typhoons that approach these countries will often weaken after encountering land, such as the archipelago of the Philippines. However, both of these countries have experienced some strong typhoons. Vietnam is impacted by four to six typhoons per year on average (Mai et al. 2008), while an average of three typhoons per year have tracked near Thailand from 1951(Vongvisessomjai 2009). TCs and associated storm surges that impact Vietnam are the greatest threat along the northern and central coastline of the country. Storm surges along Vietnam's Gulf of Tonkin have historically ranged from 0.5 -3.0 m high (Hanh and Furukawa 2007). Typhoons Linda in 1997 and Damrey in 2005 were the two most severe storm surges to strike Vietnam in recent decades. Damrey produced a storm surge of 3-4 m and pushed salt water 3-4 km inland (Mai et al. 2006;Neumann et al. 2012). Typhoon Linda in 1997 was a rare, destructive typhoon that struck southern Vietnam (Thuy 2003). Linda's surge produced the highest water levels in a 20-year period in the Mekong River Delta, as the storm unfortunately struck at high tide (Le et al. 2007). The funnel-like shape of the Mekong River estuarine area generates a high tidal range, with an average tide of 2.2 m and a maximum range of 3.2 m (Wolanski et al. 1996). After generating a destructive storm surge in Vietnam, Typhoon Linda inundated Thailand. Although observed surge data are not available for this surge event in Thailand, numerical modeling indicates that surge heights may have reached approximately 70 cm in the northwestern Gulf of Thailand (Aschariyaphotha et al. 2011). The northern portion of the Gulf of Thailand is relatively protected from storm surge because this relatively small basin has a fetch of only approximately 100 km, which may also explain why the storm surge from Typhoon Vae in 1952 barely exceeded 1 m (Vongvisessomjai 2007). Typhoons Harriet in 1962 and Gay in 1989 struck farther south in Thailand and generated higher surge and waves because they had longer fetches for displacing water (Vongvisessomjai 2007). Sea-level rise may exacerbate storm surge inundations in Vietnam, as the elevation of the majority of the Mekong Delta is less than 2 m above sea level (Wassmann et al. 2004) and the Delta is experiencing considerable subsidence (Syvitski et al. 2009). A relative sea-level rise of 20 or 45 cm would move elevation contours by 25 or 50 km, respectively (Wassmann et al. 2004), which means that future storm surges would push inland considerably farther.\nTyphoon Linda in 1997 inflicted severe damage in southern Vietnam. Fatality reports vary, as at least one source reported nearly 4,000 people killed or missing because of the storm surge (Le et al. 2007), while other sources indicated that the fatality total was closer to 600 (Aschariyaphotha et al. 2011;Vongvisessomjai 2009). Approximately 30,000 people were displaced in Vietnam, where the storm caused 472 million U.S. dollars in losses (Vongvisessomjai 2009). The wind and surge impacts of this storm were less severe in Thailand and Cambodia, but more than 30 deaths were still reported and 200 fishermen were missing due to this storm (Aschariyaphotha et al. 2011). Typhoon Damrey in 2005 killed at least 68 people in Vietnam, forced the evacuation of 150,000 and either destroyed or severely damaged schools and hospitals (LeDang 2013). Damrey's storm surge caused sea-dike breaches along more than 8km of the Nam Dinh coastline, which resulted in direct losses of more than 500 million U.S. dollars (Disaster Management Working Group 2005;Mai et al. 2008). Coastal flooding has also inflicted severe agricultural impacts in the low-lying Mekong River Delta of Vietnam, as surges have inundated croplands with salt water. For example, Typhoon Damrey flooded more than 1300 km 2 of rice fields, while also damaging irrigation systems (Mai et al. 2006). The impact of extensive storm surges could have severe economic repercussions in the region, as rice production makes up 78% of land use in the Vietnamese Mekong Delta, and Vietnam has become the third largest rice exporter in the world (Sanh et al. 1998;Wasserman et al. 2004). Sea-level rise threatens to exacerbate the impacts of storm surges in Vietnam in the future. The country ranks among the top-five developing countries that would be most impacted by 1m of sea-level rise, considering factors such as land use, economics, the extent of urban and agricultural lands, as well as population distribution (Dasgupta et al. 2009). The World Bank considers Vietnam among the top 12 countries at risk from rising seas (World Bank 2009;Neumann et al. 2012)."}, {"section_title": "South Korea", "text": "South Korea is less vulnerable to storm surge than nearby countries like China and Japan, because the country has a smaller coastline and is less exposed to TC tracks than its neighbors. On average, two or three TCs pass near the Korean Peninsula each year (Moon et al. 2003). However, the country has experienced several severe storm surge inundations from TCs. Typhoon Sarah in 1959 generated a destructive storm surge in the southern part of the peninsula, and coastal flooding was also experienced in August, 1971, and July, 1987(Moon et al. 2003. More recently, Typhoon Maemi generated a destructive storm surge in 2003, as storm surge at Masan Port reached a level of 2.30 m (Kang et al. 2009). Large tidal variations along the Korean Peninsula threaten to elevate water levels well beyond the height of storm surge. Unfortunately, the storm surge from Typhoon Maemi coincided with spring high tide, nearly doubling water levels to a maximum water height of 4.3 m above the local datum at Masan Port (Kang et al. 2009). The 9-m tidal range at the port of Inchon, South Korea, threatens to generate very high water levels if a storm surge inundation coincides with high tide (Gilmore et al. 1995). South Korea is also vulnerable to coastal flooding from TCs that strike China, as high water levels sometimes extend across the Yellow Sea. For example, Typhoon Winnie in 1997 generated water levels that broke 36-year records at the Korean ports of Kunsan and Mokpo (Moon et al. 2003), even though these cities did not experience strong winds, as the typhoon tracked more than 800 km south of the Korean Peninsula and struck China.\nAlthough storm surges in South Korea are generally smaller and less frequent than those that strike China and Japan, the most severe events have killed hundreds of people, produced millions of dollars in damage, and affected the national economy. Super Typhoon Sarah in 1959 was the worst typhoon to hit South Korea in 50 years, left 849 people dead and inflicted $200 million in damage (Oh et al. 1993;Moon et al. 2003). The storm generated a storm surge that inundated the areas near Pusan. Damage to the port of Pusan exceeded $100,000, 28,834 people were left homeless, and 15,379 homes were destroyed or damaged (Joint Typhoon Warning Center 1959). More recently, Typhoon Maemi in 2003 inflicted the most severe coastal disaster in the history of South Korea (Lee et al. 2009). This storm killed more than 117 people, left more than 25,000 people homeless, and destroyed or marooned 465 vessels (Ye 2004). Maemi inflicted 5.52 trillion KRW, or 4.8 billion U.S. dollars, in economic losses on the country (Ye 2004). Maemi's storm surge also impacted the national economy, as this surge destroyed critical infrastructure in the port of Pusan, the country's largest port, which handles approximately 80 percent of South Korea's container shipping (Ye 2004). The combined effects of wind and storm surge pushed over 11 enormous container-lifting cranes, which each weighed 900 tons (Ye 2004). Economic losses from slowed exports impacted companies such as Samsung, LG Electronics and Hyundai Heavy Industries (Chinapost 2003;Ye 2004). Although Typhoon Winnie struck China in 1997, it still generated a coastal flooding event along the Korean Peninsula that damaged more than 18 million dollars in property (Moon et al. 2003)."}, {"section_title": "Storm Surge Impacts", "text": "\nAlthough storm surge is the biggest killer in TCs globally, many of the highest fatality events in the Atlantic Basin are rain-induced disasters on steep terrain of the Caribbean and Central America. In 1998, for example, torrential rains from Hurricane Mitch killed more than 9,000 people in Honduras and Nicaragua (Guiney and Lawrence 1999). Hurricane Flora in killed more than 7,000 in the Caribbean in 1963, particularly in Haiti and Cuba. Flash flooding from torrential rains caused most of these deaths; in Cuba, rainfall amounts reached 229 cm at Velasco and 202 cm at Tacajo (Dunn et al. 1964). As approximately 50 percent of Atlantic basin hurricane fatalities occur on the mountainous Greater and Lesser Antilles (Rappaport and Fernandez-Partagas 1995, see Table 2.7), surely rainfall causes high numbers of cyclone fatalities in this basin. deaths in a town with a population of only 4,800 (Pielke et al. 2003). In addition to human fatalities, storm surge in the Western North Atlantic inflicts substantial economic losses. Hurricane Katrina was the most costly natural disaster in U.S. history , as damage from this storm exceeded $100 billion . Most of this damage was caused by the storm surge, which breeched levees and flooded approximately 80% of the New Orleans metropolitan area . Transportation infrastructure is also vulnerable to storm surge inundation along the U.S. Atlantic and Gulf Coasts. Coastal roads in these areas vulnerable to salt water inundations, as more than 60,000 miles of roads are located in the 100-year coastal floodplain (Chen et al. 2007). In 2012, Hurricane Sandy highlighted the vulnerability of public transportation infrastructure along the mid-Atlantic Coast, where the storm generated a destructive storm surge and inflicted $50 billion in losses (Blake et al. 2013). In the New York City metropolitan area, Sandy's storm surge overtopped the flood protection barriers, flooding the subway system with sea water and causing billions of dollars in damage. The Federal Transit Administration provided $5.7 billion in recovery assistance to transit agencies in New York and New Jersey following the storm  These reports contain detailed information related to TC development, tracking and intensity, while providing ground-based observations for maximum sustained winds, wind gusts, and rainfall totals. Although these reports cover several dozen TCs that impacted Western Mexico, the only quantitative storm surge height provided is the 5-m storm surge produced by Hurricane Kenna in 2002 (Franklin 2002). Coastal flooding also occurred in Hurricane Marty in 2003 (Franklin 2004) and Hurricane Norbert in 2008 (Franklin 2009), however the TC reports provide no estimates of storm surge heights or damage estimates from coastal flooding. The National Climatic Data Center prepared a comprehensive report of TC activity in the Eastern North Pacific Ocean, from 1949(Blake et al. 2009. Although this report provides an extensive history of TCs in the region, it contains no observations related to storm surge or coastal flooding. This report provides tables with chronological lists of hurricanes and hurricane statistics, as well as detailed maps of hurricane tracks and landfall points. The Monthly Weather Review provides annual TC reports for the Eastern North Pacific, as well as a publication that provides an overview of TC history in this region from 1839-1929 (Henry 1929). These publications provide a rich history of TC tracks and intensity, as well as wind and rainfall observations. Although this literature does not provide quantitative storm surge heights, some accounts do mention storm surge inundations, such as the coastal flooding event that occurred in Acapulco from Hurricane Bridget in 1971 (Denny 1972 Hurricane Madeline in 1976 were more intense at landfall than Hurricane Kenna (Franklin 2002). Also, Kenna was even more powerful before landfall, generating winds of 75 m s -1 , which classified the storm as a category-5 hurricane on the Saffir-Simpson Scale, until shortly before landfall (Unisys Corporation 2013). This observation is important because pre-landfall winds correlate better with storm surge heights than wind speeds at landfall ; See Chapter 3). Therefore, given Kenna's intensity as it approached the coast, it may have produced the highest storm surge level in the modern history of Western Mexico, and may provide an approximation of the maximum potential storm surge levels in this region. Although storm surge heights in other communities are not available for this event, surge inundation also impacted Puerto Vallarta. Unfortunately, surge heights were not measured in this location. However, at the bay near Puerto Vallerta, waves as high as 3.05 m (10 ft) were observed rushing inland from the bay (Franklin 2002).\nThe most deadly storm surge events in this region have occurred when surges and treacherous seas have sunk vessels near the Australian coast, sometimes causing more than 100 deaths. The extraordinary storm surge generated by TC Mahina inflicted the most destruction, as the storm surge and rough seas sank more than 100 vessels in a pearling fleet near Bathurst Bay (Australian Emergency Management 2013a), killing more than 300 people (Whittingham 1958;Granger and Smith 1995 Although the highest magnitude storm surges in Oceania tend to be smaller than those in Australia, the impacts of storm surge on the island nations of the Pacific are severe. Populations living on the numerous atolls in the Pacific have no escape from storm surges, as the elevation of such islands is often less than 2 m above high water (Spennemann 1996). Although volcanic islands have higher average elevations, populations in these locations are still vulnerable to storm surge because most people live near the coast. For example, most of the population and economic activity in Fiji, Tonga and Western Samoa are located on low-lying coastal areas, even though these islands are mountainous and comparatively large (Mimura 1999). Historical literature does not document many cases of storm surge causing high fatality totals in this region, however, a TC in the Cook Islands killed 1,000-2,000 people more than 400 years ago (De Scally 2008). TC-generated storm surges and waves also contribute to coastal erosion in Oceania. Such erosion is often localized and may be more severe in locations with narrow reefs or limited coastal protection. Types of erosion include sand removal and the breaking of coral, which may be deposited as coral rubble in towns or villages (Solomon and Forbes 1999). Erosion in this region threatens coastal buildings and infrastructure, while reducing the size and extent of beaches. Such impacts will likely have widespread economic impacts on places such as Fiji, which is highly dependent on tourism (Gravelle and Mimura 2008). Storm surges in Oceania also destroy long-term food and water supplies. These impacts are pronounced because such resources are often vulnerable to coastal inundation, particularly on low-lying atolls. In such locations, fresh water supplies are limited and often found in underground fresh water lenses, which are vulnerable to saltwater contamination following coastal flood events. Storm surges can contaminate these aquifers for at least 10 months (Terry and Falkland 2010). Such impacts were experienced in the atoll nation of Tokelau, following TC Percy in 2005. The cyclone generated large waves that attacked the islands from both lagoon and ocean sides, meeting in the middle of islands and completely inundating villages The Mauritius Meteorological Services provide a list of more than 40 historic TCs that impacted the Republic since 1892 (Mauritius Meteorological Services 2012). This resource provides the names, dates and years of TCs, as well as the closest distance they passed to Mauritius, the highest wind gusts and lowest pressure in each event. However, this archive does not provide any information about historic storm surge events. Mayoka (1998) provides a publication in French that gives a comprehensive overview of TCs that have impacted the French island Réunion. This publication provides a list of historic cyclones that impacted the island from 1948-1997, including the name and year of the cyclone, the closest distance each cyclone came to the island, the minimum air pressure, maximum wind gusts and maximum rainfall. The number of fatalities and amount of damage are also provided. However, this list provides no storm surge observations or impacts. This organization does not currently maintain a website in French or English, or disseminate any information related to storm surge. However, several peer-reviewed journal articles provide some details about storm surge observations and impacts on the island, such as Naeera and Jury (1998), and Chang-Seng and Jury (2010). The Instituto Nacional de Meteorologia (2013) provides weather and climate information in Portuguese for the country of Mozambique, but provides no archive of TC reports or information related to storm surges. A thorough search of academic literature provides no publications with information related to storm surge observations or impacts for this country. Although Chemane et al. (1997) provide a comprehensive overview of vulnerability in the Mozambique coastal zone, including potential impacts from sea-level rise, they do not provide any historical storm surge observations.\nWind and heavy rainfall have produced the most fatalities and damage at Réunion associated with TCs. An unnamed cyclone in 1948 inflicted 165 fatalities, which is the most in the modern history of the island (Mayoka 1998) and March 15 (Naeraa and Jury 1998). TC hazards, including storm surge, created much destruction at Tamatave Harbor, making it inoperable for nearly a year (Chang-Seng and Jury 2010). Damage at this location greatly impacted the country, because Tamatave is the most important harbor and contains the only large oil refinery in Madagascar (Le Goff 1994;Naeraa and Jury 1998). Such destruction had wide-reaching impacts, as the country faced a petroleum shortage and experienced a 10% deflation in the gross domestic product (Chang-Seng and Jury 2010). Although storm surge levels have been relatively modest along the Mozambique coast, the high coastal population density places many people at risk of inundation. Approximately 40% of the country's population lives in coastal districts (Chemane et al. 1997), which places Mozambique among the top five low-income countries worldwide with population exposed to coastal inundation (Dasgupta et al. 2011). Such vulnerability has substantial economic impacts. The coastal zone provides important resources for this low-income nation (Chemane et al. 1997), and more than 25% of the gross domestic product in the coastal region is produced in locations vulnerable to surge (Dasgupta et al. 2011). Sea-level rise also threatens some coastal cities, like Beira, where most of the city is below the high water level (Chemane et al. 1997). Such locations are vulnerable to inundation from even small storm surge events."}, {"section_title": "Northern Indian Ocean", "text": ""}, {"section_title": "Storm Surge Literature", "text": "The India Meteorological Department (2013) has recently begun posting annual TC reviews on its website. Annual reviews are available for 2010 and 2011, while preliminary reports of specific TCs are available for the 2011 and 2012 seasons. These reports provide observed data for various natural hazards associated with TCs, including storm surge. The Bangladesh Meteorology Department (2013) provides a TC webpage, however, the content on this site is devoted to TC tracks and wind fields, as well as sea surface temperature maps and satellite imagery. The site provides no observed storm surge or coastal flooding data. The Myanmar Department of Meteorology and Hydrology (2011) provides a webpage with an overview of TC disasters in this country. This site provides a list of cyclone damage and socioeconomic impacts from TCs since 1884. This list mostly provides the number of human fatalities, agricultural losses, such as number of cattle fatalities, the economic losses in the currency of Myanmar Kyats, as well as the percent of structures damaged in selected cities. This site also provides at least one storm surge height observation, from cyclone Mala, which struck near Gwa, in 2006. The Joint Typhoon Warning Center (2014) is the U.S. Department of Defense agency responsible for issuing TC warnings for the Pacific and Indian Oceans. This agency provides an archive of Annual TC Reports from 1959-2011. Unfortunately, the links to these reports were broken as of 2013. Peer-reviewed journal articles provided the majority of storm surge observations for this region.  provide the Basin's most comprehensive storm surge data. They provide a list maximum storm tide levels from 29 unique TCs that struck Bangladesh, peak storm surge levels from eight separate cyclones that affected India, surge impacts from cyclones that have struck the region since the 1970s, and a ranked list of deaths in the 22 of the most deadly TC events worldwide over the past 300 years.  and Dube et al. (2009) provide some updated storm surge observations, and use observed surge data to validate surge modeling analyses. Das (1994) provides a short list of fatalities from some TCs in this region, while providing storm tide observations for some TCs from 1970 provide observed storm surge levels and impacts from field work following Cyclone Nargis in Myanmar, while Fritz et al. (2010) provide similar observations and impacts from Oman, following TC Gonu, which struck the Sultanate in 2007. Although some of these sources separate storm surge from storm tide, none of these sources provide specific datum from which storm tide heights are measured. For example, Das (1994) provides a list of six high-water elevations, which are listed as the observed value of storm surge plus tide levels. I concluded that these water heights refer to storm tide elevations, but do not have a specific datum from which these heights are measured. In other cases, the distinction between storm surge and storm tide is a bit more ambiguous. For example,  provides a list of maximum water elevations for India, listed as, \"peak surge\" (pg. 286), whereas the observations for Bangladesh are listed as, \"observed maximum water levels\" (pg. 285). Given the wording of these observations, it appears as though the Indian observations refer to storm surge, while the Bangladesh observations are storm tide, however, some ambiguity exists over such distinctions."}, {"section_title": "Bay of Bengal", "text": "Storm surges along the northern shores of the Bay of Bengal in Bangladesh and India have reached extraordinary heights. Surge levels in the most catastrophic events range from 12 to 14 m (Jakobsen et al. 2006). The 13.7-m storm tide observed in 1876 at the Meghna Estuary was the highest water level observed in this basin. A list of the 10 highest water levels in the Bay of Bengal (Table 2.4), constructed from observations provided by , range from 8.8 to 13.7 m.  (Cho et al. 2008). This water level is approximately 3.5 m higher than the catastrophic storm tide event at Meghna Estuary in 1876, however the tsunami observation includes water run-up, while the storm tide observation refers to elevated sea levels, apart from run-up or waves. TCs also generate storm surges along the eastern shores of the Bay of Bengal, although the heights of these surges are lower than surges in the northern portion of this Basin. Storm surges in the eastern Bay of Bengal sometimes strike Myanmar, most commonly during the month of May. Surge events during this month occurred in , 1968in , 1975in (Dube et al. 2009. The Gwa Cyclone of 1982 and the Mala Cyclone of 2006 produced storm surges of approximately 4 m in magnitude along the Myanmar Coast (Dube et al. 2009), while Cyclone Nargis in 2008 produced a peak storm surge exceeding 5 m along Myanmar's Irrawaddy Delta . It should be noted, as well, that surges propagate inland considerable distances into this Delta; the 1975 surge event inundated this low-lying region at least 100 km inland , while the surge from Cyclone Nargis propagated inland 50 km . Storm surges in the southwestern Bay of Bengal are observed in Sri Lanka and southeastern India. Single cyclones in this region sometimes generate storm surges in both locations. For example, the Rameswaram Cyclone of December 1964 generated a 5m surge near Tondi, in Southeastern India, and likely produced a surge of more than 4 m along Sri Lanka's West Coast (Dube et al. 2009). The most severe surge events that have impacted Sri Lanka have occurred during the month of November, particularly during the years 1964years , 1978years and 1992years (Dube et al. 2008)."}, {"section_title": "Arabian Sea", "text": "Storm surges along the coast of the Arabian Sea are less frequent and have lower magnitudes than in the Bay of Bengal. The lower frequency can partly be attributed to climatology, as TCs in the Bay of Bengal occur four times more often than in the Arabian Sea (Singh et al. 2001). It is possible that the lower magnitudes can be explained, at least in part, by the fact that the northern Bay of Bengal is quite shallow and has a concave shape, which may enhance surge levels compared to the Arabian Sea. Although TCs rarely strike coastlines along the Western Arabian Sea, several intense TCs in the past decade have produced severe flooding from both heavy rains and storm surge. TC Gonu struck the Sultanate of Oman in 2007, followed by TC Phet in 2010, which also struck Oman. TC Gonu produced the highest storm surge levels recorded along the Arabian Sea, as water levels near the eastern tip of the Arabian Peninsula, at Ras al-Hadd, reached approximately 5 m (Fritz et al. 2010). This was a storm tide observation and likely included waves because many observations used rafted debris or exterior mudlines as indicators of water-level heights (Fritz et al. 2010). Nonetheless, these coastal flooding observations are substantial and indicate that largemagnitude storm surge events threaten this region. This cyclone developed into a category-5 TC in this region with winds of 72 m s -1 (Unisys Corporation 2013), becoming the most intense TC on record in the Arabian Sea (Fritz et al. 2010). The cyclone weakened to a category-1 TC with winds of 41 m s -1 as it passed just offshore of the easternmost tip of the Arabian Peninsula. In May/June of 2010, TC Phet formed in this region and quickly developed into a category-4 TC with winds of 64 m s -1 (Unisys Corporation 2013). The storm made landfall in Oman as a category-2 cyclone, with winds of 46 m s -1 , and generated rainfall and storm surge flooding. Storm surge observations in the eastern Arabian Sea region generally range from 1-3 m. Several modeling experiments have predicted higher storm surge heights, but observations have not been identified to validate these results. For example, models predicted a maximum sea surface height of approximately 4 m in the Porbandar Cyclone in 1975 along the Gujarat Coast (Dube et al. 1985;, however, the maximum observed surge level available for this event was approximately 2.8 m (Dube et al. 1985;. A model hindcasted maximum surge levels of approximately 5 m for the Kandla Cyclone in June 1998, however, the maximum observed surge level found in the literature was approximately 2.5 m at Kandla (Chittibabu et al. 2000;Dube et al. 2009). Finally, a surge model predicted a 4-m surge along Pakistan's Badin/ Keti Bandar Coast, near the Indian border, from a TC that struck in May 1999 (Siddiqui 2009). Unfortunately, no observations were provided for validation. The difference between observed and modeled surge heights in these cases may not be an indication of poor model performance, but rather sparse observations. Although the observational record does not provide a storm surge height greater than 3 m, precautions should be taken related to coastal planning in this sub-basin because modeling results consistently suggest higher storm surge levels are possible.  . These events inflicted even more fatalities than the 2004 tsunami, which killed nearly 228,000 people (United States Geological Survey 2008). Table 2.5 lists the top 10 fatality totals for TCs that have struck this basin. Although it's not possible to separate deaths caused by storm surge from deaths caused by wind damage in these events, given the extraordinary storm surge heights that have occurred along the low-lying coasts of the Bay of Bengal, storm surge most likely accounts for the majority of these deaths. The fatality totals in these events are truly extraordinary; at least 138,000 people died in each of the six most deadly events. At least 15 cyclones in Bangladesh and India have killed 5,000 people .  . This was the eighth deadliest TC in world history and the most costly Indian Ocean cyclone . Also, storm surges in November 1964, November 1978and November 1992 inflicted fatalities and property loss in Sri Lanka ; the 1978 cyclone killed 373 people (Murty 1988   in Mississippi, with total water levels, including waves, exceeding 10 m in some locations (Fritz et al. 2007). Hurricane Camille in 1969 generated a 7.5-m storm tide in nearly the same location . Records of many small and medium storm surges are also available for the U.S. Gulf Coast, which explains the abundance of observations for this sub-basin. The Eastern Gulf of Mexico, particularly the West Coast of Florida, is also vulnerable to non-tropical storm surges, generated by passing cold fronts and extratropical storms. In some locations, non-tropical storm surge levels have exceeded water levels generated by TCs. For example, the \"Storm of the Century,\" or \"Superstorm,\" of March, 1993, generated record water levels in Western Florida, north of Tampa. Storm surge heights ranged from 2.74 -3.66 m from Pasco to Taylor Counties (National Weather Service 2013). The storm surge during this event at Cedar Key, Florida, reached 2.9 m, surpassing the 2.59-m surge generated by Hurricane Alma in 1966 , which is the highest water level produced by a TC at this location. The \"Perfect Storm\" in November, 1991, caused coastal flooding unusually far north, as Boston observed a 1.52-m storm surge and storm tide levels exceeding 4.27 m (National Oceanic and Atmospheric Administration 2014). The highest waves from Boston to the coast of Maine reached 9.14 m, and storm surge in Maine exceeded 1 m (National Oceanic and Atmospheric Administration 2014). The \"Great Nor'easter\" of 1992 generated unusually high water levels in New York and New Jersey, where storm tides in New York City reached 3.66 m, and record water levels were recorded in New Jersey, where Sandy Hook observed a storm tide of 3.14 m and Atlantic City, New Jersey, observed a storm tide of 2.83 m (National Oceanic and Atmospheric Administration 2014). Other nor'easters that generated substantial storm surge along the U.S. Atlantic Coast included \"No'Ida\" in 2009, the 1993 \"Superstorm,\" the \"Blizzard of '78,\" and a nor'easter in 1956 (National Oceanic and Atmospheric Administration 2014)."}, {"section_title": "The Caribbean, Mexico and Central America", "text": "The 6.5-m storm surge observed in 1932 at Santa Cruz del Sur in Camaguey, Cuba (Pielke et al. 2003), demonstrates that island locations in the Caribbean are also susceptible to major surge events. Various sources also provide evidence of major surge events in Mexico and Central America. which casts uncertainty about numerous high-magnitude surge events in these areas."}, {"section_title": "Canada", "text": "Although tropical storm surges have been observed in Canada, these events have generally been low-magnitude inundations. The five observations provided by the historical literature are remarkably similar, as all of these inundations range from 1.2 -1.5 m. These levels fit well with the assessment that storms along the coasts of Canada can produce storm surges up to 2 m in height (Danard et al. 2003). These observations have occurred in New Brunswick, Nova Scotia and Prince Edward Island. Hurricane Juan generated what is considered to be the highest tropical storm surge in the region, when it generated a 1.5-m surge at Halifax, Nova Scotia, in September, 2003(Bowyer 2003. The surge peaked as tides were high, producing a storm tide level of 2.9 m, which was a record for Halifax Harbour (Bowyer 2003). Significant wave heights along the Nova Scotia coast reached 9-13 m, and maximum wave heights reached 19-20 m (Bowyer 2003). Extra-tropical storm surges in Atlantic Canada have sometimes produced storm surges that are slightly higher than tropical storm surges. For example, a storm surge of approximately 2 m was observed at Argentia, Newfoundland, in January, 1982 (Murty and Greenberg 1987). The following year, in October, 1983, a storm surge at Cape Breton Island, Nova Scotia, produced debris lines as high as 1.5 m above the normal high water mark (Danard et al. 2003)."}, {"section_title": "Hawaii", "text": "The Hawaiian Islands observe modest storm surge heights when impacted by TCs, due, at least in part, to the steep slope of the terrain both offshore and onshore. Deep offshore bathymetry enables underwater currents to redistribute storm surge, moderating water level rises . However, the steep offshore bathymetry also enables large waves to approach closely to the Hawaiian coast before breaking. For this reason, most of the scientific literature uses the terms \"heavy surf\" or \"high surf\" to describe TC-induced coastal flood events. The literature usually provides surf heights instead of storm surge levels to describe high water events. Surf heights tend to represent a combination of wave heights and storm surge levels in most of the literature. The highest surf levels approach or exceed 10 m on the coast during TCs that impact Hawaii. In 1957, Hurricane Nina produced the highest coastal surf levels found in the literature, as the storm pounded the South Kauai Coast with surf levels of 10.67 m (Blumenstock 1957). The literature provides many other events in which surf levels reached at least 3.05 m (10 ft). Observations from Hurricane Diana in 1972 and Iniki in 1992 are valuable because both surf and storm surge levels are available for these events. Diana produced 9.14-m surf along the Puna Coast of the Big Island, while storm surge levels at Hilo ranged from 1.22-1.52 m (Central Pacific Hurricane Center 1972). Iniki impacted the South Kauai Coast most severely, with high-water marks from storm surge and waves approaching 9.14 m, and storm surge ranging from 1.22-1.83 (U.S. Department of Commerce 1993), which is the highest water level not including waves found in the literature for Hawaii. The heights of tsunami waves in Hawaii have equaled or exceeded the highest surf levels generated by TCs. The April 1, 1946, Aleutian Island Earthquake generated a massive Pacific-wide tsunami that produced wave run-up as high as 16 m in Hawaii (Lander and Lockridge 1989;Johnson and Satake 1997), while the May 23, 1960, Chilean earthquake generated a 10.67-m wave at Hilo (Eaton et al. 1961). Damage estimates were made available for Puerto Vallarta, where storm damage totaled $5 million U.S. Dollars, most of which was caused by the storm surge (Franklin 2002). Hotels along the coast observed most of the damage. Extensive surge damage also occurred in San Blas, where the media reported that 80 to 90% of the homes were damaged or destroyed (Franklin 2002). Storm surge and waves also impacted marinas and the fishing industry, as these forces combined to transport shrimp boats more than In June, 1971, Hurricane Bridget generated a storm surge and destructive waves that sank 20 boats in Acapulco Bay and damaged waterfront facilities (Denny 1972). At the time the storm struck, it was the most violent hurricane to hit Acapulco in more than 25 years. Damage in the Acapulco area was estimated at $40 million U.S. dollars (Denny 1972 1996. This publication compiled these records from various sources, including Whittingham (1958), Holthouse (1971), Harvey (1974) and Nelson (1975). Terry (2007) provides more than 10 storm surge and storm tide heights in Australia and Oceania since 1899, including a table with surge observations, a storm tide graph from a coastal flooding event in Samoa in 2004, and some inundation photos and TC tracking maps. Haigh et al. 2013provide a list of the largest observed tropical cyclone-generated storm surges at 17 tide gauges in Australia, as well as the ranking of those surges at each site."}, {"section_title": "Global Comparison", "text": "This comprehensive literature review makes it possible to compare storm surge literature, observations and impacts by region. These comparisons are only as strong as the supporting literature. In other words, the number of available storm surge observations for a given region is dependent on both the climatology and the available literature, and some areas with fewer identified storm surge events may lack a robust dataset because of sparse literature, while a less active storm surge climate may explain why other regions observed fewer surges."}, {"section_title": "Comparing Global Surge Literature", "text": "Federal government sources provide the most comprehensive storm surge data in Academic sources provide excellent information on storm surge observations and impacts for various regions. For example, peer-reviewed journal articles provide most of the historic storm surge data for China in literature in English or with English titles or abstracts. Harper (1998) provides a comprehensive list of observed storm surge data for Queensland, Australia, which supplements government sources to provide a robust dataset for that region.  provide the most comprehensive data for the Northern Indian Ocean, as they provide the maximum water levels for more than 35 TCs that impacted Bangladesh and India. The SURGEDAT project at Louisiana State University provides a comprehensive storm surge database for the U.S. Gulf Coast , as well as a global storm surge database comprised of surge events since 1880 . This project compiles data from many sources, including governmental organizations, peer-reviewed literature and historic newspapers."}, {"section_title": "Comparing Global Surge Observations", "text": "The global storm surge literature review discovered 702 unique storm surge or storm tide events around the world since 1880 (Table 2.10). The majority of these events came from the Western North Atlantic basin, which observed 388 events, or approximately 56% of the total.  (Figure 2.2). Storm surge literature provided few events for the Eastern North Pacific and Southwest Indian oceans, as only three events, or less than one-half of one percent of the observations came from these regions.  A breakdown of these surge observations in the four major storm surge basins reveals that one region or country in each basin typically provides more than half of the observations in that basin, while other sub-basins or countries divide the remaining observations. For example, the majority of high-water levels in the Western North Pacific come from China, where peer-reviewed journal articles provided an abundance of surge data, accounting for 64% of observed water levels in this basin (Figure 2.3). The Philippines provides nearly one-quarter of the observations in this basin. Slightly more than half of the observed water levels in Australia and Oceania come from Queensland, while nearly one-quarter of the events were located in Western Australia (Figure 2.4)."}, {"section_title": "Philippines 23%", "text": "Vietnam 1% China 64% S. Korea 2% Japan 9% Micronesia 1% Figure 2.4. Australia and Oceania storm surge distribution graph. Storm surge and storm tide observations in Bangladesh account for more than half of the total observations in the Northern Indian Ocean, while the Indian Coast along the Bay of Bengal accounts for approximately one-third of the events (Figure 2.5).  Finally, the U.S. Gulf Coast provides 62% of the observations in the Western North Atlantic, followed by the U.S. Atlantic Coast, which provides 28% of the water levels ( Figure 2.6). The Caribbean Sea, Central America and Eastern Canada collectively provide the remaining 10% of the observations in this basin. A basin-by-basin comparison of storm surge heights is challenging because data availability varies considerably between basins. Therefore, a lack of observations over a period of time in a given basin may be identifying a lull in tropical weather, or potentially reveal a lack data for surge events that actually occurred. In many cases, data availability likely relates to both climatic and social factors. Fortunately, comprehensive storm surge data are available for several sub-basins over a period of at least 50 years, enabling comparisons between some of the regions that are most prone to tropical storm surge inundations. These data are provided as either summary statistics for a sub-basin or actual storm surge and storm tide observations taken from SURGEDAT.  Table 2.11 provides the quantity of storm surge and storm tide events that exceed 1m, 2m, 3m and 5m in each of these sub-basins. I chose the lowest three threshold levels to match the statistics provided by China's National Maritime Bureau, and I added the 5m-threshold to capture the highest magnitude storm surges in each of these sub-basins. The number of coastal flooding events exceeding each threshold was then converted to the number of events per decade in each sub-basin, using the number of exceedences and the length of data record for guidance (Table 2.12, Figure 2.7).  The U.S. Gulf Coast ranks second for both high-and low-magnitude storm surges. This basin observes 18 surges ≥ 1m per decade, which is one-third the rate of China. However, this rate is more than double the rate observed by the other sub-basins. The U.S. Gulf Coast also places second for high-magnitude storm surges, as the basin observes one surge event ≥ 5m per decade. However, this rate is only one-fifth the rate of 5m surges in the Bay of Bengal.  Alaska. (Reimnitz and Maurer 1979). Storm surges have reached at least twice as high as these levels in each of the four most active basins that observe TC-generated surges."}, {"section_title": "Comparing Global Surge Impacts", "text": "Storm surge kills more people in the Northern Indian Ocean, specifically along the shores of the Northern Bay of Bengal, than anywhere else in the world. Bangladesh and India have experienced 15 of the 21 TCs that have generated 5,000 or more fatalities through the late 1990s , see Table 2.13), and the 138,000 casualties inflicted by Cyclone Nargis in 2008 in Myanmar , reveals the vulnerability of the eastern Bay of Bengal as well. From another perspective, six TCs in the Bay of Bengal have killed at least 138,000 people ). The extraordinary fatality totals in this region is best captured by the fact that cyclones in the Bay of Bengal inflict approximately 80-90% of worldwide TC fatalities, although TCs in this region account for only 5-6% of the global total (Chowdhury 2002;Paul 2009). Storm surges are the predominant reason for these extraordinary fatality totals, as the majority of cyclone-related deaths in this region are caused by drowning due to storm surge (Ikeda 1995;Chowdhury et al. 2007). The Western North Pacific ranks second in the world for storm surge fatalities. Cruz del Sur, Cuba, which caused nearly 3,000 deaths (Pielke et al. 2003). However, the deadliest hazard associated with TCs in this basin has been flooding from heavy rains on steep mountains in the Caribbean Sea and Central America.  "}, {"section_title": "Discussion", "text": "The time series of global storm surge observations ( would likely provide more storm surge observations than areas with less structured governmental support. Likewise, people in areas with higher levels of physical and technological infrastructure are able to connect easier with the outside world, and thereby share storm surge observations with a larger audience. Natural hazard observations would also likely increase in areas with higher education and literacy rates, as a higher proportion of the population could record and communicate localized coastal flooding information through verbal and written media. A combination of these factors likely explains why so few storm surge observations are available for the North East Pacific and Southwest Indian Oceans.  , as well as a global storm surge database of surge events since 1880 ). This literature review identified 702 storm surge observations since 1880. Approximately 56% of these events were in the Western North Atlantic Basin, followed by 19% of the events in Australia and Oceania, and 17% of the events in the Western North Pacific. Storm surge observations were sparse in Eastern North Pacific and Southwest Indian Ocean basins, as these regions combined to provide only three highwater marks. Such geographic variability is greatly impacted by regional differences in data recording and dissemination, however, the number of TCs that strike populated areas in each region also contributes to these differences. The deadliest storm surges in world history have consistently occurred in the Bay of Bengal. Approximately 80-90% of worldwide TC fatalities occur in this sub-basin, although this region only experiences 5-6% of the world's TCs (Chowdhury 2002;Paul 2009). Bangladesh and India have experienced 15 of the 21 TCs that killed at least 5,000 people through the late 1990s , and in 2008, Cyclone Nargis killed 138,000 people in Myanmar, in the eastern portion of the Bay of Bengal ). Most TC deaths in this basin come from storm surge drowning (Ikeda 1995;Chowdhury et al. 2007 Westerink et al. 2008; and tropical cyclone size (Blain et al. 1998;) have on storm surge development. Such research has shown that these factors contribute to the height, extent and timing of storm surge. However, one area that has not received much attention is the impact of pre-landfall hurricane winds on storm surge at coastlines. To date, only    (Franklin et al. 2006). The next year, Hurricane Katrina struck coastal Louisiana and Mississippi generating a storm tide that reached a peak elevation of 8.53 m near Pass Christian, Mississippi . This was the highest surge level in modern U.S. history . In addition to Katrina's large size ) and shallow bathymetry along the storm's track ) strong pre-landfall winds likely also contributed to its massive storm surge. Katrina's peak winds in the Gulf of Mexico reached as high as 278 km/hr (150 knots) (Bevan II et al. 2008), placing the storm well over the minimum wind speed threshold of a category-5 hurricane. However, as Katrina approached the Louisiana and Mississippi Coasts, the storm weakened, making final landfall as a category-3 hurricane with maximum sustained winds of 194 km/hr (105 knots) . To better understand the role of wind timing in storm surge generation, this chapter investigates the role of pre-landfall winds as a predictor of storm surge height in more detail than previous research. I examine a storm surge dataset for the U.S. Gulf Coast that is substantially longer than the limited dataset employed by , thereby including a greater sample size of tropical storms and hurricanes. The two objectives are: 1) to produce a landfall/surge classification system that characterizes the location of landfall relative to the peak storm surge for hurricanes that impacted the U.S. Gulf Coast, and 2) to use this landfall classification to test the relationship between storm surge levels and wind speeds at 3-hour increments preceding landfall for tropical cyclones along the U.S. Gulf Coast.\nThese results are timely as the scientific community is re-evaluating the tropical cyclone parameters that are most influential on storm surge generation. For decades, the National Hurricane Center associated wind categories on the Saffir-Simpson Scale with potential storm surge heights, assuming higher category hurricanes will typically generate larger storm surges. This association was discontinued after Hurricane Ike made landfall as a category-2 hurricane but generated a massive 5.33-meter surge along the Texas Coast in 2008 . At the time, the Saffir-Simpson Scale generalized category-2 hurricanes as having the potential to generate a surge of 1.8-2.4 m ). Ike's surge occurred approximately three years after Hurricane Katrina made landfall as a category-3 hurricane but generated the largest storm surge in modern U.S. history ). Katrina's surge of 8.47 m ) was noticeably larger than the 7.5-meter surge generated by Hurricane Camille in 1969 ), which made landfall as a category-5 hurricane in the same region. Hurricanes Katrina and Ike revealed the importance of hurricane size on storm surge generation, as the size of these storms likely contributed to their large surge magnitudes   . However, Danny's peak surge was only 2.44 m (National Hurricane Center 1985), or about 1.31 m lower than Lili's peak surge of 3.75 m . How did Lili generate a storm surge more than 50% higher than Danny, when both storms made landfall with identical wind speeds? The physical profile of the coastal region, including bathymetry, proximity to the coastal shelf, as well as the shape and geometry of the coastline, does not likely explain the difference. These variables should have been nearly constant in these two storms, although changes in the coastline over time from coastal erosion, subsidence and other issues related to the coastal morphodynamics in this region may have had a slight influence on surge heights. Hurricane size does not explain this difference either, because Danny's geographic size was comparable or larger than Lili's, even though it generated the smaller storm surge. Hurricane Lili was a small hurricane; the radius of maximum wind was only 19 km (10 nmi)  their measurement. The distance I measured was slightly larger than the distance provided by Hsu and Babin (2005). No eye was visible on thermal infrared imagery for Lili at the time of landfall. I utilized GOES 06 infrared satellite imagery, with 30-min temporal resolution and pixel size of 4 x 8 km to measure the size of Hurricane Danny. No eye was clearly visible 18 hours before landfall, however, a discernible eye was visible at the time of landfall, and a distance of 56.5 km (30.5 nmi) was measured. Although these results make it difficult to make an exact size comparison between Danny and Lili, because they were measured at different time intervals before landfall, they do suggest that Danny was comparable in size or larger than Lili, which rules out the possibility that size differences contributed to the differences in surge magnitudes. As various parameters, such as storm size, bathymetry and landfall wind speeds are eliminated as the explanation in the difference of these two surge magnitudes, the difference in pre-landfall wind speeds emerges as the most likely explanation. Although the maximum sustained wind speeds of these storms were identical at landfall, Lili was a powerful category-4 hurricane with winds of 232 km/hr (125 knots) while centered over the north central Gulf of Mexico , while Danny strengthened as it approached the coast, reaching its peak intensity around the time of landfall (National Hurricane Center 1985). The difference in seasonal timing may have also contributed to the differences between these two storm surge events, as  . In contrast, the 1900 Galveston Hurricane was a relatively small storm, with an Rmax size of 26 km (14 nmi) . Although the 1900 Galveston Hurricane was a smaller storm, it generated a higher storm surge, which reached a height of 6.1 meters ). This was slightly higher than Hurricane Ike's peak surge, which reached 5.33 m . Pre-landfall winds emerge as the most likely reason that the 1900 Galveston Hurricane generated a higher surge. The storm was a powerful category-4 hurricane with a maximum sustained wind speed of 232 km/hr (125 knots) at 18 hours before landfall, which enabled the storm to produce large swells and thunderous surf that were observed on Galveston Island well before the strong winds arrived Larson 1999;. Hurricane Ike, however, was a category-2 hurricane with a maximum sustained wind speed of 176 km/hr (95 knots) at 18 hours before landfall, and oscillated between category-2 and category-3 intensity as it approached the coast. The bathymetry related to both storms should have been relatively constant. The storm surge history of the Florida Keys further supports the notion that prelandfall winds are important for generating high surges. In particular, the 1935 Labor Day Hurricane provides clear evidence of the potential for compact, intense hurricanes to generate catastrophic surges. This cyclone generated a 5.49-m surge in the Florida Keys (U.S. Corps of Engineers 1935), which is the highest modern-day storm surge in this region . Interestingly, this storm was also the smallest tropical cyclone to strike this region. The Rmax size of this storm was only 11 km (6 nmi) , which made it one of the smallest tropical cyclones to ever strike the United States. Intense, pre-landfall winds likely explain how this small storm was able to generate such a high storm surge. This storm was a category-4 hurricane 18 hours before landfall, and generally strengthened as it approached the Keys, reaching category-5 strength approximately six hours before landfall . While these comparative storm surge events provide substantial evidence that prelandfall winds are important for storm surge generation, they also demonstrate that we must be careful about categorizing hurricanes by their landfall intensities when referring to coastal flooding. For example, both hurricanes Danny and Lili made landfall as category-1 hurricanes in South Louisiana, but Lili was a category-4 hurricane before landfall and produced a storm surge height 50% higher than Danny. Suggesting that both of these storm surges were generated by category-1 hurricanes may mislead readers into believing that little relationship exists between maximum wind velocity and storm surge heights. Although Hurricane Ike is usually referred to as a category-2 hurricane that generated a massive storm surge, spline-interpolated wind and position data indicate that the storm actually crossed the category-3 threshold multiple times as it approached the Texas coast . Meanwhile, Hurricane Charley is often referred to as a category-4 hurricane that generated a small surge. However, nine hours before landfall the storm was only a category-2 hurricane and at 18 hours before landfall, when the strongest relationship exists between surge heights and maximum sustained winds, Charley was centered in the Caribbean Sea, south of Cuba, and was therefore displacing only a minimal amount of water in the Gulf of Mexico. While differences in storm size and bathymetry surely enabled Ike to generate a larger surge than Charley, the importance of these parameters is likely overemphasized when referring to Ike as a category-2 hurricane and Charley as a category-4 hurricane. A comparison of these storms further supports the importance of pre-landfall winds, as Ike was actually a more intense tropical cyclone than Charley at nine hours before landfall , and Charley was not even centered over the Gulf of Mexico 18 hours before landfall. Some may argue that Charley generated a relatively small surge because the bathymetry off the coast of southwest Florida is too deep to enable hurricanes to produce high storm surges in this region. However, other coastal flooding events in this region prove that relatively high storm surge levels can be reached in southwest Florida. In 1992, hurricane Andrew generated a 4 m storm tide at North Highland Beach (Risi et al. 1995;Tedesco et al. 1995; km/hr (22.1 knots) and a minimum forward speed of 5.9 km/hr (3.2 knots).\nThese results indicate that storm surge is a considerable threat to energy facilities along the U.S. Gulf Coast. The 200-and 500-year storm surges threaten the most infrastructure, however, storm surge return levels used in this study were estimated through logarithmic plotting methods employed in Chapter 5, which were not designed to predict storm surge return levels beyond the length of the observed data, which was a 114-year period. As such, 100-year storm surge levels are the highest credible water levels provided in this study. Caution should be taken when considering the 200-and 500-year levels, nonetheless, I included these time periods in this analysis, as they may provide the best available estimates of surge levels at these return periods. Although I usually assigned refineries and power plants to the closest city for which storm surge data were available, the matching of facilities and cities sometimes covers relatively long distances and crosses state boundaries. Therefore, we should take caution to consider that facilities are located near cities with storm surge data, not at these cities. For example, the one refinery assigned to Dauphin Island, Alabama, is actually located in the state of Mississippi, but was closer to Dauphin Island than Biloxi/ Gulfport. The greatest distances between facilities and cities usually occur when refineries or power plants are located well inland, but storm surge models suggest the location could be inundated by an extreme storm surge. Data for Morgan City provide the best example of this pattern. Only one of the 18 electric plants assigned to Morgan City actually has a physical address in that location. The other facilities were located in Broadmoor, Baldwin, Centerville, Garden City, Hahnville, Houma, Norco, Plaquemine, Port Allen, Saint Gabriel, Seymourville, and Thibodaux, Louisiana. The three plants in Plaquemine are located more than 50 km north of Morgan City, and the distance between the Port Allen plant and Morgan City is approximately 85 km. These distances are considerable, and these locations have not previously observed storm surge flooding in recent memory. However, models suggest that these facilities may be vulnerable to the most extreme storm surges, as the elevation of all of these plants is less than 8 m, and elevations just west of these areas, near the Atchafalaya floodplain and Intracoastal Waterway, are only several meters above sea level. Also, all of these plants are located along or to the south of the I-10 corridor, which has been vulnerable to past storm surges.  et al. 2008), while Cyclone Nargis in 2008 pushed a storm surge inland more than 50 km in the same region . Numerous power plants in Ascension Parish, Louisiana, were assigned to Frenier, a small community on the western shore of Lake Pontchartrain. The distance between Frenier and these plants exceeds 50 km, though surge affecting these locations would most certainly pass near Frenier to get there. Although models indicate that storm surge could potentially reach these facilities, this study suggests that these plants are beyond the reach of the 100-year surge. Due to the large distance between Frenier and many of its assigned plants, I estimate that the 100-year surge would inundate only 13% (2 of 15) of the plants in the Frenier group. On the contrary, the 100-year storm surge would inundate 75% (3 of 4) of the refineries near Frenier. Although storm surge heights can be localized and vary considerably between two nearby locations, errors in this study are minimized by the fact that long distances between facilities and cities typically occur when facilities are located inland. In most cases, the closest city with surge data accurately represents the storm surge climatology near the location where storm surge would hit the coast and begin working inland. As such, long distances between facilities and cities do not typically extend along the coastline, where storm surge heights could vary greatly between two distant locations. Although I accounted for levees along the Mississippi River and Industrial Canal of New Orleans, another limitation of this study is that I did not consider the influence of any other levees or flood control structures. Such features may reduce the vulnerability to both fresh-water and coastal flooding, and likely decrease the risk of storm surge inundation provided by this analysis. The United States contains vast public and private levee networks, which may extend for more than 160,000 km across the landscape (American Society of Civil Even if facilities are protected by a levee, it is important to remember that no levee is flood-proof, and levees may provide a false sense of security. In some cases, levees may actually attract more development to flood-prone areas, in a pattern known as the \"levee effect\" U.S. Global Change Research Program 2009). However, high-magnitude floods sometimes cause the widespread failure of flood defense systems, causing widespread economic losses. For example, Hurricane Katrina's massive storm surge destroyed, breached or damaged more than half of New Orleans' levees (Van Heerden 2007), which led to the flooding of 80% of the metropolitan area . In the previous decade, a rain-induced flood in the Upper Midwest in 1993 caused approximately 70% of the levees in this region to fail (Tobin 1995). In both of these cases, catastrophic flooding occurred behind levee systems. Nonetheless, levees usually protect communities from floods and areas inside a levee system are less vulnerable to flooding than areas outside. As such, it is important to note that not every facility will flood when a local storm surge height exceeds a facility elevation. The limitations imposed by both scaling problems and the presence of levees is perhaps best demonstrated by considering the vulnerability of refineries near Galveston, Texas. At a first glance, it may appear that Galveston is in grave danger, because the 50year storm surge is higher than 100% (3 of 3) of its refineries. Upon closer examination, however, the energy facility database indicates that all of these facilities are located in Corps of Engineers 2012). In this case, this study provides assurance that the ring levee around Texas City was a wise investment, as multiple refineries would be vulnerable to frequent flooding without protection. By comparison, the refineries near Baytown all have higher elevations than the Texas City refineries, which place all of these facilities higher than the 50-year storm surge. However, the 100-year surge level is high enough to inundate 80% (4 of 5) of these refineries, and, unlike Texas City, the inner portion of Galveston Bay has limited public flood protection. This realization is sobering when one considers that area near Baytown contains the largest petroleum and petrochemical complex in the United States (ExxonMobil 2014), and local citizens are relying on private companies to maintain adequate levees to prevent a widespread chemical release during a major surge event. Another limitation of this study is that the coastal flooding data are derived completely from historic storm surge observations, and do not account for future changes in climate or coastal geography. I assume stationarity in my long-term storm surge climatology, however, the coastal environment is changing, as sea levels rise and land is subsiding in much of the region. Changes in climate and coastal geography will likely increase future losses in the energy industry. For example, climate events presently cost the industry approximately $14 billion/year, but these losses may increase to $18 billion/year even with no climate change, or $23 billion/year with extreme climate change by the year 2030. These losses may further increase to $26 -$40 billion/year by the year 2050, depending on the extent of climate change (Entergy 2012). From another perspective, the cumulative impact of climate hazards from the years 2010-2030 may reach $370 billion, which is enough capital to reconstruct the city of New Orleans six times or to construct 700 stadiums like New Orleans' Superdome (Entergy 2010). Although there is some uncertainty regarding climate change impacts on hurricane frequency and intensity , rapid sea-level rise has been clearly observed along the Gulf Coast over a period of many decades, particularly in South Louisiana and East Texas. The rate of Relative Sea-Level Rise (RSLR) near Morgan City averages 1.52 cm/yr , which means we would expect more than 1.5 m of RSLR over the next century if rates remain constant. This water rise accounts for > 50% of the 100-year storm surge level, which is 2.78 m (Table   6.1). Therefore, although storm surge levels at Morgan City are the lowest of any city from South Padre Island, Texas, to Apalachicola, Florida, rapidly rising sea levels near this location will exacerbate coastal flooding in the future. Grand Isle, Louisiana, also observes lower storm surge heights than some nearby locations, but is experiencing rapid rates of sea-level rise. On the other hand, the Mississippi Coast observes the highest storm surge levels in the region, but the stable coastline in that area will reduce the impacts of sea-level rise compared to nearby Louisiana. This study provides new insights that industry professionals can use for site selection of new energy infrastructure. This may be especially applicable for cities that are near each other geographically but have dramatic differences in storm surge risk. For example, although Mandeville, Louisiana, and Bay St. Louis, Mississippi, are separated by only 70 km, the 100-year storm surge at Bay St. Louis is more than 4.7 m higher than Mandeville. The distance between Freeport and Baytown, Texas, is 90 km, but the difference in the 100-year storm surge at these locations exceeds 2.7 m. If possible, it may be beneficial to establish future energy infrastructure, like power plants, in areas with lower risk. This analysis may also provide helpful insights for protecting existing facilities. This is especially important for refineries, as local opposition and environmental regulations have prevented any new refineries from opening in the United States since the late 1970s (Kesicki 2010). Therefore, it is crucial that existing refineries are protected from floods or any other hazards that may threaten their operation. While it is important to protect existing and proposed infrastructure from flooding, it is also important to assess flood risk to prepare for inevitable inundations. From an insurance perspective, the problem of storm surge inundation for large energy facilities relates to weather derivatives, an emerging concept that enables stakeholders to insure against losses caused by extreme weather (Zeng 2000;Campbell and Diebold 2004). Weather derivatives enable policyholders to insure against a weather event that exceeds some damaging threshold. For example, a retailer could insure against a snowfall in New York on Black Friday, which would drastically reduce profits. In this case, the derivative policy would clearly state a time (Black Friday), magnitude (5 cm of snow), and precise location of the severe weather event (Central Park), and policyholders would receive a payout if the event surpassed the predetermined threshold, regardless of actual monetary losses. Derivative policies based on temperature, precipitation and wind velocities have been relatively easy to develop because of the massive amounts of historical climate data for these variables, however, absence of credible storm surge data has prevented the development of such products for storm surge. This study may provide beneficial information to guide the development of storm surge derivative policies in the region, as insurance and energy professionals need to understand potential risks to infrastructure before they could agree on a storm surge threshold that would trigger a payout. This analysis may also help coastal cities prepare for the impacts of future disasters, as impacts vary considerably from one city to the next, and do not necessarily depend on the severity of the severe weather event. For example, Pensacola and Cedar Key, Florida, each have one power plant near the city. The plant in Cedar Key is located at a low elevation and would be flooded by the 10-year storm surge. The plant near Pensacola, however, is less prone to inundation, as it is located at an elevation above the 200-year storm surge. This means that electric power may be less impacted by storm surge at Pensacola than Cedar Key, even though surge heights at Pensacola are higher. Assessing the vulnerability of such infrastructure could help communities plan for future disasters, and assess potential impacts from storm surge events."}, {"section_title": "Data", "text": "Tropical cyclone position and wind intensity data are provided by . This dataset contains hourly information on tropical cyclone position, maximum winds, forward speed and direction. The authors used spline interpolation to calculate non-linear tropical cyclone data from 6-hour observations provided by HURDAT. Storm surge data are provided by SURGEDAT, a storm surge database that provides surge data for the U.S. Gulf Coast from 1880-2011 . As of February, 2013, SURGEDAT has identified 189 surge events at least 1.22 m high along the U.S. Gulf Coast. SURGEDAT also provides envelopes of water for more than 150 U.S. surge events, supported by more than 7,600 high-water marks ). As better data have become available, some adjustments have been made to the peak surge height and/ or location of maximum surge. An updated surge dataset is available for download at http://surge.srcc.lsu.edu. Although  provided useful analysis on the wind/ surge relationship, some notable differences exist between their dataset and the data used in this chapter. One difference is that they incorporated landfall events from both the U.S.  ). Wind and surge data were analyzed for the period 1880-2011 (132 years), as well as a more recent, 52-year analysis, covering the years 1960-2011. This more recent time period is selected to validate the longer analysis. A start date of 1960 for the more recent analysis enables inclusion of the entire era of tropical satellite meteorology, which began operationally in the early 1960s (Fett 1964;Timchalk et al. 1965;Dvorak 1984). Improved hurricane tracking and intensity data from the satellite era should provide more accurate analysis related to the correlation of hurricane winds and surge heights. Also, several high-profile hurricanes struck the Gulf Coast in the 1960s, including Hurricanes Donna, Carla, Betsy, Beulah and Camille.\nStorm surge data are provided by SURGEDAT, a global surge database that provides more than 7,600 high-water marks for the United States since 1880, including approximately 5,400 high-water marks for the U.S. Gulf Coast ). This dataset pulls observations from more than 60 separate sources ). An updated surge dataset is available for download at http://surge.srcc.lsu.edu. SURGEDAT includes data on both storm surge and storm tide heights. Storm surge is the water height above predicted tide levels, while storm tide includes both storm surge and the tidal variation. For some observations, SURGEDAT provides both the storm surge and storm tide height, while for others either storm surge or storm tide levels are provided. SURGEDAT also assigns a numeric confidence level for each observation, which provides an indication of the data quality. Confidence levels range from 1-5, with higher numbers assigned to better quality data. Higher confidence levels are assigned to tidegauge data, as well as mudlines and watermarks inside structures. The lowest confidence levels are classified as Level 1, and are considered unsuitable for analysis. Observations affected by fresh water runoff, called riverine data, fit into this category. Field data that estimate water levels by measuring the height of rafted debris, tree bark removal, damage trimlines or exterior water marks on exposed structures, are also considered Level 1 data, because these types of high-water marks include the height of waves. Approximately 7% of Gulf Coast observations were assigned to Level 1 confidence, and were removed from this analysis. When using observed data to estimate the occurrence of extreme values, it is important to also limit the amount of missing data in order to minimize analytical errors.     Therefore, I determined to analyze all reliable observations within geographic proximity to coastal communities, regardless of the data source. In order to conduct this analysis, a web-mapping tool was developed that enables users to create a circle on a map to define an area from which water height data are provided ( Figure 5.3). Users customize the location and size of the circle by clicking on any location to define a circle's center point, while selecting the circle's radius size from a drop-down menu. Internally, the web-mapping tool uses the following: 1. A spatial database (Postgis, http://www.postgis.net) to store and spatially query storm surge observations. 2. Computational methodologies to compute peak storm surge values and conduct return frequency analyses (code was written using the programming language Python and scientific computing libraries, numpy and scipy). 3. For the web-based visualization, technologies such as Javascript and HTML5. Figure 5.3. The storm surge web tool enables users to select surge data for coastal communities. In this screen shot, a user has selected all observed storm surge and storm tide heights within 16 km (10 miles) of Corpus Christi, Texas. The tool provides a list of historical storm surge and storm tide data within each circle. If an observation contains both storm surge and storm tide data, I selected the surge height. However, if storm surge is unavailable for an observation, the storm tide height is selected. If a tropical cyclone generated multiple high watermarks within the circle, the highest-magnitude observation is listed. Following this methodology, this webtool provides a comprehensive storm surge/ storm tide history for coastal locations. I selected observations for 26 coastal communities from South Texas to the Florida Keys, including all of West Florida, but excluding Florida's Atlantic Coast. These communities represent developed areas with sufficient storm surge history for statistical analysis. For these communities, we tested data-selection circles with 8-km (5-mile), 16km (10 mile), and 40-km (25-mile) radii. We selected these radii sizes because circles with 8-km (5-mile) radii represent areas approximately the size of many Gulf Coast communities, while circles with 16-km (10-mile) and 40-km (25-mile) radii provided regional coverage that typically extended beyond community borders. Large metropolitan areas, such as Houston, New Orleans and Tampa, are exceptions, as these cities sprawl beyond the borders of a circle with a 16-km (10-mile) radius. As expected, larger circles usually provided more data than smaller circles, however, in some cases data quantity from circles of different sizes was identical. Table   5.1 provides a list of coastal communities and the number of observations provided by circles with 8-km (5-mile), 16-km (10-mile) and 40-km (25-mile) radii. Larger circles usually selected data that were less physically homogenous with each other than smaller circles. Homogeneity of data is important because observations from each coastal community will be combined into a statistical distribution to analyze storm surge return periods. If these data come from locations with different physical characteristics, they are essentially derived from different populations and make statistical analysis inaccurate.  Table 5.1 (continued). The number of observations provided by circles with 8-km (5mile), 16-km (10-mile), and 40-km (25-mile) radii at 26 locations along the U.S. Gulf Coast. The latitude and longitude values depict the coordinates of circle centers. In order to evaluate homogeneity of selected data, I created a Physical Homogeneity Index (PHI). The PHI classifies the physical homogeneity of selected data sets into four categories: excellent, good, fair and poor. \"Excellent\" data are considered physically homogenous. Examples of these data are observations that come from the same side of a barrier island or the same area of a bay. \"Good\" data generally maintain physical homogeneity, however, slight differences in physical geography exist. An example would be data that come from different areas of the same barrier island. \"Fair\" data maintain some physical homogeneity, although some obvious differences exist in the physical settings of selected data. For example, data that come from both a barrier island and the mainland, or a barrier island and the seaward portion of a bay would be classified in this category. \"Poor\" data are considered inhomogenous. Examples include data that are pulled from both barrier islands and the inward portion of a bay, or data that come from opposite sides of a levee system, such as the levees along the Mississippi River in Plaquemines Parish, Louisiana. I assigned a PHI value to each data selection circle for all 26 coastal communities from which I selected data (Table 5.2).  Table 5.2 (continued). Physical Homogeneity Index (PHI) classification provided by circles with 8-km (5-mile), 16-km (10-mile), and 40-km (25-mile) radii. After sampling the 26 locations for data quantity and homogeneity of data, I determined that data selection circles with radii of 16 km (10 miles) provided optimal data. Such circles provided sufficient data quantity, as these circles returned a total of 677 high watermarks at 26 locations, or an average of approximately 26 observations per site. Also, the data quality of these observations was adequate, as none of these datasets contained \"poor\" homogeneity. Although circles with 40-km (25-mile) radii provided more data than circles with 16-km (10-mile) radii, 19 of the 26 sites contained \"poor\" data homogeneity at this scale, making analysis at this scale unsuitable. Circles with 8-km (5-mile) radii often provided better homogeneity than circles with 16-km (10-mile) radii, however, insufficient data quantity limited the number of sites for analyses, as only 18 of the 26 sites contained at least 20 observations. Data selection circles were typically centered along the waterfront near the center of coastal communities, however, some exceptions were made to improve homogeneity. For example, a 16-km (10-mile) circle centered at the New Canal Station tide gauge in New Orleans, near Lake Pontchartrain, provides high-water marks from both the Lake Pontchartrain shorefront, on the north side of the city, and the Mississippi River Gulf Outlet (MRGO), on the east side of New Orleans. These two locations experience storm I also intentionally shifted the data selection circle at Pensacola, Florida, to improve data homogeneity. A 16-km (10-mile) radius circle centered near Pensacola's waterfront covers both the barrier island near Pensacola Beach, and the inward portions of Pensacola and Escambia Bays. Combining data from both of these locations creates an inhomogenous dataset. As such, I shifted the circle slightly north to eliminate observations from the barrier island. This shift enables the circle to select data entirely from the western side of Pensacola and Escambia Bays, near the city of Pensacola. The data in Tables 5.1 and 5.2 account for these shifted data-selection circles. In other cases, I shifted the centers of data selection circles away from city centers in order to combine cities that were near each other into the same circle. For example, data selection circles with 16-km (10-mile) radii, centered on Gulfport and Biloxi, Mississippi, overlap each other. Therefore, I created a circle that is centered between these two cities and contains data for both locations. I also created circles that combine data from Bay St. Louis and Pass Christian, Mississippi, as well as Cape Coral and Fort Myers, Florida, for the same reason. Following these steps, I created a list of observed high water marks for 26 locations along the U.S. Gulf Coast. I also decided to add estimated water levels for two major surge events that likely impacted Baytown, Texas. From an industrial and economic perspective, Baytown is one of the most important cities in the region, as it contains one of the largest petrochemical complexes in the world. However, storm surge data are unavailable at Baytown for the category-4 hurricane that struck Galveston in 1900, or the major hurricane that struck south of Galveston in 1915. Storm tides at Galveston reached 6.1 m in 1900 , and 4.72 m in 1915 (Connor 1956;Landsea et al. 2008). These events produced the two highest watermarks at Galveston . Both of these hurricanes likely generated massive storm surges at Baytown, as well, where storm surge heights exceed levels in Galveston when hurricanes make landfall between Galveston and Corpus Christi. I identified seven tropical cyclones that made landfall between Corpus Christi and Galveston, and for which observed water levels are available at both Baytown and Galveston in SURGEDAT. The water level at Baytown exceeded levels in Galveston for all of these events, and the average difference was approximately 37% (Table 5.3). As such, I estimated the maximum storm tide of the 1900 and 1915 hurricanes to be 37% higher at Baytown than Galveston, producing storm tide estimates of 8.38 m in 1900, and 6.49 m in 1915, at Baytown. These are the only two values in this analysis that were not observed, but derived, however, given the economic importance of Baytown, I felt it was best to estimate water levels for these events. These events increased the quantity of coastal flood events at Baytown from 18 to 20. Table 5.3. Comparison of water levels at Galveston and interior portions of Galveston Bay, from tropical cyclones that made landfall between Corpus Christi and Galveston, Texas, and produced at least 2 m storm surge/ storm tide in Galveston Bay. Adapted from Zoch (1949); U.S. Weather Bureau (1959); U.S. Army Engineer District-Galveston, Texas (1962); National Hurricane Center (1983); National Hurricane Center (1989); Federal Emergency Management Agency (2009)."}, {"section_title": "Methods", "text": "As this chapter correlates tropical cyclone winds and storm surge heights at landfall and at 3-hour pre-landfall increments, determining the precise time and location of landfall is crucial. Although the National Hurricane Center defines the term landfall to be, \"The intersection of the surface center of a tropical cyclone with a coastline\" (National Hurricane Center 2012a), determining the exact time and location of a hurricane landfall is sometimes ambiguous. Hurricanes that move very slowly or remain stationary near the coast provide cases in which the time and location of landfall may be unclear. This may be especially true if the coastal zone contains wetlands, marshes or estuaries, as these features make it difficult to determine the boundary between land and sea. Hurricane Isaac in 2012 provides such an example, as the storm remained stationary near the Southeast Louisiana coast for a period of time between its first and second landfall (National Hurricane Center 2012b). As this portion of coastline contains many wetlands and small islands, it is possible that Isaac technically made more than two landfalls. Tropical cyclones that make several distinct landfalls make it difficult to determine which landfall relates best in time and space to the peak storm surge event. SURGEDAT contains 12 storm surge observations from Hurricane Juan, the highest of which is 2.5 m at Bayou Bienvenue, Louisiana, near New Orleans. However, given the erratic nature of Juan's track, it is difficult to know which landfall associates closest with the peak storm surge level. Other hurricanes make only one distinctive landfall, however, the time and location of the landfall are separated in time and space from the peak storm surge. This is especially likely to occur if the hurricane tracked near the coastline for several hours before making landfall. Hurricane Andrew's Louisiana landfall fits into this category. Andrew approached the Louisiana Coast as a category-4 hurricane. At 0300 UTC on August 26, 1992, Andrew was centered near latitude 28.84N, longitude 90.92W, or about 52 km (28 nmi) southwest of the location of peak storm surge. The maximum sustained winds at this time were 233 km/hr (126 knots) . As the radius of maximum winds were 28 km (15 nmi), Andrew's eyewall made a direct hit on the location of peak surge, because the distance from the center of the eye to the location of peak surge was less than double the radius of maximum winds (National Hurricane Center 2012a). However, the center of circulation remained offshore for more than five more hours after this closest approach to the location of peak surge. When the center of circulation finally crossed the coast, after 0800 UTC, the maximum sustained winds had dropped to 202 km/hr (109 knots) and the distance from the center of circulation to the location of peak storm surge had increased to 94 km (51 nmi). As such, Andrew's position and intensity related better to the location of peak storm surge when it was passing just off the coast from this location, than when the storm officially made landfall. It should be noted that the location of peak storm surge was accurately observed, and not influenced by a scarcity of storm surge data. SURGEDAT provides 74 high-water marks in this region from Hurricane Andrew, many of which are closer to the official landfall location than the peak surge location (Figure 3.1). The storm passed closest to the location of peak surge more than five hours before the center of circulation actually crossed the coast. These examples introduce problems with using the standard landfall definition to study the correlation between storm surge magnitudes and hurricane winds at landfall and incremental time periods approaching landfall. Therefore, I developed a unique classification system that categorizes storm surge events into one of 14 landfall/surge categories. The spatial relationship between hourly hurricane positions and the location of peak storm surge determine the class identification. This methodology produced 14 types of landfall/surge events based upon the timing of CHO and COO, as well as the movement of the tropical cyclone and the spatial comparison between the location of peak storm surge and hourly tropical cyclone locations. Table 3.1 provides a list of these event types, the number of events for each type, and an example tropical cyclone for each type. Of the 14 types, 10 were included in the statistical analysis (types 1-10), which comprised 117 landfall/ surge events. Four types (types 11-14) were not included in this analysis, removing 72 landfall/ surge events. Types one through four represent events in which CHO occurs offshore, whereas types five through nine are events in which CHO occurred inland. Types 10 through 14 represent a variety of different landfall/ surge scenarios, which were removed from this analysis because of dissociation of the wind/surge relationship in space and/or time, as described below.\nThe first step in this analysis involved creating a comprehensive tropical cyclone size dataset because each of the (nine) size sources provides data for a select period of time, but no source provides a comprehensive archive of complete size data. I archived the size of Rmax, as this measurement type is the most common in historical literature, as well as the radius of 63 km/hr (34-kt), 93 km/hr (50-kt), and 119 km/hr (64-kt) winds, even though these data are only available since 1988. As this chapter investigates the role of tropical cyclone size for generating storm surge, it is only necessary to archive size data for storms with useable storm surge data. Although SURGEDAT provides peak storm-surge data for 191 events along the U.S. Gulf Coast since 1880, it is not necessary to obtain size data for all of these events because only surge events that are identified near the location of a tropical cyclone landfall will be used in this study. This methodology follows the approach used by in Chapter 3, where a landfall classification system that categorized surge events into 14 categories, depending on the relationship between the tropical cyclone track and peak surge location. Of the 189 surge events analyzed between 1880-2011, 117 provided useable data in which a peak storm surge position was located near a landfalling tropical cyclone, while 72 events were removed from the analysis, due to disconnects in time and space of the storm track and the surge event. A list of the event types that were removed from this analysis are provided in Table 4.1. Offshore Observation (COO), which was the offshore tropical cyclone position closest to the location of peak storm surge. However, 22 tropical cyclones were removed because four or more hours passed between the time of COO and the time when the tropical cyclone actually tracked closest to the location of peak surge. In these cases, the tropical cyclone tracked inland toward the location of peak surge for at least four hours after COO, which means the storm conditions near the location of peak surge may have differed considerably from the conditions when the cyclone made landfall. In many of these cases, the peak surge occurred on a bay, enabling the storm track to make its closest approach to the location of peak surge while the storm was located inland for several hours. Peak surge events that were located to the \"left\" of tropical cyclone tracks were also removed from this analysis. These 17 events were excluded from the study because peak surge heights usually occur to the \"right\" of tropical cyclone tracks in the Northern Hemisphere, so it is possible that SURGEDAT is missing the actual location and height of peak surge for these events, or extreme extenuating circumstances prevailed in the storm track and/or the coastal geomorphology. Tropical cyclones that tracked too far away from the location of peak surge were also excluded from this analysis. The 24 events that fall into this category often include tropical cyclones that made landfall far south of the Texas/ Mexico border, but still produced a surge observation in South Texas, as well as tropical cyclones that track well south of the Florida Keys, but still generate elevated seas along the island chain. Tropical cyclones that made landfall more than 159 km (86 nmi) from the location of peak surge were removed from this analysis, as this distance represents the average extent of tropical storm force winds in Category 1 and 2 hurricanes . The final event type that was removed from this analysis included cyclones that generated a peak surge along the West Coast of Florida as they tracked westward off the Peninsula. These nine events were removed because the tropical cyclones were not making landfall, but moving from land to water as they generated a storm surge event. Although the landfall classification system adds some complexity, it improves the analysis by providing a consistent method for determining landfall, while removing missing or inaccurate surge data. The cyclone size analysis provides data for as many of the 117 useable surge events as possible, as well as Tropical Storm Debby and Hurricane Isaac, which both occurred in 2012 and were not included in the previous analysis. Tropical cyclone size data were provided as a measure of Rmax size for 83 of these 119 surge events. Most sources provided one Rmax size per tropical cyclone, however,  provided values at 6-hour intervals for 31 out of 33 tropical cyclones since 1988. This source was missing Rmax data for hurricanes Chantal and Jerry, which both produced peak surge observations in Texas in 1989. For cases in which Rmax sizes changed as a tropical cyclone approached the coast, the Rmax size at 18 hours before landfall was utilized to represent the storm characteristics as the cyclone approached the coast. This specific time interval was determined because results in Chapter 3 proved that surge heights correlate best with wind speeds 18 hours before landfall.   119 km/hr (64-kt) wind fields for Hurricane Camille, these data were not utilized because they relied heavily on modeling, while this chapter relies on empirical observations. After building this tropical cyclone size dataset, I identified the largest and smallest tropical cyclones, as well as the average size of these storms. I also analyzed the correlation between various tropical cyclone size parameters, as well as the relationship between those parameters and storm surge heights.\nThe first step in this study involved selecting a subset of energy facilities that are located in the Gulf of Mexico coastal zone, and potentially exposed to tropical cyclonegenerated storm surges.  (Rygel et al. 2006;Kleinosky et al. 2007;Frazier et al. 2010). The MEOWs for each basin form a composite dataset called Maximum of MEOWS (MOMs) (Rygel et al. 2006;Kleinosky et al. 2006;Frazier et al. 2010). The MOMs represent the spatial distribution of potential storm surge elevation for a particular category of tropical cyclone at a particular tide (NWS 2011). For storm surge heights of individual hurricanes, this model is accurate to within +/-20% (NWS 2011). To estimate inundation from MOMs, storm surge elevations at high tide for the 16 SLOSH basins along the Gulf Coast were compared with the underlying land elevation, which was represented by a composite grid of USGS 1 arc-second (~30 m horizontal resolution) National Elevation Dataset (NED) tiles (Gesch et al. 2002;Gesch 2007), corresponding with the spatial extent of the MOM (Maloney and Preston 2014). Areas where the land surface elevation for each basin was less than the storm surge surface water elevation were labeled as being at risk of inundation, and these areas were extracted as a set of five GIS data layers corresponding to different hurricane intensities (i.e., categories 1-5) on the Saffir-Simpson scale. As the entire Gulf Coast is potentially exposed to landfalling category 5 hurricanes, energy facilities in the Southeast intersecting the category 5 storm surge inundation layers for each of the Gulf Coast basins were selected for inclusion in the current study. This process selected 207 electricity generation facilities and 33 oil refineries, however, the number was reduced to 152 and 32, after facilities along the U.S. Atlantic Coast were eliminated from the study. After these sites were selected, elevation data were assigned to each facility to analyze its vulnerability to storm surge inundation. Estimates of facility elevations were calculated by comparing latitude and longitude coordinates for facility locations with the NED 30 m resolution elevation data. This process provided one elevation value per facility, which is an estimate of the average facility elevation. In practice, many facilities sprawl across large areas and may contain structures with different elevations. However, it was necessary to obtain an average elevation and estimated center point for each facility, to assess the vulnerability of each site to storm surge inundation. It was necessary to assign each energy facility to a coastal location with adequate storm surge data, to analyze the vulnerability of oil refineries and electric power plants to storm surge inundation. Energy infrastructure data provided by Oak Ridge National Lab and storm surge data provided by SURGEDAT.However, these assignments were modified for two special cases. A facility and a city were not matched if the Mississippi River or New Orleans' Industrial Canal traversed a line connecting the city and facility. In other words, I did not want to match facilities with surge data from the other side of these waterways.  The Industrial Canal also provides a boundary in the eastern portion of New Orleans; areas to the west of this feature are vulnerable to storm surge inundation from Lake Pontchartrain, while areas to the southeast of this feature, near Arabi and Chalmette, are vulnerable to storm surge flowing from the east and passing near Shell Beach. New Orleans East is a relatively small area to the northeast of the Industrial Canal that can actually be flooded from both Lake Pontchartrain and from water pushed up the Mississippi River Gulf Outlet (MRGO), and passing near Shell Beach. The one facility in this region is adjacent to a levee that is vulnerable to surge from the east, so this facility was assigned to Shell Beach. For cases in which the city closest to a facility was on the other side of the Mississippi River or Industrial Canal, facilities were re-assigned the closest city on the same side of these waterways. These adjustments changed the matching of four refineries and 18 power plants in Louisiana. Several distinct patterns emerged from these adjustments. The city of New Orleans had the most facilities reassigned, as New Orleans had three refineries and seven power plants before the adjustments, but zero refineries and only one power plant after the adjustments. Two of the three refineries were reassigned to Shell Beach, and the other to Grand Isle. Of the seven power plants originally assigned to New Orleans, four were re-assigned to Shell Beach and two to Grand Isle. Morgan City and Frenier swapped many power plants that had to be re-assigned because the closest city to these plants was on the other side of the Mississippi River. Five power plants from the Morgan City zone were re-assigned to Frenier, and six power plants that were originally assigned to Frenier were re-assigned to Morgan City. Table 6.2 provides the number of refineries and power plants assigned to each city. The majority of these facilities were concentrated in Texas and Louisiana. For example, approximately 85% of the power plants were located in Texas and Louisiana, while around 15% of these facilities were located in Mississippi, Alabama and Florida. Texas and Louisiana also contained approximately 91% of oil refineries, while Mississippi, Alabama and Florida contained only 9% of these facilities. Baytown, Texas, contained more power plants than any other location, as 25 facilities were assigned to this city. Baytown and Sabine Pass both were assigned five refineries, which were the highest numbers of any region. The Gulf Coast of Florida contained no refineries and only 7% of the power plants. After each facility was assigned to a coastal city, I compared the return levels for 10-, 25-, 50-, 100-, 200-, and 500-year storm surge return periods with the elevation of facilities at each location. Following this methodology, I was able to quantify the number of facilities that would be inundated by the various storm surge return levels, and thereby generate a customized facility inundation profile for each coastal region. I calculated the quantity and proportion of power plants and refineries that would be inundated by the 10-, 25-, 50-, 100-, 200-, and 500-year storm surge (Table 6.3). Although storm surge return levels are estimated locally, this table provides basin-wide counts. These results indicate that storm surges threaten a higher quantity of power plants, but a higher proportion of refineries. This is a logical outcome, as the quantity of power plants in the coastal zone is nearly five times the quantity of refineries. However, refineries are especially concentrated in the Central and Western Gulf Coast, where surge heights are highest, which explains the high proportion of flooded refineries. Despite these differences, both power plants and refineries in the region are vulnerable to storm surge inundation. For example, the 100-year storm surge would flood approximately 72% (23 of 32) of the coastal refineries and 63% (95 of 152) of the coastal power plants.      "}, {"section_title": "Landfall/ surge classification system", "text": "In Type 1 events, CHO is the last hourly observation before a tropical cyclone crosses the coastline. The timing of CHO is coordinated very well with the official landfall time in these events, producing a pattern that is generally considered to be a typical landfall. Hurricane Bonnie in 1986 ( Figure 3.2a) is an example of this type, as CHO equals COO and occurs as the last hourly observation before the storm crosses the southeast Texas coast. Bonnie generated a peak storm surge at Sabine Pass, Texas, a location just east of landfall. In Type 2 events, CHO occurs two or three observations before the tropical cyclone actually crosses the coast. In these cases CHO is also equal to COO. Hurricane Lili in 2002 (Figure 3.2b) is an example of a Type 2 event, as CHO occurred almost two hours before the center of Lili's circulation actually crossed the Louisiana Coast. In Type 3 events CHO occurs more than three hours before the center of circulation crosses the coast. In these cases CHO is equal to COO. Hurricane Andrew in 1992 ( Figure 3.2c) is an example of a Type 3 event, as CHO occurred more than five hours before the center of Andrew's circulation crossed the Louisiana Coast. Type 4 events have multiple landfalls. In these cases, CHO is also an offshore observation, but this occurs after the tropical cyclone has previously made landfall. As such, in Type 4 events, CHO is equal to COO and occurs as the last offshore observation before the second landfall. Hurricane Jerry in 1989 ( Figure 3.2d) is the example of this type, as the hurricane made landfall near Galveston Island, then briefly tracked inland west of Texas City, Texas, before emerging into Galveston Bay and generating a peak storm surge at Baytown, Texas. Type 5 events typify cases in which the CHO is the first inland observation. In these events CHO -COO = 1, and the first observation before CHO is selected as the landfall observation. Hurricane Opal in 1995 ( Figure 3.2e) is an example of this type. It should be noted that for cases in which CHO occurs inland, always use COO as the landfall observation, so an inland observation is never used to designate landfall. Type 6 events are similar to type 5, however, CHO is the second inland observation. In these events CHO -COO = 2, and the second observation before CHO is selected as the landfall observation. An unnamed hurricane in 1941 (Figure 3.2f), which made landfall near Apalachicola, Florida, is an example of a Type 6 storm. Type 7 events are similar to types 5 and 6, however, CHO is the third inland observation. In these events CHO -COO = 3, and the third observation before CHO is selected as the landfall observation. Hurricane Edith in 1971 ( Figure 3.2g) is an example of a Type 7 event. In Type 8 events CHO is the first inland observation of the second landfall. Although only two events are classified in this type, these events are extremely important. Hurricanes Camille and Katrina (Figure 3.2h In Type 10 events the peak storm surge occurred in the Florida Keys. These events were separated from surges that peaked on the mainland U.S. Coast or on barrier islands located just off the U.S. mainland. This decision was justified by the fact that landfall is difficult to define in island chains like the Florida Keys, as the center of circulation for many tropical cyclones crosses between islands, crosses the edges of islands, or may traverse many different islands. Hurricane Donna in 1960 ( Figure 3.2j) is classified as a Type 10 event. In Type 11 events CHO is classified as at least the fourth inland observation. Such events are not included in this analysis because the tropical cyclone makes its closest approach to the location of peak surge well after COO. It is reasonable to assume that the time of peak surge for many of these events occurred as the tropical cyclone passed closest to the location of peak surge. If the time of peak surge and COO are separated by four or more hours, the tropical cyclone conditions when the center of circulation actually crossed the coast are likely to be different than the tropical cyclone conditions four or more hours later. The tropical cyclone in many of these cases makes landfall at an oblique angle to the coast, remaining near the coast for many hours after landfall. In other cases, the maximum surge occurs on the innermost portion of large bays or lakes, enabling the cyclone to continue approaching the location of peak storm surge many hours after it has already made landfall. Tropical Storm Matthew in 2004 ( Figure 3.2k) provides such an example, as the storm made landfall in South Louisiana, near Cocodrie, Louisiana, then continued to approach Frenier, the location of peak storm surge, for the next five hours. Matthew's center of circulation was inland during these five hours, but was still able to approach Frenier, as this small village is located near the westernmost portion of Lake Pontchartrain. Type 12 events represent cases in which the location of peak storm surge was located to the left of the tropical cyclone track as the storm approached the coastline. In the Northern Hemisphere, storm surges generally peak to the right of the cyclone track, as In Type 13 events, the location of peak storm surge and the CHO are far enough apart that the timing of peak storm surge is not likely associated with the timing of landfall. An example of such events include tropical cyclones that generated storm surges in the United States, but made landfall far enough south of the Texas/ Mexico border that the eyewall never directly impacted the United States. This type also includes tropical cyclones that pass far enough south of the Florida Keys that the eyewall never crosses any islands, and tropical cyclones that are in proximity to the coast, though they parallel the coast in such a way that the peak surge is separated in space and time from landfall. Hurricane Gilbert in (Figure 3.2m I required COO to be located within 159 km (86 nmi) of the location of peak surge, effectively removing all events in which the tropical cyclone was too distant from the peak surge to associate the timing of landfall and peak surge. The size of this buffer corresponds to the average extent of tropical storm force winds in Category 1 and 2 hurricanes , which comprise most of the events in this analysis. An exception to this rule was made for Hurricane Emily, which was included as a Type 13 event even though the distance from COO to the location of peak surge was only 143.5 km (77.5 nmi). As Emily was a small storm, with a 28-km (15-nmi) radius of maximum winds , and the storm made landfall well south of the Texas/ Mexico border, it is likely that surge levels in Mexico exceeded the 1.52-m surge measured at Boca Chica Beach, in South Texas. Tropical cyclones that generated storm surges while moving offshore are "}, {"section_title": "Building a 3-hour incremental wind speed dataset", "text": "The maximum wind speed for each storm was recorded in a database, beginning at 36 hours before landfall and continuing at 3-hour increments until the time of landfall. In some cases, however, data were intentionally removed from one or more of the 3-hour pre-landfall increments. One reason this occurs is that some storms developed into tropical storms less than 36 hours before making landfall. In these cases, observations are not included in the database until the system forms into a tropical storm. Hurricane Humberto (Figure 3.3) provides an example of this phenomenon, as this storm only formed into a tropical storm 24 hours before the time of COO. For this reason, wind data are removed for 27, 30, 33 and 36-hours before landfall. Another reason data may be missing from one or more of the 3-hour observations is that a tropical cyclone was not centered over the Gulf of Mexico at the time of the observation. If the cyclone was centered over land, such as Florida or Cuba, or centered over water outside the Gulf of Mexico, such as the Atlantic Ocean or Caribbean Sea, observations were not included. For example, no observations are provided for Hurricane Charley from 15 to 36 hours preceding landfall in Southwest Florida, as the hurricane was centered over the Caribbean Sea, south of Cuba, during these intervals (Figure 3.4). An exception was made for tropical cyclones centered over the Atlantic Ocean if the cyclone was moving towards a peak storm surge location in the Florida Keys. 12 hours before COO in Southwest Florida. Therefore, no observations are included in the analysis from 15 through 36 hours before landfall, when the cyclone was centered over the Caribbean Sea."}, {"section_title": "Results", "text": "\n"}, {"section_title": "LOESS and linear regression models", "text": "Analysis run on 117 tropical cyclones, from 1880-2011, reveals that pre-landfall wind speeds correlate better with surge magnitudes than wind speeds at landfall (Table   3.2). LOESS regression modeling methods, which use localized regression analysis to find the optimal fit for non-linear relationships, find the correlation between wind speeds and surge magnitudes from three to 30 hours before landfall fit better than wind speeds at landfall. For the wind/ surge relationship at each time increment, I calculated the    Interestingly, RSE values at landfall are 1.187, which is less optimal than the 1880-2011 values (Figure 3.6). The RSE values for linear regression in the more recent data are also higher (less optimal) than non-linear regression modeling. The RSE values for the linear regression at 18 hours before landfall are .9398. All values are significant at the 99% confidence level.     Figure 3.7a provide comparisons of R-squared values at 3-hour intervals leading up to landfall for both of these time periods. As time before landfall increases, the difference in correlation values between the older and newer datasets increases, presumably because offshore tropical cyclone data have improved substantially during the era of satellite meteorology. These improved correlations between surge heights and pre-landfall winds in the newer dataset result in every 3-hour interval having better correlations than the correlation between surge and wind speeds at landfall.    These results may seem improbable because wind force is proportional to the square of the maximum wind speed. It may appear that optimal fitting would occur when the wind array is squared, however, when we consider that the transfer of energy from air to water is not perfectly efficient, it seems reasonable that the optimal exponent should be less than two . So how is it possible that an exponent greater than two produces the best fit? One possible explanation for this result is the inverse barometer effect. Because surge levels rise in a dome as air pressure near the eye of the hurricane becomes lower, wind stress is not the only physical parameter forcing storm surge. Increased surface roughness provides another possible explanation. As winds increase, wave heights increase as well, increasing the surface roughness of the water. This may increase friction between air and water, making it more efficient for the wind to move more water, thereby increasing the surge height. Other physical parameters may include the geometry of the coastline and bathymetry of water near the coast, which may amplify the buildup of water that is already displaced by the wind. Another possible explanation is that hurricanes displace water over a period of time, which may enhance the buildup of water along the coast from hurricanes that have stronger pre-landfall winds. Water displaced while the hurricane is approaching landfall will accumulate at the coast over time due to the geostrophic effect and it makes sense that more water would accumulate if pre-landfall winds were higher. By contrast, pre-landfall winds should not directly cause wind damage at the coast because they are blowing over water and not directly impacting structures on the coast. All of these potential reasons for the non-linear relationship between pre-landfall winds and surge magnitudes are speculative and should be investigated by scientists in the geophysical research community who specialize in atmospheric and oceanographic physics. These findings are important because they reveal that changes in pre-landfall hurricane wind speed may impact surge height greater than previously expected. This may be especially important for the most intense tropical cyclones, which may displace more water than previously realized. For example, doubling the maximum wind speed increases the wind force by a factor of four, but increases the surge potential by a factor of 4.59. However, the accuracy of these may be limited because this chapter only considers the relationship between surge heights and maximum sustained wind speeds, while, in reality, many variables influence surge heights. Therefore, other unaccounted factors may influence these results. For example, hurricanes Katrina and Camille both produced the highest two storm surges in the region and also produced the highest wind speeds 18 hours before landfall. Data from these storms support the notion that the relationship between pre-landfall winds and surge heights are highly non-linear. However, both of these hurricanes produced peak surge levels in Mississippi, where shallow bathymetry and coastal shape exacerbates surge levels ). If these storms had struck areas with deeper bathymetry, like South Florida or South Texas, surge heights would have been lower, supporting a more linear relationship between pre-landfall winds and storm surge heights."}, {"section_title": "Summary and Conclusion", "text": "This chapter investigated relationships between storm surge heights and tropical cyclone winds at and before landfall. Elsner and Jagger 2013 LOESS regression modeling indicates that storm surge magnitudes correlate better with pre-landfall wind speeds than wind speeds at landfall, with wind speeds 18 hours before landfall producing the best correlation. These results were duplicated on tests of 63 wind/ surge events from 1960-2011. Wind speeds 18 hours before landfall also produced the best correlation and provided even better correlation than the longer dataset. I validated these results by comparing some historical wind-surge events that occurred near each other spatially. Lili's strong pre-landfall winds likely enabled the storm to generate a surge more than 50% higher than Hurricane Danny, as the maximum sustained winds at landfall in these storms was equal, Danny was comparable in size or slightly larger, and bathymetry in the region of these storms was relatively constant. The intense pre-landfall winds of the 1900 Galveston Hurricane likely enabled this storm to generate a higher storm surge than Hurricane Ike, as both storms made landfall on Galveston Island, and the more intense, but smaller, Galveston Hurricane generated a higher-magnitude surge. Also, the 1935 Labor Day Hurricane was one of the smallest hurricanes to strike the United States, but it generated the highest-magnitude surge event in the history of the Florida Keys. Pre-landfall winds likely influenced this surge height, as the storm approached the Keys as an intense tropical cyclone. Although it appears that pre-landfall winds are important for generating highmagnitude storm surges, storm size is important for generating extensive surge events, which may actually inundate more area than a surge with a higher peak magnitude. This study also found that the relationship between maximum winds and surge heights is more non-linear than previously expected. A test run on the 63 wind/ surge events since 1960 showed the wind/ surge relationship correlates best when wind values from 18 hours before landfall are raised to an exponential power of 2.2, producing an Rsquared value of .6948. However, existing literature on this relationship suggested the optimal exponential power should be less than two . The relationship between maximum sustained winds and peak surge levels is surprisingly non-linear, as these values indicate that doubling the maximum sustained winds of tropical cyclones increases surge potential by a factor of 4.59. As tropical cyclones may strengthen in a warmer climate Anthes et al. 2006;U.S. Global Change Research Program 2009), this finding may have dire consequences for coastal regions, because even modest increases in tropical cyclone wind speeds would produce relatively large increases in surge height. Sea-level rise, which is accelerating at many locations (Zervas 2001), may also exacerbate storm surge inundations in the future. These results will likely improve storm surge modeling as scientists give more weight to pre-landfall winds in surge forecasts. Although such models may utilize prelandfall wind speeds 18 hours before landfall as an important indicator of storm surge potential, the forecasts may actually be issued at least several days before landfall. The scientific literature on the physical processes that generate storm surge contains little information on the importance of pre-landfall winds, so these results have not likely been incorporated into forecasting algorithms. These findings may help surge forecasts improve considerably, as pre-landfall tropical cyclone wind forecasts tend to be more accurate than landfall wind forecasts. These results may have implications for disaster science/ emergency management professionals, especially for hurricanes that are rapidly strengthening or weakening just before landfall. Local authorities may want to prepare more for a wind event in storms that rapidly strengthen just prior to landfall, a surge event in storms that were once intense, but rapidly weaken before landfall, and both hazards for storms that hold consistent intensity as they approach the coast. The benefits of improved evacuation decisions are substantial, as evacuations are costly. It is estimated that the cost to evacuate one mile of coastline is approximately 1 million U.S. dollars (Adams and Berri 1999;Whitehead 2003;Wolshon et al. 2005;Regnier 2008). The cumulative cost of false hurricane evacuations is staggering; such false alarms cost an average of more than 1 billion U.S. dollars per year from 2000-2006 (Regnier 2008). Also, local authorities may lose credibility after false evacuation orders, making the public more likely to turn to other information sources in future storms (Dow and Cutter 1998). This storm surge overwhelmed many levees in southeast Louisiana, which led to the flooding of approximately 80% of New Orleans . The $81 billion in damage from this storm  ranks Katrina as the most costly natural disaster in U.S. history ). Katrina's large size contributed to this massive storm surge, enabling it to generate a higher storm surge than Hurricane Camille, even though Camille produced stronger winds when it struck the same area in 1969 . Three years later, Hurricane Ike generated a 5.33-meter surge in Chambers County, Texas . This surge level surprised many people, because Ike approached the Texas Coast as a category-2 hurricane on the Saffir-Simpson Scale, with maximum sustained winds of 176 km/hr (95 knots) . At that time, the National Oceanic and Atmospheric Administration (NOAA) generalized category-2 hurricanes as having the potential to generate surge levels from 1.8 -2.4 m  Isaac's large size likely contributed to this massive coastal flooding event, as the storm became a hurricane just hours before landfall in Southeast Louisiana (Berg 2013). Hurricane Isaac produced tropical storm force winds up to 333 km (180 nmi) from the center of circulation for several days before making landfall, and hurricane force winds up to 111 km (60 nmi) from the center of circulation in the hours before landfall . Also, the slow forward movement of Isaac may have also contributed to the large surge, as the duration of persistently strong winds was high in certain locations. Two months after Isaac, Hurricane Sandy generated a destructive storm surge that flooded much of the U.S. Mid-Atlantic Coast, including portions of the greater New York City metropolitan area. The storm caused approximately $50 billion in economic losses and killed 147 people . Damage from Sandy's surge included more than $5 billion in losses to mass transit infrastructure , as the storm surge inundated lower Manhattan and flooded the subway system. Sandy's large size likely contributed to its devastating storm surge. Several hours before landfall on the New Jersey Coast, Sandy generated a massive wind field, with tropical storm force winds extending 778 km (420 nmi) and hurricane force winds extending 333 km (180 nmi) from the center of circulation . From another perspective, the diameter of tropical storm force winds was approximately 1519 km (820 nmi), which is greater than the driving distance from Atlanta to New York (Erdman 2012). These surge events have attracted much attention, and several publications have now investigated the role of hurricane size for generating storm surge. For example  found that hurricane size plays a key role for storm surge generation, particularly over mildly-sloping bathymetry. They also estimate that differences in storm size may cause storm surge heights to vary as much as 30%.  stated that these observations are mimicked by a simple power fit, and further investigated the role of storm size on surge height using 1D and 2D analyses. \nThis study provides the first empirical analysis on the relationship between tropical cyclone size and storm-surge heights. Storm surge is provided from SURGEDAT tropical cyclone position and intensity data are provided by , and a tropical cyclone size dataset is built from nine separate sources.. Tropical cyclone size data were archived as the size of the radius of maximum winds (Rmax), as well as the radius of 63 km/hr (34-kt), 93 km/hr (50-kt) and 119 km/hr (64-kt) winds. Rmax sizes correlated inversely with storm surge heights, pre-landfall wind speeds and the size of wind swaths. Historical examples support this statistical analysis. For example, the cyclones with the three largest Rmax sizes were all tropical storms that did not reach hurricane intensity, and generated average surge levels of approximately 2 m. However, the tropical cyclones with the three smallest Rmax sizes were all major hurricanes that generated large surges, averaging 5.4 m.  . In 2008, Hurricane Ike generated a storm tide of These surge events inflicted tremendous financial losses in the region. Losses from Hurricane Katrina reached as high as $148 billion, adjusted to 2013 dollars, which exceeds Hurricane Andrew, the second most costly hurricane, by more than $100 billion (Smith et al. 2013). Collectively, hurricanes Ivan, Katrina, Rita, Wilma, Ike and Isaac inflicted more than $235 billion in losses, adjusted to 2013 dollars (Smith et al. 2013). Storm surge was responsible for a substantial amount of these losses. The price tag from Katrina's surge alone was tremendous, as the massive storm surge breeched levees and flooded approximately 80% of the New Orleans metropolitan area . Insurance rates reacted to these catastrophes, as property insurance pricing increased after hurricanes Katrina and Ike (Aschkenasy 2014). Following Katrina, some carriers had increased rates up to 40% by 2006 (Warner 2007) and in Louisiana, the State Insurance Rating Commission approved premium increases ranging from 16-35% in 2007 (Green et al. 2007). Homeowners' insurance premiums also rapidly increased, as rates rose by 22% in Louisiana (Mowbray 2007), and residential wind insurance premiums increased by as much as 300 to 400 percent in some coastal zones (Kunreuther and Michel-Kerjan 2009). These storm surge disasters also encouraged the insurance industry to re-evaluate place-based risk for locations in coastal zones. For example, in Louisiana, homeowners' insurance premiums increased the most in flood-prone or coastal parishes (Mowbray 2007). While some carriers raised prices in coastal areas, others decided to stop writing policies in flood-prone locations, like New Orleans (Green et al. 2007). Such practices have also been followed in surge-prone areas outside the Gulf Coast region; insurance rates rose substantially for locations exposed to the it is difficult to analyze water level observations in near real-time to conduct empirical analyses as a storm is approaching the coast. However, an empirical approach offers potential for evaluating long-term coastal flood heights, provided storm surge observations sufficiently account for coastal flooding events over a period of record at a given location. Surprisingly, a thorough literature review reveals that no previous studies have utilized observed storm surge data to conduct an empirical analysis of coastal flooding return levels along the U.S. Gulf Coast. As such, the purpose of this chapter is to fill the gap in the literature by providing the first such analysis.\nThis is the first analysis to use observed water level data to estimate storm surge return periods for the U.S. Gulf Coast. Data are provided by SURGEDAT, a global storm surge database that provides more than 7,600 high-water marks for the United States since 1880. This study analyzed 114 years of data, from 1900-2013, for 26 coastal locations. A key step in this analysis involved building a web tool that returns historical storm surge and storm tide data for coastal locations. This tool enables users to define the center point and radius for a data-selection circle on a Gulf Coast map. After testing circles with 8-km, 16-km, and 40-km radii, I concluded that circles with 16-km radii are optimal for data selection. Circles with 40-km radii often combined data that are inhomogeneous, such as observations from barrier islands and the inner portion of bays, while circles with 8-km radii did not return enough data for statistical analysis. Circles with 16-km radii provided data with adequate homogeneity, and these circles returned 677 observations at 26 coastal locations, or an average of approximately 26 observations per site. This web-tool provides a combination of storm surge and storm tide observations. Storm tide observations are total water levels above established geodetic and tidal datums. I adjusted these observations to the water level above the Mean Sea Level (MSL) for the year of the storm tide event. Observations measured above historical geodetic datums differ from heights above MSL for the year of the storm tide event because sea levels are rising relative to the elevation of land along the U.S. Gulf Coast. I obtained relative sea-level rise RSLR rates for coastal locations to estimate the difference between MSL for the year of the storm tide event and the elevation of the referenced datum. In order to make tidal datum adjustments, I subtracted from the storm tide observation the difference between MSL and the elevation of the tidal reference. Nearly all datum adjustments lowered observed storm tide heights. These procedures provided clean storm surge/ storm tide history for each location that removed errors from datum references. I used the Point Process (PP) method of Extreme Value Theory to predict storm surge return levels for 10-, 25-, 50-, 100-, 200-, and 500-year return periods. This approach enabled me to obtain an annual return rate for extreme storm surges, and also allowed the prediction of return levels beyond the length of the observed dataset. This method follows a peaks-over-threshold approach, and theorizes that for very high values with the average high water mark at each location producing a 468-year event. Also, according to this method, the average location has observed more than two 100-year surge events. The two-tailed Kolmogorov-Smirnov (KS) test indicates the LP method provided a better fit to the data than the PP method at 24 of 26 sites. Inadequate data quantity may partially explain the inaccurate results of the PP method, as the use of the peaks-over-threshold method reduced the average number of observations at each site from approximately 26 to 19. Although the LP method is not designed to predict return levels for time periods beyond the length of the dataset, this approach is still useful for estimating the 10-, 25-, 50-, and 100-year return levels in this study. These values are useful for many highprofile flood protection projects, like the U.S. Army Corps of Engineers flood protection system around New Orleans, which is designed to protect against the 100-year flood (U.S. Army Corps of Engineers 2011). The results from this analysis provided higher storm surge return levels than previous studies. For example, these results provide higher return levels than both statistical and probabilistic modeling efforts for Galveston, Texas, while suggesting that Estimates of the 100-year return levels also confirmed that tidal oscillations introduce only minor errors for storm surge statistics in this region, as the tidal range is < 5% of the 100-year water level at 22 of 26 locations. I also concluded that the influence of sea-level rise on storm surge heights varies dramatically for different locations. For example, if sea levels along the Gulf Coast rise over the next 100 years at the same rate as recent decades, rising seas would only increase the 100-year water levels by < 2% in Bay St. Louis/ Pass Christian, but > 50% at Morgan City, where sea-level rise rates are rapid, but storm surge heights are relatively low. This study also reveals that storm surge climatology in this region is not merely an extension of hurricane-strike climatology. For example, the 100-year storm surge return level at Gulfport/ Biloxi is 2.5 times as high as Morgan City, although major hurricanes strike Morgan City twice as often as Gulfport . Shallow bathymetry and coastal configuration of the Mississippi Coast tend to enhance surge heights, while Morgan City is protected by extensive wetlands, and is situated near a southwest-facing coast, which enables strong, easterly winds to blow offshore and moderate surge levels as hurricanes approach. Such patterns reveal that storm surge climatology is complex and localized, and may vary substantially over short distances. Future research should investigate alternative statistical approaches that better estimate storm surge return levels using a limited record of observed data. Such improvements would be helpful for predicting return levels beyond the length of observed records. Nonetheless, this analysis provides the first empirical estimates for storm surge return levels to the 100-year return period along the U.S. Gulf Coast, which will benefit coastal planning and flood protection, as well as the storm surge modeling community.\nThe energy industry along the U.S. Gulf Coast provides critical resources that help drive the regional and national economy. The oil and gas industry is especially welldeveloped along the Texas and Louisiana Coast, as these two states combine to provide more than 40% of the refining capacity in the U.S. (U.S. Energy Information Administration 2010; U.S. Energy Information Administration 2012), and a large portion of natural gas processing. This robust industry has developed more than 90% of the industrial assets in the region (Entergy 2010). Hurricanes, storm surges and sea-level rise are three natural hazards that impact the energy industry in this region. Much of the region has an active hurricane plants and 32 refineries near the U.S. Gulf Coast that could potentially be inundated by surge. I assigned each facility to one of the 26 cities with storm surge return levels developed in Chapter 5. Facilities were typically matched with the closest cities, however, facilities were not matched with cities that were located on opposite sides of the Mississippi River or New Orleans' Industrial Canal, because high levees along those features typically contain storm surge to one side of these features. The majority of refineries and power plants were assigned to cities in Texas and Louisiana. These states contained 91% of the refineries and 85% of the power plants in the region. Baytown, Texas, provides an example of the massive amount of energy infrastructure in that state, as this city was assigned 25 power plants, which is more than the combined total of all the Gulf Coast plants in Mississippi, Alabama and Florida. Results of this study show that energy facilities along the U.S. Gulf Coast are considerably vulnerable to storm surge inundation. The 100-year storm surge would inundate approximately 72% (23 of 32) of the coastal refineries and 63% (95 of 152) of the coastal power plants. The 25-year storm surge would flood approximately 38% (12 of 32) of the refineries and 30% (45 of 152) of the power plants. The highest quantity and proportion of flooded power plants are found in Southeast Texas and Southwest Louisiana. The 100-year storm surge would inundate 100% of the plants near Galveston, 75% near Baytown, 88% near Sabine Pass and 79% near Cameron. Numerically, this flood level would inundate at least eight power plants near each of these locations, and as many as 18 plants near Baytown. Southeast Texas experiences the greatest storm surge threat to refineries. The 100year storm surge would flood 100% of the refineries near Galveston (3 of 3) and Sabine Pass (5 of 5), and 80% of the refineries near Baytown (4 of 5). This concentrated area of refinery flood risk is remarkable, when considering that these 12 inundated refineries account for more than half of the flooded refineries along the entire U.S. Gulf Coast. Refinery risk is also high near the western shores of Lake Pontchartrain, where the 100year storm surge would inundate 75% (3 of 4) of the refineries near Frenier. Inundation risks are relatively low along the Eastern Gulf Coast, as the Gulf Coast of Mississippi, Alabama and Florida only contain three refineries and 23 power plants. Also, storm surge heights in Western Florida are relatively low at Cedar Key and Tampa, Florida, where the 100-year surge level is less than 3 m. Nonetheless, infrastructure near Tampa is vulnerable to surge, as the 100-year storm surge would inundate 67% (4 of 6) of the power plants near the city. Morgan City is potentially an attractive location to place energy infrastructure, as it is located in the heart of the Gulf Coast Energy Belt, but observes lower surge heights than all locations west of Apalachicola, Florida. The relatively low 100-year surge height at this location (2.78 m), threatens to inundate no refineries (0 of 3), and only 33% (6 of 18) of the power plants in this region. However, the rate of relative sea-level rise near Morgan City exceeds 1.5 m/ century, placing infrastructure at risk to long-term inundation. Nearby Grand Isle also observes lower surge heights than many other cities along the Northern Gulf Coast, but the rate of sea-level rise near this city is also high. A limitation of this study is that it does not account for environmental changes, like sea-level rise or coastal erosion. Another limitation includes the fact that relatively large distances, in excess of 50 km, sometimes separate energy facilities and the cities with surge data. However, these long distances typically occur when refineries or power plants are located well inland, and the city to which they are assigned accurately represents storm surge climatology near the closest point on the coast. I also did not account for localized levees and other flood control devices, as the majority of such structures are privately owned and information about them is not readily available. As such, we cannot assume that facilities will actually flood if storm surge return levels exceed facility elevations. Nonetheless, vulnerable facilities require the construction and maintenance of flood control structures, and such infrastructure sometimes fails, causing widespread flooding. These results will likely provide a wide range of applications, as this is the first regional assessment of storm surge risk to energy infrastructure based on observed data. Industry professionals may find this study useful for siting new facility locations or improving the protection of existing facilities. This analysis may also help coastal communities assess the impact of potential surge events on energy services, or to assess the risk of hazardous materials releases from a high-magnitude storm surge. Professionals in both the insurance and energy sectors may consult this analysis to establish storm surge thresholds that would trigger payouts on derivative policies. In summary, stakeholders in many professions that relate to the development and success of the energy industry along the U.S. Gulf Coast may find this study beneficial."}, {"section_title": "Tropical Cyclone Wind and Position Data", "text": "Tropical cyclone wind and position data are provided by . This dataset provides hourly information on tropical cyclone maximum sustained winds, forward speed, direction and position. The authors utilized spline interpolation to provide non-linear tropical cyclone data from 6-hour observations provided by HURDAT (Atlantic Oceanographic and Meteorological Laboratory 2006)."}, {"section_title": "Tropical Cyclone Size Data", "text": "A thorough literature review reveals that many sources provide tropical cyclone size data. These sources provide a variety of temporal coverage, hurricane size parameters and units of measurement. The most common measurement type is radius of maximum wind (Rmax), which measures the distance from the center of the hurricane eye to the peak wind speed, usually observed in the eye wall. Distances are usually provided in nautical miles, although some sources list distances in kilometers."}, {"section_title": "The Atlantic Oceanographic and Meteorological Laboratory (AOML) HURDAT", "text": "Re-Analysis Project provides four datasets that include hurricane size information. These data provide a comprehensive reanalysis of hurricane characteristics, including the radius of maximum winds. AOML provides data for the years 1851-1910 ), 1911-1920(Landsea et al. 2007), 1921-1930), and 1944-1953(Hagen et al. 2012. Various other sources provide hurricane size data, listed as radius of maximum wind.  provide data for 59 hurricanes from 1893-1979 provide data from -1969 "}, {"section_title": "Analysis of Rmax Size for Storm Surge Generation", "text": "The average Rmax size of the 83 events was 48.3 km (26.08 nmi). The 31 Rmax sizes provided by  show some change in size as tropical cyclones approach the coast. At landfall, the average Rmax size of these events was 61.41 km (33.16 nmi), while the average size at 18 hours before landfall was 67.1 km (36.23 nmi). These results may indicate that Rmax sizes tend to decrease as a tropical cyclone approaches the coast, however, these values were only calculated for a subset of storms for which accurate storm surge data were available, and may not represent patterns found in more extensive analyses. It is unclear why the average size of the storms provided by  is noticeably larger than the average size for the entire dataset. While changes in detection methodologies are a possible explanation, it is also noteworthy that many of the smallest tropical cyclones, like Hurricane Camille and the 1935 Labor Day Hurricane, occurred before 1988, so they are not included in the data provided by . The three storms with the largest Rmax sizes were tropical storms that produced peak surge heights along the west coast of Florida.     , while Hurricane Ike was larger. The radius of maximum winds for Hurricane Ike was 92 km (50 nmi) at 18 hours before landfall and 56 km (30 nmi) at landfall . Although Ike was a larger storm, it generated a peak surge level of 5.33 meters in Chambers County, Texas , while the 1900 Galveston Hurricane generated a peak surge of 6.1meters , which devastated Galveston Island. The storm surge history of the Florida Keys provides further evidence for the inverse relationship between surge magnitudes and Rmax sizes. I have listed the surge magnitude, Rmax size and the wind speed 18 hours before landfall for the 13 Florida Keys surge events analyzed in this study (Table 4.2). This region is chosen because this island chain has relatively consistent bathymetry, without the presence of large bays or sounds, which enhance surge heights .  , , , Landsea et al. (2007), , and Hagen et al. (2012) The four hurricanes with the strongest pre-landfall winds in this region generated the four largest surge events, although not in rank order. However, the hurricanes with the four largest Rmax sizes generated the 6 th , 7 th , 9 th and 12 th largest surges. The 1935 Labor Day Hurricane was the smallest storm in this archive, but it produced the largest modern-day surge height in the Florida Keys. Although the radius of maximum winds for this event was only 11 km (6 nmi) , this storm generated a massive 5. The size of each of these wind swaths was recorded at landfall and 18 hours before landfall. At landfall, 31 observations were provided for radius of 63 km/hr (34-kt) winds, 32 observations for radius of 93 km/hr (50-kt) winds, and 29 observations were available for radius of 119 km/hr (64-kt) winds (Table 4.3). Missing data explain why 33 observations are unavailable for each of these time periods. At 18 hours before landfall, 31 observations were available for 63 km/hr (34-kt) winds and 30 observations were available for both 93 km/hr (50-kt) and 119 km/hr (64-kt) winds (Table 4.3). Missing data account for some of the data loss; however, I intentionally excluded data from Hurricane Charley at 18 hours before landfall, because the storm was centered in the Caribbean Sea, south of Cuba, at this time.    of 37 km (20 nmi), which is smaller than the average distance for the 83 storms with Rmax data, however, the radius of 119 km/hr (64-kt) winds for both of these hurricanes ranked in the top five, and both cyclones generated catastrophic storm surges along the northern Gulf Coast. Many tropical cyclones in the past several decades reveal the importance of windswath area for generating storm surges. For example, the tropical cyclones with the six largest radii of 119 km/hr (64-kt) winds produced the six largest storm surges, although not in rank order. However, relatively low-magnitude storm surges were generated by the 14 tropical cyclones with no radius of 119 km/hr (64-kt) winds at 18 hours before landfall. These events were all tropical storms, with wind intensity less than hurricane force. From another perspective, 75% (12 of 16) of the tropical cyclones with non-zero radii of 119 km/hr (64-kt) winds at 18 hours before landfall generated surge heights of at least 3 m, while none of the 14 storms with a zero value for the radius of 119 km/hr (64kt) winds generated a surge exceeding 3 m. We should use caution not to overestimate the role of tropical cyclone size. The comparison between Katrina and Camille may tempt us to do so, as Katrina is often referred to as a category-3 hurricane that generated a higher storm surge than a category-5 hurricane along the same stretch of coastline. As bathymetry and geomorphology were relatively constant for these two storms, we may overemphasize the importance of tropical cyclone size if we do not consider that Katrina's pre-landfall wind speeds were also intense and surge heights correlate better with pre-landfall winds than wind speeds at landfall see Chapter 3). My analysis also further expands understanding of the importance of pre-landfall tropical cyclone characteristics for storm surge generation. Storm surge magnitudes correlated best with the radii of 93 km/hr (50-kt) winds and 119 km/hr (64-kt) winds at 18 hours before landfall, and these correlations were noticeably higher than the radii of those same wind fields at landfall. These results help us understand that maximum sustained winds are not the only tropical cyclone parameter that correlates better with surge heights before striking the coast than at landfall. Hurricane. Therefore, it appears as though Ike's massive size generated higher surge levels than the 1900 Galveston Hurricane outside the zone of peak surge. This comparison may provide an important insight into this study. While small, intense tropical cyclones sometimes generate high-magnitude storm surges, the extent of inundation along the coastline may be less than the surges produced by larger, lessintense cyclones."}, {"section_title": "Adjusting for Geodetic and Tidal Datums", "text": "Storm tide observations measure the total water level above a datum, or vertical reference line. SURGEDAT references high water marks to both geodetic and tidal datums. Approximately 85% of Gulf Coast storm tide observations in SURGEDAT are tied to such geodetic and tidal datums."}, {"section_title": "Adjusting Geodetic Datum References", "text": "The most common geodetic datums referenced in SURGEDAT are the National Avg. Difference 37.4 Relative Sea-Level Rise (RSLR), which combines eustatic, or global, sea-level elevation changes, with localized changes in land elevation. Relative sea levels are rising faster along much of the U.S. Gulf Coast than the global average because land elevations at many locations are subsiding, or sinking, due to various factors, including sediment compaction of deltas  and extraction of subterranean fluids, like oil, gas or water (Galloway et al. 1999;Nicholls and Cazenave 2010). In order to remove errors introduced by geodetic datum references, I acquired annual RSLR rates for all locations and multiplied those rates by the number of years that passed between storm surge events and the establishment of referenced vertical datums. I then subtracted this value from observed storm tide heights in SURGEDAT to obtain adjusted water levels that provide water heights above MSL for the year of each surge event, which I defined as a new reference line, called \"annual datum.\" Various sources provided data for localized sea-level trends (Table 5.4). A list of MSL trends provided by the National Oceanic and Atmospheric Administration (2013) reveals the rate of RSLR in mm/year for 14 sites included in this study. Most of these 14 sites reference unique RSLR values, however, both Corpus Christi and Port Lavaca, Texas, reference the sea-level trend for Rockport, Texas, which is located between these two cities. Two RSLR values are provided for Galveston, Texas; I referenced the RSLR rate at Galveston Pleasure Pier because this site is located on the Gulf side of Galveston, where higher storm surges have historically occurred. Sea-level trends are also listed for both Padre Island and Port Isabel, Texas, which both fall within the same data-selection circle in South Texas. I referenced the sea-level trend at Padre Island because SURGEDAT provides more comprehensive data at this site than at Port Isabel. I used Table 5.4 (continued). Sea-level trends for 26 locations along the U.S. Gulf Coast. Data provided by ; Galloway et al. (1999); National Oceanic and Atmospheric Administration (2013); and U.S. Department of Transportation (2013). * This value represents the average sea-level trend for the entire record, but rates varied through different periods. Penland and Ramsey (1990) provided sea-level trend data for coastal Mississippi and Louisiana, including multiple sites around Lake Pontchartrain. This source provided data for the U.S. Army Corps tide gauge at West End, which were used to estimate the RSLR rate at New Orleans, for storm surges that approach the city from the north.   They provide a RSLR rate of 1.09 cm/ year at Little Woods and 1.01 cm/ year at South Shore. The average of these two values provide an estimated sea-level trend of 1.05 cm/ year at Shell Beach, which is also located on the St. Bernard Delta Plain. In South Central Louisiana,  provided sea-level trends for Morgan City and Calumet. Trends for both of these sites were used for datum adjustments, and each high water mark in this area was matched with sea-level trend data for either Morgan City or Calumet, depending on the location of the observation. Although these two locations both fall within the Morgan City data-selection circle, and have noticeably different RSLR rates. Calumet has observed a RSLR rate of 1.77 cm/yr, while the rate at Morgan City is 1.26 cm/yr . RSLR rates in Mississippi are considerably lower than much of South Louisiana because of differences in geomorphology. The sea-level trend at Biloxi, Mississippi is only 0.15 cm/year . This trend was used for datum adjustments at both the Biloxi/ Gulfport and Bay St. Louis/ Pass Christian locations. The U.S. Department of Transportation (2013) provides vertical land elevation changes from benchmark surveys for more than 60 sites in Mobile and Baldwin Counties, Alabama. Site BH0144 is located less than 4 km east of the Mobile waterfront, near the junction of the Mobile River and Mobile Bay. This site was selected for datum adjustments at Mobile because of its proximity to the city. Datum adjustments near Baytown, Texas, were the most complicated because rapid subsidence rates occurred throughout much of the 20 th century near this location due to the extraction of subterranean fluids, such as oil, gas and water. Subsidence rates also changed over time in this area, as ground elevations responded to localized fluid extraction. Oil extraction in the region began in 1917, when the Goose Creek Oil Field was developed near the modern-day Houston Ship Channel (Galloway et al. 1999). By 1926, localized subsidence in this area already reached 0.91 m (Galloway et al. 1999). Subsidence continued through the 1970s, reaching at least 1.83 m along the Houston Ship Channel, between Houston and Bayport (Galloway et al. 1999). By 1979, 5,150 square km of land had subsided at least 0.3 m and maximum subsidence levels reached as high as 3.05 m (Galloway et al. 1999). In nearby Pasadena, cumulative subsidence exceeded 3.05 m between 1906-1995 (Stork and Sneed 2002). The drowning of the Brownwood subdivision in Baytown provides an excellent example of the local impacts of rapid subsidence in this area. This subdivision was constructed in 1938 and consisted of approximately 500 single-family homes (Galloway et al. 1999). Although portions of Brownwood were located as high as 3.05 m above sea level, flooding from high tides and storm surge occurred frequently after more than 2.44 m of subsidence occurred (Galloway et al. 1999). The entire community was abandoned (Galloway et al. 1999) after Hurricane Alicia generated a 3.69-m storm tide near the entry to the Houston Ship Channel in 1983 (National Weather Service 2011). I referenced subsidence maps provided by the Harris-Galveston Coastal Subsidence District and published in Galloway et al. (1999), in order to make datum adjustments of storm tide heights in this region. These maps provide regional subsidence trends for the time periods 1906-1943, 1943-1973, and 1973-1995. They depict total subsidence levels, from which I calculated average annual subsidence rates. I estimated subsidence trends for the area where the present-day Houston Ship Channel divides the cities of Baytown from Laporte, because most of the observations from the Baytown data-selection circle come from one of these two cities. For the years 1995-2013, I used the 1906-1943 rates, because recent subsidence rates relate better to the 1906-1943 era, before rapid industrialization caused the most rapid subsidence. In recent decades, subsidence rates have been arrested, due to laws restricting and prohibiting the extraction of fluids (Stork and Sneed 2002), so the use of the slower subsidence rates for this period is appropriate. Table 5.5 provides the total subsidence and annual subsidence rates for Baytown/ Laporte during the four time periods. The total amount of subsidence estimated in this region between 1906-2013 is 1.28 m, which provides an annual sea-level trend of 1.19 cm/yr. This is a conservative estimate that represents the general subsidence in this area, although localized maximum levels in the region have reached as high as 3.05 m (Galloway et al. 1999). Adjustments of storm tide observations in SURGEDAT were customized depending on the number of years that transpired between the coastal flooding event and the year of the datum reference.   This adjusted water level is not a storm surge because the time of the peak water level is unknown, so I cannot remove the tidal influence from the day of the storm tide event."}, {"section_title": "Adjusting Tidal Datum References", "text": "The most common tidal datums include Normal Astronomical Tide (NAT), Mean Sea Level (MSL), Mean Low Water (MLW), and Mean Lower Low Water (MLLW). Observations measured above NAT already remove the tidal component of the water level, essentially classifying such observations as storm surges. Water heights measured above MSL were left as unadjusted storm tides, as I assumed the MSL level to refer to the year of the surge event. Numerical adjustments were made, however, for observations referenced to MLW and MLLW, as it was necessary to convert these datums to MSL. In all of these cases, such datum adjustments lowered the observed water level. For tidal datum adjustments, I used tide data from the NOAA Tides and Currents Web Portal, provided by the National Oceanic and Atmospheric Administration (2014). Each referenced tide gauge had a customized graphic and table that provided the heights of various tidal datum. All of these data referenced the Present Epoch, which extended from 1983-2001. I assumed stationarity of tidal data over time, which enabled me to use data from the Present Epoch to make tidal datum adjustments for surge events at any time in the data record. This assumption is reasonable, as the range of tidal cycles should stay approximately stationary, even as sea levels rise relative to the elevation of land. A storm tide generated by Hurricane Alma in 1966 in the Florida Keys provides an example of a tidal datum adjustment. This storm generated a 1.07-m storm tide above MLW at Key West . The difference between MSL and MLW at Key West is    and National Oceanic and Atmospheric Administration (2014).  where the elevation of MLW was lower than MLLW. Tidal datum adjustments did not account for tidal oscillations on the date of storm tide events, which means that adjusted water levels are not storm surges, but storm tides measured above MSL. The timing of such storm tides affects maximum water levels; a storm surge inundating one location at the time of high tide will produce a higher total water level than a storm surge of equal magnitude inundating a different location at the time of low tide. As such, tidal oscillations introduce errors for storm tide observations, because the timing of most observed storm surge events is unknown in SURGEDAT. Fortunately, the Gulf of Mexico is a microtidal basin, where tidal ranges are < 1 m (Stumpf and Haines 1998)."}, {"section_title": "Statistical Analysis", "text": ""}, {"section_title": "Extreme Value Theory", "text": "Storm surges are rare events and historical storm surge measurements in most locations only extend back less than 125 years, providing sparse data for building reliable empirical models for events that exceed the data record. Extreme value theory has often been used as an alternative to estimate the probability of rare events, including extreme hurricane winds (Chu and Wang 1998;Jagger and Elsner 2006;Elsner et al. 2008; Emanuel and Jagger 2010), volcanoes (Mendoza-Rosas and De la Cruz-Reyna 2008;Sobradelo et al. 2011), and wildfires (Jiang and Zhuang 2011). Extreme value theory is a powerful tool for analyzing extreme events because it attempts to model only the tail end of a distribution, or in other words, the distribution of the extreme events only (Coles 2001). Through the use of mathematical limit arguments, extreme value models allow for the study of events that are much greater than what have already been observed (Coles 2001). The ability to extrapolate from observed levels out to higher, unobserved levels is important when considering a location's storm surge risk, because it is likely that storm surge heights greater than what have been observed in the historical record will occur in the future."}, {"section_title": "Point Process Model for Extreme Values", "text": "The Point Process (PP) representation of extreme value behavior is one of a variety of different approaches to extreme value modeling (Coles 2001). Pickands III (1971) was the first to introduce the PP approach for use in extreme value statistics, and  was one of the first to develop the theory needed to apply the approach. For the derivation of the PP model for extreme values, and its connection to other extreme value distributions, see Coles (2001). The PP extreme value model is a physically appropriate model for storm surge, because it enables surge occurrence to be modeled separately from surge height. In addition, in contrast to some other extreme value methods, an annual return rate for extreme surge can be obtained, rather than just a return rate per surge occurrence. For these reasons, the PP approach to extreme value statistics has been used to model similar types of phenomena, such as hurricane wind speeds (Jagger and Elsner 2006). The PP approach is based on the theory that for very high values above a threshold u, the frequency of extreme events follows a Poisson distribution with mean exceedance rate λ u , and the threshold excesses, or the magnitudes of the events, follow a generalized Pareto distribution with parameters location μ, scale σ, and shape ξ. The choice of a threshold u is important. Choosing a high threshold reduces the risk of bias, but the threshold exceedances may be too few to create a meaningful model (Coles 2001). Therefore, it is common to fit the model at various thresholds and choose the highest threshold at which there is some stability in the parameter estimations, though this distinction is somewhat subjective. An additional consideration in this study was the desire to choose a common threshold among all 26 cities to standardize the data analysis. Coast. This plot shows the range of parameter values for location, scale and shape. Lower threshold values produce more stable results, as the range of parameter estimates is smaller than the parameter range of higher thresholds. For example, the range of parameter estimates for both location and scale begin to increase substantially for surge thresholds ≥ 1.2 m. Also, the difference in parameter estimates between consecutive threshold values is lower for low thresholds. After reviewing these plots, several advantages became apparent for using a threshold of 0.91 m. At this level, there appears to be stability in the parameter estimates.  A threshold of 0.91 m is also proximal to 1 m, which is a water level that has already been used to investigate topics related to coastal flooding and sea-level rise. For example,  concluded that 3.7 million people in the U.S. would be inundated by a 1 m sea level rise. Nicholls et al. (1999) estimates that a 1 m sea level rise would increase the global population in coastal flood hazard zones by 25%. A threshold of 0.91 m provides more data in this study than a threshold of 1 m, because high water marks in this region have usually been recorded in feet, and numerous observations have magnitudes of 0.91 m (3 ft). Approximately 85% of the locations (22 of 26) contain more data with a threshold of 0.91 m than 1 m, and the number of observations at Slidell, Louisiana, increases from 19 to 24 when using the lower threshold. Before applying the threshold, the average location in this study contained approximately 26 observations, but a threshold of 0.91 m decreases the average number of observations to 19.3, while a threshold of 1 m reduces the average to 17.7 (Table 5.7).  Table 5.7 (continued). Comparison of observed storm surge/ storm tide events at each location and the number of events ≥ than the 0.91 m threshold used in the Point Process method. * Includes estimates of two events that were observed at Galveston, Texas. Although an average quantity of 19 observations per site may be inadequate for traditional statistics, extreme value analysis is useful for analyzing datasets that are short or incomplete (Davison and Smith 1990;Coles 2001;Beguería 2005;Sobradelo et al. 2011). The precedent has also been set for analyzing datasets with similar or less data quantity; for example, (Sobradelo et al. 2011) -Galveston, Texas, 1962). However, this short dataset may introduce analytical errors at this site. Given a storm surge event that is above the threshold u, the probability that the surge height is greater than some magnitude v is expressed as: To estimate the parameters μ, σ, ξ for each city's surge data, Maximum Likelihood Estimation (MLE) is used to evaluate Equation 1 to find the parameter combination that maximizes the function. There are other ways to estimate the parameters, but MLE is the most commonly used method because it provides standard errors for the parameter estimates. After obtaining the parameter estimates, the annual number of storm surges that exceed the threshold can then be modeled as a thinned Poisson process with mean exceedance rate: Using the exceedance rate from equation 2 and the GPD parameters, the return level for a given return period x is expressed as where ( ). Therefore, these equations can be used to estimate return levels for any return period-even periods of time that extend well beyond the length of observed data. This is important because coastal planning and engineering projects often reference long-term return periods, sometimes exceeding hundreds of years. For example, FEMA has delineated the 500-year flood plain on localized maps, and has determined that areas outside this zone have minimal flood risk (Federal Emergency Management Agency 2013). The Netherlands has extended flood analyses for even longer periods, as the country has developed some of the best flood defenses in the world, and portions of the country are now protected by dykes built to the 10,000-year flood level (Vermeer 2005). The return periods for which I estimate surge heights are 10-, 25-, 50-, 100-, 200-, and 500-years (Table 5. "}, {"section_title": "Logarithmic Plotting", "text": "As this is the first study that employs Extreme Value Theory to estimate storm surge return levels from observed data along the U.S. Gulf Coast, it is difficult to evaluate the accuracy of the results. As such, I also determined to estimate storm surge return periods in this region with Logarithmic Plots (LP), which are useful for fitting trend lines to historical observations. Such plots have been used in a wide variety of studies (Huff and Angel 1992;Faiers et al. 1997;Sindhu and Unnikrishnan 2012). Huff and Angel (1992), and Faiers et al. (1997) have produced such plots by incorporating the Weibull plotting position formula: where \"n\" is the number of years in the data record. Makkonen (2008) provides a detailed discussion of plotting position formulas and their limitations in engineering design. Exceedence probabilities were then utilized to calculate return periods in years, utilizing the formula: Return Period = 1 / Exceedence Probability The Huff-Angel linear regression technique, used by Huff and Angel (1992), utilizes a log-log scale (for the x and y axes), thereby graphing and linearizing the surge events in their appropriate Weibull plotting position. Faiers et al. (1997) also utilized a linear regression procedure, with a log scale on the x-axis (return period), and a linear scale on the y-axis (event magnitude). I determined to use the log-linear method employed by Faires et al. (1997) after visually assessing the fit provided by both of these methods. Louisiana. Table 5.9 lists the storm surge return levels for each of the 26 coastal locations using the LP method.     More specifically, both methods estimate the highest water levels at Bay St. Louis/ Pass Christian, Mississippi, followed by Baytown, Texas, and then Gulfport/ Biloxi, Mississippi. The PP method estimates a 500-year storm surge of 12.35 m and a 100-year storm surge of 6.76 m at Bay St. Louis/ Pass Christian, while the LP method predicts a lower 500-year level of 12 m at this site, but a higher 100-year level of 7.95 m. Both methods estimate the lowest return levels at Cedar Key, Florida, followed by Tampa, Florida, and then Morgan City, except for the 500-year level for the PP method, which is lower at Morgan City than Tampa. At Cedar Key, the PP method estimates return levels of 2.54 and 2.15 m for the 500-year and 100-year return period, respectively, while the LP method estimates 3.49 and 2.53 m for the same return periods. A distinctive pattern is visible for the PP plots found in Figures 5.9a and 5.9b. Water levels for cities with high return levels continue rising substantially after the 100year period on the x-axis. However, the slope of the return levels flattens out considerably by the 100-year return period for cities with lower 100-and 500-year return levels. This is apparent on the graphs for Freeport, Morgan City, Mobile, Cedar Key and Tampa, and explains the small size of bars for the 200-and 500-year levels at these cities in Figure 5.8. While the general pattern produced by these two methods is similar, the actual predicted water levels are quite different. The PP method estimates lower water levels than the LP method at all locations, with the exception of Bay St. Louis/ Pass Christian and Dauphin Island. Differences typically increase for higher return periods. For example, the LP method estimates a water level 1.03 m higher than the PP method for the 100-year return period at South Padre Island, but this difference increases to 1.96 m for the 500-year return period. This pattern is especially pronounced on the Texas Coast, where the difference in the 100-year water level exceeds 1 m and the difference in the 500-year water level ≥ 1.83 m (6 ft) at 71% of the sites (5 out of 7). The largest differences between these methods are visible for the 500-year return periods at Port Lavaca and Baytown, where the LP method estimates higher return levels of 2.89 and 2.68 m, respectively. Large proportional differences between these methods are apparent at locations where the PP method flattens out the return level plot, producing relatively low 100-, 200-and 500-year water levels. For example, the slope of the PP plot at Morgan City approaches zero as time increases; the difference between the 200-year and 500-year water level is only 0.05 m at this location. However, the LP method estimates that water levels will continue to rise for time periods beyond 100 years, and the difference between the 100-year and 500-year level at this location is 1.1 m ( Figure 5.10). As absolute water levels at Morgan City are predicted to be relatively low by both methods, the predictive differences in these two methods are proportionally large. The LP method predicts a 500year water level of 3.88 m at Morgan City, which is 66% higher than the 2.56-m water level estimated by the PP method. Similar differences are apparent at Freeport, Mobile, Cedar Key and Tampa. From another perspective, the LP method reduces the difference between the most extreme water levels, as this approach decreases the return levels at Bay St. Louis/ Pass Christian, but increases the return levels at most other sites. The PP method estimates that the 500-year return level at Bay St. Louis/ Pass Christian is 4.86 times higher than at Cedar Key, while the LP method estimates that Bay St. Louis/ Pass Christian is only 3.44 times higher. In summary, the LP method estimates less difference between the cities with the highest and lowest water levels. Figure 5.10. Return level plot using a probabilistic modeling approach on thousands of synthetic surge scenarios, provided by Stoeten (2013), page 56. The blue line estimates return levels at the Open Coast, which pertains to Galveston City, and the red line predicts storm surge levels closest to Baytown, Texas. These water levels are considerably lower than my data-driven estimates."}, {"section_title": "Evaluating the PP and LP Methods", "text": "Evaluation of these methods suggests the PP method usually underestimates storm surge return levels. I came to this conclusion after analyzing the return periods of the highest watermarks at each location, and applying the Kolmogorov-Smirnov test, which analyzes counts above specific return periods to test goodness-of-fit.  (Kenkel 1984). This test also requires at least five cases, and my study compares six different return period lengths. Table 5.11 provides the expected number of exceedences for each return period, which was obtained by dividing the total number of years in the analysis (114) by the return period length. Tables 5.12 and 5.13 provide the actual number of exceedences above return levels at each site using the PP and LP methods. Table 5.14 provides the value of the two-tailed KS statistic at each site; lower values indicate a better fit. The LP method produced a better fit at 24 of the 26 sites. The PP method produced a better fit at Galveston, Texas, and both methods produced equally good fits at Key West, Florida. These results suggest that the LP method provided a better overall fit than the PP method. The difference between the results provided in this chapter and previous methodologies is also evident for Galveston, Texas. Table 5.15 provides a list of 100-year storm surge levels estimated for Galveston using different methodologies, adapted from Stoeten (2013). These methods include statistical analysis of tide records near Galveston and Bolivar Roads, as well as probabilistic modeling. The 100-year storm surge estimated in this study is noticeably higher than all of these other methods. The probabilistic model provided by Stoeten (2013) provides a valuable contribution towards understanding storm surge in the region, however, it also reveals the importance of validating models with observed data. This model estimated surge return levels by generating thousands of synthetic surges in the Galveston Bay area, and predicting a 100-year storm surge of ~ 3.95 m near Galveston and ~ 4.3 m near Baytown (Figure 5.11). This predicted level is 37% lower than my 100-yr estimate at Galveston and 57% lower than my 100-yr surge at Baytown, which are 5.36 m, and 7.54 m, respectively. I believe the model underestimates surge potential in the region, because the modeled 10,000-yr water level only reaches ~ 5.4 m at the city of Galveston, however, this location already observed a 6.1 m storm tide . According to the modeled plot, the storm tide produced by the 1900 Galveston Hurricane would have been at least a 100,000-year water level (if the plot is extrapolated), and the 4.72-m storm tide at Galveston in 1915 (Connor 1956;Landsea et al. 2008) was approximately an 800-year event. Nonetheless, modeling efforts are important, and future research will hopefully combine advanced modeling techniques with statistical analysis of observed surge data.  Figure 5.11. Water level heights generated by Hurricane Ike in 2008. This image shows that proximity to landfall is not the only important factor that influences surge heights. Note that Shell Beach (city 11) observed higher water levels than Morgan City (city 9) and Grand Isle (city 10), even though Ike made landfall at Galveston (city 5). Adapted from Doran et al. (2009); Federal Emergency Management Agency (2009); Berg (2010). I cannot explain why the LP method also produced a better fit than the PP method, however, inadequate data quantity may provide a partial explanation. The LP method utilized more observed data because it fit all observations on logarithmic plots, and did not exclude data below a certain magnitude. The PP method, however, used a peaks-over-threshold approach and, in this case, eliminated all observations < 0.91 m. This truncation of the dataset reduced the number of surge observations for the PP method to approximately 19 observations per site, whereas the LP method plotted an average of 26 observations per site.  indicate that the performance of the Maximum Likelihood approach, which was used in the PP method, may be erratic for sample sizes ≤ 25. However, the LP method also fit the data better at New Orleans, Bay St. Louis/ Pass Christian, and Gulfport/ Biloxi, even though more than 25 observations exceeded the truncation level at each of these sites. On the contrary, the PP method provided a better fit than the LP method at Galveston, Texas, the site with the most observed data, where 34 observations exceeded the truncation level. These results may indicate that the observed storm surge record for the U.S. Gulf Coast is currently inadequate to predict storm surge return levels for time periods that exceed the data record. Such predictions are theoretically possible through Extreme Value Theory, but the PP analysis in this study produced unreliable results. Although the LP analysis provided a better fit to observed data, this method is not designed to predict return levels beyond the length of data record, but it still may be valuable for estimating the annual storm surge probability (Elsner et al. 2008). Estimates of 100-year storm surge levels also provide limits on analytical errors caused by tidal oscillations. Although I adjusted the data for geodetic and tidal datum references, these corrections set water marks above MSL for the year of the storm surge event, a reference line I called, \"annual datum.\" However, these adjustments did not account for the influence of tides on the day of the storm surge event. Table 5.16 provides a comparison between the magnitude of tidal oscillations and 100-year storm surge return levels at each location. Tidal ranges are calculated by averaging the difference between MSL and both Mean High Water (MHW) and Mean Low Water (MLW), from tidal data provided by the National Oceanic and Atmospheric Administration (2014). Error estimates were then computed by dividing the average tidal range by the height of the 100-year storm surge level. Following this approach, tidal oscillations account for < 5% error of the 100-year surge height at 22 of 26 locations. Cedar Key and Tampa Bay were two outliers, as tidal ranges in these locations reached 17% and 11.3% of the 100-year storm surge level, respectively. These two sites have higher tidal ranges than the other locations and have observed relatively low-magnitude storm surges through the observation period. The lowest tidal error was 1.7% at Slidell. Such estimates assume stationarity of tidal oscillations over time, however, sealevel rise is a problem that introduces non-stationarity of water levels over longer time periods. Although the geodetic datum adjustments corrected for errors in historic storm tide observations that were caused by relative sea-level rise, I have not accounted for the future influence of sea level rise on extreme water levels. A detailed investigation on this topic is beyond the scope of this chapter, however, a quick comparison of two extreme cases is useful. Coastal Mississippi has observed slow RSLR rates of only 0.15 cm/yr ), but this area has observed the highest storm surges in the Western Hemisphere, and the 100-year storm surge return level at Bay St. Louis/ Pass Christian is estimated to be 7.95 m. < 2% of the 100-year storm surge level. However, Morgan City has observed rapid RSLR, as the two locations that provide data near this city average RSLR rates of 1.52 cm/yr . The 100-year storm surge at Morgan City is only 2.78 m, which is relatively low for the region. As such, RSLR will comprise a relatively large increase onto future surge levels at this location. Assuming that RSLR rates continue increasing at the same rate and storm surge observations remain stationary in the future, the Morgan City area would observe approximately 1.5 m of RSLR in the next 100 years, which accounts for > 50% of the 100-year storm surge level. This means the impact of sea-level rise on storm surge levels would be noticeably higher at locations like Morgan This study also reveals that storm surge return levels vary considerably depending on location. For example, the 100-year return level at Bay St. Louis/ Pass Christian is at least three times as high as Tampa and Cedar Key. Although the frequency of hurricane strikes influences these results, this study suggests that storm surge climatology along the U.S. Gulf Coast is not merely an extension of hurricane-strike climatology. For example, major hurricanes strike Morgan City twice as often as Gulfport , however, the 100-year storm surge return level at Biloxi/ Gulfport is more than 2.5 times higher than Morgan City. Expanding on this example, several factors beyond the frequency of hurricane strikes contribute to elevated storm surge levels along the Mississippi Coast and modest storm surge levels near Morgan City. Shallow bathymetry and coastal features that are efficient at trapping water near the Mississippi coast enhance surge heights in that region . Water tends to funnel into Bay St. Louis, and the nearby Mississippi River Delta often traps water that is flowing from east to west as hurricanes approach the coastline. However, Morgan City is protected by more than 20 km of wetlands (Google Earth 2014), which usually reduce surge heights (Wamsley et al. 2010 Texas. This massive hurricane produced strong east winds along much of the Northern Gulf Coast , and this wind was blowing onshore at Shell Beach, but offshore at Morgan City. A map of observed water levels at cities along the Gulf Coast ( Figure   5.12) reveals that Ike generated higher water levels at Shell Beach than Morgan City or Grand Isle, even though Shell Beach is located farther from Ike's landfall location than the other two cities. This example proves that comparatively low storm surge return levels in places like Morgan City and Grand Isle are not caused by lack of hurricane strikes, but because of coastal geography. For cases in which hurricanes strike closer to Morgan City, the highest surge levels often do not occur as hurricanes make landfall, but rather after hurricanes pass the area, when wrap-around winds on the backside of the storm push water in from the west. Maximum sustained wind speeds are therefore usually less intense as the surge is peaking in this area, and this moderates surge levels. This exact scenario happened during Hurricane Andrew in 1992, when water levels in the region peaked more than four hours after Andrew's closest approach (Halford 1995). Although Andrew made landfall as a category-3 hurricane approximately 37 km west-southwest of Morgan City (Rappaport 1993), the highest water level close to Morgan City was a storm tide of 2.3 m above NGVD 29 at Calumet (Halford 1995), which reduces to 1.26 m above the annual datum after a geodetic datum adjustment. This pattern resembles storm surges that occur on the  2013). These water levels are higher than any tropical surges found in SURGEDAT in this region. The city of Cedar Key, one of the locations analyzed in this chapter falls in this region. The storm surge in March, 1993, reached 2.9 m, surpassing the 2.59-m surge generated by Hurricane Alma in 1966 , which is the highest tropical surge on record at this location. Although this study reveals considerable geographic variability of storm surge return levels along the U.S. Gulf Coast, the analysis is based completely on historical storm surge observations from 1900-2013. Data from this time period indicate that modest storm surge levels have been observed at locations like Morgan City, Cedar Key and Tampa, where 100-year storm surge levels are less than 3 m. However, such results do not ensure the absence of catastrophic storm surges in these locations in the future. For example, models suggest that if a hurricane tracked east across the Gulf of Mexico and made landfall north of Tampa, surges in downtown Tampa could reach 6 m . Therefore, one should take caution when considering storm surge potential in locations with low return levels, like the West Coast of Florida."}, {"section_title": "Army Corps of Engineers 1970)", "text": ". A large amount of oil was released from a floating storage tank at a refinery in coastal Mississippi (Chevron 1998) when a 2.93-m storm surge inundated Pascagoula during Hurricane Georges in 1998 (Guiney 1999). A tank containing hazardous gasoline additives at this same facility floated from its foundations (Chevron 1998). More recently, almost 50 oil spills were reported near the coastline during Hurricane Katrina . The Murphy Oil Spill released 819,000 gallons of oil into a densely populated region of St. Bernard Parish, and was one of five releases that exceeded 800,000 gallons . This spill occurred as surging waters dislodged and lifted an above-ground storage tank. During the same event, approximately 10,500 gallons of oil from the Shell Oil Spill reached the coastline and polluted coastal marshes . at these locations are 0.965 cm yr -1 , 0.924 cm yr -1 , and 0.684 cm yr -1 , respectively. These rates mean that in South Louisiana, sea-levels will rise nearly 1 m per century relative to land, which is five times higher than the global average observed over the past century (Doyle et al. 2010). These rapid RSLR rates in South Louisiana have produced the fastest rates of coastal erosion in the United States (Gosselink et al. 1998;Stone et al. 2003). The rapid rate of RSLR rise in this region places ports and energy infrastructure at risk to inundation. For example, a 61-cm increase in RSLR may impact 64% of the port facilities in this region, while a rise of 1.22 m would impact nearly 75% of these facilities (Climate Change Science Program 2008; Burkett 2011). Such impacts may be most severe in South Louisiana, which contains more than half of the energy facilities in the nation located ≤ 1.22 m above sea level (Carraway 2013). Looking into the future, the combination of subsidence/sea-level rise and asset growth may increase asset loss by as much as 30% from 2010-2030 (Entergy 2010). Storm surge return levels developed in Chapter 5 depict considerable geographic variability in this region (Table 6.1, Figure 6.1). For example, 100-year return levels at Bay St. Louis/Pass Christian, and Gulfport/Biloxi, Mississippi, as well as Baytown, Texas, all exceed 7 m, whereas return levels at Cedar Key and Tampa, Florida, as well as Morgan City, Louisiana, are less than 3 m. Such variability is caused by a variety of factors, including differences in hurricane tracking patterns, bathymetry, and the shape, geometry and aspect of the coastline. This dataset indicates that 1,711 electricity generation facilities are located in the 10-state southeast region, with the three most common fuel types comprised of natural gas, hydropower, and other renewables. Net operating capacity among these facilities was largely attributed to natural gas, coal, or nuclear plants. Electricity generation facilities included those operated by electrical utilities engaged in the generation, transmission, and distribution of electricity as well as industrial generators. The database also contained 54 oil refineries, which were concentrated in Texas and Louisiana, as well as the refining capacity of those facilities. As fossil fuels are the predominant fuel source for electricity generation facilities in the region, those facilities representing renewable energy (hydropower, solar, geothermal) were excluded from the study. The database includes facilities that have been decommissioned, as well as those that have been planned but are not yet generating. Both were included in the case study, as former facilities have potential to be used in the future through redevelopment and repowering of the existing site, while the latter may be exposed to future climate change once operations commence. The majority of these facilities were adjacent to the Gulf of Mexico, which has been described as the 'Energy Coast' (AWF et al. 2008), and which has been the focus of prior energy infrastructure vulnerability assessments Strauss and Ziemlinksi 2012)."}, {"section_title": "Justification for Research", "text": "In the past decade, tropical cyclone-generated storm surges have emerged as a major natural hazard that are not well understood. In 2005, Hurricane Katrina inflicted one of the most severe natural hazards in U.S. history, as this storm killed more than 1,800 people ) and inflicted more than $100 billion in damage ). Katrina's catastrophic storm surge reached the highest level of any surge in the Western Hemisphere (see Chapter 2), which was surprising, as this hurricane made landfall as a category-3 hurricane in the same region where Hurricane Camille made landfall as a category-5 hurricane in 1969 . Katrina was the first of several large hurricanes in recent years that generated devastating storm surges in the United States. In the years following Katrina, storm surge modeling efforts have attempted to better understand the processes by which tropical cyclones generate storm surges. Modern research now indicates that in addition to maximum sustained winds, a hurricane's size , forward speed (Rego and Li 2009), as well as the coastal shape and bathymetry Resio and Westerink 2008;Westerink et al. 2008; all influence storm surge heights. Research has also investigated the vulnerability of specific locations to storm surges, after losses from Katrina caused instability in the insurance industry. For example, the Federal Emergency Management Agency (FEMA) has collaborated closely with the National Hurricane Center to investigate the maximum potential for storm surge along the U.S. Gulf and Atlantic Coasts, in order to update Flood Insurance Rate Maps (FIRM). This effort has relied upon the Sea, Lake and Overland Surges from Hurricanes (SLOSH) model that is run at the National Hurricane Center ). All of these efforts relied upon modeling, as empirical storm surge research was not yet possible without a credible storm surge database for the United States. However, in my master's thesis, I developed the first storm surge database for the U.S. Gulf Coast, which was later developed into a peer-reviewed journal article ). This database, called SURGEDAT, started as a peak storm surge database for the U.S. Gulf Coast, but has expanded to include all high water marks from all tropical cyclones for the U.S. Gulf and Atlantic Coasts . This dissertation has continued the momentum of the SURGEDAT project. The coverage of storm surge data was expanded to a global scale, while U.S. Gulf Coast data were used to analyze how tropical cyclones generate storm surges, and to understand the storm surge vulnerability of specific locations in this region. These analyses pioneered new territory, as they provided the first data-driven approach for researching storm surge along the U.S. Gulf Coast."}, {"section_title": "Summary of Results", "text": "The first analysis chapter (Chapter 2) provided a global literature review of storm surge data. I reviewed data sources, observations and impacts in six ocean basins that frequently observe tropical cyclone-generated storm surges. Available literature provided more than 700 unique storm surge events since 1880, the majority of which were found in the Western North Atlantic Basin. The Bay of Bengal in the Northern Indian Ocean consistently observes the world's highest storm surges, as this sub-basin averages five surges ≥ 5 m per decade, and has observed credible storm tide levels reaching 13.7 m . This sub-basin also observes the deadliest surges, as six tropical cyclones in this region have killed at least 138,000 people ). The Western North Pacific observes the highest rate of low-magnitude storm surges, as the coast of China averages 54 surges ≥ 1 m per decade , and rates are likely even higher in the Philippines. Analysis in Chapter 1 has found that the U.S. Gulf Coast observes an average of one storm surge ≥ 5 m and 18 storm surges ≥ 1 m per decade, which ranks this region in second place for high-and low-magnitude storm surge counts in a global context. Chapter 3 provided an analysis of the correlation between storm surge heights and tropical cyclone wind speeds at and before landfall. A landfall/ surge classification system was developed to provide a consistent landfall classification among all storms. This methodology yielded 117 wind/ surge events from 1880-2011 with useable data. Storm surge heights in this study correlated best with pre-landfall wind speeds, with wind speeds 18 hours before landfall producing the optimal correlation. Higher wind-surge correlations were found when testing a more recent sample of data that contained 63 wind-surge events since 1960. The highest correlation for these data were found when wind speeds 18 hours before landfall were raised to a power of 2.2, which provided Rsquared values that approached 0.70. R-squared values at landfall for these same data were only 0.44. Chapter 4 also provided an analysis on the relationship between storm surge heights and tropical cyclone characteristics, however, in this chapter tropical cyclone size was correlated with surge heights. For this analysis, I constructed a unique hurricane size dataset from nine different data sources, which provided the radius of maximum winds (Rmax) and radii of 34-kt, 50-kt and 64-kt winds. Statistical analysis revealed an inverse correlation between storm surge magnitudes and Rmax sizes, while positive correlations existed between storm surge heights and the radius of 34-kt, 50-kt and 64-kt winds. Storm surge heights correlated best with the pre-landfall radius of 50-kt winds, with a Spearman Correlation Coefficient value of 0.8158, significant at the 99.9% confidence level. The 1900 Galveston Hurricane, the 1935 Labor Day Hurricane and Hurricane Camille in 1969 support these results, as they all had small Rmax sizes, but generated catastrophic surges U.S. Army Corps of Engineers 1935;) Hurricane Katrina demonstrated the importance of large wind fields, as hurricaneforce winds extending 90 nmi from the center of circulation ) enabled this large storm to generate a higher storm surge level than Hurricane Camille along the same stretch of coast, even though Camille's pre-landfall winds were slightly stronger than Katrina's (see Chapter 3). In Chapter 5, I conducted the first empirical analysis of storm surge return levels along the U.S. Gulf Coast. This analysis used a web-tool that provided a comprehensive list of historical water levels for any location in the region from 1900-2013. This tool returned an average of 26 observations for 26 coastal locations. These data included historic storm surge and storm tide observations. Geodetic and tidal datum adjustments removed errors in the dataset and provided storm tide heights above mean sea level for the year of the flood event. Statistical analysis utilized the Point Process (PP) model of Extreme Value Theory as well as a Logarithmic Plotting (LP) method to estimate 10-, 25, 50-, 100-, 200, and 500-yr return levels in the region. A two-tailed Kolmogorov-Smirnov statistic indicated the LP method provided a better fit to observed data, as the PP method underestimated water levels at most sites. Although the LP method is not designed to estimate return levels beyond the length of the data record, the results are still useful for predicting out to the 100-yr level. This method showed considerable geographic variability in return levels, as the highest 100-yr level was 7.95 m at Bay St. Louis/ Pass Christian, Mississippi, and the lowest level was 2.53 m at Cedar Key, Florida. Relatively low return levels were also found at Morgan City, Louisiana, where strong easterly winds in advance of a hurricane tend to blow offshore and moderate storm surge levels. Chapter 6 provided a regional vulnerability analysis that considered the risk of oil refineries and power plants to surge inundations. Storm surge return levels estimated in Chapter 5 provided water level data, while a unique dataset provided by Oak Ridge National Laboratory contained 152 power plants and 32 refineries that could potentially be inundated by Gulf Coast storm surges. Texas and Louisiana contained most of this infrastructure, as 91% of refineries and 85% of power plants in the region were located in these states. Results indicate that storm surge is a serious threat in this region, as the 100year surge would inundate 72% of the oil refineries and 63% of the power plants in the coastal zone. East Texas stands out as the most vulnerable sub-region, as the 100-year storm surge would inundate 92% (12 of 13) refineries in the Galveston-Baytown-Sabine Pass region, and 18 power plants near Baytown. Lower surge heights near Morgan City make this location attractive for infrastructure, however, high rates of sea-level rise induce long-term threats in this area."}, {"section_title": "Benefits of this Research", "text": "The analyses conducted in these chapters sufficiently answered the six research questions posed in the introduction. The global literature review revealed that the U.S. Gulf Coast is one of the most vulnerable regions of the world to storm surge inundations, while providing an estimate of the number of low-and high-magnitude storm surges that occur per decade in this and other tropically active basins. The two chapters on the physical processes that generate storm surges revealed that storm surge heights correlate better with pre-landfall tropical cyclone conditions, including maximum sustained winds and cyclonic size, than they correlate with those storm conditions at landfall. The two chapters on vulnerability of the Gulf Coast suggest that while storm surge presents a great threat to this region, the risk of storm surge is highly localized. Storm surge return levels are highest in coastal Mississippi and the inner portion of Galveston Bay, while the greatest risk of inundation for energy infrastructure occurs in Southeast Texas. These results will hopefully contribute to the improvement of storm surge models. A thorough literature review revealed that only  had conducted research on the importance of pre-landfall winds for generating storm surge, and their paper had not yet been cited as of 2013, which indicates that models are not likely using this important discovery, which was developed in greater detail in this dissertation. No papers have yet been published on the importance of pre-landfall size for generating storm surge. The data-driven storm surge return levels and vulnerability assessment for Gulf Coast energy infrastructure will provide crucial information on the risk of storm surge at specific locations in the region. As the results provided by this study are noticeably higher than previous statistical and modeling efforts, this research will hopefully help communities prepare for storm surges that are higher than previously thought."}, {"section_title": "Limitations", "text": "This research also encountered several limitations, the most severe of which is the fact that the results of these analyses are restricted by the availability and quality of the data. Although SURGEDAT provides the most comprehensive storm surge dataset available, several gaps still exist in this dataset. Internationally, most storm surge data were missing for large regions, including the Caribbean Sea and Central America, most of East Asia, the West Coast of Mexico, as well as portions of Oceania and the Southwest Indian Ocean. Along the U.S. Gulf Coast, where surge data are best developed, SURGEDAT is still missing approximately 9% of possible storm surges since 1900 (see Chapter 6), and for some massive surge events, like the 1900 Galveston Hurricane, few data are available. Also, SURGEDAT only provides data since 1880, which is a short time period in Earth's history. This means that we may not realize the potential magnitude of storm surges in areas that have not observed a high-magnitude storm surge since 1880, like the West Coast of Florida. In other words, just because a massive surge hasn't been observed in a given location in the past 135 years, doesn't mean that location is immune to large surges. Another limitation of this research has been the inability to successfully employ extreme value modeling to observed surge data. I attempted to utilize the Point Process representation of extreme value behavior, which is a peaks-over-threshold approach that uses observed data to predict return levels beyond the length of the dataset. Unfortunately, this methodology did not work well in this study, as it underestimated storm surge return levels. Inadequate data quantity may explain the poor performance of this method, as an average of only 19 observations remained for each location after applying the truncation level, and some components of this method, like the Maximum Likelihood approach, do not perform well with small sample sizes . A limitation of the energy infrastructure analysis was that it did not account for local levees and flood control devices, with the exception of levees along the Mississippi River and infrastructure along New Orleans' Industrial Canal. This limitation reduces the usefulness of this study, as infrastructure risk to storm surge may be overestimated in areas with privately-owned or locally-maintained levees. However, it is important to remember that levees sometimes fail, and they may require maintenance and repairs, adding cost to facilities in flood-prone areas."}, {"section_title": "Suggestions for Future Research", "text": "This analysis confirmed that storm surge data are useful for empirical analysis on the relationship between surge heights and tropical cyclone characteristics. Future research could investigate the relationship between surge heights and additional variables, such as tropical cyclone forward speed and the angle of approach to the coastline, as well as coastal shape and bathymetry. Also, an investigation of the relationship between storm surge heights and Integrated Kinetic Energy (IKE) of tropical cyclones may prove insightful, because IKE considers wind speeds over a gridded domain, essentially combining storm intensity and size into a useful index for understanding a hurricane's destructive potential . Data mining, an emerging field within computer science, may be useful for conducting multivariate analysis on this topic, in an effort to uncover the complex processes by which tropical cyclones generate storm surges. The analysis of energy infrastructure vulnerability provided unique insights into the risk of storm surge damage on billions of dollars of assets. This study proved that such analysis is feasible given localized storm surge return levels and an infrastructure database that contains the latitude, longitude and elevation of facilities. As the datadriven storm surge climatology for the region has now been established, Future research should also investigate statistical methods that may better predict storm surge return levels using limited empirical datasets. Although the logarithmic plotting method provided a good fit to observed data, this method was not designed to"}]