[{"section_title": "", "text": "2 involvement in early childhood, substantially less is known about how parents support the development of their children's reading skills, motivation, and habits beyond the earliest primary grades. Yet, third grade marks a particularly important period to explore the role of families, including parents, in children's reading development. Using data from the Early Childhood Longitudinal Study-Kindergarten, Reardon, Valentino, and Shores (2012) found that most children could decode and recognize simple words by the end of third grade. Knowledge-based skills such as background knowledge and vocabulary play a more substantial role in explaining variation in reading achievement in middle childhood and adolescence (Lesaux, 2012; Snow, 2002; Vellutino, Tunmer, Jaccard, & Chen, 2007) . As children begin to master the procedural skills implicated in reading, schools often encourage self-sustained silent reading both at home and at school (Dudley-Marling, 2009 ; U.S. Department of Education, 2009). Although research suggests that parents continue to support their children's academic development beyond the earliest elementary grades (Hill & Tyson, 2009; Hoover-Dempsey, Ice, & Whitaker, 2009) , there is limited research regarding the specific ways in which parents scaffold their children's reading skills, motivation, and habits as the demands on students' knowledge-based skills increase. Given schools' emphasis on independent reading in third grade and students' need to continue developing knowledgebased skills to become proficient readers, it is important to understand the role of families during this period.\nBy listening to the perspectives of 84 parents, we aim to acknowledge what families do to support their third graders' reading skills, motivation, and habits. We attend to both strategies that overlap with practices frequently used in early childhood and those that may be distinct to middle childhood. We also explore parents' reports of the ways in which children influence these efforts."}, {"section_title": "Background and Context", "text": ""}, {"section_title": "Sociocultural Perspectives of Family Reading Support", "text": "The current study recognizes reading as a social practice and explores the ways in which parents from predominantly low-socioeconomic status (SES) communities describe supporting their children's reading skills, motivation, and habits. In an overview of sociocultural literacy perspectives, Perry (2012) described \"literacy as a social practice\" as one dominant framework. Related research has focused on the role that reading and writing print plays in people's daily lives. Moreover, it examines the ways in which families influence children's reading and writing development (Compton-Lilly, Rogers, & Lewis, 2012; Rodriguez-Brown, 2003) .\nSociocultural perspectives recognize that reading practices of nondominant families (Gutiérrez, Morales, & Martinez, 2009 ) may differ from those commonly observed in dominant families. Several researchers have cautioned that privileging parent-child joint book reading, a common social literacy practice in White, middle-class families, to the exclusion of other literacy practices that exist in nondominant homes results in deficit-oriented conclusions about families (Auerbach, 1989; Compton-Lilly, 2007; Gutiérrez et al., 2009; Heath, 1983; Jarret et al., 2015; Purcell-Gates, 1996 , 2013 . For instance, in their longitudinal study of children from ages 5 to 9 and their Latino parents, Reese, Balzano, Gallimore, and Goldenberg (1995) found that a greater percentage of parents reported providing homework assistance than engaging in joint book reading. Positioning the practices of mainstream families as the norm neglects the ways in which activities such as storytelling, elaborative reminiscing, incorporation of reading and writing into daily routines, and discussion of environmental print play a role in the lives of nondominant families (Auerbach, 1989; Compton-Lilly et al., 2016; Leyva, Sparks, & Reese, 2012; Perry, 2010; Purcell-Gates, 1996 , 2013 .\nAt the same time, it is critical to recognize that nondominant families often adopt reading practices that are commonly observed in dominant families once their children begin school. In their longitudinal study of 14 Spanishspeaking students and their families from kindergarten through Grade 3, Reese and Gallimore (2000) described family practices as \"flexible and dynamic\" (p. 105). They found that parents adopted practices such as parent-child joint book reading when their children entered school. Similarly, McWayne, Melzi, Limlingan, and Schick (2016) found that parents of Head Start children engaged in a wide range of practices frequently documented in White, middleclass families, including joint book reading and acquiring educational toys.\nStudies of literacy as a social practice have also highlighted that joint book reading often extends beyond the parent-child dyad to include other family members (Auerbach, 1989; Compton-Lilly et al., 2016; Jarrett et al., 2015; Perry, 2010) . Jarrett and colleagues (2015) found that multiple adult family members, including grandparents, provided reading-enhancing opportunities to children. Siblings, too, play a critical role in providing reading support, from explicit teaching of skills to joint book reading (ComptonLilly et al., 2016; Williams & Gregory, 2001) . Such studies highlight that the role of parents cannot be fully understood without accounting for the ways in which other family members complement and supplement their efforts.\nResearchers who have examined reading as a social practice have also highlighted the reciprocal nature of parentchild interactions (Auerbach, 1989; Perry, 2010; Schick, Melzi, & Obregón, 2017) . As Long and Volk (2010) explained, \"Children and members of their support networks are sensitive to learners' needs; they act as teachers as well as learners, moving in and out of the roles of expert and novice\" (p. 187). In their ethnographic study of the summer experiences of fifth graders from racially and ethnically diverse middle-class and working-class families, Chin and Phillips (2004) found that \"child capital\"-children's own 3 values and temperaments-both complicated parents' efforts to cultivate enriching summer experiences and compensated for limited resources. Similarly, Compton-Lilly (2007) described the ways in which one parent assisted her child with reading but only when the child was in the mood to do so.\nCollectively, prior studies highlight several noteworthy findings pertaining to the reading practices in nondominant families. First, they suggest that limiting exploration to practices commonly found in White, middle-class homes contributes to deficit-oriented conclusions about families. Still, it cannot be assumed that book reading and other common school-based practices are nonexistent in the homes of nondominant families, because parents often adapt their practices in response to the reading activities that are valued in school. Thus, research must embrace a broad conceptualization of parents' support of children's reading development and consider cultural-preferences in activities."}, {"section_title": "Developmental Shifts in Family Reading Supports", "text": "Although the research on parents' support of school-age children's reading development is limited relative to studies focusing on early childhood, the literature nonetheless highlights that parents from low-income communities often assume responsibility for fostering the reading skills, motivation, and habits of their school-age children. Like parents of young children (Hammer, Nimmo, Cohen, Draheim, & Johnson, 2005; Jarrett et al., 2015; Reese & Gallimore, 2000; , families continue to engage in joint book reading and discussions about books as children progress through the elementary grades (DudleyMarling, 2009; Hughes, Schumm, & Vaughn, 1999; Saenz & Felix, 2007) . In a study of Hispanic parents of children in Grades 3 through 5 with and without learning disabilities, Hughes and colleagues (1999) found that parents reported reading with children on a weekly basis. Parents have also reported asking their children questions about books that they read (Saenz & Felix, 2007) .\nHowever, longitudinal studies have pointed to changes in parents' reading support over time. For instance, Reese and Gallimore (2000) found that whereas 25% of Latino parents reported reading to their children at the beginning of kindergarten, approximately 90% reported doing so at the end of first grade. In a longitudinal study of 10 children and families from first to fourth and fifth grade, Compton-Lilly (2007) noted that urban families adapt and change their practices as \"families learn how schools operate\" (p. 5). Parents engaged in a wide range of reading practices when their children were in first grade, including monitoring homework, assisting with book selection, highlighting environmental print (e.g., signs), spelling words for children, and talking with children about books. By fourth and fifth grade, parents helped to identify tutors that could help their children, encouraged children to ask for help when they could not read a word, imposed consequences when children exerted low effort in school, and monitored children's reading progress.\nAs children develop the procedural skills implicated in reading (e.g., sight word reading, decoding), the roles that parents and children assume when interacting around books may also shift. For instance, some studies of families with young children highlight the lead role (e.g., sole narration) that many parents assume during joint book reading (Caspe, 2009; . However, parents also spend more time listening to their children read (Compton-Lilly et al., 2016; Schulz, 2010) . In a qualitative study of homeschool connections, one father from Vietnam described listening to his child read an entire book in English, although he did not understand the text (Schulz, 2010) . Moreover, parent-child conversations about books in middle childhood extend not only to books that parents and children read together, but also to books that children read independently (Capotosto & Kim, 2016; Saenz & Felix, 2007) . Such studies suggest that the roles that parents and children assume for reading may shift as children become more proficient word readers.\nLike parents of young children, parents of school-age children also support their children's reading skills, motivation, and habits in ways that extend beyond joint book reading. For instance, parents of school-age children from low-SES communities assist with and monitor completion of reading homework, provide explicit instruction in reading words, and use flashcards and other means to enhance children's vocabulary (Dudley-Marling, 2009; Mapp, 2002; Monzó, 2010; Perry, 2010) . Parents frequently communicate the importance of school through their own stories of struggle, their explicit discussion of expectations for achievement, and their deliberate cultivation of dispositions associated with persistence and achievement (DudleyMarling, 2009; Mapp, 2002; Monzó, 2010) . Qualitative studies have also examined the resourcefulness parents exhibit in acquiring books, from purchasing books at secondhand stores to building home libraries with the help of relatives and employers (Compton-Lilly et al., 2016; Dudley-Marling, 2009; Monzó, 2010; Weiss et al., 2003) ."}, {"section_title": "Study Contributions", "text": "The National Literacy Panel reported that \"schools underestimate and underutilize parents' interest, motivation, and potential contributions\" in helping children succeed academically (August & Shanahan, 2006, p. 7) . The present study builds upon research that explores these contributions by examining the ways that parents support their children's reading skills, motivation, and habits through both everyday, authentic reading routines and common school-based practices. Although literacy is far broader than skills implicated while reading books (Perry, 2012) , the present study's emphasis on parents' support of reading print, and books specifically, builds upon a research base that suggests that parents 4 from low-SES communities place a high value on developing reading skills promoted in school (Compton-Lilly et al., 2016; Hammer et al., 2005; Jarrett et al., 2015; McWayne et al., 2016) .\nAlthough extant qualitative studies have expanded the discussion from what nondominant families lack to what they do, these studies generally involve a limited number of participants. In a review of the quantitative and qualitative home literacy environment literature, van Steensel (2006) noted that the generalizability of the qualitative studies is limited by small sample sizes, often of 20 or fewer families. Although small samples allow researchers to explore a phenomenon in depth, larger samples have the potential to capture greater diversity in participant experiences. Moreover, although there is a growing body of qualitative research regarding parents' support of school-aged children's reading, this literature is limited compared to the early childhood literature.\nBy focusing on the parents of students at the end of third grade, we aim to explore these interactions during a period of reading development in which there is a greater demand on developing knowledge-based skills than procedural skills. Furthermore, our sample size of 84 parents allows us to understand the experiences and perspectives of more families than have typically been explored in related research. The primary question guiding our research is: In their own words, how do parents describe their role in supporting their third graders' reading development?"}, {"section_title": "Method", "text": ""}, {"section_title": "Study Context", "text": "Families participating in the present study were involved in a larger experimental study of a summer reading program that included 868 third-grade students from 14 schools in three North Carolina school districts (Guryan et al., 2015) . In this larger study, students within schools were randomly assigned to either participate in the summer reading program or a control group. Students who were assigned to participate in the summer reading program attended six comprehension lessons at the end of the school year and received eight free books that were matched to their reading level and interests, along with comprehension activities, over the summer. Their families were also invited to attend an afterschool event where they learned more about the program. Eighty-four (n = 84) families whose children were selected to participate in the summer reading program were also randomly selected to participate in the present study. Importantly, however, home visits were conducted in the spring of third grade, before students attended lessons or received books, and before families attended the after-school event."}, {"section_title": "Participating Students and Families", "text": "The third-grade students of the 84 parents participating in the present study attended 10 urban and suburban elementary schools in one district in North Carolina. The majority of these children received free or reduced-price lunch (88%) and failed the state End-of-Grade Reading Test (67%) at the end of third grade. Approximately 69% of children in the study were African American, 25% were Hispanic, and 6% were White. Most of the participating adults in the present study were mothers (87%), although fathers (5%), grandmothers (5%), and other relatives (3%) also participated. Given that the vast majority of participants in the current study were parents, we have focused the present study on parental involvement, although we acknowledge and incorporate findings from other primary caretakers as well. Although we did not ask families about the languages spoken in the home, 22% of parents opted to complete their portion of the home visit in Spanish. Table 1 presents background information about the parents and guardians whose verbatim quotes are included in the present study. Interview process. Each family was visited one time by a team of two home visitors, some of whom were bilingual Spanish-English speakers. Families were initially contacted by a Spanish-speaking home visitor if they had completed the Spanish version of the consent form. During this initial recruitment phone call, home visitors asked adults which language they preferred to use during the home visit; 22% of adults elected to complete their portion of the home visit in Spanish. During the home visit, which lasted approximately one hour for all families, one home visitor met with the child to complete an independent reading activity, while the second home visitor interviewed the parent or guardian. We used interview data with parents and guardians as the data source for the present study.\nInterview protocol. We used a qualitative interview design to address our research question. Open-ended interviews are particularly useful when investigating under-explored topics (Johnson & Onwiegbuzie, 2004) , such as the role parents play in supporting their children's reading development in middle childhood. Our interview protocol consisted of six open-ended questions asked of all families:\n1. Tell me about a typical day for your child from morning to bedtime as well as you can remember. 2. What are some things that you do to help your child become a good reader? 3. What, if anything, do you do when your child has a hard time with a book? 4. What are some questions that you ask your child when you talk about books that s/he has read? 5. What, if anything, do you do to motivate your child to read? 6. Where does your child get most of his or her books from?\nThe first question aimed to shed light on the degree to which parents mentioned reading-related activities without explicit prompting to do so. It provided an opportunity for parents to describe a wide range of reading activities, including but not limited to school-based and book-based practices. This broad question was followed by more specific questions regarding the scaffolding that parents offered their children and acquiring books. Finally, home visitors asked the majority of families, \"Are there other people in your home that help your child with reading? What do they do to help?\" All interviews were recorded and transcribed."}, {"section_title": "Data Analyses", "text": "Our analysis of the interview data proceeded through the following four steps. In the first step, we read the interview transcripts using a set of etic codes, or codes that represent predetermined concepts with which a researcher goes into the study (Maxwell, 2005) . Specifically, we read through each of the transcripts and excerpted sections where parents described the role played by parents and/or other family members in the child's reading. We coded excerpts in which parents described joint book reading (i.e., parent and child jointly attend to text), providing structure for reading (i.e., parent creates space or time for reading), and asking questions and talking about texts (i.e., parent engages with child in conversation about a book). We further coded all excerpts coded role played for the family member involved. Specifically, we created three subcodes to indicate whether the activity was completed by parent, sibling, or other person involved in the child's life. See Table 2 for a complete list of etic codes and relevant examples.\nIn the second step, we engaged in open coding of all excerpts that had been coded role played in the first step. The purpose of this second reading of the excerpts was to capture how participants described supporting the development of their children's reading skills, motivation, and habits in their own words, rather than as predetermined by researchers (Maxwell, 2005) . Such open, or emic, coding acknowledges the possibility that there is information in the data that is not captured in the current codebook or extant literature (Strauss & Corbin, 2008) . The five emic codes that emerged from the parent interviews using these techniques were explicitly communicating the value of reading (i.e., parent communicates the importance of reading and education), active listening (i.e., parent indicates the role of listening within the context of joint book reading), promoting reader autonomy (i.e., parent encourages reading independence), incorporating reading practices into daily routines (i.e., parent describes incorporating reading into devotional routines or other everyday activities), and acquiring books (i.e., parent selects or helps child to select texts). See Table 3 for a complete list of emic codes and relevant examples.\nIn the third step, we exported all codes to Stata 12 and reformatted them so that each child's family received either a 1 or a 0, indicating the presence or absence of a code. We used these quasi-statistics as a means of checking the internal generalizability of our claims (Becker, 1970; Maxwell, 2010) . We report the percentage of parents who mentioned a code as a means of making the prevalence of a topic transparent. It is important to note that a 0 does not indicate that a particular practice does not exist in the home, nor does it suggest that parents who did not mention it engage in an alternative practice. Rather, a 0 indicates that the parent or guardian did not mention it in the context of an open-ended interview. In other words, the percentage of parents who mentioned a practice may not be synonymous with the percentage of parents who engaged in a particular practice. It is probable that the percentage of families who engaged in an activity is greater than those who mentioned it in the context of an open-ended interview.\nIn the final step, we examined all excerpts together, laying the etic and emic codes alongside one another and looking for themes related to our research question, as situated within the context of the broader literature. According to Rubin and Rubin (2012) , themes are \"summary statements, causal explanations, or conclusions\" (p. 194). Thus, as a means of discovering themes, we attended to repetition Family member involved Parent Parent is described as being involved or having a role in child's reading \"I let him read, and then I let him tell me about the story. Then a word he don't know, I tell him 'pronounce it out.'\" Sibling Sibling is described as being involved or having a role in child's reading \"She receives a lot of help from her brothers.\"\nOther family member Family member other than parent or sibling is described as being involved or having a role in child's reading \"My uncle will have [child] look something up in the dictionary in a heartbeat.\" within and across texts, identified similarities and differences across units of data, and examined linguistic connectors, such as because (Ryan & Bernard, 2003) . This last strategy, in particular, led us to insights and conclusions related to why parents employed certain strategies with their children (e.g., \"I tell him to read because it is good for him, so that he can triumph, unlike me\"). Moreover, by attending to these linguistic connectors, we unpacked the ways in which children helped to shape parents' involvement (e.g., \"I must order him to read because he does not like reading very much\"). Ultimately, three themes emerged from this iterative process, which are discussed in detail in the Findings section. Throughout these four steps, we took a number of precautions in order to increase the validity and reliability of our coding process. Our research team met on a weekly basis over an 8-month period to develop, refine, and apply the qualitative interview coding protocol and ensure that the team developed a shared understanding of codes and analyzed data in a consistent manner. After developing the coding tree to analyze the parent interview data, we took steps to establish reliability during training. Specifically, raters double-coded the same two transcripts in Dedoose, a mixed-methods Web application, and refined coding decisions and descriptions until we reached an interrater reliability score of .70. Once raters had achieved an acceptable kappa score, they double-coded 20% of the transcripts and individually coded the remaining interviews. Kappa for all double-coded transcripts achieved a minimum of .70. Finally, the research team engaged in ongoing reflective discussions by frequently crafting and sharing analytic memos on emerging themes."}, {"section_title": "Results", "text": "Our qualitative analysis of the data pointed to three key themes. First, parents demonstrated the high value they placed on their children's reading skills, motivation, and habits through a wide range of strategies to support their children's reading development. These strategies positioned both parents and children as active participants in the reading process. Parents often employed strategies that scaffolded children's development of independent reading skills. At the same time, we also found that parents' efforts were often influenced by children's own motivation, achievement, behaviors, and receptiveness to help, a thematic finding which highlights the bidirectional nature of parents' support of children's reading development. Finally, by privileging the voices of parents, our study highlights the resourcefulness and diversity of efforts that parents put into scaffolding their children's reading development. Collectively, parents describe deliberate efforts to cultivate a home environment that recognizes reading as a developmental process that does not end with learning to decode in the early primary grades."}, {"section_title": "Theme 1: Parents' Concerted Efforts and Shared Participation in Children's Reading Skills, Motivation, and Habits", "text": "Parents employed a wide range of strategies that positioned both parents themselves and children as active participants in the process of developing reading skills, motivation, and habits. In this section, we describe six parental activities frequently reported by parents: These parental efforts showcase parents' commitment to addressing many dimensions of reading, including word reading, comprehension, motivation, strategy use, reading habits, and value for reading. Several efforts signal the importance many parents placed on helping their children become more independent readers."}, {"section_title": "Explicit communication of the value of reading.", "text": "Although parents were not directly asked whether they discussed the importance of reading in the home, nearly one third of parents mentioned explicitly communicating the importance of reading and general academic achievement to their children. Parents explained the relationship between reading and both short-and long-term success, such as passing high-stakes standardized assessments and reaching career goals. Nancy, a mother, explained that going to fourth grade requires having to \"read more, you're going to have to get your reading level up. So therefore . . . I said in order for you to pass that, you know you got to read, you got to read.\" In other cases, parents described the link between reading and more distal outcomes, including career goals.\nTo emphasize the importance of education in general and reading specifically, several parents communicated their own hardships and the ways in which reading specifically and academics more generally offer a pathway to a less strenuous life. For instance, one mother, Bianca, explained, I tell him to read because it is good for him, so that he can triumph, unlike me. . . . I prefer him to be someone in life. I talk a lot about this to them, when I am driving I talk to them about things in life, how we were when we were his age, what we used to do and what they don't. That is the way I encourage them, I tell them, \"Do you guys want to be like me and your dad? Do you want to endure what we suffer?\" And they answer me, \"No Mommy, we don't want that.\" And then I say, \"Then study.\" 8 This explicit discussion of the value of reading positions both parents and children in active roles. Although parents often used directives to motivate and foster value in reading, they also communicated the responsibilities of childrenstudying, reading, completing homework-required to reap the benefits that parents described.\nActive listening. When asked to discuss the ways in which parents were involved in their children's reading development, 50% of the parents in the study mentioned joint book reading. In most of these cases, children took the lead in reading to parents, while parents listened. Although several parents described their efforts as \"just listening,\" their efforts were quite active. For some parents, listening to children read provided insight into children's reading strengths and weaknesses and timely support when needed. As one mother, Natasha, explained, \"I sit and I just listen to her read. Even if the word's not right she's saying, I'll tell her to stop and take her time and pronounce it again, letting her correct herself.\"\nFor some parents, listening provided an opportunity to address difficulties through explicit teaching or strategy reinforcement. For instance, Adrienne, a mother, encouraged her daughter to use context clues to read unfamiliar words:\nI ask her to try to pronounce the words, try to sound it out like she's been taught. Then try to see what that word might be from other words she has read already, what would that word be to make sense in the sentence. And if she can't get it, then I'll just go ahead and tell her.\nFor other parents, however, listening represented an opportunity for parents to demonstrate and communicate their interest in their children's reading. Patricia, a mother, stressed the importance of \"doing it [listening] all the time and having support, being there with them, letting them read to you.\" This description of listening was especially prevalent among parents who primarily interacted with their children in Spanish. Of the parents who completed the home visit in Spanish, the vast majority (87%) said that they listened to their children read, even when they did not understand the contents of the text. As Teresa, a mother, noted, \"I do not understand English, but she reads and explains [to] me. She likes when I tell her, 'Very good, you are a very smart girl.'\" Listening represented a means of actively supporting their children to the greatest of their abilities when English was the primary language of school-based print.\nAsking questions about texts. Although active listening provided an opportunity for parents to assess children's wordreading skills, questioning provided parents with insight into children's comprehension of a text. One mother, Alicia, said that she knows her daughter understands a book if she can tell me the things that I ask. When I go back and ask her questions, y'know, \"What are the characters like? What's going on in the story?\" and just different things about the books that she's reading. If she can tell me what's going on, then I know that she understands what she's reading and comprehends it.\nIn such cases, asking questions to which parents knew the answers allowed parents to assess their children's reading comprehension and to inform subsequent support.\nIn other cases, however, parents employed questioning even if they had not understood or even read the book themselves. As Bianca, a Spanish-speaking mother said, I tell him to explain what the book was about. I do not know if he lies to me because the book is in English and he speaks to me in Spanish. And then he explains what the book is about. And then I tell him, \"You see, you can learn,\" and then he says, \"Yes, Mommy,\" and then he explains more about the book.\nEnglish-speaking parents also used questioning to assess understanding about books that children read independently from parents. Deborah noted, She has to read every day between 20 and 45 minutes for her class. So even though I don't have to know what the book is or the teacher assigns the book, I'll ask her about it so she can't just write it down and say, you know, \"I read it.\" I'll ask her what the book was about or just tell me one thing. Or I'll open it and choose a sentence somewhere in the book and ask her to tell me what the book was about so I can read over it quickly and see if she actually read.\nCreating a home environment conducive to sustained reading. In addition to activities that jointly involved the parent, child, and text, parents also described creating physical conditions within the home environment that promoted reading. Approximately 69% of parents reported providing a structure-specifically, a time-for reading. Several parents required children to read a set number of days per week for a specified time period. Kyra, a mother, explained, \"I'm definitely pretty strict about the 5 days a week as far as reading, whether she's in school or on summer break or winter break.\" To allow children to focus on reading, parents also played a role in minimizing distractions in the home, often by setting limits on television time or taking away video games. One mother, Grace, explained, I take the disk card out of the DVR, making the environment readable. We need quiet time. We do. \"I don't want to hear a radio. I don't want to hear you popping gum. I don't want to hear you arguing.\" Just creating environment. All the games are dead and the computer's broken-it's not too much they can get into but to read.\nBy creating a schedule for reading and minimizing distractions, parents both communicated their expectations for reading and created a physical environment that promoted regular reading habits.\nPromoting reader autonomy. In addition to playing an active role in making sure that their children read regularly, 38% of parents mentioned that they encouraged reader 9 autonomy by advising children to solve reading problems independently. Most commonly, parents (26%) encouraged children to reread the text or read it more slowly in order to improve comprehension. These parents tended to believe that children could comprehend the text if they took the time to use the reading skills and strategies that they already possessed and that their children did not need additional parental support. If her daughter struggled with the meaning of a book, Tiffany, a mother, would \"tell her to flip back a couple of pages and slow down instead of rushing through everything trying to read it. I tell her, 'You just need to read it word for word.'\"\nTo encourage their children to learn the meanings of unfamiliar words independently, 10% of parents reported directing their children to the dictionary. In describing a typical parent-child interaction, one mother, Alicia, said, We always have a dictionary somewhere around here, and especially when you're in the process of reading, [child says,] \"I don't know this word.\" Parents actively supported children's independent problemsolving skills in these instances. They provided advice and reminded children about strategies they could use to resolve reading difficulties. Instead of providing answers when children encountered difficulties, parents prompted students to employ strategies, skills, and habits of independent readers.\nIncorporating reading practices into daily routines. Although parents frequently described joint reading as a means of fostering academic achievement, its role in the home extended beyond school-mandated work. Approximately 10% of parents mentioned the role of joint reading as fundamental to daily routines, such as reading mail and recipes. One mother, Mary, explained her role in drawing her child's attention to environmental print: Parents also incorporated reading into family devotional and spiritual nurturing routines. For instance, Silvia explained, \"We were reading Proverbs from the Bible every night, one by one by one, like that, the four of us, I have three children.\" By incorporating reading into daily routines and spiritual nurturing, parents highlighted the value and utility of reading, fostered skill development, and encouraged reader motivation and reading habits.\nOverall, our thematic analysis indicated that parents continued to support children's reading development in middle childhood. Parents described both providing structure and scaffolding reader autonomy. Parents supported children's reading development by communicating the importance of reading, actively listening to children, monitoring and assessing program, creating a space and time for reading, providing direct support as needed, and integrating reading into regular routines. They, too, held children accountable for reading aloud, answering questions, retelling texts, and using strategies to become more independent readers."}, {"section_title": "Theme 2: The Influence of Children's Reading Motivation, Abilities, Behaviors, and Receptiveness to Help on Parents'", "text": "Reading Support\nParents often explained their efforts to support their children's reading achievement, motivation, and habits as reciprocal in nature. Their perception of children's own reading motivation, abilities, behaviors, and receptiveness to support influenced the extent to which parents motivated and scaffolded their children's reading. In other words, the nature of parental reading support was sensitive to individual differences in a child's skill and will to read: Parents described needing to motivate and scaffold more when children demonstrated lower motivation to read and more reading difficulties; parents who perceived their children as highly motivated and proficient readers often described needing to motivate and help their children less frequently."}, {"section_title": "The influence on children's motivation on parent behaviors.", "text": "Approximately 29% of parents explained how children's reading-related interest and behaviors influenced the extent to which parents felt they needed to encourage children to read. Some parents who perceived their children as highly motivated to read explained that they did not need to encourage independent reading. Karen, a mother, said, \"Well, really I don't have to motivate him. He just love to read, so it's never like you have to make time for him.\" Similarly, Natasha explained that her daughter's intrinsic reading motivation made offering incentives to read unnecessary: \"I don't push her to read. It's just something that she does on her own, but I do support her when she reads because I always try to tell her, 'Reading will take you a long way.'\"\nIn contrast, parents often responded to their perception of children's low intrinsic motivation to read by exerting external influence to increase time spent reading. These efforts involved a range of activities, including making reading a requirement at home and using extrinsic rewards. As Bianca explained, \"I must order him to read because he does not like reading very much.\" Ana, a mother, found positive benefits 10 of requiring reading before play: \"He actually wants to read every day because we tell him that . . . if he does not read, he can't go to play outside.\" In addition to responding to her daughter's enjoyment in reading aloud as a family, Jennifer recognized incentives as a means of promoting reading. She said, Honestly, it can be a struggle. I hate to admit it out loud . . . but sometimes there's kind of twisting. We try to do things like her father and stepmother, stepfather and I have devised a plan for the summer that if she completes a book on her own…then we'll go to one of the museums or something like that. Give her some kind of substantial reward without it being an object.\nSimilarly, Jacqueline explained the impact of rewards on her son's time spent reading: \"Sometimes I have to bribe him, or you can get this or get that. It works. Reading is not one of his strongest subjects so I have to promise him a little something just to boost him on over.\" Thus, parents perceived their own involvement as both influencing children's reading activities and being influenced by children's reading motivation.\nThe influence on children's reading skills and behaviors on parent behaviors. Parents' perceptions of children's reading skills and approaches to reading also influenced the types of supports they provided. Like parents' efforts to motivate children to read, parents tended to describe dedicating more time and effort when they perceived their children as needing help and less time and effort when they viewed their children as more proficient readers. Amy explained that there was no need to ask her daughter questions: \"I don't think we need to ask questions because anything she reads she's ready to tell us about in some story form. Anytime that I walk her to the bus stop, she's always telling me about a book.\" Similarly, although Adrienne reported helping her daughter use context clues when necessary, she generally did not believe that she needed to provide extensive guidance because her daughter was a \"very good reader . . . I don't have to do much to guide her in reading.\" The amount of support provided was contingent upon perceived need.\nParents who perceived their children as having difficulties in one or more aspects of reading often responded with strategies to help their children become more independent readers. For instance, upon noticing her daughter's difficulties with recalling information from texts, Deborah explained, \"She reads but sometimes she doesn't retain. I'm trying to work with her on being able to answer questions about it-to actually read with understanding what's going on so that later on she can answer a question without having to refer back to the [book] .\" Similarly, Mary said, I have to keep him focused. . . . He doesn't pay attention to what he read. So I have gotten to start to point at the word he's reading, and when he points at the word he's reading he say it wrong and I make him go back and actually look at the word.\nIn such instances, parents' interest in helping children become more independent readers coupled with their observations of difficulties informed the support they provided at home.\nThe influence of children's receptiveness to parent support on involvement. Student responsiveness to parental support also influenced how and to what extent parents scaffolded their children's reading skills. For instance, Karen explained that her involvement was influenced by her son's interest in her help:\nI don't have to help him read because he don't want me to help him read it. He's kind of like a little man on his own, like, \"I got this, Ma. I don't need your help.\" So it's like, \"Okay, just tell me what you read.\"\nIn this case, Karen was responsive to her child's desire for autonomy as long as he demonstrated that he could meet reading challenges independently. In contrast, Charlotte described reading to her son, even when she believed that he would gain more from reading himself, because he preferred this approach to reading on his own: \"We'll go word for word, finger pointing at the word, and I'll read to him. He likes that better than him doing it on his own, but . . . that's nothing compared to him reading himself.\" In both cases, the extent to which parents promoted reader independence was influenced by children's responsiveness to help and interest in reading on one's own.\nAlthough not specifically asked about children's emotions, approximately 10% of parents mentioned strategies they used when their children became frustrated while reading. In most of these cases, parents employed a range of strategies to minimize students' frustration, including taking a break. As Anissa explained, \"We'll try to talk about it until she gets frustrated, and then she don't want to do it no more.\" Monique echoed the need for breaks to minimize discouragement:\nHe gets frustrated very . . . He gets discouraged. So when I see that, I don't want him to get so discouraged that he don't want to go back to it. So I will tell him, \"Okay, let's take a break.\" . . . That's one thing I do that helps him a lot.\nParents also responded to children's frustration with encouragement. \"I think she gets frustrated…just letting her know that it is okay,\" Grace explained.\nIn searching for discrepant cases, we also identified three cases, all involving children with diagnosed disabilities, in which parents described continuing to \"push\" their children despite frustration. Krystal's daughter, diagnosed with shortterm memory difficulties, reported making \"her stay there\" instead of taking a break in moments of frustration because \"I don't want her to be labeled . . . like I tell her, 'I'm not going to limit you. You can do it.'\" Similarly, Chelsea mentioned that her child, who has attention-deficit hyperactivity disorder, \"struggles in school because he doesn't take school seriously enough to where he doesn't have as much interest in school, enough to pay attention and focus and do things he's required to do.\" Describing the ways that she best helped support her son, she explained, [I] just keep pushing him to read, keep pushing him to do stuff, no matter how frustrated he get or how he express he don't want to. I feel like I should just keep pushing and being consistent with him about reading.\nFor Tanisha, getting her son to read anything school-related was a challenge: \"He hates to read. He's [on an individualized education program] for reading, and he is . . . below grade level in reading. He despises it, hates it, he refuses,\" which explained why she felt she needed to \"take things that he likes to do away in order for him to read.\" In each case, parents described \"pushing\" their children because they perceived the alternative as limiting the child.\nCollectively, these examples put parental supports-the focus of our first theme-in context. Parents adjusted their levels of support according to children's own motivation, achievement, behaviors, and receptiveness to support. Their explanations regarding the conditions under which they provided more or less support highlight their responsiveness to perceived need and the bidirectional influences between parents and children."}, {"section_title": "Theme 3: Parents' Resourceful Efforts to Foster Reading Skills", "text": "Although parents were not specifically asked how they overcame barriers of limited financial resources and time, they nonetheless mentioned resourceful ways in which they promoted their children's reading despite these challenges. We highlight two involvement strategies to illustrate this point: parents' efforts to acquire children's books and parents' inclusion of siblings and adult family members to support children's reading. Acquiring books. Parents described various strategies for acquiring books, despite limited budgets. Approximately 71% of parents said that they purchased books for their children, although they purchased books from a range of sources. Seventeen percent of parents mentioned that they relied on school resources, particularly the school book fair, for children's discounted reading materials. Karen explained that the only time she purchased books was when the school held a book fair once a year \"because they are cheaper when you get it from the school. So I try to at least send him with three to five dollars so he can buy a book.\" An additional 17% of parents said that they primarily received children's reading books inexpensively through nonprofit organizations or as donations, hand-me-downs, and gifts from relatives. One mother, Gabrielle, said, \"All her books, either my aunt has bought some, but the vast majority of the books I've gotten have been from little churches or whatever doing the giveaway thing.\" Similarly, Kelly actively searched for books through community resources: \"I go to churches or places like that. . . . I have to go to Goodwill to find books.\" For Yana, looking for free or inexpensive books was nearly a daily activity: \"I go on my lunch break if I have time, I go to the thrift store. If I see books, I get books. Sometimes they have them for free so I just get them.\" Mary swapped children's books with her sister: \"My sister has two children also . . . so she passes most her books down to me. So we just recycle books.\" These efforts highlight parents' dedication to cultivating an environment in which children have access to print.\nInvolving other family members. Although the present study pays particular attention to the support parents offer children, it is essential to note that this role must be considered within a larger family context. Several parents described the ways in which other family members, particularly siblings (37%) and grandparents (17%), played a prominent role in nurturing their children's reading development. Like parents, grandparents and other adult family members often assumed an active listening role: \"He reads to my mother or my sister if they come by,\" Gabrielle explained. However, whereas parents and other adult family members often listened, third graders read with siblings. Approximately 14% of parents described the ways in which third graders engaged in joint reading with older and younger siblings. As Natasha described, \"Her sister sits and reads with her. They all just sit and read together or they'll take turns. . . . It's like they'll take turns reading a story. . . . It's like a role-play they do.\"\nParents described cultivating an environment in which both siblings and adult family members provided reading support to their third graders when they were unable to do so. In several families in which the parents' primary language was Spanish, older siblings both provided parents with valuable assessments of the target child's reading skills and answered questions about an English text when both the third grade child and parent were uncertain about the answer. Maria, a mother, explained, \"I ask him what the book was about, and he tells me. And when he tells me, I [ask older sibling] if that is correct what he told me, since . . . I don't understand it. But the boy says that's right, that what he told me was correct.\" Similarly, Isabel's older son read with her third-grade son while she listened: \"My other son is the one who reads with him . . . since all the books are in English, but I'm there listening to what he reads.\" When parents worked late hours, grandparents and other adult family members also assumed responsibilities for providing reading support. For instance, although Karen's work schedule made visiting the library with her children difficult, she reported that \"Grandma takes them to the library . . . after church, they go every week.\""}, {"section_title": "12", "text": "In other cases, parents found that children sometimes responded better to the support of grandparents and siblings than to their own help. While Elena worked closely with her son on his reading, she noticed that her own grandmother could be a calming influence:\nShe's a little calmer than me. I'm a little stricter in certain areas. He [Elena's son] gets frustrated with me. Like, \"Mommy just will not let me. I'm ready to get up.\" I'm like, \"No. Let's read it again.\" So she comes in. She's good at that.\nLikewise, Deborah found that her daughter responded well to her fifth grade brother:\nA lot of times he'll share with her his work and try to challenge her, you know to get to what he's doing . . . and they play games and quiz each other. . . . [Her brothers] are actually harder on her than we are 'cause they're her peers. But I believe that she absorbs better too from them than she does us. A lot of times with kids, whatever comes out of your parent's mouth doesn't make sense. But with them, you know, she listens.\nOverall, parents were resourceful in navigating challenges of limited time and finances. Viewing books as valuable tools for promoting reading achievement and motivation, they found ways to acquire books through family members and inexpensive resources. They involved siblings and adult family members both when parents were not physically present in the home and when they recognized children's positive responsiveness to others. These efforts again illustrate the priorities that families in the present study placed on their children's reading."}, {"section_title": "Discussion", "text": "The present qualitative study investigated the ways in which parents described supporting their third graders' reading skills, motivation, and habits. With a sample several times larger than previous qualitative studies (e.g., Auerbach, 1989; Jarrett et al., 2015; Purcell-Gates, 1996 , 2013 , the study aimed to shed light on the ways in which parents from predominantly low-SES communities described supporting various dimensions of their children's reading development in their own words. A thematic analysis of qualitative interviews revealed three major findings. First, we found that parents deliberately supported their children's reading skills, motivation, and habits beyond the earliest elementary grades. Second, parents often described adjusting their levels of support to their children's reading motivation, achievement, habits, and receptiveness to their support. Third, by privileging the voices of parents, the present study highlights resourceful efforts to scaffold children's reading development, particularly when faced with limited finances and time.\nSeveral findings from the present study build upon a literature base that assumes an assets-based perspective of exploring parental support of children's literacy development in families from low-SES communities (Auerbach, 1989; Compton-Lilly, 2007; Compton-Lilly et al., 2016; Heath, 1983; Jarrett et al., 2015; Purcell-Gates, 1996; van Steensel, 2006) . For instance, parents' explicit discussion of the value of reading-a form of academic socialization-is consistent with findings in the broader parental engagement literature (Hill, 2001) as well as studies that have explored the ways in which Latino parents share advice, consejos, through personal accounts, stories of struggle, and explicit expectations (Lopez & Vazquez, 2006; Monzó, 2010; Valdés, 1996) . Moreover, incorporating reading into daily routines and religious devotion is similar to prior observational studies examining the role of reading in the lives of families from low-SES communities (Auerbach, 1989; Heath, 1983; Jarrett et al., 2015; Purcell-Gates, 1996 , 2013 . The consistency of our findings with this prior research highlights the high value that many parents place on reading development and the ways in which they promote it outside the context of joint book reading.\nThe present study also extends a body of research that recognizes parents as \"agential and creative\" (ComptonLilly et al., 2016, p. 61) . Although not asked directly about listening to children read, the vast majority of Spanishspeaking parents described listening as a key parent-child activity. The present study extends this discussion by highlighting the active nature of listening, specifically the ways in which parents used listening as an opportunity to assess, monitor, encourage fluency and word-reading practice, and communicate to children the value they placed on reading. Spanish-speaking parents' commitment to listening with minimal comprehension of the text is an underexplored form of involvement in the literature. In addition, when parents had limited funds for books, they often turned to alternative sources for reading materials, including book fairs, family, friends, and community resources. Moreover, parents asked their older children for support when they were unfamiliar with a word or unable to assess their third graders' comprehension. When parents worked multiple jobs, they turned to adult family members to provide their children with joint reading opportunities and carry out reading routines. This finding builds upon an extant literature highlighting sibling and grandparent involvement, particularly within African American and Hispanic families (e.g., Auerbach, 1989; Jarrett et al., 2015; Purcell-Gates, 2013; Reese, 2012) .\nThe present study also makes unique contributions that have important implications for educational research and practice. Whereas research with young children has highlighted the lead role that many parents play in joint bookreading activities (Caspe, 2009; , many parents of third graders in the present study deliberately scaffolded their children's path to reader autonomy. They did so through a wide range of activities, such as providing a structure for reading, encouraging children to problem solve on their own, and helping children find books that matched their independent reading levels. Parents provided opportunities and advice for resolving breakdowns in understanding independently. These efforts constitute a distinct form of parental involvement. The act of promoting reader independence was active, deliberate, and responsive to their perceived needs of their children's reading performance and reader motivation. In other words, our findings reveal numerous efforts by parents to scaffold their children's path toward independence as readers, particularly as reading demands increase in Grade 3 and beyond. They contradict deficit notions about nondominant families that \"have persisted in social science inquiry, particularly where literacy is concerned\" (Gutiérrez et al., p. 212) . These findings underscore the potential for schools to build upon existing practices in the home to promote children's reading development, including family engagement policies supported by ESSA.\nParents in the present study also did not focus on any single dimension of reading development, but rather a wide range of factors. Whereas some prior work with parents of school-age children have found that many low-income and working-class families defined successful reading as efficient decoding (e.g., Compton-Lilly, 2007; Compton-Lilly et al., 2016) , many parents in the present study also reported asking questions about books that children had read independently as a means of assessing basic comprehension and implicitly communicating that one reads to understand. Through various strategies-communicating the value of reading, listening to children read, asking questions, cultivating a home environment conducive to reading, promoting reader independence, and incorporating reading into daily routines-parents attended to a wide range of reading skills, as well as reader motivation and habits.\nAlthough these data do not support longitudinal conclusions, a potential shift in parental activities may also mirror and respond to children's increased proficiency with procedural skills such as word reading and continuous development of reading comprehension. The hypothesis that parents may adjust their support over time is consistent with the larger parental involvement literature that suggests that the ways in which parents promote academic achievement changes from infancy through adolescence (Hill & Tyson, 2009; Hoover-Dempsey et al., 2009) . Parents' supports positioned both parents and children in active roles. Our finding that students influenced parents' activities and engagement is consistent with the transactional theory of child development, which posits that children play an active role in shaping the quality of their learning environment as they solicit and influence the input from adults (Lugo & TamisLeMonda, 2008; Sameroff & Fiese, 2000) .\nThe present study was designed to examine how, why, and under what conditions parents described supporting children's reading motivation, achievement, and habits, not the effects of these efforts on various child outcomes. Whereas research on parental autonomy support might suggest benefits of scaffolding reader independence, the impact of extrinsic rewards on motivation may be more complicated and differ depending upon characteristics of the student, reward, and condition (e.g., Grolnick, 2012; Grolnick, Raftery-Helmer, Flamm, Marbell, & Cardemil, 2015) . We do not suggest that all efforts have positive or equal effects on aspects of children's reading development, but rather reject deficit-oriented assumptions of nondominant families as uninvolved."}, {"section_title": "Limitations", "text": "Results from this study must be considered in light of its limitations. First, this study examines parental reading support at a single time point. Examining families over time is essential to capturing the dynamic and evolving nature of parents' support (Compton-Lilly, 2012) . Second, although a strength of the study is the way in which it privileges parent voices, observational data would be helpful for extending our understanding of family practices. Although we did not limit our focus to mothers, our sample was nonetheless comprised largely of mothers. Further study is needed to understand the ways in which fathers might describe their involvement in their third graders' reading development (Kim & Hill, 2015) . Moreover, our findings reflect only the percentages of parents who mentioned a particular topic; given the open-ended nature of our interview protocol, we cannot draw conclusions about what parents did not do, but only what they reported that they did to support their children's reading development. Given the study design, we were unable to meaningfully explore cross-cultural or other differences by demographic characteristics in parental supports. Further research that explicitly asks parents to discuss each described strategy (e.g., closed-ended questionnaires) would be useful in exploring potential cultural preferences and differences in reading supports.\nIn addition to methodological limitations, we recommend future research that broadens the focus beyond reading skills to more meaning-making processes involved in literacy development. Although the present study explores both strategies that involve books (e.g., listening to children read, asking questions about books) and that do not involve books (e.g., advice [or consejos], incorporating reading into everyday practices), there is a greater focus on book-based involvement. Further research is needed to explore the role of families in supporting a broader conceptualization of literacy that involves empowerment and meaning making from non-print sources (Perry, 2012) . In addition, more in-depth interviews would provide an important opportunity to further explore literacy practices that may reflect cultural preferences beyond the use of books.\n14 Finally, the present study also focuses on the family without exploring ways in which schools impact parental involvement. Given prior research that the messages schools send to families regarding how and why to be involved in children's literacy development influence parent actions and beliefs (e.g., Dudley-Marling, 2009; Janes & Kermani, 2001 ), further research is needed to examine the literacy interactions between the home, school, and student in middle childhood."}, {"section_title": "Funding", "text": "The author(s) disclosed receipt of the following financial support for the research, authorship, and/or publication of this article: This study was funded by U.S. Department of Education Office of Innovation and Improvement I3 Grant (Grant No. U396B100195) and The Wallace Foundation (Grant No. 20100222) , awarded to the second author."}]