[{"section_title": "Abstract", "text": "Teachers are an important source of information for traditionally disadvantaged students. However, little is known about how teachers form expectations and whether they are systematically biased. We investigate whether student-teacher demographic mismatch affects high school teachers' expectations for students' educational attainment. Using a student fixed effects strategy that exploits expectations data from two teachers per student, we find that nonblack teachers of black students have significantly lower expectations than do black teachers. These effects are larger for black male students and math teachers. Our findings add to a growing literature on the role of limited information in perpetuating educational attainment gaps. JEL Classification Codes: I24; D84; J15; J16"}, {"section_title": "", "text": "\"You have to ignore it when a child says, 'I don't want to,' because what they're really saying is, 'I don't think I can and I need you to believe in me until I can believe in myself. '\" -Shanna Peeples, 2015 CCSSO National Teacher of the Year 1 Sociodemographic gaps in educational attainment are well documented (Bailey and Dynarski 2011; Bound and Turner 2011) . These gaps are especially concerning if they reflect underinvestments in human capital among traditionally disadvantaged groups, such as racial minorities or children from low-income families. Suboptimally low investments in human capital might arise if disadvantaged groups face barriers to educational attainment (e.g., credit constraints).\nLimited information, incorrect beliefs, and biased expectations comprise another potentially important, but relatively understudied, source of sociodemographic gaps in educational attainment (Hoxby and Turner 2013) . We examine the formation of public school teachers' expectations of student educational attainment. Teachers likely play an important role in shaping students' beliefs about their academic prospects (Burgess and Greaves 2013; Dee 2015) , particularly among relatively disadvantaged students who rarely interact with collegeeducated adults outside of school settings (Jussim and Harber 2005; Lareau 2011; Lareau and Weininger 2008) . More concerning, teachers' beliefs can affect students' performance. In a famous experiment, Rosenthal and Jacobson (1968) manipulated teachers' beliefs of student ability by providing false information regarding students' performance on a nonexistent test and found significantly greater school-year gains among the students who were falsely identified to teachers as \"growth spurters.\" It is troubling, then, that teachers have significantly lower expectations for the educational attainment of socioeconomically disadvantaged and racial minority students (Boser, Wilhelm, and Hanna 2014) . However, whether these \"expectation gaps\" are evidence of biases in teachers' expectations or simply reflect accurate predictions (perhaps due to differences in preparation or early childhood investments) is an open question that we address in the current paper.\nSpecifically, we test for systematic biases in teachers' expectations related to the demographic match between student and teacher using nationally representative survey data in which two teachers reported their expectations for each student's ultimate educational attainment. The intuition behind our approach is as follows: if two teachers' concurrent expectations for the same student's educational attainment diverge, at least one teacher's expectation must be wrong. Differences in teachers' assessments may be random in that they reflect mistakes or different information arising from idiosyncratic interactions with a given student. Alternatively, if within-student differences in teachers' expectations are systematically related to the demographic match between student and teacher, this suggests that on average, teachers have systematically biased beliefs about student potential that are at least partly explained by student demographics.\nWe identify the impact of demographic mismatch on teachers' expectations for students' educational attainment by exploiting a unique feature of the Educational Longitudinal Study of 2002 (ELS): two teachers report their educational expectations for each student. This data structure allows us to condition on unobserved student heterogeneity by making within-student comparisons between the expectations of demographically matched and mismatched teachers. This student fixed effects (FE) identification strategy is motivated by an influential paper by Dee (2005) that exploits a similar feature of the NELS:88 data set-two teachers appraise the behavior of each student-to identify the effect of demographic mismatch between students and teachers on teachers' perceptions of students' behaviors. 2 Dee finds that when students are assigned to one demographically mismatched teacher and one same-race or same-sex teacher, the demographically mismatched teacher is significantly more likely to perceive the student as being frequently disruptive, frequently inattentive, and less likely to complete homework than is the teacher of a similar demographic background. Consistent with Dee, we find that nonblack teachers have significantly lower educational expectations for black students than black teachers do. Our results provide insights into the mechanisms through which student-teacher demographic mismatch affects academic achievement and provide the first causal evidence that demographic mismatch affects teachers' expectations for students' long-run educational attainment. 3 The paper proceeds as follows: the next section briefly reviews the relevant theoretical and empirical literatures on biases in teachers' beliefs, stigmatization, and student-teacher demographic mismatch. The paper then describes the data and identification strategy. The last two sections present the empirical results and conclude."}, {"section_title": "THEORETICAL BACKGROUND AND LITERATURE REVIEW", "text": "Our investigation of the extent to which student-teacher demographic mismatch affects teachers' expectations for students' educational attainment contributes to two distinct literatures.\nFirst, a broad, interdisciplinary literature examines biases in beliefs and their impact on decision making. Mounting evidence suggests that students' beliefs affect their schooling decisions, that their beliefs are often incorrect, and that their beliefs are malleable. For example, Wiswall and Zafar (2015) show that many college students have incorrect beliefs regarding the distribution of average starting salaries across college majors, that students' major choices are a function of these incorrect beliefs, and that biased beliefs can be corrected by an intervention that provides accurate information. Similarly, experimental evidence in social psychology finds that \"buffering interventions,\" which aim to reduce test anxiety attributable to stereotype threat, improve the academic achievement of at least some subsets of the student population (e.g., Dee [2015] ; Spitzer and Aronson [2015] ).\nBiases in beliefs are especially concerning if they lead to underinvestments in human capital. For example, a student may forego college if she overestimates the likelihood of failing to complete her degree. Her decision is suboptimal in the sense that, given unbiased (accurate) beliefs, she would have matriculated. Morgan et al. (2013) and Dillon and Smith (2013) argue that parents' negatively biased beliefs could lead to underinvestment in their children's education, especially in neighborhoods with few college graduates.\nTeachers are important inputs in the K-12 education production function who likely shape students' attitudes towards educational attainment (Burgess and Greaves 2013; Dee, 2015) . One channel through which teachers likely influence students' beliefs is via grading (Mechtenberg 2009 ). Indeed, robust evidence suggests gender, racial, and ethnic biases in how teachers grade exams in a variety of contexts (Burgess and Greaves 2013; Cornwell, Mustard, and Van Parys 2013; Hanna and Linden 2012; Lavy 2008) . Lavy and Sand (2015) show that grading biases can have long-lasting impacts on academic achievement and course taking in high school. Relatedly, Riegle-Crumb and Humphries (2012) study how math teachers stigmatize female students.\nTeachers also likely affect students' beliefs by directly imparting their expectations to students. For example, protection models hypothesize that teacher expectations \"protect against,\" or counteract, negative expectations created by neighborhood effects or lack of access to educationally successful role models (Gregory and Huang 2013) . Indeed, teachers themselves believe that their expectations can affect student outcomes (MetLife 2009), and students frequently report favoring teachers who \"believe in their ability to succeed\" (Curwin 2012; Golebiewski 2012) . Teachers' expectations strongly predict students' postsecondary educational attainment, though this is not necessarily a causal relationship, as expectations may accurately measure unobservable student ability (Boser et al. 2014; Gregory and Huang 2013) . Still, if teachers' expectations are systematically biased, this likely contributes to the persistence of sociodemographic gaps in educational attainment.\nTeachers' expectations might affect student outcomes in at least three ways. First, the perception that teachers have low expectations may exacerbate the harmful effects of stereotype threat, whereby low expectations either cause emotional responses that directly harm performance or cause students to disidentify with educational environments (Steele 1997) .\nSecond, stigmatized students may modify their expectations, and in turn their behavior, to conform to teachers' negative biases (Ferguson 2003) . In each of the first two cases, teachers' stigmatization of information-poor racial minority students could create a feedback loop that functions like a self-fulfilling prophecy (Burgess and Greaves 2013; Loury 2009 ). 4 Finally, teachers who stigmatize certain types of students may modify how they teach, evaluate, and advise them, again leading to poor educational outcomes for stigmatized students (Ferguson 2003) . All three scenarios potentially perpetuate sociodemographic gaps in educational attainment.\nThe current study also contributes to the literature on teacher effectiveness. Recent research shows that teachers affect important socioeconomic outcomes including educational attainment, labor market success, and criminal activity (e.g., Chetty, Friedman, and Rockoff 2013; Jackson 2012) . However, the mechanisms through which high school teachers affect these outcomes are poorly understood. One possible channel is by shaping students' beliefs and expectations about their ability to successfully complete secondary and tertiary education. In that regard, the current study is related to the literature on the relationship between student-teacher demographic mismatch and outcomes such as student test scores and teacher assessments of student behavior and ability (e.g., Clotfelter, Ladd, and Vigdor 2007; Dee 2004 Dee , 2005 Dee , 2007 Egalite, Kisida, and Winters 2015; McGrady and Reynolds 2013; Ouazad 2014) . These studies consistently find evidence of arguably causal, modest negative effects of demographic mismatch on both academic achievement and teacher perceptions of student ability, behavior, and noncognitive skills, in both primary and secondary school settings. 5 At the community college level, Fairlie, Hoffmann, and Oreopoulous (2014) find positive effects of being assigned a minority instructor on several measures of minority students' academic success, including course grades, future course selection, and degree completion. However, these studies are typically reduced form in the sense that the mechanisms through which demographic mismatch affects student outcomes is not identified. Teachers' expectations, which may play a particularly important role in shaping the information set used by students and parents to make decisions regarding investments in human capital, are one potential mechanism. The current study investigates this possibility by providing novel evidence of the relationship between studentteacher demographic mismatch and teachers' expectations for student educational attainment."}, {"section_title": "DATA", "text": "Data come from the Education Longitudinal Study of 2002 (ELS), which was conducted by the National Center for Education Statistics. These data are nationally representative of the cohort of U.S. students who were in 10th grade in 2002. Importantly, the ELS elicited subjective expectations of each student's ultimate educational attainment from students' 10th grade math and reading teachers. Having two expectations per student facilitates a within-student identification strategy that we formalize below. The ELS data also contain information on students' demographic and socioeconomic backgrounds, which facilitates analyses of heterogeneous effects of mismatch by student type. Table 1 summarizes the analytic sample of 16,810 student-teacher dyads, each containing exactly two teacher expectations per student, for whom the relevant sociodemographic variables are observed. Column 1 of Table 1 shows that 19 percent of teachers expected the student to complete no more than a high school diploma, while 53 percent of teachers expected the student to complete a four-year college degree or more. The categorical ELS expectations variables are more nuanced than those reported in Table 1 , but like Dee (2005) , we consolidate expectations into \"high\" and \"low\" attainment categories to facilitate the estimation of linear and logistic student FE models. 6\nThe independent variables of interest measure the degree of demographic mismatch between students and teachers, as characterized by four mutually exclusive categories in column 1: same race and same sex, other race but same sex, same race but other sex, and other race and other sex. Overall, about one-third of student-teacher pairs are same race and same sex, while another third of the sample is same race but other sex. The remaining third of student-teacher pairs in the analytic sample is similarly evenly split between other race, same sex and other race, other sex pairs. The remainder of column 1 provides information on the observable characteristics of the students and teachers who comprise the analytic sample.\nColumns 2 and 3 of Table 1 compare the average characteristics of white and black students, respectively. Black students comprise about 11 percent of the analytic sample. Teachers have systematically lower expectations for black students' educational attainment than for white students, and these differences are statistically significant. Another notable difference is in the frequency with which white and black students experience demographic mismatch in the classroom, which is due both to the majority of teachers being white and to nonwhite teachers being more likely to teach in majority nonwhite schools. White students also have significantly higher test scores, GPAs, and household incomes, which is consistent with evidence of a longstanding racial achievement gap (e.g., Fryer [2011] ). Such differences motivate the withinstudent research design, as the multitude of observed and unobserved differences between white and nonwhite students likely jointly predict teacher expectations and assignment to other-race teachers. Interestingly, however, there are no significant differences between the observable qualifications of teachers assigned to black and white students.\nColumns 4 and 5 of Table 1 similarly compare male and female students. On average, teachers have significantly higher expectations for females, which is consistent with the recent reversal of the gender gap in educational attainment (Bailey and Dynarski 2011; Bound and Turner 2011) . There are also significant differences in exposure to other-sex teachers, which is due to the overrepresentation of females in the teaching profession. Otherwise, male and female students come from similar households and are taught by similarly qualified teachers.\nFinally, columns 6-9 of Table 1 present summary statistics separately by teacher demographics. White and female teachers are marginally more optimistic about students' educational outcomes than black and male teachers, respectively. Overall, the white teacher summary statistics strongly resemble those for the full sample, again because the majority of teachers are white. Column 7 shows that black teachers are significantly less likely than white teachers to have same-race students. Black teachers also have significantly lower-performing and lower-socioeconomic status (SES) students than white teachers. These results are consistent with the literature on teacher mobility that finds white teachers are more likely to work in higher-performing, higher-income, suburban schools and that black teachers tend to move to schools with larger black student populations (Hanushek, Kain, and Rivkin 2004; Jackson 2009 ). White teachers are about 8 percentage points more likely to hold a graduate degree than black teachers, and this difference is strongly statistically significant. This highlights the potential importance of controlling for teacher characteristics in the econometric model. There are fewer differences by teachers' sex in the types of students they are assigned, though male teachers are significantly more experienced and more likely to hold a graduate degree than female teachers. Table 2 presents estimates of descriptive regressions that provide a more nuanced analysis of raw and conditional demographic gaps in teachers' expectations for students' educational attainment. Specifically, Table 2 presents OLS estimates of linear probability models (LPM) in which the dependent variable is a binary indicator equal to one if the teacher expected the student to complete a four-year college degree or more, and zero otherwise. 7 Column 1 reports coefficient estimates for a basic set of demographic characteristics. Relative to the white reference category, teachers are about 20 percentage points less likely to expect black and Hispanic students to complete a college degree but 16 percentage points more likely to expect Asian students to do so. These differences are strongly statistically significant, as is the 9 percentage point gender gap that favors females.\nColumn 2 of Table 2 reports estimates of a model that also conditions on household SES.\nDoing so reduces the black-white and Hispanic-white gaps by about 40 percent and 70 percent, respectively, which is unsurprising given the lower SES of many black and Hispanic households.\nThe coefficient estimates on the SES indicators in column 2 are of the expected sign and provide evidence of an SES gradient in teacher expectations: teachers have significantly higher expectations for the educational attainment of students from high-income and highly educated households. The expectation gaps between high-and low-income students and between the children of college-educated and high-school dropout mothers of about 30 percentage points are practically large as well, relative to the unconditional race/ethnicity gaps observed in column 1.\nColumn 3 of Table 2 further enriches the conditioning set with three measures of academic performance: 9th grade GPA and performance on math and ELA standardized tests.\nDoing so causes the black and Hispanic point estimates to change signs, indicating that, conditional on SES and academic achievement, teachers are significantly more likely to expect traditionally underrepresented minorities to complete a four-year college degree than white students. There are at least two possible explanations for this result. First, this might reflect teachers' perceptions of race-based admissions and financial aid policies. Second, this might reflect teachers' beliefs that racial minority students who perform well academically, overcoming perceived challenges in the process, are more motivated than observationally similar white students. It is also notable that the gender gap shrinks by more than 50 percent after conditioning on academic achievement, though the gap remains statistically significant and in favor of females. It is similarly interesting, and perhaps reassuring, that the SES gradient in teacher expectations significantly flattens after conditioning on students' academic achievement. The coefficient estimates on the academic achievement variables themselves are all of the expected sign and strongly statistically significant.\nFinally, column 4 of Table 2 adds school fixed effects to the LPM that control for unobserved school climate and disparities in school and neighborhood resources. Within-school estimates of race/ethnicity indicators are small in magnitude, and only the black and Asian coefficient estimates are even marginally statistically significant, though the gender gap remains similar in size and strongly statistically significant. The other point estimates, and the presence of SES gradients in teacher expectations, are robust to the inclusion of school fixed effects. In sum, Table 2 and Appendix Table A .1 suggest that teachers' expectations for students' educational attainment are shaped by students' sex, SES, and academic performance. Importantly, when making within-school comparisons, these factors dominate the effect of race and ethnicity. Table 3 reports LPM estimates that similarly describe the relationship between observable teacher characteristics and teachers' expectations that the student will complete a college degree (or more). Column 1 reports estimates of models that do not condition on any student attributes. Multirace teachers have lower expectations than white teachers, on average, but there are no other significant differences in teacher expectations by race. Male teachers have marginally lower expectations than female teachers. Teachers who have a graduate degree or major in the subject they teach have significantly higher expectations for students' college success, which might be due to such teachers teaching in higher-level courses. There is no evidence of systematic differences between how math and reading teachers evaluate students.\nThe adjusted R 2 in column 1 is only 0.01, however, indicating that teacher characteristics alone explain little of the total variation in teacher expectations. Table 3 adds controls for students' demographic backgrounds to the regression model, which causes the black and Hispanic teacher indicators to become statistically significant: conditional on student race and sex, black and Hispanic teachers are significantly more likely to expect that students will complete college than white teachers. Controlling for student demographics does not appreciably change the estimated effects of the other teacher characteristics, as teachers with graduate degrees and majors in the subject they teach continue to expect higher levels of educational attainment from their students. Similar results are obtained in columns 3 and 4, which add controls for students' SES and academic performance to the regression models, respectively. Finally, column 5 adds school FE to the LPM, which generally reduces the magnitude of the estimated effects of observable teacher characteristics on teachers' expectations. Nonetheless, the estimated coefficients on the black and Hispanic indicators remain positive and statistically significant, suggesting that there are within-school differences in how teachers of different demographic backgrounds evaluate student potential. Appendix Table A.2 shows qualitatively similar patterns in teachers' expectations for low educational attainment (i.e., high school diploma or less). Table 4 presents estimates of the full specification shown in column 5 of Table 3 separately by student sex and race. Columns 1 and 2 of Table 4 estimate the descriptive regression separately for male and female students, respectively. Interestingly, black teachers have significantly higher expectations for female students than do teachers from other racial and ethnic backgrounds, but no such difference exists in teachers' expectations for male students."}, {"section_title": "Column 2 of", "text": "Male teachers and math teachers have lower expectations for female students than their female and ELA-teacher counterparts, and the differences are marginally significant, but again, such differences are not observed among male students. These results are consistent with recent evidence suggesting that some teachers stigmatize female students, particularly in math courses (Lavy and Sand 2015; Riegle-Crumb and Humphries 2012) . Table 4 report estimates separately for white and black students, respectively. Black teachers have higher expectations for black students than white teachers, and this difference is marginally statistically significant. There is no such racial difference in teacher expectations for white students. There are also some large differences in Asian and Native American teachers' expectations for black students, though these cells are quite small and are likely driven by a handful of observations. Math teachers are marginally less likely to expect black students to graduate from college than are ELA teachers, and again no such difference is observed in the subsample of white students. Appendix Table A .3 presents qualitatively similar results from analogous analyses of \"low educational expectations.\" These results provide suggestive evidence that teachers' expectations are influenced by the interaction between teacher and student demographics, but these descriptive regressions do not disentangle the effect of demographic mismatch from possibly confounding factors such as unobserved student propensity for educational attainment. We present an empirical strategy for doing so below."}, {"section_title": "Columns 3 and 4 of", "text": ""}, {"section_title": "IDENTIFICATION STRATEGY", "text": "The ELS asked each student's 10th grade math (M) and reading (R) teacher how much education they expected the student to complete. Formally, the expectations (E) of student i's subject-s teacher are modeled as\nwhere α is a subject fixed effect (FE) that controls for systematic differences in math and reading teachers' expectations, θ is a student FE that controls for unobserved student characteristics that influence teachers' expectations (e.g., motivation), x is a vector of observed teacher characteristics that influence their evaluation of students (i.e., experience, graduate degree, major in subject taught), Other is a vector of variables that measure the degree of demographic mismatch between teacher and student, and ε represents unobserved idiosyncrasies of the student-teacher dyad that shaped the teacher's expectation for the student. 8\nIf data were only available for one student-teacher pair per student, θ would necessarily be included in the error term. The likely endogeneity of θ would bias OLS estimates of δ, the parameter of interest in Equation (1), as the sorting of teachers and students into classrooms means that unobserved factors such as motivation, innate ability, and barriers to higher education are likely correlated with observed teacher characteristics. However, having two teacher expectations per student allows us to follow Dee (2005) and Fairlie, Hoffmann, and Oreopoulous (2014) in estimating Equation (1) using a student FE strategy that purges such concerns from the model. For simplicity, there are no s subscripts on β and δ in Equation (1), meaning that the baseline model restricts the effects of teacher characteristics and student-teacher demographic mismatch to be homogeneous across subjects. Below, we relax and test this simplifying assumption by interacting the elements of x and Other with the subject FE and testing the joint significance of the interactions, respectively.\nFollowing Dee (2005) , the baseline model assumes that Other contains two elements: binary indicators for \"other race\" and \"other sex.\" However, to test for multiplicative effects of having both an \"other race\" and \"other sex\" teacher on teachers' expectations, we also consider a non-parametric specification of Other that categorizes the demographic match between teachers and students as one of four possible mutually exclusive scenarios: same race and same sex (omitted reference group), same race and different sex, different race and same sex, and different race and different sex. Again following Dee (2005) , we examine heterogeneity in the effects of student-teacher demographic mismatch by estimating Equation (1) separately for different subsamples of the student population, as previous research on student-teacher demographic match finds that effects on achievement and teacher perceptions sometimes vary by race and by other observable student characteristics (e.g., Antecol, Eren, and Ozbeklik 2015; Egalite, Kisida, and Winters 2015; Ouazad 2014 ).\nThe baseline model given in Equation (1) is treated as a linear probability model (LPM).\nStandard errors are clustered by school, as both teachers and students are nested within schools during students' sophomore year of high school (Angrist and Pischke 2009) . Linear models are preferred despite the binary nature of the dependent variables because they facilitate the inclusion of student FE and the resulting coefficient estimates can be directly interpreted as average partial effects. 9 Nonetheless, we show in Appendix Table A .4 that the baseline results are robust to specifying a nonlinear conditional (FE) logit model that acknowledges the binary nature of the dependent variables, which takes the right-hand side of Equation (1) as its linear index. Another sensitivity analysis is presented in Appendix Table A .5, which shows that the preferred LPM estimates are robust to weighting by NCES-provided sampling weights, as suggested by Solon, Haider, and Wooldridge (2015) .\nThe remaining threat to the validity of the baseline student-FE estimates is endogenous sorting that systematically varies by subject and student background. Intuitively, this concern is analogous to those about time-varying unobserved heterogeneity in panel data settings in which individuals are observed repeatedly over time and time-invariant individual FE fail to purge time-varying sources of bias from the model. In the current context, the student FE only adequately controls for sorting into classrooms based on student unobservables if the sorting mechanism is the same for both math and reading classrooms. For example, baseline estimates of δ in Equation (1) would overstate the effect of student-teacher demographic mismatch if low math ability nonwhite students are systematically assigned to white math teachers. While we can neither account nor test for such sorting on unobservables, we follow Fairlie, Hoffmann, and Oreopoulous (2014) in testing for analogous types of differential sorting on observables, who argue that if there is no systematic sorting on observable student characteristics (z) and the elements of z are highly correlated with the ε in equation (1), then differential sorting on unobservables of the sort described above is unlikely to seriously threaten the validity of the preferred student-FE estimates of Equation (1). Implementing a Fairlie, Hoffmann, and Oreopoulous (2014) style test for differential sorting by observables requires using teacher identifiers that we created via probabilistic matching to compute , r j z the mean value of characteristic z among teacher j's type-r students in school k, where r could denote race or sex. In the simplest form of the test, r is a binary indicator equal to one for nonwhite students and zero otherwise. We then use two observations per teacher to estimate linear regressions of the form\nwhere ω is either a school or school-by-subject FE, 1{.} is the indicator function, Nonwhite is a binary indicator equal to one if teacher j is nonwhite and zero otherwise, and u is an idiosyncratic error term. The coefficient of interest in Equation (2) is π, which is essentially a difference-indifferences estimate of how the mean difference between white and nonwhite student characteristics varies between white and nonwhite teachers in the same school (or school-subject pair). If the OLS estimate of π is statistically indistinguishable from zero, there is no evidence of differential sorting on observables and thus differential sorting on unobservables in a way that would bias the preferred student-FE estimates of Equation (1) is unlikely. Hoffmann, and Oreopoulous (2014) and described in Equation (2). Panel A of Table 5 reports estimates from models that condition on school FE, and panel B reports estimates from models that condition on school-by-subject FE. The two specifications produce nearly identical results, which alleviate concerns that the main results are biased by differential sorting by subject and student race into classrooms. Specifically, the interaction terms that represent differential sorting by race on observables are statistically indistinguishable from zero for each of the five student characteristics considered: 9th grade GPA, mother has a high school diploma or less, mother has a college degree or more, student comes from a low-income household, and student comes from a high-income household. Moreover, the interaction term point estimates and standard errors are small in magnitude, again suggesting that there is no differential sorting on observables by student race. Thus differential sorting on unobservables is unlikely to pose a serious threat to identification, as previous performance, household income, and maternal education are likely correlated with the idiosyncratic error term in Equation (1). Table 6 reports estimates of the baseline LPM shown in Equation (1). The first row reports estimates for the full analytic sample and each subsequent row reports estimates for a specific subsample of interest. Columns 1 and 2 report the estimated effects of Other Race and"}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Sorting Test Results", "text": ""}, {"section_title": "Main Results", "text": "Other Sex student-teacher pairings, respectively, on the likelihood that teachers expect students to complete a high school diploma or less. In the full sample, the other-race effect is positive, small in magnitude, and only marginally statistically significant. This suggests that on average, teachers are more likely to expect low levels of educational attainment for students of different racial backgrounds than they are for students of the same race.\nHowever, restricting the effect of racial mismatch to be constant across all students might mask important heterogeneities by student race, sex, and SES. Indeed, the subsequent five rows of Table 6 show that the overall positive effect of racial mismatch on the probability that the teacher has low expectations for educational attainment was almost entirely driven by nonblack (mostly white) teachers' expectations for black students relative to the expectations of black teachers. Specifically, nonblack teachers are 12 percentage points more likely to expect black students to complete a high school diploma or less than are black teachers, and this difference is statistically significant. It is also arguably practically significant, as it represents an almost 40 percent increase relative to the mean expectation for black students of 0.31.\nFurther stratification of the race/ethnicity subsamples reveals that the effect of studentteacher racial mismatch on teachers' expectations that black students complete a high school diploma or less is 5 percentage points larger for black males than for black females, though these estimates are less precisely estimated, which is likely due to the substantial reductions in sample size. Other-race teachers are also relatively more likely to have lower educational expectations for students from low-income households and students in the South.\nColumn 2 of Table 6 provides no evidence of an effect of sex mismatch on teacher expectations for low educational attainment, either overall or by student subgroup.\nColumns 3 and 4 of Table 6 similarly report estimates of the baseline LPM for the probability that teachers expect the student to complete a four-year college degree or more.\nNeither the other-race nor other-sex indicator is significant when the model is estimated using the full analytic sample, though as discussed above there might be significant differences in the effect of demographic mismatch by students' demographic and socioeconomic backgrounds.\nSure enough, and consistent with the results for low educational expectations presented in column 1 of Table 6 , nonblack teachers are significantly less likely to expect black students to complete a four-year college degree than are black teachers. Again, the effect of racial mismatch on teachers' expectations for college completion is larger in magnitude for black females than black males.\nInterestingly, and unlike in the results for low-expectations reported in column 2, a marginally significant effect of gender mismatch on teachers' expectations for black students' college success is observed in column 4 of Table 6 . This appears to be mostly driven by female teachers' expectations of black male students. These results suggest nonlinearities in the effects of other-race and other-sex student-teacher assignments on teachers' expectations, which we further investigate in Table 7 .\nSpecifically, Table 7 "}, {"section_title": "reports estimates of a richer version of the preferred LPM in which", "text": "Other is specified as a set of four mutually exclusive categorical indicators of the nature of the demographic match between students and teachers. Same race and same sex is the omitted reference group to which reported point estimates can be compared. In the full analytic sample, the point estimate in column 3 of the first row of Table 7 shows that the overall other-race effect observed in column 1 of Table 6 was driven by instances of racial mismatch in which there was also sex mismatch. In the black subsample, the \"other race and other sex\" indicator in column 3 of Table 7 is positive and relatively large but imprecisely estimated. However, the \"other sex\" indicator in column 2 is negative, twice as large in magnitude, and statistically significant. This indicates that black teachers assigned to black students of the opposite sex are significantly less likely to have low expectations than a black teacher of the same sex as the student. This result is likely driven by black female teachers' expectations for black male students, as black male teachers are relatively rare in the analytic sample. Indeed, in the black male subsample, black female teachers are 20 percentage points less likely than white teachers of either sex, and almost 30 percentage points less likely than black male teachers, to expect a high school diploma or less.\nIn other words, black female teachers are significantly more optimistic about black males' ability to complete high school than teachers from any other demographic group. As for black female students, there is a marginally statistically significant \"other race and other sex\" effect on teacher expectations, which suggests that white male teachers are about 10-20 percentage points more likely to have low expectations for black female students than teachers from other demographic backgrounds.\nColumns 4-6 of Table 7 similarly analyze the effect of student-teacher demographic mismatch on the probability that teachers have high expectations for students' educational outcomes. Several of the patterns reverse. Notably, among teachers of black students, other-race teachers are significantly less likely to expect a four year college degree, regardless of the sex match between student and teacher. This is in stark contrast to the results for low expectations, and highlights the nuanced relationship between student-teacher demographic mismatch and teachers' expectations for educational success.\nFinally, in Table 8 we relax the assumption that the coefficients on demographic mismatch (δ) and observed teacher characteristics (β) do not vary by subject by augmenting the baseline LPM, which only included a math-teacher FE, to include interactions between the mathteacher FE and each of the model's covariates. These interaction terms are only jointly statistically significant when the augmented model is estimated on the subsample of black students, as shown by the joint F-test p values reported in column 7 of Table 8 , suggesting that the baseline model is a reasonable specification. Still, the role of student-teacher demographic mismatch in shaping teachers' expectations for student attainment might vary between math and reading classrooms.\nPanel A of Table 8 investigates whether this is so for the formation of low-attainment (high school or less) teacher expectations. The math-other race interaction term in the first row of panel A is statistically significant and suggests that the small, positive effect of racial mismatch on low teacher expectations in the full sample observed in Table 6 was driven by lower expectations among racially mismatched math teachers as opposed to reading teachers. However, while the analogous interaction term in the black subsample is positive and of the same magnitude, it is statistically indistinguishable from zero. In other words, for black students, the other-race effect on teacher expectations was approximately the same for both math and reading teachers. Finally, the last row of panel A of Table 8 shows that demographically mismatched math teachers are significantly more likely to expect low attainment for female students, while there is no effect of demographic mismatch on reading teachers' expectations for female student attainment. This is consistent with evidence that female students are stigmatized in math classrooms (e.g., Lavy and Sand 2015) . Table 8 does the same for high-attainment expectations (college degree or more). Like in the main results, the only significant effects of demographic mismatch on high expectations are observed in the subsample of black students. Interestingly, however, the otherrace coefficient is negative but not statistically significant at traditional confidence levels. In the context of the augmented interaction model, this means that there is no significant effect of racial mismatch on reading teachers' expectations for student attainment. The other race-math interaction term is also negative and statistically insignificant, but combined with the other-race effect, the total effect of racial mismatch on math teachers' expectations of −0.15 is relatively large in magnitude and strongly statistically significant. 10 This suggests that the general finding that racial mismatch between students and teachers lowered teachers' expectations that students would earn a four-year college degree were largely driven by math teachers' expectations."}, {"section_title": "Panel B of", "text": ""}, {"section_title": "DISCUSSION", "text": "Using unique, nationally representative survey data that contain two teachers' expectations for each student's educational attainment, we estimate student fixed-effects models that identify the effect of student-teacher demographic mismatch on teachers' expectations. The estimates are arguably causal, as the identifying variation comes from within-student differences between two of each student's 10th grade teachers, and we find no evidence of differential sorting into classrooms by race. In doing so, we provide the first evidence that teachers' expectations are systematically biased. Specifically, we find that nonblack teachers have significantly lower educational expectations for black students than do black teachers. For example, relative to teachers of the same race and sex as the student, other-race teachers were 12 percentage points less likely to expect black students to complete a four-year college degree.\nSuch effects were even larger for other-race and other-sex teachers, for black male students, and for math teachers. In addition to being statistically significant, these effects are arguably practically significant as well, as they constitute more than half of the black-white gap in teacher expectations.\nThe general finding of systematic biases in teachers' expectations for student attainment indicates that the topic of teacher expectations is ripe for future research. Particularly policy relevant areas for future inquiry include how teachers form expectations, what types of interventions can eliminate biases from teacher expectations, and how teacher expectations affect the long-run student outcomes of ultimate import. To the extent that teacher expectations affect student outcomes, the results presented in the current study provide additional support for the hiring of a more diverse and representative teaching force, as nonwhite teachers are underrepresented in U.S. public schools (e.g., Kirby, Berends, and Naftel 1999) . Similarly, our results highlight the potential benefits of including expectations in teacher training and professional development program curriculums. For example, aspects of programs such as the Great Expectations (GE) initiative, which strives to ensure that all teachers nurture and help all students to reach their potential, regardless of their innate ability, talents, behaviors, or home circumstances, might be included in professional development programs nationwide (Ferguson 2003) . 10,830 NOTE: * p < 0.10; ** p < 0.05; *** p < 0.01 refer to mean-difference t tests between columns 2 and 3, 4 and 5, 6 and 7, and 8 and 9. Studentteacher pairs are the unit of analysis, so there are two observations (teachers) per student. HS = high school. HH = household. No Yes NOTE: * p < 0.10; ** p < 0.05; *** p < 0.01.N = 16,810. Parentheses contain standard errors that are robust to clustering at the school level. 10,600 1,840 NOTE: * p < 0.10; ** p < 0.05; *** p < 0.01. Parentheses contain standard errors that are robust to clustering at the school level. All models condition on the full set of student demographic, SES, and academic performance covariates in addition to school fixed effects. Bold interaction terms are the interaction between the nonwhite teacher and nonwhite student mean indicators, which constitute the sorting test described by Equation (2) in the text. (0.02) (0.01) (0.04) (0.02)* NOTE: * p < 0.10; ** p < 0.05; *** p < 0.01. Each row of columns 1 and 2 reports coefficient estimates from the same regression, and similarly for columns 3 and 4. Parentheses contain standard errors that are robust to clustering at the school level. All models condition on student fixed effects and control for teacher characteristics. There are two observations per student, one each from the student's math and reading teacher. Each row of columns 1, 2, and 3 reports coefficient estimates from the same regression, and similarly for columns 4, 5, and 6. The omitted mismatch category in each regression is \"same race and same sex.\" Parentheses contain standard errors that are robust to clustering at the school level. All models condition on student fixed effects and control for teacher characteristics. There are two observations per student from the students' math and reading teacher. (0.02) (0.02) (0.02) (0.02) (0.02) (0.02) NOTE: * p < 0.10; ** p < 0.05; *** p < 0.01. Each row reports estimates from a unique regression. Columns 3 and 6 report net effects of racial and sex mismatch of math teachers, respectively, which are the sum of the coefficient estimates reported in columns 1 and 2, and 4 and 5, respectively. Parentheses contain standard errors that are robust to clustering at the school level. Standard errors of the net partial effects reported in columns 3 and 6 were computed by the Delta Method. All models condition on student fixed effects, observed teacher characteristics, and a full set of teacher characteristic−math teacher interactions. The F tests reported in column 7 are for the joint significance of the full sets of math teacher interaction terms."}, {"section_title": "Appendix Table A.1 Descriptive Linear Regressions: Teacher Expects ≤ High School Diploma", "text": "(1) (2) (3) (4) Student is white ( (1)\n(2) (3) (4) Yes NOTE: * p < 0.10; ** p < 0.05; *** p < 0.01. N = 16,810. Parentheses contain standard errors that are robust to clustering at the school level."}, {"section_title": "Appendix Table A.3 Descriptive Linear Regressions: Teacher Expects ≤ High School Diploma", "text": "Male student Female student White student Black student (1 10,600 1,840 NOTE: * p < 0.10; ** p < 0.05; *** p < 0.01. Parentheses contain standard errors that are robust to clustering at the school level. All models condition on the full set of student demographic, SES, and academic performance covariates in addition to school fixed effects. /A NOTE: * p < 0.10; ** p < 0.05; *** p < 0.01. Each row of columns 1 and 2 reports coefficient estimates from the same regression, and similarly for columns 3 and 4. Parentheses contain standard errors that are robust to clustering at the school level. All models condition on student fixed effects and control for teacher characteristics. There are two observations per student, one each from the student's math and reading teacher. The likelihood did not converge for some subpopulations, denoted by (−). (0.03) (0.02) (0.05) (0.03) NOTE: * p < 0.10; ** p < 0.05; *** p < 0.01.Each row of columns 1 and 2 reports coefficient estimates from the same regression, and similarly for columns 3 and 4. Parentheses contain standard errors that are robust to clustering at the school level. All models condition on student fixed effects and control for teacher characteristics. There are two observations per student, one each from the student's math and reading teacher. These estimates are weighted by NCES−provided sampling weights that adjust for unequal probabilities of sample selection."}, {"section_title": "Appendix Table A.4 Fixed Effect Logit Coefficient Estimates of Baseline Model", "text": ""}, {"section_title": "Appendix Table A.5 Weighted Linear Probability Model (LPM) Estimates of Teachers' Expectations", "text": ""}]