[{"section_title": "", "text": "After a long and contentious Congressional debate, President Bush signed the new 2002 Farm Bill into law on May 13, 2002. The new farm legislation calls for increases in support exceeding $67 billion over the 1996 Federal Agricultural Improvement and Reform (FAIR) Act baseline. Although the legislative debate that preceded the 2002 Farm Bill involved many different points of contention, a few issues were particularly important for the consideration of future directions of farm policy. In particular, the allocation of farm program benefits among different farmers (especially the distinction between large versus small and full-time producers versus \"absentee\" owners) became a topic of considerable debate. The debate was unprecedented in that it spilled over into the popular press, including a large number of editorials and news programs critical of the large level of support being directed toward the farm sector. On the surface, many observers seemed surprised by the substantial support directed toward agriculture in general and non-farmer land owners in particular. The question of how policy has affected agricultural land values and the concomitant issue of the distribution of the benefits of farm program support is a critical issue in any farm policy debate. When farm policy drives up land values, it raises production costs, hence transferring benefits toward landowners rather than producers. 1 An extensive empirical literature often called upon in the political arena has attempted to measure the extent to which farm program benefits are capitalized into land values. 2 As we discuss in detail below, most existing models of agricultural asset values adopt an income approach whereby the value of an asset is modeled as the present value of expected future cash flows, discounted appropriately to reflect the risk of each source of earnings. We will argue that problems occur when this model is used in empirical applications aimed at investigating the factors that determine the value of farmland. In particular, we use a large U.S. farm-level data set to demonstrate that contemporaneous farm receipts may not be appropriate indicators of the expected future cash flows that underlie farmland values. We also point out the significant contribution of urban factors to farmland value. The next section discusses the standard model that drives empirical work on farmland values. In the third section, we highlight the problems associated with the empirical implementation of this model. We then present empirical findings that demonstrate the empirical implementation issues. The final section offers concluding remarks."}, {"section_title": "Conceptual Issues and the Existing Literature", "text": "The typical approach to valuing farmland is based on a net-present value type of model; the current value of a parcel of land is the sum of expected future cash flows discounted according to the risk of these cash flows. Farmland in the United States gives rights not only to cash flows from the market (sale of the crop), but also to payments from the government. Each cash flow source has a different risk attached to it. This has led authors like Weersink et al., for example, to break net returns into the individual components that result from market returns (P) and from the government (G) as follows: where b j represents the discount rate for the jth source of income. The discount rates attached to each source of returns are allowed to differ in order to reflect differences in the uncertainty associated with different sources of future net returns. If the same discount rate is applied to all cash flows from the same source (i.e., b j i = b j for all i) and if each cash flow stream is expected to grow at a constant rate, then the above formulation simplifies to This equation forms the basis for the models typically estimated in the literature, where all farm payments are lumped into one aggregate sum or are proxied by a single indicator variable. This general approach is applied throughout the empirical literature on agricultural asset value determination. Contributions to this literature have included papers by Tweeten and Martin; Melichar; Castle and Hoch; Alston, Burt, Featherstone and Baker; and Clark, Klein, and Thompson. Goodwin and Ortalo-Magné proxy farm support by using an aggregate measure of support (the producer subsidy equivalent or PSE). Weersink et al. pursue a similar approach in evaluating the effects of government transfers on Canadian farmland values. In Goodwin, Mishra, and Ortalo-Magné (forthcoming 2003), we take the standard approach further along two dimensions. First, our farm level data set is sufficiently detailed to allow us to differentiate four main types of farm programs: loan deficiency payments, disaster payments (including market loss assistance), Agricultural Market Transition Act (AMTA) payments, and other payments (e.g., Conservation Reserve Program (CRP) payments). 3 Uncertainty about the future of each program and the expected growth rate of support varies across programs. Differentiating each source of payments allows us to account for this fact. For example, AMTA payments were set to expire with the 2002 crop, although recent legislative actions may certainly give farmers reason to suspect whether such benefits might persist into the future. Second, we take advantage of knowledge of the location of each farm to explicitly account for the value that farm land derives from the option of being converted to alternative uses, such as commercial or residential real estate in the future. This leads us to estimate a land value equation of the type where we account for n G types of government payments (G j ) and n H indicators of urban pressure on agricultural land (H j )."}, {"section_title": "The Problematic Link With an Empirical Model", "text": "In spite of the progression of this empirical literature, a fundamental shortcoming remains for models that attempt to quantify the determinants of farm land values. Land values are based upon expectations about the long-run stream of net returns to production and government transfers tied to the land. Expected future cash flows are unobservable (latent). What one does observe are the market and government payment realizations for a sample of farms under a fixed set of policy instruments and market conditions. Both market and government payments in any given year represent realizations drawn from distributions that are determined by random prices, yields, and policy shocks. This raises a critical issue: to what extent do observations about payments in any given year reflect the long-term expected stream of cash flows-the real factor relevant to land values? This suggests that a fundamental issue associated with the empirical models that have been used to evaluate policy impacts on land values is a standard errors-in-variables problem. What one observes in any given year for a farm may not be a valid indicator of what is expected in the long run and thus what is actually driving land values. There are several possibilities regarding the link between observed policy and market outcomes in any given year and the determination of land prices. It is likely that agents correctly assess the true determinants of land values, but the econometrician, working with actual realizations of policy outcomes from year to year, is unable to observe these determinants. Instead, the econometrician relates the observable annual realizations of market and policy outcomes to land prices. In this case, the econometrician is confronted with the classical errors in the explanatory variables problem. Errorsin-variables result in an attenuation bias that forces coefficients toward zero and thus yields inconsistent estimates. 4 If one truly believes that different government programs should be considered independently, one is faced with the problem of multiple explanatory variables observed with error. A complicating factor arises in that the errors applying to observed policy benefits may be correlated in a typical sample. This correlation may assume two different formscorrelation of the errors across different programs (for a given farm) and correlation of errors across different farms in a sample. Both circumstances are likely to coexist when one considers a pooled cross section of farms (as is the case in our empirical analysis). Consider a case of two programs-price supports and market loss assistance payments. The extent of support provided by the government is likely to vary considerably from year to year according to market conditions. Low-price years realize larger payments for both programs. Thus, the errors associated with using realized benefits are likely to be highly correlated across the programs. The correlation could also be negative. Consider the case of yield disaster relief and price supports. In low-yield years, market prices are high and thus price support payments will be low, though disaster benefits will be higher to compensate for the production shortfalls. Another form of correlation is likely to be relevant when a pooled sample of individual farms is considered. Since realized program benefits are dependent upon aggregate market conditions, the errors are likely to be highly correlated across observational units (farms) in a given year. In a sample consisting of only a few years of data, the correlation across farms increases the estimation error and may further exaggerate the bias; year-to-year shocks may not average out when only a few years are observed. Furthermore, if realizations are highly correlated across units within a year, parameter estimates may shift considerably from year to year. If only a few years are observed, the estimates from a pooled sample may be sensitive to events in the years observed and thus may vary substantially across years and be more variable in a pooled analysis. In our application, where we consider a range of policies that are likely to be both positively and negatively correlated as well as subject to considerable year-to-year shocks affecting all units in the cross section, it is impossible to adequately gauge the effects of the errors in variables problem. These problems complicate empirical analysis, though a few predictions are apparent. First, the effects of individual policy benefits on land values will be biased toward zero. Second, the omission of other factors relevant to land values (i.e., nonagricultural demands) may bias estimates. Third, the effect of substantial correlation in policy realizations within a year suggests that one might observe substantial differences in the effects of policies across years-differences that do not reflect changes in agents' expectations but rather only the nature of the benefit realizations in the short sample. With government payments dependent upon the market earnings of the relevant crops for each farm, we should also find substantial differences in the effects of policies across regions. The objective of the next section is to demonstrate these symptoms."}, {"section_title": "Empirical Analysis", "text": "Our empirical analysis utilizes farmland values collected from a large sample of farms through the USDA-National Agricultural Statistics Service (NASS) Agricultural Resource Management Survey (ARMS) project. The ARMS survey is a large probability-weighted, stratified sample of about 8,000-10,000 U.S. farms each year. The survey asks farmers to estimate the market value on December 31 of each year of their land, dwellings, and other farm buildings and structures. Our analysis considers only the value of land (excluding trees and orchards). 5 The ARMS survey collected detailed payment information for individual farm program benefits for the years 1998-2001. Thus, our empirical analysis focuses on these years. An important characteristic of the ARMS data relates to the stratified nature of the sampling used to collect the data. Two estimation approaches have been suggested for problems such as this involving stratification. The simplest involves a jacknife procedure, whereby alternative subsamples are dropped from the analysis. The ARMS survey includes predetermined subsample indicators for this purpose. However, these procedures may not be valid when one is working with a subset of the data, as is the case in our analysis. An alternative approach, adopted here, is to consider a probability-weighted bootstrapping approach, where the probability of being sampled for each observation reflects its weight in the population. Our estimates are calculated from 1,500 bootstrap replications. To focus on policies directed at crop farms, we excluded any farms from our analysis for which livestock product sales accounted for over 50% of overall farm sales. We also excluded farms for which incomplete data were available and any parcels with reported values exceeding $10,000 per acre on the basis that such extreme values represented unobservable site characteristics. 6 In the end, we were left with 13,606 individual farm-level observations. A variety of sources were used to collect county-level observations on crop acreage (NASS statistics) and data relevant to county population and housing value trends (Census data). Summary statistics and definitions for the key variables of our analysis are presented in Table 1. Population weights were used in deriving summary statistics to account for the stratified nature of the ARMS survey. We consider three variables that represent agricultural returns from the market. The first is a market price index that is constructed using state-level prices and county acreage share weights. Each component of the index is the normalized price of those crops grown in each county. One would expect this variable to exert greater effects on profits (and thus land values) in areas with more valuable (on a per-acre basis) crop production. The second variable measures the returns excluding government payments to the typical acre of farmland in the county in which the land is located. This variable is given by per acre net farm earnings, less government payments, as reported in the 1997 Agricultural Census. This variable reflects differences in earnings that may represent the variation in crops and land types in different counties. We also need to represent those land characteristics specific to an individual farm that may influence its profitability in agricultural production. Of course, it is impossible to separate farm characteristics from operator characteristics. With such a limitation in mind, we consider normalized crop yields, given by the ratio of the yield for a given crop on a given farm to the county average yield for the same crop in that year. We then consider the average of this normalized yield over all crops produced on the farm. Note that the variables representing county-average earnings per acre and the average market price both represent the profitability of land in one county relative to all others whereas the normalized yield indicator represents the inherent profitability of one farm, relative to all others in the county. Nonagricultural demands for agricultural land at the rural-urban interface have become increasingly important in many areas. We include three factors intended to represent the capital gains inherent in farmland in areas facing nonagricultural pressures. First, we include the total value of housing permits (collected from the U.S. Census Bureau) issued in the county in which the farm is located. Second, population density is represented using the Census Bureau's measure of population per square mile. Third, we consider population growth rates in each county in the preceding year, also obtained from the Census Bureau. Finally, as we have noted above, different programs may be expected to exert differential impacts on land values. The ARMS surveys over our period of study included a detailed reporting of program payments in several categories. In particular, we consider payments received by each farm under the production flexibility provisions of the 1996 FAIR Act (i.e., AMTA program payments), loan deficiency payments received, disaster payment receipts (which include both market loss assistance payments and other ad hoc disaster relief payments), CRP payments, and an aggregate of all other farm program payment receipts. It should be noted that disaster payments may represent different aspects of government support. Market loss assistance payments have been particularly contentious in policy debates, since, although they are not tied to any particular commodity, they have been driven by legislative concerns over market conditions for specific crops (especially wheat and corn). We consider a progression in our modeling of agricultural land values, beginning with the standard analysis that has been so common in the empirical literature. Table 2 presents three alternative empirical models of agricultural land values. The first (Model I) includes an aggregate measure of total policy benefits (i.e., payment receipts) and omits any nonagricultural determinants of land values. The results suggest that an additional dollar per acre of payment receipts implies an increase in land values of $4.69. Higher relative means and higher net returns to agriculture are also highly correlated with higher land values, although the average market price effect is significantly negative, which is counter to expectations that higher annual returns should be correlated with higher land values. This may reflect correlation with other variables or, more likely, the effects of model misspecification. Model II adds the variables that capture nonagricultural pressures on agricultural land values. These variables are highly significant. Housing pressures and urban growth pressures significantly increase agricultural land values. Interestingly, including the nonagricultural demand variables does not appear to substantially affect the estimates related to the other determinants of land values. We have argued that different farm programs provide very different benefits that likely differ in their year-to-year effects, the degree of uncertainty of the future benefits to be provided, and the effects on different crops and different farm types. Model III breaks the aggregate farm program benefits down by the type of program that provided the benefits. The results confirm the significance of differences in the sources of benefits on land values. Price supports (loan deficiency payments (LDP) payments) appear to have the largest effect on land values, with an additional dollar of payments raising land values by $6.55 per acre. An additional dollar of disaster payments appears to raise land values by $4.69 per acre. A dollar of AMTA payments, which many believed were set to expire in 2002 with the end of the FAIR Act, appear to raise land val-ues by $4.94 per acre. It is interesting to point out that this is larger than expected if agents truly believed fixed payments would end with the FAIR Act. The 2002 Farm Bill continued these payments, with even a modest increase in their levels. Thus, farmers appear to have been correct in their assessment of future farm policy. The results also suggest that CRP benefits, which involve the removal of land from production, were correlated with considerably lower land values. This is certainly no surprise since such lands are typically less productive, and putting land into reserve for an extended period of time (as is required under the CRP program) would certainly be expected to reduce its productive potential. We have argued that these results should be taken with caution because realized cash flows vary substantially from year to year. More important, because of the design of some of the agricultural policy programs, we do not expect year-to-year fluctuations to capture changes in long-run cash flow expectations. To evaluate the extent to which the implications regarding the effects of realized benefits on land values might differ from year to year, we allow the effects of each program to differ by year. The resulting model (Model IV) is presented in Table 3. The results confirm that the implied effects of each program differ substantially across years-making any inferences drawn from aggregated models (Table 2) questionable. For example, the effects of LDP payments on land values range from a high of $8.98 in 2000 to a low of $4.39 in 2001. Disaster payments, which include the market loss assistance payments, had no effect on land values in 1998 but appear to have been correlated with substantial effects on land values in 1999 (an increase of $6.50 for each dollar of payments). Market loss assistance payments began in 1998 and may have surprised land market agents at first. However, when such payments were continued in 1999, agents' may have adjusted their expectations regarding the future of such payments and thus land prices responded accordingly. 7 Finally, we have maintained that there is considerable variation in the extent to which benefits provided to agriculture across different regions of the country affect land values. This variation results because of differences in agriculture across regions, including differences in crops grown, productivity, and the profitability of production. To examine the extent to which inferences may differ across regions, we considered models applied to two subsets of data-the Heartland (Model V) and the Northern Great Plains (Model VI) regions of the United States. 8 Several interesting points are reflected in the results. First, the results again demonstrate the fact that the implied effects of policies differ substantially across years. In addition, the effects of different policies appear to differ substantially across regions. For example, AMTA payments appear to have a much greater effect on land values in the Northern Great Plains than on those in the Corn Belt. This may reflect the prevalence of program crops with a historical base, as compared with the extensive production of soybeans in the Corn Belt, for which no historical base applied (and hence no AMTA payments). The results also reflect the expected effect of higher market prices on land values. In each model, the effect is significantly positive with the Heartland (Corn Belt) model, whereas this effect is not significant for the Northern Great Plains. This may reflect the fact that the productive potential of an acre of corn belt land (corn and soybeans) is much higher than that of an acre of land in the Northern Great Plains (wheat and barley). In addition, this may be an imperfect representation of market returns, which are also likely to be captured by the mean yield variable. As expected, higher yields appear to be worth much more in the Corn Belt than they are in the Northern Great Plains, an area with lower values of production on a given acre of land. The results also demonstrate the large differences that nonagricultural demands for land may exhibit across regions. As one would expect, the effect is much larger in the Northern Great Plains, a region with sparse development and relatively low land values. Finally, the results confirm suspicions that an analysis of the effects of policy benefits on land values must recognize that such effects are likely to differ substantially across different regions."}, {"section_title": "Concluding Remarks", "text": "Our analysis was focused on obtaining a better understanding of the effects of government programs on agricultural land values. A large literature has attempted to ascertain and quantify the extent to which farm programs are bid into agricultural land values. We considered an empirical analysis using a very large sample of farms collected across the United States over the 1998-2001 period, and we confirmed that policy does indeed affect land values and that different policies have very different effects on land values. Unfortunately, we have many reasons to question not only our results but also the results and implications provided by the very large literature that has addressed this question. We identify a number of problems that arise when one attempts to implement the standard present value model in an empirical evaluation of the capitalization of benefits. The standard model assumes that land values are determined by long-run expected returns (market-and policy-generated) to land. Expected returns are, however, inherently unobservable and thus we often attempt to relate the realizations of such policy benefits to observed land values. As we note, however, even if expectations are stationary, benefits vary considerably from year to year, depending not only upon changes in the provision of benefits, but also on changes in the market, since most benefits are tied to production and/or market conditions. Unless agents' expectations are perfectly represented by realized policy benefits each year, this implies an errors-in-variables problem that may be quite damaging to any empirical analysis relating policy benefits to land values. This problem may be compounded when the errors are correlated across programs and farms in the sample. The attenuation bias that results is likely to push the implied effects of policy on land values toward zero. One implication may be that our estimates provide a lower bound on the effect of policy on land values, which would hold if agents only considered realized benefits. In such a case, as we show, the effects of policies on land values will vary substantially across year, crop, and region. Greater attention to the link between policy realizations and expected policy benefits must be the focus of future research."}]