[{"section_title": "Abstract", "text": "Individual variation in reward sensitivity may have an important role in early substance use and subsequent development of substance abuse. This may be especially important during adolescence, a transition period marked by approach behavior and a propensity toward risk taking, novelty seeking and alteration of the social landscape. However, little is known about the relative contribution of personality, behavior, and brain responses for prediction of alcohol use in adolescents. In this study, we applied factor analyses and structural equation modeling to reward-related brain responses assessed by functional magnetic resonance imaging during a monetary incentive delay task. In addition, novelty seeking, sensation seeking, impulsivity, extraversion, and behavioral measures of risk taking were entered as predictors of early onset of drinking in a sample of 14-year-old healthy adolescents (N ¼ 324). Reward-associated behavior, personality, and brain responses all contributed to alcohol intake with personality explaining a higher proportion of the variance than behavior and brain responses. When only the ventral striatum was used, a small non-significant contribution to the prediction of early alcohol use was found. These data suggest that the role of reward-related brain activation may be more important in addiction than initiation of early drinking, where personality traits and reward-related behaviors were more significant. With up to 26% of explained variance, the interrelation of reward-related personality traits, behavior, and neural response patterns may convey risk for later alcohol abuse in adolescence, and thus may be identified as a vulnerability factor for the development of substance use disorders."}, {"section_title": "INTRODUCTION", "text": "Adolescence is a transition period marked by physical and behavioral changes that result from the acquisition and refinement of social, cognitive, and emotional skills to support successful passage into adulthood. Adolescent approach behavior has a propensity toward risk taking and novelty seeking (Ernst et al, 2006) , likely to result in hypersensitivity to reward. Reward sensitivity is characterized by heightened emotional, cognitive and physiological reactivity to signals of and enhanced behavioral responses to reward (Depue and Collins, 1999 ) and seems to be most pronounced during puberty (Friemel et al, 2010) . In humans, reward sensitivity has been operationalized via personality measures such as extraversion (Gray, 1970) . Reward sensitivity is known to be associated with increased responsiveness in the brain reward system (eg, Hahn et al, 2009) . On a neural level, the anterior cingulate cortex, the ventral pallidum, the ventral striatum, the orbitofrontal cortex, and the dopaminergic midbrain neurons are key structures of this network, and the amygdala, thalamus, orbital prefrontal cortex and hippocampus are further components involved in the regulation of reward (Haber and Knutson, 2010) .\nReward sensitivity is also associated with increased alcohol cue responding, heightened heart rate response to alcohol intoxication and higher alcohol craving (Franken et al, 2006) , stronger physiological responses to alcohol and higher conditioning to alcohol cues (Brunelle et al, 2004) . Early initiation of alcohol intake, even at very low levels of alcohol use, was found to be associated with an elevated risk for the development of alcohol use disorder (Behrendt et al, 2009) . Specifically, adolescence was characterized as a high risk period for first alcohol use and the transition to alcohol abuse and dependence (Wittchen et al, 2008; Swendsen et al, 2009) . Neurobiological factors such as deficient recruitment of motivational circuitry by non-drug rewards (Ratsma et al, 2002) and psychosocial factors such as adverse life events resulting from deviant and risky behavior (eg, Clark et al, 1997) . Augmented impulsivity has been observed in a subfraction of alcoholic patients manifested by a dysfunctional preference of immediate vs delayed reward (Cloninger, 1987) and higher dispositional and behavioral impulsivity compared with healthy persons (Wrase et al, 2007) . In drug and alcohol-dependent patients, increased inability to resist the temptation of a smaller immediate reward instead of receiving a larger reward at a later date has repeatedly been observed (de Wit, 2009 ). In addition, personality traits of low harm avoidance and high novelty seeking are assumed to be associated with high impulsivity in alcohol-dependent subjects and modulated by dopaminergic as well as by serotonergic neurotransmission (Cloninger, 1987) .\nIn the present study, we aimed to identify the relative contribution of reward-related brain responses, personality traits as well as risk-taking behavior to predict early onset of drinking in a sample of healthy adolescents by applying factor analysis (FA) and structural equation modeling (SEM). In addition, we specifically examined the role of ventral striatal activation in the prediction of early drinking, since decreased activation in this brain region in response to non-drug rewards has been found in alcohol abuse (eg, Wrase et al, 2007) , and may thus represent a risk factor for the development of drug addiction (eg, Peters et al, 2011) ."}, {"section_title": "MATERIALS AND METHODS", "text": ""}, {"section_title": "Participants", "text": "In the Imaging Genetics (IMAGEN) study (Schumann et al, 2010) , a large sample of healthy adolescents was recruited from the general public via school visits, flyers and registration offices in Germany, the United Kingdom, Ireland, and France. In the present analysis, we examined a subgroup of 324 healthy volunteers (173 female) at the age of 14 years. Exclusion criteria were any mental disorder as defined by the Development and Well-Being Assessment (DAWBA; Goodman et al, 2000) , alcohol use disorder as defined by the Alcohol Use Disorders Identification Test (AUDITFzones III and IV; Saunders et al, 1993) , serious medical conditions, pregnancy, previous head trauma with unconsciousness, contra indications for magnetic resonance imaging (MRI) exams. The study was approved by the local ethics committees and adhered to the Declaration of Helsinki. After complete description of the study, written informed consent was obtained. We included all 324 subjects in the following data analyses since type of research center did not affect the results. This was tested using center site as a covariate in the functional MRI (fMRI) analysis or as a group factor in the analysis of psychometric or neuropsychological measures and by using a 'dropping one site' approach (Friedman et al, 2008) . An overview of all individual data is shown in Table 1a ."}, {"section_title": "Psychometric Testing", "text": "The Neuroticism-Extraversion-Openness Five-Factor Inventory (NEO-FFI) was used to assess broad dimensions of personality such as extraversion based on the Five-Factor Model of personality (Costa and McCrae, 1997) , and was supplemented by the novelty seeking scale of the Temperament and Character Inventory-Revised (TCI-R; Cloninger et al, 1991) . In addition, the Substance Use Risk Profile Scale (SURPS; Woicik et al, 1999) was employed to assess several personality risk factors for substance abuse/dependence and psychopathology."}, {"section_title": "Substance Use", "text": "Alcohol use was assessed by the AUDIT, which was also administered to the parents. Of the 324 adolescents in the study 128 (34 of their parents) scored 0 on the AUDIT and thus had never used alcohol whereas 196 adolescents (and 290 parents) reported the use of alcohol (score 40). Only subjects scoring in zones I and II were included in the current data analysis (for an overview of these data, see Table 1b ).\nSubstance use other than alcohol was assessed by the European School Survey Project on Alcohol and Drugs (ESPAD; Hibell et al, 2003) and the Fagerström Test for Nicotine Dependence (FTND; Heatherton et al, 1991) (for an overview, see Table 1c )."}, {"section_title": "Neuropsychological Testing", "text": "All subjects performed the Cambridge Gambling Task (CGT) from the Cambridge Cognition Neuropsychological Test Automated Battery (CANTAB; Cambridge Cognition), which assesses decision-making and risk-taking behavior outside a learning context. The subjects had to guess whether a yellow token was hidden in one box within different numbers of red or blue boxes. We used a modified version in which the time between stakes was reduced from 5 to 2 s to make the task shorter and more interesting for adolescents."}, {"section_title": "fMRI Paradigm", "text": "The Monetary Incentive Delay (MID) task (see Figure 1 ) used in the present study was an adaptation of the task from, for example, Knutson et al (2001) . It is a reaction time task that assesses how quickly the subject press a button with left or right index finger to hit a target (white square) that only appears for a short time on the left or right side of the screen. When subjects hit the white square in time, they score points. A preceding triangle indicates no points, a circle with one line 2 points and a circle with three lines 10 points to be won. For each of the three conditions (no win, small win, and big win), 22 trials were presented. The duration of the target was adjusted adaptively so that 66% of the trials produced a correct response. The subjects received one candy (M&M) for every five points. A short training period outside the scanner was carried out to establish a reaction time baseline and to enable reactions within the prescribed individual time window.\nTask presentation and recording of the behavioral responses were performed using Visual Basic 2005 with .NET Framework Version 2.0, and the visual and response grip system from Nordic Neuro Lab (NordicNeuroLab AS, Bergen, Norway)."}, {"section_title": "MRI Acquisition", "text": "Scanning was performed with a 3T whole body MRI system made by several manufacturers (Siemens, Philips, General Electric, Bruker) at the eight IMAGEN assessment sites (London, Nottingham, Dublin, Mannheim, Dresden, Berlin, Hamburg, and Paris). To ensure a comparison of MRI data acquired on these different scanners, we implemented image-acquisition techniques using a set of parameters compatible with all scanners that were held constant across sites, for example, those directly affecting image contrast or Determinants of early alcohol use in adolescents F Nees et al signal-to-noise and compliance was regularly tested (cf., Schumann et al, 2010 also for further tasks used in the study). We acquired 40 slices in descending order (2.4 mm, 1 mm gap) using a gradient-echo T2*-weighted sequence (EPI) with the following image parameters: TR ¼ 2200 ms, TE ¼ 30 ms, and an in-plane matrix size of 64 Â 64 pixels. We used a plane of acquisition tilted to the anterior-posterior commissure line (rostral4caudal). For anatomical reference, a 3D magnetization prepared gradientecho sequence (MPRAGE) based on the ADNI protocol (http:// www.loni.ucla.edu/ADNI/Cores/index.shtml) with TR ¼ 6.8 ms and TE ¼ 3.2 ms over the whole brain was carried out."}, {"section_title": "Data Analysis", "text": "Psychometric and neuropsychological measures. Psychometric and substance use data as well as behavioral data from the CGT were analyzed with analyses of variance (twotailed) using the Statistical Package for Social Sciences (SPSS) version 15.0 for Windows.\nfMRI analysis. The fMRI data were analyzed with Statistical Parametric Mapping (SPM8, Wellcome Department of Imaging Neuroscience, University College London, London, UK). All individual data were slice time corrected using the first slice as reference, then spatially realigned to correct for head movement, and non-linearly warped on the MNI space using custom EPI template based on an average of mean images of 400 adolescents. This custom template image (53 Â 63 Â 46 voxels) was subsequently applied to all functional T2* data and voxels were resampled at a resolution of 3 Â 3 Â 3 mm. The functional data were smoothed using an isotropic Gaussian kernel for group analysis (5 mm full-width at half-maximum). First level statistics were performed by modeling reward anticipation and reward feedback as predictor variables within the context of the general linear model on a voxel-by-voxel basis, with AR noise model against a design matrix. Estimated movement was added to the design matrix in the form of 18 additional columns (3 translational, 3 rotations, 3 quadratic and 3 cubic translations, 3 translations shifted 1 TR before, and 3 translations shifted 1 TR later). A movement threshold of 2 mm was employed. Furthermore, each individual fMRI time series underwent an automatic spike detection method. The spike detector algorithm uses a mean-squared based metric to identify unexpected values temporally and spatially slice per slice. We differentiated reward magnitudes of no win, small win, and big win as subject-specific regressors of interest. The individual contrast images were subsequently included in a second level random effects analysis using the full flexible procedure of SPM8. The problem of nonindependent data within subjects as well as error variance heterogeneity was addressed by performing a non-sphericity correction. We chose a significance level of po0.001 (family wise-error (FWE) corrected), with a minimum cluster size of 20 voxels. Given the established literature (see, eg, Knutson et al, 2001) , the analyses focused on weighted mean BOLD signal change of designated regions of interests over hemispheres for anticipation big vs small win (insula, amygdala, prefrontal cortex, orbitofrontal cortex, nucleus accumbens, anterior cingulate cortex, putamen, nucleus caudatus, thalamus, and cerebellar vermis) using probabilistic anatomical masks (Nielsen and Hansen, 2002 ) that were thresholded with a fractional intensity of X0.5.\nExploratory FA. We employed an unconstrained exploratory FA using an orthogonal rotation to uncover the underlying structure of the set of neural (insula/amygdala/ prefrontal cortex/orbitofrontal cortex/nucleus accumbens/anterior cingulate cortex/putamen/nucleus caudatus/ Determinants of early alcohol use in adolescents F Nees et al thalamus/cerebellar vermis), personality (novelty seeking/ impulsivity/sensation seeking/extraversion), and behavioral (delay aversion/risk adjustment/risk taking) variables used in the present study, based on the a priori assumption that any indicator may be associated with any factor. We applied both the Kaiser criterion with eigen values 41 and the scree test to determine the number of factors. With the confirmed factors, the relationship among the latent variables was tested in the structural model (two-step method according to Kline, 2005) .\nStructural equation modeling. We used LISREL (Scientific Software International, Lincolnwood, IL) for Windows (Microsoft) to perform SEM. The path models of the present study depended on a theoretically based a priori framework restricted to differing aspects of reward processing including anticipation-related responses in distinct brain regions, behavioral responses (risk taking, risk adjustment, and delay aversion), and personality traits (novelty seeking, sensation seeking, impulsivity, and extraversion). Based on findings that reward sensitivity was also shown to be associated with alcohol-related responsivity (eg, Franken, 2002) and on a clinical perspective, we used adolescents' alcohol use as dependent variable in the SEM-based prediction models. We applied the following model exclusion criteria in the SEM analyses: (a) failure to converge after 240 iterations, (b) a parsimonious goodness of fit (PGFI) o0.10, (c) a squared multiple correlation exceeding 1, (d) a probability of close fit p0.05, which includes a root mean squared error of approximation (RMSEA) significantly differing from 0, and (e) reconstruction errors (values other than 1 along the correlation matrix diagonal). We then ranked the models from lowest to highest RMSEA, the highest to lowest goodness of fit (GFI), including more conservative adjusted GFI (AGFI) and PGFI estimates. In addition, we examined the specific contribution of the ventral striatum and parental alcohol use to adolescents' alcohol use."}, {"section_title": "RESULTS fMRI Data", "text": "Whole brain activation in response to big vs small win during the anticipation phase is shown in Figure 2 based on the ROI analysis listed in Supplementary Table S1 (see Supplementary data). We found significant responses in striatal regions, prefrontal cortex, insula, amygdala, cerebellar vermis, and thalamus."}, {"section_title": "Factor Analysis", "text": "Bivariate correlations of all variables used in the present study are shown in Supplementary "}, {"section_title": "Structural Equation Modeling", "text": "Latent prediction model I. The resultant model (see Figure 3 ) exhibited the prediction of early onset of drinking by a sum of variables grouped into three latent factors representing neural brain responses, personality, and behavior. The normed fit index (NFI) and the comparative fit index (CFI) of this model reached the values of 0.94 and 0.96, respectively. The latent factors of brain regions (explained variance ¼ 0.4%), personality (explained variance ¼ 16%), and behavior (explained variance ¼ 0.6%) are weighted differently, with personality clearly revealing the highest contribution to adolescents' alcohol use. There is strong evidence that the model fits the data well, with R 2 ¼ 0.17 indicating a relatively high proportion of explained variance.\nLatent prediction model II. The resultant model (see Figure 4 ) exhibited the prediction of early onset of drinking by a latent factor structure in which the factor of personality traits (explained variance ¼ 16%) was used to indirectly predict alcohol use via factors of neural responses in brain regions and behavioral responses. The NFI and the CFI of Brain activation in response to big win vs small win during the Monetary Incentive Delay (MID) anticipation phase (Appetitive and consummatory stages of reward processing could be assumed to involve qualitatively different affective phenomenology. As the anticipation of reward represents a period, during which subjects associate predictive cues with subsequent outcomes, resulting in a basis of reward processing and thus might be represent more adequately reward sensitivity. Thus, in the Results we will only focus on big vs small win during the MID anticipation phase.) (po0.001, family wise-error (FWE) corrected, cluster 420 voxels, N ¼ 324). "}, {"section_title": "Determinants of early alcohol use in adolescents", "text": ""}, {"section_title": "Determinants of early alcohol use in adolescents F Nees et al", "text": "The ventral striatum or parental alcohol use alone were by themselves not significant predictors with 0.1 and 0.4% of explained variance, respectively. We did not find gender differences, neither in any of the variables used in the present study nor in the applied FA and SEMs."}, {"section_title": "DISCUSSION", "text": "The aim of the present study was to identify the interplay and relative contribution of brain responses and different measures of personality and behavior related to reward sensitivity in the prediction of early onset of drinking, which might be a risk factor for later substance abuse, in a sample of healthy adolescents. Using FA and SEM, we showed that reward-associated brain responses, behavior, and personality are related, yet weighted differently in the best-fitting model of alcohol use in adolescents, with personality explaining more variance than behavior and brain responses. The ventral striatum alone explained a small non-significant proportion of the variance in early drinking behavior.\nMany studies focused on the neural underpinnings of reward processing. However, both psychological and biological mechanisms may affect these processes and should be taken into account for a complete understanding of reward processing and sensitivity. This is especially important during adolescence, a period that is characterized by a normative increase in risk-taking behavior, and during which the onset of substance abuse has often been observed. Recent studies suggest that risk for alcohol abuse is conveyed by a biologically based trait of reward sensitivity (Franken et al, 2006) . Sensitivity to reward has been shown to be associated with a stronger physiological response to alcohol intake as well as an increase in conditioned responses to alcohol cues (Brunelle et al, 2004) . In addition, early initiation of alcohol intake was found to be associated with an elevated risk for the development of alcohol use disorder (Behrendt et al, 2009) , specifically in adolescence, since this period was characterized as a high risk period for first alcohol use and the transition to alcohol abuse and dependence (Wittchen et al, 2008; Swendsen et al, 2009 ).\nThe present results reveal a contribution of personality, behavior, and neural responses in reward-related brain regions to adolescents' alcohol use that not only appear consistent with previous research, but also, based on recent findings, bring reward-related factors together by highlighting their role in a structural framework. Personality, and specifically temperament as well as cognition guide human behavior, and have been associated with reward processing and have a major contribution to the development of substance use. Both sensation seeking and novelty seeking have been shown to be associated with drug use and to mediate the relationship between pubertal development and drug use behavior (eg, Martin et al, 2002) . A link between dispositional novelty seeking and the mesocortical dopamine system has also been proposed and personality traits of reward dependence and extraversion have been linked to differences in reward sensitivity. They have been associated with increased connectivity between the striatum and prefrontal cortex (Cohen et al, 2009 ) and dopamine functioning (Lucas et al, 2000) .\nAt present, little is known about the relative contribution of neurobiological and psychosocial factors that may predispose toward increased risk-taking behavior such as alcohol use and thus may increase the risk for later development of alcohol use disorder during adolescence. The present study is a first step in closing this gap by addressing an integrated approach that includes several reward-related variables that were assessed in a large sample of healthy adolescents. The latent prediction models revealed a stronger contribution of personality, including extraversion, impulsivity, novelty seeking, and sensation seeking, to the prediction of early onset of drinking compared with reward-related behavior, or brain responses. Furthermore, a model in which personality indirectly predicted alcohol use via behavior and brain responses revealed a higher proportion of explained variance compared with a model in which all factors were weighted equally. It revealed a stronger contribution of personality to the prediction of behavior compared with brain responses and, based on this association, a stronger contribution of behavior to the prediction of early onset of drinking compared with neural responses. In addition, the contribution of personality to brain responses was even found to be negative. Although most of the previous research reported positive associations of, for example, impulsive personality with brain activation during reward (eg, Villafuerte et al, 2011) , our present findings fit with and extend some studies that, for example, observed a negative association of impulsivity with neural activation during anticipation of reward vs baseline in individuals with an alcoholism family history (eg, Andrews et al, 2011) or during reward vs no reward in adolescent smokers (Peters et al, 2011) . In addition, a significantly higher risk for problematic alcohol use in children and adolescents is associated with a parental history of alcoholism (Schuckit and Smith, 1996) ; however, when only parental alcohol was used, a small nonsignificant contribution to the prediction of early alcohol use was found. Thus, a contribution of parental history of alcoholism might be relevant at later stages. The present results are in line with findings that personality dispositions can account for a large proportion of variance in motivational behavior and are predictive of differences in neural processing of emotional stimuli (eg, Caseras et al, 2006) . Several studies have also shown an association between personality (eg, impulsivity or extraversion) and reward processing (Cohen et al, 2005; DeYoung et al, 2010; Lotfipour et al, 2009; Tobler et al, 2007) . The fact that personality accounts for more variance in alcohol use compared with behavior and brain responses can also be discussed in the light of state-trait effects, as brain and behavioral variables are assumed to be more context specific compared with personality variables. However, the MID task shows a fairly high test-retest reliability of relevant brain areas during reward processing (Fliessbach et al, 2010) , specifically in the right striatum in response to alcohol cues in alcohol-dependent patients (Schacht et al, 2011) . In addition, behavioral variables such as risk taking (White et al, 2008) and delay discounting (Ohmura et al, 2006) were also shown to be relatively stable. Although none of these studies investigated the same tasks used in the present study, they report adequate test-retest reliabilities of risk taking and reward processing and thus indicate that Determinants of early alcohol use in adolescents F Nees et al our present results might not be dependent on differences in reliability between measures. In addition, one might argue that specific behavioral variables or brain responses rather than the combination of several variables representing different constructs might explain more variance in early drinking onset. For example, risk seeking was shown to be associated with increased risk for relapse (eg, Goto et al, 2009 ) and might be a vulnerability factor for substance abuse. In addition, previous studies reported a dysfunction in reward-related brain regions such as the ventral striatum in addiction, with decreased activation in response to non-drug rewards (eg, Wrase et al, 2007) . However, the present data show that neither risk taking (explained variance ¼ 0.1%) nor activation in the ventral striatum in response to reward anticipation during the MID task (explained variance ¼ 0.1%) significantly contributed to alcohol use in adolescents, while the personality traits of novelty seeking (explained variance ¼ 13.2%) and impulsivity (7.4%) did. This suggests that different factors might operate on the initiation of early drinking vs later development of alcohol abuse that might only be partially interrelated. Specifically, differential activation in reward-associated brain regions may be related to specific factors such as family history of alcohol abuse (eg, Andrews et al, 2011) , which might then result in a higher risk for the development of a substance abuse disorder. In addition, this might be different for different substances used, since for example a recent study discussed activation in the ventral striatum in response to reward anticipation as a vulnerability factor for early nicotine abuse (Peters et al, 2011) . Furthermore, neural response to reward anticipation might be related to a very specific level of early alcohol use, only, than predicting early drinking per se.\nThe present study found a contribution of personality (extraversion, impulsivity, sensation seeking, and novelty seeking), behavior (risk taking, risk adjustment, and delay aversion), and neural response (activation in reward-related brain regions in big vs small reward) to characterize early onset of drinking, a combination that might represent reward sensitivity in adolescence. While SEM models that included only some of these factors demonstrated poor fit or explained a lower proportion of variance in predicting early alcohol use, the two models that showed the best fit and highest proportion of explained variance were those indicating the importance of an integrated concept of reward sensitivity in adolescence. This is in accordance with findings from studies by MacPherson et al (2010) as well as by Gullo et al (2010) that proposed a complex relationship between alcohol use and psychological variables. Following the present findings, risk for early onset of drinking may be mediated by various aspects on a psychological and neurobiological level, with a quite high proportion of explained variance (ie, up to 26%). Since early initiation of alcohol intake, even at very low levels of alcohol use, was found to be associated with an elevated risk for the development of alcohol use disorder (Behrendt et al, 2009) , this might represent a risk factor for later development of alcohol addiction. In addition, although the number of subjects scoring in zone II in the AUDIT was very small, our data also suggest that problem drinking may be differentially mediated by personality, behavioral, and neural responses.\nThe present study results should be interpreted in the light of some limitations. Since IMAGEN is a multi-center study, between-site differences for particular fMRI tasks might have affected the present results. Using center site as covariate and a 'dropping one site' approach the issue of betweensite comparability was largely controlled for. Although we examined a number of different personality, behavioral, and brain response variables, representing distinct reward-related phenomena, some further variables may also be important in reward sensitivity and may contribute to the prediction of alcohol use in adolescence. Furthermore, we used a specific set of instruments to assess personality traits, risk-taking behavior, and brain response. These measurement approaches have been shown to be reliable and stable, but it is conceivable that different effects might emerge with different measures. In addition, one might argue that both sensitivity to reward in general as opposed to sensitivity to magnitude of potential reward more specifically and receipt of reward might be more important and might result in greater predictive value in brain response in both latent prediction models. However, further analyses on this topic did not corroborate this assumption. Furthermore, the strength of correlation between all variables used indicates stronger correlations between the different regions of interest constituting the factor of brain responses compared with personality or behavioral variables. Although these correlations are in a range acceptable for SEM, the underrepresentation of reward-related neural responses might be at least partly based on these interactions. Furthermore, novelty seeking compared with impulsivity, extraversion, or sensation seeking is more strongly involved in constituting the factor of personality. This might lead to the assumption that the influence of personality is based on novelty seeking only. However, the exclusion of one or up to all of three other variables resulted in a decrease of the proportion of explained variance. Finally, the use of drugs other than alcohol might also have a role in early onset of drinking. However, since the number of subjects for each of the other substance groups was relatively small, we did not include these data in the current analysis.\nIn sum, the present study revealed that behavior, personality, and reward-associated brain response are related and contribute to early alcohol intake, yet are weighted differently, with personality explaining more variance than either brain responses or behavior. With up to 26% of explained variance, this interrelation of personality traits, behavior, and neural response patterns may convey risk for later development of alcohol addiction. Although further confirmation is necessary, the present results suggest that phenotyping on a combined neurobiological and psychosocial level can improve the understanding and assessment of risk for alcohol-related problems. Based on findings of a relationship between reward-related personality traits, brain functioning, and genetics (eg, Cohen et al, 2005) , future research should also address the role of genetic factors such as dopamine or serotonin receptor genes in models of alcohol use in adolescence. "}, {"section_title": "DISCLAIMER", "text": "This manuscript reflects only the author's views and the Community is not liable for any use that may be made of the information contained therein."}]