[{"section_title": "Abstract", "text": "Hourly sea level is examined at 25 open-ocean stations in the Pacific Ocean with records longer than 30 yr. A search for trends finds that the amplitude of the dominant semidiurnal tide M 2 is increasing at 12 of the 13 sites where a statistically significant trend can be identified. It is also found that nontidal variance in the neighborhood of M 2 is decreasing at all 12 of the sites where a significant increase in M 2 tide is occurring. The trend in amplitude of the dominant diurnal tide K 1 is significant at six stations, and it is both increasing (four stations) and decreasing (two stations). The trend in semidiurnal-band variance suggests the hypothesis that increases in M 2 could be caused by improvements in time keeping or data processing that would reduce the apparent phase variability of the tide. This possibility is examined and found to be the likely explanation for tidal trends at four stations. Local changes are found to explain the trend at two stations, Johnston Island and Mokuoloe, as diagnosed from correlated changes in nonlinear overtides and site history. Changes in M 2 at the equatorial station of Kanton are significant and unexplained by either timing errors or local morphodynamics; although, strong nonlinear overtides are present. Changing tides at five stations in the western Pacific, Malakal, Yap, Saipan, Kapingamarangi, and Pohnpei cannot be explained by the above and suggest a region where a connection between climate and tides may yet be identified."}, {"section_title": "Introduction", "text": "Changing tides have been documented in long water level records at a variety of sites around the globe (Doodson 1924; Bowen 1972; Cartwright 1972; Amin 1983; Flick et al. 2003; Ray 2006; Colosi and Munk 2006; Jay 2009; Woodworth 2010; Müller 2011; Müller et al. 2011) . At some of these sites, rate of change in tidal range is a significant fraction of the rate of mean sea level rise and may exacerbate impacts of the latter (Flick et al. 2003) . However, to assess the long-term significance of the tidal contribution to changing extremal water levels, it is important to understand its cause and determine whether it represents a secular or short-term trend relative to other climate processes.\nA range of physical processes can cause changes in the tides, beyond the predictable variation due to the astronomical tide-generating force. For example, local changes in harbor morphology and channel depth can impact tides via kinematic effects that alter the current, and these changes in currents may lead to dynamic effects via the bottom drag, which is quadratic in current strength (Jay 1991) . Thus, a decrease in total current can lead to overall reduction in drag and consequent increase in tides (Kukulka and Jay 2003) . Harbor modifications can also directly alter drag elements such as sand grain sizes, bed forms, or other macroscale drag elements (e.g., groynes), which may influence tides. Changes in river discharge can have a similar impact on current speeds and drag, but they can also alter the stratification within a harbor or estuary, thus altering its frictional and hydraulic characteristics (Cudaback and Jay 2000) . This paper is motivated by an interest in tides distant from the direct influence of harbor or measurement site changes. In the open ocean, it has been hypothesized that tidal changes are occurring on a basin or amphidrome scale in response to changing climate processes (Jay 2009 ). For example, secular changes in tidal mixing along the continental shelves or other regions might have a back effect on basin-scale oscillations (Arbic and Garrett 2010; Arbic et al. 2009 ). Such changes might result from changing seasonal ice cover, stratification (Müller 2012) , water depth (Müller et al. 2011) , or the harbor-scale processes mentioned above. Secular change in the nontidal general circulation could also contribute by altering the effective potential vorticity gradient the tide propagates through, thus changing the dispersion relation of the long ocean waves. There is interest in examining the observational record to see which processes, if any, might be inferred from changing tides. One hope is that low-frequency, climate-scale fluctuations could be inferred from tide gauges, an observing system that was designed to measure highfrequency stationary processes such as tides, storm surges, and so on (Munk et al. 1965) .\nIn a search for the causes of tidal trends in the open ocean, we examine hourly seas level at 25 open-ocean stations in the Pacific Ocean with records longer than 30 yr. The gauges are located throughout the tropical and equatorial Pacific and have been selected to be well removed from coastal harbors and river inputs where one expects local effects to dominate. Analysis of the records finds that, on average, the dominant diurnal and semidiurnal tides are increasing; however, an unexpected inverse relationship is found between the rate of secular change and the uncertainty of the corresponding harmonic constants. This leads to a careful assessment of statistical significance and a study of nontidal residuals to assess to what extent apparent changes in tides can be explained by long-term improvements in tide measurement, specifically, in time keeping. It is concluded that the secular changes in tides can be explained partially or completely by improved time keeping at five sites. An interesting aside is that changes in nonlinear overtides can be correlated with site histories at two stations, which highlight the fact that site-specific changes, similar to those occurring at coastal tide stations, can occur even at these nominally open-ocean sites. Five stations are identified where secular change in the tide cannot be explained by the above mechanisms. We conclude that while tidal change may be correlated with climate changes at specific sites and over specific time periods (e.g., Devlin et al. 2013 , manuscript submitted to Ocean Dyn.), significant basinwide secular change is not found in the tropical and equatorial Pacific."}, {"section_title": "Data and methods", "text": "Tables 1 and 2 list the hourly water level records used in this study, sorted by station longitude, which have been obtained from the research-quality archive at the University of Hawaii Sea Level Center (UHSLC; http://uhslc. soest.hawaii.edu/). Some stations duplicate those used in Woodworth (2010) . All records span 30 yr or more, although missing data at some stations reduces the number of years analyzed to fewer than 30. In some cases, subrecords from the UHSLC archive were used, as indicated by the notation A, B, or C following the station names in the tables. In the cases of Kanton and Christmas Islands, the A and B subrecords were concatenated, as there was good agreement between tides and mean sea level in both subrecords. With exceptions to be discussed later, the station data are sufficient to unambiguously separate secular changes, here defined as a linear trend, from the 18.6-yr nodal cycle.\nThe stations are located throughout the North and South Pacific; although, a disproportionate number are located on the Hawaiian Islands, and there are only three stations to the east of 2108E (Fig. 1) . The stations were selected from the UHSLC holdings based on the length of the time series at each site and on their location away from continental shelves and coasts. All of the stations are nominally ''open ocean'' sites, but the placement of the gauges with respect to local topography varies considerably. For example, the Kwajalein, Midway, Johnston, Wake, and Kanton stations are located on atolls. Tide gauges at atolls are generally sited within the partially enclosed lagoon forming the atoll, the exceptions being Wake and Kanton, where the gauges are located on the ocean-facing side of the atoll. Another subset of stations is located within harbors, for example, Malakal and Saipan. Differences among the * Indicates trend significant at the p value ,5% level.\nstations are apparent when frequencies of nonlinear overtides and island-trapped modes are examined, and each station could be the focus of its own descriptive study. The present contribution emphasizes sea level variance in the diurnal, semidiurnal, and overtide bands. The analysis is based on a series of year-by-year least squares harmonic analyses of hourly records at 60 frequencies separable from a 1-yr record based on the Rayleigh criterion (Foreman 1977) . Additional lowfrequency variance is removed by including mean water level, annual, and semiannual terms in addition to the lunisolar tides. Harmonic analysis is not performed when a station contains more than 15% missing data in a given year. Analysis for secular trends is restricted to the dominant semidiurnal (M 2 ) and diurnal (K 1 ) tides. Harmonic constants for the nonlinear overtides, MK 3 , M 4 , and MK 6 , are significant at several stations and are reported where relevant.\nUncertainty in the harmonic constants is computed using the standard least squares estimate that uses the product of the inverse of the normal matrix and the nontidal variance within a Rayleigh bandwidth (Pawlowicz et al. 2002; Foreman et al. 2009 ).\nAttributes of the nontidal residual prove to be crucial to interpreting the trends in the main tidal lines. A Lorentzian model for the high-resolution residual spectrum near the tidal lines, determined from multiyear records, is used to infer the autocorrelation time of tidal modulations (Colosi and Munk 2006) and distinguish between oceanic and instrumental variability. Tidal variability on shorter, submonthly time scales is analyzed by performing a response-type analysis (Munk and Cartwright 1966) in which tidal modulations are represented as amplitude and phase perturbations relative to the predicted tide. The Lorentzian spectral fitting is useful for determining long, time average characteristics in the spectral domain, while the response-type analysis is useful for identifying specific events in the time domain. Together the approaches provide complementary views of tidal change and assist in identifying its likely causes."}, {"section_title": "Summary of trends", "text": "The results of harmonic analysis are summarized in Tables 1 and 2 . Among the 25 open-ocean stations analyzed, the amplitude of M 2 is apparently increasing at 18 sites. At 12 of these sites, the rate of increase is statistically significant at the p 5 0.05 significance level. Statistical significance is estimated using a Student's t test applied to the coefficients of the regression of the tidal amplitude on a function consisting of the nodal modulation plus a trend, and p is the probability of no secular change, given the observed rate. Averaged over all the stations, the rate of increase is 14 mm century 21 .\nThe amplitude of K 1 is increasing at an average rate of 1.4 mm century 21 (Tables 3 and 4) . Four stations are increasing, and two are decreasing, at the p 5 0.05 significance level. Note that there is a single station with a statistically significant decrease in M 2 amplitude, Easter Island, but its record shows some anomalies, which are discussed below. To examine the possibility that an amphidromic-scale change is occurring, the secular trend at each site is illustrated by plotting a displacement vector equivalent to a 5-century change in the harmonic constants, assuming constancy of the observed rate. The displacement vector is computed from the gradients of the in-phase and quadrature components of the tidal fields of the TPXO7.2 data-assimilative tidal model (Egbert and Erofeeva 2002, 2010) , which agree closely with tides measured in the open ocean (Ray 2013) . The displacement vector (dl, du) and the observed rate of change of the in-phase (real) and quadrature (imaginary) components (dR o , dI o ) are related by\nwhere R and I are the in-phase and quadrature fields from TPXO7.2, (l, u) are geographic longitude and latitude, and DT 5 5 centuries. Note that tidal amplitude A and in-phase and quadrature parts are related by\no , so the rate of change in amplitude DA/T in Tables 1-4 is given by\nThe displacement vectors (dl, du) are displayed on the cotidal chart in order to exhibit the relationship of the secular changes to the mean tidal fields. Changes in the M 2 harmonic constants ( Fig. 2 ) are broadly consistent with an amplification of the amplitude maxima (antinodes) in the western and westcentral tropical Pacific. But the absence of amplitude trends at Guam, Chichijima, Wake, Kwajalein, and Pago Pago, where gradients in the tidal fields are relatively large, suggests that a translation or amplification of the Similarly, trends in K 1 harmonic constants are apparently not related to the underlying tidal fields (Fig. 3) . The western Pacific stations, Malakal, Yap, Guam, and Kapingamarangi, display changes consistent with a clockwise rotation of phase within the western antinode; Midway, French Frigate Shoals, and Hilo are consistent with a clockwise rotation of the phase associated with the northeast antinode, but there is no consistent relation to changes around the central amphidrome at 208N, 1708E.\nAccompanying the secular trend in amplitude, there is a trend in the uncertainty of the harmonic constants. At 22 of 25 stations, the uncertainty of the M 2 harmonic constants is decreasing (last column of Tables 1 and 2) . For K 1 , the same trend occurs at 14 stations (last column of Tables 3 and 4). Kendall's tau, a measure of rank correlation (Conover 2001) , is used to assess the relationship between secular trend in tidal amplitude and uncertainty in the harmonic constants (Fig. 4) . The correlation is t 5 20.32 for K 1 , a value significant at the Vectors from each station (red) are oriented with respect to the gradient of the TPXO7.2 tidal fields to illustrate the change in observed tide if the secular trend continues for 500 yr, based on the first-order approximation to the displacement in Eq. (1). In other words, the vectors connect two values on the cotidal chart: the present observed value and the future predicted value based on the observed rate of change. Fig. 2 , but for the secular change of K 1 interpreted as station displacement. p 5 0.03 level. The correlation for M 2 is t 5 20.21 (p 5 0.14), but if the Easter Island station (Easter C) is omitted the correlation is much more significant, t 5 20.43 (p 5 0.003). In fact, omission of Easter Island is justified: while it contains 37 yr of data, only 24 yr are more than 85% complete, and the amplitude trend is strongly influenced by a single year of data (1981) that falls within a series of 7 yr that contains, on average, 41% data coverage. Thus, we find that secular increases in tidal amplitude (DA/T) are associated with secular decreases in uncertainty of the harmonic constants (Ds/T)."}, {"section_title": "FIG. 3. As in", "text": "The apparent relationship between trends in harmonic constants and their uncertainty is intriguing, and our working hypothesis is that an explanation for the trends in uncertainty will contribute to explaining the trends in the tides. For a given analysis window, the uncertainty in a harmonic constant is determined by the character of the sampling, that is, the number of independent samples (more samples reduces noise variance) and the total length of record (which determines the Rayleigh bandwidth), and the amount of residual variance within a Rayleigh bandwidth of the tidal line. The residual variance may be attributed to measurement noise (instrumental error), nontidal oceanographic variability (including the variance in tidal lines excluded from the harmonic analysis), and nonstationary tidal variability (such as might be caused by nonstationary internal tides).\nHaving identified these possible factors, the remainder of this paper deconstructs the tidal record at each of the 18 sites where a secular increase in M 2 amplitude is observed. The analysis is guided by the hypothesis that the majority of the secular changes can be explained by improvements in measurement, primarily time keeping, which lead to apparent decreases in the nonstationary tidal signal in the records. We shall see that this hypothesis is supported in a few instances; a closer look at the tidal records is necessary to explain the situation."}, {"section_title": "Methods for detecting nonoceanographic causes of changing tides", "text": "The measurement of sea level for the determination of tides is based on the recording of water level at regular time intervals at fixed sites. The tide gauges used for this purpose typically consist of a partially submerged cylinder of length sufficient to accommodate the complete range of observed sea levels without either emptying or overflowing, which is open to the atmosphere at the top and which is enclosed at the bottom except for an orifice that allows water to enter and exit the cylinder. This cylinder, the stilling well, is a mechanical filter designed to reduce the influence of high-frequency surface waves on the water level within the cylinder, owing to the reduced diameter of the orifice compared to the diameter of the cylinder itself. In addition to the stilling well, the gauge must provide a means to measure and record the water level and a clock to record the time of the observation (Ainscow et al. 1985 (Ainscow et al. , 1994 .\nOver time, changes have occurred in water level measurement, time measurement, data recording, data reduction, and calibration techniques, and these changes can influence the accuracy of the tides inferred from the gauge. Could errors in time keeping, either random timing errors or corrections to fix identified clock errors, explain trends in tides? To assess this possibility, it is necessary to understand how the tide gauges were maintained and how time keeping has changed over time.\nFor the National Ocean Service (NOS)/National Oceanic and Atmospheric Administration (NOAA) National Water Level Observation Network (NWLON) stations, analog-to-digital recorders (ADR) gauges were used from the late 1960s to the mid-1990s, however, the exact transition date in gauge technology was variable, depending on the station. ADR gauges used batterypowered solid state timers. The NOAA NWLON gauges were set to record water levels every 6 min. Prior to ADR gauges, NWLON stations used analog strip-chart recorders with spring-wound clocks for timing that were maintained and adjusted as required by local tide observers hired to maintain the station. ADR gauge data were adjusted/corrected for timing errors by the local tide observers or later during translation into the computer database. Timing corrections were generally made to the nearest 6 min. The present NWLON Next Generation water level gauges, used after the mid-1990s, contain clocks that are synchronized by global positioning system (GPS) satellites, and time-keeping accuracy is no longer a concern.\nThe nominal precision of recorded time for ADR gauges is 66 min; however, some stretches of data will have more uncertainty depending on how badly the clocks were malfunctioning so timing uncertainty could be as high as 612 min. Tide observers at NWLON stations generally visited stations around 4 days per week to check and adjust the time and to make tide staff observations. On a monthly basis, data processors would check for clogging and timing errors based on comparative readings of tide observer data and gauge data. Data from obviously clogged gauges were generally rejected at this stage or after subsequent comparison with predicted tides, backup sensor data, or nearby station data.\nUHSLC stations used Fisher-Porter and LeupoldStevens punch tape gauges, and the timing interval was 15 min. Nearly all of UHSLC's stations, like NOS stations, employed observers who made regular visits to the stations. They were to take staff readings, make time marks on the punch tape, and assess the operation on the gauge. Staff reading, date, time, battery voltage, and other notes, such as gauge problems and station maintenance, were written on log sheets. Generally, punch tapes were removed monthly and sent to UHSLC, along with the staff log sheet. Timing corrections could be made in the field by the observer, by the technicians during a site visit, or during data processing in the office. In the office, monthly processing of the punch tape included plotting the observed data and residual (observed minus predicted), which was useful to detect data issues. When timing problems occurred that could not be easily resolved using the observer time marks on the tape, predicted data were used to attempt to correct the timing. Because the timing interval of the ADR data was 15 min, timing drifts between 7.5 and 15 min could result. Fortunately, the UHSLC has compiled metadata associated with each station in the research-quality data archive, and it is possible to assess some of these factors when analyzing data from a given station.\nIn summary, the Pacific stations considered here used analog gauges before the early 1970s, after which they used ADRs and, finally, all-digital systems in the 1980s and early 1990s. Time keeping evolved from spring-wound clocks to battery-operated clocks and, finally, to satellitebased clocks (Lombardi and Hanson 2005) . Nominal time-keeping accuracy has improved from 12-min to microsecond precision.\nAs will be shown in section 5, the reduction in s is due almost entirely to a reduction in residual variance within the near-tidal continuum or ''cusp'' spectrum, rather than due to a reduction in the total residual variance. We consider the possibility that time-keeping errors are significant. Note that time-keeping error referred to here includes errors and processes that interfere with an accurate measurement of tidal phase, which includes unknown clock errors per se, retroactive timing corrections, and clogged stilling wells. Errors in time conversion from the local time zone to UTC were not uncommon in these records; however, as these were generally 1 /2 h or whole hour increments, it is believed that time zone conversion errors have been corrected and eliminated (P. Caldwell, UHSLC, 2012, personal communication; Luther and Wunsch 1975) .\nConsider first the possibility that clock errors were identified and retroactively corrected by linear interpolation. Suppose the given time series h(t i ) were linearly interpolated to a new seriesĥ(t i ) at evenly spaced time increments t i 5 iDT 5 t i 1 dt i . Lett i21 ,t i , andt i11 be the three time points closest to the corrected time t i . The interpolated time series is given bŷ\nwhere a i 5 dt i /Dt i ' dt i /Dt. Because of the dependence on the sign of a i , the interpolant is only first-order accurate. Assuming h(t i ) and dt i are uncorrelated, one may derive the following expression for the variance ofĥ:\nwhere a and a 2 are the first and second moments of the absolute value of a i , angle brackets denote expected value, and r(Dt) is the cross correlation of h(t) at lag Dt. If the signal of interest is sinusoidal at the M 2 frequency, the fractional reduction in variance will be\nwhere it has been assumed that a 2 a. For a timing error of 6 min in hourly data, a 5 0:1 and v M 2 Dt 5 0:5, so the reduction in variance would be 2.6%. For example, at a station where A M 2 5 0:12 m (e.g., Midway), if the mean absolute timing error were reduced from 6 to 0 min over a 25-yr period, the secular rate of increase of the apparent tide would be DA M 2 /T 5 5:2 mm century 21 .\nAlternately, suppose there was an uncorrected timing error,ĥ(t) 5 h(t 1 dt). Modeling the timing error as a Gaussian phase error leads to the following estimate for the reduction in variance (Colosi and Munk 2006) :\nwhere u 2 is the variance of the M 2 phase error, u 5 v M 2 dt. The apparent rate of change in the tidal amplitude may be expressed in terms of the rate of change of the phase error variance:\nwhere higher-order terms in u 2 have been omitted. As an example of the size of the effect, assume that a random timing error with 15-min standard deviation is reduced to 0 min over a 25-yr period at a station where the mean tidal amplitude is A M 2 5 0:12 m; the expected rate of increase in tidal amplitude would be DA M 2 /T 5 2:1 mm century 21 .\nThe above-estimated tidal constituent growth rates are presented to demonstrate the importance of timing errors and the size of the effects. Our initial hypothesis was that the only plausible explanation for systematic decreases in s A was improvements in the stability of time keeping at the stations. An attempt was made to directly infer timing errors from annotations on comparative readings logs archived by the NOS. While there was some correlation between the uncertainty of the harmonic analysis and annotations on the forms (see the appendix), results were not precise. Because the timing errors are unknown, it is difficult to quantify the precise role they may have played in the apparent secular change in tides, and one must infer processes from the nontidal residual.\nTwo approaches were used to infer timing errors from the water level records. The first approach was based on fitting a Lorentzian model of line spreading around the major tidal constituent lines, generalizing the approach used by Colosi and Munk (2006) to study modulations of the baroclinic tide at Honolulu. In this approach, the amplitude of the Lorentzian is directly related to u 2 and s A , and the bandwidth of the Lorentzian is directly related to the correlation time of the phase modulation. In a few cases this approach yielded an unambiguous estimate of the correlation time, on the order of 30-60 days, consistent with the hypothesized time scale of correlated clock errors. However, application of this method requires high-resolution residual spectra, that is, analysis windows of 5 yr or more, and it yielded unstable results due to interference from multiple constituents. This approach was ultimately abandoned in favor of the following.\nThe second approach used to infer timing error is based on an adaptation of the response method to identify modulations across the diurnal and semidiurnal bands within short, 5-day records. The method involves representing water level as a linear combination of lagged versions of the predicted tide (computed from harmonic analysis of a 1-yr record) in order to estimate an amplitude and phase anomaly with respect to the mean tide (Munk and Cartwright 1966) . By using five values of the lag at 3 h increments, from 26 to 16 h, the phase and amplitude modulations obtained are approximately linear functions of frequency within the diurnal and semidiurnal bands. Because instrumental phase error will affect both the diurnal and semidiurnal frequency bands, leading to correlated phase modulations, the demodulation technique is designed to detect smooth, but independent modulations of the diurnal and semidiurnal bands. The method is suitable for identifying correlated phase modulations, but it is not suitable for general purpose, harmonic analysis.\nAs we investigated changes at each station in detail, several clear examples of timing error could be diagnosed; however, it was evident that no single explanation for changing tides was applicable. Also, as more station histories were gathered, it became clear that additional factors, such as morphological changes due to nearby dredging or natural processes, may have been significant, even at these nominally open-ocean sites. What follows is a station-by-station analysis, emphasizing sites of apparent secular increase in M 2 tides, in order to discriminate between basin-scale secular changes and site-specific local changes to tide gauges or tidal physics."}, {"section_title": "Station-by-station analysis a. Hawaiian Islands", "text": "The discussion begins with seven stations located along the Hawaiian Ridge, extending from Midway to Hilo (Midway, French Frigate Shoals, Nawiliwili, Honolulu, Mokuoloe, Kahului, and Hilo), a selection that includes the well-studied Honolulu tide gauge (Munk and Cartwright 1966; Colosi and Munk 2006) . The stations are within a region where the M 2 amplitude ranges from about 0.1 to 0.2 m, and the siting of the stations varies considerably. Midway and French Frigate Shoals are located on small islands, similar to the atollic stations found throughout the rest of the Pacific, while the other stations are located within small harbors. Mokuoloe is rather different from the other stations in that it is located well within Kaneohe Bay, in a region with complex coastline, about 5 km landward of the shelf break.\nSummaries of the harmonic analysis for the M 2 tide are shown for all the Hawaiian Ridge stations (Fig. 5) , except for Mokuoloe, which warrants a separate discussion. Secular trends in M 2 amplitude are hardly visible at this scale, but the legends give the estimated rate of change and significance value. Figure 5 also shows the estimated uncertainty of the M 2 amplitude s A and its 5-yr running mean. The secular trend in s A is apparent at Midway, French Frigate Shoals, Kahului, and Hilo, and trend rates are presented in the last column of Tables 1  and 2 . There is substantial year-to-year variability in s A because it is computed from a small number of Fourier coefficients in the residual spectrum. The standard deviation of the nontidal residual s r is also shown to demonstrate that trends in s A are not caused by secular changes in broadband noise.\nThe rate of increase in M 2 amplitude is significant at the 5% level at Midway and Hilo and significant at the 10% level at French Frigate Shoals. Accompanying the increase in M 2 is a decrease in s A at each of these stations, and it is noteworthy that the percentage change in s A is large, ranging from 15% to 30%. At Hilo, where it appears to be estimated most stably, the decrease in s A from roughly 0.14 to 0.11 cm over 50 yr is equivalent to a reduction of 25% century 21 .\nThe secular change in M 2 at the Kahului station is not statistically significant, but the more than 50-yr-long record makes it a useful case study for illustrating the response method to identify timing errors. Kahului is located in a small harbor on the north shore of Maui. A 30% decrease in s A occurred between the beginning to the end of the record, and instrumentation changes occurred in 1975 and 1992, which roughly brackets a period of elevated s A ; a period also identified by UHSLC station metadata as containing a relatively large number of gaps and questionable fluctuations. Phase modulations of the M 2 and K 1 tides at Kahului determined by the response method are compared in Fig. 6 during a particularly noisy period, 1982/83, and a recent period, 2009/10. Phase modulations caused exclusively by timing error would modulate both constituents and lead to phase perturbations along a line of constant slope v K 1 /v M 2 . Orthogonal regression (i.e., linear regression that accounts for noise in both the predictor and predictand; Van Huffel 1989) finds that, on average, the phase modulations are correlated and lie close to the predicted slope during the 1982/83 period. In contrast, in the 2009/10 time period, there is no correlation between the phase modulations.\nIn the time domain, the phase modulations can be seen in years with severe problems. If all the residual variance in the 1 /12-1 /13-h band explained by the response-type analysis were attributed to clock error, the coherent tide would be larger by about 5%.\nThe situation is different at Hilo, which is located on a bay on the northeast side of the island of Hawaii. Instrumentation changes occurred in 1975 and 1991. Except for a large gap in 1932-47, there are few notable data gaps or questionable fluctuations. Applying the above techniques to Hilo, one sees that the reduction in s A is indeed associated with reduction in the correlated phase modulations at M 2 and K 1 . Figure 8 shows the phase modulations over two 10-yr periods at the same phase of the nodal cycle (1955-64 and 1991-2000) . Phase modulations are due to a number of factors, and only a small fraction of the phase variance is correlated; nonetheless, the correlated modulations are of the correct sense, and they decrease over time. The amount of variance explained by the response-type analysis within , which corresponds to a change in tidal amplitude of 2.8 mm century\n21 . This value is approximately one-third the observed rate of increase of M 2 , 2.8 of the total 8.9 mm century 21 .\nMidway is another station at which a statistically significant increase in M 2 amplitude is accompanied by a systematic decrease in s A . The Midway station is located on Sand Island, facing the inside of an atoll with signs of extensive human modification visible in remotely sensed imagery (Google Earth). UHSLC metadata indicate that the tide gauge was changed from standard mechanical to ADR in 1975 and upgraded to the NOAA Next Generation Water Level Measuring System in 1992. Missing, bad, and replaced data are most abundant in the first 3 yr of the record (1947-49) and again in 1973-79, around the time of the switch to the ADR. Figure 5 shows that the average value of s A decreased from 0.11 to 0.08 cm (1990) (1991) (1992) (1993) (1994) (1995) (1996) (1997) (1998) (1999) (2000) (2001) (2002) (2003) (2004) (2005) (2006) (2007) (2008) , a reduction of about 30%. Based on a response analysis of phase modulations, this corresponds to approximately the same rate of increase in M 2 as at Hilo. Thus, slightly less than one-third of the secular change in M 2 at Midway can be attributed to apparent reduction of timing error.\nThe French Frigate Shoals station is located at the end of a small island, on the northwest edge of an eroded lagoon, part of the La Perouse Pinnacle. Although the secular change in M 2 does not meet the (arbitrary) significance level of 5%, it is noteworthy that the largest reductions in s A on the Hawaiian Islands occur at the French Frigate Shoals. Furthermore, the largest values of s A occur in three of the first 4 yr of the record, which suggests that these years may be anomalous. An analysis of influence for the trend using Cook's distance (Cook 1977) indicates that the significance of the trend estimate depends strongly on a single year, 1984. If 1984 is excluded from the trend analysis, the M 2 trend drops to 13.9 mm century 21 , which is only significant at the 18% level. The Nawiliwili station is located on the open coast on the southeast side of Kauai, one of the major Hawaiian Islands, unlike the lagoon or atoll-type morphology of Midway and French Frigate Shoals. Instrumentation changes occurred in 1975 and 1992. There are no significant data gaps, replacements, or questionable fluctuations lasting more than a day or two. The rate of secular change is not significant at Nawiliwili.\nThe Honolulu gauge is also located on a major island, Oahu. Instrumentation changes occurred in 1975 and 1991. Years with the most data gaps and bad/replaced data occur in the 1973-78 period, but the record is otherwise free of questionable fluctuations. The Honolulu data have been previously analyzed in detail (Colosi and Munk 2006) , and it provides an instructive counterexample to other stations that display various anomalies. It is noteworthy that both the residual semidiurnal-band variance s 2 A and the broadband nontidal variance s 2 r display year-to-year variations of 40% or so, but nothing like the large changes observed in some other records. The residual spectra (Fig. 9) are very similar at the start (1950-57) and end (1991) (1992) (1993) (1994) (1995) (1996) (1997) (1998) (1999) (2000) (2001) (2002) (2003) (2004) (2005) (2006) (2007) (2008) of the data record. Relatively long records must be analyzed in order to resolve the continuum spectrum surrounding each tidal line, but when this is done it is possible to fit a Lorentzian spectrum in the neighborhood of major lines in the semidiurnal band. Assuming that the Lorentzian is the result of phase modulations of the tide, the bandwidth of the Lorentzian is related to the correlation time of the phase modulations. For Honolulu, the inferred correlation time ranges from 140 to 250 days, depending on the length of record and details of the least squares procedure, and is consistent with the interpretation in terms of phase variability of the internal tide (Colosi and Munk 2006) .\nMokuoloe is located in the north side of Oahu, within Kaneohe Bay, a shallow region with several small islands, approximately 5 km from the shelf break. The complexity of the coastline and distance from deep water are quite different from that of the other Hawaiian Island stations. UHSLC metadata state that instrumentation changes occurred in 1983 and 1992. Substantial data gaps occurred in 1957, 1970-80, and 1991. The 12.1 mm century 21 trend in M 2 is significant at the 2% level, but because of its siting and history, changing tides at Mokuoloe are likely to have local causes. Mokuoloe proper (Coconut Island) was modified extensively in the 1930s when dredging spoils were used to double the size of the island and create an artificial lagoon (Kleiger et al. 2007) , and large disturbances to Kaneohe Bay occurred from the 1940s to the 1970s to maintain a ship channel and support the construction of the Kaneohe Marine Corps Air Station at Mokapu Peninsula (Hunter and Evans 1995) . Analysis of nonlinear overtides at Mokuoloe finds that the amplitude of the M 4 , about 2 mm, is significant (signal-to-noise ratio greater than 4). Relevant to this discussion, the ratio of amplitudes, M 4 /(M 2 ) 2 , has increased from 0.07 to 0.10 over the 1980-99 time period, which suggests that local tidal dynamics are changing, and changes at Mokuoloe are unlikely to reflect open-ocean tidal processes."}, {"section_title": "b. Midtropical Pacific islands", "text": "The Christmas Island, Penrhyn, Papeete, and Rikitea stations occupy a swath of the tropical Pacific characterized by its low level of sea level variability (Bongers and Wyrtki 1987; Ponchaut et al. 2001) . Time series of tidal amplitudes and uncertainty are illustrated in Fig. 10 .\nThe Christmas Island (Kiribati) tide station is located on the inner edge of an infilled atoll lagoon (Falkland and Woodroffe 2004) . The record used has been constructed by merging the data from the Christmas Island Rikitea is located in a partially infilled and seismically active atoll. It has the largest tides and nontidal sea level variability of this group, and it is the only station with a statistically significant trend in M 2 amplitude, 41 mm century 21 . But the semidiurnal-band residual at Rikitea, expressed as an uncertainty in M 2 amplitude, is decreasing at an average rate of 23.5 mm century"}, {"section_title": "21", "text": ". The rate of decrease is not uniform; s A dropped from approximately 2 to 1 mm from 1973 to 1976, it was nearly unchanged from 1976 to 1999, and then it dropped to 0.6 mm in the last year of complete data (2002; Fig. 10 ). The drop in uncertainty in the early 1970s is coincident with an instrumentation change from a Bristol Bubbler to a Fischer and Porter ADR in June 1975 (UHSLC Rikitea Station metadata). Figure 11 illustrates the residual spectra at Rikitea within the semidiurnal band during two 3-yr periods, 1970-72 and 1993-95 . The residual variance in the semidiurnal band, which determines the uncertainty in the amplitude of the harmonic constants, is about a factor of 4 larger in the earlier time period. Comparison of the total (broadband) nontidal residual variance (s r ; Fig. 10 ) indicates that the overall residual was unchanged during the two periods. In other words, the difference in s A between the two periods is due to changes in semidiurnalband variance, rather than broadband variance; that is, the decrease in s A is not primarily due to an overall improvement in measurement precision. The other feature of note in the residual spectra is the bandwidth of the peaks around the tidal lines. During the earlier time period the bandwidth is about 1 (40 days)\n; whereas, in the recent time period it is closer to 1 (160 days)\n. The former time scale is short for oceanic processes, while the latter time scale is similar to that found in Colosi and Munk (2006) for modulations of the internal tide via passing Rossby waves. Hence, the early part of the record with elevated s A is consistent with the presence of timing errors that were corrected on a roughly monthly time scale.\nBecause the changes in s A occur rather abruptly near the beginning and the ends of the data record at Rikitea, data from the central 20-yr period (1976-95) have been analyzed, this being just enough to observe a complete nodal cycle. When only these years are analyzed, the trend is reduced to 25.0 mm century 21 (p 5 0.12). Thus, while there may be processes increasing M 2 here, the unique characteristics of the Rikitea record make it impossible to accurately quantify the rate of change from the present data.\n. Thus, the secular change in s A is more than sufficient to explain the M 2 trend at this site. Further evidence that the trend is caused by reduction of instrumental error is that the bandwidth of the Lorentzian line spreading is found to be (44 day)\n, which is too large to be explained by oceanic nonlinearity.\nIn summary, the four stations in this zone show diverse patterns of change with no overall regional trends.\n, only about 15% of the observed rate. Yap is another site where improvements in measurement and timing cannot explain the observed trend in M 2 . Nonlinear overtides are not significant.\nThe rate of change of M 2 amplitude at Saipan is significant at the p 5 2.7% level. The gauge is located on the western side of Saipan Island in Tanapag/Saipan Harbor and is partly protected by the remains of an ancient atollic reef. The entrance to the harbor is dredged to maintain a turning channel between the edge of the reef and the harbor proper (Anonymous 2005) . The negligible change in s A suggests that the apparent secular change here is not an artifact of changes in measurement. A study of nonlinear overtides finds that MK 3 amplitude is statistically significant, but the ratio MK 3 /(M 2 K 1 ) is not changing. Interpretation of the Saipan record is somewhat problematic because of the large yearto-year fluctuations in uncertainty of the harmonic constants and because only 24 yr (out of 33 yr total) contain more than 85% complete data; hence, determination of trends for this station inevitably are sensitive to just a few years. While the Saipan station has some characteristics of a coastal site in comparison to the other open-ocean stations, the secular change here appears to be unexplained by measurement changes or local effects.\nThe lack of significant decrease in s A is consistent with an oceanic origin for the observed trends at the far western Pacific stations considered. The siting of some of the stations would make them susceptible to harborscale changes, but the absence of trends in the overtide ratios suggests that local changes are not responsible for secular changes. Among this group M 2 is increasing at three stations, decreasing at two stations, and unchanging at one station. The stations showing increases are located in proximity to Luzon Strait, a generation site of largeamplitude internal tides, such that internal tides might be measurable by the gauges. In addition, sea level trends and decadal variability in this area are significant and may be influencing tides (Church et al. 2006; Merrifield 2011) . This station group deserves further study.\n, but at a rate that is only significant at the p 5 16% level. There has been a 25% reduction in s A over the record, from roughly 2 to 1.5 mm, which could explain a change of 2.4 mm century 21 in the M 2 amplitude. Thus, the marginally significant increase in M 2 is appreciably reduced when likely reductions in timing errors are accounted for, leading to an assessment of no significant change at Pago Pago. The last record considered is from Easter Island, which is decreasing at a statistically significant rate. Inspection of the time series in Fig. 16 shows substantial variation over time of s A and s r , which suggests that the time series is not reliable enough to assess secular change in tides.\n, though. When a similar analysis was conducted here on stations exhibiting large rates of tidal change, a much larger bandwidth was found, corresponding to correlation times in the range of 40-60 days. Application of the technique was complicated by the interference of multiple lines, leading to unstable results that depended on the details of the spectral fitting. Nonetheless, at stations where reliable results were obtained (e.g., Majuro), the correlation time was much too short to be attributed to baroclinic tidal processes. Furthermore, there is no reason to expect internal tides would all lead to systematic increases in amplitude at widely separated sites.\nSignificant nonlinear overtides were found at 6 of the 12 stations, and trends in overtide ratios at 2 stations (Johnston Island and Mokuoloe) are suggestive of changes in local morphology that could influence tides. Atollic and island morphology are changing in a complex manner in the Pacific (Webb and Kench 2010) and suggest that the response of tides to mean sea level or climatic forcing is likely to be site specific.\nSecular change at five stations in the western Pacific appears to be unexplained by improved time keeping or local processes, and it suggests a region where further work might indicate regional-scale processes, perhaps related to atmospheric forcing (Merrifield 2011) . Any regional explanation must also account for the lack of changes at nearby stations, which potentially complicate the analysis. The situation is also not explained at Kanton, a mid-Pacific station located close to the equator. Secular change in M 2 is large, but the constancy of overtide ratios does not implicate local processes. Both nonlinear and radiational tides are large at Kanton, and the station requires a more complete analysis in relation to equatorial atmospheric processes."}, {"section_title": "c. Western equatorial Pacific stations", "text": "A group of stations in the western equatorial Pacific are located to the east of the M 2 nodal line at 1508E. Summaries for the four stations, Kapingamarangi, Pohnpei, Kwajalein, and Majuro, are shown in Fig. 12 . All of these stations are located on the inner lagoons of island atolls.\nThe Kapingamarangi lagoon is nearly enclosed, and the channel is only about 150 m wide (Google Earth), tiny compared to the 7 km by 10 km dimension of the lagoon. The trend in M 2 amplitude is statistically significant, and there is also a significant negative trend in s A . According to the UHSLC metadata, silting around the stilling well is responsible for the questionable fluctuations during 1987-90. Also, while timing drifts are mentioned in metadata for the January-May 1998 period, no ''questionable fluctuations'' are specifically noted, and this station provides a telling example of timing error symptoms diagnosed via the response-type method. Figure 13 (Wiens 1956 ). There is some indication of a downward trend in the MK 3 /(M 2 K 1 ) because the early 1990s, but the trend is not statistically significant. Thus, Kapingamarangi appears to be an example of genuine increases in M 2 amplitude, significantly complicated by local factors. The station on the Micronesian Island of Pohnpei is located on the northern side of an island inside the larger coral lagoon. The M 2 is increasing at a statistically significant rate, and there does not appear to be a systematic trend in s A . Note that s A is elevated in the 1991-97 time period, coincident with changes in the primary gauge. The lagoon appears to be undergoing substantial infill, and it may be that the site is subject to anthropogenic influence; however, an analysis of overtides finds none that are significant or systematically changing. Secular change at Pohnpei appears to be significant and unexplained by data anomalies.\nThe Kwajalein station is located on the lagoon side of an atoll, and it is noteworthy for having a very long, stable record, marked only by an abundance of questionable fluctuations before 1951 (UHSLC metadata). The M 2 amplitude is decreasing at a barely significant rate of 26.7 mm century 21 (p value of 9.5%; the probability that the trend is 0 mm century 21 given the observed value). The Majuro station is also located on the lagoon side of an atoll. Figure 14 compares the nontidal residuals at Majuro during 1977 and 1996, at similar phases of the nodal cycle, when nearly gap-free time series exist (thus permitting spectra to be computed for each year using the identical degrees of freedom). Total nontidal variance is nearly identical in the 2 yr, but it is evident that the white noise floor is higher in the more recent time period. While this is an interesting anomaly, our focus is on the semidiurnal-band spectral peak. There is visibly less variance in this band in 1996. The uncertainty of the Majuro amplitude s A decreases from approximately 3.5 to 2 mm, with a nearly monotonic trend from the mid1970s to present. The response-type demodulates show that M 2 band energy is reduced from (2.62 cm) 2 in 1976-78 to (1.34 cm) 2 in 1996-98, corresponding to an increase of 49 mm century"}, {"section_title": "d. Far western North Pacific", "text": "The far western Pacific is a region with potentially significant tidal amplitude increases. Trends at six stations, Malakal, Yap, Chichijima, Guam, Saipan, and Wake, are summarized in Fig. 15 . The trends at Guam, Chichijima, and Wake are either decreasing or not statistically significant and will not be discussed further. Highly significant increases in M 2 are found at Malakal, Yap, and Saipan.\nThe Malakal gauge is located within a partially enclosed bay on the east side of an island within the Palau Archipelago. A modest trend in s A is visible, from 0.25 to 0.21 cm over a 30-yr period; although, the trend is mostly due to particularly noisy years in 1977 and 1989 (a large number of questionable fluctuations are noted in the UHSLC data in the latter year). Peattie (1988) states that the Malakal harbor was extensively modified by the Japanese before 1945. The nonlinear overtides were examined in order to assess whether the present changes could be explained by a slow return to morphodynamic equilibrium in the harbor. Although several overtides were found to be large and statistically significant (M 4 , M 6 , and MK 3 ), none of the corresponding amplitude ratios display trends. Malakal is a site where the secular change in M 2 amplitude cannot be explained by changes in measurement accuracy or local shallowwater processes. The Yap station is located about 2.5 km from deep water. The variability in s A is large and so is its trend (21.7 mm century 21 ), but changes appear to be unrelated to changes to the primary gauge that occurred in 1991, 1998, and again in 1999 (UHSLC metadata). Between the two periods, 1975-80 and 1994-99, the rootmean-square phase modulations decrease slightly from 6.6 to 5.1 min. The amplitude of M 2 is relatively large, so the corresponding rate of increase in M 2 is 7.6 mm century"}, {"section_title": "e. Miscellaneous stations", "text": "The last set of four stations is not easily grouped with others, either by proximity or station geography, and is considered separately. These stations are Johnston Island, Kanton, Pago Pago, and Easter Island (Fig. 16) . The Johnston Island station is located on an atoll that has undergone extensive human modification, at least through 1964 (Amerson and Shelton 1976) . The rate of increase of M 2 tidal amplitude is small (13 mm century 21 ) but of high statistical significance given the long record length. However, significant dredging and island building occurred until at least 1964, and evidence of this is found in the M 4 nonlinear overtide amplitude ratio M 4 /(M 2 ) 2 , which jumped from 0.2 (pre-1965) to 0.3 (post-1965) , indicating a significant change to local tidal dynamics. If the analysis record is restricted to 1965 to present, the M 2 trend and its significance are 2.3 mm century 21 and p 5 66%. Thus, we conclude that secular change at Johnston Island is primarily of local, human-induced origin. The Kanton record combines Kanton A (1949-67) and Kanton B (1972 Kanton B ( -2007 subrecords. Because there were no obvious offsets, the two records have been concatenated to analyze secular change. Assuming the station coordinates and georeferenced imagery is accurate to within 200 m (about 0.1 arc minute), the Kanton station(s) are unusual because they were located on the outer (ocean facing) edge of the Canton Island Atoll. The rate of secular change of the combined record is large and highly statistically significant. In addition, when the Kanton B record is analyzed by itself, the rate of increase in M 2 is 56 mm century 21 , which is highly significant (p , 10 25 ).\nKanton is practically unique among the open-ocean sites in terms of the size of the nonlinear overtides. Harmonic analysis is unambiguous in finding M 4 , M 6 , and MK 3 amplitudes statistically significant, with ratios relative to their forcings of M 4 /(M 2 ) 2 5 26, M 6 /(M 2 ) 3 5 15, and MK 3 /(M 2 K 1 ) 5 7. Indeed, historical accounts report ebb tide currents of 3-4 m s 21 through the single entrance to the atoll interior and a difference in water level between the atoll interior and the ocean that is visible to the naked eye (Degener and Gillaspy 1955) . Time series of overtide ratios display slight trends in both M 4 /(M 2 ) 2 (increasing) and MK 3 /(M 2 K 1 ) (decreasing); although, neither is statistically significant. The Kanton record is also unusual in that the majority of residual variance is associated with the solar tides and radiational forcing (S 1 and S 2 ). The Kanton record needs to be further studied to elucidate the causes of secular change.\nThe Pago Pago station is situated on a large bay on the southern side of American Samoa, and it is well exposed to the deep ocean. The long record at this site indicates that M 2 amplitude is increasing at 7.1 mm century"}, {"section_title": "f. Summary", "text": "Records of sea level and corresponding tidal analyses have been examined at a set of 25 open-ocean tide gauges to investigate the cause of apparent secular change in M 2 and K 1 tidal amplitude. Attention was focused on identifying possible nonoceanographic influences on the M 2 tide in order to explain its overall amplitude increase in the central Pacific Ocean. As summarized in Table 5 , the detailed analysis found that a reduction in timing error completely explains the apparent secular change at two stations, Majuro and Rikitea, and it explains about one-third of the secular change at two other stations, Midway and Hilo. One surprising result of the analysis was the presence of significant nonlinear overtides at six nominally open-ocean stations, Malakal, Saipan, Kapingamarangi, Kanton, Johnston Island, and "}, {"section_title": "Discussion", "text": "Several authors have noted an apparently widespread trend of increasing tidal amplitudes in various part of the ocean (Jay 2009; Woodworth 2010) , which suggest the hypothesis that large-scale climate processes might be altering tides on the amphidromic, basin, or global scale. The present work began by looking systematically at long records from the central Pacific, a region where it was believed the signal of climate processes would manifest, in contrast to coastal stations where local processes, for example, harbor modifications, are more important (Jay et al. 2011 ). The first step in this process was to assess the significance of the rates of secular change in comparison to the uncertainty of the harmonic constants. At a majority of stations, 18 out of 25, a secular increase in the M 2 tidal amplitude is observed. When the precision of the estimated trend is considered, the M 2 tide is increasing at 12 of the 13 sites where a statistically significant trend can be identified. However, a correlation between the rate of increase in tidal amplitude and the rate of decrease in uncertainty of the harmonic constants was noted, which prompted an effort to see whether the trend should be considered a diagnostic of climate processes or whether it represents an artifact of the changing measurement systems or incidental local processes.\nThe reduction in uncertainty of the harmonic constants is due to a decline in variance in the tidal continuum, the variance near the tidal lines incoherent with the tidal forcing. In other words, the variance of the tidal continuum, the so-called tidal cusp spectrum (Munk and Cartwright 1966) , has declined systematically. Previous studies of the tidal continuum have found that it can be well modeled by a Lorentzian line spreading by phase modulation; however, the bandwidth of the Lorentzian, which is a measure of the inverse correlation time of the phase modulations, was found to be smaller than (180 day) 21 (Colosi and Munk 2006) , a long correlation time being representative of the physical processes that modulate the phase of the internal tide. When the Lorentzian fitting approach was applied to some of the records here, the bandwidth was found to be as large as (40 day) 21 , which indicates a correlation time too short to be explained by phase modulations of the baroclinic tide. It is much closer to the time scale of monthly corrections to tidal timing, such as might occur during data reduction. How is variance in the tidal continuum created? It may be attributed to random measurement errors that alter the phase of the tidal line, for example, clock error or stilling well malfunction; it may be created by nonlinearity in the tide gauge itself, for example, frictional effects; or it may be created by oceanic nonlinearity, for example, the modulation of the linear internal tide (Munk and Cartwright 1966; Chiswell 2002; Colosi and Munk 2006) .\nThe hypothesized timing errors might arise from several sources, related to the accuracy of the clock or time-recording instrumentation, the functioning of the stilling well, or data postprocessing (time correcting) activities. Typical stilling wells consist of a pipe with a diameter of 10-30 cm, with a 2-4-cm diameter orifice open to the sea (Parker 2007) . By construction, the response time for the typical stilling well would range from about 3 to 30 s (Forrester 1983) . Serious clogging, amounting to a 10-min response time, would require the orifice opening to be reduced to less than about 0.6 cm for a 30-cm diameter pipe. But a check of the stilling well has long been a part of the protocol for station checks, and data collected during a clogged period would be marked as erroneous and discarded (D. Luther 2012, personal communication) . Thus, while clogged stilling wells may give rise to errors, there is no reason to think that maintenance or attention to clogging would have changed over time. Another factor that may be discounted is changes in the forming of hourly averages from the original data, typically sampled at 15-min intervals. UHSLC metadata report many instances of changes from the 9-point triangular filter to the 3-point Hanning filter or other time decimation techniques, but these changes ought to have a negligible effect on the semidiurnal tides and lower frequencies.\nThe present analysis has emphasized the study of changes to M 2 , but what about K 1 ? A smaller number of stations have seen changes in K 1 , which, due to the generally smaller amplitude, is of smaller statistical significance. A correlation was found between the rate of increase of both M 2 and K 1 tidal amplitudes and the rate of decrease in uncertainty of both quantities (Fig. 4) , which suggested that the apparent increase in M 2 could be explained by improvements to time keeping. The response-type analysis was designed to explain variance in the time series, and this variance is dominated by the M 2 band. The signal-to-noise of the diurnal band is low compared to the semidiurnal band; hence, the latter is much more influential in determining the responsefunction coefficients. The basic difficulty is connected with the characteristics of the phase error we seek to identify. The autocorrelation time of the hypothesized phase errors, caused by time-keeping error or stilling well problems, is thought to range from a week to a few months, based on the bandwidth of the Lorentzian spectrum in the vicinity of the main coherent tidal lines. Thus, the identification of phase errors must be performed by response-type analyses of records shorter than this correlation time (analysis windows of 5-28 days were tried, with similar results). But analysis of short time series leads to relatively unstable results for the phase in the diurnal band, which is a generally lower signal level than the semidiurnal band. Thus, the analysis of the diurnal band poses significant difficulties not seen in the analysis of the semidiurnal band.\nIf time keeping is the cause of the apparent secular increase in the M 2 tide, one would expect to see proportionally larger increases in higher-frequency overtides, such as M 4 , where the timekeeping error would lead to larger phase errors. Conversely, one would expect to find smaller secular changes in the diurnal K 1 . Rates of secular change in K 1 and diurnal-band variance s K 1 are generally smaller than observed for M 2 ; however, K 1 is generally one-third the size of M 2 , so the signal-to-noise ratio is nearly a factor of 10 smaller for K 1 . Likewise, the signal-to-noise ratio for M 4 is too small to reliably determine trends."}, {"section_title": "Conclusions", "text": "Secular changes in the dominant semidiurnal and diurnal tides were examined at a set of 25 nominally openocean stations in the Pacific Ocean. The secular increase in M 2 tidal amplitude was found to be accompanied by a secular decrease in nontidal semidiurnal-band sea level variance at all 12 of the stations where M 2 is increasing at a statistically significant rate. The apparent correlation between secular trends in variance at tidal frequencies and in the nearby nontidal frequencies prompted a closer examination of the records in an effort to distinguish among possible causes for secular changes.\nIf trends in large-scale processes, for example, upperocean heat content (Levitus et al. 2009 ) or wind stress (Hande et al. 2012) , were the cause of changes in openocean tides, perhaps via an overall decrease in efficiency of tidal dissipation (thus leading to an increase in tidal amplitude) one would expect the tidal response to be at similarly large scale; however, the lack of an apparent spatial pattern in the trends suggests other possible explanations. It was hypothesized that the secular trend in nontidal semidiurnal-band sea level variance is, in fact, the result of general improvements to time keeping at the tide stations. Error in time keeping, which might be due to inaccurate clocks or error in the recording of the measurement time, would tend to smear phaselocked sea level variance at tidal frequencies into nearby frequencies. Timing errors of sufficient magnitude need not occur often, as the excess semidiurnalband variance is less than one part per thousand of the coherent M 2 variance.\nA variety of approaches were used to diagnose random timing errors from the nontidal residual, and timekeeping error appears to provide a satisfactory explanation of secular change in M 2 tides at 4 of the 12 stations where the M 2 increase is statistically significant. The rate of decrease in s M 2 is not uniform, but the reported rates in Tables 1 and 2 , which are linear fits over the full record, are sufficient to explain much of the A M 2 trend at these four stations.\nRather than time-keeping error, could the excess semidiurnal-band energy be ascribed to oceanic processes, for example, the changing phase of an internal tide? Analysis of the Honolulu and Hilo station data by Colosi and Munk (2006) found that semidiurnal-band variance could be explained by a model that included a phase variable internal tide. The bandwidth associated with phase variability of the internal tide was found to be in the range from (450 day) 21 to (600 day)"}]