[{"section_title": "List of Tables", "text": ""}, {"section_title": "I. Purpose", "text": "This document describes the universe, methods, and editing procedures used in the nonfiscal, universe portion of the school year (SY) 2015-16 Common Core of Data (CCD) collection. The National Center for Education Statistics (NCES) will publish updated versions of this document with each school year collection. The CCD universe collection is a comprehensive listing of the public elementary and secondary schools and the local education agencies (LEAs) that administer and support them. The CCD includes directory, enrollment, and staffing data at state, LEA, and school levels. State education agencies (SEAs) report these data in a series of file submissions throughout the school year. Specific information about the actual data is provided in the First Look publications and companion files that accompany the release of the component files. The CCD also includes fiscal data and data on high school dropouts and completers. Those collections are described in separate documentation. The CCD universe collection is a subset of the data submitted by SEAs to the Department of Education through EDFacts, the department's centralized data collection system. SEAs submit data through the EDFacts Submission System (ESS). The Partner Support Center (PSC) assists data providers in resolving any file submission problems. Files with CCD data are replicated to the Data Management System (DMS) which is used by PSC analysts to review the data and communicate with SEAs about any data issues. Other documentation that may be useful to researchers includes the following: • EDFacts workbook, a reference guide to using the ESS; particularly useful to new users; contains multiple appendices, including one that explains how to use the file specifications (posted at https://www2.ed.gov/about/inits/ed/edfacts/eden-workbook.html. • EDFacts file specifications, posted at https://www2.ed.gov/about/inits/ed/edfacts/filespecifications.html. These specifications include the detailed definitions and guidance given to SEAs for reporting CCD data. • The EDFacts business rules guide describes each business rule; it includes the error number, type, message, definition, edit logic, and the file specifications against which the business rules are applied (posted at https://www2.ed.gov/about/inits/ed/edfacts/businessrules-guide.html). • The CCD DMS state users' guide instructs data providers in the SEAs in the use of the CCD Data Management System: https://www2.ed.gov/about/inits/ed/edfacts/dms-stateuser-guide.docx. • The CCD DMS Business Rules Guide lists the edits run against the data submitted by SEAs: https://www2.ed.gov/about/inits/ed/edfacts/ccd-dms-business-rules-guide.xlsx. • CCD data files and documentation, posted at https://nces.ed.gov/ccd/ccddata.asp. The additional documentation posted on this page complements this file documentation, providing specific information on the individual data files such as file layouts, frequency counts, value ranges, and data notes."}, {"section_title": "II. Introduction", "text": ""}, {"section_title": "A. CCD Background", "text": "The CCD is a national statistical program that collects and compiles administrative data from SEAs covering the universe of all public elementary and secondary schools and school districts in the United States. The first CCD collection was for SY 1986-87. The predecessor to CCD was the Elementary and Secondary General Information System. The CCD includes five basic collections and several supplemental ones. The basic collections are divided into two main data content areas: nonfiscal (or universe) data and fiscal data. They are further divided into hierarchical levels (school, LEA, 1 and state). These five basic collections are listed in the exhibit below. This documentation addresses the three nonfiscal, universe data files. "}, {"section_title": "Exhibit 1. Basic collections of the", "text": ""}, {"section_title": "B. Particulars regarding the 2015-16 Data Files", "text": "• Version 1a of the 2015-16 CCD file includes data submitted up through January 17, 2017. • The NCES School ID (SCHID) has been changed for 96 schools so that starting with 2015-16 it is unique for all schools within each state. This change was made in the preliminary CCD school directory file. It was always intended that this value should be unique within each state; however, a processing error resulted in these 96 cases of duplicate SCHID values within a state. This was corrected in the 2015-16 collection by changing the '0' in the first position of the SCHID (or the eighth position of the NCESSCH field) to a '1'. The Directory companion file includes an ID crosswalk for the affected schools. With this correction, SCHID is unique within an SEA, meaning all schools can be uniquely identified with the combination of FIPST and SCHID. The unique values of SCHID make it possible to track a school longitudinally, even though it may change the LEA with which it is affiliated. • The virtual school flag (VIRTUAL) has been moved from the school directory file to the CCD School characteristics file (EDFacts file specification 129). • From SY 1998-99 through SY 2014-15, CCD LEA files included the count of Limited English Proficient (LEP) students in LEP programs (EDFacts file C046-LEP Students in LEP Programs). That EDFacts collection will be discontinued. Starting with 2015-16 CCD is reporting total enrollment of Limited English Proficient (LEP) students (EDFacts file C141-LEP Enrolled). • Utah was unable to report staff data for both SY 2015-16 and SY 2014-15. State-level staff values were imputed. Please see the companion file for particulars. • Wyoming did not report staff data at the LEA level; all of the LEA-level staff values were set to '-1' (missing). • Wyoming reported a total of 4 charter schools in 2014-15; all four were reported as noncharter schools in 2015-16. These schools are: o Snowy Range Academy (NCESSCH=560073000216) o Laramie Montessori Charter School (NCESSCH=560073000542) o Arapahoe Charter High School (NCESSCH=560096000367) o PODER Academy (NCESSCH=560198000547) • Ungraded enrollment (UG) and ungraded teacher FTE (UGTCH) were set to '-2' (not applicable) for those states that indicated that they did not use the designation 'ungraded'. The state-level imputation flags for these values in these cases were set to 'A' ('Adjusted'). • Massachusetts did not submit Free-or Reduced-Price Lunch data for SY 2015-16. • New York reported all counts of Hawaiian Native / Pacific Islander students as '-1' (missing). • The table below shows which data files have been submitted by American Samoa, the Bureau of Indian Education (BIE), the Department of Defense Education Activity (DoDEA), Guam, and the Northern Marianas for SY 2015-16. When a file is not submitted, the values were set to '-1' (missing) and the corresponding imputation flags set to 'A' ('Adjusted'). "}, {"section_title": "C. The Scope of CCD", "text": "The CCD is a census or \"universe\" data collection, unlike a sample data collection that includes only a subset of the target population. The goal of the CCD surveys is to provide a complete and comprehensive listing of all schools, LEAs, and SEAs providing free public elementary and secondary education within the United States. The primary use of the CCD is to provide national estimates of key education statistics, such as the total number of students enrolled in public elementary/secondary schools in the United States and the total number of full-time-equivalent (FTE) teachers working in these schools. The NCES annual Digest of Education Statistics publishes tabulations of CCD data. The CCD is also used as a sampling frame for studies of public elementary/secondary education. NCES studies that use the CCD this way include the National Assessment of Educational Progress (NAEP) and the National Teacher and Principal Survey (NTPS). 2 The geographic scope of the CCD includes: • the 50 states and the District of Columbia; • Puerto Rico; • the U.S. Virgin Islands; • American Samoa; • Guam; • the Commonwealth of the Northern Mariana Islands; • Bureau of Indian Education (BIE); and • Department of Defense Education Activity (DoDEA). References in CCD documentation to state education agencies include the reporting agencies for the island territories, BIE, and DoDEA. Tabulations of CCD data generally include only the 50 states and the District of Columbia in U.S. totals; the island territories, BIE, and DoDEA are listed separately in tabulations."}, {"section_title": "D. Elementary/Secondary Education Entities in CCD", "text": "The CCD imposes a three-level hierarchy on public elementary/secondary education entities: state, LEA, and school. All schools in the school universe are associated with an LEA and an SEA. Every LEA is associated with an SEA. This hierarchical relationship between schools, LEAs, and SEAs is reflected in the identification numbers assigned to schools, LEAs, and SEAs by NCES. (See the section, \"Unit Identifiers\" below). This section describes how these entities are characterized in CCD. For the complete definitions and the guidance provided to SEAs for reporting these data, see the EDFacts file specifications available here: https://www2.ed.gov/about/inits/ed/edfacts/file-specifications.html."}, {"section_title": "State Education Agency (SEA)", "text": "CCD recognizes only one SEA in each state. This standard derives from the Elementary and Secondary Education Act (ESEA), which defines the SEA as the agency of the state charged with primary responsibility for coordinating and supervising public elementary and secondary instruction (education), including the setting of standards for instructional programs, and it is the state agency that administers federal grant programs under the ESEA. This SEA is the entity responsible for reporting CCD data. Other state agencies, such as justice departments or health departments, may operate schools or provide elementary/secondary education services. Some states also operate schools for the blind or the deaf. Within the CCD typology, these would all be designated as LEAs of type 5 (\"stateoperated\"-see the next section)."}, {"section_title": "Local Education Agencies (LEAs)", "text": "In the CCD typology, LEAs include all governmental agencies within a state that support public elementary/secondary education other than the SEA and schools. These include local school districts that operate schools, as well as regional agencies that provide services to school districts, other education agencies, or schools. LEAs may or may not be coterminous with county, city, or town boundaries. The CCD LEA typology is based on the governance of the agency. The LEA type (LEA_TYPE) takes one of the following values: 1 = regular local school district that is not a component of a supervisory union; 2 = regular local school district component of a supervisory union sharing a superintendent and administrative services with other local school districts; 3 = supervisory union administrative center or a county superintendent serving the same purpose; 4 = regional education services agency or a county superintendent serving the same purpose; 5 = state-operated institution charged, at least in part, with providing elementary and secondary instruction or services to a special-needs population; 6 = federally operated institution charged, at least in part, with providing elementary and secondary instruction or services. With few exceptions, these are LEAs operating under the DoDEA; 7 = agencies for which all associated schools are charter schools. In the CCD model, every school is associated with an LEA. Charter schools authorized by entities other than a LEA often serve as their own LEA for CCD reporting purposes; and 8 = other education agencies that do not fit into the first seven categories. Prior to the SY 2007-08 collection, TYPE 7 represented \"other education agencies,\" which included charter school agencies. Starting in SY 2007-08, TYPE 7 was changed to represent charter school agencies only, and TYPE 8 was added to indicate \"other education agencies\" (excluding charter school agencies)."}, {"section_title": "Schools", "text": "For CCD, a school is defined (from the EDFacts Workbook section 1.3) as a site that provides elementary and secondary educational services and • has one or more grade groups (prekindergarten through 13) or is ungraded; • has one or more teachers; • is located in one or more buildings (does not exclude virtual schools; see below); • has an assigned administrator(s); • receives public funds as its primary support; and • is operated by an education agency. This definition of schools includes: • schools that serve students on a part-time basis, such as a career and technical school; • schools that serve students remotely-that is, the school providing instruction is located in a different location than where the student is located, such as distance learning, cyber learning, or virtual learning; • charter schools, including those that may be authorized by an entity other than an LEA; and • schools run by SEAs or another state agency, such as a juvenile justice facility or school designed to meet a specialized need. CCD school typology (the variable SCH_TYPE on the file) is based on the school's curriculum or population served. Additional yes/no flags are used to indicate other characteristics of the school (e.g., MAGNET_TEXT, CHARTER_TEXT, VIRTUAL, SHARED_TIME)."}, {"section_title": "a) School type (SCH_TYPE)", "text": "School type takes one of the following values: 1 = Regular school: A public elementary/secondary school providing instruction and education services that does not focus primarily on special education, career/technical education, or alternative education, or on any of the particular themes associated with magnet/special program-emphasis schools."}, {"section_title": "= Special education school:", "text": "A public elementary/secondary school that focuses primarily on special education-including instruction for any of the following students with: autism, deaf-blindness, developmental delay, hearing impairment, intellectual disability, multiple disabilities, orthopedic impairment, serious emotional disturbance, specific learning disability, speech or language impairment, traumatic brain injury, visual impairment, and other health impairments-and that adapts curricula, materials, or instruction for students served."}, {"section_title": "= Career/technical education school:", "text": "A public elementary/secondary school that focuses primarily on providing formal preparation for semiskilled, skilled, technical, or professional occupations for high school-age students who have opted to develop or expand their employment opportunities, often in lieu of preparing for college entry. 4 = Alternative/other school: A public elementary/secondary school that (1) addresses needs of students that typically cannot be met in a regular school; (2) provides nontraditional education; (3) serves as an adjunct to a regular school; or (4) falls outside the categories of regular, special education, or career/technical education."}, {"section_title": "= Reportable program:", "text": "A program within a school that may be self-contained, but does not have its own principal. Reportable programs are not schools as defined by CCD. EDFacts collects data for other U.S. Department of Education programs in addition to CCD. These programs are assigned an NCES school ID so that they can report their particular data separately from any school with which they are affiliated. This category also includes some educational entities for which other EDFacts data are unavailable. Reportable programs are not included in CCD reporting or tabulations. An entity that was an operational school in the prior year but turned into reportable programs in the current year is shown in the current year file with a SCH_TYPE code of 5 and an operational status of \"closed\" so that there is a record of its closure as a school."}, {"section_title": "b) Magnet school status (MAGNET_TEXT)", "text": "All schools in the CCD have a flag (MAGNET_TEXT) to indicate whether the school is a magnet school. A magnet school is a special school designed to attract students of different racial/ethnic backgrounds for the purpose of reducing, preventing, or eliminating racial isolation (50 percent or more minority enrollment); and/or to provide an academic or social focus on a particular theme (e.g., science/math, performing arts, gifted/talented, or foreign language). Whether a school is a magnet school is independent of the school type (SCH_TYPE)."}, {"section_title": "c) Charter school status (CHARTER_TEXT)", "text": "All schools in the CCD have a flag (CHARTER_TEXT) to indicate whether the school is a charter school. A charter school is a school providing free public elementary or secondary education to eligible students under a specific charter granted by the state legislature or other appropriate authority, and it is designated by such authority to be a charter school."}, {"section_title": "d) Virtual school status (VIRTUAL)", "text": "Starting in SY 2013-14, all schools in the CCD have a flag (VIRTUAL) to indicate whether the school is a virtual school. A virtual school is a public school that only offers instruction in which students and teachers are separated by time or location, and interaction occurs via computers or telecommunications technologies. A virtual school generally does not have a physical facility that allows students to attend classes on site."}, {"section_title": "e) Shared-time school status (SHARED_TIME)", "text": "All schools in the CCD have a flag (SHARED_TIME) to indicate whether the school is a sharedtime school. A shared-time school is typically a school that offers career/technical education or other education services (SCH_TYPE = 3 or 4), in which some or all students are enrolled in a separate \"home school\" (or \"school of record\") and attend the shared-time school on a part-day basis. In CCD, students are only counted once-in their home school. This is usually the school where they spend most of their day. Because of this, the membership count for a shared-time school understates the number of students served by the school, and may even be zero."}, {"section_title": "III. Process", "text": ""}, {"section_title": "A. EDFacts", "text": "CCD is a subset of data collected by EDFacts. EDFacts is a U.S. Department of Education initiative to put performance data at the center of policy, management, and budget decisions for all K-12 educational programs. EDFacts centralizes performance data supplied by K-12 state education agencies (SEAs) with other data assets within the Department, such as financial grant information, to enable better analysis and use in policy development, planning, and management. EDFacts collects data on behalf of approximately 15 ED discretionary and formula grant program and policy offices. All data in EDFacts are organized into 'data groups' and reported to ED by the state education agencies (SEAs) using defined file specifications. SEAs submit data through the EDFacts Submission System (ESS Each SEA has a designated EDFacts and CCD coordinator; in many cases the same individual may fill both roles. The EDFacts coordinator is responsible for the submission and processing of all EDFacts files. The CCD coordinator focuses on providing the EDFacts coordinator with the data required for the CCD files."}, {"section_title": "C. Data Review", "text": "SEA submissions are processed through the ESS. The ESS performs a number of format and validation edits on files. The results of these edits are available to SEAs through the Education Data Exchange Network. The EDFacts PSC works with SEAs to resolve any issues related to these submissions."}, {"section_title": "Universe Edits", "text": "The first check of data submissions is to ensure that the reported universe of schools and LEAs is complete and accurate. To ensure the uniqueness of each reported entity and continuity with prior year reporting, the ESS runs a series of checks using the states' own ID numbers for LEAs and schools, NCES ID numbers, and the reported status of the entities. These are referred to as \"match\" edits because they rely primarily on matching entities reported in the current year collection with those reported in the prior year. To pass these edits the reported status of the LEA or school must be logically consistent from prior year to current year (e.g., a school closed in the prior year should not be reported as open in the current year). A directory file that fails match edits is rejected by ESS, and the SEA must make the appropriate corrections and resubmit the file before the data is processed further. As a quality assurance measure, CCD DMS also runs a similar series of match edits against the LEA and school files extracted from ESS. SEAs are asked to review any LEAs and schools that fail match edits in CCD DMS. Unless the reporting SEA requests it, these entities are not deleted from the directory file. This allows for the possibility that the entity changed status within the school year. The directory companion file includes a cross tabulation of the counts of LEAs and schools by prior year and current year status with inconsistent status changes flagged. Closed schools are reported on the CCD directory file the year after they have closed. The directory file specifications (029 -https://www2.ed.gov/about/inits/ed/edfacts/eden/nonxml/n029-12-1.doc) provide the directions given to SEAs on reporting schools, LEAs, their IDs and their statuses. Match edits and other edits made in ESS against submitted files are described in detail in the EDFacts business rules guide; it includes the error number, type, message, definition, edit logic, and the file specifications against which the business rules are applied (posted at https://www2.ed.gov/about/inits/ed/edfacts/ccd-dms-business-rules-guide.xlsx)."}, {"section_title": "Data Management System", "text": "Starting with the SY 2015-16 collection, the outreach to SEAs and reconciliation of data issues was done through PSC and the DMS. The DMS is an online system that facilitates exchanges between the U.S. Department of Education and reporting SEAs. EDFacts submissions relevant to CCD are replicated nightly from ESS to DMS. DMS is operated by PSC analysts dedicated to CCD who work with SEAs to resolve data issues. PSC analysts load new submissions to the DMS \"trunk\" schema and initiate error reports. These error reports test submitted data against the CCD DMS business rules posted at https://www2.ed.gov/about/inits/ed/edfacts/ccd-dms-business-rules-guide.xlsx. SEAs are notified when these reports are available for viewing in the DMS. SEAs and PSC analysts can discuss these issues using a dialog functionality within DMS. PSC analysts also reach out to SEAs via e-mail and telephone as needed. When data problems are identified, SEAs are encouraged to resubmit data files through ESS. While PSC analysts can correct data in DMS, resubmissions through ESS are preferred so that the two databases are consistent."}, {"section_title": "a) Multi-year Edits and Data Suppressions", "text": "NCES does not generally impute or adjust data at the LEA and school level. However, to avoid publishing clearly erroneous data, NCES tests for unlikely values and suppresses those that cannot be explained or resolved. Beginning with SY 2009-10, NCES implemented an editing methodology that more accurately identifies data that are likely to be erroneous. For the SY 2015-16 all membership reporting (total membership, membership distribution by race/ethnicity, membership distribution by sex, membership distribution by grade level, lunch program counts, children with disabilities and English language learners) was subjected to multi-year edits. Of the staff categories, only teacher FTE was tested this way. Prior to SY 2009-10, data elements were compared only to the reported data from the prior year for each school or LEA. The revised methodology uses available data from multiple prior years and is applied to both the reported data items and related ratios. Specifically, an average variation over the prior 4 years is computed based on the differences between each year and the other 3 years. Then, the average variation between the current year and the 4 preceding years was computed based on the differences between target year and each of the 4 prior years. Data elements with large differences are then flagged as potential errors. Additionally, a related ratio is calculated and tested. Examples of these computed ratios include pupil/teacher ratio and percent of students eligible for FRPL. For example, in testing total student membership, the pupil/teacher ratio is also tested. A consistent value for the ratio indicates that the changed value is consistent with other changes in the data. If both the absolute value and the ratio value are at wide variance compared with prior years, the value is flagged for possible suppression and included in the DMS error reports. CCD analysts and SEAs then have the opportunity to review the suspect values and make a determination of their validity. A processing flag is used to track the status of these values during the review process in the trunk schema. Its values are: • passed edits; • ED Analyst accepted anomalous data as correct; data to be retained; • state provided satisfactory response as to why anomalous data are correct; data to be retained; • state did not give satisfactory response as to why anomalous data are correct; data to be suppressed • state did not provide a response as to why anomalous data are correct; data to be suppressed."}, {"section_title": "b) Review completion", "text": "Once the data review is completed, PSC analysts compile recommendations for any adjustments needed to resolve any remaining data issues. The data in DMS are moved from the trunk schema to the \"prepublication\" schema for post-review processing."}, {"section_title": "D. Post-review Processing", "text": "NCES preference is to publish the data as reported by the SEAs. However, NCES makes some adjustments to the reported data for the following reasons: • to set appropriate default values; • to suppress enrollment or staff counts that are greatly inconsistent with prior year reports; this is done only if the SEA did not provide an adequate explanation for the anomaly; • to add additional, derived variables; • to bring SEA definitions into conformity with NCES definitions (e.g., school typologies); • to impute for missing values in state-level data; and • to suppress high or low counts that might compromise confidential data. Suppressions are indicated by a value of -9 in the suppressed data field. Other data adjustments are indicated in a corresponding flag indicating which, if any, adjustment has been made to the reported value. Summary descriptions of adjustments made to the data are included in the companion files."}, {"section_title": "\"Wide\" file extracts", "text": "Data in EDFacts and DMS are stored in \"long\" file format in which each record contains a single data point and its unique set of qualifiers. CCD data are published in \"wide\" file format in which each record corresponds to a single entity (i.e., a state, LEA or school). In creating the wide files, records are populated with default values for non-reported values (implicit zeros, missing or not applicable). For SY 2015-16 post-review processing, \"wide\" format files were extracted from DMS for postreview processing."}, {"section_title": "Default Values", "text": "In the process of creating \"wide\" files from \"long\" files, fields are created in wide files that are not present on the long files. These are populated with default values. If, for example, a school has no 12th graders, the long file requires only a zero for the 12th grade enrollment; counts by race/ethnicity and sex are not reported for 12th grade students. In a wide file format, each field occurs in each record, so the counts for 12th graders by race/ethnicity and sex are populated with explicit zeros. Variables are also populated with exception values to indicate missing and notapplicable data. Whether a value is set to zero, missing or not-applicable is determined by the reporting requirements described in the EDFacts file specification. Enrollment counts for ungraded (UG) and grade 13 (G13) were defaulted to not-applicable (-2) if an SEA indicated on their EMAPS response that those grades were not offered within the state."}, {"section_title": "Suppressed Values", "text": "Values that failed the multi-year edit and were not resolved during data review are suppressed (set equal to -9) in post-review processing."}, {"section_title": "Totals", "text": "• "}, {"section_title": "Derived variables other than totals", "text": "Derived variables are a convenience to researchers and provide a consistent interpretation of the source data elements. The CCD includes the following derived variables. • Grade range variables (LEA and school: GSLO, GSHI, LEVEL): These variable are derived from the grades-offered flags reported by SEAs on the EDFacts Grades Offered file (file specification 039). GSLO excludes prekindergarten and kindergarten unless one of those is also the highest grade offered, or where a first grade is also offered by the school. This is done to avoid mischaracterizing a school's grade range in those cases where, except for prekindergarten and kindergarten, a school's grades are all in the middle or high school ranges. Adult Education is not considered in deriving these values. A school is only given the level \"high school\" if it has a \"completion grade\" of 12 or 13. • Title I flags (School: TITLEI STITLEI): A school's Title I participation status is reported in the variable, TITLEISTAT, on the EDFacts \"School\" file (file specification 129). This variable has six possible values. From TITLEISTAT, NCES derives the yes / no flags TITLEI (to indicate a Title I eligible school), and STITLI (to indicate a school eligible for school-wide Title I programs. See the companion file for the CCD School file for details. "}, {"section_title": "Adjustments to state-level data", "text": "In order to produce and publish state and nationally representative estimates for key data elements, NCES makes limited adjustments to state level CCD data. Imputations are usually only done for missing data values. The precise imputation made is decided by NCES analysts on a case by case basis. Most often, a ratio is used to impute a given value. If, for example, a particular staff category was not reported in the current year, the prior year ratio of that staff count to total membership may be used to impute the missing staff count based on current year membership. More particular imputation methods are described below. The state-level data files include an imputation flag that indicates whether the data value was adjusted or imputed. The naming convention for these flags is the letter 'I' followed by the name of the associated variable. The following paragraphs provide general descriptions of the adjustments made to CCD data. The specific imputations made for individual variables are detailed in the companion files."}, {"section_title": "a) Growth Rate Imputation", "text": "Growth rate imputations have been used in prior years of CCD to impute missing staff values in the state level data. Growth rate imputation applies a rate of change to an item from the previous to the current year. The method for growth rate imputation is as follows: (1) calculate the ratio of the current year value for the item to the previous year's value among states reporting the item strictly by the definition (states reporting these items \"strictly by the definition\" are those states that (a) report values greater than 0 for each of the items involved in the imputation; and (b) have no values affected by another imputation or edit); (2) calculate the average of these ratios; and (3) multiply the value reported in the previous year (but missing this year) by this average ratio. The accompanying imputation flag is set to 'P'. NCES' review of data found a number of cases where the same values for the same states had been imputed by this method for three or more years in a row. NCES decided against imputing values from imputed values and that these values would be left as missing for 2015-16. These included the following:  Alaska (CORSUP),  California (PK, LIBSUP, PKTCH),  Montana (LIBSUP)  Nevada (PARA, CORSUP, SCHSUP, LEASUP, LIBSUP)  New Jersey (LIBSUP)  Oregon (PK)  West Virginia (LIBSUP) b) Imputations from prior years' data If a staff count was missing for the current year, but was reported in the prior year, a current year value was imputed using the prior year ratio for the particular staff count to the total staff count. Utah did not submit staff data for 2014-15 or in 2015-16. Staff data were imputed for the 2014-15 public release file using a national growth rate. Rather than use a national growth rate imputation for a second year of missing data, NCES imputed staff values from prior years when Utah reported staff data. The 2015-16 figures were imputed from 2013-14 data using a 2 percent annual increase for school-related positions and a 1 percent annual increase for LEA-related positions. SCHADM and LEAADM were imputed from 2012-13 because of inconsistencies in the 2013-14 values. The imputation flag for values imputed from prior years' data were set to 'IP' (\"Imputed based on prior years' data\")."}, {"section_title": "c) Combine/Contain Disaggregations", "text": "There are a small number of states that had this type of adjustment in 2015-16 for particular staff FTE that are included within another category and therefore needed to be pro-rated out at the SEA level. The approach used in these cases was as follows: 1. Calculate the ratio of each missing item and the item containing the missing value(s) to the total indicated at the end of the \"contains\" statement for each state reporting these items strictly by the definition; 2. Calculate the average of each of these ratios; 3. Calculate the ratio of each average ratio to the sum of the average ratios for the unreported items as well as for the item that will be distributed; and 4. Multiply the reported item by the ratio calculated in step 3 to determine the share for each item. States reporting these items \"strictly by the definition\" are those states that (a) report values greater than 0 for each of the items involved in the edit; and (b) have no values affected by another \"contains\" or \"combined with\" edit. 5. The accompanying imputation flag is set to 'DS' (\"Staff data disaggregation\"). The variables derived this way were: • Hawaii (KGTCH) • Montana (PKTCH and KGTCH) • Nebraska (KGTEACH) • New Hampshire (CORSUP, STUSUP) • Puerto Rico (KGTCH)"}, {"section_title": "d) Guidance Counselors Disaggregations", "text": "The following adjustments were made to FTE values reported for guidance counselors. • If a state did not report GUI, set GUI to zero and set the flag IGUI to 'E' (Data revised by post edit) • If a state submitted all of the guidance counselors as GUI and did not submit ELMGUI or SECGUI-Calculate national percentage distributions for ELMGUI, SECGUI, GUI across states that reported values for all 3 variables. This step should take place after the GUI adjustment above. Apply percentages for ELMGUI and SECGUI to the total figure reported under GUI in the state. Recalculate GUI as reported GUI-SECGUI-ELMGUI. Check that total remains unchanged. Set IELMGUI, ISECGUI, and IGUI flags to 'DG' (\"Guidance Counselors Disaggregation\"). Note that this is different from the disaggregation done in prior years. In prior years data for states that submitted GUI but did not submit ELMGUI or SECGUI, the GUI value was disaggregated only into ELMGUI and SECGUI. Also, staring with 2015-16, this adjustment has been applied to outlying areas."}, {"section_title": "e) Ungraded teachers and students", "text": "SEAs provide additional information on data they report through the EDFacts EMAPS reporting system. Those data include flags to indicate whether the state uses \"ungraded\" as a designation for students or teachers. For the 2015-16 CCD collection, adjustments were made to the reported numbers of Ungraded Students and FTE Ungraded Teachers, based on states' EMAPS data. The following rules were applied."}, {"section_title": "Protecting confidential data", "text": "To protect against individuals being identified from CCD data, the counts of students with IEP plans, LEP students, and students eligible for participation in the National School Lunch Program are subject to perturbation. This perturbation results in minimal changes to the data."}, {"section_title": "IV. Data Usage", "text": "CCD data are released through the following products: • File Documentation (this document); • First Look Report-a short report providing summary tabulations of the data being released and a list of selected findings; • Data files-CCD data files are made available on the CCD website: https://nces.ed.gov/ccd/ccddata.asp; • Companion files-these MS Excel workbooks provide detailed documentation of the data files. They are available with the data files at https://nces.ed.gov/ccd/ccddata.asp. The workbooks include a − variables list; − variable descriptions and category values; − data value statistics (minimums, maximums, means, counts of missing or not applicable); − frequency tables for categorical variables; and − state notes that address known anomalies in individual states' data or provide other state-specific information of relevance to data users. • Online search and query tools listed at https://nces.ed.gov/ccd/index.asp. The CCD is published in data files that parallel the EDFacts files shown above in table 3, with two exceptions: the directory (029) and grades-offered (039) files are published as a single file, and the counts of children with disabilities (002 and 089) are combined into one file with a single count. Each file includes the unique record IDs needed to merge with other files. Below is a general description of these files' content. The three-digit numbers used below identify the individual files submitted by SEAs to EDFacts. Detailed definitions and reporting guidance are provided in the EDFacts file specifications available at https://www2.ed.gov/about/inits/ ed/edfacts/file-specifications.html. Detailed descriptions of the CCD published data are provided in the companion files available at https://nces.ed.gov/ccd/ccddata.asp. • 002-Children with disabilities-school age (LEA) and 089-Children with disabilities-early childhood (LEA) − The combined count of the school age and early childhood students with disabilities. • 141-Limited-English-proficient (LEP) (LEA) − The unduplicated number of LEP students enrolled. • 059-Staff (all levels) − FTE counts of staff by professional category. School-level data includes only the FTE total for all teachers. SEA-and LEA-level include all education profession categories. The CCD does NOT include • data at the classroom, teacher, or student levels; • test scores or achievement data; or • data for private schools. A. Unit identifiers"}, {"section_title": "Identifiers Assigned by the U.S. Department of Education", "text": "Data records in CCD have unique unit identifiers assigned by the U.S. Department of Education that identify individual schools, LEAs, and SEAs and link data from one level to another level within the hierarchical CCD structure. Every school can be linked to an LEA and SEA, and every LEA can be linked to an SEA. Once a unit identifier is assigned to an entity, that entity retains its unit identifier from year to year. If an educational entity closes, that unit identifier is \"retired\" and not used again. The CCD unit identifiers are the same in both the fiscal and nonfiscal collections of the CCD and can be used to link nonfiscal to fiscal data. The unit identifiers assigned by the U.S. Department of Education for the Common Core of Data Survey system are FIPST, LEAID, SCHID, and NCESSCH. A description of the unit identifiers assigned by the Department of Education follows:"}, {"section_title": "a) American National Standard State Code (FIPST)", "text": "Every SEA, LEA, and school in the CCD has a 2-digit American National Standards Institute (ANSI) state code called FIPST. FIPST is the only unit identifier on the SEA level. FIPST is used in conjunction with other information to create unique LEA and school identifiers. See appendix A for a list of ANSI codes."}, {"section_title": "b) Local Education Agency Identification Code (LEAID)", "text": "Every LEA and school in the CCD has a 7-digit LEA identification code called LEAID. The first two digits of the LEAID are the FIPST, which allows every LEA and school to be linked to an SEA."}, {"section_title": "c) NCES School Identification Code (SCHID) and Unique School Identifiers (NCESSCH)", "text": "Every school in the CCD has a 5-digit school identification number called SCHID. The 12-digit combination of LEAID and SCHID creates a unique school identifier called NCESSCH. In years prior to 2015-16, there were approximately 100 cases of duplicate SCHID values within a state. This was corrected in the 2015-16 collection. The Directory companion file includes an ID crosswalk for the affected schools. With this correction, SCHID is unique within an SEA, meaning all schools can be uniquely identified with the combination of FIPST and SCHID. The unique values of SCHID make it possible to track a school longitudinally, even though it may change the LEA with which it is affiliated."}, {"section_title": "Identifiers Assigned by the U.S. State Education Agencies (SEAs)", "text": "SEAs assign unit identifiers to their schools and LEAs for their own data tracking and management systems that are different than the unit identifiers assigned to their schools and LEAs by the U.S. Department of Education. The CCD data file publishes these state-assigned unit identifiers on the School Universe and LEA Universe files as the variables ST_SCHID and ST_LEAID. Data users should note that these unit identifiers may not be unique across SEAs and that the rules that govern the assignment, usage, and formatting of these identifiers may vary from SEA to SEA and even from LEA to LEA within an SEA."}, {"section_title": "B. Membership", "text": "Membership is the count of students enrolled on October 1 of a school year. The CCD collects membership counts at the school, LEA, and SEA levels. CCD has reported membership disaggregated by grade, race-ethnicity, and sex at the school level since SY 1998-99. This level of disaggregation is available at the LEA level starting with SY 2010-11 and at the SEA level starting with SY 2009-10. Information about the level of detail of membership data for a given school year can be found in the corresponding data file documentation or companion file. All membership counts in CCD are head counts, not FTEs. A student may attend more than one school, but each student is counted only once, in the school where he/she spends most of the school day, sometimes called the \"home school\" or \"school of record.\" A student is counted in the membership of the SEA and the LEA responsible for the student, and in the school that he/she actually attends. Some LEAs 'tuition-out' students to schools in other LEAs or even private schools. These students are still counted in the membership of the LEA responsible for them, but they are not reported in membership of any of that LEA's schools. For this reason, school membership aggregated to the LEA level does not always equal the membership reported by the LEA. \"Ungraded\" is included as a grade-level designation in CCD; however, not all states use this designation. For these states, counts of ungraded students and ungraded teachers are reported as \"not applicable.\" Some public elementary/secondary schools also provide adult education, which may engage the elementary/secondary teachers in those schools. Generally, adult education (AE) is outside the scope of the CCD. In order to provide data users with all the data relevant to public schools' functions, information about AE is included in the CCD. This information includes a gradesoffered flag for AE and counts of AE enrollment. AE is not considered in assigning high and low grade values or a school's LEVEL value. AE enrollment is not included in the membership totals by race/ethnicity or in the MEMBER variable, which is the total enrollment for elementary/ secondary grades only. A separate enrollment variable (TOTAL) includes AE membership."}, {"section_title": "C. Staff", "text": "The CCD collects FTE staff counts of teachers and other staff. School-level data only include an FTE for teachers. The LEA-and SEA-level data include FTE counts of teachers by instructional level and other staff categories (instructional aides, instructional coordinators and supervisors, elementary guidance counselors, secondary guidance counselors, other guidance counselors, total guidance counselors, librarians and media specialists, library and media support staff, LEA administrators, LEA administrative support staff, school administrators, school administrative support staff, student support services staff, and all other support staff). FTE is the amount of time required to perform an assignment stated as a proportion of a full-time position and is computed by dividing the amount of time employed by the amount of time normally required for a full-time position. Not all states are able to report all of the staff categories collected by the CCD. Staff categories that are not reported on the SEA level are imputed. Unreported staff categories are not imputed on the school or LEA levels. Aggregations of lower level staff data may not equal the FTE reported at a higher level. Typically, there are staff members working at higher levels that are not counted at the LEA or school level."}, {"section_title": "D. Data Value Exceptions", "text": "NCES uses exception values to indicate missing, not-applicable, or suppressed items."}, {"section_title": "Zero Counts", "text": "Zero counts are valid data values; they do not indicate missing, not-applicable, or suppressed values. A zero count shows that a data element was expected and reported, and there were no instances of this data element. For example, a school that currently offers education services to students in grade 12 but currently does not enroll any grade 12 students would report a grade 12 enrollment/membership count equal to zero (0)."}, {"section_title": "Missing Data", "text": "Missing data occur when a value for a data element was expected but not reported. For example, a school that enrolls students in grade 12 but cannot or did not report the number of 12th-graders in the school has missing data for grade 12 enrollment/membership. In CCD data files, missing numeric data are coded as \"-1\" and missing character or categorical data are coded as \"Missing.\""}, {"section_title": "Not Applicable Data", "text": "A data element is \"not applicable\" when a value for a data element was not expected, and the state did not report a value for that element. For example, an elementary school with a high grade of 5 would not have applicable grade 12 enrollment/membership. In CCD data files, notapplicable numeric data are coded as \"-2\" and not applicable character or categorical data are coded as \"N/A.\""}, {"section_title": "Suppressed Data", "text": "LEA-and school-level data values that have been suppressed (see discussion above) are replaced with a -9."}, {"section_title": "Recoding for Exception Values", "text": "Since negative numeric values represent missing, nonapplicable, or suppressed data-and not actual data values-data file users may want to recode these before performing data analyses. The following SAS code can be used to convert negative values to \"missing\" in the SAS data file. data new; set old; array remove (*) _numeric_; do i = 1 to dim (remove); if remove (i) < 0 then remove (i) = .; end; drop i; run; E. Guidelines for Aggregating CCD Data For many analyses, it is useful to aggregate data from lower levels to higher levels. However, higher level aggregations can be misleading when data at lower levels are missing. NCES strongly encourages researchers to consider the possible effect of missing or suppressed data on their analyses. The percentage of cases (schools or LEAs) reporting valid values can be used to evaluate the reliability of the aggregated number. The denominator in this percentage is the number of cases in the aggregation excluding those cases not expected to report the item (i.e., cases with a value of -2); the numerator is the number of those schools providing valid data (values greater than or equal to zero). The difference between them are cases of missing (-1) or suppressed (-9) values. NCES suggests the following guidelines for interpreting this percentage. • If the percentage is greater than 95 percent, the aggregation can be considered reliable. • If the percentage is less than 95 percent, but more than 85 percent, the aggregation should be interpreted with caution. • If the percentage is less than 85 percent, the aggregation should be considered unreliable."}, {"section_title": "F. Location vs. Jurisdiction", "text": "In the CCD, schools and LEAs are included under the jurisdiction responsible for their administration, which is not necessarily the state where the LEA or school is located. Some examples of this situation include • SEAs that operate schools in a neighboring state; • charter school operators/administrators based in one state that operate schools in one or more states other than the state in which they are based. These entities are often used as the LEA for the charter school they operate or administer; and • schools administered by the BIE and the DoDEA that are located in various states across the country. In these cases, the state abbreviations used in the physical location or the mailing address will not necessarily reflect the SEA responsible for administering the school or LEA. The first two digits of the LEA and school ID numbers are the state code (FIPST) for the responsible statelevel jurisdiction. FIPST should be used to group schools and LEAs by their administrative state. BIE and DoDEA have been assigned their own codes in CCD for this purpose. (See appendix A)."}, {"section_title": "G. Membership", "text": ""}, {"section_title": "Shared-Time Reporting", "text": "A student may attend more than one school, but each student is counted only once, in the school where he/she spends most of the school day-the \"home school\" or \"school of record.\" For example, a student may attend a regular high school for most of the day and a career/technical (CTE) high school part time. That student is typically counted in the membership of the regular high school, not the CTE high school. The shared-time flag (SHARED_TIME) on the CCD school file identifies schools with part-time students. Because these part-time students are not counted in the membership of the shared-time school, that school's membership count understates the number of students the school actually serves."}, {"section_title": "Differences in Cross-Level Totals", "text": "A student is counted in the membership of the SEA and the LEA responsible for the student, and in the school that he/she actually attends. An LEA or a state may \"tuition-out\" a student to another LEA, state, or even a private school. For this reason, the school membership aggregated to the LEA level may not equal LEA membership, and school membership and LEA membership aggregated to the state level may not equal state-reported membership."}, {"section_title": "Changes in race/ethnicity reporting", "text": "Prior to SY 2008-09, NCES asked states to report student enrollment counts by five racial/ethnic categories. Starting in SY 2008-09, two additional race/ethnic categories were added (Hawaiian/Pacific Islander and \"Two or more races\"). For reporting in SY 2008-09 and SY 2009-10, SEAs had the option to use either the 5-category reporting or the 7-category reporting. A flag was added to the data file to indicate which category set was used. Since SY 2010-11, all reporting SEAs have reported enrollment counts using all seven categories."}, {"section_title": "H. Bureau of Indian Education Schools", "text": "The BIE supports elementary and secondary schools and dormitories located on 63 reservations in 23 states, including off-reservation boarding schools and schools directly controlled by tribes and tribal school boards under contracts or grants with the BIE. The bureau also funds residential programs for students at boarding schools and at dormitories housing those attending nearby tribal or public schools. Each BIE school is also its own LEA. These LEAs are of TYPE '2' (Supervisory Union Member). BIE does not report any supervisory unions (LEA TYPE '3'). Instead, the SU members are linked by the supervisory union ID (UNION) to one of 22 \"Education Line Offices\" with an LEA type of '4' (Regional LEA). The supervisory union member entities were created to report student performance data required for other EDFacts collections. The Education Line Offices do not have this data. Some state governments provide some support to BIE schools within their borders. To account for this funding, the state governments may include a BIE school in their EDFacts/CCD reporting. In a limited number of cases, the state also reports the membership for these schools, creating the possibility of double-counting these students in CCD. There are 10 such schools and six such LEAs in three different states; these are the same schools and LEAs in each year of data. To identify these schools and their LEAs, a flag was added to the data files starting with the 2009-10 collection (BIES in the school file; BIEA in the LEA file). A value of 'Yes' in these fields indicates a school or LEA whose membership is reported by both BIE and a state. (The default value for these fields is 'No'.) In all NCES publications based on CCD data, these schools and LEAs are attributed to the BIE only."}, {"section_title": "I. New York City Public School District", "text": "Prior to SY 2005-06, New York City (NYC) schools were reported as part of a single, regular LEA. In SY 2005-06, New York began reporting NYC schools as part of a supervisory union with 33 member LEAs. NCES continues to report NYC schools as a single LEA. However, on the CCD data files, they appear in the supervisory union configuration. NCES aggregates data from the 33 component LEAs with the single supervisory union to provide estimates for the NYC Public Schools. This aggregation is done by selecting schools or LEAs with a FIPST code = 36 (for the state of New York) and a supervisory union identification number (UNION) = 300. added to the CCD starting with the SY2013-14 collection. It indicates the provision under which a school is participating in the NSLP. • The Department of Agriculture has been encouraging school systems to certify for NSLP by using a count of \"directly certified\" students in place of the individual household applications used in past years. Students are directly certified when the appropriate agency certifies the participation of the student, or the student's family, in various public assistance programs. The number of students directly certified is a subset of the total number of students eligible for NSLP. It is multiplied by 1.6 to provide an estimate of the percentage of NSLP-eligible students. Some schools, especially those participating under the CEP (see next paragraph) only have directly-certified counts to report. • In 2010, the Healthy, Hunger-Free Kids Act was amended to provide an alternative to household applications for free and reduced-price meals in high-poverty LEAs and schools. This alternative is called the Community Eligibility Provision (CEP). CEP was implemented to increase student participation in meal programs by expanding access to free meals to all students and decrease household and administrative burden by not requiring regular applications to establish eligibility for free lunch. However, while CEP improves the efficiency of the NSLP, it also results in the loss of individual student-level FRPL eligibility data in participating education agencies, given that CEP schools are prohibited from collecting NSLP household applications. Schools qualifying under CEP no longer count students qualifying for reduced-price lunches since all students are provided a free lunch. CEP schools may report all students as eligible for free lunches, regardless of individual student's economic status, since all students are provided a free lunch. For more information on changes to the NSLP and their effects on FRPL counts, please refer to: Free and Reduced-Price Lunch Eligibility Data in EDFacts: A White Paper on Current Status and Potential Changes, available at https://www2.ed.gov/about/inits/ed/edfacts/index.html. state or equivalent entity may consist of a single congressional district or similar representational area. The American National Standards Institute (ANSI) provides the structure of numeric codes for representing congressional districts and similar areas defined for the various congresses of the United States. The congressional district codes are two-digit numeric codes used to represent the congressional districts of each multidistrict state of the United States. For example, the First Congressional District is identified as \"01,\" the Second Congressional District as \"02,\" etc. The Congressional District in a state with only a single representative elected at large is designated as \"00.\" In the 110th Congress, this applies to Alaska, Delaware, Montana, North Dakota, South Dakota, Vermont, and Wyoming. For an entity with a nonvoting delegate-the District of Columbia, American Samoa, Guam, Puerto Rico (whose delegate is referred to as a \"resident commissioner\"), and the U.S. Virgin Islands-the representational area is designated as \"98.\" Those entities with no representation in the Congress-the Northern Mariana Islands, Palau, and the several U.S. minor outlying islands are designated as \"99.\" Although congressional district codes are unique within each state and equivalent entity, and for each Congress, the congressional districts in different states may have the same code. For example, the First Congressional District of Alabama and of Arizona are both coded \"01.\" Since the CCD requires the identification of congressional districts in more than one state, the congressional district code is preceded by the ANSI state numeric code. For example, the First Congressional District of Arizona is coded \"0401,\" with the first two digits (04) representing the ANSI state numeric code."}, {"section_title": "core-based statistical area (CBSA)", "text": "If an area that qualifies as an MA has greater than one million people, two or more CBSAs may be defined within it. Each CBSA consists of a large urbanized county or cluster of counties (cities and towns in New England) that demonstrate very strong internal economic and social links, in addition to close ties to other portions of the larger area."}, {"section_title": "county name, local education agency (LEA) file", "text": "The name of the county in which a LEA is located. Prior to SY 2006-07, the county assignment was based on the counties of the schools associated with the LEA, weighted by student enrollment."}, {"section_title": "county name, school file", "text": "The name of the county in which a school is located."}, {"section_title": "full-time equivalent (FTE)", "text": "The amount of time required to perform an assignment stated as a proportion of a full-time position and computed by dividing the amount of time employed by the time normally required for a full-time position."}, {"section_title": "general educational development (GED) test", "text": "A comprehensive test used primarily to appraise the educational development of students who have not completed their formal high school education and who may earn a high school equivalency certificate through achievement of satisfactory scores."}, {"section_title": "grade 13", "text": "Grade 13 is used to designate high school students who are enrolled in programs where they can earn college credit in an extended high school environment, or CTE students in a high school program that continues beyond grade 12. (See section 2.5 of the 052-Membership file specifications for a more detailed description.) There is a grade-offered flag for grade 13 on the directory files; it is a possible low and high grade (GSLO and GSHI); and it is considered in the derivation of the school LEVEL variable. Enrollment counts for grade 13 students are included in the membership file and they are included in the MEMBER count of students."}, {"section_title": "grade span offered", "text": "The span of grades intended to be served by a school or agency, whether or not there are students currently enrolled in all grades. If a high school also has a prekindergarten program, the grade span of the high school is reported as a high school, not as a PK-12 school. In addition, the ungraded designation (UG) cannot be used in a grade span unless the whole school consists of ungraded students, and in this case, the grade span is reported as UGUG. \"Grade span\" was calculated from school membership through SY 1997-98 and first collected as a separate item in SY 1998-99."}, {"section_title": "graduate, high school", "text": "A student who received a diploma recognizing the completion of secondary school requirements during the previous school year and subsequent summer school. It excludes high school equivalency and other high school completers (e.g., those granted a certificate of attendance). (See also, \"Diploma Recipient.\") guidance counselor/director Professional staff assigned specific duties and school time for counseling students and parents, addressing learning problems, evaluating student abilities, and assisting students in career and personal development. The state applies its own standards in apportioning the aggregate of guidance counselors/directors into the elementary-and secondary-level components. professional instructional support staff). Excludes supervisors of instructional or student support staff. local education agency ID Seven-digit code assigned by NCES that uniquely identifies each LEA. Digits 1 and 2 are the ANSI state code; digits 3-7 are assigned by NCES and are unique within a state. Large city: A principal city of a metropolitan CBSA, with the city having a population greater than or equal to 250,000. Midsize city: A principal city of a metropolitan CBSA, with the city having a population fewer than 250,000. Urban fringe of a large city: Any incorporated place, Census-designated place, or nonplace territory within a metropolitan CBSA of a large city and defined as urban by the Census Bureau. Urban fringe of a midsize city: Any incorporated place, Census-designated place, or nonplace territory within a metropolitan CBSA of a midsize city and defined as urban by the Census Bureau. Large town: An incorporated place or Census-designated place with a population greater than or equal to 25,000 and located outside a metropolitan CBSA or inside a micropolitan CBSA."}, {"section_title": "B-11", "text": "Small town: An incorporated place or Census-designated place with a population fewer than 25,000 and greater than or equal to 2,500 and located outside a metropolitan CBSA or inside a micropolitan CBSA. Rural, outside CBSA: Any incorporated place, Census-designated place, or nonplace territory not within a metropolitan CBSA or within a micropolitan CBSA and defined as rural by the Census Bureau. Rural, inside CBSA: Any incorporated place, Census-designated place, or nonplace territory within a metropolitan CBSA and defined as rural by the Census Bureau."}, {"section_title": "locale, urban-centric", "text": "An indication of school's location relative to a populous area. The locales assigned to school districts are based on the locale code of their schools, weighted by the size of the schools' membership. The urban-centric locale assignment system has been used since SY 2006-07. The locale code categories are defined below. City, large: Territory inside an urbanized area and inside a principal city with a population of 250,000 or more. City, midsize: Territory inside an urbanized area and inside a principal city with a population fewer than 250,000 and greater than or equal to 100,000. City, small: Territory inside an urbanized area and inside a principal city with a population fewer than 100,000. Suburb, large: Territory outside a principal city and inside an urbanized area with a population of 250,000 or more. Suburb, midsize: Territory outside a principal city and inside an urbanized area with a population fewer than 250,000 and greater than or equal to 100,000. Suburb, small: Territory outside a principal city and inside an urbanized area with a population fewer than 100,000. Town, fringe: Territory inside an urban cluster that is fewer than or equal to 10 miles from an urbanized area. Town, distant: Territory inside an urban cluster that is greater than 10 miles and fewer than or equal to 35 miles from an urbanized area. Town, remote: Territory inside an urban cluster that is greater than 35 miles from an urbanized area. Rural, fringe: Census-defined rural territory that is fewer than or equal to 5 miles from an urbanized area, as well as rural territory that is fewer than or equal to 2.5 miles from an urban cluster."}, {"section_title": "B-12", "text": "Rural, distant: Census-defined rural territory that is more than 5 miles, but fewer than or equal to 25 miles from an urbanized area, as well as rural territory that is more than 2.5 miles but fewer than or equal to 10 miles from an urban cluster. Rural, remote: Census-defined rural territory that is more than 25 miles from an urbanized area and is also more than 10 miles from an urban cluster. longitude Longitude is the east or west angular distance from the prime meridian, with positive values going east and negative values going west. When combined with latitude, it reflects an estimation of where the school is physically situated on the street segment to which it was coded. Coordinate degrees, minutes, and seconds have been converted to, and are displayed in terms of, their decimal equivalent. The digits to the left of the decimal point represent the number of degrees from the prime meridian. The digits to the right of the decimal point represent the fraction of the next degree carried out to six decimal places. For example, if a school's longitude is 90 degrees, 15 minutes west, then it is shown as -90.250000."}, {"section_title": "magnet school or program", "text": "A magnet school or program is a special school or program designed to: • Attract students of different racial/ethnic backgrounds for the purpose of reducing, preventing or eliminating racial isolation (50 percent or more minority enrollment); and/or • Provide an academic or social focus on a particular theme (e.g., science/mathematics, performing arts, gifted/talented, or foreign language.)"}, {"section_title": "media specialist", "text": "See \"Library and Media Support Staff.\""}, {"section_title": "membership", "text": "The count of students on the current roll taken on the school day closest to October 1, by using either the sum of original entries and re-entries, minus total withdrawals or the sum of the total present and the total absent."}, {"section_title": "metropolitan statistical area (MSA)", "text": "An area consisting of one or more contiguous counties (cities and towns in New England) that contain a core area with a large population nucleus, as well as adjacent communities having a high degree of economic and social integration with that core."}, {"section_title": "metropolitan status (metro status)", "text": "Metro status is defined as the classification of the reported location of an education agency's administrative office, relative to an MSA. (See also \"Metropolitan Statistical Area.\")"}]