[{"section_title": "Abstract", "text": "In industrialized countries Alzheimer's disease is becoming a pandemic. Over the next few decades one in six people are predicted to have Alzheimer's disease. This will evolve into a public health tragedy. Unfortunately there is a problem with dementia research. After more than a century of research we cannot answer basic questions about the disease, whether the biomarkers are truly the disease or whether these biomarkers are symptoms of another yet unknown disease. This paper summarizes the literature to show that there are other correlates-and possible causes-of Alzheimer's disease that have not received attention, but if the disease is approached from a public health perspective, then the disease can be organized under the four potential integrated processes of Trauma, Penumbra, Perfusion and Plasticity. Through this re-framing of the disease as a public health problem an opportunity emerges that can expand and reinvigorate research in Alzheimer's disease. Such new insights can elucidate a better and fuller understanding of the disease and provide some real hope to defining a road map to a cure."}, {"section_title": "", "text": "left out of the National Institute on Aging-Alzheimer's Association (NIA-AA) 2011 research agenda for Alzheimer's disease [2] .\nThe Amyloid Cascade hypothesis is the dominant theory in Alzheimer's disease [3] . This theory postulates that the deposition of the amyloid-β peptide (plaques) in the brain is a central event in Alzheimer's disease pathology, followed by tau protein deposits (tangles) that clog up the brain causing impaired cognition leading to dementia. As a result of this theory, research on Alzheimer's disease has exclusively focused on neurobiology and biochemistry. This exclusivity was reinforced when the Amyloid Cascade hypothesis was adopted by the 2011 NIA-AA guidelines that concentrate on identifying biomarkers in the preclinical stage of the disease [4] .\nBut research continues to expose anomalies that cannot be easily explained by these guidelines [5, 6] . Additionally, there is now a valid and persuasive criticism of the current research methodologies in Alzheimer's disease: the lack of evidence that biomarkers cause the disease; that the disease behaves more as a syndrome with diffuse expression; and that the methodology used to study the clinical aspects of Alzheimer's disease is unreliable and invalid [7] [8] [9] . In particular, although the plaques and tangles seem to be more prevalent among people with Alzheimer's disease there are people that live independently and unaware of this neuropathology in their brain [10, 11] . While in human clinical trials, patients using experimental drugs that succeeded in removing or inhibiting the development of plaques, showed worse cognitive performance than the controls [12] [13] [14] .\nThe problem was then-and is now-that the relationship between the neurobiology and the disease is not distinct. Despite such lack of evidence, the Amyloid Cascade hypothesis remains resilient due to the lack of counter paradigms to challenge its dominance in guiding Alzheimer's disease research [15] . Emerging clinical studies are however taking a more pragmatic approach; showing how lifestyle changes reverses cognitive decline and how other factors are involved in Alzheimer's disease [16, 17] . As a result, there is growing support for a broader approach public health perspective to studying the causes and mechanisms of Alzheimer's disease. Under this perspective the seeming disparate processes of Alzheimer's disease can be"}, {"section_title": "Introduction", "text": "Alzheimer's disease is evolving as a disease of global proportions. With life expectancy in industrialized countries inching up to 85 years, and where one-third of those of this age are predicted to have Alzheimer's disease [1] , it is anticipated that one in six of the total population of industrialized countries will have the disease. Alzheimer's disease is maturing into a 21st century pandemic. But there is a problem. In the last hundred years of research we have gained very little significant insight into stopping this disease.\nThe search for exclusive biomarkers for Alzheimer's disease-a neuropathology that signifies the deterioration of behavior associated with Alzheimer's disease-continues to elude researchers. Alzheimer's paradigm is still too narrowly defined through biomarkers-biological, genetic and chemicalwhen in the literature there are other factors that are shown to contribute to this disease. The aim of this paper therefore is to highlight alternate interpretations of Alzheimer's disease mechanisms and to readdress why such mechanisms have been"}, {"section_title": "Diagram: Schematic representation showing an initial", "text": "Trauma causing a Penumbra that is moderated and mediated by Plasticity and Perfusion.\nThe Diagram provides a schematic diagram of a model that defines how these four processes might interact in order to permit research to understand and examine delaying or preventing Alzheimer's disease. In this model an initial Trauma that turns into a Penumbra-an initial cluster of cell deathwhich is more likely to grow and cause Alzheimer's disease if the brain is denied two mediating and moderating factors: the lack of adequate cerebral Perfusion and reduced Plasticity to assimilate the Penumbra. Without these moderating factors of Plasticity and Perfusion, the Penumbra will grow and affect larger areas of the brain. This broader interpretation of Alzheimer's disease assimilates both the traditional Amyloid Cascade hypothesis, but also broadens the scope to address contributing factors that are emerging in public health."}, {"section_title": "Trauma", "text": "The initial trauma that starts Alzheimer's disease is unknown. Although most of the research focuses on genetic mechanisms, there is growing evidence that other, more relevant, mechanisms exist: viral (HIV/AIDS, herpes simplex virus type I, Varicella zoster virus, cytomegalovirus, Epstein-Barr virus), bacteria (syphilis and Lyme-disease/borrelia), parasites (toxoplasmosis, cryptococcosis and neurocysticercosis), behavior (Alcohol, cigarette smoking, recreational drugs, concussion/mild/severe brain trauma) environmental elements (possibly aluminum), infections (possibly prions such as in Cretchfeldt-Jakobs disease), vascular causes (stroke, multiple-infarct dementia hydrocephalus, and injury or brain tumors) and emotional trauma. There is literature that correlates all of these factors with Alzheimer's disease, but none of these factors appear in the NIA-AA research agenda for Alzheimer's disease."}, {"section_title": "Genes", "text": "Although there is a growing list of genes that could determine Herpes simplex virus type I-non-sexually transmittedremains ubiquitous [25] . Once infected, the virus remains in the peripheral nervous system and cause encephalitis that affects the same regions of the central nervous system (temporal and frontal cortex, and hippocampus) as those most affected by Alzheimer's disease [26] . Emerging studies [27] report that there is an increased risk of Alzheimer's disease when the virus is present in combination with the genetic marker of APOE-ε4 allele, while independently neither increase the risk of Alzheimer's disease. Similar to the herpes simplex virus type I, the Varicella zoster virus has also been more prevalent among patients with atherosclerotic dementia [28] . In contrast, controlsschizophrenics or patients with other psychiatric disorders or in groups of healthy people-had lower prevalence. Similarly, chlamydia pneumonia infections are found in 90% of Alzheimer's disease patients, with the virus itself found inside the plaques in their brain [29] . These studies are still correlational, but they point out a growing interest in viral infections and how they can cause or promote Alzheimer's disease."}, {"section_title": "Bacteria", "text": "Alois Alzheimer-who identified the disease in 1907-was primarily interested in syphilis. For centuries, other than just old age, syphilis was the main and only known cause of dementia before Alzheimer's disease was identified. Today, although neurosyphilis is rare-where the bacteria causes neuropathology that results in clinical features of dementia-another bacterium gaining interest is Lyme disease. Lyme dementia has become a greater concern because it is the most common vector-borne disease in the northern hemisphere [30] . Since there is no cure for Lyme disease, the expectation is that more patients will develop Lyme dementia in the near future [31] ."}, {"section_title": "Behavior", "text": "Alcohol has had a long history with mental health and is already a public health concern. There has been an increasing interest in the relationship between a history and heavy intake of alcohol with Alzheimer's disease. There is now evidence that this relationship is independent and not mediated by history of hypertension, cardiovascular disease, or head injury [32] . Meta-analyses studying the relationship between alcohol consumption and risk of Alzheimer dementia and dementia reported a 'J' shaped relationship, with moderate drinking showing moderate protection [33, 34] . A history of high alcohol intake has been shown to increase the risk of Mild Cognitive Impairment and Alzheimer's disease in a large Canadian study [35] , in a US study [36] and; in a Brazilian study [37] . Excessive alcohol use may damage the brain due to toxic effects of alcohol, metabolic changes in the brain, neurotransmitter imbalances and nutritional deficiency injury [38] . [44] [45] [46] . Smoking and secondhand smoking is associated with a 50-60% risk of Alzheimer's disease [47] [48] [49] [50] [51] , having a dose effect-the more you smoke the higher the risk [52, 53] . This is also related to the vascular changes."}, {"section_title": "Concussion or mild traumatic brain injuries (MTBI)-incurred", "text": ""}, {"section_title": "Vascular", "text": "In a review of the literature [54] , researchers reported that stroke is one of the leading causes of disability, Alzheimer's disease and death in the USA. While many stroke victims improve, others worsen. Three months after a stroke, 25-33% of patients express Alzheimer's disease, and an even greater proportion have severe cognitive impairment [55] . Stroke doubles the risk of Alzheimer's disease even after adjusting for age, sex, education, and exposure to individual stroke risk factors [56] . With over 790,000 victims of stroke each year in the United States, it is an important etiology of Alzheimer's disease that is often neglected in research."}, {"section_title": "Environmental", "text": "Epidemiological studies suggest that there is a link between metal, especially aluminum and Alzheimer's disease. Aluminum may not be as innocuous as once thought since it may actively promote the onset and progression of Alzheimer's disease [57] , as a form of chronic aluminum neurotoxicity [58] . Although rare nowadays, it was first described among dialysis patients [59] where aluminum acted as a neurotoxin trauma that caused Alzheimer's disease [60] .\nSimilar to plaques and tangles-misshapen amyloid and tau proteins that clamp together-a novel form of human prion disease is linked with bovine spongiform encephalopathy (BSE) and Creutzfeldt-Jakob's disease [61] . The hallmark of prion disease is the accumulation of misfolded protein that is toxic to neuronal cells [62] ."}, {"section_title": "Emotional", "text": "Adverse childhood experiences start a cascade of risk behaviors that are associated with enduring changes in the nervous, endocrine, and immune systems [63] . In a Californian study of 1116 elderly community residents, self-reported cognitive function was lower than expected for those who had experienced sustained economic hardship, even after adjusting for age, sex, and co-morbidity [64] . Poverty, larger family size and urban residence were associated with increased Alzheimer's disease risk [65] . Some adverse childhood events continue to have a negative effect on later-life cognitive performance on some people, while others seem immune, underlying the necessity to consider events individually and not as global test scores [66] .\nAll these variables-genetic, viral, bacteria, behavior, environmental, vascular, and emotional-act as a trauma, a shock, to the brain, affecting the brain independently or in combination. There might be other traumas that are as yet unidentified. But once there is a trauma to the brain, then the body reacts in a very specific way. Researchers a century ago reported that there was a shadow, a halo that follows from a trauma. Clinically, this is referred to as a penumbra. There are indications [67] that although the origins of the trauma in Alzheimer's disease are undefined, the process suggests that cell death extends beyond the region of damaged tissue. Trauma results in an initial assault of cell death followed by a penumbra a broader cluster of neuronal death."}, {"section_title": "Penumbra", "text": "Perusini made an interesting early observation that: 'The glia, then, develop around the deposits and encapsulates them just as they usually do with every foreign body (in the broadest sense)' [68] (p121). Such an interpretation suggests that the growth of plaques could be a protective response, where the initial toxic trauma is enveloped into harmless mass by other cells [69] . Singular or multiple traumas-like a stroke-kill off a significant number of neurons and, in response the brain protects itself with an envelope of white cells (glial) transforming the toxic clump inert. To some degree, this happens all the time. The brain is in constant state of change. Alois Alzheimer himself identified this penumbra as a halo, or a shadow: 'Sometimes there are also rodlike cell elements of obvious glial origin lying in the halo' [70] (p80). The dual nature of this process-where the damage is quarantined and contained, while in other cases there is a further shockwave of neuronal death beyond the initial trauma-is an enigma. Two possible moderators of this spread of the penumbra is cerebral plasticity-potential for neurons and glial cells to grow; and perfusion-blood flow in the brain that provides the energy-hungry neurons the necessary nutrients, required to function and repair themselves."}, {"section_title": "A New Public Health", "text": "Paradigm for Alzheimer's Disease Research Copyright: © 2015 Garrett et al."}, {"section_title": "Plasticity", "text": "Within a public health approach, one of the moderating or mediating factors that affect the development of Alzheimer's disease is Plasticity. Although the brain naturally shrinks with age, brain atrophy in Alzheimer's disease is five-fold higher during 7-10 years of the disease, translating to approximately 200-400g of brain mass loss [71] . Such loss is in addition to the plaques and tangles [72] . But there is a process that counteracts this loss. Ernesto Lugaro in the early 1906 was responsible for introducing the term plasticity into neuroscience [73] . Lugaro refers to 'psychic plasticity; plasticity of the neurons; plasticity of the neurofibrils' a process that continues throughout life in order to establish new connections between neurons [74] . Such development is apparent in maturation, learning and even functional learning after brain damage throughout the lifespan [75] . In some cases neuronal growth takes place on a daily basis [76] . A growing body of evidence is exposing the capacity of the brain to regenerate throughout lifespan through education [77, 78] ."}, {"section_title": "Education", "text": "In the now famous Nuns' Study [79] Snowdon found that 8% of the nuns who had the most severe level of neurological disease in their brain behaved and acted free from dementia. The researchers explained this finding by arguing that education is an important moderating factor [79] . There seems to be an inverse dose-response relation between education and Alzheimer's disease [80] , with education acting as a proxy for cognitive reserve [81] . Education might not only increase capacity and plasticity but might also modify behavior away from risk behaviors that promote Alzheimer's disease [82] ."}, {"section_title": "Dancing/Music/Body Movement", "text": "The power of music and dancing-including other social activities-correlate with positive gains in cognitive tests. Institutionalized older adults improved faster than communitybased participants in studies that promoted music, dance, singing, food preparation, and selecting pictures [83] . The results may be more than just exercise and social engagement, although the exact mechanism is unknown [84] . In a now classic longitudinal study [85] looking at the frequency of participation in leisure activities and physical-activity, after a follow-up period of 5.1 years only reading, playing board games, playing musical instruments, and dancing were associated with a reduced risk of Alzheimer's disease and vascular dementia. Because these activities were studied in addition to physical activity, they provided an additional benefit to cerebral perfusion. Numerous studies have measured brain volumes of professional pianists, reporting that the more hours a musician played the more heavily myelinated or tightly packed their white matter axons were [86] . Such changes might also be specific to the type of learning, so that white matter architecture differs between musicians and nonmusicians [87] ."}, {"section_title": "Brain Exercises", "text": "The utility of cognitive training programs in delaying cognitive decline has gathered momentum since the first large randomized controlled double-blind trial using a commercially available cognitive training program [88, 89] . The two most widely cited ongoing studies are ACTIVE and IMPACT [90, 91] . Even patients with early to moderate Alzheimer's disease using computer exercises had better performance on cognitive tests [92] . Gains were recorded in standardized measures of memory and attention ten years after the intervention, on tests that were not part of the initial intervention [93] . Since there was growth in the hippocampus these benefits seem to involve brain plasticity [94] . The idea that interacting with the environment continues to regenerate and change the brain throughout life-both positively and negatively-supports the hypothesis that brain plasticity offers a possible mediating mechanism through which the brain might be provoked to repair itself [95] . Cognitive training programs, music and dancing have been associated with brain growth [94.96] , and such plasticity/neurogenesis seems to delay the onset of Alzheimer's disease [97, 98] ."}, {"section_title": "Cerebral Perfusion", "text": "The fourth process in this public health model is Perfusionblood flow to the brain. At autopsy, 60-90% of patients with Alzheimer's disease exhibit variable cerebrovascular pathology and almost 30% show evidence of cerebral infarction [99, 100] . As part of a multistage theory of Alzheimer's disease, having the necessary blood flow to the brain is a linchpin of a healthy brain. Evidence is mounting that vascular risk factors launch a cascade of cellular and molecular changes that initiate cognitive deficits and eventual progresses to Alzheimer's disease [101] . There is a strong indication that there is an association between diminished (hypo) perfusion and Alzheimer's disease. Cerebral perfusion is a balance that must be maintained within narrow margins. Too little pressure causes brain tissue to become ischemic-shortage of oxygen and glucose needed for cellular metabolism-while too much pressure causes cellular damage. Cerebral perfusion is closely aligned with vascular dementia. Although the brain is only 2% of the body weight it consumes 15-20% of all cardiac output and 20% of all oxygen in the body. Such balance is maintained by complex mechanisms, and one such mechanism-through vasoconstriction and vasodilation-is temperature [102] ."}, {"section_title": "Temperature", "text": "Perhaps not surprisingly, older adults have slightly lower body temperatures than younger adults [103] . Average temperature for older adults is 97.7°, lower than the 98.6° F benchmark. Although a systematic review reports great variance in temperature across gender and individuals, making aggregate statistics unreliable predictors [104] . Biologically, a lower temperature seems to enhance longevity. In the Baltimore Longitudinal Study of Aging, men with a core body temperature below the median lived significantly longer than men with body temperature above the median [105] . However the contradiction is that lower temperature might also results in lower perfusion. The association of age with Alzheimer's disease might be mediated by decrease in body temperature, an avenue of research that remains untapped."}, {"section_title": "A New Public Health Paradigm for Alzheimer's Disease Research", "text": ""}, {"section_title": "Copyright:", "text": "© 2015 Garrett et al."}, {"section_title": "Activity", "text": "Perfusion can also be controlled by activity. Being active enhances the blood flow to the brain. In a four-year longitudinal study [106] retirees who elected to become physically inactive exhibited significant decline in perfusion while those who continued to work or engage in regular activities maintained more constant perfusion levels. Interestingly, the relationship between perfusion and cognition was acknowledged when the researchers reported that active retirees scored better on cognitive testing after a four-year follow-up. Blood flow to the body is important for all organs, including the brain. Being physically active has been shown to decrease the incidence or delays the onset of Alzheimer's disease [107, 108] , [94] . So much so that Alzheimer's disease can be defined as a 'diseasome of physical inactivity' [109] , where activity delays such risks [110] ."}, {"section_title": "General Anesthetic", "text": "The most common sudden hypo perfusion occurs under general anesthetic [111] . Evidence for anesthesia-induced neurotoxicity is mounting suggesting that general anesthetics may be neurotoxic to both young and aging brains [112] . In a population of healthy elderly patients, undergoing non-vascular abdominal surgery [113] cerebral desaturation-an indication of hypoperfusionoccurs in one in four patients. When this happens, those patients have higher incidence of early postoperative cognitive decline and longer hospital stay. Maintaining a consistently healthy cerebral perfusion is important to brain health. It would be informative to see changes in the penumbra of stroke patients who undergo general anesthetic, an avenue of research that still needs to be undertaken. There are many similarities between vascular dementia and Alzheimer's disease. Something that even Alzheimer entertained: 'The question is: are these cases to be assigned to Dementia senilis or to arteriosclerosis? …Perhaps this arrangement of atrophy could be related to the vascular supply of the temporal lobe.' [70] (p97). Since vascular dementia is the second largest category of dementia it is important to address the relationship and difference. Alzheimer's disease and vascular dementia are the two most common forms of dementia, sharing many common medications, pathological, symptomatic and neurochemical features [20] ."}, {"section_title": "Discussion", "text": "The public health model described and presented in this introduction defines how four processes might interact to generate or possibly retard or delay Alzheimer's disease. An initial Trauma that turns into a Penumbra is more likely to cause Alzheimer's disease if the brain is denied two mediating and moderating factors: a lack of adequate cerebral Perfusion, or if there is a lack of Plasticity. Without these two factors the penumbra will grow and affect larger areas of the brain-and such damage will go beyond plaques and tangles. This broader public health interpretation of Alzheimer's disease assimilates both the traditional Amyloid Cascade hypothesis [3] and broadens the scope to include emerging research in the public health arena, some of which were introduced in this paper. More importantly, these mechanisms also address the mounting anomalies in Alzheimer's disease research. There is more than one trauma that results in similar outcomes. The initial trauma might result in a penumbra which might or might not progress. The neurological disease might or might not affect cognition. These multiple pathological mechanisms-that all inter-relatehave not been explored comprehensively. A healthy lifestyleand the effect this has on cerebral perfusion-has been shown to delay Alzheimer's disease. There is also a century of work that looks at how learning and education seems to have a protective influence against Alzheimer's disease-plasticity, neurogenesis and capacity can delay, protect, and recover-even after a major trauma like a stroke [114] . Older age does not necessarily lead to Alzheimer' disease. When Henrikje van Andel-Schipper died in 2005, she was the oldest woman at age 115, and in post-mortem examination her brain showed no signs of neuropathology [115] . It seems some people escape dementias. Long-lived older adults escape or delay dementias because they maintain adequate perfusion, have functional plasticity and have evaded major traumas [116] .\nWithout a broader a public health approach dementia research will remain confined within research silos away from any chance of rich crosspollination. But within this public health a more nuanced approach to the many different types of dementias can be explored. Different causes of the many types of dementias might hold unique insights into their unique cures [17] . Of equal importance is to examine how most older adults escape Alzheimer's disease, an approach that can be promoted within a public health, rather than within a disease-model."}, {"section_title": "Conclusion", "text": "By accepting the evidence of possible external traumas (viral, bacterial, biological, chemical, environment, behavioral) that can initiate Alzheimer's disease, and then assigning importance to the role of perfusion and plasticity to delay the growth of the penumbra, this approach reframes the disease as a public health issue with potential public health solutions. Such a methodology will include educational as well as legislative programs that reduce and lower the exposure to traumas. Reduction of concussions (in sport, military, recreational activities) should be made a priority. Programs that educate on the effects of smoking and heavy drinking on the brain will need to be promoted, as well as programs that address environmental toxicity both in the air and in our water. For perfusion, increasing activity provides an incentive for families to promote daily activity among adults of all ages. City walkability programs, and social engagement programs all promote walking, swimming, light exercise, gardening among other activities. The family's role remains central in improving plasticity since engaging patients in social activities, dancing, music and other cognitive exercise will have both protective factors as well as showing promise of reversing the attrition from the disease. Such pragmatic approaches have already been shown to be efficacious [16] . Adjusting the focus to include environmental and social components brings the disease squarely into the public health arena where a broader array of scientists, academics and clinicians can break down research silos and actively work together to address the emerging pandemic of Alzheimer's disease. "}]