[{"section_title": "", "text": "T he question of whether anthropogenic influence on tropical cyclone (TC) activity is detectable in observations is important, particularly owing to the large societal impacts from TCs. Detection and attribution studies can also inform our confidence in future TC projections associated with anthropogenic warming. This report updates TC climate change assessments by a World Meteorological Organization (WMO) expert team ) and by the Intergovernmental Panel on Climate Change Fifth Assessment Report (IPCC AR5; IPCC 2013; Bindoff et al. 2013) . Part II of the assessment (Knutson et al. 2019 ) focuses on future TC projections. Walsh et al. (2016) provides a recent extensive literature review of TCs and climate change studies.\nThe authors of this report include some former members of the expert team for the WMO 2010 assessment ) along with current membership of a WMO Task Team on Tropical Cyclones and Climate Change. The Task Team members were invited to membership by the WMO World Weather Research Program's Working Group on Tropical Meteorology Research.\nTo conduct this assessment, we identified studies where claims were made about detection of long-term (multidecadal to century scale) changes in TC activity, or about attribution of past TC changes or events to anthropogenic forcing. We next developed potential detection/attribution statements for the author team to evaluate. In a few cases-for completeness-we developed and evaluated a potential detection and attribution statement for which no published claim has yet been made. We used an elicitation procedure whereby each author provided confidence levels or agree-disagree opinion on each potential statement. The summary assessment statements highlighted in the \"Summary\" section represent cases where a majority of authors either support the statement or support an even stronger version of the statement. A full list of opinions for each individual author and each potential statement is contained in the online supplemental material (https://doi.org/10.1175 /BAMS-D-18-0189.2).\nSome related topics, such as long-term trends in TC damages (Pielke et al. 2008; Mendelsohn et al. 2012; Estrada et al. 2015; or changes in mortality risk (Peduzzi et al. 2012) , are beyond the scope of our assessment. While total storm damages have increased over time, these are strongly influenced by socioeconomic trends (Pielke et al. 2008; Hsiang 2010; Hsiang and Narita 2012; Camargo and Hsiang 2015) ."}, {"section_title": "BACKGROUND ON DETECTION AND AT-TRIBUTION OF TC CHANGES.", "text": "Detection and attribution studies explore the causes of observed climate changes or events, typically by comparing models with observations. TC activity has been a very challenging topic for detection/attribution, owing partly to the comparative rarity of TCs and the difficulty obtaining accurate and temporally consistent measures of TC properties for climate studies (e.g., Landsea et al. 2006; Kossin et al. 2013) , particularly in the pre-satellite era (Vecchi and Knutson 2008) . Observed TC time series are often limited by data quality issues and by the length of available records from various monitoring techniques (e.g., satellites). TC historical time series show far less compelling evidence for long-term increases than does global mean temperature (e.g., Bindoff et al. 2013) . Several long TC-related observed time series are shown in Fig. 1 (discussed below). Longer TC records are potentially available from historical documents (e.g., Chenoweth and Divine 2008) . None of these observed TC time series demonstrate clear evidence for a century-scale increase similar to that observed for global mean temperature.\nWithin this report, we use the term \"detectable anthropogenic change\" to refer to a change (e.g., trend) that is both clearly distinguishable from natural variability, and is consistent-at least in sign-with a modeled (statistically significant) expected change due to anthropogenic influence. More narrowly, a detectable change refers to one that is highly unlikely (typically p < 0.05) to occur from natural variability alone. Natural variability here refers to changes (either forced or from internal variability) that occur because of natural processes alone, without human influence.\nAttribution involves evaluating the relative contributions of different causal factors to an observed change, along with an assignment of statistical confidence (Hegerl et al. 2010; Bindoff et al. 2013 ). This can involve multivariate methods comparing spatial and temporal patterns of modeled forced signals to observations (Hegerl et al. 2010) , or univariate methods comparing individual observed regional or global time series to models (Knutson et al. 2013b ). While attribution is normally assessed once a climate change has been established as detectable, it has become more common practice for investigators to make attribution claims even in the absence of establishing a detectable change, particularly in the case of extreme event attribution. We refer to such attribution claims as \"attribution without detection.\" An example case of this is Murakami et al. (2015) , who infer, using model simulations, that anthropogenic forcing has increased the occurrence rate of TCs near Hawaii and thus contributed to the active TC season in that region in 2014, despite the lack of a significant observed long-term increasing trend in TCs in the region. While such statements will typically have relatively low confidence, they can help identify possible anthropogenic climate change signals that might later become detectable.\nNatural variability contributions can be assessed via long preindustrial climate simulations with constant forcing (which simulate internal variability) or by historical simulations forced by natural forcing agents only (e.g., volcanic and solar forcing). Paleoclimate proxies can aid in evaluating how unusual an observed climate variability/change is compared to preindustrial behavior, but have so far been limited to a relatively small number of regions/ locations. In some TC-climate studies, a statistically significant linear trend or secular change is identified based on conventional statistical tests (e.g., t test). This type of statistical test does not necessarily demonstrate that the observed change is highly unusual compared to natural variability. If the time series is long enough, an estimated contribution from natural variability can be statistically removed (e.g., Kossin et al. 2016a; Kossin 2018b) to assess whether a significant trend remains, which would increase confidence in a climate change detection. Confidence in anthropogenic climate change detection depends on a number of factors: confidence in the estimates of anthropogenic signal and natural variability contributions, whether the observed series being considered is free from significant spurious trends due to data inhomogeneity, and whether the observed time series spans a long-enough period to reliably distinguish an anthropogenic signal from natural variability. Lloyd and Oreskes (2018) discuss the issue of type I and type II errors for detection and attribution. Here, we interpret a type I attribution error as concluding that anthropogenic forcing had contributed nontrivially in a certain direction to an observed change when it had not done so, while a type II error means not concluding that anthropogenic forcing had contributed to some observed change or event in a certain direction when it had done so to a nontrivial extent.\nIn this report, we place an emphasis on avoiding type I detection errors by testing against a null hypothesis that an observed change was caused by natural variability. We reject the null hypothesis (i.e., detection) when there is sufficiently strong evidence against it using a relatively high statistical threshold (e.g., a 0.05 significance level), and preferably based on multiple studies using well-accepted methods.\nAs discussed by Lloyd and Oreskes (2018) , whether a type I or type II error is more important to avoid is context and audience dependent. If the goal is to advance scientific understanding, an emphasis on avoiding type I errors seems logical. However, for future planning and risk assessment, one may want to reduce type II errors in particular. For example, planners for infrastructure development in coastal regions may want to consider emerging detection/ attribution findings-even if not at the 0.05 significance level-in their planning and decision-making.\nWe are motivated in this report both by the desire to improve scientific understanding and to provide useful guidance to those who need to deal with future risk.\nAdopting only the type I perspective has substantial potential for missing anthropogenic influences that are present but have not yet emerged or been identified to a high level of confidence. Therefore, we also make some assessment statements considering the type II error perspective. For this, we consider whether there is a balance of evidence (more than 50% chance) that anthropogenic climate change contributed nontrivially in a specified direction to an observed change. Further, for climate change detection, we adopt weaker criteria (e.g., p = 0.1) for statistical significance and also assess whether the balance of evidence suggests that a detectable change has been identified-a lower burden of evidence than used for type I error avoidance. We recognize that the alternative type II error framing will lead to more speculative TC detection and/or attribution statements that have substantial potential for being false alarms (i.e., overstating anthropogenic influence), or for being overturned in future assessments. We note that there is also potential for confidence in TC detection/attribution statements to be revised upward in future assessments."}, {"section_title": "EXPECTED DETECTABILITY OF HUMAN INFLUENCE ON TC ACTIVITY.", "text": "A time scale of expected emergence of a detectable signal in observations can sometimes be estimated (e.g., Mahlstein et al. 2012) . Bender et al. (2010) estimated that the detection time scale for a 10% decade −1 increase in Atlantic category 4-5 hurricane frequency would be about six decades. [The term \"category\" refers to the Saffir-Simpson intensity scale (Simpson and Riehl 1981) : https://en.wikipedia.org/wiki/Saffir-Simpson _scale]. Kossin et al. (2013) noted limitations of using just three decades of TC intensity data for detection, based on a heuristic analysis of potential intensity (PI) changes. [PI is a theoretical estimate of the maximum intensity a TC can attain for a given thermodynamic environment (Emanuel 1988 ).]\nThe expected detectability of changes in a TC power dissipation index (PDI), and PI have also been assessed by Villarini and Vecchi (2013) and Sobel et al. (2016) . (PDI measures the accumulated cube of maximum wind speeds across all TCs and storm lifetimes.) They suggest that a detectable change in TC intensity or PDI might not be expected to date, owing to a significant offset of greenhouse warming influences by aerosol cooling. Sobel et al. (2016) note the large multidecadal variability, compared to the expected signal, in an observation-based PDI metric. Shifting TC track/ occurrence can influence storm-experienced PI, and thus signal detectability (Kossin and Camargo 2009; Kossin et al. 2014; Kossin 2015) .\nIn summary, it is perhaps not surprising that no clearly detectable anthropogenic influence has yet been identified for several TC metrics since a lack of detection appears consistent with historical simulations of expected PI changes to date as well as some heuristically determined and modeled emergence time scales (e.g., Bender et al. 2010; Kossin et al. 2013) ."}, {"section_title": "CASE STUDIES -ASSESSMENT OF DE-TECTION AND ATTRIBUTION.", "text": "In this section, we review and assess several published case studies of possible detectable anthropogenic influence on TCs.\nCase study: Aerosol forcing influence on Atlantic TC activity. IPCC AR5 (Bindoff et al. 2013) concluded that there was medium confidence that increased TC activity in the North Atlantic since the 1970s resulted partly from reduced aerosol forcing but that it was uncertain whether any past changes in TC activity were outside the range of natural variability (see online supplemental material: https://doi .org/10.1175/BAMS-D-18-0189.2). These conclusions were based principally on Booth et al. (2012) and Villarini and Vecchi (2012; , although Booth et al.'s conclusions have been challenged (Zhang et al. 2013) . Dunstone et al. (2013) modeled Atlantic TC frequency response to aerosol forcing, suggesting that anthropogenic aerosols could have been the dominant cause of twentieth-century low-frequency North Atlantic TC variability (e.g., Mann and Emanuel 2006) . Vecchi's (2012, 2013 ) statistical downscaling of phase 5 of the Coupled Model Intercomparison Project (CMIP5) models suggested that decreasing aerosols caused about 25% of the observed increase in Atlantic TC activity since the 1970s. An update of Emanuel's (2007) PDI ( Fig. 1e ) illustrates the strong increase in Atlantic TC activity from the early 1990s to 2005, though with a decreasing tendency after 2005. Note that for Fig. 1e , no adjustments for incomplete sampling of TCs [such as possible missed storms in the pre-satellite era, following Vecchi and Knutson (2008) ] have been incorporated, which may result in a low bias in PDI in the earlier parts of the record shown. Yan et al. (2017b) conclude that a recent (2005-15) decline in Atlantic major hurricane counts was not likely due to aerosol forcing increases, but was more likely associated with increased vertical wind shear due to a weakening Atlantic meridional overturning circulation (AMOC). Ting et al. (2015) concluded that aerosols are more effective than greenhouse gases in modulating Atlantic PI changes and that the PI increases over the last 30 years have been dominated by multidecadal natural variability. Zhang et al. (2017) used statistical methods to infer an impact of aerosol forcing on Atlantic TC activity via its influence on gradients of African outgoing longwave radiation. Balaguru et al. (2018) tentatively attributed increases in Atlantic hurricane rapid intensification during 1986-2015 to natural variability, though not ruling out anthropogenic forcing. Malavelle et al. (2017) concluded that the large indirect aerosol effect in some CMIP5 models is greatly overestimated. Murphy et al. (2017) , find that 38 of 41 CMIP5 historical runs simulated an Atlantic multidecadal oscillation (AMO) that is significantly correlated with the observed AMO, suggesting a possible influence of historical forcings in driving AMO phases. Vecchi and Delworth (2017) , Vecchi et al. (2017) , and Sutton et al. (2018) provide perspectives on the competing processes thought to be contributing to Atlantic multidecadal variability (AMV) and thus to TC activity. While earlier studies held that this variability is primarily due to internal climate mechanisms, they review a number of more recent studies that conclude that external forcing of the climate system has played some role-and perhaps a crucial role-in observed AMV. The North Atlantic Oscillation has been identified as an important driver of AMOC variability . Saharan dust changes are another mechanism that may have contributed substantially to late-twentieth-century Atlantic hurricane variability (Dunion and Velden 2004; Evan et al. 2006; Strong et al. 2018) . Direct effects of aerosol pollution on TCs (Wang et al. 2014) are another means by which TC climate could be affected by anthropogenic activities.\nConsidering this evidence, the following summary statement was evaluated from a type I error-avoidance perspective by the author team: \"The estimated contribution of decreased anthropogenic aerosol forcing to the increased Atlantic TC frequency since the 1970s is large and positive and is highly unusual (e.g., p < 0.05) compared to natural variability.\" A majority (7 of 11) authors expressed only low confidence in the above statement; the remaining 4 authors ranked it between low to medium and medium to high confidence.\nFrom type II error-avoidance perspective, only 1 1 of 11 authors agreed with the following statement: \"the balance of evidence suggests that there has been a detectable increase in North Atlantic TC activity since the 1970s.\" Author opinion was divided on whether the balance of evidence suggested that anthropogenic forcing (e.g., greenhouse gases and aerosols) had contributed to increased North Atlantic TC activity since the 1970s, with only 5 of 11 authors concurring.\nCase study: Poleward migration of latitude of maximum intensity (western North Pacific) . The latitude of lifetime maximum intensity (LMI) of TCs has migrated poleward globally since 1980 (Kossin et al. 2014 )-a change that can influence TC hazard exposure and mortality risk (Kossin et al. 2016a ). The migration is consistent with the independently observed expansion of the tropics (Lucas et al. 2014) , and has been linked to changes in areas of large-scale rising and sinking motion in the tropics (Sharmila and Walsh 2018) . The migration is apparent in the average latitude location of TC eyes as obtained from satellite imagery (Knapp et al. 2018) . Part of the Northern Hemisphere poleward migration is due to interbasin changes in TC frequency (Kossin et al. 2014; Moon et al. 2015; Kossin et al. 2016b; Moon et al. 2016) , and the trends can be sensitive to the time period chosen (Song and Klotzbach 2018; Tennille and Ellis 2017; Kossin 2018b) and to subsetting of the data by intensity (Zhan and Wang 2017) . Significant poleward migration rates are observed in the western North Pacific, southern Indian Ocean, and South Pacific basins and significant equatorward rates in the North Atlantic (Kossin et al. 2016a; Kossin 2018b) .\nThe migration rate is particularly well observed and robust in the western North Pacific-the focus of a number of studies (Kossin et al. 2016a; Choi et al. 2016; Liang et al. 2017; Oey and Chou 2016; Song and Klotzbach 2018; Zhan and Wang 2017; He et al. 2015; Tennille and Ellis 2017; Kossin 2018b; Studholme and Gulev 2018) . Therefore our case study focuses on this basin.\nPacific LMI changes (1980 LMI changes ( -2013 are associated with a significant poleward migration of TC genesis latitude (Daloz and Camargo 2018) . Song and Klotzbach (2018) found that during 1961-2016 the latitudinal distance from genesis to latitude of maximum intensity increased, whereas the genesis latitude only increased in the latter part of the period. Park et al. (2014) found that the location of maximum intensity in the western North Pacific moved closer to East Asia during 1977-2010, leading to increased TC landfall intensity over east China, Korea, and Japan. A possibly related change observed in recent decades is a TC track shift from the South China Sea region toward the East China Sea (Wang et al. 2011; Kossin et al. 2016a ). This shift in recent decades may be due to a weakening of easterly steering flows in the western tropical North Pacific (Oey and Chou 2016) or to a weakening and eastward shift of the subtropical high (Liang et al. 2017 )-changes that these authors interpret as linked to global warming. However, past observed shifts in western North Pacific TC occurrence/tracks and circulation features have not yet been demonstrated to be detectable compared to natural variability (e.g., Lee et al. 2012 ).\nAccording to Kossin et al. (2016a) , the LMI poleward migration in the western North Pacific is consistent among TC datasets, and the trend remains significant over the past 60-70 years after statistically removing the influence of El Niño-Southern Oscillation (ENSO) and the Pacific decadal oscillation ( Fig. 1h ). Recent supplemental calculations by J. Kossin regress out influence of the AMO on west Pacific TC activity (e.g., Zhang et al. 2018a) , and replace the PDO index with an interdecadal Pacific oscillation (IPO) index for comparison to Song and Klotzbach (2018) . These sensitivity tests show little effect on the trend in LMI. The residual trends were also found to be robust to the use of annual or July-Novemberaveraged climate indices. Kossin et al. (2016a) find a nominally positive trend in western North Pacific LMI in CMIP5 historical runs, but it is weaker than observed, and not statistically significant in the model ensemble. The LMI poleward migration is statistically significant in late-twenty-first-century CMIP5 projections (representative concentration pathway 8.5 scenario), with a similar spatial pattern and magnitude to the past observed changes there, supporting a possible anthropogenic contribution to the observed trends. A caveat is that the CMIP5 TC simulations use global climate models that simulate only about 20%-25% of the observed number of TCs in the basin ). The upward trend in observed LMI over the past 60-70 years has not been compared with internal variability simulated by climate models.\nMost authors (8 of 11) concluded (type I error perspective), that there is low to medium confidence that the observed poleward migration of the western North Pacific basin LMI is detectable compared with expected natural variability, while only three authors had either medium (1) or medium to high (2) confidence. Author opinion was divided on whether anthropogenic forcing had contributed to this change, with 6 of 11 having only low confidence, 2 having low to medium confidence, and 3 having medium confidence. Alternatively, from a type II error perspective, all authors concluded that the balance of evidence Year Quantiles:\nsuggests that the observed poleward migration of the LMI in the western North Pacific basin is detectable; and 9 of 11 authors concluded that the balance of evidence suggests that anthropogenic forcing contributed to the observed migration.\nCase study: Multidecadal-to century-scale landfalling-TC records. Callaghan and Power (2011) find a statistically significant century-scale decreasing trend in severe landfalling TCs in eastern Australia (Fig. 1a ). However, they did not assess whether the change was caused by anthropogenic forcing, nor compared the trend to climate models' internal variability. Haig et al. (2014) analyzed a 1,500-yr TC paleoclimate proxy reconstruction for the mid-west and northeast coasts of Australia and concluded that recent levels of TC activity in this region are the lowest in the past 550-1,500 years. Weinkle et al. (2012) analyzed TC landfalls globally ( Fig. 1i ). They make no claim of significant trends. While their global index for major TCs (Fig. 1i , dark bars) has a positive trend (1970-2010) with a p value of 0.06 using a conventional linear trend test, their trend tests are not meant to be robust for trend detection in the presence of substantial multidecadal internal variability. The time series of TC landfalls for Japan since 1901 ( Fig. 1b from Kumazawa et al. 2016 ) and global TC and hurricane frequency since 1970 ( Fig. 1g from Maue 2011) also show no strong evidence for trends.\nU.S. landfalling hurricane counts (1878-2017; Fig. 1c ) show a nominally negative decline, although the trend over 1900-2017 is not statistically significant . Hurricane Harvey's U.S. landfall in 2017 ended an 11-yr \"drought\" of majorhurricane U.S. landfalls (Kossin et al. 2017) , which had been tentatively attributed to natural variability (Hall and Hereid 2015) . Hart et al. (2016) discussed several limitations of focusing on such an index of major-hurricane U.S. landfalls, noting the arbitrariness of several aspects of the index. An alternate index, based on accumulated cyclone energy, was analyzed by Truchelut and Staehling (2017) . Wang et al. (2011) and Kossin (2017) found that large-scale conditions that produce enhanced Atlantic hurricane activity in the deep tropics are statistically associated with conditions related to track changes (Wang et al.) or storm weakening (e.g., higher shear) near the U.S. coast (Kossin 2017) , that would decrease the chances of a hurricane making an intense U.S. landfall.\nIn summary, no detectable anthropogenic influence has been identified to date in observed TClandfalling data, using type I error avoidance criteria. From the viewpoint of type II error avoidance, one of the above changes (decrease in severe landfalling TCs in eastern Australia), was rated as detectable, though not attributable to anthropogenic forcing (9 of 11 authors), with one dissenting author expressing reservations about the historical data quality in this case.\nCase study: Trends in global TC intensity. Early studies of global TC intensity data found increasing trends in numbers of very intense TCs, and in their proportion of overall TCs (e.g., Webster et al. 2005; Elsner et al. 2008 ), but these results were questioned because of concerns about data quality and changes in observational capabilities over time (Landsea et al. 2006; Hagen and Landsea 2012; Klotzbach and Landsea 2015) . A global TC intensity dataset was subsequently developed from satellite data in an effort to control for temporal inhomogeneities (Kossin et al. 2007 ). In the latest version of this dataset (Kossin et al. 2013 ; Fig. 1f ), a slight increasing trend in global intensity for the strongest TCs (at least hurricane intensity) was identified (p value of 0.1), which is broadly consistent with expectations based on detectability studies (Kossin et al. 2013; Sobel et al. 2016 ). Elsner (2015, 2016) infer a slight increase in global TC intensity over 1984-2012 but do not claim to identify a detectable anthropogenic influence.\nNorth Atlantic LMIs have a highly significant increasing trend over 1982-2009 using conventional trend tests (Fig. 1f ), but the Atlantic basin has marked multidecadal variability that can confound climate change detection. Park et al. (2013) found that intensity trends in the western North Pacific have varied at the sub-basin scale, with increases south of Japan offsetting decreases in the Philippine Sea. Liu and Chan (2017) found an increase in PDI in the northern part of the basin and a decrease in the south, consistent with the observed poleward LMI migration. Mei and Xie (2016) found that over the last 37 years landfalling typhoon intensities have increased by 12%-15%, with the proportion of landfalling category 4-5 storms doubling during that period, though they did not compare these changes to expected natural variability or anthropogenic forcing responses.\nDespite this lack of robust climate change detection, the small observed increasing trend in global intensity (e.g., Kossin et al. 2013 ) is generally consistent with expectations of increasing TC intensity with global warming from potential intensity theory (e.g., Sobel et al. 2016 ) and high-resolution models ), pointing to a possibly emerging anthropogenic signal. For example, in Sobel et al. (their Fig. 3 ) the positive influence of increasing greenhouse gases on model-simulated potential intensity is beginning to dominate over the negative influence from aerosols by the early twenty-first century in both the Northern and Southern Hemisphere means.\nFrom the perspective of avoiding type I errors, we conclude that there is only low confidence in detection and attribution of any anthropogenic influence on historical TC intensity in any basin or globally. However, from the perspective of reducing type II errors, 10 of 11 authors concluded that the balance of evidence suggests that there is a detectable increase in the global average intensity of the strongest (hurricane strength) TCs since the early 1980s, while 1 author believes that at least half of the observed increase is due to improving observations during the period. Of the 11 authors, 8 concluded that the balance of the evidence suggests anthropogenic forcing has contributed to the increase in global average TC intensity, while the other 3 authors were not convinced that an anthropogenic contribution has been demonstrated to a balance of evidence level using appropriate attribution methodologies.\nCase study: Atlantic hurricane surge record since 1923. Grinsted et al. (2012) developed indices of U.S. surge events using six long-term tide gauge datasets. Their indices minimize the influence of long-term sea level rise. They detected a significant increasing trend since 1923 in the frequency of moderately large U.S. surge events (approximately tropical storm size surge events and higher; Fig. 1d ). Warm global temperature years were statistically associated with occurrence of large surge events-a statistical linkage suggesting anthropogenic influence. Lee et al. (2017) used alternative statistical models on the Grinsted et al. surge index, and estimated that if storm surges depend on global mean temperature, a signal should be confidently identified by 2030.\nOur expectation is that some worsening of total inundation levels during storms is occurring globally associated with the anthropogenic contributions to global and regional sea level rise (Bindoff et al. 2013 , Horton et al. 2018 , assuming all other factors equal (Woodruff et al. 2013; Sweet et al. 2013 ). However, a TC climate change signal has not yet been convincingly identified as a residual in sea level extremes data, after accounting for background sea level rise. Marcos and Woodworth (2018) conclude that extreme sea levels have increased in several North Atlantic basin locations since 1960, but not significantly if the mean sea level rise influence is removed. Wahl and Chambers (2015) removed mean sea level change inf luences and found some significant trends in residual extremes, but mostly along the Southeast coast in the winter season (not the TC season). Other related metrics of U.S. landfalling-TC activity, such as the U.S. landfalling-hurricane time series since 1878 ( Fig. 1c) , do not show evidence for a long-term increase. Therefore, the evidence for detectable increases in U.S storm total inundation levels, apart from changes expected from sea level rise influence, is mixed.\nFrom the perspective of avoiding type II errors, only 2 of 11 authors concluded that the balance of evidence suggests that there has been a detectable increase in the frequency of moderately large U.S. surge events since 1923 as documented by the index of Grinsted et al. and that anthropogenic forcing had contributed to the increase. From a type I error perspective, there is only low confidence for detection or attribution of an anthropogenic influence on the surge events described by the Grinsted et al. index.\nCase study: Event attribution for tropical cyclones. A relatively new area for detection and attribution studies is the attribution of extreme events [U.S. National Academy of Sciences (NAS); NAS 2016). One approach is \"ingredients based,\" resimulating an event using changes in large-scale environmental conditions [e.g., sea surface temperatures (SSTs) and atmospheric temperatures] based on model simulations of preindustrial to current anthropogenic climate change. Using this approach, Lackmann (2015) finds no statistically significant impact of anthropogenic climate change on Hurricane Sandy's (2012) intensity but projected that continued twentyfirst-century warming would lead to significantly increased intensity. Takayabu et al.'s (2015) simulations suggest that anthropogenic forcing increased Supertyphoon Haiyan's (Philippines, 2013) intensity, using an estimated anthropogenic SST change signal with relatively strong warming near the Philippines. Wehner et al. (2019) simulated a decreasing anthropogenic influence on Haiyan's intensity, though using a lower-resolution model. Because these approaches assume the existence of a particular storm and synoptic situation, they do not address climate-induced changes in factors such as storm frequency or steering flows (e.g., Barnes et al. 2013) .\nTC event attribution studies have focused on other types of TC events, such as unusually active TC seasons and a 20-yr regional decline in TC activity. Some of these events have been tested for anthropogenic influence using model simulations. For example, Murakami et al. (2015 Murakami et al. ( , 2017a ) infer a substantial anthropogenic contribution to unusually high TC frequency near Hawaii in 2014 and 2015 and in the eastern Pacific basin in 2015. Zhang et al. (2016) infer an anthropogenic contribution to high accumulated cyclone energy (ACE) in the western North Pacific in 2015. Exploring potential causes of recent decadalscale changes, Takahashi et al. (2017) infer that changes in sulfate aerosol emissions caused more than half of the observed decline in TC frequency over the southeastern part of the western North Pacific during 1992-2011, while Zhao et al. (2018) conclude that internal variability (the interdecadal Pacific oscillation) contributed to the lower TC frequency observed in the western North Pacific basin after 1998. Using a statistical analysis, Yang et al. (2018) infer a contribution of global warming to record-setting TC intensity in the western North Pacific in 2015. Murakami et al. (2018) conclude that the active 2017 Atlantic hurricane season was mainly caused by high SSTs in the tropical Atlantic relative to the global tropics, but did not attribute this seasonal event to anthropogenic forcing.\nNone of the above event attribution studies provides convincing evidence for an observed change in TC activity being detectable (i.e., an observed climate change signal that is highly unusual compared to natural variability alone). Therefore, in the above studies, any cases of inferred anthropogenic attribution are examples of attribution without detection.\nWe assessed several of the above studies in our elicitation, taking the perspective of avoiding type II errors. A slight majority of authors concluded that the balance of evidence suggests that anthropogenic forcing contributed to the active 2014 TC season near Hawaii (6 of 11 authors). Author opinion was divided on whether the balance of evidence suggested that anthropogenic forcing had contributed to the intensity of Supertyphoon Haiyan in the western North Pacific (with only 5 of 11 authors agreeing with the statement). A clear majority (8 of 11 authors) concluded that the balance of evidence suggest an anthropogenic contribution to the 2015 western North Pacific TC season. In none of the above cases did a majority of authors assess the observed changes as detectable from either a type I or type II error perspective."}, {"section_title": "Case study: Hurricane Harvey's (2017) extreme rainfall.", "text": "Hurricane Harvey (2017) produced record-breaking 3-day rainfall totals over the Houston region, mainly caused by the storm's slow movement over eastern Texas. Trenberth et al. (2018) concluded that Harvey's rainfall totals were linked to the large ocean heat content lost from the unusually warm Gulf of Mexico during the storm. Emanuel (2017) simulated large numbers of TCs in the region under various climate conditions and found that the relative occurrence rate of Harvey-like TC rainfall in the region was substantially enhanced by anthropogenic changes to the large-scale environment-an example of modelbased attribution without detection. Wang et al. (2018) modeled the influence of observed trends since 1980 in atmospheric variables and SST on Harvey's evolution, but did not separate out an anthropogenic influence. Zhang et al. (2018b) concluded that urbanization contributed to the flood response to rainfall during Harvey as well as to the storm total rainfall. Van Oldenborgh et al. (2017) and Risser and Wehner (2017) examined long records of extreme rainfall in the region using extreme value analysis. Van Oldenborgh et al. estimated that observed extreme precipitation had increased there by 12%-22% since 1880. Examining simulations from three models, they concluded that global warming and associated environmental changes-which were primarily caused by greenhouse gas emissions from anthropogenic activities-made the Harvey precipitation event 8%-19% more intense (or 1.5-5 times more likely). Risser and Wehner inferred a large positive influence of human-induced climate change on extreme rainfall in the region, which they estimated as a likely increase in Harvey's total rain of at least 19%, and the chances of the observed rainfall event (threshold exceedance) by at least 3.5 times. Both studies suggest the observed precipitation increases exceeded the increase expected due to increased water vapor content alone associated with a warmer atmosphere. These studies are examples of climate change detections for extreme rainfall in general in the east Texas region rather than specifically for hurricane-related rainfall rates. We have adopted a relatively conservative approach to the assessment of extreme precipitation trends in general in this assessment (e.g., van Oldenborgh et al. 2017; Risser and Wehner 2017) because this is a topic that extends beyond the scope of our assessment.\nPrevious assessments focusing on extreme rainfall in general have concluded that there is medium confidence that anthropogenic forcing has contributed to intensification of heavy precipitation over land at the global scale for regions with sufficient data coverage (Bindoff et al. 2013 ) and over the United States ). However, a thorough assessment of long-term changes in extreme rainfall in general (including both TC related and non-TC related) and from urbanization influences is beyond the scope of our TC-climate assessment. A detectable anthropogenic influence on near-surface water vapor has also been identified at the global scale with medium confidence (Bindoff et al. 2013) . At the regional scale, some evidence for a detectable anthropogenic contribution to centennial-scale sea surface warming has been reported for the western Gulf of Mexico (Vose et al. 2017) , and upper-ocean heat content in the Gulf of Mexico has also increased since the 1960s (Trenberth et al. 2018) , associated with the surface warming.\nModeling studies suggest that hurricane-related precipitation rates (for a given storm) on average increase with anthropogenic warming (e.g., Knutson et al. 2010 Knutson et al. , 2015 . Patricola and Wehner (2018) conclude, based on a modeling study, that anthropogenic climate change has contributed to both the average and extreme rainfall characteristics of Hurricanes Katrina, Irma, and Maria; Harvey was not included in their study. However, no observational studies have provided convincing evidence of a detectable anthropogenic influence specifically on hurricanerelated precipitation. Kunkel et al. (2010) found a pronounced increase in frequency of TC-associated extreme precipitation events in the United States comparing 1994-2008 to 1895-2008 climatology, but did not claim to have detected an anthropogenic signal. Lau and Zhou's (2012) analysis of the relatively short (two decades) available satellite-based TC rainfall data does not find conclusive evidence for detectable anthropogenic influence on TC rainfall.\nIn summary, from a type I error perspective, the author team had low confidence that anthropogenic influence specifically on hurricane precipitation rates has been detected. Alternatively, from the perspective of reducing type II errors, all authors concluded that the balance of evidence suggests that there has been a detectable long-term increase in occurrence of Hurricane Harvey-like extreme precipitation events in the eastern Texas region, and that anthropogenic forcing has contributed to this increase."}, {"section_title": "Case studies: Changes in Arabian Sea", "text": "TCs. An observed increase in Arabian Sea premonsoon TC intensity between 1979-96 and 1997-2010 was hypothesized to be due to decreasing storm-ambient vertical wind shear associated with changing meridional SST gradients due to a sixfold increase in regional anthropogenic aerosol emissions (Evan et al. 2011) . This interpretation has been debated (Wang et al. 2012; Evan et al. 2012) . Rajeevan et al. (2013) document multidecadal variations in Arabian Sea pre-monsoon TC activity, wind shear, and upper-ocean temperatures since 1955 and interpret these as arising from natural variability. Evan et al. (2011) is not an explicit TC simulation study and no clear demonstration was made that the TC intensity changes were highly unusual compared to natural variability. Consequently, from a type II error perspective, our author team did not conclude that the balance of evidence supports either a detectable change or an anthropogenic contribution to the observed TC intensity increase.\nIn a study of recent Arabian Sea postmonsoon extreme severe cyclonic storms (defined as TCs with maximum winds exceeding 46 m s -1 ) Murakami et al. (2017b) reported the first documented occurrence of such postmonsoon TCs during 2014 and 2015, based on records extending only back to 1998. They conducted long experiments with a 25-km-grid global coupled model using idealized fixed 1860, 1990, and 2015 radiative conditions and estimated more than a doubling in the probability of occurrence of such storms for 1990 and 2015 climate forcings, relative to 1860.\nAmong the caveats to this study, the 1998-2013 period of analysis is relatively short for identifying a detectable anthropogenic signal. The modeling approach of using long fixed-forcing runs (1990 and 2015) , as opposed to transient climate change simulations, overestimates the anthropogenic climate change signal, since the constant-forcing model has more time than the real world to equilibrate to given forcing levels. Their model simulated a general increase in TC activity with CO 2 warming across other tropical regions (as seen for example in their Bay of Bengal results), implying that apparent agreement between the observed and simulated increase of postmonsoon TC activity in the Arabian Sea region could be coincidental. However, in the north Indian Ocean only the postmonsoon strong TCs show an increase with historical anthropogenic forcing, in agreement with seasonal timing for the observed Arabian Sea TC increases.\nIn summary, from a type I error perspective, there is low confidence in a detectable anthropogenic influence on increasing TC activity in the Indian Ocean region. Alternatively, from the type II error perspective, all authors concluded that the balance of evidence suggests there has been some detectable increase in the frequency of postmonsoon extremely severe cyclonic storms over the Arabian Sea, and most authors (8 of 11) concluded that anthropogenic forcing has contributed to the increase.\nCase study: Global increase in proportion of category 4-5 TCs. Holland and Bruyère (2014) analyzed changes in TC frequency for various storm categories, assessing International Best Track Archive for Climate Stewardship (IBTrACS)/JTWC intensity data and a shorter homogenized satellite-based intensity data (Kossin et al. 2013) . From the satellite-based data, they conclude that the proportion of hurricanes reaching category 4 or 5 intensity has increased by 25%-30% per 1°C of global warming in recent decades. A similar statistically significant signal was found in most individual TC basins.\nThey tested for anthropogenic influence during 1975-2010 because the CMIP3 historical simulations they analyzed suggested little net anthropogenic influence on global mean temperature before 1975. Their analysis did not compare the observed changes over 1975-2010 to expected internal climate variability on 35-yr time scales from climate model control runs. Their linkage to anthropogenic forcing as a mechanism is statistical in nature as there is no explicit comparison between observed storm metrics and those derived from simulations using historical forcings. They inferred that the observed increase in proportion of category 4-5 storms (which by definition has an upper limit of 100%) may be reaching a saturation point soon and may not continue increasing over the coming century, which could hinder its detectability using this particular metric.\nFrom the type I error perspective, the author team did not conclude that there is confidence in detection of an anthropogenic climate change signal in historical proportion of very intense TCs. Alternatively, from the perspective of reducing type II errors (where we, again, require less convincing levels of evidence), all authors concluded that the findings of Holland and Bruyère (2014) , combined with other studies linking climate warming to increased TC intensity, provides a balance of evidence suggesting that the observed increase in category 4-5 proportion in recent decades represents a detectable change. Most authors (8 of 11) concluded that the balance of evidence suggests that the increase in proportion of category 4-5 storms resulted in part from anthropogenic forcing.\nCase study: Global slowdown of TC translation speeds. Kossin (2018a) reported a significant decreasing trend in global TC translation speed-about 10% over 1949 ). This decrease has been particularly strong for TCs over land areas near the western North Pacific (−21%) and North Atlantic (−16%) basins and around Australia (−18%). Chu et al. (2012) had previously reported a statistically significant decrease in steering flows and in storm translation speeds over 1958-2009 in the western North Pacific and South China Sea regions. Kossin (2018a) interprets the observed global slowdown as consistent with expected changes in atmospheric circulation due to anthropogenic forcing. A few studies report future projections of TC propagation speeds under climate warming, and these contain examples of projected significant decreases in speeds (e.g., Knutson et al. 2013a; Gutmann et al. 2018) and other examples where there is an increase or no significant change (Knutson et al. 2013a; Kim et al. 2014) . Thus, there is no consensus in the studies on the sign or significance of projected late-twentyfirst-century change, nor do they provide direct guidance on expected historical forced changes. The Table 1 . Distribution of author opinion on potential tropical cyclone detection and attribution statements elicitation. For the type II error avoidance, both detection and attribution substatements are prefaced by \"The balance of evidence suggests…\" and \"Detectable\" refers to \"unusual compared to natural variability, e.g., p < 0.1.\" Numbers in parentheses indicate the number of authors reporting this confidence level."}, {"section_title": "Perspective: Type I error avoidance", "text": "1) The estimated contribution of decreased anthropogenic aerosol forcing to the increased Atlantic TC frequency since the 1970s is large and positive and is highly unusual (e.g., p < 0.05) compared to natural variability. Confidence: low (7); low to medium (2); medium (1); medium to high (1).\n2) Observed poleward migration of latitude of maximum intensity in northwest Pacific basin is highly unusual (e.g., p < 0.05; statistically distinguishable) compared with expected natural variability. Confidence: low to medium (8); medium (1); medium to high (2).\n3) Anthropogenic forcing has contributed to the observed poleward migration of the latitude of maximum intensity in the northwest Pacific basin. Confidence: low (6); low to medium (2); medium (3)."}, {"section_title": "4)", "text": "There has been a detectable decrease (highly unusual compared to natural variability; e.g., p < 0.05) in the global-scale propagation speed of TCs since 1949. Confidence: low (6); low to medium (4); medium (1). observed trends in Kossin (2018a) are thus examples of significant linear trends that are not yet quantitatively linked to past anthropogenic influence based on direct model simulations."}, {"section_title": "5)", "text": "One possible implication of a TC propagation speed decrease would be an increase in TC-related rainfall amounts at fixed locations along the storms' paths. Altman et al. (2013) reported very strong century-scale increases in typhoon-related rainfall rates over Korea during 1904 Korea during -2008 , although their study does not present enough methodology details for a careful assessment. Kim et al. (2006) had previously reported large increases in TC-related rainfall rates in Korea beginning around 1980, based on a shorter record extending back to 1954.\nIn summary, from a type I error avoidance perspective, a slight majority of the authors (6 of 11) had only low confidence that there has been a detectable decrease in global or western North Pacific TC translation speeds since 1949. For the other 5 authors, 4 had low to medium confidence, and 1 had medium confidence. Most authors (8 of 11) concluded that Perspective: Type II error avoidance 7) Detectable increase in North Atlantic TC activity since the 1970s (9% agree); and anthropogenic forcing (reduced aerosol forcing) has contributed to this increase (45% agree)."}, {"section_title": "8)", "text": "Observed poleward migration of latitude of maximum intensity in northwest Pacific basin is detectable (all agree); and anthropogenic forcing has contributed to the observed poleward migration of the latitude of maximum intensity in the northwest Pacific basin (82% agree). 9) Detectable increase in TC intensity over the Arabian Sea (premonsoon) over 1979-2010 (none agree); and anthropogenic forcing has contributed to this increase (none agree).\n10) Detectable increase in the frequency of extremely severe cyclonic storms over the Arabian Sea (postmonsoon) over 1998-2015 (all agree); and anthropogenic forcing has contributed to this increase (73% agree). 11) Detectable increase in the global proportion of TCs reaching category 4 or 5 intensity in recent decades (all agree); and anthropogenic forcing has contributed to this increase (73% agree).\n12) Detectable increase in the global average intensity of strongest (hurricane intensity) TCs since the early 1980s (91% agree); and anthropogenic forcing has contributed to this increase of global average intensity of strongest (hurricane intensity) TCs (73% agree).\n13) Detectable multidecadal increase in TC occurrence near Hawaii (none agree); and anthropogenic forcing contributed to the recent unusually active TC season near Hawaii in 2014 (55% agree)."}, {"section_title": "14)", "text": "Detectable increase in TC occurrence activity in the western North Pacific in recent decades (none agree); and anthropogenic forcing contributed to the recent unusually active TC season, including the record-setting TC intensity, in the western North Pacific in 2015 (73% agree).\n15) Detectable increase in the intensity of Hurricane Sandy-like storms in the Atlantic in recent decades (none agree); and anthropogenic forcing contributed to the intensity of Hurricane (Superstorm) Sandy in 2012 (none agree).\n16) Detectable increase in the intensity of Haiyan-like supertyphoons in the western North Pacific in recent decades (18% agree); and anthropogenic forcing contributed to the intensity of Supertyphoon Haiyan in 2013 (45% agree)."}, {"section_title": "17)", "text": "Detectable long-term increase in the occurrence of Hurricane Harvey-like extreme precipitation events in the Texas region (all agree); and anthropogenic forcing has contributed to increased frequency of Hurricane Harvey-like precipitation events in the Texas region (all agree).\n18) Detectable increase in the frequency of moderately large U.S. surge events since 1923 as documented by the index of Grinsted et al. (which strongly filters out sea level rise influences) (18% agree); and anthropogenic forcing has contributed to this increase (18% agree)."}, {"section_title": "19)", "text": "Detectable decrease in the global-scale propagation speed of TCs since 1949 (73% agree); and anthropogenic forcing has contributed to this decrease (9% agree)."}, {"section_title": "20)", "text": "Detectable decrease in severe landfalling TCs in eastern Australia since the late 1800s (82% agree); and balance of evidence suggests anthropogenic forcing has contributed to this decrease (none agree)."}, {"section_title": "21)", "text": "Detectable decrease in U.S. landfalling-hurricane frequency since the late 1800s (none agree); and anthropogenic forcing has contributed to this decrease (none agree)."}, {"section_title": "22)", "text": "Detectable increase in global major hurricane landfall frequency in recent decades (none agree); and anthropogenic forcing has contributed to this increase (none agree)."}, {"section_title": "23)", "text": "Detectable decrease in TC frequency in the southeastern part of the western North Pacific (1992-2011) (none agree); and anthropogenic forcing (changes in aerosol emissions) has contributed to this decrease (50% agree). there was only low confidence that anthropogenic forcing had contributed to the observed decrease. Alternatively, from the perspective of reducing type II errors, most authors (8 of 11) concluded that the balance of evidence suggests there has been a detectable decrease in global TC translation speeds since 1949; only 1 author concluded that the balance of evidence suggests that anthropogenic forcing has contributed to the observed decrease."}, {"section_title": "PALEOCLIMATE PERSPECTIVES.", "text": "Paleoclimate studies of TC activity can be used to explore the expected background level of natural variability based on datasets that are much longer than available instrumental records. Such natural variability has the potential to be a confounding factor for detection and future climate projections. Paleoclimate records can also be used for better assessing TC risk analysis even in the absence of changing climate.\nPaleoclimate TC records have been extracted at specific locations for periods up to about 8,000 years ago. Analysis of these data suggests large centennialscale variations in TC activity over the past few thousand years (Liu 2001; Woodruff et al. 2012; Donnelly et al. 2015; Muller et al. 2017 ) at these locations. Reasons for these variations are not clear. Since there are clear relationships in the current climate between ENSO variations and TCs, it is possible that such a relationship could also be observed in paleoclimate data. However, Muller et al. (2017) conclude that there does not appear to be a clear association in the various TC basins between periods of enhanced El Niño activity and TC activity that is consistent with current climate relationships (Nott and Forsyth 2012; Haig and Nott 2016) . Yan et al. (2017a) identified a potential indicator of centennial-scale variations in TC numbers in the western North Pacific in the past millennium, but these variations tend to be inconsistent with written typhoon records from China during this time. Denniston et al. (2015) find more consistent relationships between ENSO variations and TC incidence in the Australian region over the past 2,000 years. Donnelly and Woodruff (2007) find a strong statistical relationship between a 5,000-yr proxy record of intense Caribbean hurricane landfalls and a proxy reconstruction of El Niño variability.\nSeveral studies have suggested a link between TC incidence, patterns of SST and the position of the intertropical convergence zone (ITCZ), with a more northerly mean position favoring more TC incidence, a result supported by climate models (Merlis et al. 2013; van Hengstum et al. 2016) . Note that projections of future climate typically include a more poleward ITCZ in the Northern Hemisphere summer (Ceppi et al. 2013 ). In the Atlantic, a number of paleo-TC studies find relationships between higher SSTs in the main TC development region and greater numbers of TCs (Donnelly et al. 2015; Trouet et al. 2016) .\nA cautionary note on these studies is that past climates (with different climate forcings) may not provide good analogs for expected natural climate variability over the past century or for twenty-firstcentury variability and change. Also paleoclimate studies typically cover one or a limited number of specific locations, and thus can only be used with caution to infer basin-or regional-scale TC activity.\nIn summary, clear centennial-to millennial-scale variations in TC activity have been documented in paleoclimate records, which provide some long-term context for observed TC variability on a centennial scale. The paleo proxy studies to date do not contradict our conclusions about detection and attribution in this report that are based on the historical-era TC data."}, {"section_title": "SUMMARY.", "text": "In this assessment, we have focused on the following question: Can an anthropogenic influence on TC activity be detected in past data? We explore this question from two perspectives: avoiding/reducing either type I or type II errors, since we presume that different audiences will have different preferences on which type of error should be avoided to a greater extent. A summary of the distribution of author opinion on the various potential detection and attribution statements discussed in the \"Case studies-Assessment of detection and attribution\" section is provided in Table 1 .\nUsing the conventional perspective of avoiding type I error, the strongest case for a detectable change in TC activity is the observed poleward migration of the latitude of maximum intensity in the northwest Pacific basin, with 8 of 11 authors rating the observed change as low to medium confidence for detection (with one other author having medium and two other authors having medium to high confidence). A slight majority of authors (6 of 11) had only low confidence that anthropogenic forcing had contributed to the poleward shift. The majority of the author team also had only low confidence that any other observed TC changes represented either detectable changes or attributable anthropogenic changes.\nFrom the perspective of reducing type II errors, a majority of the author team agreed on a number of more speculative TC detection and/or attribution statements, which we recognize have substantial potential for being false alarms (i.e., overstating anthropogenic influence) but which may be indicators of emerging anthropogenic signals in the data. Most authors agreed that the balance of evidence suggests detectable anthropogenic contributions to (i) the poleward migration of the latitude of maximum intensity in the western North Pacific, (ii) increased occurrence of extremely severe (postmonsoon) cyclonic storms in the Arabian Sea, (iii) increased global average intensity of the strongest TCs since early 1980s, (iv) increase in global proportion of TCs reaching category 4 or 5 intensity in recent decades, and (v) increased frequency of Hurricane Harvey-like extreme precipitation events in the Texas (U.S.) region. In addition, a majority of authors concluded that the balance of evidence suggested an anthropogenic influence (without detection) on (vi) the unusually active TC season in the western North Pacific in 2015. Author opinion was divided but a slight majority concluded that (vii) unusually high TC frequency near Hawaii in 2014 was a case where the balance of evidence suggested an anthropogenic influence (without detection). Finally, most authors concluded that the balance of evidence suggests (viii) detectable (but not attributable) decreases in severelandfalling-TC frequency in eastern Australia since the late 1800s and (ix) detectable (but not attributable) decreased global TC translation speeds since 1949.\nRegarding storm surge, our expectation is that a widespread worsening of total inundation levels during storms is occurring because of the global mean sea level rise associated with anthropogenic warming, assuming all other factors equal, although we note that no TC climate change signal has been convincingly detected in sea level extremes data. To date, there is not convincing evidence of a detectable anthropogenic influence on hurricane precipitation rates, in contrast to the case for extreme precipitation in general, where some anthropogenic influence has been detected.\nThe relatively low confidence in TC change detection results from several factors, including observational limitations, the smallness of the expected human-caused change (signal) relative to the expected natural variability (noise), or the lack of confident estimates of the expected signal and noise levels. Going forward, continued development/maintenance of climate-quality TC-related observed datasets, paleostorm proxies, and TC statistics from appropriately designed modeling studies will all be important for further progress. Monitoring and analysis of various TC indices, and development of improved climate models with TC simulation capabilities, are strongly recommended to help identify emerging anthropogenic TC climate change signals."}]