[{"section_title": "", "text": "This report uses data from the 1995-96 National Postsecondary Student Aid Study to profile undergraduates who were enrolled in U.S. postsecondary institutions in the academic year 1995-96. The report begins with an essay that explores the extent to which undergraduates work while they are in school. This essay found that 79 percent of undergraduates reported working while in school; half worked to help pay for their education and 29 percent considered themselves primarily employees who were also taking classes. Working students were employed an average of 25 hours per week, with 20 percent of full-time students also working full-time. Working students noted that working limited their class schedules, and about 25 percent reported that work adversely affected their academic performance. A negative effect was also found between work and one-year persistence. Students who worked fewer hours were more likely than those who worked more hours to borrow to pay for their educations. The report's data tables are grouped into those on the essay's topic; supplemental data about work; enrollment and attendance; degree program, field of study, and grade point average; student characteristics; financial aid; and educational aspirations and community service. (Appendix contains a glossary, technical notes, and methodology 1 to 15 hours (table 5).1 Taken as a whole, more than one in four Students Who Work reported that work adversely affected their academic schedule or academic performance. The relationship between work and one-year persistence was assessed among Students Who Work by determining who attended for a full academic year (i.e., eight or more months) in 1995-96 relative to the number of hours they worked while enrolled. The amount that students worked was clearly related to the number of months enrolled, especially among first-year students. About one in five first-year students who worked full time were not enrolled for a. full academic year, compared with about one in twenty who worked 1 to 15 hours (figure 6). This pattern was found even after controlling for factors related to persistence such as attendance status, financial aid receipt, institution type, and income. The results also suggested that students who did not work at all while enrolled had higher rates of enrollment interruption than those working '1 to 15 hours. When the work intensity of Students Who Work was analyzed relative to borrowing patterns, undergraduates who worked fewer hours were more likely to borrow than those working more hours. For example, nearly one-half (46 percent) of students working 1 to 15 hours per week borrowed, compared with about one-third of students working either 16 to 20 hours (36 percent) or 21 to 34 hours (36 percent) and about one-quarter of those working full time (table 6). Students who work long hours may have more limited time not only for studying but also for integrating themselves into campus life. While borrowing results in debt that must be repaid when students finish their education, choosing to work intensively in lieu of any borrowing may adversely affect students' academic performance, as well as reduce their chances of completing their degree altogether."}, {"section_title": "INTRODUCTION", "text": "This report provides a detailed overview of approximately 16.7 million undergraduates enrolled in all postsecondary education institutions in the year 1995-96, from July 1 to June 30. It begins with an essay focusing on undergraduates who worked while they were enrolled in school. The essay is followed by a compendium of tables and summary of findings divided into several sections, including the following: The report is based on data from the 1995-96 National Postsecondary Student Aid Study (NPSAS:96), a survey representing all students (including graduates) enrolled in postsecondary institutions. Its primary purpose is to provide detailed information on how students and their families pay for postsecondary education.2 In addition to detailed financial aid information, the survey provides comprehensive data on enrollment, attendance, and student demographics. There are several sources of data within the survey, including institution data, financial aid records, national loan files, student interviews, and parent interviews. Variables presented in the report are defined in the glossary (appendix A). This report is based on institutional records of approximately 41,400 undergraduates from 832 institutions. About 27,000 undergraduates also were interviewed by telephone. 2For more information, consult the NPSAS:96 methodology report: The 1995-96 National Postsecondary Student Aid Survey Methodology Report (NCES 98-073) (Washington, DC: U.S. Department of Education, National Center for Education Statistics, 1998). It is available on the World Wide Web at http://www.ed.gov/NCES/."}, {"section_title": "UNDERGRADUATES WHO WORK", "text": "In the decade between 1985-86 and 1995-96, undergraduate charges for tuition, room, and board increased 23 percent at public colleges and 36 percent at private colleges.3 As a percentage of family income, these charges grew from about 12 to 15 percent at public colleges and 32 to 42 percent at private colleges.4 While federal financial aid has kept pace with increases in tuition and fees over the same time period, a smaller proportion of federal aid has been distributed in the form of grants and a larger proportion in the form of loans.5 Faced with increases in education costs, many undergraduates rely heavily on work to help pay for their postsecondary education. Recent reports indicate that most undergraduates enrolled in U.S. postsecondary education work while enrolled, and many work full time.6 This may be especially true for students who are reluctant to borrow for fear of not being able repay their education debt. This essay is based on about 21,000 telephone interviews with undergraduates who worked while they were enrolled in postsecondary education in 1995-96. Unlike earlier studies of student employment, this study makes a distinction between undergraduates who work primarily to pay for their schooling and those who have established employment that they have combined with postsecondary study. The essay begins by discussing the employment, enrollment, and demographic differences between these two groups of undergraduates. The remainder of the essay focuses entirely on undergraduates who work to help pay for their education. The discussion includes the extent to which students' parents expected them to work; how likely students were to report that work limited their academic program or adversely affected their academic perform-  Statistics, 1994).\nance; how work was related to financial aid receipt, especially to borrowing; and how work intensity was related to persistence in the 1995-96 school year.\nthat work had a positive effect on their academic performance (22 percent) than students working 21-34 hours (12 percent) or 35 or more hours (10 percent). In summary, more than one-third of Students Who Work reported that work limited their class schedule, and about the same proportion reported that work had a negative effect on their academic performance. Furthermore, among those who worked more than half time (21 or more hours), roughly half reported that work adversely affected their performance. Taken as a whole, therefore, these results indicate that more than one in four undergraduates who identify themselves as students who work to pay for education expenses are adversely affected by the amount they work.\nlated to persistence. The same analysis also showed that working 14 or fewer hours per week had a positive effect on persistence in a multivariate model compared to working 15-33 hours. The results of this report imply that the methods students choose in paying for their postsecondary education can have an impact on their persistence and eventual degree attainment. Among undergraduates who were enrolled in 1995-96, those who identified themselves as students who worked to pay for their education expenses differed in their likelihood of borrowing and how much they borrowed relative to how much they worked. Overall, slightly more than one-third of Students Who Work (35 percent) had taken out a student loan, borrowing an average of $4,150 (table 6). Students who worked 15 or fewer hours, however, were more likely to borrow than students who worked more hours (46 percent versus 26 to 36 percent who worked more hours). In addition, among those who borrowed, students who worked 15 or fewer hours borrowed more on average than those who either worked 21-34 hours or 35 or more hours, but not more than students who worked 16-20 hours. These patterns for the rate of borrowing held even when analyzed separately for students in public 4-year colleges and those in private, not-forprofit 4-year institutions.25 Table 6Among undergraduates who worked to help pay for school expenses,* the percentage receiving financial aid, and among those who received that type of aid, the average amount received, by the average hours worked per week while enrolled: 1995-96 25In public 4-year institutions, among those working to pay expenses, 48 percent who worked 1-15 hours borrowed, compared with 35 percent of students who worked 35 or more hours. In private, not-for-profit 4-year institutions, the proportions borrowing were 64 percent and 45 percent, respectively, among students working 15 or fewer hours or 35 or more hours. The amount borrowed, however, for either of these groups did not differ significantly (NPSAS:96 Undergraduate Data Analysis System).\n29S. Cuccaro-Alamin and S. Choy, Postsecondary Financing Strategies, and L. Horn, Undergraduates Who Work While Enrolled.\n\nStudy). For undergraduates who identify themselves as Students Who Work, the purpose of work is to help them achieve their educational goals, and for these students, the impact of work on their academic program can be more directly assessed. This study focused primarily on these undergraduates. Students Who Work made up about one-half of the undergraduate population, and they were more likely to be dependent, enrolled in a 4-year institution, and attending full time than Employees Who Study. Students Who Work reported working an average of 25 hours per week. They were relatively evenly distributed across the work spectrum, with similar proportions reporting that they worked full time as working 15 or fewer hoursabout one in four in each group. Working intensity was associated with where students were enrolled and whether they attended full time or part time. Students in 4-year institutions or students attending full time (regardless of where they were enrolled) were more likely to report working 15 or fewer hours and less likely to report working 35 or more hours than their counterparts enrolled in 2-year institutions or those attending part time. How much students worked was strongly related to how often they reported that work limited their schedule or negatively affected their performance. Students working 15 or fewer hours were much less likely than students working more hours to report that work limited their class choices, their class schedules, the number of classes they could take, or access to the library. In fact, as the number of hours worked while enrolled increased, the likelihood of students reporting such limitations rose. The same was also true for the likelihood of dependent students reporting that work had a negative effect on their academic performance. Overall, the results indicated that more than one in four Students Who Work felt that work adversely affected their academic program. In addition to examining the relationship between work intensity and student-reported effects, the study also analyzed the relationship between work intensity and the persistence of students in 1995-96. It was limited to undergraduates meeting the following criteria: Students Who Work, enrolled in the fall of 1995, had a bachelor's or associate's degree objective, and did not attain their degree in 1995-96. Whether or not these students enrolled for fewer than eight months was the outcome measured. A clear relationship between length of enrollment and working full time was found when compared with working 15 or fewer hours. This was apparent for both first-year and continuing students. One in five first-year students working full time did not attend for a full year, compared with one in twenty among those working 15 or fewer hours.\nEven when controlling for related factors such as attendance status, income, and institution type, students who worked full time had lower persistence than those who worked 1-15 hours. Given the relationships between work intensity and persistence, it is important to understand the relationship between working and borrowing, especially if borrowing enables a student to work less. In this study, there was some indication that students may substitute working for borrowing. Students who reported working 15 or fewer hours were far more likely to borrow (47 percent versus 26 percent) and also borrowed more on average ($4,344 versus $3,810) than their counterparts working full time. The differences in the proportions working 15 or fewer hours versus 35 or more hours were also found for students in either public 4-year institutions or private, not-for-profit 4-year institutions. Students who work long hours have more limited time not only for studying but also for fully integrating themselves into campus life. In a study of college retention, Astin reported that \"the largest negative effect on retention is working full time as a student.\"33 While borrowing results in debt that must be repaid when students finish their postsecondary education, choosing to work intensively in lieu of any borrowing may increase a student's chance of not finishing his or her degree. In fact, based on the results of this study, it appears that borrowing enough to reduce the number of hours a student needs to work to no more than 15 hours per week may increase a student's chances of completing her or his degree.  Among undergraduates who worked while they were enrolled, almost two-thirds (63 percent) identified themselves as students who worked primarily to pay for their education; the remaining working undergraduates identified themselves primarily as employees who were also enrolled in postsecondary education (table 1.2). Among undergraduates who worked while enrolled, 91 percent reported working either all the weeks they were enrolled (69 percent) or most of the weeks they were enrolled (22 percent; table 1.3). In 1995-96, about one in ten (11 percent) undergraduates reported participating in an apprenticeship, internship, or cooperative education program, ranging from about 5 percent for first-year beginning students to 26 percent of seniors (table 1.4). Undergraduates in 2-year institutions were less likely to have participated in internships than those in less-than-2-year or 4-year institutions (3 percent versus 8 percent and 12 percent; table 1.4). 'Represents about 79 percent of undergraduates. 2Category for \"more than one institution\" is shown only under \"level of institution.\" The distributions are identical. 3Total percentages may not be within the range of percentages for subgroups due to missing values, or because the row variable may include only a subgroup of the total.   "}, {"section_title": "VARIABLE DEFINITIONS", "text": "The primary analytic variable used in this report is the number of hours students reported working while they were enrolled during the 1995-96 school year, including work-study jobs.7 If students did not work while they were enrolled, they were identified as not working regardless of whether they worked in the summer months or other periods when they were not enrolled. The other important employment variable distinguishes between working undergraduates who considered themselves primarily students who worked to help pay for their education expenses and those who considered themselves primarily employees who were also enrolled in postsecondary education.8 Most of the analysis is based on students who worked to pay for their education expenses. One-year persistence rates for the 1995-96 school year were estimated using an indicator of whether or not students were enrolled for a full academic year (eight months or more). The analysis was based on students who were enrolled in the fall of 1995, had an associate's or bachelor's degree objective, and who had not yet attained the degree. Those who had fewer than eight months of enrollment were considered to have interrupted their enrollment. Other variables include whether or not students' parents expected them to work and the number of hours they expected, whether or not students were working on campus or in workstudy jobs, and how students reported that work limited their schooling or affected their academic performance."}, {"section_title": "HOW MUCH DO UNDERGRADUATES WORK?", "text": "Four of five undergraduates (79 percent) reported working during their 1995-96 enrollment (figure 1).9 Those who reported working tended to do so for their entire enrollment: about 90 7Students were asked: \"About how many hours did you work per week while you were enrolled (July 1, 1995through June 30, 1996?\" 8Students were asked: \"While you were enrolled and working would you say you're primarily a student working to meet expenses or an employee who's decided to enroll in school?\" 9This is a slightly higher rate than the 77 percent reported in 1989-90 in L. Horn, Undergraduates Who Work While Enrolled in Postsecondary Education: 1989-90 (NCES 94-311) (Washington, DC: U.S. Department of Education, National Center for Education Statistics, 1994), 8."}, {"section_title": "18", "text": "percent worked all or most of the weeks they were enrolled.m While full-time work was most common among part-time students (64 percent of exclusively part-time students worked 35 or more hours), it was not limited to this group. About one in five (19 percent) students enrolled exclusively full time reported working full time (35 or more hours per week) while enrolled.\" 1°About 69 percent reported working all the weeks they were enrolled, and an additional 22 percent reported working most of the weeks they were enrolled (compendium table 1.3). 'Compendium table 1.1."}, {"section_title": "UNDERGRADUATES WHO WORK Undergraduates Who Do Not Work", "text": "About one in five undergraduates (21 percent) reported that they did not work while enrolled in 1995-96 (figure 1). Students who did not work were older on average than undergraduates who worked part time (age 27 compared with age 23 to 24), but younger than students who worked full time (age 30).12 Students who did not work were more likely than those who worked either full time or part time to be enrolled in private, for-profit institutions than (9 percent versus 2 to 5 percent), suggesting that they were more likely to be enrolled for vocational training.13 On the other hand, they were also more likely than full-time workers to attend 4-year institutions and to attend on a full-time basis.\" The income levels of students who did not work (either dependent or independent) were not substantially different from students working part time. But they were more likely than full-time workers to be in the lowest income bracket (19 percent versus 13 percent among dependent students and 38 percent versus 13 percent among independent students).15 Thus, overall, it is difficult to specifically characterize how students who do not work while enrolled differ from those who do, but they tend to resemble students who work part time more than they do those who work full time."}, {"section_title": "STUDENTS VERSUS WORKERS: HOW UNDERGRADUATES IDENTIFY THEMSELVES", "text": "As the enrollment of older students in postsecondary education has grown,16 the proportion of undergraduates who have spent a period of time in the work force also has risen. In 1995-96, more than half of undergraduates aged 24 years or older worked full time while they were enrolled (53 to 57 percent), compared with less than one-quarter (15 to 22 percent) of students under the age of 24.\" Thus, for analytical purposes, it is useful to distinguish how students characterize their employment relative to their postsecondary enrollmentthat is, to determine which students work for the purpose of paying for their education and which have established employment and are enrolled in postsecondary education to enhance their careers or for personal fulfillment. For the former group, working is clearly a means to help them achieve their educational goals, and for these students, the impact of work on their educational progress can be more  Statistics, 1995). \"Compendium table 1.1."}, {"section_title": "20", "text": "UNDERGRADUATES WHO WORK directly assessed. For those with established employment, working is a primary activity that may or may not be related to their postsecondary enrollment. There are obvious employment, enrollment, and demographic differences between these two groups of working students, which are discussed below. Hereafter, these two groups of undergraduates are referred to as \"Students Who Work\" and \"Employees Who Study.\""}, {"section_title": "Students Who Work Versus Employees Who Study", "text": "About one-half of 1995-96 undergraduates identified themselves primarily as Students Who Work (figure 2); slightly less than one-third (29 percent) identified themselves as Employees Who Study; and the remaining did not work while enrolled. Students Who Work were evenly distributed across the work spectrum. For example, 25 percent reported working 15 or fewer hours, and 26 percent reported working full time (35 or more hours per week). In contrast, 79 percent of Employees Who Study were employed full time while enrolled. Students Who Work reported working an average of 25 hours per week while they were enrolled, substantially fewer hours than the 39 hours per week reported by Employees Who Study. About three-quarters (73 percent) of Students Who Work were under the age of 24 (28 percent were under 19 and 45 percent were aged 19-23). In contrast, less than one-quarter of Employees Who Study were under 24 (8 percent were under 19 and 15 percent were aged 19-23; figure 3). In keeping with these age differences, Students Who Work were far more likely to be financially dependent on their parents (67 percent versus 17 percent), while Employees Who Study were almost exclusively independent (83 percent). Fifty-eight percent of Employees Who Study were married and 42 percent had dependents, compared with 20 percent and 14 percent of Students Who Work. With respect to where they were enrolled, roughly half of Students Who Work were enrolled in 4-year colleges or universities (52 percent), and 38 percent were enrolled in 2-year institutions (figure 4). In contrast, Employees Who Study were enrolled predominantly in 2-year institutions (64 percent), while about one in four (28 percent) were enrolled in 4-year colleges or universities. Consistent with their working intensity, more than two-thirds (68 percent) of Employees Who Study were enrolled exclusively part time, while more than half (55 percent) of Students Who Work were enrolled exclusively full time. UNDERGRADUATES WHO WORK Figure 2Percentage distribution of undergraduates who worked while enrolled according to how they identified their work and enrollment relationship, and the percentage distribution according to the average hours worked per week while enrolled: 1995-96 Average hours worked = 25 Students who work 50% Employees who study 29% Average hours worked = 39    "}, {"section_title": "UNDERGRADUATES WHO WORK STUDENTS WHO WORK TO PAY EDUCATION EXPENSES", "text": "The remainder of this essay focuses on undergraduates who identified themselves as students who work to help pay for their education. As discussed above, these students tend to be younger, more often enrolled in 4-year institutions, and more likely to be enrolled full time than their counterparts who are primarily employees. How much these students worked was strongly associated with where they were enrolled and whether they attended full time or part time (table 1). Students who were enrolled in 4-year colleges tended to work fewer hours than those in 2-year institutions. For example, 34 percent worked 15 or fewer hours and 18 percent worked 35 or more hours, while among those in the 2year sector, 15 percent worked 15 or fewer hours and 36 percent worked 35 or more hours. Students who attended exclusively full time were also more likely to work 15 or fewer hours and less likely to work full time than students with mixed or exclusively part-time enrollment. Table 1Among undergraduates who worked to help pay for school expenses,' the percentage distribution according to the average hours worked per week while enrolled and the overall average hours worked, by institution level and attendance intensity: 1995-96 "}, {"section_title": "What Parents Expect", "text": "Dependent undergraduates (67 percent of Students Who Work) reported whether or not their parents expected them to work while enrolled, and if so, the number of hours their parents expected them to work. As shown in table 2, nearly two-thirds (63 percent) of dependents' parents expected them to work while enrolled and to work, on average, about half time (21 hours per week). As the number of hours students actually worked increased (up to 34 hours), so did the proportion of parents who expected them to work.18 Furthermore, the number of hours students worked coincided closely with what they thought their parents expected. For example, among students working 1-15 hours per week, parents expected them to work about 14 hours per week; for those working 16-20 hours, parents expected them to work 20 hours per week, and so on. "}, {"section_title": "Location of Employment", "text": "Previous research on student employment has determined that the location of a student's job may affect his or her education outcomes. In a review of studies conducted since 1975, Pascarella and Terenzini reported that there is consistent evidence demonstrating that off-campus employment has a negative effect on year-to-year persistence and on bachelor's degree attain-ment, while part-time employment on campus has a positive influence.19 It is thought that working on campus facilitates students' integration into campus life and that working off campus inhibits it. In 1995-96, fewer than one in five Students Who Work were employed on campus (15 percent); however, there were strong relationships between work intensity and the likelihood of oncampus work (table 3). In general, the more hours students worked (up to 34 hours), the less likely they were to be employed on campus.20 For example, 37 percent of students working 15 or fewer hours worked on campus, compared with 16 percent working 16-20 hours and 6 percent working 21-34 hours. Similar to the pattern found for working on campus, students who worked 15 or fewer hours were also much more likely to have work-study jobs (23 percent) than were students who worked more hours (2 to 9 percent).21 This relationship would be expected because most workstudy jobs are located on campus, and most are no more than half time.22 Table 3Among undergraduates who worked to help pay for school expenses,' the percentage who were employed on campus and the percentage who had work-study jobs, by the average hours worked per week while enrolled: 1995-96 Students Who Work were asked about the limitations that work imposed on their academic program. These limitations included restricting the choice of classes, limiting the number of classes, limiting time in which classes can be scheduled, and having less access to the library (table 4). About 40 percent of Students Who Work reported that their work schedule limited their class schedule, and 36 percent reported that their choice of classes was reduced. It is clear from these results that the more hours students worked, the more likely they were to report any one of the four limitations. For example, for each of the four limitations, less than one-quarter (15 to 22 percent) of students working 15 or fewer hours reported that work imposed the limitation, compared with 41 percent or more of students working full time. Parallel to these findings, the more students reported working (up to 34 hours), the more likely they were to indicate that working had a negative effect on their academic performance (table 5).23 Those working more than 15 hours per week were at least twice as likely to say work had a negative effect. About 17 percent of students working 15 or fewer hours reported that work had a negative effect on their academic performance, compared with 34 percent of those working 16-20 hours, 46 percent of those working 21-34 hours, and 55 percent of those working 35 or more hours. Conversely, students working 15 or fewer hours were much more likely to report 23Note that only dependent students (67 percent of students who work) were asked to report on the effect that work had on their academic performance."}, {"section_title": "Relationship Between Working and Borrowing", "text": "The results from a recent report based on a national survey of undergraduates who first began their postsecondary education in 1989-90 (BPS:89/94) indicate that students who borrowed to pay for their education had higher postsecondary persistence rates (as of 1994) than those who did not borrow.24 This remained true after controlling for institution type and other variables re-24S. Cuccaro-Alamin and S. Choy, Postsecondary Financing Strategies: How Undergraduates Combine Work Borrowing, and Attendance (NCES 98-088) (Washington, DC: U.S. Department of Education, National Center for Education Statistics, 1998)."}, {"section_title": "30", "text": "Figure 5 illustrates the relationship between work intensity and financial aid status for Students Who Work. It is clear from this figure that financial aid in general, and financial aid that includes borrowing in particular, were associated with working intensity. Students who received financial aid but did not borrow were more likely than those who did not receive aid to work 15 or fewer hours (27 percent versus 18 percent) and less likely to work 35 or more hours (26 percent versus 32 percent). Similarly, among those who received aid, students who borrowed were more likely than students who did not borrow to work 15 or fewer hours and less likely to work 35 or more hours. There were no differences, however, in the proportion of students working either 16-20 hours or 21-34 hours with respect to receiving aid or borrowing. Persistence in 1995-96 The final analysis examines the likelihood of not attending for a full academic year in relation to undergraduate work intensity while enrolled. To estimate whether students interrupted their enrollment in 1995-96, an indicator of whether or not students were enrolled for eight or more months was used.26 The analysis was limited to students who worked while enrolled to pay education expenses; were enrolled in the fall of 1995; and had an associate's or bachelor's degree objective and did not attain the degree in 1995-"}, {"section_title": "96.", "text": "Given their educational objectives, these students would be expected to continue their enrollment for a full academic year. This group represents about one-third of the undergraduate population. Approximately 50 percent of undergraduates identified themselves as students who work to pay expenses, among whom 66 percent were enrolled in the fall of 1995 in associate's or bachelor's degree programs, and had not attained a degree by June 30, 1996.27 Because first-year students are much more likely to drop out or interrupt their enrollment than continuing students, the analysis also distinguishes between these two groups of students. As shown in figure 6, the results indicate that the likelihood of students attending for a full year was related to their employment intensity.28 This was true for both first-year and continuing students. About one in five (21 percent) first-year students working 35 or more hours per week did not attend for a full year, compared with about one in twenty (6 percent) who worked 1-15 hours. Among continuing students, 2 percent who worked 1-15 hours did not attend for a full year, compared with 11 percent of those working full time. For both first-year and continuing students, those working 1-15 hours per week were less likely to interrupt their enrollment than students working 16-34 hours per week. While it appears that the rates of enrollment interruption for those working 16-34 hours were lower than the rates for those working 35 or more hours (e.g., 13 percent versus 21 percent of first-year students), the group sizes were small and there was not enough statistical evidence to conclude that they were different. 26To capture the actual persistence rates for the year, one would have to know how many students did not return in the next year, and this information is not available in this survey. NPSAS:96 is a survey of one academic year and therefore does not have rates of enrollment for the next year. However, a new Beginning Postsecondary Students (BPS:96) survey is being conducted based on all first-time, first-year NPSAS:96 students. Since this cohort will be followed over time (the first follow-up is currently in progress), it will be possible to determine the year-to-year persistence of this group. 27NPSAS:96 Undergraduate Data Analysis System. 28The students working 16-20 hours and 21-34 hours were combined because their rates of attrition were not significantly different: 14 percent and 13 percent of first-year students and 8 percent and 6 percent of continuing students. Figure 6Among students who either did not work or who worked to pay education expenses and who had  a degree objective,' the percentage not enrolled for a full year,2 by the average hours worked  per week while enrolled and year in  Supporting the findings of earlier studies,29 this analysis also found that students who did not work while enrolled were less likely to attend for a full academic year than those working 1-15 hours. This result held for both first-year (15 percent versus 6 percent) and continuing students (6 percent versus 2 percent). In fact, students who did not work had similar attrition rates as students working 16-34 hours."}, {"section_title": "Controlling for Related Variables", "text": "When determining the association between work intensity and persistence, factors related to work that may influence persistence need to be considered. For example, students who attend school exclusively part time are much less likely to persist to degree attainment.30 At the same time, part-time students are much more likely to work full time than those who attend school full time (see table 1). To take into account the interrelationship of work and other related variables, this analysis used a linear regression mode1.31 The dependent variable was a measure of enrollment interruption defined as attending school fewer than eight months, i.e., those students who did not attend for a full academic year. In addition to hours worked, the independent variables included attendance status (exclusively part-time enrollment versus others), gender, age, income quartiles, undergraduate level (first-year versus others), institution sector, race-ethnicity, job location, and financial aid receipt. The analysis was limited to students enrolled in the fall of 1995 who worked to pay expenses, had an associate's or bachelor's degree objective, and had not attained the degree (about one-third of the undergraduate population). The results are displayed in table 7. Column one displays the unadjusted percentages representing the proportion of students who attended fewer than eight months. Column two displays the percentages after being adjusted for the covariation of the independent variables. Asterisks indicate that the group differed significantly from the reference group (in italics). For example, both before and after adjustment, students who attended exclusively part time were much more likely to attend fewer than eight months than students with full-time or mixed full-and part-time enrollment (28 versus 7 percent [unadjusted]; 24 versus 8 percent [adjusted]). The third column displays the regression coefficients. Since the dependent variable is a measure of enrollment interruption, a positive coefficient indicates the variable contributes to enrollment interruption when compared to the reference group, while a negative coefficient indicates the opposite. For example, compared to working 1 to 15 hours per week, the regression coefficients for students working more hours are all positive. Furthermore, the percentages of students working either 16 to 20 hours or 35 or more hours are significantly greater than the percentage for students working 1 to 15 hours (12 and 13 percent versus 7 percent). In other words, students working 16 to 20 hours or 35 or more hours were significantly more likely to attend fewer than eight months in 1995-96 than students working 1 to 15 hours even after holding related variables constant.  Education Statistics, 1996). 31See appendix B for a description of the statistical methods.  This analysis determines the likelihood of students interrupting their enrollment only within one academic year. As such, it is an overestimate of actual one-year persistence because it does not take into account students who did not return to school the following school year. Nevertheless, even within this restricted time frame, the results confirm the adverse relationship of working full time to persistence, and they also suggest that, compared with working 1 to 15 hours per week, working more hours while enrolled is associated with higher rates of enrollment interruption. These results are consistent with a recent report that analyzed five-year persistence rates of 36 UNDERGRADUATES WHO WORK students who began postsecondary education in 1989-90.32 That study found that in addition to working full time, students who worked an average of 15 to 33 hours per week while enrolled were less likely to persist over a five-year period than were students working 1 to 14 hours. Another finding from the same longitudinal study showed that students who borrowed during their enrollment were more likely to persist over five years than students who did not borrow even after controlling for income, academic performance, institutional type, and other variables. In the current, study the unadjusted percentages are significantly different (5.1 percent of aided students who borrowed attended fewer than eight months versus 8.6 percent of aided students who did not borrow), but the adjusted percentages (6.4 percent and 8.5 percent) are not. However, those with no aid were more likely to attend less than a full year than were students with aid that did not include loans."}, {"section_title": "34", "text": "The results concerning the location of a student's job were inconclusive. Before adjustment, among students who worked on campus, the percentage attending fewer than eight months was significantly less than the percentage for students working off campus (4 percent versus 11 percent). However, once the number of hours worked and other variables were controlled for, the percentages were virtually the same (10 percent). This may be because students who work on campus are much more likely to work 15 or fewer hours than students who work off campus, and once work intensity is held constant, the positive effect of working on campus disappears. It is also possible that the effect of working on campus may be more apparent when determining which students return to school the following year. If working on campus enhances student engagement with the institution, it is possible that students who work on campus are more likely to return to school the following year than those who do not. Because of the cross-sectional nature of the data, this phenomenon cannot be taken into account in the current analysis. However, in 1998, the first follow-up of the Beginning Postsecondary Students (BPS) longitudinal cohort of the 'NPSAS:96 survey will be available for analysis, at which time this relationship can be further investigated."}, {"section_title": "SUMMARY AND CONCLUSIONS", "text": "This study focused on the extent to which undergraduates worked while they were enrolled in 1995-96. Unlike earlier studies on student employment, the analysis distinguished between students who worked primarily to pay for their education (Students Who Work) and those who had established' employment that they combined with postsecondary study (Employees Who 32S. Cuccaro-Alamin and S. Choy, Postsecondary Financing Strategies."}, {"section_title": "41", "text": ""}, {"section_title": "SECTION 2: ENROLLMENT AND ATTENDANCE INSTITUTION TYPE", "text": "In 1995-96, about the same proportions of undergraduates were enrolled in 4-year institutions as were enrolled in 2-year institutions (45 percent and 46 percent, respectively; table 2.1). Younger undergraduates were more likely to be enrolled in 4-year institutions than older students, who tended to be enrolled in 2-year institutions. For example, 56 percent of undergraduates aged 19-23 were enrolled in 4-year institutions, compared with 27 percent of students aged 40 or older; in contrast, 64 percent of students aged 40 or older were enrolled in 2-year institutions, compared with 36 percent of students aged 19-23 (table 2.1). Although similar proportions of male and female undergraduates attended 2-year and less-than-2-year institutions, men were more likely than women to attend 4-year institutions (47 percent versus 44 percent; table 2.1). Black, non-Hispanic and Hispanic undergraduates were less likely than their white, non-Hispanic or Asian/Pacific Islander counterparts to attend 4-year institutions. About 38 percent of black, non-Hispanic and 35 percent of Hispanic students attended 4-year institutions, compared with 47 percent of white, non-Hispanic and 53 percent of Asian/Pacific Islander students. Conversely, black and Hispanic students were more likely to attend less-than-2-year institutions (8 percent) than white or Asian/Pacific Islander students (3 percent; table 2.1). In 1995-96, three-quarters of all undergraduates were enrolled in public institutions; 16 percent were enrolled in private, not-for-profit institutions; and 5 percent attended private, for-profit institutions. About 5 percent of undergraduates attended more than one institution (either simultaneously or consecutively; table 2.2). Racial-ethnic differences (also related to differences in income level as discussed on page 79) were found relative to institution control: black, non-Hispanic and Hispanic students attended private, for-profit institutions in higher proportions than white, non-Hispanic or Asian/Pacific Islander students (9 percent and 10 percent of black and Hispanic students versus 4 percent for either white or Asian students; table 2.2). In 1995-96, about 43 percent of undergraduates attended public 2-year institutions; 18 percent attended doctorate-granting and 12 percent attended nondoctorate-granting public 4-year colleges and universities; and 5 percent of undergraduates attended doc-;), 4 SECTION 2: ENROLLMENT AND ATTENDANCE torate-granting and 10 percent attended nondoctorate-granting private, not-for-profit 4year institutions (table 2.3). Students under 24 were much more likely than students 24 or older to be enrolled in public 4-year doctorate-granting institutions. For example, 22 percent of students aged 18 or younger were enrolled in public 4-year doctorate-granting institutions, compared with 15 percent of students aged 24-29. Half or more of students 24 and older, on the other hand, were enrolled in public 2-year institutions. About 50 percent of students 24-29 were enrolled in public 2-year institutions, compared with 38 percent of students under 19 (table 2.3)."}, {"section_title": "ENROLLMENT INTENSITY", "text": "About 16 percent of 1995-96 undergraduates were enrolled in postsecondary education for the first time (first-year beginning students; table 2.4). About 23 percent of students attending exclusively full time were first-year beginning students, compared with 9 percent attending exclusively part time and 12 percent with mixed full-time, part-time attendance (table 2.4). Including those who attended only one term, in 1996, undergraduates were more likely to attend a postsecondary institution full time than part time. About 45 percent of students were attending school exclusively full time, compared with 36 percent of students attending exclusively part time and 19 percent of students with mixed enrollment intensity (table 2.5a)."}, {"section_title": "ENROLLMENT CONSIDERATIONS", "text": "Approximately 20 percent of undergraduates reported that they had considered the graduation rate when choosing their institution. Students enrolled in 4-year and 2-year public or private, not-for-profit institutions were asked if they had considered the crime rate when making their decision to attend, and about 14 percent reported having done so (table 2.6).      'Column classifications refer to NPSAS institution only. 2Category for \"more than one institution\" is shown only under \"level of institution.\" The distributions are identical. 3Total percentages may not be within the range of percentages for subgroups due to missing values, or because the row variable may include only a subgroup of the total, such as \"primary role,\" which includes only working students.   'Students were asked if they considered the crime rate if they were enrolled in public or private, not-for-profit 2-year or 4-year institutions. 2Column classifications refer to NPSAS institution. 3Category for \"more than one institution\" is shown only under \"level of institution.\" The distributions are identical.°T otal percentages may not be within the range of percentages for subgroups due to missing values, or because the row variable may include only a subgroup of the total, such as \"primary role,\" which includes only working students. "}, {"section_title": "SECTION 3: DEGREE PROGRAM, FIELD OF STUDY, AND GRADE POINT AVERAGE", "text": "Consistent with the distribution of undergraduates attending 2-year and 4-year institutions (see table 2.1), similar proportions of students were enrolled in associate's and bachelor's degree programs (43 percent and 42 percent, respectively); about 12 percent of undergraduates were in programs leading to a vocational certificate (table 3.1). Racial-ethnic group differences in degree programs corresponded to students' enrollments in institution levels: both black, non-Hispanic and Hispanic students (who were less likely than white, non-Hispanics or Asian/Pacific Islanders to attend 4-year institutions) were also less likely than white, non-Hispanic or Asian/Pacific Islander students to be pursuing a bachelor's degree (table 3.1). Black, non-Hispanic undergraduates, who were more likely than white, non-Hispanic or Asian/Pacific Islander students to attend less-than-2-year institutions (see table 2.1), were also more likely to be enrolled in vocational certificate programs than were white, non-Hispanics or Asian/Pacific Islanders (table 3.1). Undergraduates under 24, who were more likely to be enrolled in 4-year institutions (table 2.1), were also more likely to be in a bachelor's degree program than students 24 and older. For example, 54 percent of students aged 19-23 were pursuing bachelor's degrees, compared with 34 percent of students aged 24-29. Students 24 and over, on the other hand, were more likely to be pursuing an associate's degree (table 3.1). Among undergraduates with a declared major or field of study, about 20 percent reported studying in a business-related field. Approximately 15 percent were majoring in a humanities field, and 13 percent were in a health-oriented discipline. Fourteen percent of undergraduates reported other professional or technical majors (table 3.2). Women were much less likely than men to be studying computer science or engineering (2 percent each for women versus 5 percent in computer science and 15 percent in engineering for men), and were much more likely to be majoring in education or health fields (10 percent versus 5 percent in education and 18 percent versus 6 percent in health). Women were also somewhat more likely than men to major in the social or behavioral sciences (10 percent versus 8 percent; table 3.2). Female undergraduates tended to have higher cumulative GPAs than males: 15 percent of women earned mostly A's, compared with 11 percent of men. An additional 22 percent of women had grades of A's and B's, compared with 16 percent of men (table   3.3).   'Column classifications refer to NPSAS institution. 2Category for \"more than one institution\" is shown only under \"level of institution.\" The distributions are identical. 3Total percentages may not be within the range of percentages for subgroups due to missing values, or because the row variable may include only asubgroup of the total, such as \"primary role,\" which includes only working students.   "}, {"section_title": "SECTION 4: STUDENT CHARACTERISTICS GENDER", "text": "Consistent with trends over the last two decades, in 1995-96, a higher proportion of students enrolled in postsecondary education were women than men (57 percent versus 43 percent, respectively). Among undergraduates enrolled in 2-year institutions, a higher proportion were women (58 percent) than among those enrolled in 4-year institutions (55 percent; table 4.1). Undergraduates 40 and older were more likely to be women, compared with undergraduates under 30. In fact, about two-thirds (65 percent) of undergraduates age 40 or older were women. Similarly, 61 percent of independent students (most of whom are 24 or older) were women, compared with 53 percent of dependent undergraduates (table 4.1). Respondents who were independent and married or independent with dependents were more likely to be women than those who were dependent (67 percent versus 53 percent; table 4.1)."}, {"section_title": "RACE-ETHNICITY", "text": "Approximately 30 percent of 1995-96 undergraduates identified themselves as nonwhite. About 12 percent of undergraduates were black, non-Hispanic; 10 percent were Hispanic; 6 percent were Asian/Pacific Islander; and about 1 percent were American Indian/Alaskan Native (table 4.2). Students attending less-than-2-year institutions were much more likely to be black, non-Hispanic than students attending 2-or 4-year institutions (23 percent versus 13 and 10 percent, respectively; table 4.2)."}, {"section_title": "AGE (AS OF 12/31/95)", "text": "A little under half of 1995-96 undergraduates (45 percent) were between the ages of 19 and 23. Fifteen percent were 30-39 years old, 12 percent were 40 or older, and the remainder were 18 or younger (table 4.3)."}, {"section_title": "SECTION 4: STUDENT CHARACTERISTICS", "text": "In keeping with the family and work responsibilities associated with being older or with the need to obtain occupationally specific training for older students, undergraduates in institutions with short-term program offerings (i.e., those in 2-year and less-than-2-year institutions) were much more likely to be 40 or older (17 percent in either program) than those enrolled in 4-year institutions (7 percent were age 40 or older). Furthermore, about 19 percent of students enrolled in 2-year institutions and 24 percent in less-than-2-year institutions were 30-39, compared with 10 percent of those enrolled in 4-year colleges (table 4.3). Similarly, a much higher proportion of students pursuing vocational certificates and associate's degrees were older than that of students pursuing bachelor's degrees. About 21 percent of undergraduates enrolled in certificate programs and 14 percent of those earning an associate's degree were 40 or over, compared with 6 percent of those pursuing a bachelor's degree (table 4.3). Racial-ethnic group differences were also apparent relative to age. For example, 18 percent of black, non-Hispanic undergraduates were 30-39 years old, compared with 12 percent of their Asian/Pacific Islander and 15 percent of their white, non-Hispanic counterparts. Also, 52 percent of Asian/Pacific Islanders were 19-23 years old, compared with 40 percent of black, non-Hispanics and 45 percent of white, non-Hispanics (table 4.3)."}, {"section_title": "DEPENDENCY STATUS", "text": "Students attending 4-year institutions were more likely to be dependent than students enrolled in less-than-4-year institutions. Sixty-three percent of students enrolled in 4year institutions were dependents, compared with 38 percent in 2-year and 24 percent in less-than-2-year institutions (table 4.4). Independent students who had dependents accounted for about 47 percent of undergraduates attending less-than-2-year institutions, a much higher proportion than that of students enrolled in 2-year (32 percent) or 4-year (15 percent) institutions (table 4.4)."}, {"section_title": "INCOME", "text": "Students enrolling in private, not-for-profit 4-year doctorate-granting institutions were more likely to be dependents in families with incomes of $80,000 a year or more than students in other types of institutions. For example, 15 percent of undergraduates enrolled in private, not-for-profit 4-year doctorate-granting institutions were dependents in families with incomes of more than $100,000 a year, compared with 10 percent of students enrolled in public 4-year doctorate-granting institutions (table 4.5a). Students attending private, for-profit institutions were much more likely to be from low-income families than students attending other institutions. About one-third (34 percent) of dependent students enrolled in private, for-profit institutions were from families with incomes under $20,000, compared with 18 percent of students attending public institutions and private, not-for-profit institutions (table 4.5b). Among dependent undergraduates,34 white, non-Hispanic students were about onethird as likely as students from any other racial-ethnic group to be from a family with an annual income under $20,000. About 12 percent of whites came from these families, compared with 40 percent of black, non-Hispanics, 29 percent of Asian/Pacific Islanders, 37 percent of American Indian/Alaskan Natives, and 38 percent of Hispanics (table 4.5b). Among independent undergraduates,35 single parents were particularly likely to have low incomes. About 42 percent of single parents earned less than $5,000, compared with 26 percent of other independent students (table 4.5c)."}, {"section_title": "MARITAL STATUS", "text": "About one in five (21 percent) of 1995-96 undergraduates were married (table 4.6). Undergraduates in 2-year or less-than-2-year institutions, who are more likely to be older (table 4.3), were also more likely to be married than students enrolled in 4-year colleges or universities (26 and 29 percent, respectively, versus 15 percent; table 4.6)."}, {"section_title": "SINGLE PARENTS", "text": "Eleven percent of all 1996 undergraduates were single parents (table 4.7). Black, non-Hispanics were more likely than members of most other racial-ethnic groups to be single parents.36 About 24 percent of black, non-Hispanic students were single parents, compared with 9 percent of white, non-Hispanics, 15 percent of Hispanics, and 6 percent of Asian/Pacific Islanders (table 4.7)."}, {"section_title": "HIGH SCHOOL COMPLETION", "text": "About 5 percent of 1996 undergraduates completed high school by passing the General Educational Development (GED) exam (table 4.8). Students enrolled in private, for-profit institutions were more likely to have completed a GED than undergraduates enrolled elsewhere. About 14 percent of undergraduates 34See glossary entry DEPEND4 for a definition of the terms dependent and independents. 35Ibid. 36There is a small sample size of American Indian/Alaskan Natives resulting in large standard errors for this group, and there were no statistically significant differences between the proportions of American Indian and black, non-Hispanic single parents. SECTION 4: STUDENT CHARACTERISTICS enrolled in private, for-profit institutions passed the GED, compared with 5 percent in public institutions and 4 percent in private, not-for-profit institutions (table 4.8)."}, {"section_title": "LOCAL RESIDENCY", "text": "In 1995-96, undergraduates were much more likely to reside off campus, but not with family members (61 percent), than to live on campus (14 percent) or with parents or relatives (25 percent; table 4.9). Consistent with the higher proportion of students aged 23 or younger attending private, not-for-profit 4-year institutions (table 2.3) and the higher likelihood of younger students to be living on campus, undergraduates in private, not-for-profit 4-year institutions were much more likely to live on campus than students attending other types of institutions. For instance, about 39 percent of undergraduates in private, not-for-profit 4-year doctorate-granting institutions lived on campus, compared with 24 percent of undergraduates in public 4-year doctorate-granting institutions (table 4.9)."}, {"section_title": "CITIZENSHIP", "text": "In 1995-96, 5 percent of undergraduates were not U.S. citizens, although most noncitizens (4 percent of undergraduates) were eligible for financial aid (table 4.10). About one-third of Asian/Pacific Islander undergraduates were noncitizens; 27 percent were eligible for financial aid and 7 percent were not. By comparison, among Hispanics, 11 percent were eligible noncitizens and less than 1 percent were non-eligible noncitizens (table 4.10).    2.7 0.5 'Category for \"more than one institution\" is shown only under \"level of institution.\" The distributions are identical. 2Total percentages may not be within the range of percentages for subgroups due to missing values, or because the row variable may include only a subgroup of the total, such as \"primary role,\" which includes only working students.           'Category for \"more than one institution\" is shown only under \"level of institution.\" The distributions are identical. 2Total percentages may not be within the range of percentages for subgroups due to missing values, or because the row variable may include only a subgroup of the total, such as \"primary role,\" which includes only working students.          Consistent with financial aid policies, dependent undergraduates from lower income families were much more likely to receive financial aid than those from families with higher incomes. For example, undergraduates whose families earned under $20,000 a year were more likely to receive financial aid than students from families who earned $20,000-39,999; the latter group of students, in turn, were more likely to receive financial aid than undergraduates from families earning $40,000-59,999 (table 5.2a)."}, {"section_title": "93", "text": "About 39 percent of dependent undergraduates received grants (averaging about $3,600), and 31 percent of students took out student loans (averaging about $3,700; Dependent students in private, for-profit institutions were also more likely to receive federal financial aid (69 percent) than dependents in either public or private, not-forprofit institutions (31 percent and 57 percent, respectively; table 5.2a). Students in public 4-year doctorate-granting institutions were less likely to receive federal aid (42 percent) than their counterparts in private, not-for-profit 4-year institutions (61 percent of students in private, not-for-profit 4-year nondoctorate-granting institutions received federal aid, and 49 percent of students in comparable doctorate-granting institutions did so; table 5.2a). Also consistent with financial aid policies for low-income students,37 significantly higher proportions of black, non-Hispanic undergraduates received financial aid (68 percent) than white, non-Hispanics (48 percent) or Asian/Pacific Islanders (48 percent; table 5.2a). 37As shown in table 4.5b, black, non-Hispanics reported lower incomes than white, non-Hispanics or Asian/Pacific Islanders.   'Category for \"more than one institution\" is shown only under \"level of institution.\" The distributions are identical. 2Total percentages may not be within the range of percentages for subgroups due to missing values, or because the row variable may include only a subgroup of the total, such as \"primary role,\" which includes only working students.      Approximately half of 1995-96 undergraduates aspired to an advanced degree as their ultimate degree goal. Even among students who were currently in short-term vocational programs (i.e., in private, for-profit institutions), 23 percent aspired to an advanced degree, and an additional 36 percent aspired to a bachelor's degree (table 6.1). There were no significant differences in aspirations for an advanced degree among undergraduates in various racial-ethnic groups. Regardless of race-ethnicity, a large majority of students aspired to a bachelor's degree or higher. About 35 to 46 percent of undergraduates aspired to a bachelor's degree, and an additional 39 to 57 percent aspired to an advanced degree (table 6.1). Age, on the other hand, was associated with educational goals: younger students (under 19 or 19-23) were more likely to aspire to an advanced degree than students 30 and older. Students under 24 were less likely than older students (30 or older) to aspire to an associate's degree (table 6.1)."}, {"section_title": "COMMUNITY SERVICE", "text": "In 1995-96, 39 percent of undergraduates reported participating in some sort of community service activity. About 29 percent were involved in one community service activity, and an additional 10 percent were engaged in two or more activities (table 6.2). Undergraduates enrolled in certificate and associate's degree programs were less likely than those in bachelor's degree programs to participate in community service activities (70 and 67 percent, respectively, reported no community service, compared with 53 percent of students in bachelor's degree programs; table 6.2). Females were more likely than males to volunteer their time. However, among those who volunteered, men volunteered more hours per week, on average, than women (10 hours versus 7 hours; table 6.2). Students 24-29 years old were less likely than students 30 years or older to be involved with community service activities (table 6.2).         'Question may have been asked prior to the 1996 elections, in which case respondents indicated they would vote in the election. 2Category for \"more than one institution\" is shown only under \"level of institution.\" The distributions are identical. Students in less-than-2-year institutions were more likely to have a disability (9 percent) than students in 4-year institutions (5 percent; table 7.1). Among undergraduates with a disability, students attending private, for-profit institutions were much more likely to have an orthopedic disability (39 percent) than students attending public (23 percent) or private, not-for-profit institutions (19 percent; table 7.1). White, non-Hispanic students were more likely to report having a disability (6 percent) than black, non-Hispanics (3 percent) or Asian/Pacific Islanders (2 percent; table 7.1). Older students (40 years or older) were much more likely to report having a disability than younger students (under 24 years). About 10 percent of students 40 years or older had a disability, compared with 5 percent of students 18 years or younger and 5 percent aged 19-23 (table 7.1)."}, {"section_title": "REMEDIAL COURSE TAKING", "text": "About 12 percent of 1995-96 undergraduates in their first or second year of college reported taking at least one remedial course (table 7.2).38 Among first-and second-year undergraduates who reported having taken at least one remedial course, 70 percent took a remedial math course, 41 percent took a remedial writing course, and 39 percent took a remedial reading course (table 7.2). Students beginning their first year of college, who were more likely to be younger, were much more likely to have taken remedial courses (20 percent) than other firstyear (11 percent) or second-year students (6 percent). 38Student-reported remedial education status reported by NPSAS undergraduates differs markedly from the proportion of students taking remedial courses reported by institutions. In a survey of remedial education in higher education, institutions reported that 29 percent of first-time freshmen had enrolled in at least one remedial reading, writing, or mathematics course in fall 1995. Remedial Education at Higher Education Institutions in Fall 1995 (NCES 97-584) (Washington, D.C.: U.S. Department of Education, National Center for Education Statistics, 1996).  'Because respondents may have had more than one disability, details may not sum to 100. 2Category for \"more than one institution\" is shown only under \"level of institution.\" The distributions are identical. 3Total percentages may not be within the range of percentages for subgroups due to missing values, or because the row variable may include only a subgroup of the total, such as \"primary role,\" which includes only working students.   Among those who volunteered, indicates student response to the question \"How much time did you volunteer?\" Asked on student CATI."}, {"section_title": "Participated in cooperative education COOP", "text": "Indicates whether student reported participating in a cooperative education program during 1995-96. For complete description, see SEPROGRM. Asked on student CATI (Yes/No) Deaf or hard-of-hearing DEAFNESS Indicates whether student reported being deaf or hard-of-hearing. For a complete description, see DISABIL. Asked of first-and second-year students on student CATI (Yes/No)."}, {"section_title": "Undergraduate program DEGFIRST", "text": "Degree program in which student was enrolled in the first term, as reported by the institution. If not available from the institution, information was taken from student interview. Refers to NPSAS institution for those enrolled in more than one institution. Student is not in any of the above degree programs."}, {"section_title": "Certificate", "text": ""}, {"section_title": "DEPEND4", "text": "Student dependency status for financial aid including marital status. Students were considered independent if they met one of the following criteria: 1) Student was 24 years old or older as of 12/31/95; 2) Student was a veteran of the U.S. Armed Forces; 3) Student was enrolled in a graduate or professional program (beyond a bachelor's degree) in 1995-96; 4) Student was married;  "}]