[{"section_title": "LIST OF TABLES", "text": "2.2. Land cover categories scheme developed for the barrier island system of New York. Land cover weights allocate a value on a scale from 0 to 10, 10 having the least value for piping plovers according to the published literature. We use these weights in the creation of the weighted land cover grid and contrast-weighted edge density 2.3. Explanatory variable assignment to the four environmental groups used to explain total piping plover productivity on barrier islands of New York: We used these groupings to compare the independent (marginal) and conditional explanatory power of each environmental group. We conducted a separate generalized linear models for each group in each year. Marginal group differences shown for each group, calculated as the variance explained by the variables, after accounting for spatial autocorrelation; and the amount of variance explained by the spatial configuration of the sample points alone.. ..................................................................................54 2.4. Conditional group differences for each of the environmental groups shown in Table 2.3. This table shows by year, the total variance explain by all four groups; the variance explained by three group models, after accounting for spatial autocorrelation and dropping one group at a time. The number of total variables in each model is listed in parenthesis.. ..................................................................................55 2.5. Annual and pooled generalized linear models (GLM) and regression tree (RT) model results explaining total piping plover productivity during 2004-2005 breeding seasons on barrier islands of New York. Variable coefficients with p-values and significance are given for each GLM model. Splitting variables and overall variable importance are given for the RT. The portion of variance explained is given for all models, with a break down of spatial eigenvector versus environmental variables shown for the GLM models. ...................56 xii"}, {"section_title": "LIST OF FIGURES", "text": ""}, {"section_title": "Figure Page", "text": "1.1. Map of study area on Long Island, New York. The regional context of the study area is in the bottom right corner. We enlarged the barrier island system to show the six islands and peninsulas that make up the study area: Rockaway Peninsula, Long Island, Jones Beach Island,Fire Island,Westhampton Island,and Southampton Beach ..........16 1.2. Odds ratio as a function of kernel bandwidth (meters) for order logistic regression models for three years of piping plover nest density and productivity in New York. Years are shown in color: 2003 − blue, 2004 − red, and 2005 − green. ...................................................................18 1.3. Piping plover nest productivity (fledglings per hectare) by nest density (nests per hectare at the 400m bandwidth) and the 50, 60, 70, 80, 90, 100th  xiii 1.6. Slope (beta) estimates for selected quantiles, showed in Figure 5, by each kernel bandwidth (meters) and year from the quantile regression models describing the relationship of piping plover nest density and productivity on New York's barrier islands. Dots are used when a line cannot be drawn due to missing data. Dashed lines depict the 95% confidence interval around that particular colorcoded year: 2003 in blue, 2004 in red, and 2005 in green. ........................22 2.1. Map of study area on Long Island, New York. The regional context of the study area is in the bottom right corner. We enlarged the barrier island system to show the six islands and peninsulas that make up the study area: 2.3. Regression tree of total productivity of piping plovers from the 2004-2005 breeding seasons on barrier islands of New York. Splitting statements are true to the left and false to the right and are in units per hectare. Terminal nodes are labeled with the predicted mean productivity value per hectare and number of observations in the group in parenthesis. Note that many of the environmental variables are not expected to occur at the densities described in the figure, but for consistencies sake, we show all in hectares.. "}, {"section_title": "DENSITY DEPENDENCE IN PIPING PLOVER (CHARADRIUS MELODIUS)", "text": "NEST PRODUCTIVITY ON THE BARRIER ISLANDS OF NEW YORK"}, {"section_title": "Abstract", "text": "The central and limiting tendency in piping plover (Charadrius melodius) density and productivity data was examined across multiple temporal (2003)(2004)(2005) and spatial scales (50-400m). Central tendency analysis showed weak density-dependent productivity. Ordered logistic regression models indicated density dependence across all spatial scales, though only one of three years was significant. Spearman rank correlations at the broadest scale also indicated density dependence in one year. Quantile regression analysis indicated that density significantly limited productivity values across the majority of spatial scales among all years. We found that the negative effect of density on productivity increased with the spatial scale of density. Quantile regression proved more effective at identifying density-dependent productivity in piping plovers. The discovery of density dependence raises concerns over current recovery goals, which call for the joint increase in both population and productivity. Increasing population without regard to density may reduce productivity in high-density areas. We recommend the monitoring of nest density, as well as protecting and managing areas as alternative nesting areas to provide relief for any high-density limitations that may arise.\nEnvironmental patterns influence the quality of species habitat. It is assumed that this pattern-process relationship has evolved in a way that maximizes individual fitness. We examined the relationship between landscape patterns and the fitness of piping plovers (Charadrius melodius) on the barrier islands of New York, USA. We monitored nesting pairs during the 2004 and 2005 breeding seasons and collected detailed information on environmental conditions. Our analysis focused on three important aspects of the patternprocess relationship: 1) the spatial scaling of plovers to their environment; 2) the relative importance of land cover, predation, management, and disturbance; and 3) the key environmental variables that influence total productivity. We found distinct spatial scale dependencies, with selection by plovers occurring within a narrow range that was unique to each environmental variable. Our findings suggest that management and predation variables influence plover productivity more than land cover and disturbance. Among individual variables, several management factors were important. Land management units, plover conservation educational signs, and symbolic string fencing erected around plover nesting areas all had important positive relationships with productivity. Other important variables with negative relationships with productivity included: density of people on ocean beaches, herring gull density, and weighted land cover. While we recognize the immense challenge, we believe that promoting natural barrier island dynamics is the most effective way to reduce negative impacts to piping plover breeding success and promote high quality habitat into the future.\nClimate change will result in sea-level rise and increased storminess that will inundate low-lying coastal areas. Species that inhabit barrier islands will be at high risk for decline and extinction. Despite these anticipated risks, few studies have examined the potential impact of climate change on rare coastal species. We assessed the threat of climate change to the breeding habitat of the federally threatened piping plover on the barrier islands of Suffolk County, New York. We determined the extent of habitat change under several prediction models, focusing on sea-level rise (SLR) and storminess over the next 100 years. We also examined the compounding effect of SLR on storm surge and the influence of coastal development. We found that static habitat response models reduced breeding habitat area under increasing SLR estimates. In dynamic models that allowed habitat to migrate upslope and inland, we found an increase in potential habitat. Storm type temporally influenced the amount of habitat available, with an increase of potential habitat resulting from category two hurricanes and a decrease of potential habitat from nor'easters and category three hurricanes. We observed that the synergistic effects of SLR and storms under the dynamic model resulted in a doubling of habitat impact over each of three time steps into the next 100 years. Additionally, coastal development also reduced habitat under both SLR and storminess. Management will need to be as dynamic as climate change and focus on protecting coastal processes that shift and create habitat. To assure that plover habitat is available on Suffolk County barrier islands in the future, we need to allow for natural overwash, promote habitat migration, and minimize human development."}, {"section_title": "Introduction", "text": "Understanding the relationship between an organism's density and nest productivity is a fundamental question in ecology , Vickery et al. 1992. This understanding is vital to species conservation because it is a common management strategy to increase reproductive output by improving habitat quality. Habitat quality is frequently measured in terms of population density, despite the fact that productivity is a direct measurement of species fitness in a given habitat Jones 2004, Johnson 2007). Density is a widely chosen subject of study because obtaining data is easy and relatively inexpensive and is often correlated with both habitat quality and productivity ). However, density does not always accurately reflect productivity and habitat quality (Van , Vickery et al. 1992. In fact, many studies have raised concerns over the use of density. These studies found a negative relationship with productivity, a condition that certainly negates the assumption that density reflects habitat quality . If a negative relationship exists between density and productivity, it begs the question: could habitat quality improvements lead to reduced productivity? It is critical to effective species conservation to reveal limitations on productivity produced by high density. Conservation and management of the federally threatened Atlantic coast population of the piping plover (Charadrius melodius) has been ongoing since its listing in 1986 (USFWS 1996). Factors leading to the initial federal listing include direct habitat loss, disturbances of breeding activity, and nest predation. These factors continue to threaten plovers (USFWS 1996). Current management actions focus on reducing humancaused disturbance and predation at plover nests. Recovery goals, which remain unmet, include both increasing population size and reproductive productivity (USFWS 1996). In New York, population size has doubled over the past 16 years and yet, productivity remains relatively low compared to other regions . The recovery goal of increased population without consideration of density assumes that density does not constrain productivity. Some recent studies support this assumption ; these studies use traditional correlation analysis, which focuses on the central tendency of the data and does not address the potential for a limiting factor relationship. Recent research suggests that quantile regression is a superior method for discerning what factors may define the upper limits of ecological processes . We examined the assumption that density does not constrain productivity across a range of density scales on the barrier islands of New York over three years. We also compared methodologies for identifying density dependence and limiting factors.\nProtecting and managing high quality habitat is vital to an organism's persistence, and is essential for endangered species recovery . Habitat is made up of the environmental resources and conditions in a given place and time that support an organism's survival and reproduction . High quality habitat reflects resource utilization that maximizes individual fitness which, combined with species abundance, feeds population level fitness − a vital component of species recovery . Atlantic coast piping plovers (Charadrius melodius) build scrape nests on sandy ocean beaches from North Carolina to Canada ). In the twenty-three years since federal listing as Threatened, population and productivity have steadily increased, but recovery goals remain unmet and the future is uncertain (USFWS 2008). Forecasted increases in coastal development, sea-level rise, and storm frequency make the understanding of plover habitat relationships imperative to future success of piping plover recovery , IPPC 2007. The determination and conservation of high quality habitat for piping plovers will contribute greatly to recovery by focusing management on resources with prime value. Modeling plover habitat quality depends upon the accurate assessment of the food and predation-refugia potential of any particular breeding site (MacArthur et al. 1966, Chalfoun and. These two resources are essential to avian fitness as they influence reproductive output in terms of both clutch size and fledgling success . For the piping plover, the quality of food availability and predation-refugia can be assessed by examining four aspects of their habitat: land cover, disturbance events, management actions, and predators , USFWS 1996. Land cover known to improve food availability includes moist sediment habitat and overwash areas, where the abundance of marine invertebrates is high; whereas wooded and densely vegetated areas tend to increase predator activity ). Disturbances include both positive impacts such as storm events outside of the breeding season that expand and enhance plover food resources and negative impacts such as human recreation activities that disrupt plover/chick foraging and breeding behavior. Management actions, such as symbolic string fencing or exclosure cages over nests may reduce human disturbance and/or reduce predator threats (USFWS Eddings et al. 1990. Both type and density of predators have been documented to negatively impact productivity ). Integral to the assessment of plover habitat quality is the identification of the spatial scales most relevant to total productivity. Land cover, disturbance events, protection activities, and predators are not uniformly distributed in time and space; thus, habitat quality varies over scales . Therefore, assessment of habitat quality requires a multi-scale analysis that encompasses the range of scales at which resources are exploited and experienced by the piping plover . The spatial and temporal scales at which a species experiences its environment is known as its ecological neighborhood . The use of continuous predictor variables observed over a variety of scales within the potential ecological neighborhood of a species is one way to incorporate an unbiased organism-centric assessment of habitat selection . The goal of this study was to construct a multi-scale habitat quality model that describes the components of high quality habitat for New York's piping plovers. Our specific objectives were as follows: 1) identify the important spatial scales of the specieshabitat relationships; 2) evaluate the independent and conditional contribution of land cover, protection/management, predator density, and disturbance events to total productivity; 3) identify the important individual components of high quality habitat.\nHabitat loss, the leading cause for species extinction, is expected to escalate under global climate change and cause the extinction of many plants and animals ). Extinction threat is particularly high among species with small populations that reside in habitats considered at high risk under climate change . Coastal systems −especially barrier islands of the eastern United States− are highly threatened from shifts in sea level and storms resulting from climate change . Sea-level rise (SLR) is generally considered the most significant consequence of climate change in coastal regions . Scientists estimate that melting glaciers and ice sheets will lead to an increase in sea levels between 0.18 m and 1.5 m over the next 100 years , IPCC 2007. The consequences of these rising sea levels on coastal systems include flooding, inundation of low-lying areas, increased erosion, and loss of coastal wetlands and habitats , IPCC 2007. For example, inundation from a 1.5 m rise in sea level is expected to result in the loss of six million hectares of coastal land along the eastern shores of the United States . Higher sea-surface temperatures in the tropics are expected to increase the frequency and intensity of hurricanes, nor'easters, and other storm events , IPPC 2007. These storms will have increased wind speeds, heavier precipitation, larger and more frequent tidal surges, and wind-driven waves, all of which will increase erosion and flooding along the Atlantic Coast . Negative impacts from SLR and storminess will be especially acute on barrier island systems where the process of island migration makes them naturally sensitive to changes in wind, waves, and sea level . Migration is the mechanism by which barrier islands typically absorb storm events by moving with them. During large storm events, ocean water overwash and wind-driven sands both work in concert to move island sediment from the ocean side to the leeside, moving entire islands landward. The concern among many scientists is that the rate of SLR and increased storminess under climate change will overwhelm and ultimately diminish the process of barrier island migration . Without migration, erosion and flooding rates are expected to increase substantially, leading to the inundation of many barrier islands . Aggravating this threat to migration dynamics is the prevalence of coastal development. Development increases the severity of climate-induced impacts by blocking and shifting the movement of wind, sand, and water , IPPC 2007. Scientists expect that coastal development will squeeze barrier island habitats between the ocean and hardened surfaces, such as walls, jetties, roads, and buildings . This restriction will likely rearrange the landscape patterns and change habitat connectivity . The density of development will influence the extent of restriction under different storm events and SLR estimates . Climate change-induced habitat loss threatens all barrier island organisms, including shorebirds. Worldwide, scientists estimate that 52% of shorebirds are currently in decline and will suffer further reduction from habitat loss brought about by climate change , Wetlands International 2006. The decline of the piping plover (Charadrius melodus), federally listed in 1986, is blamed primarily on habitat loss and degradation resulting from human development (USFWS 1996). Though conservation management over the past 20 years has lead to a steady increase in the population, recovery goals remain unmet may be threatened by climate change. The barrier island system of New York provides the majority of the state's breeding habitat for the plover (Seavey, unpublished data). Landscape elements on these islands that provide high quality plover habitat, such as sparsely vegetated ocean beaches with low human and predator density, are created and maintained by barrier island migration . However, if impacts from climate change, such as SLR and increased storminess, overwhelm barrier island dynamics, it may cause the loss of plover habitat . For example, episodic coastal flooding is a common event on New York's barrier islands, causing the failure of up to 4% of plover nests at Westhampton Island during the 1993-2003 period ). If climate change increases the frequency, duration, and intensity of floods nest failures will likely increase. The assessment of risk from climate change to the piping plovers of New York's barrier islands is critical so that recovery efforts can prepare for future environmental conditions. In this study, we examined changes to piping plover breeding habitat from SLR and increased storminess."}, {"section_title": "Methods", "text": "Our methods take a unique approach and they provide a fresh perspective to the examination of density dependence in piping plovers. This is due to our use of multiple spatial scales and quantile regression. The definition of density is spatially dependent and requires the careful matching of the measurement scale to the ecological process scale. To address this concern, we took an organism-centric approach that focuses on the scales at which plover interact with their environment . Specifically, we examined the relationship between density and productivity across multiple spatial scales that span a biologically meaningful range, such as nest territory defense . Previous studies of plover density dependence used traditional correlation analysis, which focuses on the center (typically, the mean) of the data distribution and often leads to an underestimation of the relationship between the independent and dependent variables (Thomson et al. 1996. To avoid this limitation, quantile regression was developed in order to explore the entire distribution of data. This is considered to be the method of choice when the objective of the analysis is to determine how one variable might limit another . Limiting factors, originating from Liebig's Law of the Minimum, describe a situation in which one variable, such as density, places a ceiling or limit on another variable, such as productivity. Quantile regression is a useful method for examining the constraining nature of density, while simultaneously allowing for other variables to influence productivity .\n\n"}, {"section_title": "Study Area", "text": "The study area spans approximately 130 km of shoreline on barrier islands and peninsulas off the southern coastline of Long Island, New York, USA (Fig. 1). Multiple inlets break the barrier system into six segments (from east to west): 1) Rockaway Peninsula, 2) Long Beach, 3) Jones Beach Island, 4) Fire Island National Seashore, 5) Westhampton Island, and 6) Southampton Beach. The current length and width of these islands range from 6-50 km and 0.1-2.6 km respectively. These island dimensions are not stable, as the entire island system is slowly migrating toward the northwest. In addition, frequent storm events create island profiles that are ephemeral and dynamic )."}, {"section_title": "Data Collection and Processing", "text": "We recorded all individual plover nest locations and associated productivity across the entire study area during the 2003-2005 breeding seasons, identified by roughly 30 plover stewards hired by land managers and conservation groups to monitor plovers along the entire barrier island system . These stewards were trained annually by state and federal plover biologists to conduct nest monitoring in a systematic and consistent manner (NYDEC 2005). Steward-based monitoring has occurred in the area since the 1980's and is estimated to find 95% of plover nests annually (Joe Jannsen, The Nature Conservancy, personal communication). With the aid of these stewards, we recorded breeding data with a global positioning system unit (GPS) after chicks had left the nest sites. With the nest location information, we derived nest density surfaces for each year using a kernel estimator procedure . In this procedure, we varied the bandwidths of the standard deviation in a Gaussian function over 11 spatial scales from 50-400 m. These scales represent the span of distances between nests identified by plover biologists in our study area and elsewhere (Wilcox 1959. We reported productivity as count data, e.g., 0-4 chicks fledged. We considered chicks as fledged when they reached 25-days old or were observed flying. Data included only first nest attempts to avoid correlation among first and second nest sites. We created two data sets from the productivity data to address different needs in our analysis. First, we used the original count data as reported. Second, we used an inverse distance weighting interpolation of the count data to create a continuous productivity surface (or map) (ESRI 1999(ESRI -2006. Both density and productivity data were stored and managed in the Environmental System Research Institute's ArcGIS 9.0 geographical information system. Spatial data maintained a grain size of 25 m 2 (5 m cell size) over the full extent of the 93,075 ha barrier island landscape. Using the nest density surface and the two nest productivity data sets, we created two separate data sets for the analyses. The first data set (nest data) contained the original count productivity data and the continuous nest density data for each of the eleven density surfaces (corresponding to different spatial scales) measured at the actual nest locations each year. The second data set (random data) contained the continuous productivity surface data and continuous nest density data for each of the eleven density surfaces (corresponding to different spatial scales) measured at random locations within plover nesting habitat each year. We delineated and digitized nesting habitat through a combination of natural color aerial photography (April 2004, 0.3m spatial resolution) and field data. We obtained the aerial images from New York State's Office of Cyber we defined nesting habitat as the sandy substrate area between the April 2004 high water line and the back-beach line. We delineated the back-beach line based on the presence of dense vegetation, steeply eroded banks, or man-made structures. Within the breeding habitat polygon, we sampled the nest productivity and the eleven nest density surfaces at 500 randomly selected points, located a minimum of 200 m from any other random point. The distance between sample points reflected a tradeoff between our desire to simultaneously minimize spatial autocorrelation and maximize sample size.\nWe sampled plover and environmental data across the entire 93,075 ha barrier island system from April through August 2004 and 2005 . All data were stored as grids (5 m cell size) and managed in the Environmental System Research Institute's ArcGIS 9.0 geographical information system. Our response variable for measuring habitat quality was total productivity, which we defined as the product of nest density and nest productivity (fledglings per nest) . In our data, total productivity represented the estimated number of fledglings produced in a neighborhood centered on each cell. We defined the neighborhood by the kernel function used to estimate nest density (see below). This mathematically derived measurement of fitness was calculated from estimated plover nest density and productivity grids created from 2004 and 2005 field data as follows. We obtained nest locations and associated information directly from plover stewards, who monitor plovers annually throughout the study area. These stewards, who are part of an ongoing program initiated in the 1980's, are trained each year by state and federal plover biologists to conduct nest monitoring in a systematic and consistent manner. The plover stewards are estimated to find 95% of plover nests annually (Joe Jannsen, The Nature Conservancy, personal communication). Based on the nest location information, we derived a nest density grid for each year using a kernel estimator procedure . We used a kernel approach because it provided a density function that incorporated a plover-centric spatial scale to create a continuous data layer across the landscape extent. We used a Gaussian kernel with a standard deviation (bandwidth) of 400 m, representing nesting territory size identified in a nine year sample of several beaches within our study area . To calculate productivity, first we obtained the original productivity data for each nest in each year as recorded by the plover stewards. We recorded productivity as a count, ranging between 0-4 chicks fledged per nest. Chicks were considered fledged when they reached 25-days old or could fly. Only first nest attempts were included in the data to avoid autocorrelation among first and second nest sites. We suspect that the removal of first nests may bias our data against representing nests lost to flood events, which are more frequent earlier in the breeding season. Next, we used inverse distance weighting (IDW) interpolation (ESRI 1999(ESRI -2006 with a power of 2 and a variable search radius of 12 points to create a continuous productivity surface (or grid). Lastly, we multiplied the nest density grid by the continuous productivity grid to create the total productivity grid. For our subsequent use of this data in generalized linear models, we rounded the final values to the nearest integer to maintain more realistic count values in the final grid. We divided the environmental predictors into four categories: 1) land cover, 2) disturbance, 3) management/protection, and 4) predation (Table 1). We selected environmental variables based on a review of the published and grey literature, many of which describe New York State plover populations , Cross 1990, NYDEC 2004. We created density surfaces for the majority of the environmental variables using a kernel procedure similar to that described above, but with 11 different bandwidths (h) representing a range of biologically-relevant spatial scales for each variable (Table 1). We divided the eleven bandwidths into equal increments from the minimum to maximum h value. For the h values over 1,600 m, we used a 25 m grid instead of a 5 m grid to ease processing. Building multi-scaled representations of each variable allowed us to identify the spatial scale(s) that most influenced total productivity. We derived several variable grids from other data sets. We used a land cover map containing 20 classes to create a weighted land cover, development, overwash, and beach width grids (Table 2). We created the land cover map from . We surveyed predators using two methods. First, we conducted predator track counts along transects placed perpendicular to the shoreline every 2 km throughout the entire study area, each extending across plover breeding habitat from the high water line inland to dense vegetation or development. We surveyed the same transects each year, twice per season, in a random order with start times before 9 a.m. to minimize track loss. We used a global positioning system to record predator tracks that crossed transects by species and ghost crab burrows within 1 m of the transect line. If a single track crossed a line several times, we counted it once. We transformed transect data by species into surfaces using IDW . Second, we conducted point count surveys to obtain avian activity predator information . We searched and recorded all avian predators in a 100 m radius circle for a ten-minute period at the inland end of every transect before we conducted the track survey. We again used IDW to convert point count data into continuous data surfaces."}, {"section_title": "Data Analysis", "text": "Using maximum likelihood estimation, we conducted ordinal logistic regression analysis (ologit) with the nest data, and evaluated model significance with Wald tests and model fit with Receiver Operator Curves (expressed as Area under the Curve or AUC below). We created an ologit model for each of the eleven kernel bandwidths in each year: where z is the log odds of the dependent variable. We conducted the ologit and all subsequent analysis in R with the packages Design and Quantreg (R Core Development Team 2005). To compare our results to previous research ), we calculated a Spearman rank correlation with the nest data. We used the 400 m kernel bandwidth as the density scale to calculate two-tailed, Spearman rank coefficient for each of the three years. This bandwidth showed the highest odds ratio in the ologit models and provided a spatial scale similar to . To explore the sensitivity of Spearman rank analysis to sample size, we generated ten random samples of the 2003 data with sample sizes of 49, which was the sample size used by , and repeated the rank test. Our first step in quantile regression modeling was to evaluate phenomenologically four data distribution functions to find the best fit for the random data (Table 1). For parsimony's sake, the first two functions that we examined were polynomials: linear and second order. These two functions were appealing because they reflect a constant increasing influence of density on productivity. Scientists have found evidence of linear density dependence in ecological systems, such as the influence of biomass on plant distributions . The next two functions we considered were exponential functions that reflect a more extreme relationship between density and productivity. We examined the negative exponential function because it has been used in several studies to define consistent population growth in proportion to another variable per unit time . Finally, we considered the Ricker function, because of previous success in using it to modeling density dependence in reproduction . The Ricker function was also very appealing because it starts at zero, increases to a peak, and then decreases gradually back to zero, which matched the upper limits of our data scatter plots. We linearized the exponential functions by taking the natural logarithm of both sides of the equation. We added a constant of 1 to productivity data before taking the logarithms to account for nests with no fledglings. We dropped zero density values, as our focus was on points with nest density above zero. We estimated parameters for the 10-100 th quantiles, though we focused on the 50 th -100 th as these represent the central and upper bound of the data. We returned estimates to their original nonlinear form if needed by exponentiation and subtracting one from the productivity data. We evaluated model fits by comparing Akaike information criterion (AIC) values for each distribution models run with 2003 data at the 80 th quantile and 120m kernel bandwidth. Using the \"best\" distribution function, we evaluated 33 models through the combination of three years and eleven kernel bandwidths in the same manner as described above. We plotted all quantile model fits and examined the similarity in slope parameters (betas) among the 50 th to 100 th quantiles. To examine where density limits productivity, we selected the highest quantiles that had significant slope estimates with a 95% confidence interval that excluded zero ).\nWe sampled the total productivity and environmental predictor grids at random locations within plover nesting habitat each year. We delineated plover nesting habitat as a distinct class in the land cover map. For our purpose, we defined nesting habitat as the sandy substrate area between the April 2004 high water line and the back-beach boundary line. The back beach line was defined as the inland boundary of potential plover nesting habitat, which we observed in the field as dense vegetation, steeply eroded banks, or man-made structures. Within the breeding habitat polygon, we sampled the yearly total productivity grid and the environmental predictor grids at 500 randomly selected points, located a minimum of 200 m from any other random point. The distance between sample points reflected a tradeoff between our desire to simultaneously minimize spatial autocorrelation (see below) and maximize sample size. We analyzed the relationships between the environmental predictors and total productivity using generalized linear models (GLM) and regression trees (RT) in R with the packages ncf, rpart, stat, mass, and spdep (R Core Development Team 2005). Prior to all analyses, we dropped all insufficiently sampled environmental variables that were zero or missing at more than 95% of sampled points. Since our response variable represented a count (i.e., the total number of young produced in the neighborhood of the focal cell), we used a Poisson error distribution and log-link function in all GLM models . We evaluated overdispersion throughout the GLM model-building process by computing the ratio of the residual deviance with the associated degrees of freedom and found that estimates were close to 1 and therefore not overdispersed . To minimize the potential for multicolinearity, we examined pairwise Pearson's productmoment correlations between all predictor variables. For cases where r > 0.6, we included only the variable exhibiting the highest univariate explained variance in the model. To examine scaling relationships for each of the spatially-scaled environmental predictors (Table 1), we fit a univariate GLM at each spatial scale and evaluated the model's goodness-of-fit based on the corrected Akaike's information criterion (AICc) . Note, for purposes of model comparison, AICc in this case is proportional to the negative-log likelihood, since the number of parameters is the same for all models. We identified all models with AICc values within two units of the minimum; however, we chose the scale with the minimum AICc for all subsequent modeling. To examine the independent (marginal) and conditional explanatory power of each environmental variable group (land cover, protection/management, predator activity, and disturbance events), we developed a separate GLM for each group in each year. We examined the independent explanatory power of each variable group directly by comparing the marginal fit of each group GLM. We examined the conditional explanatory power of each environmental variable group by comparing models built with all four groups against three-group models that systematically excluded one group at a time. We used the deviance explained to quantify the marginal and conditional contributions of each group in explaining the variance of plover productivity. To build a single comprehensive habitat model, we developed both annual and pooled GLMs starting with a global model that included all the environmental variables and applying manual backwards variable selection to find the minimal adequate model (following . We tested model selection stability using automated AICbased forwards and backwards stepwise variable selection . We employed inter-annual cross-validation to assess honest error of the annual models. Specifically, we assessed the performance by regressing the model-averaged predicted values of one year on the observed values of the other year. The resulting R 2 and Fstatistic were used to measure fit. After determining that the productivity values between the two years were not significantly different (t = 1.34, df = 988.46, P = 0.18), we examined a pooled GLM. We examined the stability of the pooled model through comparison to a regression tree (RT) model (Breiman et al. 1984, De'ath and. Regression trees are known to detect non-linear and complex relationships between predictor and response variables (De'ath and Fabricius 2000). Because we do not assume a data distribution in RT, we used continuous total productivity values for our response variable. We grew the RT to the optimal tree size using the 1-S.E. rule based on 10-fold cross validation, repeated 50 times (Breiman et al. 1984, De'ath and. Regression trees were grown automatically with the minimum splitting criteria at a node set to twenty and the minimum terminal node size set to seven. We derived a pvalue for the final tree using a Monte Carlo resampling procedure based on 1,000 permutations of a tree with the same number of leaves as the best model, and comparing the R 2 of our tree to the permutation distribution. We assessed variable importance of all predictor variables, following . Lastly, we examined and discovered spatial autocorrelation among nest locations and GLM model residuals using Moran's I correlograms . We filtered spatial autocorrelation out of the GLM models using the method of Principal Coordinate of Neighbor Matrices (PCNM), which identifies eigenvectors that explain the spatial variance . PCNM eigenvector creation relies on a spatial weighting matrix, which defines the neighborhood of the data points. We selected the upper bound of this neighborhood (600 m ) through testing several distances and identifying the one that optimized model performance as measured by AICc values . We applied partial regressions to isolate the contributions of the environmental variables from the spatial eigenvectors in order to isolate the explanatory power of the environmental variables that was not due to spatial autocorrelation (referred to as \"spatially adjusted R 2\" in our results)."}, {"section_title": "Results", "text": "During the 2003-2005 plover breeding seasons, we recorded 714 nests: 216 in 2003, 269 in 2004, and 236 in 2005. Trends in productivity and density values over the three years of our study were similar among nest and random data. Average productivity was close to 1 (± 0.3) for each of the three year and for both data sets. Density values among nest data hovered around 1.3e-4 (±0.00001) and 4.6e-5 (± 0.000002) for the random data across all years. Ordinal logistic regression − Ologit models from all three years and kernel bandwidths indicated a weak negative odds ratio, suggesting that as nest density increased there was a decreasing probability of observing higher productivity (Fig. 2). The negative odds ratio increased as kernel bandwidths increased, indicating that density dependence was more pronounced at broader spatial scales. In addition, the odds ratios weakened over time from 2003 to 2005. The significance of the overall results were largely due to the patterns in 2003, which was the only year with significant Wald test results for every kernel bandwidth (P < 0.05), although the model fits were poor (AUC < 0.6). Spearman rank correlation − Similar to ologit models, the Spearman rank correlations indicated significant density dependence in 2003 (r = −0.17, P = 0.01, n = 227), but not 2004 (r = −0.1, P =0.11, n =250) or 2005 (r = −0.008, P = 0.9, n = 237). Our sample size sensitivity analysis identified one significant test result out of the ten tests run. Quantile regression − Model selection criteria indicated that the data provided roughly equal support for the negative exponential and Ricker models (Table 1). However, we selected the Ricker model for our quantile regression analysis based on the zero y-intercept and its common application in studies of density dependence. Using the Ricker function, the 50 th through the 90 th quantile fits showed variation in the overall negative relationship between density and productivity among all three years of data, as seen by the lack of parallels among the model estimates ( Fig. 3). Further, most models shared a pattern in which productivity increased along with density until a density threshold (around 0.5 nests/ha among most bandwidths and years) was reached, at which point productivity started to decline. The annual magnitude of response showed much variation from the 50 th to the 70 th quantiles, which then lessened around the 76 th quantile, settling in low negative values (Fig 4). We did not identify limiting quantiles for all kernel bandwidths; many of the narrow bandwidths and 2005 models were not significant ( Fig. 5). However, 23 out of 33 models had a quantile that met our criteria. The highest limiting quantiles for each kernel bandwidth were all above the 70 th quantile. The limiting quantiles increased with broadening kernel bandwidth in the 2003 data and remained relatively consistent in 2004 and 2005. We found that the 95% confidence interval of the slope value associated with each significant quantile increased with rising bandwidth and overlapped among years ( Fig. 5).\nOur GLM habitat model used elevation and least cost distance to describe 79% of the variance in plover breeding habitat occurrence and had a significant model likelihood ratio (Likelihood ratio chi-square = 1797.6, p<0.001). In development of the model, we observed that elevation had a curvilinear relationship with habitat and so we accounted for this in the model by adding a squared term in the GLM equation. We did not observe overdispersion in the 0.48 ratio of residual scaled deviance to residual degrees of freedom, as the ratio is well below 1 . The final GLM had a C index of 0.96, indicating strong predictive performance . A confusion matrix of model predictions showed a commission error of 11% and omission error of 6%. Our classification tree model built on the same sample data resulted in a C index of 0.91 and commission error of 10% and omission error of 8%, based on the least cost distance variable alone. We selected the GLM for further assessment due to a higher C index and slightly lower omission error than the classification tree results. We validated our GLM via bootstrapping, which showed a high correlation between predicted probabilities and observed responses (Somer's D xy rank Correlation= 0.95). As expected from our model, static habitat response models showed that piping plover breeding habitat area steadily declined from \"none\" to \"high\" SLR, with a 40% loss to \"higher\" SLR. (Fig. 2). With our static habitat response results, we found that some of the 759 nests identified during the 2003-2005 seasons were lost. In contrast to the static response, the dynamic habitat models showed that potential habitat actually grew with increasing SLR estimates (Fig. 2). Comparing the static to dynamic models with \"higher\" SLR, there is a 48% reduction of habitat under the static response. Moveover, we observed the largest (12%) habitat gain (relative to no SLR) in the \"higher\" SLR scenario. In the dynamic response, habitat became a larger percentage of the study area with SLR increase. With no SLR, 26% of the land area was habitat, which increased to 32-35% from \"low\" to \"high\" SLR. With \"higher\" SLR, potential plover habitat covered 65% of the study area, though the total study area remaining was less than half of that found in no SLR. About 19 percent (7,099 hectares) of the study area was developed in 2004. Medium intensity development comprised 10% of the developed area compared to 7% for low and 2% for high intensity. The inclusion of development reduced the habitat expansion observed in the dynamic habitat SLR models (Fig. 3). Though development reduces potential habitat across all intensity levels, losses were greatest (12% from no SLR) under \"higher\" SLR in combination with the \"all\" development intensity level, followed by low, medium, and high. Though medium intensity development covered a larger percentage of total island area compared to low intensity, low intensity was more frequently adjacent to habitat. Because of this adjacency, as habitat moved inland with SLR, low intensity development resulted blocked more habitat formation compared to medium. We observed that this influence of low intensity was less under \"higher\" SLR because of fewer intersections of potential habitat with low intensity occurred. Among the storm models, we found that storm type, SLR, time, and development influenced the amount of habitat created (Fig. 4 and 5). The largest amount of potential habitat resulted from category two hurricanes surges, followed by nor'easters and category three hurricanes. Only category two hurricanes produced more (6%) habitat area under no SLR compared to no SLR/no storms and category three lost 40% of the original habitat under no SLR/no storms (Fig. 4). This increase is expected as maximum storm surge from category two hurricanes is 2.4 m and category three is 3.7 m , whereas the study area's elevation is typically between 0.3-3.3 m (mean=1.8, stdev=1.5). Clearly, category three hurricane surges leave very areas with elevation values into which habitat could form. These results show that the combination of storms, SLR and development will likely lead to a loss of habitat, giving up any gains realized with SLR alone. We observed a reduction a reduction of habitat from no SLR to \"high\" SLR in each storm category (Fig. 4). This reduction of habitat loss was fairly consistent over one time step (100 years) 1,138 ha, 1,145 ha, and 1,675 ha from nor'easters to category three hurricanes respectively. Among the multiple timeframes of SLR, we observed a synergistic effect between SLR and storms, depicted in the increasing rate of habitat loss as SLR increased over time among all three storms (Fig. 5). The rate of change under category three hurricanes alone was exponential, almost doubling with each SLR time step from 262 ha (none to \"high\" SLR-20 years) to 508 ha (\"high\" SLR-20 years to 50 years) to 903 ha (\"high\" SLR-50 years to 80 years). Doubling rates held for category two storms as well moving from 173 ha to 350 ha to 615 ha and nor'easters: 205ha to 347 ha to 593 ha. Under the \"high\" SLR, Category three hurricanes lost the most (30%) habitat area over time from 2020 to 2080; nor'easters and category two storms lost between 11-12% of habitat area. Compared to habitat area under no SLR and storms, our models predicted that with \"high\" SLR over the next 100 years, nor'easter storms reduced habitat by 15%, category two hurricanes by 6% , and category three hurricanes by 57%. Note that the inclusion of development in the storm models added to the reduction in habitat. \"High\" SLR and category two hurricanes showed an average reduction of 7% in habitat due to development (Fig. 5)."}, {"section_title": "Discussion", "text": "Piping plover nest density negatively affected high levels of productivity, ultimately limiting breeding productivity among piper plovers on the barrier islands of New York. This finding was supported in part by the central tendency analysis, but more so by the quantile regression results. Our ologit models indicated a weak negative correlation between density and productivity across all three years of our study, though the relationship was statistically significant in only one of the three years. In the quantile regression analysis, we found significant negative relationships between density and productivity over all years. Specifically, our quantile models showed that at lower density, productivity increased in step to a threshold value, after which productivity was limited. This pattern indicated that nest density acted to constrain the upper bounds of breeding output. Thomson et al. (1996) deemed this limiting factor relationship as \"pervasive\" in ecological systems. While the mechanism that creates this limiting relationship of density upon productivity is not yet definitively known, our study and previous work shed light on the process. First, our scale analysis suggests that the mechanism is operating at the upper end of our plover neighborhood scale and perhaps beyond. Our work shows that crowding in large neighborhoods leads to greater reductions in productivity compared to smaller neighborhoods. The literature suggests that this may result from resource limitation and/or behavior changes at high density , because the distance for plovers to travel to obtain resources or find a mate increases in larger neighborhoods. However, we suspect that predators have a greater impact under high density as they may more easily locate their prey in large, crowded neighborhoods. Ecologists have observed increased predation under high density in many species . , provides evidence for this predation mechanism in piping plovers when he discovered that predation − not limited food − was the cause of nest failure in areas of high nest density. Future work should explore this and other possible mechanisms of density dependence. Our assertion that nest density limits plover productivity contradicts previous research that found no relationship between density and productivity . Though direct comparison among research is challenging due to differences in methodology and research scale, these previous studies focused on correlating nest density with productivity based on simple Spearman rank correlations. In our study, when we used Spearman rank, we noted a weak relationship between nest density and productivity with variable strength in the relationship over time. Though he ultimately concluded no relationship,  also found that high density was correlated with low productivity in one of three years of research. Interestingly, while  was studying plovers at a similar spatial (600 m) and temporal (2001)(2002)(2003) scale at a site within our study area, he found this significant result in 2002 (n=61), but not in 2001 (n=58) or 2003 (n=49). Cohen's 2003 results contradict our findings and we suspect that our sample size of 227 nest attempts gave us the statistical power to find the relationship. We believe that Cohen's particular study site was likely experiencing density dependent-limitations because his study area was, according to our data, one of the densest areas in 2003. Further, our quantile regression analysis suggests that contradictory test results between traditional versus quantile methods were due to an inconsistent relationship between density and productivity below the median of the data distribution. The position of this inconsistency in the data would preclude the ability of tradition data analysis to detect a significant and clear relationship. Our results lead support to the growing evidence that quantile regression analysis is more effective than central tendency methods at the detection of the limiting nature of one variable upon another . Our detection of a limiting relationship between density and productivity raises concern over current piping plover conservation goals. Current recovery goals call for the joint increase in plover population size and productivity (USFWS 1996). Specifically, the goals for the New York Region are to increase and maintain 575 pairs and 1.5 chicks per nest for at least five consecutive years (USFWS 1996). While population growth in New York over the past 16 years has doubled the plover population (422 pairs as of 2006), nest-level productivity (1.29 chicks per pair in 2006) remains well below recovery goals . The rapid increase in population, coupled with low productivity in the light of growing concern over the spatial constraints of New York plovers from habitat fragmentation, human recreation, and development, suggests that productivity may be currently limited in some areas due to high density (Cohen et al. 2009, Hecht and Finally, our results also imply that in order to work towards the recovery goal of increased productivity, we should keep plover density below the limiting level. Unfortunately, pinpointing the exact density level is daunting because it varies over both the spatial scale of density and breeding season. This variance is not surprising as many ecological systems lack equilibrium  or shift variably from one domain state to another as described for barrier islands . In light of dynamics of the ecosystem in which plovers exist, we suggest broadening the current management focus on active nesting areas to incorporate potential nesting areas that are not currently in use. Plovers are known to readily take advantage of newly created (natural and artificial) sandy beaches . Protecting potential nesting areas through limited recreation use, development, and increasing management activities , Chapter 2) may help diffuse the pressure at high-density sites. In addition, providing potential areas requires the protection of island dynamics, such as overwash, which is the mechanism by which new nesting areas are created. Through the direct protection of island dynamics, we can promote lower plover nest densities that will bring about high levels of productivity and recovery.       \n\nThe consensus of climate scientists is that coastal areas are among the world's most vulnerable landscapes to impacts related to climate change ). However, specific predictions as to how landscapes and organisms will respond are uncertain due to assumptions and limitations in current methodology, including those used in our study. One assumption we made was that our particular estimates of storm impact and SLR in our models represent future conditions. These estimates have already been updated since we conducted our analysis and we expect that revisions will continue to be made (Richardson et al. 2009). One limitation of our work was the simplistic manner in which we modeled barrier island response to climate changes. For example, a dynamic landform model would incorporate increased erosion that is expected to flatten island profiles Richman 2001, Cooper and. Because of this omission, our methods probably overestimate land elevations and underestimate habitat loss. Our lack of a dynamic landform also limits our ability to model storm, which constrains our models to reflect temporary habitat loss with in a breeding season. We fully recognize that storms have lasting effects on plover habitat and island landform that needs to be more fully assessed in future research. In addition, our models did not account for beach stabilization structures, such as jetties and groins, currently in place or likely to be put into place over the next 100 years . Beach stabilization structures are likely to increase along with the expected rise in human development in the region (PAD 2008). These assumptions and limitations of our work call for the heuristic use of our results − to compare predicted impacts of our scenarios and models relative to each other. Our models should not be used as absolute predictions about the future of piping plover habitat in New York. Our study resulted in several key findings. First, we found that the manner in which barrier island habitats respond to climate change makes a large difference in predictions about future habitat. Dynamic habitat movement allows for the possibility of more plover habitat with rising sea levels in Suffolk County, New York. This increase results from the specific topography of the barrier islands in the region. However, the ability of plover habitat in Suffolk County to respond in a dynamic manner is unclear. Sediment limitation  in the area suggests that a dynamic response may not be possible. However, a dynamic habitat response is also dependent on many other factors, such as development and landform dynamics . Additional research into these factors and others is needed to clarify the response of both habitat and landform in Suffolk County and elsewhere. Second, we found that SLR and coastal storms individually influenced the predicted amount of potential plover habitat over the next 100 years. We found that with a dynamic response a 1.5m increase in sea level alone, habitat could increase by 8-12% over the next 100 years, depending on the SLR. Future revised sea-level estimates will need to be reevaluated, as the specific topography of each barrier island influences the net potential plover habitat. Each storm type also had a unique influence on plover habitat, ranging from a small increase (category two hurricanes) to a large decrease (category three hurricanes) of potential habitat. We are not surprised that the lost of habitat under nor'easters was greater than category two hurricanes, as nor'easters can last over multiple tidal periods and therefore are more likely to intersect a high tide, which increases storm surge . Though, little is known about the future frequency of each storm type, climate scientists believe storms of all categories will increase (NYPCC 2009. Third, we found a synergistic effect of SLR and storminess, resulting in an even greater loss of habitat than predicted from the independent effects alone. A synergistic relationship is not surprising, as most climate scientists predict positive feedbacks among many abiotic and biotic processes in responses to climate change (IPCC 2007). Yet our results highlight the importance of SLR/storm synergy for plover habitat over the next 100 years. The effect of time in the creating synergism between SLR and storminess raises two important issues. First, the degree to which habitat response matches the timeframe of climate changes is likely to have a large impact on the ability of the landscape to respond. For example, if habitat migration can keep pace with SLR, a dynamic response is possible. However, if migration cannot keep the pace, a static response is more likely. As our results show, this could mean a substantial difference in the amounts of plover habitat remaining as the climate changes. Since New York's barrier islands system has maintained a dynamic but relatively consistent landscape over historic time, we can say that until now habitat/landform response have been able to keep pace with SLR. The understanding that habitats have migrated upslope over the last 8,000 years on the barrier islands of New York is what leads us to believe that plover habitat will continue to move during periods of increased SLR (McCormick et al. 1984). However, the past is not always the best predictor of the future. Current estimates move climate variables outside of their known historic range of variation (IPCC 2007), which increases the risk that the current barrier island dynamics will not be able to keep the pace of change. The quick rate of climate change is already showing evidence of outpacing ecosystem dynamics in the documented loss of salt marshes, coral reefs, and dramatic increase in beach erosion . Time is also of the essence when it comes to conservation, as management actions also need to keep pace with climate change. As our results suggest, rising sea-level and increased storm activity may work in concert to synergistically reduce habitat at a quickening pace over time. Adaption to climate change is going to be required and any delay will only make mitigating for habitat loss increasingly difficult (IPCC 2007). Finally, we found that development in concert with climate change had a large influence on potential plover habitat. Our results showed that the addition of development reduced plover habitat under all SLR and storminess scenarios. This is not surprising, as other studies have found that development impedes the overwash process and island migration . Recent research has shown that preventing the overwash process may make barrier islands more vulnerable to changes induced from SLR and storms . We assert that the future of plover habitat under climate change will be dictated, in large part, by how development is managed. Management of development in the face of climate change is likely to occur in three ways: protection (e.g., beach nourishment), adaptation (e.g., flood proofing buildings), and retreat ). While we recognize that all three of these options are viable and necessary, we advocate retreat from barrier islands to maximize the ecological processes that promote plover habitat creation. Specifically, protecting the migration process of barrier islands will promote and protect islands by allowing them to maintain elevations above sea-level . Retreat calls for the removal of buildings and/or the creation of a set back zone, which prohibits development within a certain distance of the shoreline. In Suffolk County, it would probably mean moving a number of existing houses back, considering many properties are as close as 50 m or less from the high water line (Seavey, personal observation). This is a challenging and expensive management option, but one that is gaining attention in the literature and plausibility through public education and proactive land use planning ). The expense of retreat in the region is estimated to be less than the cost of protecting development from rising waters and larger coastal storms . Set back regulations have also been recommended to mitigate against habitat loss for sea turtles . Similarly, to work conducted by  set back zones distances can be informed by organism habitat needs, future research should assess the amount of retreat needed to reduce plover habitat loss in Suffolk County and elsewhere. Though our study focuses on habitat loss, we expect other impacts to plover habitat because of SLR and increased storminess. Increased flooding, especially during the egg stage of plover breeding, is likely to increase nest failure. We also suspect that the concentration of suitable habitat caused by land loss is likely to lead to several negative impacts. The spatial concentration of plover habitat is a concern especially in New York, where recreation use, development, beach renourishment, and habitat fragmentation have all restricted plover habitat (Cohen et al. 2009, Hecht and. As a result of restricted habitat availability, plover nesting density may increase which may lead to decreased productivity  Habitat loss was the primary reason for piping plover decline and federal listing (USWFS 1996). Additional losses under climate change will likely increase extinction risk. To avoid the potential loss of plover habitat in Suffolk County and elsewhere, management actions must break from the traditional approach of protecting known nesting habitat. Today's plover nesting habitat is unlikely to be suitable or even exist tomorrow. Management will need to be as dynamic as climate change itself. This calls for a management focus on the very processes that will work to maintain and create plover habitat over the next 100 years and beyond. To assure that plover habitat is available on barrier islands in the future, overwash and habitat migration needs to be promoted and protected.     "}, {"section_title": "Study area", "text": "The study area encompasses approximately 130 km of shoreline on the barrier islands and peninsulas off the southern coastline of Long Island, New York, USA (Fig.1). Multiple inlets break this barrier system into six segments (from west to east): 1) Rockaway Peninsula, 2) Long Beach, 3) Jones Beach Island, 4) Fire Island National Seashore, 5) Westhampton Island, and 6) Southampton Beach. The current length and width of these islands ranges from 6 km to 50 km and 0.1 km to 2.6 km, respectively. Island dimensions are not stable. The entire island system is slowly migrating in a northwest direction and is subject to frequent storm events creating an island profile that is ephemeral and dynamic ).\nOur study area was the barrier island system of Suffolk County, which incorporates 93 km of barrier island and peninsula shoreline along the southern coast of Long Island, New York, USA (Fig.1). Multiple inlets break this barrier system into four segments (from west to east): Jones Beach Island, Fire Island, Westhampton Island, and Southampton Beach. Current rough dimensions of the smallest island are 6 km by 0.1 km, and the largest is 50 km by 2.6 km. These dimensions are not stable, as island profiles are shifting and in fact, the entire system is slowly moving the entire system in a northwest direction . This barrier island ecosystem is considered a sand-limited system and has historically been subject to frequent erosion activity due to its low topography and sandy soils . Human development within the system is highly variables from non-residential, large public recreation facilities along Jones Beach and Fire Island to summer homes along Westhampton Island and Southampton Beach."}, {"section_title": "2.4Results", "text": ""}, {"section_title": "Spatial Scaling Relationships", "text": "With one exception, the spatially-scaled environmental variables showed strong and narrow scale dependency over the scales we examined (Fig. 2). The exception, offroad vehicle (ORV) management signs, had multiple scales within two AICc units of the best model (Fig 2c). Consistently over both years, most (10 of 13) variables showed a steady decrease in AICc values as the spatial scale increased ( Fig. 2a), suggesting that the explanatory power was greatest at the coarsest scale examined. Exceptions to this pattern included overwash, ORV signs, and edge density ( Fig. 2b-d). Specifically, overwash appeared to have a sharp threshold at 30 m, wherein the explanatory power decreased abruptly at coarser scales. ORV signs also revealed a threshold-like relationship, with explanatory power decreasing steadily at scales greater than 157 m. Edge density showed a distinct unimodal distribution, with the explanatory power greatest at the 50 m scale and decreasing at finer or coarser scales.\nOur findings suggest that habitat selection in piping plovers is scale dependent. All but one of our environmental variables displayed overwhelming support for a single spatial scale of habitat selection. The one exception, ORV management signs, showed a slightly wider range of scale dependency reflecting a uniformity of positive impact from reducing ORVs within 206 m of nests. Our confirmation of scale dependency is supported by many studies that document organisms interacting with their environment at specific scales . Our findings also suggest that over the spatial scales we examined, plovers scale each environmental variable uniquely. Although each of our environmental variables was uniquely spatially scaled (based on the relevant biological criteria), many could have overlapped in the selected scale(s) and yet failed to do so. This lack of overlap is likely the result of the unique ecological neighborhood (sensu  of each biotic and abiotic variable comprising plover habitat. Our results support the contention that multiple scales, defined by the organism or ecological process under consideration, are critical to discerning ecological relationships . Further, our findings highlight the importance of examining the individual scaling relationship for each variable, as opposed to the common practice of gathering data at only one or a few scales. Finally, our findings also suggests that future work explore broader spatial scales compared to ours as many of our variables were found to best explain total productivity at the largest scale that we examined. Though we based our scales at what the literature suggested were the largest estimates for each variable, some may influence total productivity at broader scales."}, {"section_title": "Comparisons Among Groups of Environmental Predictors", "text": "After accounting for spatial autocorrelations, the management and predator group had similar marginal explanatory power in both years (Table 3). After accounting for spatial autocorrelations, the management group had the greatest conditional explanatory power (Table 4). More specifically, the percent deviance explained when the management group was dropped from the full model was consistently the lowest, followed by the predation group in both years."}, {"section_title": "Habitat Quality Models", "text": "Manual and automated variable selection methods produced similar final models. In all cases, however, the automated selection methods resulted in an additional variable or two in the final model. In the spirit of parsimony, and because of the overall consistency of the results, we present only the manual backwards selection results. The GLM habitat quality models explained 51-61% of the variability in total productivity (Table 5). The percent variance explained by environmental variables alone was 36% in 2004, 42% in 2005 and 49% in the pooled model; the spatial eigenvectors explained 15% in 2004, 14% in 2005, and 12% in the pooled model. The number of significant variables varied from 9 in 2004, 6 in 2005, and 9 in the pooled model. It should be noted that gull colony density showed a significant positive coefficient with plover productivity, which was unexpected. Despite the relatively strong performance of the year-specific models, they were not very robust in explaining total productivity in the opposing year. Specifically, the 2004 model predicted only 5% of the 2005 data, despite this being highly significant (F-statistic=27.67; P = 2.15e-07) and, similarly, the 2005 model explained only 7% of the 2004 data despite also being highly significant (F-statistic=40.02; P =5.62e-10). The RT was comprised of six splits and seven terminal nodes that collectively explained 56% of the variance in plover productivity ( Fig. 3 and Table 5). There was a highly significant difference between our tree's R 2 and the R 2 distribution from random trees derived in Monte Carlo resampling (p < 0.001). Three terminal nodes had total productivity values over 0.08 fledglings per hectare, resulting from three possible pathways (Fig. 3) Despite the relatively poor validation of year-specific models, there was generally strong agreement for certain variables among the habitat models. Specifically, weighted land cover, human density, and management units were significant variables in all four habitat models. Educational sign density, herring gull activity, and symbolic string fencing were significant in three of four models. In addition, agreement between the RT and GLM pooled models was high, as seven of nine variables in the GLM model had high relative importance values in the RT, and four of six nodes in the RT model involved variables that were significant in the GLM model."}, {"section_title": "Species-habitat Relationships", "text": "In general, management and predation variables were more important than land cover and disturbance variables in defining high quality plover habitat. This finding is particularly important as management actions are not often quantified in conservation science . We found that land management units, symbolic string fencing, ORV management and educational sign density were all significant variables in several habitat models. Among management units, differences between units are critical to breeding productivity. These differences need to be examined more closely as our results showed both positive and negative effects. The differences among management units may be due to multiple factors, including ecological differences as well as such as budgetary, management strategies, and personnel differences. In our study management units differed in the density and size of parking lots and the densities of certain predators (American oystercatchers, gulls, and dogs), which suggests that unit differences are likely the result of discrepancies in public use, habitat, and perhaps leash law enforcement. Our analysis should not be used to criticize particular land managers as much as to prompt further study to discern the unique contributions of geographic location versus management action. Symbolic string fencing and educational sign densities were associated with increased total productivity in three out of four models. This suggests that they are indeed important and effective management strategies. It is not clear from our study, however, whether it is habitat associations or changes in human behavior resulting from fencing and/or signs that leads to improved productivity. Further research into the mechanisms behind the effectiveness of signs and fencing is warranted. The importance of predator activity that we observed is supported by several other studies that found predators to be the primary factor in determining plover productivity . It is worth noting that the specific predators of importance shifted among our models. This shift is not surprising as temporal variability in predator activity has been widely observed for plovers ). For example,  found that both the species and impact of predators shifted on Long Island Beaches over time. In our study area, which was much larger than Cohen's, herring gulls and American crows shift as important predators from year to year. These species have been observed to negatively impact productivity in other New York studies . Herring gulls, though not significant in 2005, appear to have more overall impact compared to crows as they were an important variable in three of four habitat models. Crows and gulls are both known to take advantage of human development and recreation use of beaches; in our study, we found a slight correlation among crows and human density and weighted land cover (Drury 1973, Pierotti and. Several other species and predator-related variables were found to be important, including American oystercatchers, edge density, gull colonies, contrast-weighted edge density, red fox, cats, gulls, and common terns. It is worth noting that fox and cats are non-native species and like gulls and crows, benefit greatly from human development . We considered the native American oystercatcher as a predator in our study based on increasing evidence of predation by this species over the past ten years Tanacredi 2002, Gilmore 2005 (USFWS 1996). Several studies have highlighted the negative impacts from human disturbance . Land cover types, such as development and heavily wooded areas are known to decrease plover productivity , USFWS 1996."}, {"section_title": "Management Implications", "text": "Protecting and managing high quality habitat is critical for piping plover recovery. Our investigation of habitat quality yield several management recommendations. With regard to current management practices, increased use of signs and symbolic string fencing is warranted. During our study we found that symbolic string fencing covered roughly 4% of habitat and 40 to 70 signs were recorded throughout the study area. These seemingly low-density values suggest that signs and fencing may be under-utilized in New York's barrier islands. Though the current practice of localized predator removal projects and nest exclosure cages can be effective in reduction predation rates, we advocate longer-term, broader scaled management actions aimed at reducing the suitability of the habitat for successful predation. Our results suggest that reduced predator activity could be achieved through limiting recreation use and development. A no-development buffer around nesting beaches would decrease human-associated species, such as cats, dogs, crows, and gulls . Herring gulls, an especially important predator in our study, are expected to be reduced through decreasing recreation use and improving sanitation practices at ocean beaches . We do not advocate direct herring gull reduction as this species has been declining throughout the Northeastern U.S. . Taking predator management one step further, increasing the availability of sparsely-vegetated wide beaches, by allowing natural overwash, would provide nesting habitat in which predators may be more easily detected (Prindiville Ryan 1988, Espie et al. 1996). The promotion of natural disturbance dynamics, such as overwash, not only decreases predation, but also protects the very mechanism of plover habitat creation and is likely to become critical in the future. With human population growth expected to continue in coastal areas and forecasted climate change, plover habitat will likely be lost and thus diminishing progress towards recovery . Critical plover breeding habitat for New York's barrier islands are those areas with low weighted land cover, low densities of humans and predator activity, and numerous management activities. In addition, low-wave energy, moist sediment habitat should be included in the definition of critical habitat for this region . These elements outline the qualities of barrier island areas where natural barrier island dynamics are unrestrained by human development and beach stabilization . We support the growing movement to restore and protect natural dynamic regimes such as overwash and natural sand movement on barrier islands , Service. 1996. As complex ecological processes are difficult to mimic , we caution against using artificial beach renourishment projects to fulfill this role. Renourished beaches tend to have steep slope (a significantly negative variable in one GLM model), damage beach flora and fauna, erode quickly, have high human disturbance and development, and have not been studied over a long period . Through the direct protection of natural island dynamics, we can improve and maintain high quality habitat that will bring about high levels of total productivity and recovery. 22,500 m a n 5 m a n 3 5 m a n 6 5 m a n 9 5 m a n 1 2 5 m a n 1 5 5 m a n 1 8 5 m a n 2 1 5 m a n 2 4 5 m a n 2 7 5 m a n 3    "}, {"section_title": "80-4,000", "text": "Min and max h values represent the 10 th and 90 th percentiles of distances between lots and people on beaches, recorded during aerial surveys."}, {"section_title": "4,000", "text": "We identified parking lots from orthoimages and field observations. Lots were active over the 2-year study period."}, {"section_title": "People (man)", "text": "5-305 305 m is the known human induced plover flush distance."}, {"section_title": "305", "text": "Individual human locations were recorded during four digital-photo surveys per year. Beach users were photographed from a fixed-wing airplane at an altitude of 300m. Flights occurred on sunny, haze-free holidays or weekends to capture peak use. Continued on next page The same as edge density, except it incorporated contrast weights, calculated in Fragstats. Contrast weights were assigned a value between 0-1, based on the land cover weights (Table 2). Development (dev)"}, {"section_title": "5-175", "text": "Min. and max. h values represent the 10 th and 90 th percentiles of distances between development, people, and predator locations recorded in the field. Table 2.2 Land cover categories scheme developed for the barrier island system of New York. Land cover weights allocate a value on a scale from 0 to 10, 10 having the least value for piping plovers according to the published literature. We use these weights in the creation of the weighted land cover grid and contrast-weighted edge density variable.  Table 2.3 Explanatory variable assignment to the four environmental groups used to explain total piping plover productivity on barrier islands of New York: We used these groupings to compare the independent (marginal) and conditional explanatory power of each environmental group. We conducted a separate generalized linear models for each group in each year. Marginal group differences shown for each group, calculated as the variance explained by the variables, after accounting for spatial autocorrelation; and the amount of variance explained by the spatial configuration of the sample points alone.  Table 2.4 Conditional group differences for each of the environmental groups shown in Table 2.3. This table shows by year, the total variance explain by all four groups; the variance explained by three group models, after accounting for spatial autocorrelation and dropping one group at a time. The number of total variables in each model is listed in parenthesis.  "}, {"section_title": "Habitat and Landform Response Models", "text": "We expect three possible responses in landform and plover habitat to SLR and increased storminess on barrier islands: static landform/static habitat; static landform/dynamic habitat; and dynamic landform/dynamic habitat. In the static landform/static habitat response, climate changes occur at a rate that outpaces migration of habitat or the islands themselves. In this model, landform and the spatial distribution of habitat does not change; however, rising sea levels submerge preexisting habitat resulting in a loss of habitat and a change in the spatial configuration of the remaining habitat. A static habitat response is reasonable if the rate of SLR outpaces the ability of flora and fauna to migrate upslope and/or if development blocks movement . The validity of a static landform response is higher in a sand-limited system such as ours where a lack of substrate limits island movement . Further, human development in our study system restricts land movement , IPPC 2007. This static landform/static habitat response represents the most liberal habitat loss scenario among the three response models considered here and is used frequently in modeling climate change impacts . The second response model allows for dynamic habitat on a static landform. Under this response, habitat is able to shift upslope and is redistributed based on the underlying landform. While, development influences the amount of habitat movement, this model is that it allows habitat to move inland when not restricted by development. Documented movement of flora both inland and upslope with historic SLR validates this static landform/dynamic habitat response model . The third response model is dynamic landform/dynamic habitat. This model, which includes the movement of both habitat and landform is based on past observation of barrier island dynamics . These responses are more likely in natural areas with minimum development ). However, we were unable to implement this model because there is limited understanding of how barrier island landforms may respond to future climate change. The determination of coastal response to SLR alone has been called one of the largest challenges in coastal sciences Hammar-Klose 2000, FitzGerald et al. 2008). Several other aspects of climate impacts, including temporal scales of change, the importance of wave action, erosion and beach profile formation processes are hotly debated in the coastal science literature (see review in . These debates have lead to a lack of consensus over how to appropriately model landform and habitat dynamics . One point of agreement in the debate is that SLR and storminess prediction must be tailored to local conditions as much as possible ."}, {"section_title": "Habitat Modeling", "text": "We modeled habitat response to SLR and storminess based on a plover breeding habitat map created during the 2005 breeding season. Using a global positioning system, we delineated the inland habitat boundary based on the presence of dense vegetation, steeply eroded banks, or human-made structures. We considered the ocean-side habitat edge, identified by the high water line, a one-day breeding season benchmark by which to measure relative habitat width in a dynamic system. The final format of this habitat map was an ERSI raster grid with 5 m horizontal resolution (ESRI 1999(ESRI -2006. This habitat map also served as the base map for the static habitat response and the binary response variable in the logistic generalized linear model (GLM) used to predict plover breeding habitat under dynamic habitat response. We built the GLM with two independent variables: elevation and the least cost distance from the ocean to inland areas. We selected these two variables to model plover habitat based on the key role they play in determining the movement of water and sand across islands , . We used an elevation grid from a 2006 light detection and ranging (LIDAR) digital elevation model (DEM) with 3.0 m horizontal accuracy and 0.3 m vertical resolution (USACE 2005). We created a least cost distance grid using the Cost Distance function in ArcGIS, which calculated the least accumulative cost distance from ocean cells to all other cells based on a cost surface derived from the DEM (ESRI 1999(ESRI -2006. Cost was equal to one plus the elevation above sea level squared. Thus, cost distance increased exponentially with increasing elevation above sea level and linearly with increased distance from the ocean. We identified the ocean cells by extracting and masking all DEM values equal to or less than zero on the ocean side of all barrier islands. We built the GLM model from 2,000 randomly selected points, evenly split between habitat and non-habitat. The GLM was run using R open-source software (R core team 2005) with the Stats, Design, and PresenceAbsence packages. We checked the model for over dispersion and validated it with a bootstrapping method. We measured discrimination performance using a receiving operating characteristic curve (ROC). We created binary model output maps using a threshold value identified through the ROC analysis that maximized the Kappa value . We established further support for the GLM by comparing the C index , omission and commission error rates resulting from the GLM to a classification tree model, performed in R, using the rpart package. The tree was developed using the gini splitting criterion, equal prior probabilities, 10-fold cross validation , and the appropriate size was obtained using the 1-S.E. rule . We derived a P-value for the final tree using Monte Carlo resampling, using 1,000 permutations of the data, and comparing the coefficient of determination of our tree to the random distribution of values. We permutated only those variables in the original tree, based on the first variable to preserve correlation structure."}, {"section_title": "Sea-level Rise Scenarios", "text": "Four well-supported SLR scenarios were selected, each representing a thirty-year average estimate, centered on 2080. Thirty-year averages are standard climate modeling time slices aimed at reducing forecast uncertainty (NYPCC 2009). We based three of our four SLR scenarios on Intergovernmental Panel on Climate Change (IPCC) and the New York City Panel on Climate Change estimates. These scenarios were refined for the New York region by Columbia University Center for Climate Systems Research. These scenarios included components for thermal expansion of the oceans due to global temperature increases, changes in the ice mass (including Greenland, Antarctica, and glaciers) due to temperature increases, SLR due to local differences in mean ocean density and circulation changes, and local land subsidence (NYPCC 2009). The scenarios, referred to here by codes given in the IPCC 2007 report, are B1 (\"low\") which projects a rise of 0.38 m, A1B (\"medium\") which projects a rise of 0.47 m, and A2 (\"high\") which predicts a rise of 0.5 m (see IPPC 2007 for scenario details, NYPCC 2009). Our fourth SLR scenario was a rise of 1.5 m (\"higher\") based on several recent studies that suggested that the IPCC estimates are too conservative because they do not incorporate recently verified high rates of ice sheet loss . We further tailored all four SLR scenarios to our study area DEM by calibrating mean high tide with local data from tidal gauges located at The Battery and Montauk, which are within 40 km east and west of our study area, respectively (NYPCC 2009). Mean high tide value was 0.44 m that we subtracted from the original DEM grid before calculating the SLR scenarios. We applied the four SLR scenarios, plus no SLR, to both the static and dynamic habitat response models. For the static response, we simply inundated the GLM habitat grid by filling the DEM values with each SLR estimate. Under the dynamic habitat model, we predicted new habitat extents for each SLR using the GLM and new scenariospecific DEM and least cost grids. For example, for the \"higher\" scenario, we subtracted 1.5 m from all original DEM cell values, creating a new DEM, which we then used to create the least cost distance grid. We submitted the scenario-specific grids to the original GLM, generating a binary map of plover breeding habitat under the \"higher\" SLR."}, {"section_title": "Storminess Scenarios", "text": "To examine how increased storminess may affect plover habitat and possibly interact with SLR, we modeled three types of storms over three timeframes under no and high SLR with a dynamic habitat response. Assuming that development will influence storm impacts , we used a dynamic response only so that we could incorporate development into storm models (see development details below). The timeframes are represented by thirty-year averages centered on 2020, 2050, and 2080 (NYPCC 2009). Storm types included five-year storms (nor'easters), category two hurricanes, and category three hurricanes. The National Hurricane Center's Sea, Lake, and Overland Surges from Hurricanes (SLOSH) model was used to develop the storm scenarios. These data were provided to us by the National Oceanic and Atmospheric Administration's Coastal Services Center and were developed specifically for Long Island, New York to evaluate storm-surge flooding for our three storm types , NWC 2009. SLOSH models determine at-risk areas for storm surge via a simulation of hundreds of hypothetical hurricanes −in each category− with various forward speeds, tides, landfall directions, and landfall locations . At the end of each model run, an envelope of water is generated, reflecting the maximum surge height obtained by each grid cell . We specifically used a model called a Maximum Envelope of Water (MEOW) which represents the maximum surge height in each grid cell for each storm type and general storm track . Our methods for assessing the impacts of the SLOSH models on plover habitat were similar to the dynamic SLR scenarios in that storms lead to a change in habitat via the GLM model. Storm model differ from our SLR models in that we do not view surges as a permanent change to water levels; however, we do expect temporary flooding of the habitat during the breeding season in which the storm occurs. Under this expectation, we suspect that nor'easters are more likely to flood plover habitat, because these storms are more common early in the nesting season . However, hurricanes have been known to hit the region during the breeding season (OEM 2009). We assume that when these storms hit, habitat will be shifted to other areas and plover renesting will potentially move to those regions. We implemented the habitat shift through a range of surge values for each storm that we subtracted from the elevation surfaces. For nor'easters, the surge value that we applied to the DEM was 1.65 m. Category two hurricane surge values ranged from 0 to 2.4 m, each grid cell had a unique value owing to variation in the SLOSH model. Category three hurricanes surge values ranged from 0-3.7 m. In addition, to examine how SLR may combine with storms over time, we combined each of the three storm models individually with Columbia University Center for Climate Systems Research's \"high\" SLR estimates in three rise increments: 2020: 0.09 m, 2050:0.24 m, and 2080:0.5 m. These SLR increments were added to the storm surges in our application to the DEM surface."}, {"section_title": "Development Intensity", "text": "Development data included buildings, roads, jetties and groins that were digitized using 2004 natural color photographs with a 0.5 m resolution (NYSGIS 2004, USGS 2004 We compared the influence of development on the dynamic habitat response models by systematically examining each SLR scenario under all levels of development intensity. We used the dynamic model because, unlike the static habitat response, it allows for the possibility of habitat to move into developed regions. We created final potential habitat estimates for each SLR/development combination by masking the GLM habitat predictions by development grids so that habitat could not fall in developed areas. We incorporated development intensity levels into the formation of habitat after storm impacts in a staggered fashion. Among five-year storms, we excluded habitat from all levels of development intensity because nor'easters typically do not destroy development . In category two hurricanes, we excluded habitat from medium and high intensity development areas but allowed low intensity to become habitat based on the observed loss of low intensity development on Fire Island from 1985's hurricane Gloria and predicted impacts expected under the Saffir-Simpson Hurricane Impact Scale , NOAA 2009. Based on historical evidence from 1954 and 1938 hurricanes and the Saffir-Simpson scale, in category three hurricanes we excluded habitat from high intensity development only , NOAA 2009. We expect that high-intensity development will exclude habitat under all storm models due to the large amount of impervious surfaces. (NOAA 2009)."}]