[{"section_title": "Executive Summary", "text": "Efforts to increase student achievement have focused in recent years on improving teaching in the United States. Programs implementing higher standards for curricula, student performance, and, especially, teachers' preparation and inservice training have been cornerstones of recent reforms (Hirsch, Koppich, and Knapp 2001;Potts, Blank, and Williams 2002). To ensure a highly qualified teacher for every child, the No Child Left Behind Act and related state policies now require that teachers hold a bachelor's degree and full certification in their field. Two common goals are attracting more skilled people to the profession and retaining teachers at higher rates, particularly new teachers. Interest in the teaching workforce often focuses on the characteristics of college graduates who choose teaching and who later decide to stay in the profession, and how teachers compare to their counterparts in other professions (Hanushek, Kain, and Rivkin 2004;Henke and Zahn 2001). This report profiles 1992-93 bachelor's degree recipients' experience with K-12 teaching in the subsequent 10 years, and their preparation for teaching. The analysis compares current and former teachers among this cohort on many measures, and contrasts these groups with graduates who never taught (where appropriate). It uses data from the 2003 Baccalaureate and Beyond Longitudinal Study (B&B:93/03), the final follow-up survey of students who received their bachelor's degrees in 1992-93 (B&B:93). The B&B:93 sample was drawn primarily from eligible respondents in the 1993 National Postsecondary Student Aid Study (NPSAS:93), a nationally representative sample of all students in postsecondary education institutions in the 50 states, the District of Columbia, and Puerto Rico. The analysis uses standard t-tests to determine statistical significance of differences between estimates, and one-way Analysis of Variance (ANOVA) to detect linear relationships between one ordered and one other variable. All differences reported in the text are statistically significant at the p < .05 level."}, {"section_title": "Teaching Status of 1992−93 Graduates in 2003", "text": "In this study, teachers are defined as bachelor's degree recipients who had worked as teachers of any grade K-12. This definition excludes those who worked only as long-or short-term substitutes or teacher's aides, and those who taught only preschool grades. Through spring 2003, one-fifth (20 percent) of 1992-93 bachelor's degree recipients had taught in an elementary or secondary school (figure A and text table 1). Approximately 11 percent of these graduates were teaching when interviewed in 2003, and another 9 percent had taught at some point but were not teaching at the time of the interview.\nIn this study, teachers are defined as bachelor's degree recipients who had worked as teachers of any grade K-12; excluded are those who worked only as long-or short-term substitute teachers or teacher's aides, and those who taught only preschool grades. Cohort members considered as teachers in this report include all graduates who had earned a bachelor's degree in 1992-93 and had taught at some point, regardless of teaching experience and teacher training before earning that bachelor's degree. 3 By 2003, one-fifth (20 percent) of 1992-93 bachelor's degree recipients had taught in an elementary or secondary school since completing the 1992-93 bachelor's degree (figure 1 and table 1). Approximately 11 percent were teaching when they were interviewed in 2003, and another 9 percent had taught at some point but were not teaching at the time of the interview. 4"}, {"section_title": "Executive Summary iv", "text": ""}, {"section_title": "Demographic Characteristics", "text": "Consistent with historical precedent (Grant and Murray 1999), in 2003 women were more likely than men to report that they were currently teaching (15 percent vs. 6 percent) or had taught previously (12 percent vs. 6 percent) (figure A and text table 1). Overall, 26 percent of the female graduates had taught at some point, compared with 12 percent of the males (text table 1). Asian/Pacific Islander graduates in this cohort were less inclined than others toward a teaching career; 93 percent of Asian graduates had never taught by 2003, compared with 75 to 80 percent of graduates of other racial/ethnic backgrounds. Graduates who were age 30 or older when they completed their 1992-93 bachelor's degrees were also in general more likely than younger graduates to be teaching when they were interviewed in 2003.\nTeaching has been a female-dominated profession in the United States for well over a century (Grant and Murray 1999). The cohort of 1992-93 bachelor's degree recipients continued this long tradition of gender difference in the first few years after graduating from college (Henke, Chen, and Geis 2000;Henke, Geis, and Giambattista 1996). Ten years after completing their bachelor's degrees, as well, women in the 1992-93 cohort were more likely than men to report in 2003 that they were currently teaching (15 percent vs. 6 percent) or had taught previously (12 percent vs. 6 percent) (figure 1 and table 1). Overall, about one-quarter of women had taught at some point, compared with 12 percent of men. In addition, women were more inclined to have taken steps toward a teaching career (e.g., to have considered teaching, applied for teaching positions, or undertaken professional preparation for teaching), discussed in the latter section of this report. Relative to graduates of other racial/ethnic backgrounds, Asian/Pacific Islander graduates in this cohort were less inclined toward a teaching career. In 2003, for example, approximately 93 percent of Asian graduates had never taught, compared with 75 to 80 percent of graduates of other racial/ethnic backgrounds (table 1). This finding is consistent with the teaching experience patterns observed earlier with this cohort and in the 1-year follow-up of 1999-2000 bachelor's degree recipients, in which Asian bachelor's degree recipients were less likely than other graduates to pursue a teaching career in their first year out of college (Henke, Chen, and Geis 2000;Henke et al. 2005). The age of graduates when they completed their 1992-93 bachelor's degree was related to the likelihood that they were teaching in 2003. Graduates who were at least 30 years old when they completed their 1992-93 bachelor's degree were in general more likely to be teaching in 2003 than those who were younger. The proportions who were teaching ranged from 9 percent of those ages 25−29 to 14 percent of those who were at least 30 when they completed the degree. Among those with teaching experience, the youngest degree earners (age 22 or younger when completing their bachelor's degree) were about evenly split between current and former teachers. Teaching Status of 1992−93 Graduates in 2003 However, those earning their degrees at age 30 or older were more likely to be teaching in 2003 than to have left teaching (14 vs. 8 percent)."}, {"section_title": "Academic Characteristics", "text": "Graduates of public nondoctoral institutions were more likely than others to be teaching in 2003 (text table 2). While 17 percent of public nondoctoral institution graduates reported teaching in 2003, among graduates from other institution types, 11 percent or fewer were teaching in 2003 (figure 2 and text table 2). Approximately 71 percent of education majors among 1992-93 graduates had taught by 2003: 43 percent were teaching at the time of the interview, and 29 percent had taught but were not currently teaching (figure 3 and text table 2). Education majors were more likely than those Executive Summary v who majored in any other discipline to be teaching in 2003 and to have prior teaching experience. However, 57 percent of all education majors were not teaching in 2003-29 percent who had never taught plus 29 percent who were former teachers. 1 The data also indicate lower attrition rates from teaching among education majors than among majors in other fields. 1 Although the two estimates each round to 29 and thus their sum would appear to be 58, summing the unrounded estimates produces 57.4. Graduates' scores on college entrance examinations (i.e., the SAT or ACT) were inversely related to their subsequent likelihood of teaching in 2003. For example, 16 percent of graduates with college entrance examination (CEE) scores in the lowest 25 percent of the distribution were teaching in 2003, compared with 10 percent of those in the middle half of the score distribution and 6 percent of those with the highest scores (figure B and text table 2). On the other hand, as college grade point average (GPA) increased, graduates were more likely to have past teaching experience and in general were more likely to be teaching in 2003 (figure B). About 34 percent of 1992-93 graduates whose highest earned degree was a master's⎯and 47 percent of those who attained a post-baccalaureate certificate⎯had taught at some point by 2003 (figure 5 and text table 2). In contrast, 16 percent of graduates whose highest degree was a bachelor's and 10 percent of those who earned a credential higher than a master's degree had taught by 2003.\nThis section examines how graduates' teaching experience related to their postsecondary education experiences, primarily to aspects of their undergraduate education. First, variation in teaching experience is analyzed according to the type of institution from which graduates earned their bachelor's degree and to their major field of study. This section also shows how teaching varied with the highest degrees graduates had attained by 2003, as well as their performance in "}, {"section_title": "Teachers' Job Characteristics and Opinions About Teaching", "text": "\nOverall, 20 percent of 1992-93 college graduates had taught at some point before the 2003 interview, 10 years after college completion (table 2). This section describes this group by examining several characteristics of the schools in which they taught and of their teaching positions, followed by a look at the teachers' attitudes, including satisfaction with teaching and plans for the future."}, {"section_title": "Characteristics of Teaching Job", "text": "Among graduates who were teaching in 2003, 91 percent were teaching in a public school and 64 percent in an elementary school (figure 6 and text table 3). Graduates who were teaching in 2003 were more likely than graduates who had taught only previously to work at a public school. General elementary was the main assignment field reported by 35 percent of these graduates, and 18 percent taught science or mathematics (figure 7)."}, {"section_title": "Job Satisfaction and Plans for Continuing to Teach", "text": "Nearly all graduates (93 percent) who were teaching in 2003 expressed overall satisfaction with that job (figure C). Teachers were more likely to be satisfied with the learning environment at their 2003 school (77 percent) than with such aspects as pay, parent support, and students' motivation to learn (48 percent of teachers were satisfied with each of these aspects). On other measures reflecting job satisfaction, 90 percent of 2003 teachers reported that they would choose teaching again, and 2 in 3 (67 percent) said they would remain a teacher for the rest of their working life (text table 4). Male and female teachers did not differ measurably in how long they planned to remain in the profession. However, more male than female teachers (94 vs. 88 percent) said they would choose teaching if they had a chance to make the decision again (figure 9). White teachers were more likely than Black teachers to plan to teach until retirement (70 vs. 37 percent; figure D).\nReducing the number of teachers who leave the profession before retirement is one way to raise average teacher experience and decrease the chances that any particular student will have an inexperienced teacher. As a group, new teachers, particularly those in their first year, tend to be less effective than teachers with more time on the job (Hanushek et al. 2005;Rowan, Correnti, and Miller 2002;Greenwald, Hedges, and Laine 1996). Although teacher retention has attracted much concern, it should be noted that bachelor's degree-holding teachers are less likely than many other graduates to leave their initial occupation, even in the first few years. For example, a wide range, between 17 and 75 percent, of 1992-93 college graduates changed occupations within 4 years of receiving their bachelor's degrees, when grouped by occupation held at the 1-year point (Henke and Zahn 2001). Teachers were among the least likely to change occupations in this time period, at 18 percent. Nevertheless, as policymakers and administrators seek to improve planning for future staffing and to increase teacher retention, they may seek data about teachers' job satisfaction and career plans. This section briefly discusses the data on these topics from the 1993−2003 cohort. Graduates who were teaching in 2003 were asked whether they were satisfied with teaching overall and with specific aspects of the job; the results are shown in figure 8. Nearly all teachers expressed satisfaction with teaching overall in 2003 (93 percent). Teachers were more likely to be satisfied with the job overall than with any of the six specific school or job characteristics shown. They were also more satisfied with some aspects of teaching than others. For example, 77 percent said they were satisfied with the learning environment at their current school, while 48 percent expressed satisfaction with parent support, with students' motivation to learn, and with pay. Roughly 3 out of 5 teachers were satisfied with class sizes (61 percent) and with student discipline and behavior at their school (57 percent).  Among current teachers in 2003, nearly all reported that they would choose teaching again (90 percent), and two-thirds (67 percent) said they would remain in teaching for the rest of their working life (table 4). Relatively few teachers said they would leave before retirement for a nonteaching job in education or for a better job (8 and 10 percent, respectively). On the measure of how long they expected to stay in teaching, elementary school teachers were more inclined to say until retirement than secondary school teachers (71 vs. 59 percent, respectively).  Male and female teachers did not differ measurably in how long they planned to remain in the profession. However, more male than female teachers (94 vs. 88 percent) said they would choose teaching if they had a chance to make the decision again (figure 9). In addition, White teachers were more likely than Black teachers to plan to teach until retirement (70 vs. 37 percent; figure 10). White, Black, and Hispanic teachers were not measurably different on these indicators of plans to remain and satisfaction with teaching, except that Hispanic teachers were more likely than White teachers to say they would choose teaching again (99 vs. 90 percent). Derived from College Board-, institution-, or student-reported SAT or ACT scores, where available. 4 Included in the totals but not shown separately are data for respondents who majored in business or management and health fields. 5 Included in the totals but not shown separately are data for respondents whose undergraduate GPA was less than 2.25. 6 Included in the totals but not shown separately are data for respondents who attended private for-profit 2-year-or-more institutions. 7 Included in the totals but not shown separately are data for respondents who attained postbaccalaureate certificates or degrees higher than master's. 8 Elementary schools provide instruction in some grade lower than 7th and no grade higher than 8th. Secondary schools provide instruction in no grade lower than 7th. Combined schools provide instruction in some grade lower than 7th and some grade higher than 8th. Included in the totals but not shown separately are data for respondents who taught at combined schools. 9 Included in the totals but not shown separately are data for respondents whose main teaching field was business and Length of time expect to stay in teaching"}, {"section_title": "Reasons for Not Teaching in 2003", "text": "About 11 percent of the 1992−93 cohort were teaching in 2003, and 9 percent had taught but were not currently teaching (text table 2). Roughly as many graduates had thus left teaching as had stayed in the field by 2003, whether leaving was on a temporary or permanent basis. One-fifth of teachers who left teaching by 2003 cited raising children or other family demands as their main reason for leaving (text table 5). Other common reasons for leaving teaching were to take jobs outside of education (18 percent) or nonteaching jobs in education (15 percent), because of low pay (13 percent), and \"other\"-an unspecified reason (22 percent). Male teachers were more likely than females to leave for a job outside of education, while females were more likely to leave for family-related reasons.\nAbout 11 percent of the 1992−93 cohort were teaching in 2003, and 9 percent had taught but were not currently teaching (table 2). Evidence did not indicate that these two estimates differed; therefore, roughly as many graduates of the 1992−93 cohort had left teaching as stayed in the field by 2003, whether they had left on a temporary or permanent basis. (Some of the teachers not teaching in 2003 may return to teaching at some point in the future, while others had left the profession for good.) Figure 11 and table 5 present estimates for the percentage of former teachers who gave various main reasons for not teaching in 2003. Between 13 and 22 percent of the total group cited one or more of the top five reasons: \"other\" (an unspecified reason); familyrelated, such as raising children; to work outside of education; to take a nonteaching job within the education field; and low pay. Evidence was not found for differences in the percentages citing one versus another of these reasons. Seven percent reported difficulty with students, parents, or administrators; additional reasons were each selected by 3 percent or fewer of respondents. The frequency of certain main reasons for leaving teaching differed by gender. Male teachers were three times as likely as their female counterparts to leave for a job outside of education (32 vs. 10 percent), while women were about 30 times as likely as men to leave for family-related reasons such as raising children (29 vs. 1 percent). However, gender differences were not detected for the percentages who left teaching to seek higher pay elsewhere or to take a non-teaching job in the education field. Former elementary school teachers gave family-related reasons at a higher rate (26 percent) than former secondary school teachers (11 percent) or teachers at combined schools (14 percent).  To earn higher salary Difficulty with students, parents, or administration Elementary schools provide instruction in some grade lower than 7th and no grade higher than 8th. Secondary schools provide instruction in no grade lower than 7th. Combined schools provide instruction in some grade lower than 7th and some grade higher than 8th. Included in the totals but not shown separately are data for respondents who taught at combined schools. Included in the totals but not shown separately are data for respondents whose school had 0-4 percent free or reduced-price lunch recipients. Included in the totals but not shown separately are data for respondents with main field of business/vocational, foreign language, social studies, or fine arts. "}, {"section_title": "Executive Summary vii", "text": ""}, {"section_title": "Preparation for Teaching", "text": "\nResearchers and policymakers are interested in teacher preparation for several reasons, perhaps foremost to ensure that teachers are adequately trained to face the challenges of teaching. Educational leaders seek to attract highly skilled college graduates to teaching and to provide useful training and practice likely to transform them into effective teachers. Preparation and certification requirements have been changed by state agencies in recent years, with the aim of ensuring that all teachers have specific kinds of preparation; at the same time, policymakers want to avoid inadvertently creating barriers that prevent skilled people from becoming teachers. In addition, strong preservice preparation and individualized support for novice teachers are critical not only to teachers' effectiveness but also to retaining them in the profession beyond the first few years (Smith and Ingersoll 2004;NCTAF 1997). Districts sometimes have difficulty finding and hiring well-trained teachers, especially in fields like mathematics, science, and special education (Murphy, DeArmond, and Guin 2003;National Governors Association 2000;NCTAF 2003). One highly effective way to address the scarcity of teachers is to reduce the attrition that occurs among new teachers (Cochran-Smith 2004; Ingersoll 2001Ingersoll , 2004Wayne 2000;Guarino, Santibanez, and Daley 2006). This section sheds some light on these issues by presenting information on the characteristics of 1992-93 college graduates who entered and progressed through-or avoided-the teacher pipeline in the subsequent decade."}, {"section_title": "Progress Through the Teacher Pipeline", "text": "Nearly one-half (46 percent) of all 1992-93 bachelor's degree recipients had either not considered teaching or not taken any steps to prepare for the profession (figure 12 and text table 6). Another 30 percent had either considered teaching or applied for a teaching job at some point in the previous decade. While 16 percent had both prepared to teach and taught, roughly 4 percent each had taught with no training or prepared but had not taught. Males and Asians/Pacific Islanders in the cohort were less likely than females and those from other racial/ethnic groups to have considered teaching or taken steps toward a teaching career (text table 6). Being prepared to teach is defined in this report as having earned a teaching certificate or having completed a student teaching assignment (which usually occurs toward the end of a Executive Summary viii teacher preparation program). 2 Characteristics associated with preparing for and becoming a teacher included having earned a different bachelor's degree before the 1992-93 degree, earning the latter degree from a public nondoctorate-granting institution, and having majored in education as an undergraduate. Graduates who had higher college grades were also more likely to have gained teaching experience and to have completed preparation to 2 Most states' certification requirements for public school teachers include a period of student teaching-either directly or indirectly (e.g., states may require teachers' education programs to include student teaching and require all prospective teachers to complete such a program). teach by 2003. On the other hand, as CEE scores increased, graduates were less likely to have prepared and to have taught by 2003. Having either taught or trained to teach before completing the 1992-93 degree were other predictors of preparing and teaching by 2003.\nThe various stages of preparation and teaching experience can be viewed as a pipeline, in which the entire sample is eligible for the first stage but each successive stage requires having taken certain steps toward teaching (categories are shown in figure 12 and table 6). In this categorization, the subset of college graduates who never considered teaching appear in the first category: no pipeline entry. Those who considered teaching or applied for a teaching job at some point in the 10-year follow-up period, but took no further steps to prepare, make up the second category. The third category consists of those who did not prepare but nevertheless did some teaching. The fourth category encompasses graduates who prepared to teach but did no teaching. The fifth and final category consists of prepared teachers-those who completed all steps for preparation and had some teaching experience (though were not necessarily current teachers in 2003). Nearly one-half (46 percent) of 1992-93 bachelor's degree recipients reported they had neither considered teaching nor taken any steps to prepare for the profession-that is, they had not entered the teacher pipeline (figure 12 and table 6). Another 30 percent had either considered teaching or applied for a teaching job at some point⎯but went no farther than this first stage in the pipeline. Roughly 4 percent each had taught with no training or prepared but not taught, and 16 percent overall had both prepared to teach and taught."}, {"section_title": "Student Teaching and Certification", "text": "Overall, 4 in 5 of 1992-93 bachelor's degree recipients had not prepared to teach by 2003 (text table 7), while 17 percent earned teaching certificates. Another 3 percent had completed student teaching but not all requirements for certification. Graduates who were relatively   ix   likely to earn teaching certification included  females (figure E and text table 7), Whites and Blacks (vs. Asians/Pacific Islanders), those who graduated from public non-doctorate-granting postsecondary institutions, and those who majored in education.\nThe two steps graduates could complete to count as \"prepared to teach,\" as noted above, are completing a student teaching assignment or earning a teaching certificate. Student teaching is usually one of several requirements needed for certification. Overall, 17 percent of 1992-93 bachelor's degree recipients did earn teaching certificates, while 4 out of 5 neither student taught nor earned a teaching certificate by 2003 (table 7). 7 Another 3 percent had student teaching experience but had not completed all additional requirements to earn a teaching certificate. As with teaching experience, examined in the first half of this report, several demographic and academic characteristics of college graduates were related to obtaining teacher certification. Graduates who were relatively likely to earn certification included females (figure 13), Whites, Blacks, and Hispanics compared with Asians/Pacific Islanders (table 7), those who graduated from public non-doctorate-granting postsecondary institutions, and those who majored in education. For example, while 74 percent of education majors later earned certification, 18 percent of arts/humanities and 13 percent of \"other\" majors did so. Arts/humanities majors were more likely, at 18 percent, to have completed teaching certificates, compared with the other four majors categories below that rate. Nine percent or fewer of majors in other fields earned certification. Similar to the outcome of having prepared and taught, discussed above, graduates who had relatively low CEE scores or high grades in college were more likely to have earned teaching certificates by 2003 (table 7). In addition, among those who had taught or trained to teach before completing their 1992-93 degree, two-thirds were certified teachers by 2003, compared with 15 percent among their peers who neither taught nor trained for teaching before completing their bachelor's degree in 1992−93. \nThe two steps graduates could complete to count as \"prepared to teach,\" as noted above, are completing a student teaching assignment or earning a teaching certificate; student teaching is usually one of several requirements needed for certification. Overall, 17 percent of 1992-93 bachelor's degree recipients did earn teaching certificates, while 4 out of 5 neither student taught nor earned a teaching certificate by 2003 (table 7). 9 Another 3 percent had student teaching experience but had not completed all additional requirements to earn a teaching certificate. As with teaching experience, examined in the first half of this report, several demographic and academic characteristics of college graduates were related to obtaining teacher certification. Graduates who were relatively likely to earn certification included females (figure 13), Whites, Blacks, and Hispanics compared with Asians/Pacific Islanders (table 7), those who graduated from public non-doctorate-granting postsecondary institutions, and those who majored in education. For example, while 74 percent of education majors later earned certification, 18 percent of arts/humanities and 13 percent of \"other\" majors did so. Arts/humanities majors were more likely, at 18 percent, to have completed teaching certificates, compared with graduates in the other four majors categories below that rate. Nine percent or fewer of majors in other fields earned certification. Similar to the outcome of having prepared and taught, discussed above, graduates who had relatively low CEE scores or high grades in college were more likely to have earned teaching certificates by 2003 (table 7). In addition, among those who had taught or trained to teach before completing their 1992-93 degree, two-thirds were certified teachers by 2003, compared to 15 percent among their peers who neither taught nor trained for teaching before completing their bachelor's degree in 1992−93."}, {"section_title": "Reasons for Deciding Not to Teach", "text": "Among the 1992−93 graduates who had considered teaching but had not entered the profession, 36 percent cited lack of interest in teaching, 30 percent reported having another job already, and 25 percent sought higher pay (text table 8). Males were more likely than females to have sought higher pay, gotten another job, and received a better offer than teaching (figure 14). Graduates whose attainment before the 1992-93 bachelor's degree was less than a bachelor's were also more likely than those with higher prior attainment to report seeking higher pay as their reason for not teaching (25 percent vs. 14 percent). As their CEE scores increased, 1992-93 graduates were more likely to select the following reasons for not entering teaching: poor working conditions, low pay, and having another job already. Graduates with relatively high college grades were less likely than those with lower grades to say that lack of teacher certification played a role in the decision.   xv Table  Page   C-1 Standard errors for table 1 and figures A and 1: Percentage distribution of 1992-93  bachelor's degree recipients' teaching status, by demographic   Introduction of this report describes the academic and demographic characteristics of 1992−93 bachelor's degree recipients who went into teaching and those who did not. Data on graduates who entered the teacher supply pipeline, and whether they completed teacher certification and went on to teach, are discussed in the report's second section. That section also covers data on the main reasons graduates who did not teach had for deciding against teaching, and whether those reasons differed by a range of characteristics.\nGraduates who had entered the teacher pipeline, defined as considering teaching at some point, but who neither applied for a teaching job nor taught since 1997 were asked about reasons for that decision. The most commonly mentioned reasons for not entering teaching were lack of interest (36 percent), having another job already (30 percent), and wanting higher pay (25 percent) (table 8). 10 Several gender differences in reasons for deciding against teaching were observed. Men were more likely than women to say that wanting higher pay than teaching provides figured into their decision, 32 versus 19 percent ( figure 14 and table 8). Men were also more likely than women to say they already had another job or they had received a better offer than teaching, while females were more inclined to report some \"other reason\" not specified in the survey interview. Among the relevant academic characteristics, graduates whose attainment before the 1992-93 bachelor's degree was less than a bachelor's were more likely than those with higher prior attainment to report that they sought higher pay in rejecting teaching (25 vs. 14 percent). Additionally, as CEE scores increased, 1992-93 graduates were more likely to select the following reasons for not entering teaching: poor working conditions, low pay, and having another job already.   "}, {"section_title": "List of Tables", "text": "This report provides data related to retention by examining the teaching experience and attrition rates over the first 10 years by 1992-93 bachelor's degree completers. 1 In addition, for those graduates who taught at some point since receiving the bachelor's degree but who were not teaching in 2003, the report discusses the main reason they were not teaching in 2003. In addition to recruitment, retaining new teachers in the profession and reducing staff turnover, especially in hard-to-staff schools, have become focal points for improving teacher quality (Ingersoll and Smith 2003). Some teachers leave the profession within the first few years, making it difficult for certain schools and districts to find replacements. In addition, teacher turnover favoring schools in more affluent districts can lead to less affluent districts having higher rates of inexperienced or less qualified teachers. Research evidence suggests that teachers with very little experience, particularly those in their first year of teaching, are less effective than others and that teacher quality improves notably in the first few years (Hanushek et al. 2005). Therefore, retention efforts seek to help novice teachers improve their craft during the first year or two, to increase the likelihood that they stay in teaching and are able to educate children well. The report begins with a discussion of the data and methodology upon which the estimates and analysis are based. Next, the report discusses the teaching status of 1992-93 college graduates in 2003, attending to variation in teaching by demographic characteristics and undergraduate academic characteristics and experiences. In addition, teachers' satisfaction with teaching and plans for staying in the profession are analyzed, along with reasons that teachers gave for not teaching in 2003. The report's second section concludes by studying graduates' entry into the teacher supply pipeline and preparation to teach, again examining variation by demographic and academic characteristics. The variables used in this report are defined in appendix A (the glossary), and additional information about the B&B:93/03 data is presented in appendix B."}, {"section_title": "Data and Methods", "text": "Using data from the 1993-2003 Baccalaureate and Beyond Longitudinal Study (B&B:93/03), this report provides a description of the teaching experience and teacher preparation activities of 1992-93 college graduates 10 years after bachelor's degree receipt. The B&B:93/03 sample was based on respondents to the 1993 National Postsecondary Student Aid Study (NPSAS:93) who completed a bachelor's degree in the 1992-93 school year. 2 NPSAS:93 includes a nationally representative cross-section of all students in postsecondary education institutions in the 50 states, the District of Columbia, and Puerto Rico. For NPSAS:93, information was obtained from more than 1,000 postsecondary institutions on approximately 50,000 undergraduate students and more than 13,000 graduate students. Those members of the NPSAS:93 sample who completed a bachelor's degree between July 1, 1992, and June 30, 1993, were identified and contacted for a 1-year follow-up interview in 1994 and for a second followup in 1997. Data from the final follow-up, conducted 10 years after the initial data collection (B&B:93/03), form the basis of this report. The estimates in this report are based on the reports of approximately 8,100 bachelor's degree recipients, representing about 1.2 million people who completed a bachelor's degree in 1992-93. The 2003 Internet-based survey was either self-administered by respondents or administered over the telephone by trained interviewers. The weighted overall response rate for the B&B:93/03 interview was 73.6 percent, reflecting an institution response rate (in 1992) of 88.2 percent and a student response rate (in 2003) of 83.4 percent. For more information about B&B:93/03, see appendix B. All comparisons made in the text were tested using the Student's t statistic for comparing two estimates or one-way Analysis of Variance (ANOVA), incorporating F-tests, to detect linear relationships between one ordered and one other variable, as well as overall significance. All differences cited were statistically significant at the .05 level. The formulas used for t-tests and more detail on significance levels are provided in appendix B."}, {"section_title": "Undergraduate Institution Type", "text": "Public non-doctorate-granting institutions stand out as the institution type whose graduates were most likely to be teaching 10 years after receiving their bachelor's degree. Seventeen percent of 1992−93 bachelor's degree recipients from public nondoctoral institutions reported teaching in 2003; a maximum of 11 percent of graduates from the other four institution types shown in table 2 were teaching in 2003 (figure 2). Students who graduated from private forprofit schools were particularly unlikely to become teachers in the next decade; 98 percent of them had never taught by 2003.  "}, {"section_title": "Undergraduate Major Field of Study", "text": "Some states have certification requirements that allow prospective teachers to complete the professional preparation and earn a teaching certificate as undergraduates, while in others, teachers' professional preparation may be partly reserved for post-baccalaureate study and practice. One policy goal of the latter type of certification requirement is to free up sufficient course time to allow future teachers to gain a thorough foundation in one or more academic disciplines (often an undergraduate major or minor), particularly in a subject matched or related to the one they intend as their primary teaching field. Education majors were more likely than those who majored in any other set of disciplines to have gained some teaching experience by the time of the 2003 interview (table 2). Approximately 71 percent of education majors among 1992-93 graduates had taught by 2003: 43 percent were currently teaching, and 29 percent had taught but were not teaching at the time of 100.0 58.5 41.5 † † Not applicable. 1 Included in the totals but not shown separately are data for respondents whose first institution was among the following categories: for-profit, less-than-2-year, or private not-for-profit 2-year. Taught at some point the interview. As shown in figure 3, arts and humanities majors were the next most likely group: 28 percent of them had teaching experience by 2003, as did 15 percent of graduates who had majored in \"other\" fields (those not specified in another category). From 8−11 percent of graduates who had majored in the health professions; science, mathematics, or engineering; or social sciences had taught at some point by 2003. Five percent of business and management majors had taught by 2003. Although it is no surprise that most education majors became teachers, 29 percent of education majors had not taught any of grades K−12 within 10 years of completing their bachelor's degree. This group did not hold any teaching job, regardless of whether they completed student teaching and all other steps required for certification. (In fact, as discussed in the section below on teacher pipeline entry and progress, nearly all who completed preparation did teach at some point.) Larger proportions of graduates with other majors had no teaching experience, of course: 72 percent of arts or humanities majors, along with at least 85 percent of graduates who majored in each of the other five field categories. Notably, a total of 57 percent of all education majors were not teaching in 2003-29 percent who had never taught plus 29 percent who were former teachers. 6 A considerable proportion of education majors in the B&B:93/03 sample did not complete the steps generally required (beyond a bachelor's degree) for teaching, at least for teaching in public schools. As described in the section on preparation for teaching, once they completed all the preparation steps, graduates were extremely likely to then become teachers. Only among education majors was the proportion of graduates who were teaching in 2003 greater than the proportion of graduates who had taught only in the past (table 2). For example, 5 percent of science, mathematics, or engineering majors were teaching in 2003, and 6 percent had taught but were no longer teaching in 2003. Among graduates who majored in other fields, including arts and humanities, health, and social or behavioral science, the proportion of teachers who had left teaching by 2003 was not measurably different from the proportion who were currently teaching in 2003. These findings suggest lower attrition rates from teaching among education majors than among majors in other fields."}, {"section_title": "College Entrance Examination Scores", "text": "In their efforts to improve student achievement, experts and policymakers have called for improvements in teachers' training and investigated ways to attract more high-achieving college graduates to teaching (Holmes Group 1986;NCTAF 2003; National Commission on Excellence in Education 1983). Some research has found that teachers with stronger academic skills, and in particular verbal ability, are more effective at teaching (Ehrenberg and Brewer 1995;Wayne and Youngs 2003). In the absence of a standardized achievement test commonly taken by all college graduates, college applicants' scores on college entrance examinations, also called CEE scores (i.e., the Scholastic Aptitude Test or American College Testing test [SAT or ACT]), are sometimes used to measure the academic skills of teachers and compare them with other graduates' skills. Because CEEs are taken mostly before applying to college, the scores have the drawback of failing to capture skills gained while earning the bachelor's degree and from any subsequent postsecondary education or labor force experience. An advantage of these scores, however, is that they provide an objective measure of performance on a scale common to all test takers, albeit prior to college. Research in the last couple of decades has found that teachers tend to have lower CEE or cognitive test scores than college graduates who entered other professions (Henke et al. 2005;Murnane et al. 1991;Schlechty and Vance 1983;Weaver 1983). Another analysis included selectivity of college as well as test scores and concluded that college graduates who became teachers had somewhat weaker academic backgrounds than their peers who entered other professions (National Science Board 2006). However, teachers in elementary schools have lower scores than those in high (or combined) schools, on average (Henke, Geis, and Giambattista 1996). In addition, high school teachers are more likely to hold master's degrees than elementary school teachers (Lewis et al. 1999). Thus, the general finding about lower skills and achievement among teachers versus other professionals may be an oversimplification that does not apply, or applies to a lesser degree, to high school teachers (see also Guarino, Santibanez, and Daley 2006). Consistent with prior findings for graduates in different professions, 16 percent of 1992-93 graduates with CEE scores in the lowest 25 percent of the distribution were teaching in 2003, compared with 10 percent of those in the middle half of the score distribution and 6 percent of those with the highest scores (figure 4 and table 2). The likelihood that a bachelor's degree recipient had never taught also increased from 75 percent in the low-score group to 86 percent in the high-score group."}, {"section_title": "Grade Point Average in College", "text": "A second measure of teachers' academic qualifications is their grade point average (GPA) in college courses. This measure has the advantages of being closer in time to their teaching jobs (than CEE scores) and reflecting skills gained in college. The weakness of course grades, however, is that they are assigned without reference to an objective standard, either within or among institutions. Similar student performance could receive different grades from different professors and even courses classified as similar can have widely varying content. Grades also vary by major field of study, which is itself related to the likelihood of pursuing teaching, as described above (Henke, Geis, and Giambattista 1996). In contrast to their CEE scores, teachers generally have similar or higher average grades than other college graduates (Book, Freeman, and Brousseau 1985;Frankel and Stowe 1990;Gray et al. 1993;Henke, Geis, and Giambattista 1996). Consistent with these earlier findings, the grades that graduates in this cohort earned while in college also bore a positive relationship to their likelihood of teaching in 2003 (in contrast to CEE scores, which had an inverse relationship). As college GPA increased, graduates were more likely to be teachers (figure 4 and table 2). For example, while 6 percent of graduates whose GPA was lower than 2.25 were currently teaching, 11−12 percent of those with GPAs of 2.75 or higher were teaching. The proportion who had taught only in the past also increased as GPA reached higher levels, while the proportion who had never taught decreased."}, {"section_title": "Highest Degree Attained", "text": "In nearly every school district, salary schedules are based on teachers' years of service and accumulated education, measured either as degrees attained or postsecondary credits earned, or a combination of the two. Approximately one-half of teachers had master's degrees in 2002 (U.S.  Among 1992-93 graduates whose highest earned degree by 2003 was a master's, 34 percent had taught at some point by 2003, along with 47 percent of those who had attained a post-baccalaureate certificate (figure 5 and table 2). In contrast, 16 percent of graduates who did not go beyond a bachelor's and 10 percent of those who earned a credential more advanced than a master's degree had taught by 2003. Approximately 1 in 3 graduates (35 percent) with postbaccalaureate certificates held teaching jobs when interviewed in 2003."}, {"section_title": "Characteristics of Current or Most Recent Teaching Job", "text": "Teachers with certain characteristics are more likely to leave the profession, a recent literature review found (Guarino, Santibanez, and Daley 2006). Teachers who are White, female, new to teaching, or near retirement age tend to be more likely to leave teaching than other teachers. The same is true for those who have higher test scores or teach mathematics or science. The first part of this section looks at whether current teachers differed from those who had left teaching by 2003 on a range of job and school characteristics. For former teachers, the characteristics apply to their most recent teaching job. Table 3 shows the percentage distributions of current and former teachers by various characteristics of the schools in which they taught and their teaching jobs. (Categories sum to 100 vertically for each characteristic.) Graduates who were teaching in 2003 were more likely than graduates who were former teachers to work at a public school. Among graduates who were teaching in 2003, 91 percent were teaching in a public school, compared with 79 percent of former teachers whose most recent teaching job had been in a public school (figure 6). Nearly two-thirds (64 percent) of current teachers worked in elementary schools, versus 30 percent at secondary schools. However, the ratio of elementary to secondary school teachers was greater among current teachers than former teachers, suggesting that secondary school teachers left teaching at higher rates. This finding appears consistent with elementary school teachers' greater tendency (compared to secondary teachers) to plan to stay in the profession until retirement, discussed in the section on future career plans. On other characteristics, differences were generally not found between current and former teachers. For both groups, between 30 and 35 percent taught in a central city, and 35−39 percent taught in urban fringe (suburban) areas or large towns, with the remainder teaching in small towns or rural areas. In addition, 17-18 percent of each group were or had been teaching at schools with less than 5 percent minority enrollment, and 29−31 percent were at schools with 50 percent or more minority students. About 35 percent of current teachers reported their main assignment field as general elementary, and 18 percent taught science or mathematics (figure 7). Each of the other main assignment fields accounted for 11 percent or less of the distribution by main field. Significant differences were not found between the proportions of current and former teachers in the various 1 Elementary schools provide instruction in some grade lower than 7th and no grade higher than 8th. Secondary schools provide instruction in no grade lower than 7th. Combined schools provide instruction in some grade lower than 7th and some grade higher than 8th. main assignment fields, with one exception: 6 percent of former teachers taught mainly business/vocational courses, compared with 2 percent of current teachers."}, {"section_title": "Becoming a Prepared Teacher", "text": "Graduates count as \"prepared to teach\" in this report if they completed a student teaching assignment or earned a teaching certificate, or both (student teaching is usually one of the last steps completed in meeting several requirements for certification). Academic characteristics positively associated with preparing to be and becoming a teacher, shown in the last segment of the pipeline, included having earned a bachelor's degree before the 1992-93 degree, earning the latter degree from a public non-doctorate-granting institution, and having majored in education as an undergraduate. Graduates with these characteristics were more likely than their  Other experiences in college (and before, for college entrance exams) were also predictors of whether graduates became prepared teachers. Graduates with lower CEE scores were more likely to prepare and teach by 2003, for example. On the other hand, those who earned relatively high grades in college were also more likely than others to have completed preparation and taught by 2003. Pre-degree participation in teaching-related activities was related to preparation and teaching status by 2003. As one example, 66 percent of graduates who had either taught or trained to teach before completing the 1992-93 degree had completed preparation and taught by 2003, and another 26 percent had taught but without completing training (table 6). Many fewer, about 14 percent, of those who had neither taught nor trained to teach before their 1992-93 degree had completed preparation and taught 10 years later.\nGraduates count as \"prepared to teach\" in this report if they completed a student teaching assignment or earned a teaching certificate, or both (student teaching is usually one of the last steps completed in meeting several requirements for certification). Academic characteristics positively associated with preparing to be and becoming a teacher, shown in the last segment of the pipeline, included having earned a bachelor's degree before the 1992-93 degree, earning the latter degree from a public non-doctorate-granting institution, and having majored in education as an undergraduate. Graduates with these characteristics were more likely than their counterparts in other categories to have taken preparation steps and to have taught by 2003 (table  6). Other experiences in college (and before, for college entrance exams) were also predictors of whether graduates became prepared teachers. Graduates with lower CEE scores were more likely to prepare and teach by 2003, for example. On the other hand, those who earned relatively high grades in college were also more likely than others to have completed preparation and taught by 2003. Pre-degree participation in teaching-related activities was related to preparation and teaching status by 2003. As one example, 66 percent of graduates who had either taught or trained to teach before completing the 1992-93 degree had completed preparation and taught by 2003, and another 26 percent had taught but without completing training (table 6). Many fewer, about 14 percent, of those who had neither taught nor trained to teach before their 1992-93 degree had completed preparation and taught 10 years later."}, {"section_title": "Graduates Who Left the Teacher Pipeline", "text": "As discussed elsewhere regarding graduates who had no teaching experience, males and Asians/Pacific Islanders in this cohort were less likely than females and those from other racial/ethnic groups to have entered the teacher pipeline (table 6). In addition, 47 percent of graduates who had attained an associate's degree (or no degree) before the 1992-93 degree had not considered teaching (i.e., had no pipeline entry), compared with 38 percent of those who already had a bachelor's or higher degree before 1992-93 (table 6). Graduates who had majored in business or management; health; or science, mathematics, or engineering were, in general, more likely than those with other majors to have not entered the teacher pipeline. At least 55 percent of majors in those three categories took no steps to enter the teacher pipeline, compared with 8 percent of education majors. As with the teaching experience data discussed in the first section of this report, graduates with low CEE scores were more likely than those with mid-range or high scores to enter the teacher pipeline. 8 Similarly, higher grades in college were associated with generally lower rates of considering or applying to teach. However, graduates were more likely to prepare and teach if they had earned higher grades in college. For both test scores and grades, patterns can be seen more clearly with the rates at which graduates prepared and became teachers, discussed in the next section. "}, {"section_title": "Summary and Conclusion", "text": "In 2003, 20 percent of 1992-93 bachelor's degree recipients had taught in an elementary or secondary school, with 11 percent teaching when they were interviewed in 2003 and another 9 percent having taught at some point in the past. Women in the cohort were more than twice as likely as men to report in 2003 that they were currently teaching and about twice as likely as men to have taught previously. Graduates who were older than age 30 when they completed their 1993 bachelor's degree were also in general more likely than others to be teaching in 2003, as were White, Black, and Hispanic graduates compared with Asian/Pacific Islander graduates. Among the academic characteristics associated with a propensity to teach were the types of undergraduate institutions attended and undergraduate major field of study. For example, graduates of public 4-year nondoctoral institutions were more likely than graduates from other institutions to be teaching in 2003. Education majors were also more likely than those from other disciplines to be teachers in 2003-and to have taught only in the past. Nevertheless, 29 percent of education majors had no teaching experience by 2003. Several other academic measures were related to the likelihood that college graduates later joined the teaching profession. First, graduates' CEE scores were inversely related to their likelihood of being teachers in 2003. On the other hand, those with higher college GPAs were more likely than those with lower grades to be currently teaching. Graduates whose highest earned degree in 2003 was a master's or a post-baccalaureate certificate became teachers in larger proportions than those who attained bachelor's degrees or graduate degrees beyond a master's. In general, teachers expressed satisfaction with the profession. Nearly all graduates who were teaching in 2003 said they were satisfied with teaching overall (93 percent). Teachers were more satisfied with the learning environment at their school than with aspects such as parent support, pay, and students' motivation to learn. Ninety percent of teachers reported that they would choose teaching again, and two-thirds planned to remain a teacher for the rest of their working life. Among teachers who were not teaching in 2003, females often left for familyrelated reasons (29 percent), while males often left for a job outside of the education field (32 percent). Nearly one-half of all 1992-93 bachelor's degree recipients reported that they had never considered teaching nor taken any steps to prepare for the profession. Another nearly one-third had either considered teaching or applied for a teaching job at some point in the previous decade but not advanced further in the teacher supply pipeline. The most commonly cited reasons for not pursuing teaching were lack of interest, having another job already, and wanting higher pay. Males were more likely than females to have sought higher pay, to have had another job already, and to have received an offer for a job they considered better than teaching. Sixteen percent of the cohort had both prepared to teach and taught. Graduates with the following academic characteristics were more likely to prepare for and become a teacher: having earned another bachelor's degree before the 1992-93 degree, earning the latter degree from a public non-doctorate-granting institution, having an undergraduate major in education, and having a relatively high grade point average from college and relatively low CEE scores. About 4 in 5 of this cohort of college graduates neither student taught nor earned teaching certificates by 2003. About 17 percent (among the remaining 20 percent) earned teaching certificates. Graduates who were relatively likely to hold certification included females, Whites and Blacks (versus Asians/Pacific Islanders), those who graduated from public non-doctorategranting postsecondary institutions, and those who majored in education. Public Agenda. 2005 1994, 1997, and 2003 surveys on the percentage of students who were of minority racial/ethnic backgrounds at the most recent school in which the respondent taught."}, {"section_title": "Reason did not apply for teaching position", "text": "Respondents who did not apply for a teaching position were asked, \"What are the reasons you did not apply for a teaching position? (Please check all that apply.)\"  1994, 1997, and 2003 interviews. Respondents who had taught were categorized by whether they had teacher certification, had done student teaching, or lacked training. Those who had not taught were categorized by whether they had certification, had student taught, applied for teaching jobs, considered teaching, or had no interest in teaching/took no action to prepare. Table 6 in this report used the five categories listed on the left in the first grouping below, while table 7 used the three categories in the latter grouping below. (Numbers in parentheses are the value codes for B3PIPLIN.)"}, {"section_title": "First grouping of categories:", "text": "No entry into pipeline No interest in teaching or took no action to prepare (0) Considered or applied at some point Combined these categories: Considered teaching at other time (1); Was considering at time of the interview (2); Had applied to teach ( Appendix A-Glossary"}, {"section_title": "DAS variable", "text": "A-5"}, {"section_title": "Teacher pipeline status at 2003 interview-continued B3PIPLIN", "text": "Second grouping of categories: Not prepared (neither student Combined these categories: No interest in teaching or took no taught nor certified) action to prepare (0); Considered teaching at some other time (1); Was considering at time of the interview (2); Had applied to teach (3); and Had taught without training (4) Student taught Student taught, did not teach, no certificate; or Student taught, taught, no certificate (5 or 6) Certified Combined these categories: Certificate, did not teach; and Certificate, taught (7 or 8)"}, {"section_title": "Would go into teaching again B3TCHAGN", "text": "For respondents who were currently teaching, this variable indicates whether they would choose teaching as a career if they had the decision to make over again."}, {"section_title": "How long expect to stay in teaching B3TCHDR", "text": "For respondents who were currently teaching, this variable indicates how long they think they will stay in teaching. For the rest of the time working Until a nonteaching job in education becomes available Until something better comes along Other"}, {"section_title": "Teaching status by 2003 B3TCHST", "text": "This derived variable indicates whether respondents were currently teaching, had taught previously, or had never taught by the 2003 interview."}, {"section_title": "Teaching", "text": "Had taught but not teaching Never taught"}, {"section_title": "Satisfaction: student motivation B3TSATA", "text": "For respondents who had taught since 1997 or were currently teaching, this variable indicates whether respondents were satisfied with student motivation to learn in their current or most recent teaching job (yes or no)."}, {"section_title": "Satisfaction: school learning environment B3TSATB", "text": "For respondents who had taught since 1997 or were currently teaching, this variable indicates whether respondents were satisfied with the school's learning environment in their current or most recent teaching job (yes or no)."}, {"section_title": "Satisfaction: student discipline B3TSATC", "text": "For respondents who had taught since 1997 or were currently teaching, this variable indicates whether respondents were satisfied with student discipline in their current or most recent teaching job (yes or no). All estimates in this report are weighted to compensate for unequal probability of selection into the B&B sample and to adjust for nonresponse. Two weights were developed. Crosssectional weights were constructed for analyzing respondents to B&B:93/03. In addition, a panel (longitudinal) weight was constructed for analyzing those students who responded to all four surveys: NPSAS:93 (computer-assisted telephone interview component) and the 1994, 1997, and 2003 B&B interviews. The weights for the B&B:93/03 respondents were constructed by applying a series of adjustments to the 1994 B&B base weight. Specifically, adjustments were made to account for subsampling of nonrespondents from 1997, for sample members not located, for refusals among those who were located, and for types of nonresponse other than refusals among those who were located and did not refuse. Construction of the panel weight (WTC00), to be used for analyzing those who responded to all four surveys, included an additional adjustment for nonresponse: for the B&B:93/03 respondents who did not respond to all three of the previous surveys. The weight variable used for this report is WTC00. For more information on weighting, consult chapter 6, \"Weighting and Variance Estimation,\" of the B&B:93/03 methodology report (Wine et al. 2005)."}, {"section_title": "Quality of Estimates", "text": "Survey weights are computed with the goal of removing any bias that might result due to differential nonresponse and undercoverage. In order to measure the efficacy of bias-reducing adjustments, a series of analyses were conducted at the item and record levels. In the subsequent sections highlights of these analyses are summarized."}, {"section_title": "Unit Response Rates and Bias Analysis", "text": "For the approximately 10,400 sample students who were still eligible for B&B, the unweighted response rate was 86.3 percent, and the weighted response rate was 83.4 percent. For some items, the weighted response rate at the national level was also less than 85 percent. The effects of any potential bias due to nonresponse can influence overall data quality with greater proportions of missing information. Consequently, nonresponse bias analyses were conducted at the student and item levels when the corresponding weighted response rates were below 85 percent."}, {"section_title": "Appendix B-Technical Notes and Methodology", "text": ""}, {"section_title": "B-4", "text": "The bias in an estimated mean based on respondents, R y , is the difference between this estimate and the target parameter, μ, which is the mean that would result if a complete census of the target population was conducted and all units responded. This bias can be expressed as follows: However, for variables that are available from the frame and base year (NPSAS:93) respondents, μ can be estimated by μ without sampling error, in which case the bias in R y can then be estimated by: Moreover, an estimate of the population mean based on respondents and nonrespondents can be obtained by: whereη is the weighted unit nonresponse rate, based on weights prior to nonresponse adjustment. Consequently, the bias in R y can then be estimated by: That is, the estimate of the nonresponse bias is the difference between the mean for respondents and nonrespondents multiplied by the weighted nonresponse rate, using the student base weight prior to nonresponse adjustment."}, {"section_title": "Student-Level Nonresponse Bias Analysis", "text": "A student respondent is defined as any sample member who is determined to be eligible for the study and has valid data for the selected set of analytical variables. As noted earlier, the unweighted student response rate was 86.3 percent, and the weighted response rate was 83.4 percent. A nonresponse bias analysis was conducted as a part of the nonresponse adjustment for the analysis weight. The nonresponse bias was estimated for the variables known for both respondents and nonrespondents within each institution type. These variables included the following: • Age in the base year (NPSAS:93), • Race/ethnicity, • Gender, • U.S. citizenship status, • Attendance status in the base year, including the newly imputed values, derived variables (created by combining information from two or more interview variables) were constructed. In the final step, selected derived variables with remaining missing cases were imputed again, using the procedures described below. Table  B-1 lists the two variables used in this report (both derived) that had weighted response weights lower than 85 percent; and table B-2 lists the variables used in this report that were imputed and shows the percentage of cases imputed for each variable. Sequential hot deck imputation, a common procedure for managing item nonresponse, uses respondent data as donors to provide surrogate values for records with missing data. In sequential hot deck imputation, imputation classes are defined, generally consisting of a crossclassification of covariates, and then missing values are replaced sequentially from a single pass through the data within the imputation classes. A related procedure, weighted sequential hot deck imputation, takes into account the unequal probabilities of selection into the original sample by using the sampling weights to specify the expected number of times a particular respondent's answer will be used to replace a missing item. The expected selection frequencies are specified such that, over repeated applications of the algorithm, the expected value of the weighted distribution of the imputed values will equal in expectation, within imputation class, the weighted distribution of the reported answers. Weighted sequential hot deck imputation was selected for B&B:93/03 in part because it has the advantage of controlling the number of times a respondent record can be used for imputation and gives each respondent record the chance to be selected for use as a hot deck donor. To implement the procedure, imputation classes and sorting variables relevant to each item being imputed were defined. If more than one sorting variable was used, a serpentine sort was performed in which the direction of the sort (ascending or descending) changed each time the value of the previous sorting variable changed. The serpentine sort minimized the change in student characteristics every time one of the sorting variables changed its value. Imputation classes for the B&B:93/03 interview variables, and some of the derived variables, were developed using a Chi-Square Automatic Interaction Detector (CHAID) analysis where only respondent data were modeled (Kass 1980). The CHAID segmentation process first divided the data into groups based on categories of the most significant predictor of the item being imputed, and then split each of the groups into smaller subgroups based on the other predictor variables. The CHAID process also merged categories for variables found not to be significantly different. This splitting and merging process continued until no additional statistically significant predictors were found. Imputation classes for B&B:93/03 were then defined from the final CHAID segments. se where E 1 and E 2 are the estimates to be compared and se 1 and se 2 are their corresponding standard errors. This formula is valid only for independent estimates. When estimates are not independent, a covariance term must be added to the formula: where r is the correlation between the two estimates. 3 This formula is used when comparing two percentages from a distribution that adds to 100. If the comparison is between the mean of a subgroup and the mean of the total group, the following formula is used: where p is the proportion of the total group contained in the subgroup. 4 The estimates, standard errors, and correlations can all be obtained from the DAS. There are hazards in reporting statistical tests for each comparison. First, comparisons based on large t statistics may appear to merit special attention. This can be misleading since the magnitude of the t statistic is related not only to the observed differences in means or percentages but also to the number of respondents in the specific categories used for comparison. Hence, a B-12 small difference compared across a large number of respondents would produce a large t statistic. A second hazard in reporting statistical tests is the possibility that one can report a \"false positive\" or Type I error. In the case of a t statistic, this false positive would result when a difference measured with a particular sample showed a statistically significant difference when there is no difference in the underlying population. Statistical tests are designed to control this type of error, denoted by alpha. The alpha level of .05 selected for findings in this report indicates that a difference of a certain magnitude or larger would be produced no more than one time out of twenty when there was no actual difference between the quantities in the underlying population. When we test hypotheses that show t values at the .05 level or smaller, we treat this finding as rejecting the null hypothesis that there is no difference between the two quantities. Failing to detect a difference, however, does not necessarily imply the values are the same or equivalent. In addition, some comparisons warrant exercising additional caution. When there are significant results not indicated by any hypothesis being tested or when we test a large number of comparisons in a table, Type I errors cannot be ignored. For example, when making paired comparisons among different levels of income, the probability of a Type I error for these comparisons taken as a group is larger than the probability for a single comparison. When the either of the two situations described in the previous paragraph was encountered in this report, comparisons were made when p < .05/k for a particular pairwise comparison, where that comparison was one of k tests within a family. This guarantees both that the individual comparison would have p < .05 and that for k comparisons within a family of possible comparisons, the significance level for all the comparisons will sum to p < .05. 5 For example, in a comparison of males and females, only one comparison is possible (males versus females). In this family, k=1, and the comparison can be evaluated without adjusting the significance level. When students are divided into four racial/ethnic groups (as in the tables in this report) and all possible comparisons are made, then k=6 and the significance level of each test must be p < .05/10, or p < .005. The formula for calculating family size (k) is as follows:    C-5   Table C-3.-Standard errors for table 3 and figures 6 and 7: Among 1992-93 bachelor's degree recipients  Table C-3.-who were current or former teachers, percentage distributions by characteristics of current  Table C- C-6   Table C-4.-Standard errors for table 4 and C-7   Table C-4.-Standard errors for table 4 and C-8   Table C-4.-Standard errors for table 4 and   Length of time expect to stay in teaching   Tables   C-18   Table C-9.-Standard errors for figure C and figure 8: Among 1992-93 bachelor's degree recipients  Table C-9.-who were teaching in 2003, percentages who were satisfied with teaching overall and  Table C "}, {"section_title": "Appendix C-Standard Error", "text": ""}]