[{"section_title": "Introduction", "text": "Inflammatory processes have been implicated in promoting and resisting degenerative changes in the aging brain. In Alzheimer's disease (AD), neuroinflammation is associated with the classical pathologic hallmarks of the disease: amyloid plaques and neurofibrillary tangles (Akiyama, 2000; Heneka et al., 2015; McGeer and McGeer, 2010) . In healthy older adults, peripheral inflammation has been related to cognitive decline and to greater structural change (Alley et al., 2008; Teunissen et al., 2003) . In middle-aged adults, chronic peripheral inflammation correlates with higher incidence of dementia (Schmidt et al., 2002) .\nThere is an intriguing overlap between genetic and environmental factors that contribute to inflammation and factors that contribute to dementia. Several of the AD-risk variants discovered in genome wide association studies (GWAS) are implicated in immune reactions and inflammatory processes (Hollingworth et al., 2011; Raz et al., 2005) .\nMetabolic risk includes factors such as obesity, high blood pressure, dyslipidemia, and insulin resistance (Alberti et al., 2006) . These factors are consistently associated with chronic inflammation and with higher risk of dementia (Farooqui et al., 2011; Nation et al., 2015; St-Onge et al., 2009; van Himbergen et al., 2012) . In older adults, some metabolic factors are associated with measurable brain tissue deficits in the temporal and frontal lobes, the cingulate gyrus, hippocampus, and basal ganglia (Gustafson et al., 2004; Pannacciulli et al., 2006; Raji et al., 2010; Taki et al., 2008) . Among these regions are those affected most by atrophy as AD progresses (Ch etelat et al., 2010; McDonald et al., 2009; Whitwell, 2010) .\nIn contrast, physical activity is associated with lower peripheral inflammation (Bruunsgaard, 2005; Gleeson et al., 2011; Mendham et al., 2011) , preserved cognition (Kramer and Erickson, 2007; Lautenschlager et al., 2008; Van Gelder et al., 2004) and greater hippocampal volume (Marsland et al., 2015; Wagner et al., 2015) . Exercise may protect cognition in many ways (Kennedy et al., 2016) . For instance, physical activity: (1) promotes weight loss, which normalizes metabolic risk factors for dementia, (2) may induce the release of trophic factors that independently protect the brain (Campos et al., 2016) , and (3) helps modulate inflammatory processes (Braskie et al., 2014; Ford, 2002; Gleeson et al., 2011; Pedersen, 2011) .\nBecause inflammation plays a key role in brain aging, we hypothesized that measures of inflammation would mediate the effect of genetic risk, metabolic risk, and physical exercise on brain health in older, cognitively intact adults. We analyzed blood levels of C-reactive protein (CRP), which is elevated in AD patients with more severe cognitive decline (Gong et al., 2015) . CRP is associated with the release of several inflammatory mediators such as tumor necrosis factor alpha (TNF-α), and interleukin-1 and -6 (IL-1 and IL-6; (Rochemonteix et al., 1993) . In addition, CRP increases blood-brain-barrier permeability (Hsuchou et al., 2012) and interacts with cells involved in brain immune surveillance . Finally, CRP is directly influenced by metabolic risk factors (Ebrahimi et al., 2016; Ridker, 2001) . Overall, circulating CRP is a relevant marker for chronic peripheral inflammation and may induce or reflect conditions leading to neuroinflammatory processes in the brain.\nWe used structural equation models (SEM) to assess whether inflammation mediates an effect between brain structure in regions relevant to both AD and aging, and modulators thought to promote cognitive decline, specifically, genetic risk, metabolic risk, and physical activity. This is the first study to evaluate how all these disease risk factors affect brain structure and how they interact, in a unified statistical model."}, {"section_title": "Methods", "text": ""}, {"section_title": "The Cardiovascular Health Study Cohort", "text": "The study participants were selected from the Cardiovascular Health Study Cohort (CHS; https://chs-nhlbi.org), a 9-year observational study of individuals aged 65 and older who were cognitively intact at baseline. CHS was initiated in 1991 to identify factors associated with coronary heart disease and stroke (Fried et al., 1991) . We examined year-9 high resolution MRI and baseline measures of peripheral inflammation, cardiovascular health, and physical activity ( Table 1) . The MR scans acquired at the study baseline were not comparable to the follow-up scans and were only used to visually detect the presence of infarcts. A physician performed this inspection at the time of participant inclusion in CHS."}, {"section_title": "Participant selection", "text": "Presymptomatic amyloidosis can occur years before onset of clinical symptoms (Braskie et al., 2010; Johnson et al., 2012; Sabuncu, 2011) and could cause specific neurodegenerative and homeostatic changes not easily discerned from environment or age-related homeostatic imbalance. To limit the level of measured inflammation likely to arise from AD neuropathology, we focused our analyses on cognitively healthy older individuals, and excluded those who developed AD incidentally, by year 9 of the study when the MRI scans we used were acquired. This helped us to reduce variability in chronic inflammation that is unrelated to the metabolic risk and physical activity on which we focused here.\nMild cognitive impairment (MCI) was classified following the CHS-CS diagnostic criteria (Lopez et al., 2003a) . A MCI amnestic-type diagnosis, required participants to have impairments (defined as performance >1.5 standard deviations below age/education appropriate means) in delayed recall of verbal or non-verbal material (or both); the cognitive deficits also must represent a decline from a previous level of functioning. Cognitive functions must otherwise fall within normal limits. A MCI-multiple cognitive deficits-type diagnosis required impairments in at least one cognitive domain other than memory (i.e., two or more tests abnormal), or one abnormal test (which could be a memory test) in at least two separate domains, without sufficient severity or loss of instrumental activities of daily living (IADLs) to constitute dementia. These cognitive deficits may or may not affect IADLs, but must represent a decline from a previous level of functioning. A diagnosis of dementia was based on a deficit in performance in two or more cognitive domains that was of sufficient severity to affect activities of daily living, with a history of normal intellectual function before the onset of cognitive abnormalities; a memory deficit was not required for the diagnosis of dementia (Lopez et al., 2003b) .\nParticipants were classified by an Adjudication Committee comprised of experts in dementia, who first classified participants as demented, MCI, or cognitively intact, and then decided upon the specific type of dementia or MCI. The Adjudication Committee had access to the historical CHS cognitive test scores from 1989 to 1999, and the neuropsychological battery from 1998 to 99, as well as depression measures, vision and hearing testing, history of alcohol intake, vital status, date of death, history of hospitalizations, medications to treat dementia, MRI scans , the neurological exam, the NPI obtained in 1998-99, and hospital records. For AD, this classification relies on the criteria of the National Institute of Neurological and Communicative Disorders and Stroke and the Alzheimer's Disease and Related Disorders Association (NINCDS-ADRDA) (McKhann et al., 1984) which do not rely on the use of a biomarker of amyloid pathology (amyloid PET or CSF Time Physical Activities questionnaire (Taylor et al., 1978) . b Genetic risk score ¼ log 10 (OR ALZ ) x number of minor alleles; see Genetic risk factors and Table 2 for a list of genetic variants included in this measure.\nF. Corlier et al. NeuroImage 172 (2018) 118-129 dosage). For this reason a classification as cognitively intact, does not rule out possible prodromal pathology in control participants. However, the long follow-up and exclusion of incident converters places the time of blood draw at an early stage of any undetected pathology, if present. We excluded participants who had a history of stroke, an MRIdetectable infarct, diabetes, or cognitive impairment. We analyzed the relationship between regional brain structure (see Brain regions of interest) and CRP in 335 white, cognitively intact participants who had blood CRP measures at year 1 and MRI at year 9. For our structural equation models, we evaluated a subset of 226 older adults who had complete observations for all the variables evaluated (see descriptive statistics in Table 1 ). These variables included the year-9 T1-weighted structural MRI, demographic covariates, blood markers, genetic risk variants (see Genetic risk factors), and measures of physical activity (see Physical activity). All participants signed a written informed consent form."}, {"section_title": "Blood markers", "text": "Blood sample collection, preparation, dosage, and quality assessment are described in previous publications (Cushman et al., 1995; Fried et al., 1991) . In the present study we used the following markers: fasting serum insulin (ins), plasma triglycerides (tri), serum C-reactive protein (CRP) and interleukin 6 (IL-6). CRP levels may change rapidly in the context of an acute reaction but typically return to normal within hours (Volanakis, 2001) . We verified longitudinal stability of CRP by comparing the subset of measures available at years 5 and 9 of the follow-up to the analyzed baseline measure (year-1). Our focus on baseline measures of inflammation, cardiovascular risk, and physical activity allowed us to investigate possible long-term effects of these measures on brain structure. We excluded CRP measures for five participants whose values were significantly higher than the rest of the group (>5 SD)."}, {"section_title": "Physical activity", "text": "Physical activity intensity was calculated based on the participants' self-reported physical activity in the 2 weeks prior to baseline examination as assessed by the modified Minnesota Leisure Time Physical Activities questionnaire. This questionnaire details the duration and frequency of 15 different common physical activities (Taylor et al., 1978) . Physical activity intensity is based on the highest reported intensity in that time period, and is classified as none, low, medium, or high as previously described (Braskie et al., 2014) . \"Blocks walked\" is the number of blocks walked by the participant per week, based on the reported activity in the 2 weeks prior to the baseline examination. We verified the stability of reported physical activity by comparing baseline measures to reported physical activity at study years 9-10 in a subset of 321 participants who had that measure.\nWe performed quantile regressions by dividing the distribution of the number of blocks walked per week at inclusion and at years 9-10 of the follow-up into 6 quantiles and evaluated deviations from the linear regression confidence interval for each quantile."}, {"section_title": "Cardiovascular risk", "text": "Metabolic risk factors include obesity, elevated fasting glucose, insulin resistance, hypertension (Alberti et al., 2006) , and dyslipidemia (specifically elevated triglycerides and low levels of high density lipoprotein cholesterol). These are all major risk factors for developing microvascular disease (Hermans, 2007) , and AD (Kloppenborg et al., 2008; Sato and Morishita, 2013) . These same factors can also promote a \"pro-inflammatory\" state, as measured by elevated blood CRP levels (Alberti et al., 2006) . Pulse pressure-the difference between systolic and diastolic blood pressure-is an indicator of age-dependent arterial stiffness that also is amplified in patients with metabolic syndrome (Scuteri et al., 2004) . We included in our structural equation models certain measures that were associated with metabolic risk and were available in our dataset. Specifically, we included body mass index (BMI; a measure of obesity); fasting plasma triglycerides, and pulse pressure. We also included fasting serum insulin levels. Insulin resistance is marked by hyperinsulinemia in those with pre-or early-type 2 diabetes, and insulin may play a role in modulating AD neuropathological processes (Farris et al., 2003; Gasparini et al., 2001 )."}, {"section_title": "Genetic risk factors", "text": "Single nucleotide polymorphisms (SNPs) were genotyped using TaqMan Assays By Design (Applied Biosystems, Foster City, CA, USA). We selected the gene variants among the top 20 genetic risk variants for AD-based on the Alzgene database (Bertram et al., 2007) -that were also implicated in immune and inflammatory responses. These SNPs are listed in Table 2 . We computed a polygenic risk score based on these variants. First, we obtained the odds ratio (OR) per minor allele for developing late onset Alzheimer's disease (LOAD), using the Alzgene database summary for individuals of European descent, (Alzgene.org; accessed in August 2016). We computed a normalized specific genetic risk (GR, equation (1)) score to account for the protective effect of variants with odds ratio lower than one (i.e., lower prevalence of late onset AD among carriers). The polygenic risk score of an individual is computed as the sum of all genetic risk values considered. Apolipoprotein E (APOE) genotype was included separately in our structural equation model because of the strong established genetic risk of APOE4 for AD, accompanied by a demonstrated negative effect on peripheral CRP in some studies (Carvalho-Wells et al., 2012) .\n(1) GR ¼ log 10 (OR ALZ ) x number of minor alleles Genotypes were not available for the rare variant rs9394721 in TREM2, which is associated with higher prevalence of late onset AD with an effect size similar to APOE4 (Guerreiro et al., 2013; Jonsson et al., 2013) . Four variants within the CR1 gene were in high linkage disequilibrium with one another. To avoid including redundant effects in our polygenic score we included only the CR1 variant with the highest minor allele frequency. "}, {"section_title": "MRI acquisition and analysis", "text": "MRI scans from year 9 of the study were acquired at 4 different acquisition sites using comparable imaging protocols, on 1.5T General Electric Medical Systems scanning devices. The scanning protocol included a sagittal T1-weighted spoiled gradient-recalled whole-brain volumetric scan with TE/TR ¼ 5/35 msec, slice thickness ¼ 1.5 mm and 0 mm interslice gap. The acquisition matrix contained 256 Â 256 x 124 volumetric elements, with a reconstructed field of view of 240 Â 240 mm 2 . MRI segmentation was performed with the FreeSurfer image analysis suite (version 5.3), (http://surfer.nmr.mgh.harvard.edu/ ), executed using the default parameters. Details of the procedure are available in the software documentation Fischl et al., 1999) . Analysis steps included removing non-brain material from the images (Segonne et al., 2001) , transforming scans to Talairach space, segmentation of the subcortical white matter and deep gray matter structures (Fischl et al., 2002) , intensity normalization (Sled et al., 1998) , tessellation of the gray-white matter boundary with topology correction (Fischl et al., 2001; Segonne et al., 2007) , surface deformation following intensity gradients, surface inflation , registration to a spherical atlas, and parcellation of the cerebral cortex into units with respect to gyral and sulcal structure (Desikan et al., 2006) ."}, {"section_title": "Brain regions of interest", "text": "We examined associations between peripheral measures of inflammation at baseline of the study and the brain structural indices at year 9 including cortical thickness of nine cortical regions of interest (ROIs; listed below) and mean bilateral hippocampal volume. These regions were selected a priori for their vulnerability to AD (Baron et al., 2001; Sabuncu, 2011) , cognitive aging (Raz et al., 2005) , physical activity (Erickson et al., 2014) and inflammation (Marsland et al., 2015) . Some of these regions are also associated with genetic risk for AD (Baune et al., 2012; Sabuncu et al., 2012; Kohannim et al., 2012) . The regions included bilateral measures of the following: hippocampi, the anterior section of the cingulate cortex composed of the perigenual regions (labeled caudal and rostral anterior cingulate in FreeSurfer; ACC), the posterior cingulate cortex (PCC) and isthmus of the cingulate cortex (ICC), the precuneus (PRE), (Fig. 1a) the parahippocampal (PARA) and entorhinal cortex (ERC), the supramarginal gyrus (SM) and the caudal and rostral middle frontal gyri (CMF and RMF) (Fig. 1b) . We visually inspected the FreeSurfer parcellation results to identify global segmentation abnormalities including non-cortical tissue labeling, missing structures and movement artifacts. A second quality control step was performed by an independent operator, who was blind to all assay, genetic, and physical activity results, to ensure accurate labeling of gray-white matter boundaries for hippocampi and cortical regions of interest. The quality control for hippocampal segmentations was performed following the recommendations of the European Alzheimer's Disease Consortium and the Alzheimer's Disease Neuroimaging Initiative (EADC-ADNI) harmonized hippocampal protocol Frisoni et al., 2015) .\nWe excluded 6 participants whose segmentations failed globally (cortex and hippocampus). In those 262 participants having successful hippocampal segmentations in both hemispheres, left and right hippocampal volumes were not significantly different from one another (intraclass correlation coefficient ¼ 0.997 in the 262 participants without missing data). Therefore, in the 73 participants for whom hippocampal segmentations failed unilaterally, we substituted the non-failed unilateral hippocampal volume in place of the bilateral mean. For 8 participants, MRI segmentation passed quality control for cortical regions, but failed bilaterally for hippocampi."}, {"section_title": "Statistical analysis Multiple linear regressions", "text": "Before running the multiple regression analysis, hippocampal volume was corrected for head size and site variability by regressing out total intracranial volume (ICV) and site effects. Site effect also was regressed out of the cortical thickness values. We did not adjust for ICV when evaluating cortical thickness, as it is thought to be independent of head size (Barnes et al., 2010) .\nWe used multiple linear regressions to separately evaluate the relationship between each a priori selected bilateral FreeSurfer region and both serum CRP and IL-6 levels, covarying for age, sex, and education. We corrected for multiple comparisons using the false discovery rate (FDR) adjustment to control false positives to <5%."}, {"section_title": "Structural equation model", "text": "We used structural equation modeling (SEM) to further investigate promising effects identified through multiple linear regressions between serum CRP and Brain_structure a latent factor measuring the shared variance of cortical thickness in four regions (Fig. 2) : the PCC (where we found a significant association with serum CRP after correction for multiple comparisons) and ICC, PARA, and CMF (where we found nominally significant correlations with serum CRP). SEM allows us to investigate multiple relevant genetic and environmental contributions to CRP and brain structure simultaneously, while also modeling interactions among risk factors (Gefen et al., 2000; Tomarken and Waller, 2005) . Unlike multiple linear regressions, SEM allows us to account for the relationships among independent variables; it allows testing of the existence and correlation of latent factors, and by doing so reduces the effect of measurement error. This increases the overall reliability of the resulting estimates. Fig. 1 . FreeSurfer regions selected in our analysis. Slice A colors illustrate anterior (ACC), posterior (PCC), and isthmus (ICC) of the cingulate cortex, and precuneus (PRE). Slice B shows the hippocampus (HIPP), the parahippocampal gyrus (PARA), and entorhinal gyrus (ENT), the supramarginal gyrus (SM) and the middle frontal gyrus (*), which is divided into its rostral (RMF) and caudal (CMF) sections. Dashed lines indicate relationships that are not statistically significant (Z score < 1.96) but were taken into account in the overall fit indices. Brain_structure represents the latent process inferred by the additive inverse of cortical thickness in the regions identified through multiple regression (i.e., positive loadings on the Brain_structure latent variable indicate that a higher value for the independent variable is associated with thinner cortex). Metabolic_risk was derived from heart pulse pressure (PulseP), blood fasting insulin (ins) and triglycerides (tri), and body mass index (bmi). In the final model, PulseP was not included (see Model construction procedure in the Methods section); Physical_activity was derived from the number of blocks walked (blocks) and exercise intensity (exint). Edu: education (in years), APOE, Apolipoprotein E associated risk score for late onset Alzheimer's disease (see Table 2 ), GRS, genetic risk score obtained by cumulating the specific late onset AD -odds ratios related to single nucleotide polymorphisms in CR1 (rs6701713), MS4A4E and 6A (rs670139 and rs610932 respectively), CD33 (rs3865444), ABCA7 (rs3764650), EPHA1 (rs11767557), IL1a (rs1800587), IL1b (rs1143634), CLU (rs11136000), for individuals of European descent (Alzgene meta-analysis).\nWe assessed the extent to which the latent variable Metabolic_risk was associated with both baseline serum CRP and with year-9 Brain_structure. Metabolic_risk was derived from baseline values for pulse pressure (i.e., the difference between diastolic and systolic blood pressure), body-massindex (BMI; a measure of obesity), and fasting levels of plasma triglycerides (tri) and serum insulin (ins). We assessed the extent to which the latent variable Physical_activity modified Metabolic_risk, CRP, and Brain_structure. Physical_activity was inferred from the number of blocks walked per week in the 2 weeks prior to assessment, and the maximum physical activity level achieved in the week prior to baseline assessment using the modified Minnesota Leisure Time Physical Activities (Taylor et al., 1978) . Finally, we assessed the relationship of AD genetic risk to Brain_structure, CRP, and Metabolic_risk. We focused on genetic variants that have been shown both to be associated with AD risk and to be in or close to genes implicated in immune function or inflammation.\nOur model was implemented and tested in Onyx (Oertzenvon et al., 2014) , and duplicated in Rstudio (Version 0.99.447) using the lavaan package (version 0.5-20) (Rosseel, 2012) to calculate modification indices. To assess the fit quality of a model we used several different indicators. First, we used the χ 2 value of the comparison between the model-implied variance-covariance matrix and the raw data variance-covariance matrix, which permits the computation of an overall p-value for the model. To further account for model parsimony and sample size we computed (1) the root mean square error of approximation (RMSEA), (2) the standardized root mean square residual (SRMR), (3) the Tucker-Lewis index (TLI), and (4) the comparative fit index (CFI). We considered a model an acceptable fit when it respected the following thresholds: χ 2 p > .05 (meaning that the model-implied variance/covariance matrix is not different from the complete variance/covariance matrix from the raw data); RMSEA 0.05; SRMR 0.06; CFI ! 0.97; TLI ! 0.95 as recommended by (Schermelleh-Engel et al., 2003) . To obtain the most parsimonious model, we first constructed the model by adding all hypothesized relationships between variables, based on the past evidence and on our theoretical assumptions (Fig. 2a) , before observing the modification indices to account for potential omitted interactions (Fig. 2b) .\nIn 226 participants for whom all variables of interest were available, we used SEM to evaluate how physical activity, metabolic risk factors, genetic risk for AD and inflammation (measured as serum CRP) related to brain structure in brain regions identified as being significantly or nominally associated with peripheral CRP: PCC, ICC, PARA, CMF.\nOur initial model (Fig. 2a) had a reasonable fit quality RMSEA < 0.001; SRMR ¼ 0.047; CFI ¼ 1.005; TLI ¼ 1. However the high values of CFI (>1) and TLI suggested an over fitting and indicated that the influences of certain parameters in the model were redundant. We thus pruned the model as explained in Model construction procedure. Our final SEM (Fig. 2b) achieved a strong fit. The fit indices obtained for the model were as follows: RMSEA ¼ 0.004; SRMR ¼ 0.05; CFI ¼ 0.999; TLI ¼ 0.999. Factor loadings between variables are available in Fig. 2b and Table 4 .\nAs hypothesized, in our final SEM (Fig. 2b) , higher serum CRP levels were associated with thinner cortex (β ¼ 0.19 AE 0.094, p ¼ 0.043). Thinner cortex here was measured by the latent variable \"Brain_-structure \" constructed from the regions identified through multiple linear regression as being related to circulating CRP levels. Greater genetic risk as indicated by APOE genotype (β ¼ 0.26 AE 0.099, p ¼ 0.009) and a higher genetic risk score (GRS) (β ¼ 0.33 AE 0.094, p < 0.001) were likewise both significantly associated with greater values of \"Brain_-structure\" (thinner cortex). Greater Metabolic_risk (derived from body mass index, serum insulin and plasma triglyceride levels) was associated with higher serum CRP levels (β ¼ 0.20 AE 0.076, p ¼ 0.009). However, greater AD risk conferred by APOE genotype was associated with lower peripheral CRP (β ¼ À0.17 AE 0.064, p ¼ 0.019), consistent with previous reports (Yun et al., 2015) . Metabolic risk did not have a significant direct effect on Brain_structure. However, CRP mediated an indirect effect between Metabolic_risk and Brain_structure, (p ¼ 0.01; Table 5 ). In other words, higher Metabolic_risk was associated with higher peripheral CRP, which was in turn associated with greater Brain_structure (thinner cortex).\nPhysical activity did not significantly contribute to the measures of Brain_structure, Metabolic_risk, or CRP, in our model."}, {"section_title": "Model construction procedure", "text": "Once a complete theoretical model was obtained, including all hypothesized relationships between pairs of variables (Fig. 2a) , we used modification indices to arrive at the most parsimonious model that represents the best representation of relationships between the analyzed variables (Fig. 2b) . The major differences between the initial model and the final parsimonious model are the following: (1) The modification indices suggested a strong correlation between values of cortical thickness in the PCC and the ICC. This was a reasonable modification as these regions are adjacent to one another and part of the same gyrus. Therefore, they could be expected to share some characteristics. We thus added this relationship to our model in the form of a double-headed curved arrow in Fig. 2b. (2) Pulse pressure was initially grouped with the other metabolic risk factors but had a null contribution to the latent variable Metabolic_risk. This is consistent with past work indicating that metabolic syndrome was more closely associated with AD incidence when blood pressure was excluded from that variable (Razay et al., 2007) . The total removal of pulse pressure did not significantly affect the fit quality of the model. All other variables did significantly load on at least one other variable and were thus considered to explain a non-negligible part of total model variability, and kept in the final model. (3) The paths between remaining variables that did not significantly contribute to the model were iteratively removed one by one. At each modification step, the path whose removal would result in the smallest change in χ 2 was removed next. After each modification, the global model was fitted and the resulting χ 2 was tested against its previous value with the corresponding number of degrees of freedom (at α ¼ 0.05). We stopped the simplification process at the step before the difference in χ 2 values between the two models (with and without the tested modification) indicated a significant change in fit quality."}, {"section_title": "Mediation analysis", "text": "In the final model (Fig. 2b) , we examined mediation effects for relationships that occurred when any variable in the path diagram was significantly correlated with two others. Potential mediations were analyzed to determine whether systemic inflammation (measured through serum CRP) significantly mediated indirect effects on brain structure of (1) Metabolic_risk and (2) APOE.\nSEM software usually evaluates mediation effects through a method consisting of multiplying the correlation coefficients. Two disadvantages of such a procedure are (1) the absence of confidence intervals, which prevents the user from performing a formal test for the mediation effects, and (2) the absence of a decomposition of the overall effects into direct and indirect effects. On the other hand, the counterfactual methodbased on resampling of the population by bootstrapping -allows for the construction and testing of confidence intervals (Preacher et al., 2007; Zhao et al., 2010) . To evaluate possible mediation effects, we took advantage of the Onyx SEM software to export the generated values for the latent variables of our model in order to run a detailed mediation analysis separately, using the R package 'Mediation' (Tingley et al., 2014) which implements a bootstrap method to generate confidence intervals and p-values for each mediation effect decomposed into direct and indirect effects (Table 5) .\nThe mediation analysis was performed only for the relationships that were significant to the overall model fit (Fig. 2b) . Table 5 lists the mediations analyzed, a decomposition of each total effect into an average causal mediation effect (indirect effect), and an average direct effect (direct effect). Confidence intervals were obtained through a bootstrap resampling with 1000 simulations. The mediation analysis confirms a significant mediation of CRP between Metabolic_risk and Brain_structure (Indirect effect ¼ 0.077, p ¼ 0.01; Table 5 ). There was no significant direct effect of metabolic status on brain indices (Direct effect ¼ À0.015, The standardized partial correlation coefficient (partial β) and p-values for the partial correlation of CRP and IL-6 with brain measures were obtained controlling for the effect of age, sex, education, and APOE genotype. The FDR level of acceptable false positives was set to q < 5%. Bold type indicates a statistically significant result after FDR adjustment (over 20 comparisons). #Adjusted for ICV. *Indicates that the omnibus p-value (accounting for all covariates) was <0.05 (*) or <0.005(**). p ¼ 0.86, Table 5 ). The observed relationship between APOE genotype and cortical thickness would be underestimated if the mediation of CRP between APOE genotype and cortical thickness were not accounted for. This is because APOE genotype is negatively associated with CRP (β ¼ À0.17 AE 0.064, p ¼ 0.019, Table 4), while CRP is also negatively associated with cortical thickness (β ¼ 0.19 AE 0.094, p ¼ 0.043, Table 4 ). Together, there was a significant direct effect of 0.277 (p < 0.01) between APOE genotype and Brain_structure, and a significant indirect effect of À0.038 (p < 0.01) for the relationship between APOE genotype and Brain_structure mediated by CRP (Table 5) ."}, {"section_title": "Post-hoc analysis of physical activity and hippocampal volume", "text": "We did not find a significant relationship between physical activity and brain structure, although previous studies have found such an effect. To investigate whether this might be due to the regions included in the SEM (specifically, those that showed a significant relationship with serum CRP levels), we performed a multiple linear regression between physical activity intensity and hippocampal volume (a region that often shows exercise effects; Erickson et al., 2011) , covarying for age, sex, APOE genotype, and years of education. Hippocampal volume was adjusted for ICV and MRI acquisition site."}, {"section_title": "Results", "text": ""}, {"section_title": "Longitudinal stability of inflammatory markers", "text": "We evaluated the stability of CRP serum levels between baseline and year 5, and between baseline and year 9 (when MRI scans were acquired) in 348 and 346 participants, respectively, for whom CRP measures were available. We observed a moderate overall increase in CRP serum levels over time. CRP was highly correlated between year 1 and both year 5 (R 2 ¼ 0.05, p ¼ 1.6 Â 10"}, {"section_title": "À5", "text": ") and year 9 (R 2 ¼ 0.09, p ¼ 3.1 Â 10"}, {"section_title": "À9", "text": "). We also evaluated the longitudinal stability of exercise measures between baseline and year 9 of the study in 321 participants for whom both measures were available. We found that the number of blocks walked per week was consistent over time (R 2 ¼ 0.15, p < 1 Â 10"}, {"section_title": "À12", "text": ")."}, {"section_title": "Association between measures of inflammation and brain structure", "text": "We hypothesized that the year-9 cortical thickness and volume of the brain regions vulnerable to AD would be correlated with serum measures of peripheral low-level inflammation at baseline of the study. We evaluated two blood markers of peripheral inflammation: CRP and IL-6. We regressed these markers separately on each of 10 mean bilateral regions of interest in the brain (see Brain regions of interest), covarying for age, sex, education, and APOE genotype. After FDR correction for multiple comparisons, baseline serum CRP was significantly correlated with year-9 mean cortical thickness (Table 3) in the bilateral posterior cingulate cortex (PCC) (standardized partial correlation coefficient; partial β ¼ À0.19 AE 0.053, p ¼ 0.0005). Additionally, serum CRP showed a nominally significant association with mean bilateral cortical thickness in the isthmus of the cingulate cortex (ICC) (partial β ¼ À0.12 AE 0.053, p ¼ 0.021), parahippocampal cortex (PARA) (partial β ¼ À0.11 AE 0.052, p ¼ 0.035) and caudal middle frontal cortex (CMF) (partial β ¼ À0.11 AE 0.052, p ¼ 0.038). Year 9 CRP was not significantly correlated with year-9 PCC thickness (partial β ¼ À0.0008 AE 0.002, partial p ¼ 0.65, omnibus p ¼ 0.0009), covarying for age, sex, education, and APOE genotype.\nIL-6 serum levels were not significantly correlated with the thickness of the 9 mean bilateral cortical regions of interest that we analyzed, or with mean bilateral hippocampal volume. Partial β-values ranged between À0.07 and 0.08."}, {"section_title": "Physical activity intensity and hippocampal volume", "text": "Hippocampal volume (adjusted for ICV) was associated with higher reported physical activity intensity when controlling for age, sex, education, and APOE genotype (partial β ¼ 0.102 AE 0.05, partial p ¼ 0.039, omnibus p ¼ 2.5 Â 10"}, {"section_title": "À13", "text": ")."}, {"section_title": "Discussion", "text": "We found that individuals with higher serum CRP at baseline were more likely to have thinner cortex in four AD-relevant regions, at study year 9. CRP measures were highly correlated between study time points, suggesting that despite a typically acute-phase expression pattern of CRP (Volanakis, 2001) , to some extent, serum levels remain stable over time. However, year 9 CRP did not correlate with year-9 cortical thickness in the PCC. This suggests that chronic, rather than acute, low-level inflammation is related to long-term differences in some brain regions that are vulnerable to subsequent AD-related neuropathology and to aging and inflammatory changes. In particular, tissue deficits in the posterior cingulate gyrus are commonly observed in early stages of AD (Ch etelat et al., 2010; McDonald et al., 2009; Whitwell, 2010) . Since our sample included only cognitively healthy individuals and we did not have measures of brain neuropathology, we cannot know to what extent these results may be specific to AD-related pathology or risk rather than relating more generally to normal aging. AD patients and cognitively intact, age-matched individuals have largely overlapping spatial patterns of atrophy although regional atrophy may be accelerated in patients (Fjell et al., 2014; Jiang et al., 2014) . In preclinical familial and sporadic AD, earliest signs of thinner cortex are evident in the posterior cingulate cortex, inferior parietal cortex (including the supramarginal gyrus) and the precuneus (Mak et al., 2017; Sabuncu, 2011) . We found that higher blood CRP levels were associated with thinner cortex in the posterior cingulate. This suggests that regardless of whether the underlying mechanisms are related to AD neuropathology, inflammation may create a vulnerability in brain regions relevant to AD, potentially accelerating the onset of clinical symptoms in those who have AD-related neuropathology. However, these effects may also be relevant to normal cognitive aging.\nPrior cross-sectional studies found that higher blood CRP levels were associated with smaller medial temporal lobe volumes (Bettcher et al., 2012) . Consistent with this, we found a trend level association between serum CRP and parahippocampal cortical thickness. It is important to note, however, that possibly CRP does not directly influence brain volume, but rather may be associated with another measure that does.\nWe found no significant associations between baseline serum IL-6 and year-9 cortical thickness or hippocampal volume. In contrast, others have found that higher blood IL-6 was associated concurrently with smaller hippocampal volume (Marsland et al., 2008) . We had no data on IL-6 levels at year 9 of the study when MR scans were performed, making a direct comparison with the prior study difficult. IL-6 has a dual role: higher levels are associated both with acute physical exercise (Petersen and Pedersen, 2006) , and with pro-inflammatory conditions (Campbell et al., 2014 (Campbell et al., , 2010 . This dual role may also have obscured IL-6 effects in our study.\nOur structural equation model suggests that metabolic factors are related to CRP levels. This is consistent with past findings that CRP plays a role in cerebrovascular disease and has been linked to incident cardiovascular events, including strokes, in women (Ridker, 2001; Ridker et al., 2000) and in the general population (Rost et al., 2001) . Greater blood CRP levels also have been associated with larger volumes of brain white matter hyperintensities (Satizabal et al., 2012) , lesions that are at least partly vascular in nature (Wardlaw et al., 2015) . The relationship we found between metabolic risk and CRP is also supported by past evidence suggesting that higher serum fasting triglycerides, BMI (Firdous, 2014) and fasting glucose levels (Ebrahimi et al., 2016) are associated with higher CRP levels. A direct link between obesity and serum levels of CRP has been described in younger populations, and CRP levels are reduced by white adipose tissue surgical ablation (Paepegaey et al., 2015) , or low-calorie diet weight reduction (Ro s c et al., 2015) . Higher blood CRP levels are also associated with higher concentrations of triglycerides even within the normal range (Ahmad et al., 2005) . In our model, the existence of shared variability between fasting insulin, fasting triglycerides, and BMI was significantly supported. Pulse pressure did not load significantly on metabolic risk. The overall fit indices of our starting model (Fig. 2a) indicated a reasonable fit but the height CFI (>1) indicated that the model fails to describe data variability when it includes pulse pressure. However, when pulse pressure was removed from the model, the fit quality was excellent and the other parameter estimates were not affected. Our results are consistent with prior work reporting that metabolic syndrome was more closely related to AD incidence when excluding hypertension (Razay et al., 2007) . Hypertension might be an independent component of metabolic risk without necessarily sharing a high level of variance with other metabolic risk measures or being associated with higher levels of CRP.\nWe found no significant direct effect of metabolic risk on cortical thickness. However, blood CRP mediated a significant indirect effect between metabolic risk and brain structure. This is consistent with a prior report in middle-aged adults, in which peripheral inflammation mediated the deleterious effect from metabolic risk on cortical thickness (Kaur et al., 2014) .\nConsistent with prior work, we found that higher APOE risk was associated with lower cortical thickness. APOE2 and APOE4 genotypes are known to modulate the risk of developing future dementia including vascular dementia (Chuang et al., 2010; Kuusisto et al., 1994) . The presence of APOE4 alleles is associated with lower cognitive performance in cognitively impaired elderly (Dik et al., 2000) and with accelerated memory decline in clinically normal adults (Caselli et al., 2009 ). (Table 4 and Fig. 2b ). The direct effect is the effect of the independent variable on the dependent variable (e.g., for the first table cell, it is the effect of metabolic risk on brain structure). The indirect effect is the effect of the first independent variable listed, on the dependent variable, through the mediating variable (e.g., the effect of metabolic risk on brain structure that is mediated by CRP). The total effect is the direct effect plus the indirect effect. Direct, indirect and total effects are presented in units of effect size.\nAPOE4-related cognitive decline also is associated with structural changes in the brain (Honea et al., 2009; Reiman et al., 1998) . In contrast, APOE2 has been associated with lower AD risk (Corder et al., 1994) and slower brain atrophy in cognitively intact older adults (Chiang et al., 2010) . We also found that greater APOE-related AD risk was associated with lower CRP levels, although in our model, higher blood CRP was associated with greater cortical thinning. Additionally, we found a mediation effect of CRP between APOE genotype and cortical thinning once the direct effects of APOE genotype on cortical thinning were accounted for. Our results suggest that APOE4 has a dual effect on brain structure: a significant direct effect in which APOE4 is associated with thinner cortex, and a weaker effect in which the deleterious APOE4 genotype is also associated with lower CRP levels. APOE4 has been associated previously with thinner cortex in older adults (Fan et al., 2010; Liu et al., 2010) . A lower blood CRP level in APOE4 carriers is also consistent with previous studies in humans (Hubacek et al., 2010; Yun et al., 2015) . However, it is currently unclear what is mechanistically driving this relationship.\nHigher polygenic risk scores were significantly correlated with thinner regional cortex in our participants. This provides additional support to the deleterious effect of these genetic variants in a healthy elderly population. However, although the nine AD-risk SNPs we selected were in inflammation-or immune-related genes, we did not detect a significant relationship between our genetic risk score and baseline serum CRP. The main contribution of these genetic variants to brain structure may not be exerted through an effect on CRP. A benefit of a polygenic risk score is that multiple genetic effects that may modulate the same system can be considered together in a biologically relevant way, boosting statistical power to detect effects. However, it is possible that although all the genetic variants included in our risk score were associated with higher AD risk and immune function, some, as with APOE4, may co-occur with lower CRP. If so, the individual effects of these variants on CRP would be obscured when considered in our aggregate genetic risk score.\nIn our SEM, physical activity had a limited contribution to the explained variability of our model. Self reports of physical activity can be biased by various psychological factors and people may overestimate their past physical activity. Physical activity in our SEM was also not significantly associated with metabolic risk or CRP in contrast with prior work (Conn et al., 2014; Lakka and Laaksonen, 2007 ; P. D. Thompson et al., 2003) . Exercise intensity, which contributed most to our physical activity variable, was significantly higher with more years of education. Educational level was also significantly lower in those who had greater metabolic risk. Our results suggest that differences in educational level (which are likely also related to diet choices) may have diminished the apparent relationship between physical activity and metabolic risk in our study. Possibly, the aggregation of different types of both physical activity and aspects of metabolic risk into latent variables also diminished an association between these constructs if one existed. Physical activity also has previously been associated with more intact brain tissue in both cross-sectional and intervention studies. These finding are consistent across different populations of various ages and medical backgrounds (Braskie et al., 2014; Burdette et al., 2010; Colcombe et al., 2006; Fl€ oel et al., 2010; Ho et al., 2011; Pereira et al., 2007) . In particular, the hippocampus reacts positively to exercise training (Erickson et al., 2010; Pajonk et al., 2010) . However, we did not find a significant association between physical activity and brain structure in our SEM analysis. A possible explanation for our lack of a physical activity effect on the brain in our SEM is that we tested the effect of physical activity on brain structure only in the four regions selected for their association with baseline CRP levels, which did not include the hippocampus, where strong physical activity effects are often seen. We therefore tested the association of physical activity intensity with hippocampal volume, and found that greater exercise intensity was associated with larger hippocampal volumes (adjusted for ICV) after controlling for age, sex, education, and APOE genotype. The strongest effects of inflammation and physical activity in our participants thus were in different brain regions. This suggests that physical activity may effect change primarily through a mechanism other than modulation of systemic inflammation or through specific inflammatory markers other than CRP as suggested in previous work (Ostrowski et al., 2000; Pedersen, 2011) .\nWe present the first study to simultaneously evaluate the influence of several environmental and genetic factors on inflammatory status and brain aging, and how they relate to each other. Our results provide further evidence for the influence of peripheral inflammation on brain structural integrity. We tested a theoretical model based on available evidence and obtained results largely consistent with existing literature. We were limited by a small sample size and self-reports, rather than objective measures of physical activity. However, overall, our results offer a global model of several known dementia risk factors. They suggest a central role of peripheral inflammation as the mediator for converging adverse influences on brain cortical thickness in older adults."}, {"section_title": "Funding", "text": "This research was supported by contracts HHSN268201200036C, HHSN268200800007C, N01HC55222, N01HC85079, N01HC85080, N01HC85081, N01HC85082, N01HC85083, N01HC85086, and grants U01HL080295 and U01HL130114 from the National Heart, Lung, and Blood Institute (NHLBI), with additional contribution from the National Institute of Neurological Disorders and Stroke (NINDS) and R01AG023629 from the National Institute on Aging (NIA). A full list of principal CHS investigators and institutions can be found at CHS-NHLBI.org. Additional funding for this project was provided by the National Institute on Aging grants P50AG005133 (PI Oscar Lopez), R01 AG041915 and R01 AG040060 (PI Paul Thompson) and P50 AG05142 (PI Helena Chui)."}, {"section_title": "Disclosure statement", "text": "No author has any real or perceived conflict of interest with the work presented here. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Institutes of Health."}]