[{"section_title": "", "text": "education are partially concerned with community development, and not only with individual development. Although the place-based approach also clearly aims to improve students' performance, such improvement is not directed toward economic competitiveness at the state or global level, in contrast to the approach of \"science-based\" education. Rather, place-based education aims to enhance students' achievement in order to improve a community's quality (Power, 2004, p.18). Placed-based education does not aim to prepare students for career competition, but for improvement of community health (Nachtigal, 1997, p.23). Most significantly one might therefore argue, place-based education aims to strengthen the relationship between students and the community where they live. Learning within the context of community enhances students' local knowledge in various ways: geography, ecology, sociology, politics and all the other dynamics of community. With this knowledge, the students can live their own life in such a way that it also improves the local community (Smith, 2002, p.594). This improvement is not merely, or even principally, economic."}, {"section_title": "Common Characteristics", "text": "With respect to the preceding point,, the common characteristics of place-based education are mainly based on local concerns, and these concerns strongly influence rural communities as follows: • Using the local environment as a base for curriculum development. Students are taught about local ecology, and they use this learning as a knowledge base to further examine other similar and dissimilar places. • Focusing on students' learning experiences. Place-based education aims for students to become the creators of knowledge rather than the consumers of knowledge. • Students' needs and concerns are the main focuses for curriculum design. In place-based education, students have substantial opportunities to express their needs and interests in learning content. As such, they seem to be the creators of their own agenda. • Teachers no longer occupy the center of the learning process. Rather, they play a role as \"experienced guides, co-learners, and brokers of community resources and learning possibilities\" (Smith, 2002, p.593). • Collaboration between the school and the community. Students can play an active role in community activities and community members play a vital role in school affairs, including instruction.. • Integration of subject matter. Generally, the local wisdom, in both its ecological and cultural aspects, are integrated to the school curriculum in conventional subjects. Place-based education is the broad term, but its execution-partly its pedagogy and partly its curriculum-takes varied forms depending on the particular context. One can argue this variation as the most obvious strength of place-based education: Its flexibility can be appropriately applied to the unique characteristics of a particular place."}, {"section_title": "Forms of Place-Based Education", "text": "In relation to this point, Smith (2002) provided five thematic patterns as a guideline for adapting place-based education to various educational settings, as follows: • Cultural Studies Place-based education in the form of cultural studies aims to provide opportunities for students to learn about the history and culture of their community. According to this approach, students are encouraged to investigate the historical and cultural traits of life of people in their local community. Moreover, students have a chance to present their works and share their experience with community members. According to Smith (2002), \"What cultural studies that focus on the local demonstrate is that the ability to analyze and synthesize can be cultivated at least as well as form materials that are directly experienced or investigated by students\"(p..588). One example of the place-based education of this feature of place-based education is the Foxfire project. This project was first run by the teachers and students in Georgia in the 1970s. This project produced the Foxfire magazines which inspired a national movement that aimed to explore and document culture and rural life across nationwide.."}, {"section_title": "• Nature Studies", "text": "Place-based education in the form of nature studies simply takes advantage of the students' \"inborn curiosity about the physical world\" (Smith, 2002, p.588). This approach aims at investigating the local natural phenomena of a particular place and using this experience as the knowledge base for further investigations of more distant or abstract phenomena. In this learning approach, the school curriculum focuses on such general topics such as rivers, mountains and forests. These topics, as local phenomena, are integrated into conventional school subjects such as math, science, language. The Environmental Middle School in Portland, Oregon is a reputedly good example where natural phenomena are the center of the school policy. Two days of the school week is reserved for work in the community or in the field. The students, for example, might have frequent field trips to the local river to conduct the water-quality tests as part of science. After adopting this learning approach to the school curriculum, the school reported a high level of the students' performance in comparison to students in other Portland schools."}, {"section_title": "• Real World Problem Solving", "text": "The \"real world\" problem-solving approach to place-based education provides students opportunities to investigate the school and community issues in which they are interested. Based on these issues, the students are encouraged to identify local problems, select one as a class focus, research the topic, identify a potential solution and play an active role in addressing the problem. It is the responsibility of the teacher to facilitate this process and link the problem and the varied activities to the conventional school subjects. Like culture and nature studies, the real-world problem-solving approach is in part a form of outdoor education because students often learn and work outside their classrooms. Students in an elementary school in Portland, for example, identified the community playground as the problem they would like to investigate. The playground was vandalized and poorly maintained.. None of the students was reportedly attracted to the playground. The teacher and students planned a project to restore the playground. This approach arguably enhances students' sense of place, as they turn to enact their role as a member of the community."}, {"section_title": "• Internships and Entrepreneurial Opportunities", "text": "This approach provides students a chance to think about local vocational options-entrepreneurial and employment options in their own rural communities. They are encouraged to find and create their own economic opportunities within the community, rather than leave the place to seek jobs somewhere else. Smith (2002) points out that \"in addition to helping young people learn about local culture, natural phenomena, and problems, a place-based education that links school learning to locally available occupational opportunities provides young people with the confidence and initiative they need both to remain in their communities and to be of service to their families and neighbors\" (p. 591). Rural Entrepreneurship through Action Learning (REAL) Enterprises, a North Carolina-based project, for example, is currently running programs in 30 states."}, {"section_title": "• Induction into Community Process", "text": "This approach is perhaps the most comprehensive form of place-based education. According to Smith (2002, p. 591), it aims to turn the school and students into \"genuine intellectual resources\" that exercise the responsibility needed both to represent and to address community needs to government and business. This approach aims to train students to be active participants in the community, asserting that they are as entitled to do so as adults. They can express their concerns, ideas, and exercise their knowledge of community issues. This approach is based on the notion that the best learning takes place when people are involved in real-world process, addressing real-world challenges. One example of this approach occurred in Oregon, reports Smith (2002). The members of a county park commission proposed to install new playground equipment in one community in the county. The fifth-graders along with their teacher gathered information about community needs and presented the report to the commissioners. In this process, the students had a chance to share their needs, from viewpoint of children, and played active roles as community members despite their youth. Although place-based education takes varied forms, it is common for rural schools to adopt more than one form to their communities. In some rural areas, culture and nature studies might be the main focus of the school curriculum. In other areas, in contrast, five forms of place-based education might be applied. The nature of place-based education, therefore, varies appropriately from place to place."}, {"section_title": "Place-Based Education in United States", "text": ""}, {"section_title": "The Necessity of Place-Based Education in Rural Context", "text": "The nature of place-based education varies not only within a nation, but, based on different history, culture, economic, politics and so on, place-based education also plays a different role from nation to nation. Place-based education has been called for in rural areas in United States because of two main reasons:"}, {"section_title": "• The Conflict between the Imperatives of Generic Conceptions of Education the Perceived Prerogatives of Rural Areas", "text": "It is obvious that, in general, contemporary schooling in the U.S. has been reformed to respond to the imperatives of globalization and economic growth. Coverly (1914) proposed an industrialized factory model or urban model as the models of public education in United States (cited in Nachtigal, 1997), and this model has dominated not only 20 th century developments (Callahan, 1962) but continues to do so (Spring, 1998). In relation to this point, some scholars argued that the aims of education in this country should be about economic gain and economic competitiveness at both local and global level (Nachtigal, 1997). Nachtigal, however, argues that the modernist generic approach does not fit in the rural context (Nachtigal, 1997). Firstly, the school policy based on this approach, centralized as it has been, to respond to state and national imperatives, sleights the local level-with particularly severe ill-effects for rural places. Secondly, the state policy is created by a small group of people who have little comprehension of the requirements of rural life. Thirdly, this model of schooling also equates quality and quantity, based on the particularly American idea that \"bigger is better.\" As such, rural schools-which are normally small--are always second-best. Fourthly, the generic modernist approach puts great emphasis on students' achievement measured exclusively as scores on state tests. As a result, most teachers emphasize preparation for these generic state-level tests-and the real desires or needs of rural students and rural communities are ignored.. This situation put a lots pressure to the school administrators, the teachers, the students or even the parents. These conflicts of modernist imperatives and rural prerogatives arguably entail negative consequences for rural students and communities. Some rural students find that their school experience is inhospitable-culturally dissonant-and they disengage from academic work. Many leave school early. Others persist but take with them the belief that the things that they learned in school were irrelevant to their subsequent rural lives. The children of both such groups of students, it should be noted, are not likely to view schooling favorably."}, {"section_title": "• Environmental and Cultural Concerns: Rural Development", "text": "Rewcent social transformation has been strongly influenced by countless technological and economic changes. This situation, some have argued, leads to the disconnection of local people and their communities (e.g., Fontaine, 2002). One way to preserve environment and culture is to increase the residences' awareness of and knowledge about the place where they live (e.g., Wither, 2001). Hutchison (2004) also argues that \"learning how communities function as ecosystems can help students to appreciate more fully the biological and cultural interdependencies that sustain their living space and the space of others\" (p. 41). One way to grasp the importance of place-based education, then, is to understand it as a localized response to the momentous issues of culture and environment, particularly as manifest in rural communities. The challenge, on these terms, is to identify the promising learning approach that might best be able to raise people's awareness of the cultural and environmental values of their place while simultaneously enhancing their devotion to that place. Loveland (2003) claims that place-based education enables students to achieve academically as well as to be good local citizens."}, {"section_title": "Rural Education Reform in the U.S.", "text": "Some U.S. educators have proposed and demonstrated alternative forms of schooling to improve academic achievement and contribute more to the local community, both in terms of sustaining the natural environment and rural ways of living. Some of the most prominent of these efforts are reviewed below."}, {"section_title": "• Annenberg Rural Challenge", "text": "In 1993, a former Ambassador Walter Annenberg donated $500 million to reform public schools in United States. Since nearly one-third of the public schools in United States are rural schools, some well-placed educators suggested that the Annenberg initiative also pay attention to schools outside urban areas. Brown University President Vartan Gregorian said that \"No national school reform movement is complete unless it includes America's rural schools\" (quoted in Nachtigal, 1997, p.21). As a result of the agitation, the Annenberg Rural Challenge, with a five-year grant of $50 million dollars, was founded as a small part of Walter Annenberg's half-billion-dollar Challenge to the Nation. The Annenberg Rural Challenge was projected to reform rural schools throughout the country, with place-based education its curricular and pedagogical objective. Now known as the Rural School and Community Trust, this effort has reported various successful projects in more than 700 schools in 33 states (Annenberg Rural Challenge, 1999). The Rural School and Community Trust works with many place-based programs, obviously. One notable collaborating project is the Alaska Rural Systemic Initiative (AKRSI), described next."}, {"section_title": "• Alaska Rural Systemic Initiative (AKRSI)", "text": "The foundation of AKRSI is the response to \"the alienation and identity crisis\" (Emekauwa, 2004, p.3) of the rural students in Alaska. This situation derives from the resistance of Alaska's Native people to modernist Western education. Local people in Alaska have a deep-rooted culture in existence for thousands of years. They strongly credit the significance of the natural world and exhibit a degree of respect for it that appears almost irrational to a modernist sensibility. The traditional life of these people is closely related to, and depends on, nature. Their indigenous knowledge and local wisdom, passed from generation to generation, honor a conception of the natural environment as the natural order of life. Such a conception is at odds with a modernist Western conception of knowledge, which focuses on technology and economic utility. This conflict, understandably, hits Native students hard, especially when they attend rural schools conceived as modernist enterprises. In such cases public schools serve essentially to impose a discordant foreign culture. With support from the National Science Foundation and the Rural School and Community Trust and the National Science Foundation, AKRSI has worked to recapture the indigenous commitments of Alaska's Natives as well as encourage the involvement of the Alaska Native people in school reform. The purpose of AKRSI is also \"to develop the untapped potential of indigenous knowledge systems as a foundation for rural/Native education in general, and science education in particular\" (Emekauwa, 2004, p.4)."}, {"section_title": "• Community-Based School Environmental Education (CO-SEED)", "text": "Community-Based School Environment Education (CO-SEED) was created by eleven communities in northern New England. The goal of this project is to deeply investigate the local communities in northern New England in order to create an appropriate academic program that accommodates local issues and indigenous knowledge in the culture of public schooling (Funders' Forum on Environment and Education, 2006). Based on the CO-SEED program, the desires and interests of people in a community, as well as local problems, are specified as the themes of the school curriculum. CO-SEED, for instance, fosters students' learning of science by using the real context of the community as a learning laboratory."}, {"section_title": "Place-Based Education in Thailand", "text": "Recently, place-based education has emerged in the curricula of Thai rural schools as part of a response to concerns with rural education there. The first part of this section explains why."}, {"section_title": "The Necessity of Place-Based Education", "text": ""}, {"section_title": "• Economic Crisis (1997): Self-Sufficient Economy", "text": "Because educational policies in Thailand are influenced by Western models (Miller & Casebeer, 1991), Thailand rural education problems resemble those in the United States. The difficulties are more severe in Thailand, however, because Thailand is a predominately rural-agrarian society, with agricultural products a key part of the Thai economy. Modernist (Western) schemes for schooling benefit Thailand's urban populations far more than the its rural communities because the development of a more technological society-the agenda of globalization-not surprisingly figures as important in this sort of schooling (cf. (Keyes, Keyes, & Donnelly, 1991).The emergence of a postindustrial sector in the Thai economy and society, moreover, leaves the vast Thai rural area largely undeveloped. Worse still, the outmigration of rural people to pursue a hopedfor better life in urban areas is intensifying (Singhanetra-Renard, 1999). This phenomenon weakens rural communities and could hypothetically weaken the national economy as a whole. After the economic crisis in 1997, efforts have been launched to promote the Thai economy as self-sufficient. This emergence of this effort was strongly influence by an address of the King of Thailand, who observed, Being a (economic) tiger is not important. What is important is to have enough to eat and to live, and to have an economy which provides enough to live and live…….If we can change back to self-sufficient economy, not complete, even not as much as half, perhaps just a quarter, we can survive…..We need to move backward in order to move forwards. (quoted in Rigg & Ritchie, 2002, p. 362) Many Thai scholars also believe that a self-sufficient economy and strong local communities can solve the Thai economic crisis. The Bangkok Post, for instance, editorialized that \"communities are the heart and the answer (to the economic malaise). If they are strong, the country will survive\" (quoted in Rigg & Ritchie, 2002, p. 362). In this context, many educators believe that reform of rural education might be one strategy to develop local (rural) communities in Thailand."}, {"section_title": "• Cultural Concern: Thai Wisdom Preservation", "text": "Western concepts-especially modernization, industrialization and capitalismhave strongly influenced Thailand's economic and social policies. The mismatch between these policies and Thai culture reportedly engenders problems such as \"urbanization, population mobility, cultural and environmental destruction, all of which affect the quality of life of the rural people\" (Office of the Education Council, 2006, p.1). Globalization is understood by the Council to have threatened indigenous knowledge and local wisdom-partly via the accessibility of Western knowledge, ideas, and culture through various modern sources such as internet. On this view, it is vital for local communities, or even for entire \"developing\" countries to preserve their own culture for their future generations. According to the Council (2006, p. 8) one way to address this aim is to promote educational policies that integrate global knowledge and indigenous knowledge."}, {"section_title": "Rural Education Reform in Thailand", "text": ""}, {"section_title": "• National Education Act of 1999", "text": "In accord with ideas about rural education reform, some parts of the current National Education Act (1999) of Thailand are focused on educational administration and management by local administrative organizations. The law states the rural community's right to create and administer the school policy in ways appropriate to community characteristics. This legislation allows education policy to be delegated to the local level. Also, it focuses on the significant role of Thai Knowledge in the educational system. Importantly, this legislation provides a degree of support for place-based education that is explicit in the Thai context (i.e., as Thai Knowledge). In section 23, for instance, the Act states that education through formal, non-formal, and informal approaches shall give emphases to knowledge, morality, learning process, and integration of the knowledge about mathematics, science, languages, vocational skills, conservation and utilization of natural resources and the environment. Most of all, knowledge about religion, art, culture, sports, Thai wisdom, and the application of wisdom is also emphasized. (Office of the Education Council, 2006, p.10) Also, in section 57, the participation of community members in (rural) curriculum development is encouraged in regarding to the rural school curriculum development: Educational agencies shall mobilize human resources in the community to participate in educational provision by contributing their experience, knowledge, expertise, and local wisdom for educational benefits. Contributions from those who promote and support educational provision shall be duly recognized (Office of the Education Council, 2006, p.20) These passages can easily be read as enabling place-based education as one alternative approach for rural education reform in Thailand. That is, the dual emphasis on Thai Knowledge and community participation is consonant with descriptions of placebased (or place-conscious, or community-based rural education)."}, {"section_title": "Various Place-Based Education Programs", "text": "In response to the National Education Act, many rural areas in Thailand apply place-based education to the school policies."}, {"section_title": "• Ban Narai Primary School", "text": "Ban Narai Primary School put a great emphasis on environmental issues. Its school curricula, therefore, is based on the nature studies approach to place-based education. With the collaboration between the school and community, the local curriculum was created and developed from local wisdom. The topic of forest, the priority issue for the local community, became the main curricular focus. The curriculum consists of three learning modules: exploration of the ecosystem, consciousness-raising, and reforestation. In the first module, the students learn about the ecosystem of the forest by exploring the current condition of the forest near the community. Moreover, a team of traditional herbalists called the \"Local Wisdom Group\" is invited to teach the students about the benefits of forest plants in terms of medical treatment. In the second module, the consciousness-raising module, students are encourage to realize the importance of the local and natural resources in order to preserve this knowledge to the future generations. In the third module, students learn about the reforestation and the local forest management. Some of these indigenous practices are derived from the Buddhist religion, which believes that the spirit can help to protect destruction of the forest. The students are also encouraged to organize community activities regarding reforestation. They have a chance to work with the community members to re-establish the ecosystem of the local forest (Lucarelli, 2001)."}, {"section_title": "• Ban Daeng Primary School", "text": "Unlike Ban Narai Primary School, indigenous vocation is the main focus of the local curriculum development at Ban Daeng Primary School. In this school, then, the entrepreneurial approach to place-based education is applied. The students are trained in practical skills with which they can, at a later date, presumably create their own economic opportunities such as herbal medicine, hair-styling, silk-weaving and chicken-raising and so on. During this module, community members are invited to teach the students about their trade. Apart from the vocation focus, the school curriculum also integrates the local knowledge into the school subjects. For example, the students study science by making herbal soap and shampoo. They reportedly also learn basic mathematics by calculating percentages regarding wildlife diversity in the forest (Lucarelli, 2001)."}, {"section_title": "Similarities and Dissimilarities of Place-Based Education in United States and", "text": ""}, {"section_title": "Thailand", "text": "Some educators in the United States and Thailand have exerted considerable effort to influence rural public schools through place-based education. In light of this ongoing effort, a discussion of the similarities and dissimilarities of place-based education in these two countries may be useful"}, {"section_title": "Similarities", "text": "Place-based education in United States and Thailand do not only share such characteristics as ecological learning, real world and problem based learning, students centered and so on, they also have other similarities: • Morality Focus Both place-based education in United States and Thailand reflect the attempt to enhance also students' morality. In the United States, a main emphasis is placed on developing the relationship between students and the place where they live, as both a geographic place with a given ecology and as a human community. In other words, the students' sense of place and membership in it are cultivated through place-based education. Many place-based education programs in United States, for example AKRSI, focus not only the students' academic performance, but also their engagement as good community citizens. Similarly, in Thailand, this approach encourages students to appreciate their deep-rooted culture and develop their cultural identity. Through placebased education, the students acknowledge their roles and responsibilities to care about their splendid culture and environment and preserve them for the future generations."}, {"section_title": "• Place-Based Education as a Second Best", "text": "The roles of place-based education in United States and Thailand are somewhat viewed as the second best. In other words, their positions in national education policy are not as stable as modernist (science-based) forms of education. Even though this approach is aimed to be an alternative learning method with particular relevance for rural education, place-based education has been growing within the framework of modernist education systems. In both countries, technology development and economic competitiveness are considered to be the first priority. As such, despite the focus on environmental and cultural issues, the rural school curriculum in both nations emphasizes the skills to alleged as necessary to deal with projected changes social and economic changes contingent on globalization. For example, Ban Narai Primary School teaches students using the computer to design traditional Thai \"mutmee\" silk patterns. Moreover, this approach is limited to a specific level of education. In Thailand, this kind of localized curriculum has currently been applied only for to primary school level. Because placebased education is a recent introduction in Thailand, it is not, in fact, widely applied throughout the Thai educational system. In United States, by contrast, the place-based approach is known even at the university level. Nonetheless, the approach is limited to comparatively few universities and K-12 programs. In general, the higher the educational level in which students study, the more reduced is the chance for them to be involved in place-based education. This is circumstance represents one of the most serious challenges that place-based education in both countries confronts. It seems that place-based education is not seriously considered as having a sufficient economic or intellectual justification-its connection to deep cultural themes not withstanding."}, {"section_title": "Dissimilarities", "text": "Despite some similarities, place-based education in United States and Thailand differ in one main aspect: its primary purposes. "}, {"section_title": "The Challenges with Place-Based Education", "text": "Although place-based education, to a quite limited extent, has been successfully adopted as an alternative learning approach in both United States and Thailand, established programs in both countries now confront distinct challenges. To begin with, this learning approach has been criticized by some educational theorists due to the lack of an acknowledged theoretical tradition in comparison to the modernist (science-based) education (Gruenewald, 2003). This criticism, arises in part from the as-yet poorly established discourse of place-based approaches. This challenge, therefore, could be met as the discourse becomes more fully elaborated and more widely understood. Furthermore, place-based education per se is a quite recent development in educational history, and its premises conflict in large measure with those of modernist forms of mass schooling. That is, as noted previously, place-based education can be understood as deriving from the mismatch between the intentions of modernist \"education science\" and the perceived needs of rural communities-with these needs seen as an issue of the very sustainability of such communities. Such an outlook implies the disadvantage of sciencebased education in such places. The central concepts of these two approaches are in conflict: environmental and cultural preservation on one hand, and technology development on the other hand. An existential dilemma seems to underlie such conflict. How can place-based education preserve the rural lifestyle as it confronts the continuing and accelerating invasion of technology? Clearly, place-based educators find it difficult to promote their ideas over the entrenched approach of \"education science\" with its far stronger grounding in the history of education. Some educational theorists, however, suggest that the two learning approaches can be integrated in order to form the most efficient learning approach for students in a particular place (Jennings, Swidler, & Koliba, 2005).. Another challenge to place-based education lies in the often limited economic opportunities available in the local rural community. Although internships and entrepreneurial opportunities are sometimes provided to encourage local students to create their own trade to serve the community, the real economic opportunities for the students are quite limited in comparison to those in metropolitan areas (e.g., in the U.S. median metropolitan household income is currently about 30% higher than nonmetropolitan household income, and the contrast is even sharper in Thailand; Bureau of the Census, 2006). According to labor market theory, it is unlikely that every rural student will obtain careers in their hometowns. Then, too, additional influences include personal interests, financial limitations, and so forth. Some or many students will inevitably leave the community to pursue the better life that they imagine or desire. An unusually restrictive from of place-based schooling that narrowed students' outlook exclusively to the local rural community cannot, one might well argue, would provide a quite inadequate education. Most proponents, of course, realize this difficulty and often argue the need for rural students to become bicultural-localists who nonetheless possess cosmopolitan capabilities (Haas & Nachtigal, 1998)."}, {"section_title": "Eastern and Western Philosophies' Influence on Place-Based Mathematics Instruction in the United States and Thailand", "text": "The economic crisis in 1997 forced Southeast Asian countries to rethink their educational policy, especially mathematics instruction-considered a key contributor to the economic base of a contemporary nation. The major lesson from this crisis, as noted previously, was understood to be the insight that the economic and educational policies of developed countries do not work for the developing countries of Southeast Asia, in particular, Thailand. In order to become \"developed,\" Thailand has already been modernized by the imported concepts, culture, science, and technology of developed countries such as the United States. These western cultures are reputedly disjunct the Thai way of life and philosophy. This mismatch not only leads to many problems that culminate in crises, but it also unnecessarily alienates local people, within their own nation, from their own cultural roots (Tinnaluck, 2003). To understand this alleged phenomenon, it is important to understand the predominant influences that underpin such reputed cultural differences. Among the possible points of comparison with strong cultural and philosophical influences is religion.: Buddhism and Christianity."}, {"section_title": "Religion in Two Cultures", "text": "Christianity and Buddhism are the U.S.'s and Thailand's dominant religions, respectively. Approximately 75% of the American population is Christian (Robinson, 2006, p.1), whereas fully 95% of the Thai population is Buddhist. Christianity is a religion founded on ideas about God. Christians believe in a loving and approachable God who created the world and all the humans in it. For the most part, the main concepts of Christianity concern the life and teachings of Jesus Christ, understood to be the Son of God-God in a human form on earth two millennia in the past. The stories about Jesus's life and miracles (plus sections of Jewish scripture-the Old Testament) are written in the most important Christian scripture, the Bible, considered to be God's written message to humans. Based on the Bible, Christians are encouraged to know God better, to cultivate the relationship with Him and, finally, to love and have faith in Him. When Christians believe and have faith in God (or Christ), they believe that they can confidentially turn to Him no matter what circumstance they face in their lives. God is believed to answer every prayer. Christianity does not focus on religious rituals or doing good deed as do other religions, rather it encourages the follower to have a joyful and meaningful life (Adamson, 1996). Christianity maintains that all humans have \"original sins,\" derived from Adam and Eve, and so they need a savior to redeem them from these sins. Jesus represents the unconditional love and compassion of God to humans since God sent his only son to teach humans, especially sinners, and sacrificed himself through his death. The death of Christ is understood by Christians payment for God's forgiveness. Therefore, the goal of Christianity is to teach people to repent of their sins, so they can be forgiven and return to a righteous relationship with God, with whom they will, they believe, live eternally in heaven. According to this nature of a loving God, Christians are encouraged to exhibit unconditional love and compassion for others-especially their enemies. As such, love is the main concept and center in Christianity. Most importantly, however, Christians need to love and believe in their God, who is considered to be \"the light of the world\" (Adamson, 1996, p. 3). Christianity teaches about life after death. It is believed that humans have a single life and they can have eternal life with God in Heaven where there is no suffering, only joy and happiness. Eternal life is the goal on which, by far, most Christians focus. Most sects believe that only those who acknowledge Christ as their savior will be permitted entry to heaven. Those who do not make this acknowledgement will spent eternity in hell, where they will experience eternal punishment for their varied unforgiven sins. Buddhism, on the other hand, does not focus on God or any deity. Even Buddha (Siddhartha Gautama) claimed that he was just a human who had awakened and attained enlightenment. He never claimed to be divine and did not want Buddhists to pay more attention to his life than his teachings (Dharma). He wanted humans to follow his teachings so that they might end their pain and suffering. The only way to end humans' sufferings is Nirvana. Nirvana refers to \"the blowing out\" of existence or an impersonal liberation which is the end of suffering and rebirth cycle (Zukeran, 2003, p.3). Buddhists believe that reincarnation and rebirth are attached to humans' pain and suffering. The cycle of birth and rebirth is driven and caused by Karma, the law that underpins an individual life. Based on Karma, Buddhists believe that a person's life in the present is affected by past actions. What we are now is the result of what we did in a previous incarnation. However, humans can break the law of Karma and escape from a repetitive cycle of birth, life, death and rebirth by stopping desire and craving, the causes of suffering (Zukeran, 2003)."}, {"section_title": "Different Faiths, Different Philosophies", "text": "These themes of Christianity and Buddhism influence Western and Eastern concepts and beliefs, respectively. Three main issues seem relevant: (1) individualism and collectivism; (2) consumption and self-sufficiency, and (3) globalization and localization. Individualism vs collectivism. One important theme of Buddhism is Anatta or \"no-self.\" Buddhists believe that nothing is real, even an individual soul. This outlook does not indicate that the soul does not exist; rather, the concept refers to the detachment of the illusion that allegedly makes humans believe that they really are whatever they perceive themselves to be by feeling, seeing, tasting, and hearing. Buddhism teaches humans to relinquish that particular, and common, phenomenon (Bhikkhu, 1996). For example, if a loved person dies, humans feel sad. In the Buddhist view, the thing that makes for such sadness is not the actual death of the loved one, but the feelings living humans attach the phenomenon of death. On the other hand, if that person who dies is not their own loved one, humans will definitely not experience sadness. On this view, the only way to end human suffering is for humans to release their attachment to desire and the sense of self as the path to Nirvana. Also, \"Anatta implies that the natural world, not the self, is central to man's reflections\" (Matzen, 1996, p. 7) This Buddhist philosophy grounds the traditional life of Thai people. Indeed, according to Thai culture and belief, emphasis on one's self causes alienation from one's own culture. Matzen (1996, p. 7) observed, for instance, that \"Thais think that an emphasis on speech, particularly as a way to heighten individualism, is foreign.\" Moreover, in Thai society, a temple is the center of a community where a monk plays a vital role, sometimes as important as that of a secular leader. This social structure still prevails throughout rural Thailand. In this way Buddhism arguably strengthens relationships among a community's members, and even among a family's members. The most distinctive characteristic of Thai culture is the extended family, which constitutes local villages as a communal phenomenon. Because Thailand is a predominately rural nation, of course, this fact means that Thailand is principally a communal society.. Christianity, on the other hand, puts strong emphasis on individualism, on ego (self). Although Christianity also emphasizes the close relationship between humans and God, it is an individual's very personal relationship with God, especially among the increasingly globally popular evangelical sects. As Jesus said, \"Behold, I stand at the door [of your heart] and knock. If anyone hears my voice and opens the door, I will come into him\" (Adamson, 1996, p. 5). This personal consciousness, this sense of the strongly involved ego is not prohibited in Christianity as it so clearly is in Buddhism. Christians believe that ego is not a bad thing; rather it can cause both egotism (bad) and altruism (often good). However, agape (spiritual love), or that sort of altruism caused by ego under the sway of God's love, seems to be the main principal of Christianity (Kreeft, 1987, p. 2). Consumption vs self-sufficiency. Buddhists believe that pain and suffering are caused by the desires of the senses. For example, if we love someone, we definitely want something in return, at the very least love from that person. So, the more we love, leading to increased desire, the more we inevitably suffer. Buddha, however, did not enjoin human love. Rather, he suggested that we should love wisely, that is, loving without desire. To end suffering, we need to extinguish our desires. Less desire, in the Buddhist tradition, implies knowing how to feel enough for everything. Within Thai culture in particular, this Buddhist outlook implies a self sufficiency adequate to a simple but happy life. From the Buddhist perspective of economics, people are taught to consume wisely and to practice self-sufficiency. According to Professor Saneh Chamarik, Thailand, which is an agriculture-based country, is currently supported to use a \"Buddhist economics\" that emphasizes agricultural production for selfsufficiency rather than for export, the norm of the western-influenced market economies (The Synergos Institute, 2002). Christianity, in contrast, encourages people to love more, especially to love God with all \"our heart, soul, mind and strength\" (Kreeft, 1987, p.3). Although Christianity focuses on agape or spiritual love, not the allegedly)\"selfish\" love of eros, it is not easy for human beings to love without desire. Some people might love God because they know how much love and compassion God extends them. Other people might love God just for instrumental reasons: because they hope God will help them overcome earthly difficulties or access eternal life. In this case, they love because they want something for themselves-they are acting out of distinctly selfish love. The Western concept of love leads to more love, then, and hence to more desire. Arguably, under this outlook, humans can never be satisfied with what they possess because (arguably) they imagine it is not \"good\" enough. The western solution is to consume more: The more humans consume, the more they are satisfied. Many observers have, in fact, commented on this tendency of Western civilization (e.g., Giroux, 2000;Molnar, 1996;Powell & Udayakumar, 2000), a tendency that even been alleged to foster an anti-intellectual sort schooling in the U.S. (e.g., Howley, Howley, & Pendarvis, 1995). Hence, the Western economic concepts equate consumption with satisfaction. It goes without saying, as well, that these concepts underpin capitalism. Looking from the Buddhist outlook, one might be tempted to assert that capitalism sets money, or profit, as God. Many Christians would certainly contest the assertion, but under the rules of free trade, having money means having power to do and to buy; considerable money means considerable power, political as well as economic. If God has power to create the world, humans can use money to manipulate the world as well. Certainly, prominent western scholars have explored this theme (e.g., Weber, 1958). Globalization vs. localization. It is obvious that simple life in Thai culture refers to a life that is suitable to a particular place. The Buddhist outlook suggests that humans should live a life that is consistent with nature. Fish should be in the water, birds should be in the sky. Along the same line, humans should know how to live simply and appropriately where they dwell. On this outlook, such Western concepts as domination, capitalism, materialism, and globalization certainly make life un-simple-sophisticated cosmopolitan (or just complicated). Such an approach to life is viewed as inappropriate in traditional Buddhist and Thai culture. In the United States, the concepts of domination, capitalism, materialism, and globalization, on the other hand, are widely-often enthusiastically-embraced. These concepts are reciprocally related because each of them is generated from a Western view of power. In this vein, it is not surprising that the concepts of domination and colonialism arise, in part, from belief in an all-powerful God. Humans imitate the entity they most admire, and certainly Christianity advises adherents to be \"Christ-like.\" Christ is understood to be the representative of, or even identical with, God. God creates the universe, and gives dominion over it and the earth to humans in the Old Testament, so why cannot humans dominate the world with forceful rule? Indeed, some Christians explicitly argue this very notion of dominion. Globalization is the emerging form of post-industrial capitalism. It represents an attempt of investors to be free from territorial constraints, especially the constraint of locality (Bauman, 1998). Globalization leads to \"mobile capital and unanchored power\" (Bauman, 1998, p. 10). This power benefits mostly transnational companies, but it ruins local communities. Wal-Mart, which is considered to be \"the world's biggest corporation\" (Useem, 2003, p.1) is often cited as an example. As Wal-Mart grows, local businesses such as convenience stores are dying. (In the U.S., the famed \"mom-and-pop grocery is all but gone.) Wal-Mart, like other international corporations, exploits wherever it can and leaves the economic and cultural impact of that exploitation to the locality-as a so-called \"externality.\""}, {"section_title": "Place-based mathematics instruction", "text": "Buddhist education and constructivism. Contemporary, modernist Western education (along the lines of \"education science\") always construes learning as the means to some end. Curiosity and wonder in the West, some have argued, is no longer the focus of learning, rather the pursuit of degrees and qualifications is set as the goal of learning (Slavin, 2006). Thai culture, by contrast, views learning from the Buddhist vantage on human growth and development. Thais, in general, believe in learning for its own sake, and they believe that students must logically be the center of learning. Even for math education, Thai educators try to adapt the traditional Buddhist approach to instruction. According Tusgate (1996): In reality, no one can teach mathematics. Effective teachers are those who can stimulate students to learn mathematics. Educational research offers compelling evidence that students learn mathematics well only when they construct their own mathematical understanding (Tusgate, 1996, p. 4). Tusgate expresses the constructivist view. Buddhist philosophy is similar to the constructivist approach in that it also focuses on the student as the center of learning and the student's inherent capability to learn and develop. In this learning approach, teachers are viewed as helpful facilitators in the learning process-they are by no means as important as students. If there is no teacher, students can still learn for themselves. It is not clear, to this author, that Western educators in fact believe this statement to be true. Therefore, in Thailand, the role of teachers is to encourage students to understand now so that they can later adapt this knowledge in whatever situations the future history of the world may place them. A related intention is that students should be equipped with capacity to develop themselves in their own way and at their own pace. Currently, in Thailand, a \"constructivist\" approach is reflected in many policies of the Eight National Educational Development Plan (ENEDP) of Thailand. Furthermore, some research studies have been conducted to investigate the appropriateness of a constructivist approach to teaching in Thailand. One such example regarding math instruction is the study conducted by Aumporn Makanong. This study indicated that the attitudes of ninth grade Thai students who were taught algebra based on a constructivist approach were improved. In addition, they tended to be more engaged and worked harder than those who were taught with the traditional approach (Makanong, 2000).  Institute, 2002, p.3). Hence, the current Thai national education policy focuses more on nationalism and localism, with national identity strongly dependent on local identity. This policy outlook includes efforts to maintain a sense of national identity through math education. Western economic concepts and related policy are-along logical utilitarian lines-created for the benefits of the majority of people in metropolitan locales. Indeed, it has even, and often, been charged that the US lacks a coherent rural policy (e.g., Freshwater & Scorsone, 2002;Stauber, 2001) and this charge includes education policy, as well (e.g., Sherwood, 2001). Not surprisingly,when Western concepts and policies are applied in the Thai context benefits can be hypothesized to accrue to a small minority of the Thai people. The wholesale adoption of Western policy and concepts also influences the educational system of the country, contributing to a sharpening of differences in urban and rural access to schooling. Thais have therefore argued that Western models of development embed considerable undesirable risk (e.g., The Synergos Institute, 2002) Thailand has applied two measures in response to these judgments: decentralization and promotion of vocational education. In terms of decentralization, the government focuses on educational equality for all students on the view that the country's development and economy depends on educational adequacy for all students. For vocational education, the government aims to increase its support of vocational programs in rural schools, because such programs have been far more common in urban schools. Because educational resources and opportunities are restricted in rural places, rural students are at a distinct disadvantage in competition for places in higher education. Partly in consequence, and partly because of attachment to local communities, most rural students desire to move from general education to vocational fields, rather than to university programs. Moreover, vocational education permits rural students to learn occupational skills that are related to their family's own business and that, arguably, best serve the local community. Because Thailand is a rural nation with a large portion of the money and barter economy dependent on rural vocations, this change in policy could arguably hold promise for the national economy (conceived in accord with Thai cultural principles). In relation to this point, mathematics instruction should be adapted to be appropriate to vocational fields. It should be conceived quite differently from the math taught for university preparation."}, {"section_title": "Balancing between cognitive and affective learning. Mathematics instruction in", "text": "the United States has been somewhat based on the cognitive aspect of the mind, which puts more emphasis on the value of rationalism regarding creativity and problem solving (Seah & Bishop, 1999). Based on a cognitive approach to mathematics instruction, students' intuitive reasoning and critical skills will be fostered in order to be able to apply mathematics knowledge and skills in real life situation. The educational programs and policies which have cognitive objectives are quite desirable and appropriate to deal with the changes and challenges occurring in the globalization era. However, to some extent, the cognitive approach seems insufficient to support the culturally-relevant objectives of education in Southeast Asia. Today, the trend of the educational policy in Southeast Asian countries is an emphasis on nation-building based on distinct national values. As such, many Southeast Asian countries implement unique affective educational objectives in their national curricula and policies. Thailand's current education reform, for example, entirely focuses on affective objectives (Seah & Bishop, 1999). Most Westerners would find this choice difficult to grasp. Given the choice to focus on local communities and on rural education, the affective choice can be recognized as both logical and appropriate. The argument for this approach, of course, is not based on Western notions of th importance of unlimited economic growth, the supremacy of the individual-much less on aspirations for global domination. The object of learning, in fact, is affective attachment to Thai culture, for instance. Affective learning contributes to the projects of nation-building, localism, and culture preservation in the Southeast Asian context. Mathematics, too, can be understood in this cultural and policy context. Bishop (1988), for instance, proposed the idea of mathematical enculturation, which maintains that the nature and meaning of mathematics is interpreted in relation to cultural context. Bishop argued that mathematics is a cultural construction within a particular context: Mathematics itself is an inherently cultural phenomenon and that the proper lens for viewing the whole of mathematics must therefore be broadened to include the wider mathematical culture in which it is embedded. (cited in Stigler, 1989, p.367) Bishop (1988 also observed that mathematics does not include only symbolic technologies, but also cultural products such as belief, attitudes, and values. Therefore, apart from mathematics knowledge, skills, and application (e.g. problem solving), the values of mathematical culture (including specific connections, for instance, to Thai culture and Buddhist understandings of the world) should be another vital component to be taught."}, {"section_title": "Evaluation and Recommendation", "text": "Although there are many concepts and ideas proposed to reform mathematics education, especially in rural areas, the experience of actual reform embeds many ironies. In the United States, some researchers and educators try to change the role of mathematics in rural context. From a Thai outlook, however, the difficulty is that this role is not going to change if the U.S. continues (as seems likely) to place great emphasis on student achievement. Obviously, in the United States, great effort is being devoted to improvement in mathematics achievement, operationalized as \"raising test scores\" (see previous analysis on what this means from a Thai perspective). The U.S. government also supports many national evaluation and assessment programs that report students' achievement comparing the United States and international countries such as the Program for International Student Assessment (PISA) or the Trends in International Mathematics and Science Study (TIMSS). In other words, learning and teaching styles might be changed, but the goals remain the same. Another difficulty is that many proposed ideas regarding mathematics education in rural areas seem theoretical-researchable, but less than practical. That is because in real life situations, many contingencies obstruct the evolution of mathematics education in theoretically imagined or desirable ways. This observation applies to both nations. Thailand has also been facing difficulties similar problems to those experienced in the United States. First of all, Thailand is one of the nations that participate in PISA. In fact, Thailand participated in TIMSS 1995 and TIMSS 1999, but is not on the list for TIMSS 2003 (U.S. Department of Education, 2004). If Thailand still participates in these international programs, it is by implication following the lead of the developed nations. It is an irony that Thailand tries explicitly to avoid Western dominance (particularly that of the United States) but succumbs nonetheless to the international regimes implicit in Western domination. This irony suggests that Thailand, despite recent policy changes, still adheres to Western goals. This is unfortunate, but theoretical concepts and policies are, at some points, unrealistic and impractical. Practitioners the world over acknowledge this fact, and so do some policy analysts (e.g., Scott, 1998). For example, how can we apply the idea of Mathematics Enculturation to a particular context, especially in rural areas, if policy makers, school administrators or even teachers can not actually and practically identify a position of mathematics within our culture? It is apparent that some educators try to create school activities that respond to this theory, but in terms of the national education policy, we can not even link mathematics education clearly to our indigenous culture. The problem of mathematics education in Thailand, related to aspects of enculturation, is that this idea is quite new in Thailand. The topic has received no research attention and little theoretical development. Thailand has always applied the western education model and have never devoted any attention to indigenous ways of teaching and learning-whatever these might be. Both Eastern and Western philosophies are, it goes without saying, valuable and beneficial in varied contexts, and depending on the application. However, educators in whatever nation need to consider very carefully the application and implications of such things, especially with respect to place. And this is seldom done (Hutchison, 2004;Theobald, 1997). For this observer, the mismatch is obvious; if Thailand continues to apply Western concepts uncritically, the current reforms-with their attachment to Thai values-will be the likely victim. In this case, even the prognosis for Thai culture itself may not be good. This difficulty, though, is not restricted to \"developing nations.\" Rural areas in the United States, for instance, confront a very similar mismatch. This is not surprising because education is nearly always understood to consist of universally applicable principle, policy, curricula, and pedagogy. The irrelevance of place is inscribed in this very common view. In fact, education is not universal, it is part of culture. In a real and very practical sense, education is culture. In Buddhism, education is life and life is education. They can not be separated, even by schooling. This is a ground rule that educators and policy makers would do well to keep in mind."}]