[{"section_title": "Abstract", "text": "We evaluated the effect of the divalproex sodium formulation of valproic acid on brain volumes using MRI in people with mild to moderate Alzheimer disease (AD) and assessed for changes associated with behavioral and cognitive effects.\nMethods: Eighty-nine of 313 participants randomized to divalproex or placebo in a 24-month, parallel-group trial received MRI scans at baseline and 12 months. Interval MRI annual percent changes in whole brain, ventricular, and hippocampal volumes were the primary outcomes of interest. Change from baseline in clinical outcomes was assessed at 6-month intervals.\nResults: There were no baseline differences between active treatment and placebo groups in age, education, brain volumes, clinical rating scores, or APOE ⑀4 carrier status. The group treated with divalproex showed a greater rate of decline in left and right hippocampal and brain volumes (Ϫ10.9% and Ϫ12.4% vs Ϫ5.6% and Ϫ6.3%, and Ϫ3.5% vs Ϫ1.4%, respectively), and a greater rate of ventricular expansion (24.5% vs 9.9%) (p Ͻ 0.001). Mini-Mental State Examination scores showed a more rapid decline with divalproex through month 12 (placebo ϭ Ϫ2.0 Ϯ 4.3, divalproex ϭ Ϫ3.9 Ϯ 4.0) (p ϭ 0.037), although there were no changes on other cognitive, behavioral, or functional ratings at 12 and 24 months.\nDivalproex treatment was associated with accelerated brain volume loss over 1 year and perhaps with greater cognitive impairment. The long-term clinical effects of these changes are not known."}, {"section_title": "", "text": "synaptogenesis by inhibition of histone deacetylases. 3 In cultured rat hippocampal neurons, valproate prevents excessive cellular influx of Ca 2ϩ due to glutamate and amyloid ␤-peptide (A␤), protecting against excitotoxic injury. 2 It inhibits A␤ production and neuronal plaque formation in both cellular and mouse models, while improving memory in mouse models of AD. 4, 5 In contrast to these putative neuroprotective effects, several studies have suggested that valproate therapy may cause reversible brain atrophy and cognitive impairment. 6 -10 This report presents results from an MRI substudy of a 24-month randomized, placebo-controlled clinical trial of divalproex sodium (divalproex) for mild to moderate AD, conducted by the Alzheimer's Disease Cooperative Study (ADCS). 11 The goal of the parent study was to determine whether divalproex delayed or prevented emergence of agitation or psychosis and slowed cognitive or functional decline in AD. The goal of this MRI study was to examine the effects of divalproex treatment on brain volumes, and to assess the effects of divalproex on the relationship between brain morphometry, cognition, function, and neuropsychiatric symptoms.\nMETHODS Participants. Trial methods are described in detail elsewhere. 11 Briefly, 313 participants with probable AD 12 were recruited from 46 clinical sites in the United States, of which 19 sites and 172 volunteers participated in the MRI study from November 2005 through March 2009. The main inclusion criteria were age Ն55 years, weight at least 40 kg, Mini-Mental State Examination (MMSE) score 12-20 inclusive, and a requirement not to have experienced agitation or psychosis since illness onset.\nStandard protocol approvals, registrations, and patient consents. Results from the primary randomized treatment trial from which data for this observational MRI subanalysis were obtained are reported separately, 11 and registered at clinicaltrials.gov (NCT00071721). Written informed consent was obtained from the caregiver and either the patient, if possible, or an authorized representative. The study was reviewed and approved by the institutional review board at each site.\nStudy design. Participants were assigned, randomly, to double-blind treatment with either divalproex sodium or identically appearing placebo tablets for 24 months. The primary clinical endpoint was time to emergence of agitation or psychosis, combined with an assessment of the clinical significance of behavioral change rated by the study clinician. 11 Structural MRI scans were acquired at baseline and at 12 months to assess treatment and disease-associated changes in whole brain, hippocampal, and ventricular volumes over time, as a planned secondary analysis in a subset of participants. Randomization was one-toone for the 2 treatment groups in permuted blocks of 4."}, {"section_title": "Intervention.", "text": "A 250-mg enteric coated extended-release formulation of divalproex sodium or identical-appearing placebo tablet was provided by Abbott Laboratories. Participants received one tablet daily by mouth for 1 week, then 2 tablets daily for 1 week; further dose titration occurred in increments of 250 mg, increasing weekly, targeting 10 -12 mg/kg/day with minimum dose targets adjusted to weight and to tolerability. After the initial titration phase, dose reduction was permitted if warranted clinically.\nClinical assessments. Time to emergence of agitation or psychosis was assessed using the Neuropsychiatric Inventory (NPI). 11, 13 Secondary clinical aims included delaying the progression of cognitive, functional, other behavioral and global measures associated with AD. These secondary aims were assessed with the Alzheimer's Disease Assessment Scale-cognitive subscale (ADAS-cog), the Clinical Dementia Rating (CDR), MMSE, ADCS activities of daily living (ADCS-ADL), the ADCS Clinical Global Impression of Change scale (ADCS-CGIC), Cohen Mansfield Agitation Inventory (CMAI), and the Alzheimer's Disease Quality of Life scale (QOL-AD).\nImaging acquisition. All MRI scans were performed on 1.5-T scanners (not older than 8 years at the time of study launch) on various platforms across 19 sites. The imaging sequence used for morphometric analyses was an MPRAGE sequence developed for the Alzheimer's Disease Neuroimaging Initiative (ADNI), 14 distributed to study sites from the Mayo Clinic, Rochester, MN. There were minor variations in the MRI protocol based on the specific hardware configuration on each scanner. The nominal parameters of the MPRAGE sequence were as follows: sagittal plane, repetition time/echo time/inversion time 2,400/3/1,000 msec, flip angle 8°, 24 cm field of view, 192 ϫ 192 in-plane matrix, 1.2 mm slice thickness. A human and phantom scan was acquired during each scanner session. Scanner quality monitoring was performed at the Mayo Clinic using the ADNI phantom. 14 All images were transferred for storage and processing over a secure FTP Internet transfer in DICOM-3 format to a central imaging laboratory at the San Francisco Veterans Administration Medical Center (SFVAMC).\nImage processing. All images were corrected for image distortion due to gradient nonlinearity using GradWarp 15 and for intensity inhomogeneity using N3 16 using a software pipeline running at Mayo. 14 Hippocampal volume segmentation was performed at the SFVAMC. Semiautomated hippocampal volumetry was carried out using a commercially available high-dimensional brain mapping tool (Medtronic Surgical Navigation Technologies, Louisville, CO), that has previously been validated and compared to manual tracing of the hippocampus. 17 Measurement of hippocampal volume was achieved first by manually placing 22 control points as local landmarks for the hippocampus on the individual brain MRI data: 1 landmark at the hippocampal head, 1 at the tail, and 4 per image (i.e., at the superior, inferior, medial, and lateral boundaries) on 5 equally spaced images perpendicular to the long axis of the hippocampus. Second, fluid image transformation was used to match the individual brains to a template brain. 18 The pixels corresponding to the hippocampus were then labeled and counted to obtain volumes. This method of hippocampal voluming has a documented reliability of an intraclass coefficient better than 0.94. 17 Rates of whole brain atrophy and ventricular expansion were performed at the Mayo Clinic using a boundary shift integral (BSI) technique. 19, 20 Differences were calculated in pairwise fashion between the baseline scan and the follow-up scan. Following spatial registration of the follow-up scan to the baseline scan, intensity differences between the 2 scans at the brain-CSF boundary were used to compute change in brain volume. The ventricular atrophy rate was derived by creating a binary ventricular mask for each subject that selectively extracted ventricular change from the BSI. Quality control testing shows that the intraclass correlation coefficient for test-retest reproducibility of ventricle rate measurements from short interval serial MRI scans with this method is 0.91. 21\nAnalysis. Whole brain, total ventricular, and left and right hippocampal volumes were compared between placebo and treatment groups. Annualized percent changes were calculated based on specific individual durations between follow-up scans and baseline scans. This was done as an intent-to-treat analysis (ITT), with an ␣ ϭ 0.05. For cross-sectional analyses, raw volume measures of each structure at baseline and 12 months were standardized as a ratio to the subjects' total intracranial volume (TIV). Wilcoxon rank sum tests were used to compare TIV standardized baseline and month 12 MRI measures and annualized percent volume changes between groups.\nAnalysis of covariance (ANCOVA) models were used to evaluate the impact of potential covariates on group differences in MRI percent volume changes over 12 months. Covariates were included if a variable was unbalanced between groups ( p Ͻ 0.05) and was associated with the volumetric outcome measure being assessed, determined by Spearman rank correlations or Wilcoxon rank sum where appropriate, using an ␣ error criterion p ϭ 0.1. Potential covariates assessed included age, gender, MMSE, total NPI, CDR sum of boxes score (CDR-SB), ADAScog, CMAI, ADCS-ADL, years of education, duration of dementia, APOE ⑀4 carrier status, and baseline standardized MRI volumes. Correlations between 12-month serum divalproex levels and annualized change in MRI volumes were assessed. Generalized estimating equations (GEE) modeling was used for longitudinal analysis, adjusting for covariates as needed, to assess group differences in all clinical measures over the entire 24month study period between groups in this MRI subcohort. In addition, between-group differences in all clinical measures were assessed at baseline, 6-, 12-, 18-, and 24-month time points using Wilcoxon rank sum tests or Fisher exact tests. Survival analysis between groups evaluating the primary endpoint of emergence of neuropsychiatric symptoms over 24 months was independently evaluated in this MRI subgroup. Descriptive statistics were performed on demographic variables using 2-sided t tests and 2 , where appropriate."}, {"section_title": "RESULTS", "text": "A total of 513 participants were screened into the 24-month treatment trial with 313 meeting all enrollment requirements and randomized into the trial (see the primary treatment trial results for details 11 ). Of those enrolled, 172 consented for the MRI substudy and received baseline scans. A total of 149 baseline scans passed planned quality control measures, with 94 of those participants completing a 12-month follow-up MRI scan. Scans were excluded for either image quality/artifact issues or due to a change in scanner between baseline and follow-up. Five additional 12-month scans failed quality control; thus a total of 89 individuals were ultimately evaluated as part of this MRI substudy (46 placebo, 43 divalproex) (table 1). Reasons for MRI substudy dropouts are given in table 2. Eighty-eight individuals had MRI scans that passed quality control review for hippocam- There were no significant between-group differences in baseline mean age, education, years since AD diagnosis, or APOE ⑀4 carrier status. There was a significantly higher body mass index ( p ϭ 0.047) and fewer female participants ( p ϭ 0.034) in the divalproex group compared to placebo (table 1). The treatment group had a mean divalproex serum concentration of 49.3 Ϯ 22.5 g/mL at 12 months. There were no significant differences in other baseline clinical measures (table 3) . Comparison of demographic and clinical measures between the MRI subgroup and the 313 primary trial participants revealed no significant differences.\nAnalyses of imaging measures revealed no statistical differences between treatment groups at baseline or 12 months for hippocampal, whole brain, or ventricular standardized volumes. However, annualized percent volume changes showed significant group differences in all volumetric measures (table 4 and figure) . The most pronounced difference was a change in ventricular volumes of ϩ24.5 Ϯ 13.4% in the divalproex-treated group compared to ϩ9.9 Ϯ 5.7% in the placebo group ( p Ͻ 0.001). Brain volumes changed an average of Ϫ3.5 Ϯ 1.4% in the divalproex group compared to Ϫ1.4 Ϯ 1.1% in placebo-treated participants ( p Ͻ 0.001). Annual hippocampal atrophy showed Ϫ10.9 Ϯ 7.3% reduction on the left and Ϫ12.4 Ϯ 8.8% on the right in the divalproex group compared to Ϫ5.6 Ϯ 7.9% and Ϫ6.3 Ϯ 8.5%, respectively, in the placebo group ( p Ͻ 0.001).\nGEE models of clinical assessments over 24 months revealed no group differences in any measures. Similarly, no differences in the NPI primary outcome measure were found between groups in survival analyses. Evaluation of clinical and demographic measures revealed that sex and BMI, although unbalanced at baseline, were not associated with annual percent volume changes. At each 6-month time point between baseline and 24 months, there were no significant group differences in any clinical measures. However, when group differences in clinical measures were assessed for change from baseline at each trial time point, MMSE alone was found to have different rates of change between groups at month 6 and month 12 MMSE change scores were added as covariates to ANCOVA models assessing group differences in MRI annual percent volume changes. All annual percent volume changes remained significantly different between groups in these models ( p Ͻ 0.01). Finally, annual percent change in whole brain (rho ϭ Ϫ0.46, p ϭ 0.014) and ventricular volumes (rho ϭ 0.61, p ϭ 0.0005) but not hippocampal volumes correlated with month 12 divalproex serum concentrations. DISCUSSION We observed unexpected increased rates of brain volume loss associated with divalproex sodium in elderly individuals with AD. Over 24 months we found no cognitive, neuropsychiatric, or functional differences noted between groups, and no overall differences in cognitive change over time, consistent with the negative findings in the larger primary 24-month treatment trial. 11 However, the divalproex MRI subgroup experienced an accelerated decline in MMSE scores in the first 12 months of the trial, without similar findings in other global cognitive tests. Reversible encephalopathy is a rare complication associated with VPA treatment. 22, 23 This is variably related to hepatotoxicity and hyperammonemia. 24, 25 Even in the absence of frank valproate-induced hyperammonemic encephalopathy, there are reports of reversible cognitive deficits associated with VPA use. 7, 10 One prospective study of 36 epilepsy patients (age ranging from 22 to 74) with VPA levels in the normal therapeutic range reported an 86% incidence of cognitive impairment, with degree of cognitive adverse effects highly associated with increased age. A total of 72% improved after discontinuing VPA. 26 Since patients with AD are likely sensitive to other neurotoxic insults 27, 28 it is possible that the same potentially neurotoxic effects of divalproex associated with brain volume loss in the first 12 months of this longitudinal study also caused the initial rapid decline in MMSE scores observed here. Notably, analysis of adverse events and laboratory data from the primary ADCS divalproex treatment trial showed no evidence of significant neurotoxicity in any participants during the 24-month study. 11 Transient reversible brain atrophy is a known, but rare, observed adverse reaction to valproate sodium and VPA therapy. 6,7,10,29 -31 The drug prescribing information states that \"several reports have noted reversible cerebral atrophy and dementia associated with valproate therapy.\" However, mechanisms underlying these brain changes are poorly understood, with no previous reports in elderly individuals with AD. Possibilities include divalproex-related osmotic changes, neurotoxicity, and acceleration of AD pathology. Valproate has been shown to decrease brain levels of myoinositol (MI), a known brain osmolyte, and upregulate glycine on magnetic resonance spectroscopy even in the absence of clear hyperammonemia. 23, 30 This may support a theory of global or localized osmotic shifts associated with the brain volume changes demonstrated in the present study. Despite evidence of potential neuroprotective properties of divalproex, 3 there may be neurotoxic effects similar to those causing hepatotoxicity and hyperammonemia from divalproex-induced impairment of mitochondrial ␤-oxidation and urea cycle activity. 30, 32 Divalproex may further exacerbate mitochondrial toxicity in people with existing genetic sensitivity (such as Pro to Ser/MTATP8 mutations) 7 or other mitotoxic disorders such as AD. 33, 34 One study recently demonstrated VPA to reversibly inhibit neurofilament production and neurite outgrowth. 35 This suggests the possibility that VPA may exacerbate or accelerate the neurodegenerative process of AD. Finally, VPA may inhibit A␤ production and neuronal plaque formation, 5 as well as accelerate microglial phagocytosis of A␤ 1-42 . 36 No measure of CSF or cerebrocortical amyloid was performed in the current study. It is interesting to note, however, that AN1792, a synthetic amyloid-␤ peptide vaccine shown to reduce cortical amyloid in patients with AD, also resulted in brain, ventricular, and hippocampal changes similar to those seen in this study. 36, 37 Notably, the annual rates of cortical atrophy in our placebo group were consistent with previously reported rates in similar AD cohorts. 38 -41 Interpretations of these results are limited with respect to clinical and pathologic implications. In particular, we do not have imaging data after 24 months of divalproex treatment or after discontinuation of drug. Therefore it is not known if, like the MMSE scores, brain volumes later reverted to match the placebo group by the end of this 24-month trial, potentially representing a transient effect of divalproex treatment. And we do not know if these effects were reversible after divalproex discontinuation, or had an impact on future AD decline and prognosis. This pre-planned region-of-interest assessment of whole brain, ventricular, and hippocampal volumes does not allow us to infer that the morphologic effects associated with divalproex treatment were due to acceleration of AD pathology, vs nonspecific global neurotoxicity. We cannot advocate additional divalproex or VPA treatment trials in dementia given the risks and potentially detrimental findings presented here."}, {"section_title": "AUTHOR CONTRIBUTIONS", "text": "Dr. Fleisher: drafting/revising the manuscript, study concept or design, analysis or interpretation of data, acquisition of data, statistical analysis, study supervision. Dr. Truran: drafting/revising the manuscript, analysis or interpretation of data, acquisition of data, study supervision. Dr. Mai: analysis or interpretation of data. Dr. Langbaum: drafting/revising the manuscript, analysis or interpretation of data, statistical analysis. Dr. Aisen: study concept or design, analysis or interpretation of data, study supervision. Dr. Cummings: drafting/revising the manuscript, study concept or design, analysis or interpretation of data, acquisition of data, statistical analysis, study supervision, obtaining funding. Dr. Jack: drafting/ revising the manuscript, analysis or interpretation of data, contribution of vital reagents/tools/patients, acquisition of data. Dr. Weiner: drafting/ revising the manuscript, study concept or design, analysis or interpretation of data, acquisition of data, study supervision. Dr. Thomas: drafting/ revising the manuscript, statistical analysis, study supervision. Dr. Schneider: drafting/revising the manuscript, study concept or design, analysis or interpretation of data, acquisition of data. Dr. Tariot: drafting/ revising the manuscript, study concept or design, analysis or interpretation of data, study supervision."}]