[{"section_title": "Abstract", "text": "Objective: To identify plasma biomarkers for the diagnosis of Alzheimer disease (AD).\nDesign: Baseline plasma screening of 151 multiplexed analytes combined with targeted biomarker and clinical pathology data.\nSetting: General community-based, prospective, longitudinal study of aging.\nParticipants: A total of 754 healthy individuals serving as controls and 207 participants with AD from the Australian Imaging Biomarker and Lifestyle study (AIBL) cohort with identified biomarkers that were validated in 58 healthy controls and 112 individuals with AD from the Alzheimer Disease Neuroimaging Initiative (ADNI) cohort.\nResults: A biomarker panel was identified that included markers significantly increased (cortisol, pancreatic polypeptide, insulinlike growth factor binding protein 2, ␤ 2 microglobulin, vascular cell adhesion molecule 1, carcinoembryonic antigen, matrix metalloprotein 2, CD40, macrophage inflammatory protein 1␣, superoxide dismutase, and homocysteine) and decreased (apolipoprotein E, epidermal growth factor receptor, hemoglobin, calcium, zinc, interleukin 17, and albumin) in AD. Cross-validated accuracy measures from the AIBL cohort reached a mean (SD) of 85% (3.0%) for sensitivity and specificity and 93% (3.0) for the area under the receiver operating characteristic curve . A second validation using the ADNI cohort attained accuracy measures of 80% (3.0%) for sensitivity and specificity and 85% (3.0) for area under the receiver operating characteristic curve.\nThis study identified a panel of plasma biomarkers that distinguish individuals with AD from cognitively healthy control subjects with high sensitivity and specificity. Cross-validation within the AIBL cohort and further validation within the ADNI cohort provides strong evidence that the identified biomarkers are important for AD diagnosis."}, {"section_title": "", "text": "A LZHEIMER DISEASE (AD) IS the most common form of dementia, affecting more than 27 million persons worldwide and predicted to affect 86 million people by the year 2050. 1 The disease is characterized morphologically by an overall loss of synapses and neurons and an overall reduction in brain volume. 2 The identification of peripheral biomarkers of the disease process leading to an effective and early diagnostic test for AD would allow for presymptomatic detection of disease and would be valuable for monitoring the ef-ficacy of disease interventions during clinical trials.\nCurrently, cerebrospinal fluid (CSF) has provided the most promising source of validated AD biomarkers. A decline in ␤-amyloid (A␤) levels in the CSF has been reported to help distinguish between patients with AD and elderly individuals without AD. [3] [4] [5] [6] [7] In particular, the longer 42amino acid isoform A␤1-42 in combination with levels of the phosphorylated microtubule-associated protein tau (p-tau) has been advocated for use in the diagnosis of AD. 8 Perrin and colleagues 9 identified other biomarkers, including neuronal cell adhesion molecule, YKL-40 (YKL represents the first 3 N-terminal amino acids and 40 denotes molecular mass in kilodaltons; also known as human chitin-ase 3-like 1, cartilage glycoprotein 39, and chondrex), chromogranin A, and carnosinase I, which improved the diagnostic accuracy of A␤1-42 and p-tau. Craig-Schapiro and colleagues 10 used a biomarker discovery method from rules-based medicine (RBM) to identify novel CSF biomarkers that distinguish between very mild dementia, mild dementia, and no dementia.\nCompared with CSF, blood analysis has advantages as an approach to population-based disease screening because it is simpler and less invasive. As such, there has been strong interest in obtaining usable blood-based biomarkers for AD diagnosis. Ray et al 11 identified a panel of 18 biomarkers from a group of 120 signaling proteins and, more recently, O'Bryant and colleagues 12, 13 used a panel from RBM to identify a list of 30 biomarkers to detect AD. Soares and colleagues 14 describe a list of biomarkers identified within the Alzheimer Disease Neuroimaging Initiative (ADNI) cohort in this issue. Herein, we describe a short articulated panel of blood-based biomarker candidates obtained by comparing clinical factors with blood-based measures from the Australian Imaging, Biomarkers and Lifestyle (AIBL) study, a prospective longitudinal cohort study of aging in Australia. 15 This biomarker panel was then validated in the ADNI cohort. The biomarkers identified in this crosssectional analysis of data from the AIBL study may contribute toward the development of a blood-based diagnostic test, which together with appropriate imaging phenotypes may deliver an accurate means to diagnose AD."}, {"section_title": "METHODS", "text": ""}, {"section_title": "STUDY COHORTS, SAMPLE PREPARATION, AND MULTIPLEX PANEL", "text": "This study refers to initial biomarker screening in 754 healthy individuals serving as controls (HCs) and 207 participants with AD, drawn from the AIBL study. 15 Blood samples were collected from all patients (fasting) on arrival at both Australian sites and were fractionated within 2 hours of collection and snap frozen in liquid nitrogen. 15 Full blood pathology testing (Melbourne Health and PathWest Laboratory Medicine) and apolipoprotein E (APOE; OMIM ϩ107741) genotyping, 16 were performed. The APOE genotype discussed within this article relates to testing all possible APOE genotypes. Plasma (EDTA plus 33 ng/mL prostaglandin E1; Sapphire Biosciences) samples from the AIBL cohort were analyzed with a 151-analyte multiplex panel (Human DiscoveryMAP, version 1.0; RBM). All sample results below the lower limit of quantitation were classed as missing data. Plasma A␤1-40 and A␤1-42 peptides were measured using a commercial assay (INNO-BIA plasma A␤ assay; Innogenetics, Inc) and a well-documented double sandwich enzyme-linked immunoassay technique, 5,17,18 as described previously. 19 Total APOE and APOE4 protein levels were measured in plasma from fasting participants using a commercial assay (APOE4/Pan APOE ELISA; MBL Co, Ltd), as previously described. 20 Total plasma (lithium heparin) metal iron levels were measured by induction-coupled plasma mass spectrometry. Seven metals were measured: chromium (isotopes 52 and 53; Cr), copper (isotope 65; Cu), iron (isotope 57; Fe), rubidium (isotope 85; Rb), selenium (isotope 78; Se), and zinc (isotope 66; Zn). All available data from a subset of the ADNI study cohort (HC, 58; AD, 112) measured for the RBM protein analyte panel and various clinical pathology measures were used for validation purposes. Infor-mation regarding biological preparation of ADNI samples and analysis of the RBM Human DiscoveryMAP panel can be found at the ADNI websites [21] [22] [23] (see also the eAppendix; http://www .archneurol.com)."}, {"section_title": "STATISTICAL ANALYSIS", "text": ""}, {"section_title": "Demographic and Biomarker Effect Size Comparisons", "text": "To compare the basic demographic statistics between the cohorts, 2 analyses (P value from Fisher exact test when necessary) and Mann-Whitney tests were used. A generalized linear model was used, adjusted for age, sex, and APOE genotype, to determine overall biomarker differences between HC and AD individuals. Using the Bonferroni multiple adjustment approach, the ␣ value for P value comparison was .0003 (.05/ 174). Fold protein change was calculated using unadjusted raw expression values to provide a relative protein difference between HC and AD individuals. The R statistical software environment, version 2.10, was used for all statistical analyses. 24"}, {"section_title": "Method Overview", "text": "A preanalysis stage (eAppendix) was implemented incorporating data cleaning, transformation, and imputation (values available on request from the corresponding author). Subsequently, variable selection and class prediction analyses were conducted to choose a short list of blood-based protein biomarkers to predict AD. Two sets (primary and validation) of variable selection techniques were used, with findings validated with linear support vector machine analyses. Figure 1 provides an overview of the statistical approaches used; expanded details of biomarker selection, cross-validation, and prediction validation are provided in the eAppendix. Variable selection approaches were conducted independently, and results were collated. Biomarkers were chosen for further analyses if they were selected in each variable selection method. Findings were validated using the secondary cohort, ADNI. Sample comparisons to outline the cohort differences were con- ducted, and accuracy statistics from prediction analyses are presented."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "BASELINE CHARACTERISTICS", "text": "Baseline sample characteristics of the AIBL and ADNI cohorts for demographic and clinical classifications are presented in Table 1 . Comparisons were undertaken between cohorts with respect to HCs, AD cases, and a combined overall grouping. Significant distributional differences were found for age, educational level, APOE genotype, and Clinical Dementia Rating (CDR) score; no significant differences in the distributions of body mass index (BMI; calculated as weight in kilograms divided by height in meters squared) and sex across the 2 cohorts were observed (Table 1) . When the groups were stratified, the proportions of AD participants were very similar for both CDR and APOE genotype, whereas the proportions of HCs for the same demographic variables were significantly different (CDR, P=.0004; APOE genotype, P=.003). On average, the Mini-Mental State Examination score was lower in AIBL AD participants than in ADNI AD participants, whereas HCs in both cohorts had the same Mini-Mental State Examination score. Comparing age between cohorts, the AIBL cohort had a higher proportion of younger (Ͻ70 years) HCs than did the ADNI cohort (35% vs 4%) and also had a higher proportion of older (Ն80 years) participants with AD (68% vs 52%). Healthy controls from the AIBL cohort tended to have more years of education compared with those from the ADNI, and there was a higher proportion of HCs in the ADNI cohort who had a CDR score of 0.5. In addition to the cohort comparisons presented in Table 1 , BMI and educational levels were compared between the AD and HC groups (AIBL sample data). Data on educational level were collected using published standards 15 (Table 1) ; however, for the purposes of these analyses, 3 groups were created (Ͻ9, 9-12, and Ն13 years of education). Compared with HCs, the AD group was 3.7 times more likely to have fewer than 9 years of education (P Ͻ .0001). Body mass index was categorized into 3 levels (Ͻ25, 25-30, and Ͼ30). Healthy controls were 2.8 times as likely to have BMIs greater than 30 than were individuals with AD (P = .002). "}, {"section_title": "BIOMARKER DATA SET COMPARISONS", "text": "After data cleaning and imputation, characterization of the biomarker data sets from the AIBL and ADNI cohorts revealed that, of the multiplexed biomarkers assayed, 111 were suitable for analysis from the AIBL cohort and 136 were suitable from the ADNI cohort (remaining biomarkers had Ͼ10% missing values). Of these, 96 were common to both cohorts. In addition to these protein markers, 52 standard clinical pathology markers, 7 markers of metal ions, and circulating levels of A␤1-40 and A␤1-42 were measured in the AIBL cohort. Thirty-eight clinical pathology markers were available from the ADNI cohort, of which 22 matched those from AIBL.\nComparing protein values between HCs and AD patients, 21 biomarkers showed a significant fold change (P Ͻ .0003) (Table 2) from the AIBL cohort, but only 2 biomarkers from the ADNI cohort were altered at this level of significance (P Ͻ .0003). The eTable compares the top 21 biomarkers from the AIBL and ADNI cohorts from variable selections, according to fold change. Biomarkers among the top 21 from both the AIBL and ADNI cohorts included pancreatic polypeptide (PPY), tissue inhibitor of metalloproteinases 1, tumor necrosis factor receptor-like 2, and vascular cell adhesion molecule 1 (VCAM1). Analytes only available in the AIBL cohort that were significantly altered in the AD participants compared with HCs (P Ͻ .0003) included homocysteine, interleukin 10 (IL-10), IL-17, and zinc."}, {"section_title": "BIOMARKER SELECTION IN THE AIBL COHORT", "text": "From a total of 174 biomarkers, 18 markers were selected in the AIBL cohort: 11 markers from the RBM array, 5 clinical pathology variables, 1 metal ion, and the commercial assay for APOE ( Table 2) . Of the 21 biomarkers that showed a significant fold change in AD patients compared with HCs, 6 biomarkers that were selected using the suites of variable selection methods did not reach significance once they were adjusted for age, sex, APOE genotype, and Bonferroni multiple comparisons ( Table 2 ). The protein fold difference between AD patients and HCs was highest for insulinlike growth factor binding protein 2 (IG-FBP2) (1.61-fold). Pancreatic polypeptide was the only other protein that was at least 1.5-fold greater in AD patients compared with HCs (1.54-fold). Biomarkers were selected for prediction if they were chosen from all 4 statistical methods in set 1 (random forest, boosted trees, regression trees, and linear models for microarray), and were then validated using set 2 (best first, greedy stepwise, forward selection regression, and significance analyses of microarray) or recursive feature elimination-support vector machine. The number of biomarkers that were selected by these methods and that were common between the sets is illustrated in Figure 2 . Biomarkers that were selected in at least 2 of 3 methods (21 biomarkers) were subject to statistical analysis pathway 2. Further statistical assessment of the 21 biomarkers (stepwise removal of biomarkers based on predictive accuracy) removed 3 biomarkers (tumor necrosis factor re-ceptor-like 2, tissue inhibitor of metalloproteinases 1, and vascular endothelial growth factor), leaving a final panel of 18 biomarkers (biomarker set A; Table 2 )."}, {"section_title": "DISEASE PREDICTIONS", "text": "Model predictions in the AIBL cohort (Figure 3A) for the demographic variables (age, sex, and APOE genotype) resulted in a sensitivity and specificity (SD) of 77% (3.0%) and an area under the receiver operating characteristic curve (AUC) of 84% (3.0%). Adding biomarker set A to age, sex, and APOE genotype improved the sensitivity and specificity to 85% (3.0%) and the AUC to 89% (3.0%). Reducing the number of biomarkers to 8 (cortisol, IGFBP2, PPY, IL-17, VCAM1, ␤2 microglobulin [B2M], epidermal growth factor receptor, and carcinoembryonic antigen; biomarker set B) reduced the sensitivity and specificity by only 2%. Adding covariates such as educational level and BMI increased the sensitivity and specificity by 0.5% in all models. "}, {"section_title": "VALIDATION", "text": "To validate the initial biomarker findings from the AIBL cohort, we used 2 different approaches. First, we crossvalidated the AIBL data using only variables that were available in both cohorts; second, we used the ADNI data as the validation set on which to predict the biomarker model ( Figure 3B ). Using the first approach (IL-17, zinc, and homocysteine were removed), we obtained sensitivity and specificity (SD) of 83% (3.0%) and an AUC of 87% (3.0%). With ADNI protein data for validation (the second approach), reduced accuracy statistics were identified; however, the shorter biomarker set B performed better than the longer biomarker set "}, {"section_title": "COMMENT", "text": "In this study, we identified an 18-biomarker signature panel for the diagnosis of AD in the AIBL cohort and validated them in the ADNI population. We showed that including demographic and clinical information (educational level and BMI) together with these blood-based biomarkers and adjusting for age, sex, and APOE genotype strengthens the accuracy of disease prediction. The validation analyses using both cohorts demonstrated the strength of the chosen biomarkers. Reducing the number of biomarkers in the signature panel to 8 (B2M, carcinoembryonic antigen, cortisol, epidermal growth factor receptor, IGFBP2 IL-17, PPY, and VCAM1) using the AIBL data reduced the accuracy of the predic-tion by only 2%; the same reduction using the ADNI data as the validation set increased the prediction accuracy over using the full set of 18 biomarkers. Reducing the signature of biomarkers in the diagnostic panel increases its usefulness, initially within the clinical setting and after further validation for population screening. We acknowledge that the differences between the 2 cohorts, such as the reduced number of samples, the ratio of AD patients to HCs, and the differences in age, educational status, CDR score, and APOE ε4 allele status, may all play a role in validation accuracy.\nFrom all biomarkers identified, cortisol, IGFBP2, and PPY were the ones most frequently chosen. The elevation of cortisol in AD participants presented herein and its presence as a part of the biomarker signature are in concordance with previously published studies. 25 Moreover, Lupien et al 26 found that prolonged exposure to the adrenal glucocorticoid aligns with reduced hippocampal volume and hippocampus-related memory tasks. Porter and Landfield 27 proposed multiple hypotheses regarding the aging effects of prolonged exposure to adrenal hormones and suggested that the interaction between aging, stress, and glucocorticoids increases vulnerability and cognitive impairment. The effects of chronic glucocorticoid exposure and hippocampal volume in animal models have been summarized by Tata and Anderson. 28 Recently, McAuley et al 29 showed, from an in silico model, a potential 30% to 40% decrease in hippocampal activity with long-term elevated levels of cortisol. They showed that a biological intervention to such a system might reduce the decrease of hippocampal activation by 22%. However, subsequent reports have shown that cortisol is both a putative biomarker, as part of a large panel, for the classification of patients with schizophrenia 30 and is elevated in that population. 31 These data, together with the results from the present study, indicate that further research validating cortisol levels across different neurologic diseases is required to determine its specificity.\nIn addition to the present study on blood-based biomarkers, IGFBP2 was found to be higher in the CSF of individuals with AD in 2 other studies. 32, 33 The second of these studies 33 reported a significant increase in IGFBP2 in both CSF and serum. A more recent study, 10 using the same multiplex panel as in the present study, failed to detect a significant change in IGFBP2 levels in the CSF of patients with AD; however, IGFBP2 was correlated with the levels of CSF tau. To the best of our knowledge, the study of Craig-Schapiro and colleagues 10 has been the only other one to find PPY and IL-17 significantly altered in the CSF of individuals with AD compared with the CSF of HCs.\nDavidsson et al 34 identified B2M along with APOE and others as significantly altered proteins in the CSF of participants with AD compared with healthy controls. Our study showed increased B2M levels among patients with AD compared with controls; B2M is a small component of the major histocompatibility complex class I heavy chain and is involved with membrane turnover and elimination. Furthermore, because there is evidence that B2M is increased in other diseases in which the immune response is elevated, research has suggested that it is a marker of the immunologic state in vivo. 35 To our knowledge, this study is the first to show a relationship between epidermal growth factor receptor and AD. Zhang et al 36 found that the Alzheimer A␤ precursor protein intracellular domain (released as a result of ␥ secretase cleavage) mediated the transcriptional regulation of epidermal growth factor receptor. It is thus possible that in the presence of abnormal A␤ amyloid precursor protein there may be a corresponding increase in the transcription of epidermal growth factor receptor and an increase in serum levels of EGFR. Further research focused on the gene expression of EGFR is currently under way to validate this hypothesis.\nCarcinoembryonic antigen has not previously been found to be associated with AD. Carcinoembryonic antigen, like VCAM1, is a cell adhesion molecule and belongs to a large family of immunoglobulins. O'Bryant et al 12 suggested an inflammatory endophenotype of AD from the large proportion of inflammatory markers identified in their study. Our finding of markers such as carcinoembryonic antigen, VCAM1, IL-17, macrophage inflammatory protein 1 ␣, and B2M is related to immune system functionality and supports the hypothesis that there is an inflammatory endophenotype in AD.\nOur results agree with those of O'Bryant and colleagues 12, 13 in that there is an abundance of inflammatory markers in our findings; however, this may be the result of the high proportion of inflammatory markers in the RBM panel used in both studies by O'Bryant et al 12, 13 and in our study. Certainly, newer RBM biomarker panels have more proteins from multiple pathways represented.\nWe also report considerable overlap with biomarkers identified by Soares and colleagues, 14 in particular with respect to univariate analyses, for which increased lev-els of N-terminal pro-brain natriuretic peptide (NT-proBNP), eotaxin 3, matrix metalloproteinase 1, PPY, and tenascin C and decreased levels of IgM and APOE were reported. Furthermore, multivariate analyses identified that APOE and NT-proBNP were of particular importance in contributing to the increased accuracy of the classification of AD. 14 Although we also identified decreased APOE (in biomarker set A), NT-proBNP was not included in the multiplexed panel used in this study; however, its identification in CSF by Craig-Schapiro and colleagues 10 provides evidence of its probable importance in AD. Likewise, there is growing support for the importance of APOE protein levels as a biomarker for disease. 14, 20 We performed rigorous statistical analyses of a large biomarker set from the AIBL study and validated these results using comparable biomarker data from the ADNI study. Using a suite of statistical methods, we found the markers cortisol, PPY, IGFBP2, IL-17, VCAM1, B2M, EGFR, and carcinoembryonic antigen to be part of a bloodbased signature to determine AD. We stress the importance that the biomarkers identified are blood based. Such an improvement in diagnostic predictive power over the base model of age, sex, and APOE ε4 allele has identified the combinatorial strength of blood-based markers, in which prior benchmarks are derived from highly sensitive but invasive CSF testing. Selection of these biomarkers after such thorough statistical analysis and validation of these markers using a second cohort provide strong evidence of their importance in AD pathogenesis and, in turn, AD diagnosis. Whether their accuracy can be improved in combination with biomarkers identified in recent studies needs to be determined. Age, sex, and APOE genotype Age, sex, APOE genotype, and biomarkers set A Age, sex, APOE genotype, and biomarkers set B AIBL validation AIBL validation, ADNI markers ADNI validation set A ADNI validation set B Figure 3 . Receiver operating characteristic (ROC) curves for comparison of biomarker set performance in the Australian Imaging Biomarker and Lifestyle study (AIBL) and the Alzheimer Disease Neuroimaging Initiative (ADNI) data sets. A, The ROC curves represent the area under the ROC curve (AUC) as tested using the AIBL data only. The AUC comparison in the AIBL data set used (1) age, sex, and presence of the apolipoprotein E (APOE) ε4 allele (red line); (2) age, sex, APOE ε4 allele, and the 18-variable biomarker set A (green line); and (3) age, sex, APOE ε4 allele, and the reduced 8-variable biomarker set B (blue line). B, The ROC curves represent a comparison between class predictions when using only AIBL protein biomarker data or when using ADNI protein biomarkers as the validatory data set. The AUC comparison of 4 different prediction models used (1) the AIBL data set: age, sex, presence of the APOE ε4 allele, and biomarker set A (red line; equivalent of green line in A); (2) cross validation of the AIBL data set using markers available from both cohorts, that is, age, sex, presence of the APOE ε4 allele, and biomarker set A minus interleukin 17 (IL-17), Zn, and homocysteine (blue line); (3) the ADNI data set: age, sex, presence of the APOE ε4 allele, and biomarker set A minus IL-17, Zn, and homocysteine (green line); and (4) the ADNI data set: age, sex, APOE ε4 allele, and biomarker set B minus IL-17 (yellow line).\nOnline-Only Material: The eAppendix and eTable are available at http://www.archneurol.com. Additional Contributions: We thank all those who participated in the study for their commitment and dedication to helping advance research into the early detection and causation of AD."}]