[{"section_title": "Abstract", "text": "Abstract In reporting the Australian results of the 2006 Adult Literacy and Life Skills Survey (ALLS), the Australian Bureau of Statistics (ABS, Adult literacy and life skills survey, summary results, Australia, 2008a, p. 5) stated that of the five internationally identified levels of literacy and numeracy in the survey, Level 3 is regarded by the survey developers as the 'minimum required for individuals to meet the complex demands of everyday life in the emerging knowledge-based economy'. In effect, this Level 3 criterion, in the wake of traditional functional literacy/illiteracy dichotomies, creates yet another 'single measure' through which to distinguish those who can from those who cannot function in society. The Level 3 criterion and the accompanying verbatim quote have since been cited extensively by powerful institutions, including government, industry and skills in their promotion of a crisis discourse in adult literacy and numeracy. This has led in turn to national policy responses on 'foundation skills' and nationally agreed performance targets (by the Council of Australian Governments) for skills and workforce development based on the ALLS Level 3. In this paper we question the validity, origin and significance of the Level 3 criterion and contend that highlighting this aspect in the reporting of the ALLS has resulted in a narrow and unbalanced perspective on the role of literacy and numeracy in society."}, {"section_title": "", "text": "Whenever mathematics is employed to recommend or set in motion a certain course of action, it is done on the basis of a criterion. One never knows the validity of the criterion nor does one know the full implication of putting a particular criterion to work. (Davis and Hersh 1986, p. 74) Introduction: the level 3 criterion This paper discusses something very specific, a single sentence in a report of a national survey which has had ramifications for adult literacy policy and practice in Australia in the few years since its publication. In the introductory sections of the Adult Literacy and Life Skills Survey (ALLS), Australia's official statistical organisation, the Australian Bureau of Statistics (ABS 2008a) , outlines the different literacy domains in the survey and the proficiency scales across 5 levels. The report then states:\nTo assist with interpreting the results, Level 3 is regarded by the survey developers as the 'minimum required for individuals to meet the complex demands of everyday life and work in the emerging knowledge-based economy'. (ABS 2008a, p. 5) The authority of this quote is immediately clarified with an attribution (without a page number) to the publication Learning a Living: First results from the Adult Literacy and Life Skills Survey, which the report states is available from Statistics Canada's website (www.statcan.ca).\nThis Level 3 criterion and the above verbatim quote, together with the specific statistics resulting from them, have been cited extensively in recent years by leading government, industry, skills and other organisations in many different forums in their promotion of a discourse of crisis in adult literacy and numeracy in Australia. The Level 3 criterion features strongly in the recent National Foundation Skills Strategy for Adults, and has been consolidated as a key proficiency standard under the National Agreement on Skills and Workforce Development (COAG Reform Council 2009 , 2010 .\nSince the late 1980s many adult literacy policymakers, researchers and practitioners in Australia have promoted the view that there is 'no single measure' of the literacy and numeracy levels of Australian adults (e.g. Wickert 1989) , and yet, the ABS's use and interpretation of the ALLS Level 3 in its official publication can be seen to represent yet another single measure. Instead of the traditional simplistic functional literacy/illiteracy dichotomy, we now have another simplistic dichotomy-those who can and those who cannot function (or cope or participate) in society based on the ALLS Level 3.\nOur focus in this paper is limited to a critical analysis of the nature and effects of this Level 3 criterion and its accompanying quote. Our primary concern is not with the ALLS findings per se, rather, how the ABS has chosen to report the findings. We make the case that without the above single sentence on Level 3 as the 'minimum required…' in the ABS report, much of the reporting of the ALLS would have been different, and would have had much less of an impact in terms of the ways organisations have promoted a discourse of crisis in adult literacy and numeracy in Australia. Further, the Level 3 criterion has encouraged a narrow prescription of the role and nature of literacy and numeracy in Australian society. In analysing the Level 3 criterion we indicate its obscure origin, and we question its validity as an accurate or even useful construct."}, {"section_title": "Background: adult literacy surveys in Australia", "text": "To provide a context to these issues, we begin by providing a brief history of adult literacy surveys in Australia leading to the ALLS. The first survey to have any major impact in the public domain was Goyen's (1977) study of Adult illiteracy in Sydney. Her survey of 1,000 adults in Sydney applied a test of 'survival' literacy (including the ability to read telephone dialling instructions and classified housing advertisements) and found that 3.7 % of English-born adults and 55.8 % of adult migrants of non-English speaking background were illiterate. In a typical media response to these findings, The Australian newspaper reported: 'A nation of illiterates: 225,000 cannot read this headline' (cited in Sawyer 2006, p. 249) . However, what commentators on the survey generally did not question was how Goyen interpreted her survey data to arrive at her findings. In particular, where, along a continuum of literacy scores, did Goyen determine the cut-off point, the criterion score that divides the literate from the illiterate; and why there, rather than at some other point? This issue was commented on at the time by British literacy researcher, Levine (1980, p. 109) , who stated that Goyen's criterion score was 'quite arbitrary and theoretically unjustified'.\nNo single measure was the title of Australia's first national survey of adult literacy (Wickert 1989) . Based on Kirsch and Jungeblut's (1986) study of the literacy profiles of America's young adults, Wickert used item response theory to survey a representative sample of 1,500 adults to provide an account of the literacy levels of Australian adults. Literacy was viewed across 3 dimensions-document literacy (such as using forms and memos), prose literacy (reading and interpreting newspapers and books), and quantitative literacy (applying numerical operations contained in print, such as menus). Proficiency in literacy was based on 5 levels (with scores ranging from 0 to 500) which described how people responded to undertaking a range of simulated literacy tasks within the 3 dimensions. Importantly, as the title of Wickert's publication suggests, commentators on the survey findings were unable to interpret the findings in terms of a single measure. As Lo Bianco (1989, p. viii) in his Foreword to No single measure explained:\nIt resists the temptation to 'score' the population by arbitrarily devising a cutoff point and declaring a whole swathe of the population illiterate, thereby contributing to their stigmatisation and to the unhelpful ideas of literacy as a fixed set of abilities which are mastered or failed in an absolute way … The ABS first played a major role in national adult literacy surveys with its publication Aspects of literacy (ABS 1997) . This survey of over 9,000 respondents used the now familiar 3 dimensions of literacy-document, prose, quantitative, and the 5 proficiency levels, with level 5 the highest. Just a few years before the Australian survey the first International Adult Literacy Survey (IALS) had been undertaken (Organisation for Economic Co-operation and Development [OECD] and Statistics Canada 1995), and while Australia was not one of the original countries involved in the first IALS, the methodology and presentation of the results of the ABS survey followed those of the IALS, thus allowing the Australian results to be compared with those of other countries as reported in the second and third IALS reports (OECD and Human Resources Development Canada 1997; OECD and Statistics Canada 2000) .\nThe ABS (1997, p. x) survey adopted the perspective outlined in both Wickert's study and the IALS (e.g. OECD and Human Resources Development Canada 1997, p. x) that literacy should not be defined in terms of a basic threshold that enables people to be labelled either literate or illiterate. Rather, literacy was defined as a continuum of skills on each of the three literacy dimensions (now referred to as scales). The ABS publication however, did outline the range of abilities to be expected within each of the 5 levels, with several descriptive sentences at each level explaining the difficulties people would have with particular literacy tasks. For level 1, for example, statements included that people 'could be expected to experience considerable difficulties in using many of the printed materials that may be encountered in daily life ' (ABS 1997, p. x) . Of particular interest in this paper is level 3, which included the comment: 'This level represents the ability to cope with a varied range of material found in daily life and at work' (ibid). We note however, that in the extensive and detailed technical reports explaining the methodology of the ABS survey and the IALS (e.g. Kirsch 1997 Kirsch , 2001 , while the range of literacy difficulties is discussed in relation to the various levels, no mention is made of Level 3 being in any way representing the minimum level at which people can generally cope with life and work.\nRecently, Mendelovits (2011) from the Australian Council for Educational Research briefly traces the history of adult literacy surveys and the IALS in Australia, and she maintains Aspects of literacy had relatively little impact in Australia, and she explains this could be due to changes of government at the time of its release, and also in part due to professional resistance from many in the adult literacy field 'who had and have a default antipathy to any kind of standardised assessment' (p. Significantly, unlike in their Aspects of literacy a decade earlier, and also in the international literacy survey on which the ALLS is based (Statistics Canada and OECD 2005, p. 15) , there is no explanation of how literacy is defined in the survey; no mention of literacy as a continuum of skills. The publication simply explains the measures of literacy across four domains: prose literacy, document literacy, numeracy, and problem solving. For this survey an additional fifth domain was also added (as a 'by-product') measuring health literacy. While the domains and tasks build on previous IALS survey methodologies, the same 5 proficiency levels are retained (actually 4 for problem solving). It is in the introductory section describing the measures of literacy that the report states that to assist with interpreting the results, Level 3 is regarded by the survey developers as the 'minimum required for individuals to meet the complex demands of everyday life and work in the emerging knowledge-based economy' (ABS 2008a, p. 5) . This exact quote also features in the health literacy survey results (ABS 2008b, pp. 7-8) .\nThe one-page ABS media release (ABS 2007 ) that accompanied the release of the ALLS is revealing for demonstrating the elements of the ALLS findings that the ABS considers are of most significance in the public domain. After pointing out some minor variations in rates compared with the previous survey a decade earlier, the media release provides seven dot-point findings, the first of which is:\nJust over half (54 %) of Australians aged 15 to 74 years were assessed as having the prose literacy skills needed to meet the complex demands of everyday life and work. Results were similar for document literacy with 53 % and numeracy with 47 % achieving this level.\nOf the following six dot points, two more (relating to people with jobs and recent migrants) also make reference to the skill levels needed 'to meet the complex demands of everyday life and work'. The above percentages are derived from use of the Level 3 criterion-i.e. those who were assessed in levels 3 and above. Thus, the ABS uses the Level 3 criterion as its primary mechanism for interpreting the survey findings, and for highlighting the key findings to be presented to the public. In highlighting the 54 % of Australians who have the prose literacy skills needed to meet the complex demands of everyday life and work, the ABS is also inferring that 46 % of Australians (those at levels 1 and 2) do not have these skills, an inference that many organisational respondents to the survey findings have been quick to recognise and exploit. However, before considering the take-up of the survey findings, we explore the origin of the Level 3 criterion."}, {"section_title": "Tracing the origin of the Level 3 criterion", "text": "In view of the way the ABS highlights Level 3 literacy as its benchmark 'to meet the complex demands of everyday life and work', we would expect to find documentation supporting or at least citing this criterion, but there is surprisingly the level considered by experts as a suitable minimum level for coping with the increasing demands of the emerging knowledge society and information economy (OECD and Statistics Canada 1995) .\nAt this point the source of Level 3 as the 'minimum' level for coping in society starts to become a little obscure. Most certainly it is low in profile in the international OECD and Statistics Canada publications. In a more recent publication Literacy for life: Further results from the Adult Literacy and Life Skills Survey (Statistics Canada and OECD 2011), there is no mention of minimum levels at all. Further, the reference in the above quote to OECD and Statistics Canada (1995) is confusing because it is not referenced correctly. It could refer to the 1995 publication Literacy, economy and society: Results of the first International Adult Literacy Survey, but despite a search of this document, no such reference can be found to Level 3 as a minimum level for coping in society. Or it could refer to a later publication Literacy in the information age: Final report of the International Adult Literacy Survey (OECD and Statistics Canada 2000), which does have two related citations. On detailing the 5 levels of literacy in this publication it states:\nLevel 3 is considered a suitable minimum for coping with the demands of everyday life and work in a complex, advanced society. It denotes roughly the skill requirement for successful secondary school completion and college entry … (p. xi) A few pages later the publication states that Level 3 is 'considered by experts 1 as a suitable minimum skill level for coping with the demands of modern life and work' (p. xiii). In the footnote relating to experts it states: 'Focus groups and experts engaged by the study team responsible for the 1992 US National Adult Literacy Survey'. This is as far back as we have traced the Level 3 criterion, and it may be possible to explore the matter further. But the findings so far are a little concerning and lead us to ask: Is Australia's preoccupation with identifying almost half of its adult population as being unable to meet 'the complex demands of everyday life and work in the emerging knowledge-based economy' based on a criterion determined by a group of 'experts' in the United States in the early 1990s?\nRegardless of the precise origin of Level 3 as a criterion for coping or functioning in life and work, the key point to be made is that in the many volumes of OECD and Statistics Canada publications on the IALS, ALL and the most recent PIAAC (Program for the International Assessment of Adult Competencies), and in the extensive technical literature published to support and justify the survey methodologies, only a few references, almost in passing, are made to the significance of Level 3 for coping or functioning in life and work (see also Boudard and Jones 2003, p. 194; Rubenson and Walker 2011, p. 14) . In those few references, no attempt is made to explain or justify how this criterion became significant or who made such claims (beyond the one reference to the 1992 US group of 'experts'). And yet, in Australia, as a result of the manner of the publication of the ALLS, this criterion takes pride of place in determining how the survey results are interpreted and presented in the public domain.\nThe Level 3 take-up in Australia and the adult literacy crisis discourse From the time of the first release of the ALLS results in Australia in 2007, the incoming federal government has been very receptive to the findings, and has indicated the need for a national response. That response has been mainly in the form of a National Foundation Skills Strategy for Adults (Standing Council on Tertiary Education Skills and Employment [SCOTESE] 2012), which followed a consultation paper (Foundation Skills Working Group 2011) and submissions from stakeholders. Literacy and numeracy from a government perspective henceforth are to be seen as part of 'foundation skills' (which includes 'employability' skills).\nIn the executive summary of the National Strategy (SCOTESE 2012, p. 2) Level 3 is cited, referring to the ALLS, as the level needed 'to meet the complex demands of work and life in modern economies' which is seen to equate to 40, 60 and 70 % respectively of the employed, unemployed and those not in work in Australia. This sets the scene with the extent of the 'problem' of adult literacy and numeracy which the National Strategy then seeks to address. Early in the National Strategy (p. 4) we find a further development in a footnote which states: 'Skill level 3 is considered by the Council of Australian Governments (COAG) to be the minimum level required by individuals to meet the complex demands of work and life in modern economies'. This represents a significant elevation. The Level 3 criterion and its accompanying quote now represent the official view of the COAG, the peak intergovernmental forum in Australia, which includes the Prime Minister, and state and territory leaders. No doubt COAG bases its views on Level 3 on the authority of the ABS (2008a, p. 5), which in turn draws on the authority of Statistics Canada and the OECD (2005), which as we have indicated in the previous section, is questionable.\nThe ALLS Level 3 criterion has in fact become very firmly entrenched in Australian government policy and planning. The COAG Reform Council (2009), established to advise COAG on national reforms to boost productivity and increase workforce participation, considers Level 3 so significant that it has become the measure under the National Agreement for Skills and Workforce Development of 'a proficient standard of literacy required to effectively participate in a modern economy across the working age population' (p. 47). The National Strategy states that the Australian governments have agreed: 'By 2022, two thirds of working age Australians will have literacy and numeracy skills at Level 3 or above' (SCOTESE 2012: 10) . Thus the ALLS Level 3 criterion sits alongside other key measures such as the proportion of adults with qualifications at Certificate III level, to determine Measure of adult literacy and numeracy 131 progress in meeting COAG skills targets. Interestingly, the COAG Reform Council's second yearly performance report (2010) adds to the diversity of ways that the 'minimum level' has been described in this paper so far. Their report (p. 16) states:\nLevel 3 is generally considered by national and international literacy experts to be the minimum level of proficiency required by individuals to meet the complex demands of work and life in modern economies.\nCOAG therefore, in embracing the ALLS findings based on the Level 3 criterion, appears to have introduced a new element of legitimacy-'national and international experts'. But who are these experts? And on what basis do they make their claims for the significance of Level 3? Lack of published evidence from the OECD and Statistics Canada would appear to contradict this statement about experts.\nIndustry and skills groups have also strongly embraced statistics based on the highlighted Level 3 criterion in the ABS (2008a) report. They too, in tune with government, are concerned primarily with increased productivity and workforce participation, and the ALLS Level 3 criterion has been used extensively to make their case for linking improved literacy and numeracy skills with improved productivity. For example, the Australian Industry Group (AIG), which represents employer groups, recently published their research findings on the role of literacy in Australian workplaces (AIG 2012) . At the very beginning of its executive summary (p. i) it states that 46 % of the adult population have 'less than the minimum prose literacy skills'. Thus, their starting point-for a demonstration of the skill 'deficits' that frame their later arguments, is based primarily on Level 3 as the 'minimum required'.\nHeather Ridout, former Chief Executive of the AIG, has been particularly vocal and influential in promoting the literacy crisis discourse in industry and linking it with low productivity. In one national radio broadcast she stated:\nThere are 7 million people in the Australian workforce that just can't do it. They can't read standard operating procedures, for example, which leads to all sorts of safety issues and poor use of machinery … '(Australian Broadcasting Corporation 2010).\nThis quantification of workers who 'just can't do it' is calculated from the percentage of the adult population who fell below Level 3 on the ALLS. In another recent industry report, this time focusing on manufacturing, the term 'functional literacy and numeracy' sees a return to usage, and Level 3 is identified as the level necessary to 'function' at work and in society (AIG/University of Technology, Sydney [UTS] 2012, p. 105). Additional claims are also made that Level 3 'is considered to be the minimum required for successful completion of a vocational Certificate III which is generally held to be a trade level qualification' (ibid). No explanation or reference is provided to explain how the Level 3 on the ALLS correlates with this vocational certificate level.\nAt the risk of unnecessary duplication, similar extensive use of the Level 3 ALLS appears in major national reports on workplace skills. The country's foremost skills organisation, Skills Australia (now Australian Workforce and Productivity Agency) for example, uses Level 3 as the benchmark to propose the need to increase the proportion of 15-64 year olds in Australia to the 'levels required to meet the demands of work and life in modern economies ' (Skills Australia 2011, p. 31) . The increases they propose are from 57 in 2006 to 65 % by 2020, and further increases to 2025. The Industry Skills Councils (2011) in their report No more excuses, while at least acknowledging literacy (and language and numeracy) to be 'enabling, context-dependent skills' that can be demonstrated along a continuum of proficiency (p. 4), also make use of the 7 and 8 million Australians respectively who experience difficulties with literacy and numeracy, based on Level 3.\nVerbatim references to Level 3 as the 'minimum required' and the resulting statistics are not limited to government, industry and skills organisations; they have become an essential part of a crisis discourse and are utilised by many organisations and individuals. Not surprisingly the media has played its role, including comments such as: 'It seems improbable, but an international survey indicates that nearly half of all Australians can't read or write properly' (ABC News, 21 February 2008). Other organisations and individuals drawing on the significance of Level 3 include trade unions (e.g. Australian Council of Trade Unions 2011, p. 1), equity groups (e.g. National VET Equity Advisory Group 2011, p. 9), and even internationally acclaimed academics (e.g. Nutbeam 2009, p. 525) ."}, {"section_title": "What next? more testing and PIAAC", "text": "The perception of an adult literacy and numeracy crisis in Australia, as outlined in the previous section, has resulted in 'an unprecedented surge of national commitment to action on improving adult skills' (Mendelovits 2011, p. 3) . To some degree this commitment is reflected in the federal government's National Foundation Skills Strategy. Our main point demonstrated throughout this paper is that one central element of the published ALLS findings, the role of the Level 3 criterion, has been used by a considerable number of organisations and individuals in their promotion of a crisis discourse. This in turn has lead to major policy responses, including entrenching Level 3 as a measure of national performance targets by COAG, the nation's leading intergovernmental forum.\nHowever, a major difficulty with the use of Level 3 ALLS as a measure for national performance targets is that nationwide adult literacy surveys are undertaken only infrequently, and are insufficient to allow regular (for example, annual) monitoring of progress towards national targets. As a means of overcoming this difficulty, a national project has examined whether the ALLS levels align with an existing assessment tool, the Australian Core Skills Framework (ACSF), which is used to describe skill levels in federal government funded language, literacy and numeracy (LLN) programs (see Circelli et al. 2013) . It was found that the two measures could be empirically aligned at level 1, but Level 3 ALLS was found to be approximately similar to ACSF level 4. Nevertheless, the authors indicate the potential for the ACSF to act as a proxy for the ALLS levels, thus enabling more regular monitoring of performance levels, and the likelihood of a new literacy/ numeracy testing regime in Australian vocational education and training (see Australian Workforce and Productivity Agency 2013, p. 95) .\nRecently the ABS (2013a) published the preliminary Australian findings for the latest international adult literacy and numeracy survey under the PIAAC that has replaced ALLS. The PIAAC builds on the ALLS in terms of its literacy and numeracy domains and tasks (see PIAAC Literacy Expert Group 2009; PIAAC Numeracy Expert Group 2009) , but it retains the same 5 levels of proficiency. The preliminary findings and the accompanying media release (ABS 2013b) do not specifically mention Level 3 as the benchmark for minimum participation in society. However, the ABS (2011) previously made it clear that the results of the PIAAC in Australia:\nwill be critical to providing the evidence base to support the COAG Productivity Agenda and measure its success, specifically the National Agreement on Skills and Workforce Development, and for measuring the progress and success of the National Foundation Skills Strategy … OECD publications in explaining about PIAAC continue to cite Level 3 in the previous IALS as 'the minimum skill level required to cope with the demands of modern societies ' (OECD 2010: 4) ."}, {"section_title": "Why contest it?", "text": "Recent federal government responses to a perceived adult literacy and numeracy crisis brought about largely by the publication of the Australian ALLS are a cause for celebration by many, especially those involved in testing/assessment procedures (Mendelovits 2011) , and also generally by those in the adult literacy and numeracy 'industry' (see Black and Yasukawa 2011, pp. 221-222) . But what we have demonstrated in this paper is that heading the publication of the ALLS findings in Australia has been considerable hype resulting from references to Level 3 as the minimum level for meeting the complex demands of modern life. We consider these references to be unjustified due to lack of documented evidence supporting Level 3 as having significance for any such 'minimum level'. The ABS (2008a, b, c) reporting on the ALLS represents, in our view, the selective use of an unjustified criterion level for a sensationalist impact. Some overseas researchers have similarly recognised the lack of justification for the Level 3 benchmark. St. Clair (2012, p. 773) for example, states: 'the claim that level 3 is the functional level for contemporary society is somewhat problematic and should not be reproduced until there is evidence to support it'. Atkinson (2012, p. 82) relates the arguments to Canadian contexts, indicating that people who have not attained Level 3 'are deemed to be unfit'.\nLo Bianco (2011) in a recent state conference keynote session spoke of the use of statistics as 'the positivistic classical policy making language'. We consider that the statistics resulting from highlighting the Level 3 criterion have been successfully used by a range of stakeholders in their promotion of a crisis discourse, and the statistics have gained considerable traction with government and other leading industry and skills organisations. While there are some researchers who see the use of Level 3 by the ABS as no more than 'the message is simplified' (Caldwell and Webster 2013, p. 107) , we have indicated the implications to be far more profound.\nAs we have indicated in this paper, the OECD and Statistics Canada literature at various times have made reference, almost in passing, to Level 3 as the 'minimum required…' But if this level was seriously considered to be a factor of significance we would expect it to feature prominently and be justified in the international literature. Moreover, focusing on such a criterion represents a contradiction of what the international surveys are designed to do. In all of the major international survey publications, there has been a focus on how literacy should be conceptualised. An early 1995 publication for example, states literacy is a 'complex and multidimensional set of traits, dispositions and competencies', and that thinking in terms of a single literacy cut-off 'is neither appropriate nor conducive to formulating sound policy strategies ' (OECD and Statistics Canada 1995: 24) . A later publication states: 'no single standard of literacy can meaningfully be set' (OECD and Human Resources Development Canada 1997, p. 15) . More recently publications state that skills are defined along a continuum of proficiency and 'there is no arbitrary standard distinguishing adults who have or do not have skills' (Statistics Canada and OECD 2005, p. 15, 2011, p. 14) . But the Level 3 criterion does precisely this-it provides such a cut-off point, an arbitrary standard. Significantly, the ABS (2008a, b, c) publication makes no reference to how literacy and numeracy are defined, thus providing respondents of the survey findings with little explanation of literacy and numeracy beyond that they comprise domains and 'levels'. Hamilton (2001) in a critique of the IALS provides observations that resonate with the ALLS reporting in Australia. She mentions for example, how conceptualisations of literacy as a continuum of skills are the first of common deletions in the reporting of the survey findings by the media (p. 189), to be followed by simplified and exaggerated headlines. More recently Hamilton (2012a, p. 12) states that the reduction of survey findings in the UK to the often-cited '7 million adults' in need of literacy assistance 'became the underpinning rationale for the Skills for Life policy in England and the development of a national test and a core curriculum for the field'. We argue that a similar process would appear to be in train in Australia with the 46 % or 7 million adults who 'just can't do it'. Attributions to the sources of the international research are also replaced by attributions to government agencies (Hamilton 2012b, p. 8) as the survey findings are framed into policy rationale (compare this with 'considered by the COAG to be the minimum level').\nOf central concern to us is the very notion that there can be a literacy and/or numeracy level at which people meet the demands of modern society. As Hamilton and Barton (2000, p. 384) seek to reinforce, the levels of literacy in international surveys 'have been invented statistically; they are not based on people's actual lived practices'. They state further that while the survey statistics may result in more funding to the adult literacy and numeracy sector, they do so 'at the cost of genuine understanding of the range of meanings and the power of literacy in people's lives' (p. 387). Their argument is that an alternative approach to literacy and numeracy is required, one based on analyses of the social practices people engage with in their daily lives. Through in-depth, ethnographic studies of how people use literacy and numeracy in the daily lives, as viewed by the participants themselves, a more situated understanding will emerge of how people may or may not meet the demands of modern life and work. These understanding may well contradict those which result from national and international surveys designed by literacy and numeracy 'experts' working under the umbrella of the OECD.\nThe Level 3 criterion, though it lacks a foundation as we have shown in this article, has played a significant role in ensuring that a particular conceptualisation of literacy and numeracy predominates in Australian society. It is based on literacy and numeracy as foundation skills necessary for increasing productivity in a highly competitive, globalised economy, and thus it is promoted extensively by governments, industry and skills organisations. These groups, due to the institutional power they hold, have 'privileged' certain kinds of literacy and numeracy and certain kinds of knowledge (i.e. those measured by surveys such as ALLS) as superior to others (see Street 1996; Hamilton 2001) . We draw on some work by Freebody (1992) over two decades ago who explained how institutions construct literacy. Powerful institutions (governments, employer groups, industry skills councils) in the context of this paper are in a position to determine what counts and to 'prescribe' their preferred role of literacy and numeracy in Australian society. COAG's adoption of Level 3 as a benchmark national performance target is a perfect example of this. To date these prescriptions in relation to adult literacy and numeracy appear to be accepted uncritically at all levels of Australian public debate. But, as Atkinson (2012, p. 82) writes in relation to the Level 3 from a Canadian perspective, which applies equally in the Australian policy context, 'aggressively asserting something does not necessarily make it so'."}]