[{"section_title": "Introduction Results", "text": "The USDA-National Animal Health Monitoring System (NAHMS) collects farm-level animal health and management information through national studies. The USDA-Economic Research Service (ERS) collects farm-level financial and economic information through the Agricultural Resource Management Survey (ARMS)."}, {"section_title": "Materials and Methods", "text": ""}, {"section_title": "Figure 1: Beef Quality Assurance Program (NAHMS)", "text": ""}, {"section_title": "Conclusions", "text": "This analysis illustrates the benefits in using both the NAHMS and ARMS data sets and highlights the focus, strategies, and economic returns for operations of different size. Implementing future NAHMS and ERS studies in the same or subsequent years would provide valid, detailed data to compare using this type of analytical approach, add value to USDA's efforts in colleting farm level information, and reduce overall response burden. Larger operations are more likely to: • Focus on efficiency • Protect their herd through quarantine biosecurity practices • Implement industry standards that promote product quality • Receive higher proportions of net farm income when compared to gross cash farm income (200 beef cows or more) • Rely less on government payments (500+ beef cows) • Have principal operators that use their college or graduate school educations to supplement income with off-farm opportunities • State their primary occupation as farming, and plan on staying dedicated to the industry for 5 years or more Smaller operations are more likely to: • May face an increased disease risk to build their herd • Protect their herd by cleaning needles between cows during vaccinations • Delay implementing industry developed standards that promote product quality, possibly due to costs • Have principal operators with a primary occupation as work other than farming/ranching • Smallest operations receive higher proportions of net farm income when compared to gross cash farm income (20-49 beef cows) • Exit the market in 5 years, suggesting returns are not enough to continue operating or that some are moving towards retirement"}, {"section_title": "Future Research", "text": "Future research could examine the production-practice decisions of higher and lower economic performers, differences across regions, and differences between producer groups that use specific production practices that promote biosecurity, disease risk reduction, and animal health. Further exploration of the cost of disease control measures may reveal differences across operations of different size. (Figure 2) • The percentage of operations that quarantined all new cattle increased as operation size increased."}, {"section_title": "Disease Risks and Production Practices", "text": "• New animals accounted for a higher average percentage of inventory on smaller operations than on larger operations, suggesting that smaller operations may be facing an increased disease risk while building their herd. • The percentage of operations that cleaned or disinfected needles between cows decreased as operation size increased, suggesting that larger operations are focused on time efficiency. • Calf age and weight were less important weaning factors as operation size increased. • A high percentage of larger operations utilized semen evaluation and were familiar with the results of the National Beef Quality Audit, possibly indicating a heavier focus on improving product quality. (Figure 3) • The percentage of operations in which the operator's primary occupation was farming (excludes retirement, limited resource, residential/lifestyle) increased as operation size increased, as did the percentage of operations in which the operator had completed college or graduate school, or in which the operation was located in rural or urban (non-metro) counties."}, {"section_title": "Operator and Operation Characteristics", "text": "• The percentage of operations in which the operator planned to exit the market within 5 years decreased as operation size increased. • Operations with 500 or more beef cows received the smallest percentage of farm income from government payments. (Figure 4) •The average gross cash farm income, expenses, net farm income, offfarm income, and market value of breeding stock increased as operation size increased."}, {"section_title": "Farm Finances", "text": "•Net farm income was 19, 12, 14, 19, and 19 percent of gross cash farm income for operations with 20-49, 50-99, 100-199, 200-499, and 500+ beef cows, respectively. This could suggest that the smallest and largest operations are managing expenses and leveraging assets to yield higher returns than operations with 50-199 beef cows. •The average off-farm income fluctuated slightly among operations with 20-499 beef cows, but increased dramatically for operations with 500 or more beef cows. This corresponds with the increased percentage of principal operators that completed college or graduate school, and might suggest that operators made investments to supplement farm income. Beef Quality Assurance Program (Figure 1) • The percentage of operations that knew about the Beef Quality Assurance (BQA) Program and used specific recommended BQA practices increased as operation size increased. This finding might indicate that larger operations are more likely to adopt industry developed standards for production practices to increase overall product quality. "}, {"section_title": "Photos: courtesy of Kamina Johnson", "text": ""}]