[{"section_title": "", "text": "and Countercyclical Program (DCP) in 2006 are estimated at $5.2 billion, less than a 1-percent increase from 2005. Total production expenses in 2006 are forecast to rise $11 billion (5 percent) to a record $237.3 billion. The percentage change is less than in 2005, but continues the increase in total production expenses that has occurred in each of the last 4 years. Since a decrease in 2002, total expenses in current dollars will have risen $43.8 billion (22.7 percent). Through October 2006, prices paid overall for crop sector inputs had risen faster than for livestock sector inputs. Farm sector equity is expected to rise by about 7 percent in 2006, as the value of farm assets continues to rise more rapidly than farm debt, driven mostly by increases in farmland values. Debt-to-asset and debt-to-equity ratios continue to improve in 2006, compared with the first half of this decade and average performance over the past four decades. Average farm household income is expected to decline 0.9 percent in 2006 to $80,703, as the decrease in farm income more than offsets the increase in offfarm income. For every year since 1996, average income for farm households has exceeded average U.S. household income; during 1996-2005, the average difference was 15.2 percent. However, family farms are diverse, and the financial outlook for farm operator households varies across the population. producers in 2005 from \"ad hoc and emergency programs\" are not authorized for 2006. Higher market prices for corn in 2006 are resulting in lower loan deficiency payments. Tobacco transition payments are lower because some recipients chose to accept a lump-sum payment in the first year (2005) rather than receive payments over 10 years. The value of the change in inventories accounts for most of the difference in value of production and cash receipts. A positive change represents production available for sale but not sold at the end of the year, and a negative change represents production from a prior year that was reflected in the prior year's net farm income. Crop inventories are expected to decline by $1.5 billion in 2006, following a decline of $1.3 billion in 2005. Continued dry weather in some areas is resulting in lower production levels, and higher prices reduce the incentive to postpone sales until 2007. Livestock inventories are expected to rise by $1.2 billion as ranchers seek to rebuild cattle herds from recent lows. Banner Year for Most Crops, Especially Corn. With the fall harvest completed, the value of crop production (table 1) is forecast to be up by more than $7 billion in 2006. A notable change in U.S. agriculture is the rising importance of ethanol, a renewable energy source. In the mid-1990s, 500,000 bushels of corn were ussed annually to produce ethanol; by 2006, 2 billion bushels of corn are expected to be used. Corn producers are projected to receive record high cash receipts in 2006. Most wheat is grown in drier regions of the world, so moisture conditions are a concern for its producers. Droughts across the globe, particularly in Australia, have tightened world supplies and caused ending stocks to fall by almost a fifth. U.S. prices have risen, enabling cash receipts for wheat in 2006 to approach record levels. Soybean growers, who have high stocks, could experience modestly falling prices and cash receipts in 2006 after harvesting the largest crop on record. Consumers, with rising incomes, are buying more ornamentals and other floral crops, while developers of residential and commercial properties are buying more sod. With these market conditions in 2006, greenhouse/nursery sales are forecast to reach an all-time high of $16.6 billion. Vegetable growers should continual to benefit from rising domestic consumption of fresh vegetables, while fruit/nut growers should continue to be helped by rising prices. These market forces have enabled cash receipts for specialty crops to increase more rapidly in recent years than major governmentsupported program crops (wheat, rice, corn, sorghum, soybeans, and cotton). (table 1) is forecast to be $122.2 billion in 2006, down nearly $5 billion from 2005 but still the third highest on record. Cash receipts for beef producers are forecast to top $50 billion for the first time with greater domestic consumption and an expected doubling of export demand. Export"}, {"section_title": "Beef Rebounds, but Dairy, Pork, and Poultry Slip. Value of livestock production", "text": ""}, {"section_title": "Adjusting for Inflation Using Constant Dollars", "text": "Do upward trends in time series denominated in dollars, such as net farm income and net value added, mean that recipients of the dollars-farmers, contractors, and other stakeholders-are better off? For example, if net value added increases by 3 percent this year, are recipients of agriculture's net value added better off? Not necessarily. People are better off in an economic sense only if the purchasing power of the dollars received increases over time. For example, the percentage rate of increase in net value added must be greater than the inflation rate experienced by farmers, contractors, and other stakeholders. Inflation is the increase in the average price of goods and services as time passes. If price levels increase at a faster rate than value added, the extra dollars of value added do not result in greater purchasing power. A time series of net value added or net farm income representing dollars actually received each year is expressed in \"current dollars.\" One method used to compare current dollar values over time is to convert current dollars to \"constant dollars,\" which measure real purchasing power after inflation. An increase in a constant-dollar time series over time means the recipient's purchasing power has increased. In contrast, an increase in current dollars does not necessarily indicate an increase in purchasing power. AIS uses the term \"constant dollars\" in AIS as well as other terms with the same meaning: \"real,\" \"deflated,\" or \"inflation adjusted.\" Current dollars are converted to constant dollars using the GDP chain-type price index developed by the Bureau of Economic Analysis, an agency of the U.S. Department of Commerce. We use 2000 as our base year of our constant dollar time series. By using the year 2000 as our base year, we treat each year as if the average price level for purchases by agriculture's equity-holders and stakeholders is the same as in 2000. When constant-dollar (or real, deflated, or inflation-adjusted) net value added or net farm income increases or decreases, the purchasing power of agriculture's equity-holders and stakeholders changes in the same direction. Value-added to the U.S. economy by the agricultural sector via the production of goods and services,"}, {"section_title": "2002-2006", "text": "Change Change  Item  2004 to  2005 to  2002  2003  2004  2005  2006  2005  2006 ---------------Billion dollars --------------- demand for beef has been hampered by a ban imposed by most beef importing countries due to mad cow disease or BSE (Bovine Spongiform Encephalopathy restrictions initiated in May 2003). Milk production in 2006 is expected to climb and reach a record high, causing milk prices to decline and cash receipts to fall around $3.1 billion. Foreign demand has become increasingly important for pork producers, with 14 percent of U.S. pork production consumed abroad, up from 6 percent in the late 1990s. Even with pork exports forecast up 11 percent in 2006, average hog prices are expected to fall, pushing cash receipts down by nearly a $700 million in 2006. Cash receipts to broiler producers in 2006 are expected to be the third highest on record at $18.9 billion, still $2 billion lower than 2005."}, {"section_title": "Government Payments Forecast at $16.5 Billion in 2006", "text": "Total direct government payments are expected to total $16.5 billion in 2006, down from the $24.3 billion for 2005, yet up from $13.0 billion for 2004 (table 2, fig. 3). This is nearly 7 percent below the 5-year average. Direct payments under the Direct and Countercyclical Program (DCP) in 2006 are estimated at $5.2 billion, less than a 1-percent increase from 2005. Direct payment rates are fixed in legislation and are not affected by the level of program crop prices. The increase in 2006 is the outcome of a change in the number of farmers taking advantage of the advanced payment in December (optional), rolling more of the payment into the following calendar year. There is little change in direct payments by crop year. Countercyclical payments are forecast to increase from $4.1 billion in 2005 to $4.2 billion in 2006. This follows a 263-percent increase in 2005. For the 2005 crops, increases in payments to corn and peanut producers are expected to offset declines in payments to rice producers. More than half the payments in 2004 and 2005 are to corn producers. About a quarter of the payments are to cotton producers. For the 2006 crops, only sorghum, cotton, and peanut producers are expected to receive payments. Producers may elect to receive countercyclical payments in three installments. The first partial payments are available in October of the calendar year of harvest. The second partial payments are made the following February with the final payments after the end of the marketing year for the program crop. Countercyclical payments in calendar year 2006 include the second partial and final payments for 2005 crops and the first partial payment for 2006 crops. For calendar year 2006, we assume that 60 percent of the producers receive 35 percent of their payment as first partial payments. The second partial and final countercyclical payments (as determined at the end of the respective marketing year) are paid the following calendar year. Partial payments are based on the projected payment rate at the time of the payment, creating the possibility of an overpayment. Marketing loan benefits-including loan deficiency payments, marketing loan gains, and certificate exchange gains-are projected down to $2.0 billion in 2006 from $7.0 billion in 2005. Marketing loan benefits would thus represent 12.3 percent of total government payments. Expected declines in marketing loan benefits to producers of wheat, rice, corn, sorghum, barley, and upland cotton more than offset the increase in Agricultural Income and Finance Outlook / AIS-84 / November 2006 Economic Research Service/USDA  Change  2001-05  Item  2002  2003  2004  2005  2006  2006 to 2005 Avg. 1   ---------------$ million ---------------Percent change   Total direct payments  payments to producers of soybeans, other oilseeds, peanuts, and pulse crops. In 2005, corn producers realized 75 percent of the total marketing loan benefits. Corn marketing loan benefits are expected to decline 71 percent, resulting in corn producers realizing 48 percent of the total marketing loan benefits in 2006. Since cotton marketing benefits are expect to decline only 11 percent, cotton producers may realize 38 percent of the total benefits in 2006. The final marketing assistance loan availability date for 2006 crop wheat, barley, and oats is March 31, 2007, the calendar year after the harvest of the crop. Since this activity can occur any day during the period of availability, any benefit realized as marketing loan gains, certificate exchange gains, or loan deficiency payment for a particular harvested crop may be realized either in the calendar year of harvest or the following calendar year. Although crop years may differ among program crops, marketing loan benefits may be realized over a 2-year period. CCC payments for the Tobacco Transition Payment Program (TTPP) are paid in January. The Commodity Credit Corporation is not authorized to make lump-sum payments, but a third party may. The private party enters into an agreement where the quota holder or producer is to receive a lumpsum payment from them in return for the individual's rights to TTPP payments. Payments reported here include the portion of the CCC payment that went to quota holders and producers plus the lump sum payments received by quota holders and producers that entered into agreement with third parties. However, the portion of the CCC payment that went to third parties is not included. About 16 percent of the tobacco quota contracts were sold in 2005 to third parties, with the respective quota owners and producers receiving lump-sum payments. TTPP payments are expected to be 50 percent lower in 2006. The benefits from this program are realized primarily by producers in the States that specialized in tobacco production.  Conservation programs include all conservation programs sponsored by the Farm Service Agency (FSA) and the National Resources Conservation Service (NRCS) that provide direct payments to producers. Estimated conservation payments of $2.9 billion in 2006 reflect programs being brought up toward funding levels authorized by current legislation. "}, {"section_title": "Other Sources of Income: Tourism and Recreation", "text": "Many farms use their farm assets to generate income from agritourism activities, such as hunting, fishing, horseback riding, onfarm rodeos, and petting zoos. According to ARMS data for 2005, about 45,500 farms, representing 2.2 percent of farms nationwide (excluding Alaska and Hawaii), are involved in farm-based recreation, generating $664 million in income. Two regions -the Northeast and Southern Plains -account for more than half of all recreation income reported nationwide. Although 23 percent of all farms are classified as intermediate (includes farming occupation/lower-sales and farming occupation/higher-sales farms), they account for 38 percent of all farms engaged in recreation activity. Fewer than one in seven farms earning income from onfarm recreation activity are commercial farms (includes larger, very large, and nonfamily farms). However, among farms with recreation income, commercial farms have the highest per-farm receipts, at $29,600, more than four times the average receipts of rural residential farms (includes limited-resource, retirement, and residential lifestyle farms). ARMS indicates that 54 percent of recreation farms specialize in either raising cattle and calves or horses (compared with 49 percent for all farms nationwide), possibly reflecting the popularity of horseback riding and dude ranches. Horse farms involved in recreation have the highest average recreation receipts at $57,700 per farm."}, {"section_title": "Production Expenses in 2006", "text": "Total production expenses 1 in 2006 are forecast to rise $11 billion (5 percent) to a record $237.2 billion. The percentage change is less than in 2005, but continues the increase in total production expenses that has occurred in each of the last 4 years. Since a decrease in 2002, total expenses in current dollars will have risen $43.8 billion (22.7 percent). In real dollars, though, total expenses have risen 8.3 percent ( fig. 4). During the same period, the Production, Interest, Taxes and Wage rates (PITW) prices-paid index calculated by the National Agricultural Statistics Service (NASS)the prices-paid index that encompasses all agricultural production inputsrose 20.1 percent. This index is expected to climb 4.6 percent in 2006. The rise in prices during 2006 accounts for most of the rise in total expenses. Total output in 2006, as measured by the Tornqvist output index 2 on the forecast model, is expected to be almost exactly the same as in 2005, with crop output falling 2.0 percent and livestock output rising 2.9 percent. Through October 2006, prices paid overall for crop sector inputs had risen faster than for livestock sector inputs. Increases of $900 million or more are forecast for seven expenses (table 1). The largest increase in an individual expense will be a $2.4-billion (8.6percent) jump in feed expenses. Interest and miscellaneous expenses are also forecast to rise more than $1 billion each. Repair and maintenance and labor expenses will be up around $1 billion. Seeds and fertilizer should each increase around $900 million. Two expenses-livestock and poultry purchases and net rent to nonoperators-are expected to decrease, but each will fall less than 2 percent. The 8.6-percent increase in feed expenses is the product of a forecast 5.5-percent rise in feed prices, due primarily to higher grain prices, and a 3-percent rise in livestock output. The number of grain-consuming animal units is predicted to be 1.5 percent higher in 2006. A big factor in the amount of feed used is the number of cattle on feed, which is 9 percent higher in the fourth quarter of 2006 over a year ago. With continued poor pasture and hay/forage conditions in some of the main cattle-producing areas, more cattle are being moved into feedlots. Also, many cows are being culled rather than kept for breeding, in part because of low milk prices.    Between 1997 and 2005, pesticide prices rose very slowly or decreased. The current increase in prices is likely due to increases in oil prices, since petrochemicals are used in many pesticides. Use of pesticides is expected to be slightly lower in 2006 than in 2005. Applying the previous year's application rates to forecast planted acreage of individual crops, use on field crops will be nearly the same as decreased use for corn will be offset by increases for soybeans and cotton. Pesticide use on fruit will probably be down slightly, but use on vegetables is expected to rise."}, {"section_title": "Payments to Providers of Hired Labor, Rented Land, and Debt Capital (Stakeholders)", "text": "While net farm income is forecast to fall 20 percent in 2006, payments to nonoperator stakeholders are expected to increase more than 4 percent to a record $48.6 billion. Employee compensation (hired labor) is forecast to rise a little less than 4 percent. Wage rates will be up 3.9 percent and the production of vegetables, fruit and nut, and greenhouse and nursery products-the three farm types that are the heaviest users of hired labor-will be up around 1 percent. The decrease in net rent to nonoperators of less than 0.5 percent is the result of nearly offsetting factors. Cash rent is forecast up 5 percent based on a projected increase in cash rental rates, and the 6-percent rise in the value of crop production should push share rent up by around the same percentage. However, these increases are nearly offset by a 37-percent fall in direct government payments to landlords. Corn, general cash grain, and beef cattle farms are the three largest farm types paying rent. Together, they account for more than half of rental payments. While the cost of imported oil in the fourth quarter of 2006 is forecast to be lower than in the third quarter of 2006, prices are expected to rise in the first quarter of 2007. 2 But any effects will probably be mitigated by the fact that fuels and oils comprised a small share, less than 5 percent, of total production expenses in 2005, about the same amount accounted for by fertilizers (at 6 percent). In contrast, the price of natural gas (for industrial uses) has fallen sharply over the last year, decreasing by nearly 40 percent between December 2005 and July 2006. The declining price of natural gas is particularly significant since it is an ingredient in the production of fertilizer, which has fallen nearly 15 percent in price from January to September 2006. The price of industrial propane has remained relatively stable over the same period. In 2005, diesel accounted for nearly 60 percent of all fuel purchases among U.S. farms, followed by gasoline/gasohol at about 20 percent. The dominance of diesel in fuel purchases prevails across all types of farms, although gasoline/gasohol purchases tend to be more important for rural residence farms, accounting for 30 percent of total fuel purchases. This might be an indication of operators' (of these farms) heavier reliance on pickup trucks and automobiles for personal transportation and their use of gasolinepowered tractors and farm equipment. Inputs into agricultural production based directly or indirectly on energy are used on almost all farm types, although not to the same degree. For example, energy accounts for a higher share of production costs for crop farms than livestock farms ( fig. 6). Heavy users of irrigation, which consumes large amounts of energy, are likely to be most directly affected by rising energy prices. Manufactured inputs that rely heavily on energy as an input, such as nitrogen fertilizer (in which natural gas is the primary input), or production activities that use machinery run by diesel fuel tend to be more sensitive to changes in the price of energy. Regional variations are likely to result from changes in energy prices. Regions that rely heavily on irrigation are more affected by changes in energy prices. In particular, corn, soybean, wheat, cotton, grain sorghum, and peanut farms in the Prairie Gateway are heavy users of irrigation relative to total expenses. In the Southeast, corn and cotton producers are heavy users of fertilizers relative to total production expenses and may also be disproportionately affected by changes in energy prices. Livestock (hog, dairy, and cattle) operations in the Corn Belt and elsewhere are heavy users of feed, the cost of which is indirectly affected by rising energy prices. Sustained changes in energy prices may encourage farm operators to employ more energy-efficient farming practices. For example, conservation tillage, whereby tractors plow fields fewer times, can reduce fuel consumption as well as fertilizer use. In 2001, about 70 percent of corn (a widely planted crop heavily reliant on inputs) acres were farmed using this practice. Low-water-pressure systems are another energy-saving strategy. In 2001, about a third of irrigated corn acres were farmed using low-water irrigation. Nitrogen management can reduce fertilizer use through soil testing and application methods that encourage conservation. According to ERS, less than a third of corn acreage in 2001 was planted using a nitrogen soil test."}, {"section_title": "Continue on page 17", "text": "Another way to reduce fuel costs is through bulk purchase discounts, favored by commercial farms. Fuel expenditures may also be offset through the use of hedging and forward contracting. Sustained fuel price increases may encourage investment in alternative domestic energy sources, most notably ethanol. With dozens of plants opened in recent years, the annual production capacity of the U.S. ethanol industry is forecast to be 5.8 billion gallons in 2006/2007, from corn alone. By some estimates, capacity may grow by 60 percent over the next 4 years. Production of ethanol could be expanded by including cellulosic biomass (wood fibers and crop residue) as a raw material. However, the biomass market is presently limited due to technological limitations in the production process. 1 Unless otherwise noted, prices reported are in nominal terms. 2 As reported by the Energy Information Administration, U.S. Dept. of Energy.  Agriculture's value added ( fig. 7), is distributed to its equity holders (farm operators and contractors) and stakeholders (lenders, nonoperator landlords, and hired labor). Contractors are processors, elevators, retailers, and others who use both production and marketing contracts with farm operations to obtain agricultural products with specific, desired attributes. Equity holders' share comes in the form of net farm income. Stakeholders' share is in the form of interest payments to lenders, rent to nonoperator landlords, and both wages and noncash compensation to hired labor. Since 1980, agriculture's value added in current dollars has trended upward, peaking at $128.9 billion in 2004. It is expected to decline to $107.6 billion in 2006 ( fig. 8). While an upward trend in the current-dollar line suggests the farm sector equity and stakeholders are \"better off\" since 1980, removing inflation eliminates this upward trend. The line showing net value added in constant, inflation-adjusted dollars shows that the buying power of those dollars going to agriculture's equity-and stakeholders has fluctuated around $94.4 billion. While total net value added has been relatively constant in real terms since 1980, the same has not been true for the shares going to the different groups who contribute to it. Examining inflation-adjusted dollars shows that real net farm income, though more volatile than real payments to stakeholders, has trended upward since 1980 ( fig. 9). The volatility in net farm income reflects equity holders' risk of residual returns. Payments to stakeholders declined in the mid-1990s, and has been relatively level since. The decline in stakeholders' share of net value added is due to large declines in interest rates on farm loans and reductions in farm debt use following the financial crisis in the early 1980s. As residual claimants, the share of net value added (net farm income) going to farm equity-holders increases during years of large increases in net value added and declines in declining years ( "}, {"section_title": "Distribution of Agriculture Sector Earnings", "text": "Farms are expected to contribute $107.6 billion in net value added to the U.S. economy in 2006, down from the 2004 peak of $128.9 billion.    Net value added by farm resource region, 2005 Source: Economic Research Service, USDA."}, {"section_title": "Heartland-23%", "text": "Northern Crescent-11%"}, {"section_title": "Prairie Gateway 10%", "text": "Mississippi   Rural residence farms-10.7% Intermediate farms-15.7% Commercial farms-73.6%"}, {"section_title": "Farm Business Income Prospects", "text": "After 2 consecutive years of exceptionally high income, 2006 net cash income for farm businesses is projected to be $68,669, on average. This is 20 percent higher than the previous 5-year average but a 13 percent drop from 2005. Income for farm businesses (see box) will remain at the third highest level of the past 10 years. The projected change in income prospects for farm businesses will not affect all farm operations in the same manner or to the same degree. There is considerable variation in business structure, including the extent to which assets are owned, the mix of crops and livestock, the contribution of government payments to gross income, and the relative importance of energy inputs and borrowed capital to production costs."}, {"section_title": "Income Prospects Differ by Production Specialty.", "text": "Almost all types of farms, as classified by the major commodity or commodity groups produced, are forecast to experience reduced income in 2006. The magnitude varies across commodity specialties. Specialty crop producers-which include vegetable and fruit growers and greenhouse/nursery operators-are expected to generate a higher level of income for the fourth consecutive year. Growth in receipts for specialty crop producers more than outpaces an increase in expenses. The incomes of dairy, hog, and other livestock farms are expected to decline more than for other farm types because of forecast lower prices, reduced marketings, lower government payments, and higher input costs. Dairy farm income could be lower in 2006 being than for any year this decade. Increasing prices for energy-based inputs, higher feed expense, and larger interest charges on debt capital contribute most to the overall increase in farm operating costs. These inputs are prominent in the cost structure of livestock farms and, combined, account for more than 40 percent of costs for these businesses. For other types of livestock operations, the smallest net cash income declines are forecast for poultry and beef farms, where higher receipts offset some of the increases in expenses. Average net cash income for farms that specialize in the production of program crops such as corn, soybeans, wheat, cotton, and rice are forecast to be 8-18 percent below 2005 levels ( fig. 13). Even though incomes are lower in 2006, farm business income could remain well above the previous 5-year average for specialty crop and corn producers, and higher than the 5year average for the remaining crop types. Average net cash income in 2006 is forecast to fall below the previous 5-year average for hog, dairy, and other livestock producers ( fig. 14)."}, {"section_title": "Income Prospects Differ by Farm Business Location.", "text": "Geographic concentration of commodity production explains much of the regional variation in the income outlook for farm businesses. In 2006, not all regions of the country are forecast to experience a similar decline in net cash income. The largest year-to-year declines in average net cash income are expected in the Northern Crescent and Mississippi Portal regions. The forecast decline for the Northern Crescent reflects the concentration of dairy production. The Mississippi Portal, one of the regions most dependent on government payments (12 percent of gross cash income), has lower gross income even though receipts rise as a result of larger crop sales. The rise in crop receipts does not offset a reduction in payments combined with a slight reduction in livestock sales. The smallest declines in net income (8-10 percent) are fore- "}, {"section_title": "Defining Farm Business", "text": "The official USDA farm definition (an operation with $1,000 of gross agricultural sales or the potential to generate such sales) encompasses a widely diverse 2.1 million operations. Farms vary in their level of business activity, resource allocation, goals, and a host of other attributes. ERS developed a typology of farms to classify farms into more similar groups based on gross sales, major occupation, and total household earnings (for more information see box item ERS Typology of Farms). In order to concentrate analysis of business performance on those farms with significant labor allocation to farming and household dependence on business income several of the farm typology classifications are excluded (limited resource farms, retirement farms, and residential/lifestyle farms). A majority of these farms have negative business income and their operators' households receive most of the income from off-farm sources. Farm businesses, for purposes of performance analysis, include the nearly 800,000 remaining family and non-family farms who indicated that farming was the primary activity of the operator.  cast for the Prairie Gateway, Eastern Uplands, and Fruitful Rim. Compared with the previous 5-year average, 2006 net cash income is expected to be lower in two regions: the Mississippi Portal and Southern Seaboard. In contrast, net cash incomes remain at least 25 percent higher than the previous 5-year average in the Prairie Gateway, Eastern Uplands, Heartland, and Fruitful Rim."}, {"section_title": "Income Prospects Vary by Economic Size of Farm Business.", "text": "There is considerable variation in projected net cash income by size of farming operation in 2006. Commercial operations, which represent about 9 percent of farms and 75 percent of production, are expected to experience an 11percent decline in average net cash income for 2006. The 2006 forecast for these farms is still 14 percent higher than the previous 5-year average and the third highest income in this decade. The rate of decline forecast for intermediate farms (primary occupation of farming and gross sales below $250,000) is almost twice that of commercial farms (21 percent,) resulting in net cash income near the previous 5-year average. Two-thirds of U.S. farms are classified as rural residences-operators of which typically earn most of their household income from off-farm sources. Unlike operators of intermediate and commercial farms, the vast majority of rural residence farmers were employed off-farm prior to becoming a farmer, with a much larger share of both operators and their spouses having off-farm jobs. The farm operations of these households have for many years averaged a negative net cash income, with 2006 no exception."}, {"section_title": "Farm Business Debt Use", "text": "Farm business owners incorporate debt into their businesses along with equity capital, earnings retained from business activity, and a variety of leases to acquire inputs ranging from cropland to machinery and equipment. Farmers that reported the highest liabilities relative to asset values (farms with debt over 71 percent of asset values) operated larger farms in terms of acreage and generated much larger value of production than operations that reported smaller amounts of debt ( fig. 17). Only about 2 percent of farm businesses reported liabilities and assets that resulted in them having a debt to asset ratio over 0.71. These more highly leveraged farms tended to be operated by managers that were younger, with fewer years operating a farm business. These operators were likely still in a build-up or expansion phase of their business development. The 2.2 percent of farms with debt over 71 percent of asset values held nearly 16 percent of liabilities. These farms also held a similar share of term debt. Fifty-three percent of liabilities reported by operators at year-end 2005 were owed by the 25 percent of operations with a debt-asset ratio of 0.11 to 0.40. The two-thirds of farms with liabilities less than 10 percent of asset values owed 12 percent of total liabilities in 2005. These low-leverage businesses controlled three-fourths of land owned and 63 percent of all land operated by farm businesses. They generated about half of total production value. Managers of these farms were older, on average, and had more years of farm experience.   "}, {"section_title": "Trends in Debt Use and Business Performance", "text": "There are varying degrees of financial success among farm businesses from one year to the next that may not be reflected in sector measures of performance. Annual results from the ARMS survey have been reported and analyzed by ERS to monitor and evaluate changing economic circumstances of farm businesses. Both liabilities and term debt reported by farmers tend to be concentrated among farms that are more highly leveraged. Based on data reported by farmers in the ARMS and earlier surveys, both the share of farms and the share of debt held by highly leveraged farms is less in 2005 than in the mid-1980's ( figure 18). Asset values have risen relative to debt, leaving farms, on average, in a less leveraged position.  Definition and historical values for selected farm business financial ratios"}, {"section_title": "Ratio", "text": ""}, {"section_title": "Computation method Significance", "text": "Liquidity ratios:"}, {"section_title": "Current", "text": "Current farm business assets A \"stock\" measure of ability to meet financial Current farm business liabilities obligations without disrupting ordinary business operations."}, {"section_title": "Solvency ratios:", "text": "Debt/asset Farm business assets Indicates the degree of security for the Farm business liabilities lender(s) and the relative use of the owner's capital."}, {"section_title": "Profitability ratios:", "text": "Return on assets Returns to debt and equity capital Measures how efficiently the farm business Total farm business assets uses its assets."}, {"section_title": "Repayment capacity ratios:", "text": "Term debt coverage ratio Net farm income + Depreciation + The ratio provides a measure of the ability of Interest on term debt the borrower to cover all term debt payments."}, {"section_title": "Interest and principal on term debt", "text": "The higher the ratio, the greater the margin to cover the payments."}, {"section_title": "Financial efficiency ratios:", "text": "Operating expense ratio Cash operating expenses Measures the proportion of gross cash income Gross cash farm income absorbed by cash operating expenses. The operating expense ratio equals cash operating expenses divided by gross cash income of the farm business. This ratio measures the extent to which the cash income generated by the business is absorbed by the annual costs of production. The lower the ratio, the more effective the farm operation is in generating returns. As has been the general pattern across the various measures of financial performance, the strongest years for financial efficiency (the lowest average operating expense ratios) were 2004 and 2005, while the worst year during the period was 2002 with an average ratio value of 80.38 percent. In 2005, the operating expense ratio ranged from 67.46 percent in the Heartland to 78.95 percent in the Mississippi Portal region."}, {"section_title": "Overall Financial Performance of Farm Businesses", "text": "The overall financial performance of farm operations can be evaluated by considering their combined net income and solvency positions as measured by debts and assets (see box,\"Classification of Overall Financial Performance\"). Both the debt/asset ratio (a measure of business solvency) and net "}, {"section_title": "Classification of Overall Financial Performance", "text": "The following classification framework has been used by ERS analysts since the mid-1980s to evaluate the overall financial performance and health of farm businesses. This framework combines both income and solvency measures.     "}, {"section_title": "Financial Position of the Farm Sector", "text": "Farm equity is expected to rise by about 7 percent in 2006, exceeding the rate of inflation, as the value of farm assets continues to rise more rapidly than farm debt. Financial performance of the sector, as measured by debt-to-asset and debt-to-equity ratios, continues to improve in 2006 relative to the first half of this decade and relative to average performance over the past four decades.   "}, {"section_title": "Financial Position of U.S. Farm Sector", "text": "The financial position of the U.S. farm sector, as measured by total farm liabilities relative to either total farm assets or total farm equity, has continued to improve from 2002 through 2006 (table 5, fig. 27). The debtto-asset ratio measures the relationship between claims of creditors on a business (debt capital) and assets of the business. In 2006, the debt/asset ratio is estimated to be 11.4 percent, the lowest value of the ratio since annual measurements began in 1960. Each of the past 2 years has seen Agricultural Income and Finance Outlook / AIS-84 / November 2006 Economic Research Service/USDA       "}, {"section_title": "Farm Household Income Forecast Down in 2006", "text": "In 2006, average family farm operator household income is projected to be $80,703 down 0.9 percent from 2005, but 11.7 percent above the 5-year average of 2001-05 (table 6). The projected 3.3-percent increase in off-farm income, expected to be 85 percent of household income, is more than offset by a 19.9-percent decrease in farm income. On family farms, increases in crop cash receipts and other farm income are projected to be more than offset by declines in livestock cash receipts and government payments. Given higher farm expenses, average net cash farm income is projected to be $17,224, down 17.3 percent from 2005. Following adjustments for depreciation, farm income due to other households sharing in farm income, and other farm-related earnings, operator household earnings from the farm are projected to be $11,728. Although farm income is forecast down 19.9 percent from 2005, it remains at about the 5-year average. For off-farm income, the 2006 forecast for a 3.3-percent-increase follows a decline of less than 1 percent realized in 2005. The off-farm income forecast of $68,975 is 9.2 percent above the 5-year average. Family farms are diverse, and the outlook for farm operator households varies across the population. Income is more likely to decline in 2006 for farm households the higher the usual farm income share of total household income. Commercial farm households (7.7 percent of family farms) on average receive a much larger share of household income from farming (75.6 percent) than other farm households ( fig. 28)  Average income to farm operator households, 2001-2006 1 Item  2005 to  2001-05  2002 2  2003  2004  2005  2006  2006 Avg. Percent change   Net cash farm business income 3  11,336 14,979  20,624  20,      less, off-farm income earned by households in these groups, primarily from off-farm wages and salaries and off-farm business income, is substantial."}, {"section_title": "Change 2006/", "text": ""}, {"section_title": "----------Dollars per family farm ----------", "text": "Among the operators who report farming/ranching as their primary income, only those of farming occupation/lower sales farms are expected to realize an increase in household income. Operator household income on farming occupation/lower sales farms is forecast at $66,584, representing an increase of 1.8 percent. The forecast 3.3-percent gain in off-farm income more than offsets the expected 15.5-percent reduction in farm income. Since operators of farming occupation/higher sales realized 42.2 percent of their income from farming, their expected 24.7-percent reduction in farm income has a much larger impact. Operator household income on farming occupation/higher sale farms is forecast at $65,977, down 10.7 percent from 2005. This would be the first time that household income on lower sales farms exceeded household income on higher sales farms. On average in 2005, operators of large family farms realized 70 percent of their household income from farming activities and operators of very large family farms realized 84 percent of their household income from farming activities. Both large and very large family farms are expected to realize large reductions in farm income in 2006. The $102,896 in average household income forecast for large family farms is down 12.6 percent from 2005, but still 4.9 percent above the 5-year average). The $259,639 in average household income forecast for very large family farms is down 13 percent from 2005, yet still 10.4 percent above the 5-year average. In 2005, more farm operator households were located in the Heartland (20 percent of all farm households) than in any other resource region ( fig. 31). Average farm household income in this region was $86,445, 6.2 percent above the national average of farm operator households. Heartland farm households also had the highest farm income ($28,748). Nearly 38 percent of the farms in the Heartland specialized in cash grains and soybeans, 21.4 percent in other field crops, and 22 percent in beef cattle. Operators of cotton farms in the Heartland region realized the highest average household income at $311,528. However, they represent less than 1 percent of the family farms in the region. Resulting from the significant increase in farm income, about 33 percent of regional average household income was attributed to farm sources. This is a jump from 2004, when only 18 percent of household income came from farm sources. Economic Research Service/USDA 3 A farm's type is determined by the one commodity or group of commodities that makes up at least 50 percent of the farm's total value of agricultural production. Using this definition, about half of all U.S. farm operator households can be classified as a particular type. The other farms have a mix of commodities, none of which accounts for at least 50 percent of total production value. Because this definition depends on yearly prices and quantities, an individual operation may be classified as one type one year and another type another year.  "}, {"section_title": "Contributions of Different Income Sources to Household Income", "text": "According to the 2005 ARMS, earnings from farming contribute 16 percent of average farm household income ( fig. 33). About 70 percent of off-farm income is considered earned income, with 80 percent coming from off-farm wages and salaries earned by the household. To characterize the 30 percent of household income from unearned income sources, the ARMS survey collected as separate line items-in 2005 for the first time-retirement, disability, and other transfer income from public sources and from private sources. Retirement, disability, and other transfer income from public sources contributed about 40 percent of unearned income; retirement and disability income from private sources contributed about 17 percent. 4 Interest contributed about 13 percent and dividends 11 percent toward unearned income.   "}, {"section_title": "Farm Household Wealth", "text": "Wealth or net worth is the difference between assets and debts, measured in ARMS on the last day of the calendar year. Across all U.S. households, the major share of operator household wealth is in houses and other real estate. In contrast, farm households have the major share of their wealth in farm business wealth; consequently, as the average net worth of farms has increased through time, so has the wealth of primary operator households. In 2005, the average wealth of farm households was $838,875, with farm net worth comprising 76 percent of the total. This represents a 17-percent increase in farm wealth and a 2-percent increase in nonfarm, for a net change in total wealth of 13 percent. In 2005, nonfarm debt increased 17 percent, faster than the 5-percent increase in nonfarm assets, with the largest increase in the form of loans to off-farm businesses. Nonetheless, operator household debt-to-asset ratio was 0.1, lower than earlier in the decade.  Farming income-16% Off-farm wages and salaries-47% Off-farm business income-12% Off-farm interest income-3% Off-farm dividend income-3% Public retirement and other transfer income -10% Private retirement and disability income-4% Off-farm other sources of income-5% in the distribution and composition of wealth across family farm households (see app.    hold wealth in 2005 was half the average wealth of all self-employed households ($1,452,000)."}, {"section_title": "Economic Well-Being of Farm Households: Joint Income and Wealth Outcomes", "text": "In a variable-income/high-wealth sector such as farming, economic wellbeing measures based on both income and wealth can provide a better signal of household capacity to support a sustainable standard of living than a measure of income taken in a single year. During periods of low income, farm households may be able to maintain living standards by borrowing against, or liquidating, assets. Since average comparisons can be misleading in assessing economic wellbeing, we divide farm households into four groups, separating them into low and high levels of income, and low and high levels of wealth, with the median levels of U.S. household income or wealth as the dividing lines between low and high ( fig. 35). As noted above, the big difference between farm and other U.S. households is in the pattern of wealth, not in income. Among all farm households, 55 percent have high income and high wealth, and 39 percent have low income and high wealth; the comparable shares across all US households are 36 percent high-income/high-wealth, and 14 percent low-income/high-wealth. The major difference appears to be that, on average, the low-income/high wealth group tends to have incurred farm losses in the year. Among all farm households, 2 percent have high-income/low-wealth and 4 percent have lower income-lower-wealth, compared to 14 percent and 37 percent respectively for all US households. The distribution of farm households in each income/wealth group has been relatively consistent over time. Low-income/low-wealth. Following a consistent pattern since 2000, in 2005 about 4 percent of farm households had both lower incomes and lower wealth than the median levels for all U.S. households. Low levels of both household income and household wealth could be interpreted as an indicator of disadvantage in the sector. This group contains a higher proportion of limited-resource farms (46 percent) and a third of residential/lifestyle farms. Surprisingly, only 28 percent of farm operators reported farming as their primary occupation in 2005, down by about half since 2004. In 2005, average household expenditures ($22,719) were higher than the average household income ($15,589); nearly 54 percent of these farm households reported income less than consumption expenditures in 2005, compared with about 43 percent in 2004. Farm households in this group had substantially lower levels of wealth (net worth) compared to average farm household. In fact, like farm households in the high-income/low-wealth group these farms households showed a loss in non-farm net worth (on average, -$7,259), which could again be a reflection of unrealized capital losses either in financial or real estate investments. Moreover, their small asset base may be insufficient to cover unexpected shortfalls in farm household earnings. Farm households in this category produce 1 percent of total agricultural output. Many of these farm households specialize in beef cattle (36 percent) and general livestock (29 percent) operations; however, nearly 60 percent of their agricultural output is from crop production. These farm households received an average of $2,025 in government payments, about 1 percent of total government payments in 2005; but nearly 79 percent of farm households in the group did not receive any farm program payments. About 43 percent of these farm households are located in the South. Generally, operators of these farm households have less education than those in the other groups; for example, more than 90 percent of farm operators in this category have the lowest level of education-a high school degree or less. Comparisons with Other Self-Employed Households. Since farm households are by definition self-employed, it is also informative to compare farm households against the self-employed reference group, those who operate a business and fall under the same tax rules related to depreciation, capital investment, and self-employment income. For this comparison, we create a second four-quadrant designation, dividing households into four income/wealth groups on the basis of the median income ($68,701) and median wealth ($352,380) in 2005 for all self-employed households in the U.S. (fig. 36). The distribution changes substantially. Farm households have lower median household income, but higher median household wealth relative to all selfemployed households. About 65 percent of all farm households have wealth greater than self-employed median household wealth, and 39 percent have income greater than the self-employed median household income. The 65 percent of farm households with higher wealth are split into two groups, with 31 percent having higher income and 34 percent having lower income than the self-employed median (compared with 55 percent and 39 percent relative to the all U.S. household medians). About 27 percent of farm households have both income and wealth lower than the medians for all selfemployed households."}, {"section_title": "Farm Household Entrepreneurship", "text": "In 2005, 3 out of 10 farm households used their entrepreneurial skills to operate nonagricultural enterprises on the farm or to operate another business off the farm. Nonagricultural products produced on a diversified farm include custom work, hiring out farm machinery, on-farm recreation, and forestry products. Off-farm business enterprises include both other farms and nonfarm businesses. Both household groups-those with on-farm nonagricultural diversification and those with multiple businesses-had higher net farm income and higher household income in 2005, relative to the reference group who engaged in neither of these entrepreneurial activities. Reflecting more intensive use of farm-level resources, farmers with on-farm diversification earned 2.5 times the average net farm income and worked 70 percent more hours relative to the reference group (table 8). In contrast, farmers operating multiple businesses earned on average 60 percent more net farm income, while working 12 percent fewer hours on the farm relative to the reference group. Household income was 26 percent higher for farmers with on-farm diversification, and 70 percent higher for farmers operating multiple businesses. Two-thirds of the nonfarm business income comes from service sector enterprises, onefourth from manufacturing and construction ventures, and the rest from wholesale trade and transportation and agriculturally-related industries. This pattern of business activity across farm households mirrors the rural economy's transition to a service economy. Which types of farm households are most actively engaged in other nonfarm business enterprises? Residential-lifestyle farm households were engaged most often (21 percent), followed by intermediate (17 percent), commercial (13 percent), and retirement (7 percent) farm households. Among households operating nonfarm businesses, nonfarm business income was, on average, $58,000 for commercial, $67,000 for residential-lifestyle, and $74,000 for retirement farm households ( fig. 37). However, due to the different numbers in each farm group and the different rates of non-farm business ownership, aggregate nonfarm business enterprise income by household type displays a different pattern. The residential-lifestyle farm households, which represent 43 percent of farms and account for only 6 percent of the value of farm production, earn 66 percent of nonfarm other business income. They represent the largest group of farm households owning multiple businesses, adding to their local economies' stock of wealth and nonfarm employment opportunities.  Components of income and expenses are used to project cash flow, assets, and debt. Indices are applied to parameters from the USDA's Short-term Forecast Model that reflects the combined effect of forecast quantity and price changes. The model operates on individual farm data from the most recent (2005) Agricultural Resource Management Survey (ARMS). Forecast quantity and prices of commodities are provided by ERS commodity market situation and outlook specialists in conjunction with their participation with the USDA's World Agricultural Outlook Board in the monthly release of World Agricultural Supply and Demand Estimates (WASDE). ERS macro economy analysts provide information concerning the situation and outlook of the U.S. macro-economy. Results can be summarized across various groupings of farms such as region, commodity specialization, or size categories. Since it is a partial budgeting approach, any potential structural or production response on the part of farms is not treated. Appendix table A.1 reports forecast errors for selected components of the farm business financial statements. The forecast error is based on a comparison (in percentage terms) of the February 2006 forecast and the actual 2005 ARMS results (as the base). The estimates for farm business income are for intermediate and commercial farms. Across the selected components for all farm businesses forecast errors ranged from 2.5 percent for cash operating expenses to 13.8 percent for net cash income. Forecast errors were generally larger for net cash income than for other components, since it is dependent on forecasts for both sources of income and expense items. Forecast errors derive from two sources. First, they can result from different outcomes than the index reflecting quantity and price changes predicts for the sector as a whole. Errors of this type ranged from 1-10 percent for receipts, with egg and fruit receipts having the highest error. They can also result from the static nature of the partial budgeting model where farms adapt and/or structural changes occur from one survey year to the next. Some of the largest forecast errors were for relatively minor income components for particular farm production specialties. For example, livestock receipts on farms that specialized in the production of soybeans and peanuts accounted for less than 2 percent of gross cash income. Appendix table A.2 reports forecast errors for selected components of the operator household income statement. The accuracy of the forecast of net cash farm income is discussed in the previous paragraph. The only difference here is the estimates/forecasts are for all family farms. In the forecast of operator household farm income, the partial budget adjustment is applied to net cash income and depreciation while the share of farm income retained by the primary operator household and other farm income earned by the operator household are assumed to be as reported in the base year ARMS. With more sources of error, it is reasonable that error in the forecast of household farm income be greater than the error in the forecast of farm net cash income. The model is specified to provide forecasts of earned income and unearned income separately that recognized that year-to-year change in off-farm wages and salaries and other business income may be different from year-to-year changes in other sources of off-farm income. Unfortunately, since only total off-farm income is available in 2005 there is no way to verify the accuracy of the component forecasts. However, with much less volatility in off-farm income, the forecast of off-farm income is usually more accurate. "}]