[{"section_title": "Introduction", "text": "The unpredictable and overwhelming COVID-19 pandemic has completely and radically changed our lives and lifestyle in a way comparable with the most traumatic events in history, such as a World war. With millions of people infected around the World and already thousands of deaths (Dong et al. 2020) , there is still a great uncertainty on the actual evolving of the crisis, as well as on the possible post-crisis scenarios, which depend on a number of key variables and factors (e.g. a treatment Felsenstein et al. 2020 , a vaccine Le et al. 2020 or some kind of immunity Weitz et al. 2020) . Despite the optimism enforced by the positive results recently achieved to produce a vaccine, uncertainty is probably still somehow the predominant feeling (Chater 2020) .\nThe whole scientific community is currently committed to face the challenging situation and to provide solutions and mitigation plans as a response to the complex dynamics at different levels. Indeed, the actual impact of COVID-19 on the different aspects of life (e.g. socio-economic Bashir et al. 2020 , environmental Collivignarelli et al. 2020 and psycological Fofana et al. 2020 ) is still not completely clear. Even relatively obvious or largely predictable macro-effects, such as a huge economic recession, present great elements of uncertainty at the moment (Altig et al. 2020) . Additionally, a large number of studies have been conducted to explore the role of different factors [e.g. temperature Jamil et al. 2020 and air pollution Fattorini and Regoli (2020) ].\nFrom a more philosophical perspective, the COVID-19 drama is also a kind of stresstest for our system and, probably, an opportunity to reconsider some aspects underpinning it, as well as its sustainability (Naidoo and Fisher 2020) . However, in order to re-design the World and our lives accordingly, we should first of all fully understand them. We definitely recognise the importance of cultural factors, opinions, personal values and beliefs. At the same time, we believe that it would be valuable to understand global performance in a data-driven and relatively systematic way.\nIn this article we focus on the pre-crisis situation by combining a number of selected global indicators to represent macro-categories that are likely to represent measures of different aspects of life: how was the World actually performing before pandemic ? We believe that answering the previously stated research question by adopting a relatively unbiased and customizable analysis framework can first of all (1) contribute to have a concise understanding of global development evolution and its priorities in the pre-pandemic period; additionally, it should (2) facilitate a better holistic understanding of the post-pandemic scenario; last but not least, (3) a similar approach can be adopted to estimate and analyse more specific aspects (e.g. global or country resilience to pandemic).\nPrevious work and background This paper is based on the method proposed in Pileggi (2020) which adopts a Multi-Criteria Decision Analysis (MCDA) philosophy (Ishizaka and Nemery 2013; Velasquez and Hester 2013) . That paper focuses on the method in itself, which is explained in detail and applied to a number of examples using real data. This work is conceptually different and addresses the result, as the method previously defined has been applied to concretely measure global performance from heterogeneous criteria with emphasis on sustainable development (Hopwood et al. 2005) . The idea of indices in such an area (e.g. Bravo 2014; Shaker 2018; Barrera-Roldán and Saldıvar-Valdés 2002) is a well consolidated concept. Furthermore, many studies explicitely focus on underlying correlations (e.g. Shaker 2018 Shaker , 2015 .\nAs discussed later on in the paper, the original method has been slightly modified for this concrete application: on one side, the definition of the categories and their relation with numerical indicators has been simplified (see Sect. 3.1); on the other side, some extension has been provided in the weighting phase to better model the trade-offs existing among the different aspects considered (see Sect. 4.1). Last but not least, the interpretation of computations has been better formalised (see Sect. 5).\nStructure of the paper This introductory part is followed by a detailed description of the research methodology. Each of the three phases identified in the methodological section is object of one of the core sections which deal, respectively, with the selection of criteria (Sect. 3), the weighting of such criteria (Sect. 4) and the performance analysis based on the resulting computations (Sect. 5). The paper finishes with a typical conclusions and future work section."}, {"section_title": "Methodology and approach", "text": "The methodology adopted in this study is summarised in concept in Fig. 1 . The target system is modelled by selecting a number of categorised indicators, which are global indicators in this study. The model also assumes weights and semantics associated with indicators and it's the input for the computational method (Pileggi 2020) . Interpretations are based on both qualitative and quantitative metrics. The three main seamless phases are briefly discussed in this section both with key design decisions, possible biases and uncertainties.\nCriteria selection: macro-categories and representative indicators The normal approach (adopted also in previous work (Pileggi 2020) as well as by many reputable studies and publications, such as Our World in Data) is to group the different indicators in classes which represent, therefore, an abstracted categorization of the considered indicators. It is very useful, especially considering the great availability of data, dependencies and the need to consider multiple aspects together.\nIn the context of this work, we have defined a number of categories of interest, each one represented by one single indicator that should be chosen to effectively characterise the target category. In terms of model ( Fig. 1) , given M categories and N indicators, we are assuming N = M and cardinality 1:1. Such a simplification allows an easier weighting and modelling within the method adopted (Pileggi 2020) . We are assuming the definition of categories and the selection of representative indicators as an intrinsic bias, which is referred to as selection bias. Additionally, as the different indicators are expressed by different units and scales which don't necessarily reflect their relevance in the resulting Fig. 1 Method in concept. The target system is modelled by a number of categorised indicators and by the weights and the semantics associated. Such a model is the input for the computational method. Results are analysed by adopting qualitative and quantitative metrics system or model, we assume a second kind of bias called numerical bias. The latter will be further discussed in Sect. 3.1.\nWeighting Weighting the target categories or indicators is a critical step. Indeed, while indicators themselves may be considered objective measures, their weighting should reflect the different relevance/importance of the various criteria in the context of the considered system or model. Weights may be estimated in different ways. For instance, they may reflect the opinions within a given group or community, normally elicited by surveys or interviews. Alternatively, weights may be inferred by capturing input parameters by the users of tools that adopt the method (Pileggi 2020) . Either ways, to be relevant, the weighting should be based on a significant number of samples. Moreover, in general, survey/interview defines a static approach as it is based on a concrete selection of indicators. Changing indicators implies the need to re-estimate weights. Such a process is very demanding and definitely it is not agile.\nIn this study we have adopted a more pragmatic and, at the same time, flexible approach to establish weights that are inferred by analysing reports on global priorities, issues or challenges. Although, due to the different intent and extent of the selected reports, it is not possible to define a systematic method to infer weights, this approach assures weighting according to different foci and perspectives. As proposed later on in the paper, the analysis of different reports leads to weight configurations that may vary very much from each other.\nLast but not least, unlike in the original method, in this work we assume finite resource for weighting to better model the trade-offs raising in a limited resource world (see Sect. 4).\nComputation and analysis The final step is the computation of the results based on the input as defined in the two previous phases. The computational method should support the systematic combination of heterogeneous indicators and associated semantics, measure uncertainty and biases, as well as provide a framework for the interpretation of results. Results based on the application of the original method (Pileggi 2020) with the modifications previously explained are discussed in Sect. 5."}, {"section_title": "Categories and indicators", "text": "The very first logical step of the study assumes the definition of macro-categories and the consequent selection of representative indicators. Such a step is described in the following subsection, while Sect. 3.2 deals with numerical bias and its minimization."}, {"section_title": "Categories", "text": "Inspired by Our World in Data, we have defined our own marco-categories (summary in Table 1 ) reflecting different aspects of life as follows:\n• Environment/sustainability Several indicators might represent this macro-category as either global environmental measures (e.g. temperature anomaly or CO2 emissions) or indicators in sub-categories (e.g. energy) potentially express the performance trend. In the context of this work, we consider temperature anomaly ( Index Hausmann et al. 2014) are normally understood at a country level and might be not very indicative if considered globally. The GDP represents somehow an economical model that assumes never ending growing. The impact of the COVID-19 pandemic on global economy is expected to be much more consistent than in recent crisis (Kotz 2009 ) and to be comparable with the second World war. • Poverty/inequality We consider that the number of people living in extreme poverty (Roser and Ortiz-Ospina 2013; Ravallion 2015) is the ideal measure to properly integrate economic indicators that express a generic increasing well-being by introducing the concept of inequality. Although we recognise an intrinsic interdependency, we prefer to keep this category separated from the previous one as we want to be able to differentiate ideas and concerns related to the economic growth in itself from the others that explicitly address poverty and inequality. • Human rights/freedom By considering democracy as one of the most relevant achievements of all times, we believe that the number of people living in democracy (Roser 2013a ) may be an effective representative for human rights and, more in general, freedom. Indeed, we consider democracy as a condition necessary (although not always sufficient) to create a socio-political environment in which individual freedom and human rights are likely to be fully respected. • Violence/instability The selection of a single indicator to express violence and instability in general terms is not easy. Looking at recent happenings, we consider that measures related to terrorism ) may be a very reasonable choice. From one side, it's not always easy to understand terrorism and classify terrorist attacks according to the same criteria worldwide. However, a clear definition for terrorism and a number of unanimously recognised principles currently exist . Terrorism is normally generated by situations of war or local conflict and it definitely causes uncertainty, violence and instability.\nAll indicators selected are based on objective measures, while others that result from perceptions or opinions (e.g. happiness Frey and Stutzer 2012) have not been included. For the numerical analysis proposed in the paper, we are considering recent years and, more concretely, the time range 2000-2015. Unfortunately, it is not possible to include in the study later years as the indicator measuring people currently living in democracy is available only up to 2015. As per previous explanations, we consider such an indicator as very relevant for the extent and the intent of this research, so we prefer to keep it and reduce the target time range. Additionally, the indicator on people living in extreme poverty is measured at a different granularity of all others, which are available by year. We have indeed adopted approximations considering the available values for the years 2002, 2005, 2008, 2010, 2011, 2012, 2013 and 2015. In terms of wished trends (Table 1) , we want the temperature anomaly, people living in poverty and deaths caused by terrorism to decrease, while an increasing trend is wanted for life expectancy, people living in democracy and GDP. The actual trends in the considered time range is shown in Fig. 2 on the left. In the same figure, the contribution to global performance by considering the wished trends (Pileggi 2020 ) is shown on the right. According to this view, positive trends in the chart contributes positively to global performance. Likewise, negative trends have a negative impact on the performance.\nLooking at the data reported, health/demographics, economy, poverty/inequality and freedom/human rights are positively performing. On the other side, environment/sustainability and violence/instability present strongly negative performance."}, {"section_title": "Dealing with numerical bias", "text": "At a more theoretical level, the definition of a restricted number of meaningful categories in the extent and intent of the current study can be considered a kind of bias in itself. It's somehow inherent in study design.\nAt a practical level, it is almost impossible to provide a numerically balanced set of indicators. Indeed, indicators are normally very heterogeneous, adopts their own units of measure and may present very different numerical variations. In general, the variation of a given indicator is not comparable in terms of relevance with the variation of another indicators. Therefore, numerical proportions are not semantically relevant for the purpose of the considered study, meaning that numerical variations are not necessarily proportional with the relevance in the system or model.\nWe have represented all indicators uniformly as the percentage variation with respect to the initial state. As shown in Fig. 2 , for the considered set of indicators, the variation of deaths by terrorism is numerically much more relevant than any other. Also the temperature anomaly presents a strong pattern in this sense. However, it is not numerically comparable with the previous. As both indicators contribute potentially in a negative way on global performance, the resulting indicator framework is strongly biased (numerically) in this case and may affect the fairness of the computation.\nThe numerical differences among the considered indicators imply the need to deal with different scales when computing the different aspects together. In order to minimise numerical biases, we adopt the mechanism described in Pileggi (2020) in addition to weighting. A detailed description of such an adaptive mechanism is out of the scope of the paper. An example of the numerical bias using and not using the mechanism is reported in Fig. 3 . "}, {"section_title": "Weighting", "text": "Once target criteria are defined, the weighting stage may result extremely subjective. The most natural way to weight criteria is probably by survey, as it is relatively simple to map weights into an opinion-based survey. In such a way, opinions from a generic public as well as opinions within defined communities may be captured and converted in a corresponding set of weights.\nHowever, capturing people's opinions in a meaningful way requires a large number of samples. Therefore, we have preferred to adopt a completely different and more pragmatic approach that aims to infer weights from the analysis of popular reports (e.g. from United Nations 1 and Global Economic Forum 2 ). On one side, the simplified approach adopted in the selection phase allows to weight categories rather than single indicators. It makes the mapping much easier. On the other side, the interpretation of certain kind of report may be subjective.\nIn the following subsections, we first describe an extension to the reference method to better model existing trade-offs and, then, we discuss the inference of weight sets from different sources of information."}, {"section_title": "Finite-resource assumption to model trade-offs", "text": "The original method (Pileggi 2020) doesn't assume specific constraints for weights: the different indicators are weighted independently within a minimum value W min and a maximum value W max . Thus, any indicator i is associated with the corresponding weight W min ⩽ w i ⩽ W max , for instance in a range [0,10].\nThat independent weighting intrinsically assumes an infinite resource model. For instance, it is possible to associate the maximum weight with all indicators ( w i = W max , ∀i ). It doesn't force decisions which should model the trade-offs existing among the different aspects of life. In order to model such trade-offs in a more effective way, we introduce a constraint for the overall weighting value, W tot = ∑ n i=1 w i ≤ nk , where n is the number of considered criteria and k is a value between W min and W max . In the context of this work we are using six different criteria ( n = 6 ) and weighting in the range [1, 10] ( 1 ≤ w i ≤ 10, ∀i ) rather than [0,10] as we want all criteria to contribute to overall performance. We consider k = 5 , which implies W tot = 30."}, {"section_title": "Weighting based on report analysis", "text": "In this sub-section we propose different weightings based on the analysis of different sources of information. As previously explained, probably such an inference cannot be completely objective. In order to minimise the impact of interpretations and biases in the analysis, for each case considered, the criteria and conclusions are explained and briefly discussed. Additionally, we have restricted the analysis to sources of information that allow a relative easy mapping. We have excluded those sources that potentially provide very good insight but are objectively hard to be converted in a clear weight set to the target criteria.\nA summary of the weights produced by analysing the different reports is proposed in Fig. 4 . Each case is separately analysed and explained in the remaining part of this sub-section.\nWeighting based on the analysis of UN Global Issues The UN Global Issues report proposes 22 different global issues. Each issue in the report can be associated to no-one, one or more than one of the categories identified in this study.\nAccording to our analysis, the category Environment/Sustainability is associated with 5 issues from the report (Atomic Energy, Climate Change, Food, Water), Health/Demography with 5 issues (Africa, Ageing, AIDS, Health, Population), Economy with no issue directly, Poverty/Inequality with 6 issues (Africa, Children, Decolonization, Ending Poverty, Food, Water), Human Rights/Freedom with 6 issues (Africa, Democracy, Gender Equality, Human Rights, International Law and Justice, Refugees) and Violence/Instability Fig. 4 Weighting based on the analysis of different sources. Each weights set is compared with an homogeneous distribution of the resources-i.e. Neutral Weighting with 2 issues (Africa, Peace&Security). Resulting weights are reported in Table 2 . As previously discussed, the minimum weight assumed is 1.\nWeighting based on the analysis of WEF 10 biggest global challenges (2016) The WEF 10 biggest global challenges [8] is a report with a much more economic focus. The criteria to map the 10 challenges in the report into weights are the same as in the previous case.\nFrom our analysis, Environment/Sustainability is directly related to 2 challenges (Food Security, Climate Change), Health/Demographics to 1 challenge (Healthcare), Economy to 5 challenges (Inclusive Growth, Unemployment, Financial Crisis, Global Trade, Investment Strategy), Poverty/Inequality to 2 challenges (Food Security, Inclusive Growth), Human Rights/Freedom to 1 challenge (Gender Equality) and Violence/Instability to no challenge. The resulting weighing is reported in Table 3 .\nWeighting based on the analysis of 10 most important global issues from The Borgen Project The Borgen Project, a nonprofit organization that is addressing poverty and hunger, has provided a list of 10 most important global issues [5] .\nAccording to our analysis of such a source, Environment/Sustainability is directly associated with 3 of the 10 issues (Climate Change, Pollution), Health/Demographics with 4 (Pollution, Security and Wellbeing, Malnourishment and Hunger, Substance Abuse), Economy with 1 (Unemployment), Poverty/Inequality with 3 (Lack of Education, Malnourishment and Hunger, Security and Wellbeing), Human Rights/Freedom with 1 (Government Corruption) and Violence/Instability with 3 (Violence, Security and Wellbeing, Terrorism). The resulting weights are reported in Table 4 .\nWeighting based on the analysis of Global Shapers Survey 2017 Global Shapers Survey 2017 by WEF reflects opinion of millennials. Business Insider Australia has recently provided a list of the 10 most critical problems in the World according to millennials based on the Global Shapers Survey. In order to assure uniformity and consistency with previous cases, we have considered the list of problems provided but not the relevance associated with each of them.\nAccording to our analysis, Environment/Sustainability matches with 2 problems (Food and water security, Climate change/Destruction of nature), Health/Demographics with 1 (Safety/Security/Wellbeing), Economy with 1 (Lack of economic opportunity and unemployment), Poverty/Inequality with 4 (Lack of education, Food and water security, Poverty, Inequality), Human Rights/Freedom with 1 (Government accountability and transparency/ Corruption) and Violence/Instability with 3 (Safety/Security/Wellbeing, Religious conflicts, Large scale conflict/Wars ). Weights are reported in Table 5 ."}, {"section_title": "Performance analysis", "text": "Performance analysis is based on two main metrics as follows:\n• Score This is the primary metric for analysis and it is based uniquely on the absolute performance according to computations (Pileggi 2020) : positive scores are associated with positive performance, as well as negative scores correspond to negative performance. • Interpretation It is a relative metric defined by comparing the score of a given computation with the corresponding neutral computation, which assumes fair weighting (Pileggi 2020) . In qualitative terms, scores higher than neutral computation correspond to an optimistic interpretation, while lower scores are associated with a pessimistic interpretation.\nThe two metrics as defined are completely independent as all qualitative combinations of the two metrics (positive/optimistic, positive/pessimistic, negative/optimistic and negative/ pessimistic) are possible.\nLooking at the analysis framework more holistically, two additional analysis factors may be considered:\n• Uncertainty In the context of this study, rather than a proper uncertainty, such a metric defines higher and lower bounds based on the potential weighting variance. Such an estimation provides a more consistent support for analysis in context. • Numerical bias Even though it is limited by the method adopted, numerical bias directly affects the absolute result. It is expressed by the neutral computation and can play a relevant role not only in the analysis phase but also when selecting criteria, as it can drive the selection of balanced set of indicators.\nComputations for the different weight sets are presented in Fig. 5 , while a qualitative summary of results is presented in Table 6 .\nLooking at Fig. 5 , the score associated with the different weight sets is represented by the blue line. Such a score is compared with the corresponding neutral computations in the charts on the left, while it is represented both with extreme computations in the charts on the right.\nWeights from the analysis of UN Global Issues propose a relatively balanced distribution with a priority on Poverty/Inequality, Human Rights/Freedom, Health/Demographics and Environment/Sustainability. Additionally, there is a relative low priority for Violence/Instability and no economical focus. The resulting computation shows contrasting results, including a negative performance but also an optimistic interpretation. The weight set resulting from the analysis of the 10 biggest global challenges by WEF presents a much more economic oriented focus with a significant attention also for Environment/ Average weights are reported in the last chart in Fig. 4 . As shown, the different case studies considered seem to balance each other. The average case proposes however a priority on Poverty/Inequality. Computations for the average case point out negative performance and optimistic interpretation (Fig. 6) .\nAs expected, the priorities defined by the different weight sets play a key role in the final assessment of performance from a quantitative perspective. However, as shown, it's the contextual interpretation of such metrics that is considered the final assessment. We believe that the research framework proposed can be simple and effective to assess holistically the post-pandemic scenario, as well as to properly assess and reflect mindset and priorities changes behind the numerical estimations or measures.\nLooking at possible interpretations of the results, we would like to remark that the method adopted works in terms of dynamic trend rather than of static snapshot, according to a philosophy of continuous evolution of the World. Such an approach is reflected in the computation of metrics. Therefore, a positive score in a given time-frame should be understood like the World is becoming a better place rather than the World is a good place (Pileggi 2020) . 6 Conclusions and future work\nBy adopting a MCDA-based method, we considered 6 different macro-categories to measure global performance. The method provides a relatively fair analysis framework which allows the systematic combination of heterogeneous criteria. The weights associated with the different criteria play a key role in terms of final result. We have adopted a model that assumes finite resource in order to empathize the trade-offs existing among the different aspects considered. In order to assess global performance and, more in general, global development trends, we have considered four different case studies with a very different focus. Results show that economic-oriented priorities correspond to positive performances, while all other distributions point to a negative performance. Additionally, balanced and economy-focused distributions of weights propose an optimistic interpretation of performance regardless of the absolute score.\nFuture work is expected to be developed in different directions. In line with the current focus, we will aim more fine grained studies at a country level. We will explore further secondary data sources to infer priorities accordingly (e.g. World Values Survey-http:// www.world value ssurv ey.org/). We will also propose and analyse in context additional case studies with a more community-oriented focus to be established by survey (e.g. Danowski and Park 2020) .\nThe results obtained contribute to provide a concise understanding in context of the global development evolution and its underpinning priorities in the pre-pandemic period. We believe that such a dynamic snapshot can be useful to facilitate a better holistic understanding of the post-pandemic scenario that will be object of our future research. Indeed, we expect a significant mindset change triggered by the pandemic that will probably have an impact in setting priorities for a sustainable development. Last but not least, we will adopt a similar approach to estimate and analyse more specific aspects (e.g. global or country resilience to pandemic). On the right, that same result is considered looking at the extreme possible computations"}]