[{"section_title": "Introduction", "text": "Recruitment and retention of Ph.D. students in engineering fields is becoming increasingly important. Global, economic, educational trends, and college and university efforts play big roles in this process and thereby require increased attention and research. The global trade market has given rise to a breadth and intensity of competition that values flexible teams with multi-talented members .While the educational development in countries such as China and India challenges the United States' position as leader in engineering education at the undergraduate level 2 . These countries have also recognized the value of doctoral education. In the U.S., 56% of all doctoral degrees within engineering are awarded to foreign-born students 3 . Over the past decade however, China has seen a 420% increase in the number of doctoral degrees awarded in science and engineering 2 Despite the many studies which have been conducted since ABET's EC 2000 criterion was established in 1996, researchers have not explored empirically many studies of engineering at the graduate level. Given that U.S. engineers will represent a smaller percentage of the engineering profession in the future 2 and that U.S. engineering universities will have to compete more aggressively to attract talented engineers to conduct university research, an immediate focus on the recruitment and preparation of engineering doctoral students within U.S. institutions is needed."}, {"section_title": "Literature Review", "text": "In the mid to late 1900s, the U.S. saw a dramatic increase in the number of doctoral education recipients. Since the Survey of Earned Doctorates (SED) began in 1957 4 the number of doctorates granted by U.S. universities has, on average, increased by approximately 3.5% per year. However, the growth in the number of doctorates has not been stable. Until 2006, when higher education institutions awarded the highest number of doctorates in history with 45,596 doctorate recipients, there had been periods of rapid growth and decrease in the number of doctorates awarded. Between 1961 and 1971 the number of doctorates awarded each year almost tripled from 10,000 to 31,867. This number remained stable during the late 1970s and through the early 1980s. After a second period of growth in the mid-80s, 42,637 research doctorates were Page 15.952.3 awarded by 1986. From 1998-2002, the number of doctorates awarded each year generally declined and reached a low point in 2002. By 2006, an all-time high number of doctorates was awarded in the U.S. 5 In science and engineering (S&E) fields, this growth was due in large part to degrees awarded to international students, many who came to the U.S. to study following World War II 6 . In 2006, U.S. citizens received 63% of all research and 56% of S&E doctorates. The percentage of U.S. citizens who earned a doctorate in engineering was the lowest with 32% compared to physical sciences (47%), humanities (78%) and education (87%). 5 As the country that awards the most Ph.D.s, the U.S. also has been the primary source of scientific achievement. Globalization over the past 10 years, however, has begun to shift dramatically the vision of S&E in the U.S and has seriously threatened the U.S.' position as the leading educator of engineering doctoral students, particular foreign students. Leaders within Asian countries are focusing upon ways to develop and to retain their engineering talent. Over the next ten years, China's Higher Education Commission for science, engineering, and technical education will establish universities in a variety of industrial cities so that many Chinese students can pursue their doctoral studies in their home country 7 . In fall 2007, India began to establish thirty new universities and a college in each of its 340 districts to enhance educational quality in their country and to retain its workforce 8 . Given that U.S. engineers will represent a smaller percentage of the engineering profession in the future 2 and that U.S. engineering universities will have to compete more aggressively to attract engineers to conduct university research, an immediate focus on the recruitment and retention of engineering doctoral students within U.S. institutions is needed. Most institutions and researchers focus on undergraduate student recruitment and retention (there is an established literature in both areas [9][10][11][12][13][14][15][16][17][18] . The vast body of literature defines the following problems to be reasons for undergraduate student dropout from college: being academically underprepared, unclear student goals, financial problems, students' lack of commitment to institution and intuitions' lack of commitment to students, poor institutional fit, and isolation and lack of engagement. However, research falls short when it comes to recruitment and retention of graduate students. How can we recruit more graduate students into engineering disciplines and what kind of strategies can use to help them graduate? Baron 19 noted financial assistance to be the most used recruitment tool for graduate students. Graduate school handbooks, printed informative materials especially on financial aid, campus visits, personal contacts, and utilization of professional guides followed as the most used recruitment techniques. Because of expected difficulties in the future recruitment and retention of doctoral students in the"}, {"section_title": "Methods", "text": "Qualitative methods were used to conduct this study. To define the attributes of engineering Ph.D.s, researchers conducted semi-structured interviews with industry and academic professionals in engineering fields. The primary research question for this study is, \"What suggested recruitment and retention questions to industry and academic experts suggest for doctoral engineering education?\" Each interview was recorded, transcribed and coded for reoccurring themes. A constant comparative method 20 was used to highlight the similar or different views of the respondents regarding the attributes of an engineering Ph.D."}, {"section_title": "Data Sources", "text": "Forty engineering professionals who submitted papers to the 2009 conference of the American Society for Engineering Education (ASEE) were contacted to participate in the study. The participants were selected because of their expertise in graduate education in engineering fields. Researchers identified participants' presentation on graduate engineering education topics via the use of conference catalog and compiled information about the participants and their focus on graduate education via the World Wide Web. Nine individuals (i.e., eight during the conference and one after the conference) have completed semi-structured interviews with the research team. Two more interviews were conducted via telephone."}, {"section_title": "Data Analysis", "text": "Interviews were recorded digitally, voice recordings were transcribed for each respondent, and responses to the question were coded for recurring themes. After the first reading of four interviews, researchers compiled a codebook 21 to be used during the analysis. The codebook was discussed and was revised in the research group. Additional codes were included as new points emerged from the rest of the data. The codes then were grouped into themes. A constant comparative method 20 was used to highlight the similar or different views of the respondents regarding the problems and solutions in graduate student recruitment and retention. The participants responses were grouped by re-reading of the data and possible themes were identified. After reading each interview the themes were reviewed and new data was classified under appropriate themes."}, {"section_title": "Findings and Discussion", "text": "The themes that were identified among the sample are discussed in Figure 1. All participants mentioned the need to raise awareness among potential engineering doctoral students about the benefits, rewards, and relevance of obtaining such the degree. By educating engineering students at all levels, they might learn early the role that Ph.D. recipients play in a global economy. Eight out of nine respondents perceive that finances are barriers to students enrolling and remaining in graduate programs despite the numerous forms of financial assistance available for graduate students, (e.g., fellowships, grants, assistantships). One of the participants commented on the financial problems and offered possible solutions: Page 15.952.5 In order to get the best and the brightest one of the things we're going to have to do is incentivize them with two things. First of all, grand challenges. And then, a financial way of working on these problems. So either internships, or corporately sponsored scholarships, something has to be done here to make it actually happen. Another respondent commented that; Funding's always an issue. I'd certainly across just different disciplines there seems to be more funding for engineering students. We hire education students to do educational research statistics for us and whatnot. They're hungry for anything. They're so grossly underpaid."}, {"section_title": "Figure 1. Recruitment and retention strategies", "text": "Most participants also suggested that certain sociopolitical and economic conditions of today's world affect the recruitment and retention (RR) of engineering doctoral students (see RR Issues). Among the conditions they mentioned include the current economic climate, immigration issues (particularly after September 11, 2001), increases in the offering of graduate degrees in other countries, and the fact that a portion of potential students are not willing to pause their lives to enroll in a full time Ph.D. program. Similarly, other strategies (coded as Other RR strategies) were mentioned and are defined as the creation of more friendly immigration policies, the development of dual or shared degrees with other countries, and the use of distance learning to cater to diverse populations. One of the respondents noted: \"if they're a foreign student, just on a student visa, that can make a big problem, and as I say, how you solve that I'm not sure\". Fewer than half of the respondents referred to undergraduate research experiences, tailored degree programs, and K-12 exposure to engineering as ways to increase the recruitment and Page 15.952.6 retention engineering Ph.D.s. By making a connection between students' undergraduate research experiences and potential Ph.D. research areas, faculty might also make student more aware of how elements of the engineering education complement each other. Also, by offering Ph.D. students greater flexibility in their Ph.D. programs, innovative students who have abilities to pursue interdisciplinary and multidisciplinary topics might enter their departments with great enthusiasm and might stay there because of the unique opportunities that they are given. Finally, K-12 students, similar to undergraduate students, can begin to understand what Ph.D. do before they enter a B.S. program. In this way, students might begin to see the Ph.D. as the norm for someone pursuing a career as an engineer. One of the participants commented that \"over the past 10 years we have realized that the way that that is going to happen is not to catch them when they first come to college where they are not prepared anyway, but start in the early grades; primary and secondary schools\"."}, {"section_title": "Conclusions", "text": "This study confirms the importance of recruitment and retention of Ph.D.s in engineering. Although financial assistance is still a concern at this level, additional strategies were also identified by participants. By thinking about recruitment and retention now, future generations of engineering might obtain Ph.D.s in an effort to improve the global economy and the lives of others in the U.S. and internationally."}]