[{"section_title": "Abstract", "text": "The authors find evidence of income convergence across all substate labor markets in the lower"}, {"section_title": "INTRODUCTION", "text": "A large volume of research has found that U.S. state incomes have converged since World War II. However, these results may not be representative of local trends, since states are political rather than economic entities and are typically large areas that contain many, or portions of many, functional substate economies. Such substate economic regions better reflect the territory in which workers and locally oriented businesses operate and, even within the same state, differ significantly in terms of economic performance and structure.\nThe observed patterns of convergence among state political jurisdictions could reflect any number of underlying patterns in the distinct substate economies that make up the United States. For instance, the overall state pattern of convergence and mobility might be directly reflected in both metropolitan and nonmetropolitan regional economies. In contrast, it might be convergence primarily among large metropolitan regions of the country that is driving the pattern of convergence among states. Alternatively, the overall pattern of convergence may reflect changing fortunes among particular types of regions, such as a drop in income among many large urban regions, combined with rising incomes among many smaller, nonmetropolitan regions. A direct examination of the patterns of convergence within similar groups of substate regions, such as large urban areas or small nonmetropolitan areas, would provide greater insight into the convergence process.\nTo shed light on these issues, we analyze substate regions, dividing them into metropolitan and nonmetropolitan groups and further subdividing these groups based on the size of the largest city within the region. The additional focus on nonmetropolitan areas is important since the vast majority of convergence studies have focused on states and metropolitan areas, even though 20 percent of U.S. residents currently live in nonmetropolitan regions and per capita personal income levels tend to be much lower (24.1 percent lower in 1999) in these regions.\nThis article utilizes metropolitan and nonmetropolitan U.S. Department of Agriculture Economic Research Service (ERS) commuting zones and analyzes the evolution of this regional income distribution in terms of its modality and mobility, following an approach developed by Quah (1993a Quah ( , 1993b Quah ( , 1996a Quah ( , 1996b Quah ( , 1996c , which gives us a richer picture of distribution dynamics than is available from sor b-convergence techniques. 1 The modality of the income distribution matters because it addresses whether the economy is converging to any particular portion of the distribution. For instance, a distribution that shows little tendency to concentrate suggests that inequality is rising, or at least not falling, over time. In contrast, a distribution that tends to become strongly concentrated in one income class suggests that inequality across regions is falling over time. Furthermore, if the distribution does have a tendency to concentrate, this method will allow us to see where that concentration is taking place.\nThe location of concentration within the distribution is driven by the symmetry of intradistributional mobility, and this will also influence our view of the convergence process. We will draw different conclusions from an overall process of convergence if it is the result of symmetric mobility of regions both up and down the distribution, as opposed to the case in which it is principally the result of upward (or downward) mobility within the distribution.\nThe level of intradistributional mobility is also important, since sustained inequality in the income distribution may cause us less concern if we also find a large degree of income class and rank mobility, especially if relatively low-income regions are upwardly mobile. This would suggest that individual regions have substantial opportunities to improve or maintain their relative income even in the absence of an overall convergence process. A pattern of convergence with low rank and income class mobility may suggest that regions have less opportunity to alter the evolution of a natural convergence process.\nIn summary, this article adds to the convergence literature by investigating the modality and mobility of the U.S. per capita personal income distribution for metropolitan and nonmetropolitan regions (as defined by ERS commuting zone regions) within the forty-eight contiguous states and the District of Columbia for the 1969 to 1999 period. We test for heterogeneity in distributional dynamics across metropolitan and nonmetropolitan regions, across geographic regions, and across time periods, using loglinear models (as proposed by Fingleton 1997 Fingleton , 1999 . We also analyze the symmetry of mobility within the distribution, that is, whether movement downward within the distribution is as common as movement upward. Finally, we also utilize a measure of rank mobility, which provides a more detailed picture of mobility within the distribution than the transitions among income classes.\nWe find that the overall commuting zone income distribution has exhibited a trend toward greater concentration in the middle of the distribution during the thirty-year period. We also find that this trend toward convergence is not symmetric and that downward mobility significantly exceeded upward mobility during the period. This asymmetry in distribution dynamics arises primarily from the metropolitan distribution (which exhibits strong downward mobility), in contrast to the nonmetropolitan distribution, which exhibits more upward mobility during the thirty-year period. This suggests that nonmetropolitan zone convergence has been characterized more by \"catching up,\" in contrast to results for metropolitan zones. We find that disaggregating metropolitan/nonmetropolitan zones by population size further highlights convergence differences, with major metropolitan centers tending to concentrate in their lowest income class, while nonmetropolitan regions with small towns show little tendency to concentrate in any of their income classes. This highlights the importance of disaggregating regions beyond the state level and even beyond simple metropolitan/nonmetropolitan typologies.\nThis article proceeds as follows: section 2 contains the background and literature review, section 3 examines the methodology and data used in the analysis, section 4 contains empirical results for commuting zone regions disaggregated by metropolitan and nonmetropolitan type (and by size of largest place in the regions), and the article concludes with section 5."}, {"section_title": "BACKGROUND AND LITERATURE", "text": "Issues of regional/international economic convergence have generated a large and growing body of research.\n2 Initial empirical studies drew their inspiration from neoclassical growth theory, which predicts that per capita income in regions/ countries with the same structural characteristics will tend to converge, in the sense that regions with relatively low starting income levels will grow faster than regions with relatively high starting incomes. 3 The driving force for convergence in this model is diminishing returns to capital, which tends to slow growth in the highincome region and spur it in the low-income region. This type of convergence is known in the literature as absolute b-convergence.\nDivergence (in the absolute b-convergence sense) may occur in the neoclassical model if regions differ in terms of structural characteristics, such as saving and population growth rates. However, even in this case, a type of convergence may still be achieved if we redefine convergence as each region returning to its own steady state. This type of convergence is known as conditional b-convergence.\nOf course, divergence may be achieved by relaxing other assumptions underpinning neoclassical growth theory. For instance, relaxing the assumption that capital exhibits diminishing returns (which may be plausible in the case of additions to human capital) makes it possible for regions that differ only in terms of starting income levels (but have in common all other steady state determinants) to fail to converge (Romer 1986) . Furthermore, this and other sources of increasing returns to scale arising from agglomeration economies offer a route to divergence that may be particularly important for substate regions, like metropolitan areas (Glaeser et al. 1992) .\nEmpirical tests for absolute b-convergence have concentrated on cross-section regressions of regional growth rates over time on initial income levels (and in the case of conditional b-convergence, steady-state determinants as well). The coefficient on initial income indicates the presence or absence of b-convergence. It has also been common in the literature to present results relating to the dispersion of incomes over time. The idea is that if the variance (sometimes coefficient of variation) of per capita incomes falls over time, then we have evidence in support of sconvergence. 4 Quah (1993a 4 Quah ( , 1993b presented an alternative method to empirically investigate convergence by examining the dynamics of the income distribution directly. This approach characterizes the distribution both in terms of modality and mobility and is thus inherently multidimensional. Quah argued that this approach offers insight into the distributional dynamics of regional or national incomes, because it most directly addresses the usual questions at hand. Furthermore, this method highlights characteristics of the distribution that are not readily observable from s-or bconvergence results, such as twin-peaks and related aspects of the shape, as well as indicators of intradistributional mobility.\nWhile state-level data has often been used in the convergence literature, explorations of substate income dynamics have been less often pursued. Drennan and Lobo (1999) proposed a test for b-convergence (which does not require regression) and applied it to 273 metropolitan statistical areas in the United States for the 1969 to 1995 period. They found support for b-convergence but did not find evidence of sconvergence. Drennan, Tobier, and Lewis (1996) sought to relate U.S. median household income divergence during the 1980s to growth in business services, which tend to be important in cities. Crihfield and Panggabean (1995) found support for (conditional) b-convergence across 282 U.S. metropolitan statistical areas during the 1960 to 1982 period and examined steady-state factors, including public and private investment, as well as human capital accumulation. Glaeser, Scheinkman, and Shleifer (1995) also investigated issues related to b-convergence across 203 large U.S. cities during the 1960 to 1990 period but found little evidence in support of convergence. Overall, the substate literature finds mixed support for income convergence across metropolitan, substate regions in the U.S. since 1960. Nissan and Carter (1999) and Henry (1993) explored the issue of metropolitan and nonmetropolitan convergence, using b-and s-convergence concepts. Both papers find support for club convergence (which is more evident for nonmetropolitan regions than for metropolitan regions) but found little evidence that incomes in nonmetropolitan regions are converging toward metropolitan averages. Nissan and Carter (1999) focused on s-convergence and applied it to state-level aggregations of metropolitan and nonmetropolitan counties. They found evidence of within-group convergence for metropolitan and nonmetropolitan regions, and they noted that convergence trends vary over time, with a general trend toward convergence during the 1970s, increasing dispersion in the 1980s, and the resurgence of convergence during the 1990s.\nHenry (1993) focused on U.S. Bureau of Economic Analysis (BEA) regions in the South Census region from the late 1960s to the mid-1980s and also found strong evidence of within-group convergence for metropolitan and nonmetropolitan regions but little evidence of between-group convergence. Henry also presented some statistical evidence that the convergence process differs across metropolitan and nonmetropolitan regions, employing a variant of the test for conditional bconvergence.\nThis article analyzes the evolution of the distribution of per capita income since 1969 for metropolitan and nonmetropolitan regions. We will add to the literature on metropolitan/nonmetropolitan convergence by applying the empirical tools developed by Quah (1993a) and Fingleton (1997 Fingleton ( , 1999 to ERS commuting zone regions. These tools give a new perspective on (and allow statistical tests for differences in) the intradistributional dynamics that are only summarized by typical approaches to b-and s-convergence. Furthermore, we will disaggregate the overall distribution temporally, by metropolitan/nonmetropolitan region types (further classified by population size), and by census region, and test for statistically significant differences across these disaggregations."}, {"section_title": "METHOD AND DATA", "text": "We focus on substate, multicounty regions as our basic unit of analysis. These regions are the commuting zones defined in Tolbert and Sizer (1996) , which reflect local labor market areas, based on journey-to-work data from the 1990 Census. They include both metropolitan and nonmetropolitan regions. There are 722 commuting zones in the lower forty-eight United States, of which 256 are classified as metropolitan and 466 as nonmetropolitan.\nTo examine the evolution of the distribution of income over time for ERS regions, we follow Quah (1993a Quah ( , 1993b Quah ( , 1996a Quah ( , 1996b Quah ( , 1996c and focus directly on the distribution itself. This adds to the intuitive appeal of the results by focusing directly on the issues of interest: mobility and modality. Furthermore, as developed in Hammond and Thompson (2002) , our approach is multidimensional and thus reveals more than a simple examination of trends in means and standard deviations. However, it is important to keep in mind that the analysis depends on the number of income classes chosen for analysis and that this decision may influence the results. In addition, this approach ignores spatial dimensions that may be important, as pointed out by Rey (2001) .\nTo examine how the distribution of per capita income has changed over time, we use mean-adjusted log relative income levels. We rank these relative income levels in the beginning year, split the distribution evenly into income class, and then examine whether and how the distribution concentrates across these given income class over time. Is there a tendency for per capita incomes to converge, that is, to concentrate in one particular income class, perhaps the middle-income class? Or does the distribution remain evenly spread among income class? To examine this sort of movement in per capita income, it is necessary to keep income class ranges constant during the period of interest.\nTransition matrixes are a convenient way to summarize the evolution of the overall distribution (see Bhat 1984; Bartholomew 1982; and Collins 1975 \nwhere the p ij are the estimated probabilities of transition from income class i to income class j during the span of time S. These p ij are defined so that\nwhere F (x) is a (1´5) vector containing the income class distribution. We can use the transition matrixes to extract information regarding mobility and modality in the distribution. We use the Shorrocks (1978) index to summarize mobility across income class. This index is computed as follows:\nwhere #states is the number of fractiles under consideration (in this case, five). The value of the index ranges between 0 and 1.25, with higher values indicating more mobility across income class."}, {"section_title": "5", "text": "We can address modality easily by examining the evolution of the distribution over time. We can also investigate the long-run implications of this evolution by exploiting the relationship in equation 2. Specifically, assume that the estimated transition matrix is constant, and then allow the relationship to move forward through time, in much the same way we would with a time series model. Suppose we start with the relationship given in equation 2. We can investigate the long-run distributional implications of the observed transition matrix by carrying out successive iterations of equation 2. Thus, iterating equation 2 again gives\n,\nwhere the term on the far right is derived via substitution from equation 2. Continuing to iterate gives\nwhere n is the number of iterations. Assuming that continued iteration eventually produces a stable, unchanging income class distribution we call this the long-run distribution.\nFinally, we complement our analysis of income class mobility and modality with analysis of rank mobility over time, using the rank correlation coefficient. This adds an interesting element to the analysis, because it is possible for the overall distribution to converge without any change in rank ordering. In a similar way, it is possible for the distribution to fail to converge while at the same time producing large changes in rank ordering. In comparison to the Shorrocks index, rank correlation gives us an indicator that is sensitive to movements across the entire distribution, not just movement across income class boundaries.\nWe test for differences across transition matrixes using loglinear models, following Fingleton (1997 Fingleton ( , 1999 . Loglinear models describe relationships between categorical variables. In our case, the main categorical variables will be beginning and ending year per capita personal income (indexed by A and B, respectively), which is categorized into five classes (indexed by i, for beginning-year income class, and j, for ending-year income class). In particular, the saturated loglinear model can be written\nwhere log m ij is the log expected frequency for cell (i,j). The saturated model fits the data perfectly with zero degrees of freedom. The row (column) effect is given by\n( ), and l ij AB accounts for interactions. By imposing restrictions on the saturated model, we can test various hypotheses regarding our transition matrixes. For instance, we test for the order of the Markov chain in our transition matrixes by restricting l ij AB = 0. We fit the model using maximum-likelihood methods (following Fingleton 1997 Fingleton , 1999 and take as our measure of goodness of fit a likelihood-ratio test statistic (the scaled deviance 6 ). The scaled deviance may be compared to the chi-squared distribution with degrees of freedom given by the model in question.\nRestricting l ij AB = 0 amounts to a test for independence between beginning-year and ending-year per capita personal income. If the transition matrix characterizes at least a first-order Markov chain, we expect ending-year income to depend on beginning-year income. This allows us to rule out a random assignment of regions across income classes during the interval between the beginning year and the ending year, which is an important consideration since transition matrixes are obviously not well suited to the analysis of independent events.\nWe also test for pure symmetry (l l , where pure symmetry requires marginal homogeneity and equality of off-diagonal cell counts. Quasi-symmetry is less restrictive in that it allows the marginal distributions to differ. Tests of symmetry provide information regarding the propensity of regions to move up or down the income distribution over time. This provides crucial information on the character of the observed convergence, in that it allows us to statistically differentiate between convergence characterized primarily by regions falling back toward lower-income classes or whether the process is characterized by regions moving up to the higher income classes.\nWe test for stationarity in our transition matrixes by introducing time as a third categorical variable into our loglinear model. This (saturated) model takes the form\nTo test for time stationarity, we restrict l l jt BT ijt ABT = =0 so that there are no interactions between the time period and ending income. This test gives us information on the extent to which distributional dynamics differ over time.\nFinally, we can also test for transition matrix differences across region types (such as metropolitan versus nonmetropolitan), where R indexes region type and the model takes the form \nTo test for similarity across region types, we restrict l l jr BR ijr ABR = =0 so that there are no interactions between the region type and ending income.\nIn testing the properties of our estimated transition matrixes, we abstract from spatial dependence that may exist in the data. We hope that our regional aggregation into functional labor market areas will reduce the impact of spatial dependence, which, as Fingleton (1997 Fingleton ( , 1999 pointed out, may affect inference in this context."}, {"section_title": "7", "text": "For our analysis, we use data on per capita personal income for the 722 ERS regions in the lower forty-eight United States. ERS commuting zone regions are defined in Tolbert and Sizer (1996) , using commuting flow data from the 1990 Census. Commuting zone regions are (usually, but not necessarily, multicounty) regions designed to encompass a local labor market.\nThese regions can, and often do, cross state lines. Furthermore, they are the product of a consistent methodology applied to both metropolitan and nonmetropolitan areas and so allow us to look for differences across county types. Metropolitan regions include at least one metropolitan statistical area (MSA) or primary metropolitan statistical area (PMSA). Nonmetropolitan regions do not include an MSA. The commuting zone regions are also classified by the population size of the largest place in the region. There are three additional classifications for each region type.\nThe data are from the BEA Regional Economic Information System (REIS) CD. This data set currently extends from 1969 to 1999 for counties, which are the building blocks for the ERS regions. Personal income includes net earnings from work, which is composed of wages and salaries, other labor income, and proprietors' income, less contributions for social insurance, and an adjustment for place of residence. Personal income also includes income from dividends, interest, and rent as well as transfer income.\nMost ERS regions registered per capita personal income levels well below the U.S. level in 1999, with 64 regions at or above the U.S. level and 658 below the U.S. level. Per capita personal incomes range from 163 percent of the U.S. average (for Jackson, Wyoming) to 38 percent of the U.S. average (for Maverick County, Texas). The unweighted average of relative per capita personal income levels for all ERS regions in 1999 was 79.8 percent. 8 The data, as published by BEA, abstract from considerations of cost of living. It is not unusual in the literature for the United States to use data unadjusted for regional costs of living, because these costs are notoriously difficult to measure. However, as Wojan and Maung (1998) ; Deller, Shields, and Tomberlin (1996) ; Eberts and Schweitzer (1994) ; and Izraeli and Murphy (1997) , among others, argue, cost-of-living differences may influence the results."}, {"section_title": "EMPIRICAL RESULTS", "text": ""}, {"section_title": "RESULTS FOR ALL ZONES", "text": "Kernel density estimation offers a graphical approach to the observation of convergence processes. We apply a Gaussian kernel, using the Silverman method to select bandwidth, to the mean-adjusted log relative per capita personal income data and display the resulting estimated distributions for 1969 and 1999. As Figure 1 shows, the distribution in 1999 is more concentrated than is the 1969 distribution, with the standard deviation falling from .207 to .190. This approach suggests ERS commuting zone incomes have converged during the last thirty years, but it does not tell us much about the internal structure of the process. We can gain additional insights into the convergence process by estimating and examining the properties of the underlying transition matrix.\nThe first block of Table 1 shows the transition matrix for all commuting zones for the 1969 to 1999 period, which is interpreted as follows. The row headings show the starting income class and column headings show the ending income class. Thus, the first row tells us that of the zones that were in income class 1 (the lowest income The overall impact of these transitions across income class tended to concentrate the distribution into income class 2 with 30.5 percent of all zones in 1999. Income class 2 spans mean-adjusted relative incomes from 83.3 to 96.7 percent of the U.S. average (unadjusted, the income class 2 boundaries are 65.6 to 76.3 percent of the U.S. average). The transition matrix also suggests that in the long run (defined as ten transitions) 32.7 percent of zones come to rest in income class 2 and 26.6 percent fall in income class 3.\nNote that the transitions do not appear to be symmetric. For instance, of the zones that began in the highest income class (income class 5), 53.8 percent remain in that income class in 1999, while 26.2 percent dropped down to income class 4, 13.1 percent fell to income class 3, 5.5 percent fell to income class 2, and 1.4 percent made the transition from the highest income class to the lowest. This contrasts with the transition rates of zones beginning in income class 1 (described above). We employ our loglinear model to test for pure symmetry in this transition matrix, for all income classes, and reject the null of pure symmetry at the 1 percent level. We also reject the quasi-symmetry model at the 1 percent level, which suggests that ERS commuting zones display different rates of upward and downward mobility, even accounting for changes in the distribution over time. Thus, since the mass of the distribution is weighted more heavily in income classes 1 and 2 in 1999 than in 1969, we conclude that the overall tendency toward convergence has been characterized by significantly greater downward than upward mobility within the distribution. Thus, commuting zones have shown a greater tendency to move down in the distribution than up during the last thirty years.\nIn addition to general trends toward convergence, we are also interested in intradistributional mobility. This distribution gives a Shorrocks index value of .729, which suggests that regional mobility within the income distribution was relatively high during the period. This mobility is also reflected in the rank correlation coefficient value of .719 for all ERS commuting zones.\nTo put the results for commuting zones in perspective, Table 2 compares these overall convergence results across two alternative schemes for defining regions: states and counties. As the first panel of the table shows, long-run distributions are similar across all three schemes, in the sense that they all suggest convergence into income classes 2 and 3. However, note that distributional and rank mobility generally rise as we disaggregate beyond the state level. While our results do not seem to be driven by the scheme for defining regions, it seems clear that the substate results differ from those obtained using state data. Overall, the transition matrix for the 1969 to 1999 period suggests that ERS commuting zones have shown a tendency to concentrate in income classes 2 and 3, at the expense of the highest and lowest income classes, which is consistent with the estimated densities in Figure 1 . Furthermore, the distribution was also characterized by relatively high levels of mobility across income class (reflected by the Shorrocks index) and a high degree of rank mobility (reflected by a fairly low level of the rank correlation coefficient), compared to mobility rates observed in the state-level distribution. Finally, the transition matrix implies higher downward mobility of ERS commuting zones during the period than upward mobility."}, {"section_title": "RESULTS FOR METROPOLITAN/NONMETROPOLITAN ZONES", "text": "While the overall commuting zone distribution has converged during the past thirty years, this does not necessarily imply that metropolitan incomes are converging to nonmetropolitan incomes, or even that incomes within each subgroup are converging. Indeed, the neoclassical growth model suggests that diminishing returns to capital should drive regions toward their steady state. But if metropolitan regions succeed in capitalizing on agglomeration economies and/or do better in accumulating human capital, we might expect distribution dynamics and convergence/divergence trends to differ across metropolitan and nonmetropolitan subgroups.\nTo expand our understanding of the convergence and mobility processes at work within the 722 ERS commuting zones, we disaggregate the data according to metropolitan and nonmetropolitan zones (and further by size of metropolitan and nonmetropolitan zone). Of the 722 ERS commuting zones, there are 256 classified as metropolitan and 466 classified as nonmetropolitan.\nWe begin by examining kernel density estimates of the mean-adjusted log relative per capita personal income distributions for metropolitan and nonmetropolitan zones for 1969 and 1999. As Figures 2 and 3 show, the distributions for both metropolitan and nonmetropolitan zones show evidence of convergence over the thirtyyear period, with the standard deviations falling over time for each region type. However, the process appears stronger for the nonmetropolitan zones than for the metropolitan zones. Indeed, nonmetropolitan zones registered a standard deviation of .203 in 1969, compared to .172 for metropolitan zones. By 1999, however, metropolitan and nonmetropolitan standard deviations were equal at .168. Table 3 contains our estimated long-run distributions for the 1969 to 1999 period for metropolitan and nonmetropolitan zones. For each class of regions, we split the distribution in 1969 into income classes and then examine movement across income classes by 1999. Thus, we have different income class boundaries for metropolitan and nonmetropolitan zones. We prefer this method because each region type has a common starting point, an even distribution across income class. We test for the similarity of per capita personal income transition matrixes across metropolitan and nonmetropolitan zones and reject the null of similarity at the 1 percent level. In other words, we find significant differences across the metropolitan and nonmetropolitan transition matrixes.\nFor both metropolitan and nonmetropolitan zones we observe a single peak in the distribution, although for metropolitan zones that peak is in income class 2, while for nonmetropolitan zones the peak is in income class 3. For nonmetropolitan zones, income class 3 ranges from 95.9 to 107.3 percent of U.S. per capita personal income (including the mean these boundaries are 71.5 to 79.9 percent). For metropolitan zones, income class 2 ranges from 86.3 to 95.3 percent of U.S. per capita personal income (including the mean these boundaries are 75.5 to 83.4 percent).\nMobility across income class, as measured by the Shorrocks index, is higher for nonmetropolitan zones (.866) than for metropolitan zones (.626). We also observe a lower rank correlation coefficient for nonmetropolitan zones (.623) than we do for metropolitan zones (.774), which indicates more rank mobility in the nonmetropolitan distribution than in the metropolitan distribution. The concentration in income class 2 suggests that downward mobility has been a bit stronger than upward mobility for metropolitan zones, and we reject null of pure (quasi) symmetry at the 5 percent (16 percent) level. We reject the null of pure (quasi) symmetry for nonmetropolitan zones at the 1 percent (5 percent) level. Finally, concentration into income class 2 for metropolitan zones, compared to income class 3 for nonmetropolitan zones, suggests that downward mobility in metropolitan zones exceeded the downward mobility exhibited by nonmetropolitan zones. Referring back to Table 2 , which compares metropolitan/nonmetropolitan convergence trends and mobility across alternative regionalization schemes, these conclusions are similar whether we rely on ERS commuting zones or counties (classified as metropolitan or nonmetropolitan by metropolitan statistical area status). In either case we find convergence toward the lower income classes for metropolitan zones and convergence toward the middle of the distribution for nonmetropolitan zones. Furthermore, under either scheme, distributional and rank mobility is higher for nonmetropolitan zones than for metropolitan zones. Table 3 also carries the metropolitan/nonmetropolitan disaggregation one step further, by using the ERS classification of commuting zone regions by population size. This generates three additional categories for both metropolitan and nonmetropolitan zones. We test for similarity across the transition matrixes and generally reject the null of similarity at the 1 percent level. In what follows, we treat the transition matrixes as different.\nAs the first block of the table shows, convergence and mobility patterns appear to vary across the three metropolitan classifications. The smallest metropolitan zones (with populations less than 250,000 in 1990) show the highest rates of .709***"}, {"section_title": "Note:", "text": "Income class ranges are computed using relative per capita income (corrected for drift in the unweighted mean) and are chosen to evenly split the 1969 distribution into income classes. Percentages may not sum to 100 due to rounding. Rank correlation null: Rank correlation = 0. ERS = U.S. Department of Agriculture Economic Research Service. ***Significant at the 1% level. Medium metropolitan center Population of the largest MSA in the commuting zone was at least 250,000 but less than 1,000,000 in 1990.\nMajor metropolitan center Population of the largest MSA in the commuting zone was 1,000,000 or greater in 1990 or the commuting zone is part of a CMSA.\nSmall town/rural Population of the largest place in the commuting zone was less than 5,000 in 1990.\nSmall urban center Population of the largest place in the commuting zone was at least 5,000 but less than 20,000 in 1990.\nLarger urban center Population of the largest place in the commuting zone was at least 20,000 in 1990. *Significant at the 10% level. **Significant at the 5% level. ***Significant at the 1% level.\nmobility across ranks and across income class. They also exhibit a strong tendency toward convergence, with more than half of these zones located in income classes 2 and 3. Medium-sized metropolitan zones (with population between 250,000 and 1 million in 1990) exhibit a mild tendency to concentrate in income classes 2 and 3 but have slightly lower rates of mobility during the 1969 to 1999 period. Finally, the major metropolitan zones (population in excess of 1 million in 1990) registered by far the lowest levels of mobility in the distribution, and the distribution is dramatically concentrated in the lowest income class (47.7 percent of zones in the long run). This suggests that the mobility in the major metropolitan distribution is primarily downward mobility."}, {"section_title": "10", "text": "Our analysis suggests that metropolitan zones overall have exhibited a tendency toward convergence during the period. This is consistent with the results of Crihfield and Panggabean (1995) and Drennan and Lobo (1999) , who found evidence of b-convergence across samples of metropolitan regions. By further disaggregating metropolitan regions according to population size, we find more diversity in distribution dynamics, with small and medium-sized metropolitan zones exhibiting a greater tendency toward convergence in the middle of their distribution than do the major metropolitan zones.\nOur results for major metropolitan zones are particularly interesting, because the distribution dynamics appear to be very different from the other metropolitan region types both in terms of the convergence pattern and mobility rates. We present evidence that, while the major metropolitan zones show a tendency to converge, this convergence is primarily directed toward the lower end of the distribution, while at the same time leaving a relatively large number of zones in the highest income class. This amounts to a form of \"twin peaks\" convergence for the major metropolitan zones.\nOne possible explanation for this pattern in major metropolitan zones is a combination of diminishing returns to capital (which drives convergence among most major metropolitan zones and drives these zones to converge towards the lower income levels in less populous zones), while large concentrations of human capital and agglomeration economies favor strong gains in a few selected major metropolitan zones. This also seems roughly consistent with the industrial structure of the major metropolitan zones. Many of the zones that transited down within the distribution were located in the manufacturing-intensive metropolitan regions in the Midwest, including Detroit, Michigan; Gary, Indiana; and Milwaukee, Wisconsin. Furthermore, several major metropolitan zones in the West also transited downward within the distribution. For example, the Sacramento-Stockton-Yolo, California, zone fell within the distribution primarily because of relatively slow growth in the agriculture-intensive Stockton-Lodi MSA. The large Los Angeles-Orange County-Riverside-Ventura, California, metropolitan zone transited down within the distribution, due in part to weak performance driven by the national defense/ aerospace restructuring of the 1990s (Ong et al. 2003; Hoffmann, Robinson, and Subramanian 1996; Grobar 1996) . Overall, manufacturing employment accounted for 20.5 percent of nonfarm employment in the downwardly mobile zones in 1980, compared to 16.5 percent in the upwardly mobile major metropolitan zones.\nMany of the upwardly mobile major metropolitan zones were located in the South, including Memphis, Tennessee; Tampa, Florida; Altanta, Georgia; Baltimore, Maryland; and Dallas and Houston, Texas. In other census regions, SeattleTacoma, Washington; Denver-Boulder, Colorado; and Boston-Manchester, Massachusetts-New Hampshire; also made upward transitions within the distribution. Many of these more upwardly mobile major metropolitan zones have specialized over time in high-technology sectors and business service activities, where human capital accumulation and agglomeration economies are likely to be important factors. Indeed, educational attainment appears to matter for upward mobility even among major metropolitan zones. According to data from the 1980 Census, shown in Table 4 , the share of the population aged twenty-five and older with four or more years of college averaged 20.3 percent in major metropolitan zones moving up within the distribution, while the same educational attainment measure for major metropolitan zones moving down within the distribution averaged just 17.1 percent. For all major metropolitan zones, 18.8 percent of residents aged twentyfive and older completed four or more years of college in 1980."}, {"section_title": "11", "text": "The second block of Table 3 shows the breakdown for nonmetropolitan zones. Small-town zones registered high levels of mobility across income class and ranks but exhibited little tendency toward convergence (the distribution was roughly evenly distributed across income class in 1999). For nonmetropolitan zones with a small urban center, mobility across income class was relatively low, but rank mobility was relatively high. In addition, the distribution showed a strong tendency to concentrate in income classes 3 and 4. Finally, zones with larger urban centers in 1990 exhibited the highest rates of mobility and a strong tendency to concentrate in the middle of the distribution (in income classes 2 through 4).\nThe lack of convergence among small-town nonmetropolitan zones suggests that these regions are not moving toward a common per capita income level. Together with the additional presence of high mobility, this likely reflects the variety of sector specific shocks hitting these small nonmetropolitan zones, as opposed to a completely different convergence process driving the results. This perspective is supported by the product mix of the regions. Most of these small nonmetropolitan zones are located in the northern sections of the Midwest and West census regions. Of the small nonmetropolitan zones that transited downward in the distribution during the period, 53.8 percent were located in the West. In particular, downward transiting zones were concentrated in rural northern and western states and in particular in the rangelands of eastern Montana, the western Dakotas, and eastern Oregon and Washington. These are areas where cattle production and other range activities are prominent. Data from the 1997 Census of Agriculture indicate that cattle sales accounted for 50 percent of farm income in downward transiting zones.\nIn contrast, of the small nonmetropolitan zones transiting upward within the distribution, 52.3 percent were located in the Midwest, in particular in Minnesota, the eastern Dakotas, and northern Kansas. These are zones with more of a focus on crop production. Data from the Census of Agriculture indicate that cattle sales accounted for only 28 percent of farm income in these upwardly transiting zones.\nShocks to the major agricultural base of these regions may be driving transitions within a distribution which is stable in aggregate. The cattle industry experienced a long and sustained \"cattle cycle\" from 1979 to 1990 when prices fell significantly (Hughes 2001) . This is the same period when relative incomes fell rapidly in many downward transitioning small nonmetropolitan zones, before exhibiting little change during the 1990s. This drop in the farm income from the key beef commodity for these zones would be particularly likely to effect area income because cattle producers do not benefit from many of the federal crop subsidy programs that help maintain farm incomes in crop production regions.\nThese developments among regional commodities also offer more of an explanation than the educational attainment data that was relevant to trends among metropolitan zones. College-level educational attainment does not appear to spur much per capita income growth in these zones. In fact, as shown in Table 4 , downwardly mobile zones registered 11.1 percent of residents with four or more years of college in 1980, in contrast to upwardly mobile zones, with 9.5 percent. "}, {"section_title": "GEOGRAPHICAL DIFFERENCES BY CENSUS REGION", "text": "It is clear that income distributions differ across metropolitan/nonmetropolitan region types. However, income levels and growth rates also differ across geographic regions of the country. These income differences may also indicate differences in convergence and mobility trends across the four census regions of the United States. Table 5 compares the long-run distributions by census region for the 1969 to 1999 period. As the table shows, convergence trends differ markedly across census regions, with ERS commuting zones in the Northeast and West tending to concentrate in their lowest and highest income classes in the long run, while commuting zones in the Midwest and South tended to concentrate in the middle of the distribution. Note that we find statistically significant differences in transition matrixes across census regions, with exception of the Northeast versus the West. Furthermore, we find the highest rates of distributional and rank mobility in the West census region and the lowest rates in the Northeast census region."}, {"section_title": "12", "text": "While the Northeast and West regions have similar distribution dynamics, the underlying characteristics of the observed divergence are very different. In the Northeast, 66 percent of commuting zones are classified as metropolitan. Furthermore, of the zones transiting downward within the distribution, 75 percent were metropolitan. For the Northeast, the observed divergence was driven by different performance across metropolitan zones and the most downwardly mobile commuting zones in the Northeast during the period were medium-sized metropolitan zones, including the Jamestown-Erie (New York-Pennsylvania) zone; the Utica-Syracuse, New York zone; the Binghamton, New York zone; the ReadingLancaster, Pennsylvania zone; and the Harrisburg, Pennsylvania zone. At 26.9 percent, downwardly mobile zones recorded higher employment shares in manufacturing in 1980 than did upwardly mobile zones (with 23.2 percent). In addition, as Table 4 shows, the downwardly mobile zones in the Northeast posted lower levels of educational attainment in 1980, with 14.4 percent of residents reporting completion of four or more years of college, compared to 15.0 percent for the upwardly mobile and stationary zones.\nFor the West region, the observed divergence was primarily driven by different performance between metropolitan and nonmetropolitan zones, with metropolitan zones outperforming their nonmetropolitan counterparts. Indeed, only 16 percent of the downwardly mobile zones in the West were metropolitan. Furthermore, half of the downwardly mobile nonmetropolitan zones in the West were small-town nonmetropolitan zones. More generally, educational attainment rates in the upwardly mobile zones in the West (18.6 percent of residents aged twenty-five and older had four years of college or more) were much higher than in the downwardly mobile zones (13.3 percent with four years of college or more). "}, {"section_title": "ERS ZONES BY SUBPERIOD", "text": "While the results for the 1969 to 1999 period suggest that there has been progress toward convergence across ERS commuting zones, this does not imply that the rate of convergence has been constant. To examine trends in convergence over time, we compute transition matrixes for three ten-year periods: 1969 to 1979, 1979 to 1989, and 1989 to 1999 . We compute income class boundaries for each decade so that the mean-adjusted income distribution is evenly divided into income class for the beginning year. We test for similarity between the per capita personal income transition matrixes for the three time periods and reject the null of similarity at the 10 percent level in all cases. Table 6 summarizes the results for long-run distributions and mobility measures for relative per capita personal income. As the first block of Table 6 shows, the long-run personal income distribution shows two peaks during the 1969 to 1979 period (in income classes 2 and 4, with the largest concentration in income class 4). The distribution gradually changes to one with the largest concentrations in income classes 2 and 3 during the 1979 to 1989 period. The Shorrocks index is .530 during the 1969 to 1979 period. Mobility rises to .663 during the 1979 to 1989 period but falls to .447 during the 1989 to 1999 period. This is mirrored in the rank correlation coefficients, as rank correlation falls from .866 during the 1970s, to .794 during the 1980s, and then rises to .916 during the 1990s. Overall, the 1980s were a period of greater mobility for the 722 ERS commuting zones, which resulted in a greater concentration of zones in income classes 2 and 3. This trend toward convergence in the lower income classes was reinforced during the 1990s.\nThe metropolitan and nonmetropolitan income distribution dynamics also varied significantly across the three decades. The evolution of the metropolitan distribution suggests that the trend toward downward mobility emerged in the 1980s and was also reinforced during the 1990s. Nonmetropolitan zones showed a greater tendency to converge toward the middle of the distribution in each decade and also demonstrated more distribution and rank mobility. Overall, these results suggest that even though the 1980s was a turbulent decade for both metropolitan and nonmetropolitan zones, the trend toward convergence was still evident."}, {"section_title": "CONCLUSION", "text": "Our results for the 722 ERS commuting zone regions show that the per capita personal income distribution has exhibited an overall tendency toward increasing concentration during the 1969 to 1999 period. We find that both metropolitan and nonmetropolitan zones tend to exhibit within-group convergence but that metropolitan zones exhibited more downward mobility within their distribution than did nonmetropolitan zones. Furthermore, the tendency toward within-group convergence was stronger for nonmetropolitan zones than for metropolitan zones. One interpretation of the weaker within-group convergence of the metropolitan zones is 1969-1979 vs. 1979-1989 71.4*** 61.4*** 29. 4* 1979-1989 vs. 1989-1999 95.1*** 64.6*** 54.1*** 1969-1979 vs. 1989-1999 47.0*** 28.0 39.2*** Note: ERS = U.S. Department of Agriculture Economic Research Service. *Significant at the 10% level. ***Significant at the 1% level.\nthat the accumulation of human capital and agglomeration economies have been sufficient to slow overall convergence, but have not been influential enough to completely override the forces of convergence. Crihfield and Panggabean (1995) reported a similar result, in that they find some evidence of increasing returns to scale combined with conditional b-convergence in their sample of metropolitan regions.\nThe results further show the positive impact that high rates of college-level educational attainment tend to have on subsequent growth for major metropolitan zones, in contrast to results for small-town zones. This turns out to be more a more general point, as Table 4 shows. For the all ERS zone distribution, upwardly mobile zones tended to have higher college-level educational attainment in 1980 (13.7 percent with four or more years of college) than did downwardly mobile zones (12.7 percent). This is also true for the metropolitan distribution and particularly so for the major metropolitan zones. However, the results are very different for the nonmetropolitan distribution, where downwardly mobile zones had somewhat higher college-level educational attainment in 1980 than did upwardly mobile zones. This may well reflect the impact of agglomeration economies on growth, so that a region must attain a threshold size to fully capitalize on the growth benefits of collegelevel educational attainment. Varga (2000) made a related point in the context of the impact of university spillovers on innovative activity.\nOverall, the evolution of the income distribution in regional economies of the United States shows a high degree of diversity within an overall trend toward convergence (or falling regional income inequality). This research has shown that distribution dynamics differ significantly across metropolitan/nonmetropolitan region types, across census regions, and over time. These results further highlight the danger of applying previous results for states and metropolitan areas to nonmetropolitan regions (or even to all metropolitan region types). Not only do mean income levels differ across these region types, but the intradistribution dynamics are significantly different as well. Mallick and Carayannis (1994) for Mexico; Cuadrado-Roura, Garcia-Greciano, and Raymond (1999) for Spain; and Azzoni (2001) for Brazil."}, {"section_title": "NOTES", "text": "The literature on state convergence has also generated innovative approaches to the problem, including the time series-oriented research of Carlino and Mills (1993, 1996) and Bernard and Jones (1996a) ; the spatial econometric research of Rey (2001) and Rey and Montouri (1999) ; and the mobility analysis of Fingleton (1997 Fingleton ( , 1999 , Quah (1996a) , and Hammond and Thompson (2002) . Overall, the evidence for U.S. states suggests that relative per capita personal income has converged. Hammond and Thompson (2002) further found high levels of mobility among states within the distribution and that mobility was greatest during the 1980s.\n5. As Geweke, Marshall, and Zarkin (1986) and Quah (1996a) pointed out, there are many ways to summarize mobility within a distribution. We use the Shorrocks (1978) index because it is simple and intuitive. Quah (1996a) found significant similarities across various measures of mobility.\n6. Scaled deviance for the unsaturated model may be computed as SD n n ij ij\nwhere n ij is the observed frequency in cell (ij) and $ m ij is the expected frequency estimated from the model. 7. Hammond (2004) investigated the extent of spatial spillovers across U.S. Department of Agriculture Economic Research Service (ERS) commuting zones, using a spatial Markov chain approach. The results suggest that these spillovers exist but appear to be fairly mild.\n8. The unweighted average is less than 1.0 because the sample contains more low-income, sparsely populated rural regions than high-income, densely populated metropolitan regions.\n9. As is common in this literature, we assume a first-order process if we can reject the null of a zeroorder process.\n10. In this case, we have forty-nine zones with which to estimate twenty-five transition probabilities. Thus, the estimates may not be very reliable. To provide some robustness checking, we used an alternative classification scheme for county-level data: Beale codes (Butler and Beale 1994) . Results for 301 large metropolitan counties (with 1 million or more residents) are very similar to our results for major metropolitan commuting zones.\n11. Data from the 2000 Census suggest that the education gap between upwardly and downwardly mobile major metropolitan regions may have risen during the following decades. In 2000, 30.8 percent of residents in upwardly mobile major metropolitan regions held a bachelor's degree or better, compared to 24.4 percent in downwardly mobile major metropolitan regions. The major metropolitan average in 2000 was 28.5 percent.\n12. As with major metropolitan zones, we have relatively few zones with which to estimate the Northeast transition matrix (forty-two commuting zones). This may affect the reliability of the estimates. We have done the analysis with county-level data to provide some robustness checking. The qualitative results are similar."}]