[{"section_title": "", "text": "The emerging economies of the BRICs (Brazil, Russia, India, and China) will, it is assumed, lure both home students who go abroad to study when they finish their degrees and some graduates who have settled in the West-because of their dramatic economic growth and expanding higher education systems. The problem is that data seem to show that this is not the case. The brain drain, now euphemistically called the brain exchange, seems to be alive and well. Research by Dongbin Kim, Charles A. S. Bankart, and Laura Isdell (\"International doctorates: Trends analysis on their decision to stay in US,\" Higher Education 62 (August 2011) shows that the large majority of international doctoral recipients from American universities remain in the United States after graduation. Even more surprisingly, the proportion of those choosing to stay in the United States has increased over the past three decades, seemingly regardless of growth and academic expansion. There is strong evidence that we live in a worldwide era of global mobility of highly skilled talent in general and of the academic profession in particular, but this mobility flows largely in one direction-from developing and emerging economies to the wealthier nations, especially to the Englishspeaking countries."}, {"section_title": "2", "text": "Much has been written about the supposedly obsolescence of the term brain drain. Globalization, it is argued, brings in its train a globally mobile and highly educated labor force-creating a kind of brain exchange among countries. But the data reported here show that mobility, while quite sizable, is one-way, mainly from developing and emerging economies to wealthier nations. There is a growing flow of ideas and capital back to countries of origin, but one cannot escape the fact that the major economic and social contribution is made in the country in which an individual is primarily located. The realities of globalization remain highly unequal. While brains may no longer be permanently drained, they are nonetheless siphoned, with the possibility (not that frequently implemented) of returning to their origins."}, {"section_title": "WHO GOES AND WHO STAYS?", "text": "The countries with the most impressive economic and educational expansion seem to be those with the largest \"stay\" rates, according to the National Academy of Science's Survey of Earned Doctorates (SED), which tracks all international doctoral students studying in the United States. For example, during the 1980s, 25.9 percent of Chinese doctoral graduates returned immediately after completing their degrees. In the 2000s, the return percentage had declined to 7.4 percent. India's figures are also quite low-13.1 percent returned in the 1980s and 10.3 percent in the 2000s. Yet, return rates vary considerably, ranging from 84 percent of Thais, 60 percent of Mexicans and Brazilians, and 39.5 percent of Africans. A particular surprise is the European return rate, which has gone from 36.9 to 25.7 percent over 30 years. There are other variables, as well. Women are somewhat more likely to remain in the United States than men. International students who have their bachelor's degree in the United States are also more likely to stay, as are students who come from well-educated families. Field of study also seems to make a difference, with degree holders in agriculture (54.2%), education (48.5%), and social science (44.1%) most likely to return, and those in biology (19.3%), physical science (21.8%), and business (31.9%) less likely. The SED data exhibit some limitations. Students typically complete a questionnaire asking for background information, educational experience, and plans supplied by the National Science Foundation and administered by graduate schools nationwide when they submit their approved doctoral dissertation. Some respondents may not be fully aware of their plans. Furthermore, plans reported in the SED may not work out. Some students may, for example, obtain a postdoc and return home after that for a variety of reasons. Others may, in the current difficult academic job market, unsuccessfully search for a position. Because the SED measures only doctoral completion, it is likely that this group is mainly headed for academic jobs-we know nothing about return rates for MBA holders or those completing bachelor's or master's degrees. Despite limitations, the SED is the most accurate tool available. The study-abroad statistics cited here relate only to the United States, but it is quite likely that the general pattern of mobility is similar for other host countries and, especially, the major English-speaking and large continental European nations. Variations based on immigration policies, local labor markets, the relatively openness of the academic system and economy, language, and other factors will no doubt affect stay rates. The immigration policies of the rich countries also play a central role. Despite America's success in retaining its international doctoral graduates, US immigration policy until quite recently has not been aimed at easing entry to the highly skilled. Even now greater emphasis is placed on uniting families, increasing the diversity of the immigrant population, and other factors. It remains to be seen whether pressure from the high-tech community and others will be adopted to open opportunities to the highly skilled. Other countries, including Canada and Australia, have quite consciously tailored immigration policy to favor highly educated groups and have made it easy for international graduates to remain in the country and build a career. European countries are also moving in this direction."}, {"section_title": "PATTERNS AND POLICIES", "text": ""}, {"section_title": "Some", "text": ""}, {"section_title": "Conclusion", "text": "The statistics reported here may come as a surprise to some observers. These data are likely an inevitable result of globalization and the inequalities in higher education and in wealth and development that persist. It is fair to say that the host countries are unconcerned about these imbalances, and indeed most are moving to strengthen their advantages through adjustments in academic and scholarship policies and immigration regulations. If stay rates are a sign of continuing inequalities in the global knowledge system and in higher education, 6 it will demand achieving a better balance and will require time, resources, and in some cases, changing in academic structures and practices. While there is much rhetoric about globalization creating a \"level playing field,\" the realities show something quite different."}]