[{"section_title": "Background and Objectives", "text": "The National Oceanic and Atmospheric Administration (NOAA) Center for Tsunami Research at NOAA's Pacific Marine Environmental Laboratory (PMEL) has developed a tsunami forecasting system for operational use by NOAA's two Tsunami Warning Centers, located in Hawaii and Alaska (Titov et al., 2005;Titov, 2009). The forecast system combines real-time deep-ocean tsunami measurements from Deep-ocean Assessment and Reporting of Tsunami (DART) buoys (González et al., 2005;Bernard et al., 2006;Bernard and Titov, 2007) with the Method of Splitting Tsunami (MOST) model, a suite of finite difference numerical codes based on nonlinear long-wave approximation (Titov and Synolakis, 1998;Titov and González, 1997;Synolakis et al., 2008) to produce real-time forecasts of tsunami arrival time, heights, periods, and inundation. To achieve an accurate and detailed forecast of tsunami impact for specific sites, highresolution tsunami forecast models are under development for United States coastal communities at risk (Tang et al., 2008b;2009). The resolution of these models has to be high enough to resolve the dynamics of a tsunami inside a particular harbor, including influences of major harbor structures such as breakwaters. These models have been integrated as crucial components into the forecast system. Hilo, Hawaii's history of tsunami inundation (Dudley and Stone, 2000;Pararas-Carayannis, 1969) concentrated population density, year-round tourism, and transportation infrastructure all contribute to making it a crucial forecast model for tsunami inundation (Figure 1). Hilo is often impacted by tsunamis generated in many tectonic regions of the Pacific Ocean Basin. The city downtown was devastated when the 1946 Unimak tsunami generated south of Unimak Island along the Aleutian Trench struck the Hawaiian Islands. It was again badly damaged when, in 1960, a tsunami generated off the coast of Chile traversed the Pacific Ocean. Hilo was chosen as the pilot site for testing of coastal tsunami forecasting beginning in the late 1990s. The 17 November 2003 Rat Island tsunami provided the first real-time test of the Hilo forecast model, along with NOAA's forecast methodology, which became the proof of concept for the development of the tsunami forecast system (Titov et al., 2005). This tsunami was detected by three DART buoys located along the Aleutian Trench. The real-time data were combined with the tsunami source function database to produce a tsunami source of T Mw 7.8 by inversion. The offshore model scenario was used as input for the Hilo forecast model, which was the only forecast model available at that time. The forecasted maximum wave height at Hilo tide station is 0.43 m, while the observation is 0.45 m (-5% error); the error of the arrival time of the maximum wave is less than 1 min. The accuracy of the forecast is reflected by the excellent agreement between the model prediction and observation. It was the first time in history that a forecast of a tsunami time series was available to a coastal city before tsunami waves arrived. Since then, the model was updated with the newest bathymetry and topography data sources and produced accurate real-time forecasting for several past tsunamis (Wei et al., 2008;Titov, 2009). This report describes the development, testing, and application of the Hilo forecast model. The objective in developing this model is to provide NOAA's Tsunami Warning Centers the ability to assess danger posed to Hilo following tsunami generation in the Pacific Ocean Basin with a goal to provide accurate and timely forecasts to enable the community to respond appropriately. A secondary objective is to explore the potential tsunami impact to the city from earthquakes at major subduction zones in the Pacific by using the developed forecast model. The report is organized as follows. Section 2 briefly introduces NOAA's tsunami forecast methodology. Section 3 describes the model development. Section 4 presents the results and discussion, which includes sensitivity of the forecast model to grid coupling schemes, model validation, verification, and testing for past and simulated tsunamis. A tsunami hazard assessment study utilizing the validated forecast model is also included. A summary and conclusion are provided in section 5."}, {"section_title": "Forecast Methodology", "text": "NOAA's real-time tsunami forecasting scheme is a two-step process: (1) construction of a tsunami source via inversion of deep-ocean DART observations with pre-computed tsunami source functions; and (2) coastal predictions by running high-resolution forecast models in real time (Titov et al., 1999;2005;Tang et al., 2009). The DART-constrained tsunami source, the corresponding offshore scenario from the tsunami source function database, and highresolution forecast models cover the entire cycle of earthquake-generated tsunamis, generation, propagation, and coastal inundation, providing a complete tsunami forecast capability."}, {"section_title": "Construction of a tsunami source based on DART observations and tsunami source functions", "text": "Several real-time data sources, including seismic data, coastal tide gauge, and deep-ocean data have been used for tsunami warning and forecast (Satake et al., 2008;Whitmore, 2003;Titov, 2009). NOAA's strategy for the real-time forecasting is to use deep-ocean measurements at DART buoys as the primary data source due to several key features. (1) The buoys provide a direct measure of tsunami waves, unlike seismic data, which is an indirect measure of tsunamis. (2) The deep-ocean tsunami measurements are in general the earliest tsunami information available, since tsunamis propagate much faster in the deep ocean than in shallow coastal areas where coastal tide gauges are used for tsunami measurements. (3) Compared to coastal tide gauges, DART data with a high signal-to-noise ratio can be obtained without interference from harbor and local shelf effects. (4) The linear process of tsunamis in the deep ocean allows for the application of efficient inversion schemes. Time series of tsunami observations in the deep ocean can be decomposed into a linear combination of a set of tsunami source functions in the time domain by a linear least squares method. We call coefficients obtained through this inversion process tsunami source coefficients. The magnitude computed from the sum of the moment of tsunami source functions multiplied by the corresponding coefficients is referred to as the tsunami moment magnitude (T Mw ), to distinguish it from the seismic moment magnitude M w , which is the magnitude of the associated earthquake source. While the seismic and tsunami sources are in general not the same, this approach provides a link between the seismically derived earthquake magnitude and the tsunami observationderived tsunami magnitude. During a real-time tsunami forecast, seismic waves propagate much faster than tsunami waves, so the initial seismic magnitude can be estimated before the DART measurements are available. Since time is of the essence, the initial tsunami forecast is based on the seismic magnitude only. The T Mw will update the forecast when it is available via DART inversion using the tsunami source function database. Titov et al. (1999;2001) conducted sensitivity studies of far-field deep-water tsunamis to different parameters of the elastic deformation model described in Gusiakov (1978) and Okada (1985). The results showed that source magnitude and location essentially define far-field tsunami signals for a wide range of subduction zone earthquakes. Other parameters have secondary influence and can be pre-defined during forecast. Based on these results, tsunami source function databases for the Pacific, Atlantic, and Indian oceans have been built using pre-defined source parameters, length = 100 km, width = 50 km, slip = 1 m, rake = 90 and rigidity = 4.5 × 10 10 N/m 2 . Other parameters are locationspecific; details of the databases are described in Gica et al. (2008). Pacific Ocean unit sources are provided in Appendix B. Each tsunami source function is equivalent to a tsunami from a typical Mw = 7.5 earthquake with defined source parameters. Figure 2 shows the locations of tsunami source functions in the Pacific Ocean. The database can provide offshore forecasts of tsunami amplitudes and all other wave parameters immediately once the inversion is complete. The tsunami source, which combines real-time tsunami measurements with tsunami source functions, provides an accurate offshore tsunami scenario without additional time-consuming model runs."}, {"section_title": "Real-time coastal predictions by high-resolution forecast models", "text": "High-resolution forecast models are designed for the final stage of the evolution of tsunami waves: coastal runup and inundation. Once the DARTconstrained tsunami source is obtained (as a linear combination of tsunami source functions), the pre-computed time series of offshore wave height and depth-averaged velocity from the model propagation scenario are applied as the dynamic boundary conditions for the forecast models. This saves the simulation time of basin-wide tsunami propagation. Tsunami inundation is a highly nonlinear process, therefore a linear combination would not, in general, provide accurate solutions. A high-resolution model is also required to resolve shorter tsunami wavelengths nearshore with accurate bathymetric/topographic data. The forecast models are constructed with the Method of Splitting Tsunami (MOST) model, a finite difference tsunami inundation model based on nonlinear shallow-water wave equations (Titov and González, 1997). Each forecast model contains three telescoping computational grids with increasing resolution, covering regional, intermediate, and nearshore areas. Runup and inundation are computed at the coastline. The highest-resolution grid includes the population center and tide stations for forecast verification. The grids are derived from the best available bathymetric/topographic data at the time of development, and will be updated as new survey data become available. The forecast models are optimized for speed and accuracy. By reducing the computational areas and grid resolutions, each model is optimized to provide 4-hr event forecasting results in minutes of computational time using a single processor, while still providing good accuracy for forecasting. To ensure forecast accuracy at every step of the process, the model outputs are validated with historical tsunami records and compared to numerical results from a reference inundation model with higher resolutions and larger computational domains. In order to provide warning guidance for a long duration during a tsunami event, each forecast model has been tested to output up to a 24-hr simulation after the tsunami generation."}, {"section_title": "Model Development", "text": ""}, {"section_title": "Forecast area and tsunami data", "text": "The main Hawaiian Islands are the youngest and are located at the southern portion of the Hawaii Archipelago. From northeast to southwest, the islands form four natural geographic groups by shared channels and inter-island shelves, including (1) Ni'ihau, Ka'ula Rock, and Kauai (Kauai complex) (2) Oahu, (3) Molokai, Maui, Lanai, and Kaho'olawe (the Maui Complex), and (4) Hawaii. Hilo is located on the east coast of the Big Island of Hawaii. The port of Hilo is one of the two deep draft harbors on the island. Figure 3 shows an aerial photo of Hilo with a breakwater in Hilo Bay. The city is the second most populous of all Hawaiian Island cities and the most densely populated on the island of Hawaii itself, as shown in Figure 4. A National Ocean Service (NOS) tide station in Hilo Harbor was established in November 1946. The present installation was in February 1989 (http://tidesandcurrents.noaa.gov/). The water level sensor is located in the vicinity of Pier 2. At the sensor, the mean tidal range (MN) is 0.508 m. Mean high water level (MHW) is 1.795 m, and mean sea level (MSL) is 1.545 m. Mean high water is used as the reference level for the forecast model to provide a worst case for inundation forecast. Hilo has a long history of being impacted by destructive tsunamis (Pararas-Carayannis, 1969;NGDC, 2009). The earliest record of a destructive tsunami at Hilo occurred on 7 November 1837, which was generated by a magnitude 8.5 earthquake in South Chile (NGDC). In Hilo, \"Lowlands were submerged, houses were swept away, and 14 people were killed\" (Pararas-Carayannis, 1969). The first wave of 6.1 m above high-water mark was observed in Hilo Bay. On 13 August 1868, a tsunami generated by a magnitude 8.5 earthquake in North Chile caused severe damage in Hilo. The watermark left on a coconut tree near the railway station measured 4.6 m above the ordinary low water and 1.4 m above ground. On 10 May 1877, a magnitude 8.3 earthquake in North Chile generated a tsunami that caused severe damage in Hilo. The tsunami water height was reported to be 3.7 m above the low watermark. Every house within 92 m of the beach at Waiakea was swept away. The total extent of human and property impact to the Hilo area included 5 dead, 17 badly injured, and 37 houses destroyed. Total damage was estimated at $12,000 to $14,000 (Pararas-Carayannis, 1969). On 31 January 1906, a tsunami generated by a magnitude 8.8 earthquake off the coast of Ecuador flooded the wharf and a tsunami wave of 3.6 m above normal was visually observed. The 3 February 1923 Kamchatka tsunami generated by a magnitude 8.3 earthquake was reported as having water as high as 6.1 m above mean low sea level at the mouth of Wailoa River. The bridge was destroyed, houses and wharves were badly damaged, and one man was killed. The tsunami on 1 April 1946 was considered the most destructive tsunami that ever hit the Hawaiian Islands in terms of loss of life and property (Pararas-Carayannis, 1969). It was generated by an earthquake of magnitude 8.5 in the Aleutian Islands. The tsunami claimed the lives of 159 people in the State of Hawaii (122 from the Big Island) and caused $26 million in damage (Figure 1ae). In Hilo, 488 buildings were demolished and 936 were damaged. The Hilo tide gauge was destroyed. Pier 1 was washed by the third wave, which was the highest (Pararas-Carayannis, 1969). This earthquake prompted the establishment of NOAA's first Tsunami Warning Center in Ewa Beach on the southern shore of Oahu. On 4 November 1952, a tsunami originating in Kamchatka caused moderate property damage of about $0.4 million in Hilo. All damage at Hilo was the result of gentle flooding. A 0.45-m bore was reported in Wailoa estuary only. On 9 March 1957, an Aleutian tsunami caused an estimated $300,000 damage in Hilo and total damage of $5 million for the Hawaiian Islands. Buildings along the Hilo waterfront were badly damaged. The 23 May 1960 Chile tsunami caused heavy damage in Hilo. Sixty-one people were killed, 282 injured, and 537 buildings were destroyed (Figure 1f). A total damage of $23 million was estimated. The highest wave was seen as a wall of water about 6.1-m high moving toward the city, with a roar that was heard offshore. This wave knocked out the power lines and inundated 600 acres in the harbor area. Rocks weighing as much as 22 tons were washed 182 m inland from the seawall. The period of waves after the third became shorter. The tsunami continued across the Pacific and struck Japan 7 hr later, killing 142 people. The latest destructive tsunami was generated by the Great Alaska Earthquake of 27 March 1964, which caused $15,000 damage in Hilo. As a population center that has been repeatedly damaged by Pacific tsunamis, Hilo is in need of a forecast model to aid site-specific evacuation decisions. Tsunami water level data are available for 14 of the 16 tsunamis (Table 1) in this study, while the tide station was either damaged or not functional during the 1946, 1957, and 1960 tsunamis. The recorded maximum wave height is 3.84 m during the 1964 Alaska tsunami. The maximum recorded runup heights at Hilo are 9.1, 3.9, 10.6, and 3.0 m for the 1946, 1957, 1960, and 1964tsunamis, respectively (Pararas-Carayannis, 1969. Inundation data are available for the 1946, 1957, and 1960tsunamis in the area (Shepard et al., 1950Fraser et al., 1959)."}, {"section_title": "Bathymetry and topography", "text": "Tsunami inundation modeling requires accurate bathymetry in the coastal area as well as high-resolution topography and bathymetry in the nearshore area. Digital elevation models (DEMs) were developed at a medium resolution of 6 arc sec (180 m) covering all of the major Hawaiian Islands (Figure 5), and a high resolution of 1/3 arc sec (10 m) covering the east Hawaii area around Hilo (Figure 6). Both grids include topographic and bathymetric elevations. The The tsunami source was obtained during real time and applied to the forecast. source grids were compiled from several data sources. Figures 5 and 6 show the spatial extent of each data source used. Raw data sources were imported to ESRI ArcGIS-compatible file formats. Data values were converted, where necessary, to the WGS84 horizontal geodetic datum. In the point datasets, single sounding points that differed substantially from neighboring data were removed. Gridded datasets were checked for extreme values by examination of contour lines and, where available, by comparison between multiple data sources. All selected input datasets were converted to the mean high water (MHW) vertical datum, when necessary, using offsets on the National Ocean Service tidal benchmark datasheet for the Hilo tide station."}, {"section_title": "Preliminary source", "text": ""}, {"section_title": "Grid setups", "text": "Tang et al. (2009) show forecast model setup for several sites in Hawaii. Each forecast model contains three levels of telescoping computational grids with increasing resolution: 1. One regional grid of 2-arc-min (∼3600 m) resolution covers the main Hawaiian Islands (A grid)."}, {"section_title": "Then the Hawaiian Islands are divided into four intermediate grids of 12", "text": "to 18 arc sec (∼360-540 m) for the four natural geographic areas (B grid). 3. Each intermediate grid contains 2-arc-sec (∼60 m) nearshore grids (C grid). By sub-sampling from the DEMs described in section 3.2, two sets of computational grids were derived for Hilo, a reference model ( Figure 7) and a forecast model (Figure 8). The regional grids cover the major Hawaiian Islands and the intermediate grids cover the Islands of Hawaii, Maui, Lanai, and east Molokai. Runup and inundation simulations are computed at the coastline in the nearshore grids. Grid details at each level and input parameters are summarized in Table 2. The input file parameters for running the forecast and reference models are presented in Appendix A. "}, {"section_title": "Results and Discussion", "text": ""}, {"section_title": "Sensitivity of modeled time series by the Hilo forecast model to grid coupling schemes", "text": "MOST version 1.0 employs a two-way coupling scheme. The coupling is achieved at each time step by interpolation of the low-resolution field from the coarse to the fine resolution level, and vice versa. This two-way coupling scheme has relatively rigorous requirements on bathymetric consistency as well as on time steps between adjacent grids. Time steps used for the three telescoping grids need to be carefully tested in order to provide stable model runs of long duration. To overcome these difficulties, a one-way coupling scheme was employed in MOST version 2.0, e.g., no interpolation of the fine-resolution field to the coarser resolution level, for forecast purposes. This one-way coupling scheme is robust and can handle bathymetric grids from varieties of data sources with any time steps that satisfy CFL conditions. MOST version 2.0 passed the benchmark tests and in general provided good comparisons with model results from version 1.0. There are some exceptions for Hilo. Figure 9 compares the modeled tsunami time series by MOST one-and two-way coupling schemes for 16 past tsunamis. So far, we have seen that one-way coupling overestimates amplitude of the 3rd trough and the 4th peak at Hilo tide station for five events, the 2010 Chile, 2007and 2006Kuril Islands, 2003Rat Island, and 1996 Andreanov tsunamis (Figures 9.1, 9.4, 9.5, 9.7, and 9.10). The reason is still under investigation. We recommend double checking results for the Hilo forecast model by using the two-way coupling scheme. In the next section, we discuss the results computed by the forecast model using the two-way coupling scheme."}, {"section_title": "Validation, verification, and testing of the forecast model", "text": ""}, {"section_title": "Validation", "text": "Both the reference model and the forecast model for Hilo were tested with the 16 past tsunamis summarized in Table 1. Tide gauge data of the recent tsunamis, Nos. 1 to 11, were from the NOAA National Water Level Observation Network (NWLON) (Allen et al., 2008), while others were digitized from Shepard et al. (1950), Zerbe (1953), Salsman (1959, Berkman and Symons (1964), and Spaeth and Berkman (1967). The observations were filtered by a low-pass Butterworth filter to remove tidal components with periods longer than a cutoff period, such as 1 or 2 hr. Figure 10 shows observed and modeled tsunami time series at Hilo tide station. The most recent tested event is the 27 February 2010 Chile tsunami. The Chile tsunami was generated by a Mw 8.8 earthquake NNE of Concepcion, Chile. In approximately 3 hours, the tsunami was recorded at DART station 32412. The real-time data was combined with the propagation database to produce a tsunami source. Figure 10.1 shows the comparison of observations and model time series. The observed maximum wave height is 1.71 m, while the model shows 2.24 m with the two-way coupling scheme. The 0.53-m error in the maximum wave height is the largest error the forecast model has produced among the tested past tsunamis. The model time series were shifted 9 min late in the plot. The 29 September 2009 Samoa tsunami was generated by a Mw 8.1 earthquake which occurred near the northern end of the Tonga Trench. Data recorded at DART stations 51425 and 51426 were inverted to produce a tsunami source in real time. Figure 10.2 shows good agreements between the model results and observations at Hilo. A detailed description of the real-time experimental forecast for the 15 August Peru tsunami can be found in Wei et al. (2008). At Hilo tide station, the observed maximum wave height is 67 cm, while the forecast is 65 cm. The forecast showed an arrival around 12 min earlier. After this 12-min time difference was adjusted in Figure 10.3, the forecast and observation matched well in period. The 13 January 2007 Kuril Islands earthquake occurred as normal faulting (USGS, 2007). The T Mw 7.9 source was inverted from tsunami data recorded at three DARTs, 21414, 46413, and 21413, by a linear least squares fit to negative tsunami source functions near the epicenter. The maximum wave height was overestimated ( Figure 10.4). The Kuril Islands tsunami of 15 November 2006 provided ample tsunami data and the first test of NOAA's new experimental tsunami forecast system. The tsunami source was inverted with tsunami data recorded at several DART buoys along the Aleutian Trench. The modeled first waves agree well with the observations (Figure 10.5). The 3 May 2006 Tonga earthquake generated a tsunami that was detected about 6 hr later by two offshore DARTs located to the south of the Hawaiian Islands. These data were combined with the TSF database to produce the tsunami source by inversion (Tang et al., 2008a). Excellent agreement is obtained for the first six waves over 2 hr, including the amplitudes, arrival time, and wave period (Figure 10.6). The forecast model reproduced the maximum waves that arrived 1.5 hr after the first arrival. Those are the 4th waves at Hilo. As shown in Tang et al. (2008a), the Hilo forecast model also modeled well the large amplitude later waves reflected from North America and scattered by South Pacific bottom features that reached the Hawaiian Islands 16 hr and 18.5 hr, respectively, after the earthquake. The 17 November 2003 Rat Island tsunami provided the first real-time test of NOAA's forecast methodology, which became the proof of concept for the development of the tsunami forecast system (Titov et al., 2005). This tsunami was detected by three DARTs located along the Aleutian Trench. The real-time data was combined with the TSF database to produce a tsunami source of T Mw 7.8 by inversion. The offshore model scenario was then used as input to the earlier version of the Hilo forecast model, which was the only forecast model available at that time. The model runtime is about 10 min by using a single processor on a Dell PowerEdge 2650 with 2 Intel Xeon CPUs of 2.8 GHz, each with 512 KB cache and 4 GB memory. The accuracy of the forecast is reflected by the excellent agreement between the model prediction and observation at Hilo tide station (Figure 10.7). This event was the first time in history that the forecast of tsunami time series was available to a coastal city before tsunami waves arrived. The offshore forecasts of the maximum tsunami amplitude and arrival time are in Figure 2. The 25 September 2003 Hokkaido earthquake generated tsunami waves of very long periods recorded at the tide station. The wave amplitude decreased slowly and steadily (Figure 10.8). DART station 51406, located midway between South America and Hawaii, was not deployed until 1 mon after the 23 June 2001 Peru tsunami. Therefore, the source for this event was derived based on an inversion of Kahului tide gauge records using the Kahului forecast model. It produced good comparisons of first waves at the other three stations (Figure 10.9). Deep-ocean research bottom-pressure recorder data are also available for two other early tsunamis. The inversion of the 1994 Kuril Islands tsunami data was done by using five BPR recordings, while the 1996 Andreanov used one (Titov et al., 2005). Model results agree quite well with observations for the first several waves (Figures 10.10 and 10.11). Only 6-min data are available at Hilo tide station. The 6-min resolution was unable to fully resolve the tsunami waves so the wave height at Hilo was under-recorded ( Figure 10.11). DART buoy records are not available for five destructive tsunamis, the 1964 Alaska, 1960Chile, 1957Andreanov, 1952Kamchatka, and 1946 Unimak events. Previous studies of seismic, geodetic, and water-level data have estimated source parameters for some of the events (Kanamori and Ciper, 1974;Johnson et al., 1994;1996;Johnson and Satake, 1999;López and Okal, 2006). However, some of the sources are subject to debate and adjustment. Most of the source estimates that have been done are based on low-resolution tsunami propagation models. The forecast system provides a unique chance to reinvestigate the historical sources by inversion of the water level data with the high-resolution-quality inundation and propagation models. Preliminary results are available for the 1964, 1957, 1952, and 1946 tsunamis. The incomplete tide gauge records in Hawaii and the distance from the source to the developed forecast models in the U.S. present a substantial challenge to the reinvestigation of the 1960 Chile tsunami. So the source parameters of the tsunami are taken from Kanamori and Ciper (1974) Figure 11a shows the error of the maximum wave height computed by the Hilo forecast model for the past tsunamis that have complete wave-height records. When the observed maximum wave height is less than 0.5 m, the maximum computed error is less than 0.3 m. At small amplitudes, noise in the observed signals and numerical error in the model are large compared to the observations. When the maximum wave height is greater than 0.5 m, the error is within ±35%; this uncertainty can be attributed primarily to uncertainties in the tsunami source, model setup, and bathymetry. Arrival time of the first wave peak in general agrees well with the observations, with errors less than ±3% of the travel time. So far, the largest discrepancy between the modeled and observed first arrival time is the 12 min for the 2007 Peru tsunami. However, with an earthquake epicenter 460 km to the northwest of the 2007 Peru earthquake, the 2001 Peru tsunami has only a 3-min discrepancy in arrival time. This 12min arrival discrepancy is currently under investigation. Tsunami waves are known to produce time series with complex frequency structure that varies in space and time. To explore the tsunami frequency responses at different forecast sites, a complex Morlet wavelet transform was applied to both observations and model results. A description of the time series of wavelet-derived amplitude spectra can be found in Tang et al. (2008a). As an example, Figure 12 shows the real parts of the wavelet-derived amplitude spectra for the observation and forecast at Hilo for the November 2006 Kuril Islands tsunami. The modulated spectrogram shows the first incident wave has a peak period near 20 min (Figure 12b). The tsunami quickly excited two major oscillations with near 15-and 32-min periods in Hilo Harbor. Those changes of frequency structure were correctly captured by the forecast time series computed by the Hilo forecast model (Figure 12c). The same approach was applied to the tsunami time series in Figure 10. Figure 11b compares the observed and modeled peak wave periods. At Hilo, the observed peak wave periods fall into one of the three groups near 15-, 22-, or 32-min periods (±2 min) (Figure 11b). The Hilo forecast model produced the peak wave periods reasonably well, especially in the highest frequency group (15-min period). "}, {"section_title": "Verification", "text": "The computed maximum water elevation above MHW and maximum current of the 16 tsunamis are plotted in Figure 14. Both the reference and forecast models produced similar patterns and values. The 1946 Unimak tsunami caused the most severe impact on Hilo. In general, the tsunami wave amplitude increases dramatically due to shoaling when the tsunami waves enter a nearshore area shallower than 20 m and even more so because of local shelf and harbor resonances and other coastal effects. This emphasizes the importance of using high-resolution inundation models, which resolve the local coast and harbor geometries, in order to achieve accurate tsunami amplitude forecasts for coastal communities."}, {"section_title": "Robustness and stability tests", "text": "Recorded historical tsunamis provide only a limited number of events, from limited locations. More comprehensive test cases of destructive tsunamis with different directionalities are needed to check the stability and robustness for SIMs. The same set of 18 simulated T Mw 9.3 tsunamis as in Tang et al. (2008b) was selected here for further examination. Results computed by the forecast model are compared with those from the high-resolution reference model in Figures 15 and 16. Both models were numerically stable for all of the scenarios. Waveforms computed by the forecast model agree well with those from the reference model (Figure 15). Both models compute similar maximum water elevation and inundation in the study area (Figure 16). These results indicate the Hilo forecast model is capable of providing robust and stable predictions of long duration for Pacific-wide tsunamis. Tsunami waves in the study area vary significantly for the 18 magnitude 9.3 scenarios. These results show the complexity and high nonlinearity of tsunami waves nearshore, which again demonstrate the value of the forecast model for providing accurate site-specific forecast details. The No. 3 scenario in the middle of the Aleutian subduction zone generates severe inundation at Hilo. The computed maximum water elevation reaches 7 m at the tide station."}, {"section_title": "Tsunami hazard assessment for Hilo from simulated magnitude 7.5, 8.2, 8.7, and 9.3 tsunamis", "text": "A tsunami hazard assessment for a model site can provide forecast guidance by determining in advance which subduction zone regions and tsunami magnitudes pose the greatest threat to the location. The validated forecast models, in combination with the forecast tsunami source function database, provide powerful tools to address this long-term forecast. Here, we apply our forecast modeling tools, including the previously described Hilo forecast model, to produce long-term forecast assessment for Hilo. Four different magnitudes, T Mw 7.5, 8.2, 8.7, and 9.3, as in Tang et al. (2008b;2009), were tested. The details of the simulated tsunami sources and results are summarized in Figure 17. The maximum water elevation, η max , at Hilo tide station from T Mw 7.5 tsunamis computed by the Hilo forecast model, is plotted in bars in Figure 17b. Color represents the first arrival at the station, which is the time when the water level reaches 20% of the height of the first significant peak or trough. Bars in Figure 17a indicate the maximum elevation at deep water offshore Hilo from the same sources, which are from the TSF database. Figures 17c, d, and e show at Hilo tide station from T Mw 8.2, 8.7, and 9.3 tsunamis, respectively. The color represents the difference in time between the arrival of the maximum elevation, t max , and first arrival, t 1 . These results show an impressive local variability of tsunami amplitudes even for far-field tsunamis, which illustrate the complexity of forecasting tsunami amplitudes at coastal locations. Tang et al. (2009) have shown that the location of the most \"effective\" source for a given location also differs from site to site. To further investigate the transformations of tsunami amplitudes from offshore to the tide gauges, we have looked at the ratios of these amplitudes. The ratio of the offshore and nearshore η max for all computed scenarios are plotted and the linear regression analyses were performed in Figure 18. To better illustrate the data trends, both the logarithmic and Cartesian coordinates were plotted with the same datasets. The logarithmic scales give a full picture of the wide range of values, while the Cartesian coordinates better illustrate the actual spread and trends of the data. In Figure 18b, the red dots, which represent the T Mw 7.5 tsunamis, are hardly seen due to the overlapping dots representing other magnitude scenarios. The solid black lines are the best fit to the data. The dashed black lines are the prediction bounds based on a 95% confidence level. The results show: 1. The relationship between tide-gauge maximum amplitude and offshore maximum amplitude appears to be complex and nonlinear in nature. 2. Larger amplitudes offshore do not necessarily produce larger amplitudes at tide gauges, and larger tsunami magnitudes may not produce larger waves either offshore, or at tide-gauges. 3. The simple relationships obtained through regression analysis ( Figure  18a) are insufficient to provide warning guidance during an event. The 95% confidence interval is too wide to provide any certainty for the forecast accuracy. Tang et al. (2009) also show that the trends of offshore/tide gauge amplitudes are site-specific. Different sites show different regression analysis curves. These results indicate that high-resolution tsunami models are essential for providing useful accuracy for coastal amplitude forecast. If the high-resolution tsunami near-shore dynamics is not included in the forecast procedures, the accuracy and the uncertainty of the amplitude forecast appear to be too high for practical guidance."}, {"section_title": "Summary and Conclusions", "text": "This study describes the development, testing, and application of a site-specific tsunami inundation model for Hilo for use in NOAA's tsunami forecast and warning system. The final forecast model grid resolution was 2 arc sec (∼60 m) to enable a 4-hr inundation simulation within 10-min of computational time. A higher-resolution reference inundation model of 1/3 arc sec (∼10 m) was also developed in parallel to provide modeling references for the forecast model. Both models were tested for 16 past tsunamis and a set of 18 simulated magnitude 9.3 tsunamis. The error of the maximum wave height computed by the forecast model is within 35% when the observation is greater than 0.5 m; when the observation is below 0.5 m the error is less than 0.3 m. The error of the modeled arrival time of the first peak is within 3% of the travel time. Wavelet analysis of the tsunami time series indicates that the peak wave period often coincides with one of the resonant periods of the harbor where the tide gauge is located. This peak period may partially depend on the geographic location of the tsunami source. The developed forecast models were further applied to hazard assessment from 1435 scenarios of simulated magnitude 7.5, 8.2, 8.7, and 9.3 tsunamis based on subduction zone earthquakes in the Pacific. The results demonstrate the nonlinearity between offshore and nearshore maximum wave amplitudes. The study indicates that use of a seismic magnitude alone for a tsunami source assessment is inadequate to achieve such accuracy for tsunami amplitude forecasts. The forecast models apply local bathymetric and topographic information, and utilize dynamic boundary conditions from the tsunami source function database, to provide site-and event-specific coastal predictions."}, {"section_title": "Acknowledgments", "text": "The authors thank Harold Loomis and Michael Spillane for their reviews and valuable suggestions; Jean Newman for assistance; Eddie N. Bernard, Marie C. Eble, and Robert Weiss for comments and discussion; Nazila Merati and Ryan Layne Whitney for editing; Burak Uslu for providing propagation database tables and graphics. Collaborative contributions of the National Weather Service, the National Geophysical Data Center, and the National Data Buoy Center were invaluable. Funding for this publication and all work leading to development of a tsunami forecast model for Hilo, Hawaii was provided by the National Oceanic and Atmospheric Administration. This publication was partially funded by the Joint Institute for the Study of the Atmosphere and Ocean (JISAO) under NOAA Cooperative Agreement No. NA17RJ1232, JISAO Contribution No. 1766. This is PMEL Contribution No. 3340."}, {"section_title": "References", "text": "Allen  I. González (2006): Tsunami: Scientific frontiers, mitigation, forecasting, and policy implications. Proc. Roy. Soc. Lond. A, 364(1845), 1989-2007, doi: 10.1098/rsta.2006.1809. Bernard, E.N., and V.V. Titov (2007: Improving tsunami forecast skill using deep ocean observations. Mar. Technol. Soc. J.,40 4 Johnson, J. M., and K. Satake (1999): Asperity distribution of the 1952 Great Kamchatka earthquake and its relation to future earthquake potential in Kamchatka. Pure Appl. Geophys.,, 541-553. Johnson, J.M., K. Satake, S. R. Holdahl, and J. Sauber (1996): The 1964 Prince William earthqake: Joint inversion of tsunami and geodetic data. J. Geophys. Res.,101(B1), 523-532. Johnson, J.M., Y. Tanioka, L.J. Ruff, K. Satake, H. Kanamori, and L. R. Sykes (1994): The 1957 Great Aleutian Earthquake. Pure Appl. Geophys.,142(1), 3-28. Kanamori, H., and J. J. Ciper (1974): Focal process of the great Chilean earthquake, May 22, 1960. Phys. Earth Planet. In., 9, 128-136. López, A.M., and E.A. Okal (2006): A seismological reassessment of the source of the 1946 Aleutian \"tsunami\" earthquake. Geophys. J. Int.,165(3)                                 Input \"dry land\" depth for inundation (m) 0.000625 Input friction coefficient (n**2) 1 runup flag for grids A and B (1 = yes, 0 = no) 300.0 blowup limit 1.0 Input time step (sec) 36000 Input amount of steps 8 Compute \"A\" arrays every n-th time step, n= 2 Compute \"B\" arrays every n-th time step, n= 32 Input number of steps between snapshots                                Figure B8: New Britain-Solomons-Vanuatu Zone unit sources.   Figure B9: Ryukyu-Kyushu-Nankai Zone unit sources. "}, {"section_title": "Glossary", "text": "Arrival Time The time when the first tsunami wave is observed at a particular location, typically given in local and/or universal time but also commonly noted in minutes or hours relative to time of earthquake. Bathymetry The measurement of water depth of an undisturbed body of water. Cascadia Subduction Zone Fault that extends from Cape Mendocino in Northern California northward to mid-Vancouver Island Canada. The fault marks the convergence boundary where the Juan de Fuca tectonic plate is being subducted under the margin of the North America plate."}, {"section_title": "Current Speed", "text": "The scalar rate of water motion measured as distance/time. Epicenter The point on the surface of the earth that is directly above the focus of an earthquake."}, {"section_title": "Current Velocity", "text": "Far-field Region outside of the source of a tsunami where no direct observations of the tsunami-generating event are evident, except for the tsunami waves themselves. Focus The point beneath the surface of the earth where a rupture or energy release occurs due to a build up of stress or the movement of earth's tectonic plates relative to one another. Inundation The horizontal inland extent of land that a tsunami penetrates, generally measured perpendicularly to a shoreline. Marigram Tide gauge recording of wave level as a function of time at a particular location. The instrument used for recording is termed marigraph."}, {"section_title": "Moment Magnitude (MW)", "text": "The magnitude of an earthquake on a logarithmic scale in terms of the energy released. Moment magnitude is based on the size and characteristics of a fault rupture as determined from long-period seismic waves."}, {"section_title": "Method of Splitting Tsunamis (MOST)", "text": "A suite of numerical simulation codes used to provide estimates of the three processes of tsunami evolution: tsunami generation, propagation, and inundation. Near-field Region of primary tsunami impact near the source of the tsunami. The near-field is defined as the region where non-tsunami effects of the tsunami-generating event have been observed, such as earth shaking from the earthquake, visible or measured ground deformation, or other direct (nontsunami) evidences of the source of the tsunami wave. Propagation database A basin-wide database of pre-computed water elevations and flow velocities at uniformly spaced grid points throughout the world Oceans. Values are computed from tsunamis generated by earthquakes with a fault rupture at any one of discrete 100 × 50 km unit sources along worldwide subduction zones. Runup or Run-up Vertical difference between the elevation of tsunami inundation and the sea level at the time of a tsunami. Runup is the elevation of the highest point of land inundated by a tsunami as measured relative to a stated datum, such as mean sea level. Short-term Inundation Forecasting for Tsunamis (SIFT) A tsunami forecast system that integrates tsunami observations in the deep-ocean with numerical models to provide an estimate of tsunami wave arrival, amplitude, at specific coastal locations while a tsunami propagates across an ocean basin. Subduction zone A submarine region of the earth's crust at which two or more tectonic plates converge to cause one plate to sink under another, overriding plate. Subduction zones are regions of high seismic activity. Synthetic event Hypothetical events based on computer simulations or theory of possible or even likely future scenarios. Tidal wave Term frequently used incorrectly as a synonym for tsunami. A tsunami is unrelated to the predictable periodic rise and fall of sea level due to the gravitational attractions of the moon and sun: the tide. Tide The predictable rise and fall of a body of water (ocean, sea, bay, etc.) due to the gravitational attractions of the moon and sun. Tide Gauge An instrument for measuring the rise and fall of a column of water over time at a particular location. Tele-tsunami or distant tsunami Most commonly, a tsunami originating from a source greater than 1000 km away from a particular location. In some contexts, a tele-tsunami is one that propagates through deep-ocean before reaching a particular location without regard to distance separation. Travel time The time it takes for a tsunami to travel from the generating source to a particular location. Tsunameter An oceanographic instrument used to detect and measure tsunamis in the deep-ocean. Tsunami measurements are typically transmitted acoustically to a surface buoy that in turn relays them in real-time to ground stations via satellite. Tsunami A Japanese term that literally translates to \"harbor wave.\" Tsunamis are a series of long period shallow water waves that are generated by the sudden displacement of water due to subsea disturbances such as earthquakes, submarine landslides, or volcanic eruptions. Less commonly, meteoric impact to the ocean or meteorological forcing can generate a tsunami. Tsunami Hazard Assessment A systematic investigation of seismically active regions of the world oceans to determine their potential tsunami impact at a particular location. Numerical models are typically used to characterize tsunami generation, propagation, and inundation and to quantify the risk posed a particular community from tsunamis generated in each source region investigated. Tsunami Magnitude A number that characterizes the strength of a tsunami based on the tsunami wave amplitudes. Several different tsunami magnitude determination methods have been proposed."}, {"section_title": "Tsunami Propagation", "text": "The directional movement of a tsunami wave outward from the source of generation. The speed at which a tsunami propagates depends on the depth of the water column in which the wave is traveling. Tsunamis travel at a speed of 700 km/hr (450 mi/hr) over the average depth of 4000 m in the open deep Pacific Ocean. Tsunami Source Abrupt deformation of the ocean surface that generates series of long gravity waves propagating outward from the source area. The deformation is typically produced by underwater earthquakes, landslide, volcano eruptions or other catastrophic geophysical processes. Wave amplitude The maximum vertical rise or drop of a column of water as measured from wave crest (peak) or trough to a defined mean water level state. Wave crest or peak The highest part of a wave or maximum rise above a defined mean water level state, such as mean lower low water."}, {"section_title": "Wave height", "text": "The vertical difference between the highest part of a specific wave (crest) and it's corresponding lowest point (trough). Wavelength The horizontal distance between two successive wave crests or troughs. Wave period The length of time between the passage of two successive wave crests or troughs as measured at a fixed location. Wave trough The lowest part of a wave or the maximum drop below a defined mean water level state, such as mean lower low water. "}]