[{"section_title": "Abstract", "text": "Abstract-Gaussian smoothing of images prior to applying voxel-based statistics is an important step in voxel-based analysis and statistical parametric mapping (VBA-SPM) and is used to account for registration errors, to Gaussianize the data and to integrate imaging signals from a region around each voxel. However, it has also become a limitation of VBA-SPM based methods, since it is often chosen empirically and lacks spatial adaptivity to the shape and spatial extent of the region of interest, such as a region of atrophy or functional activity. In this paper, we propose a new framework, named optimally-discriminative voxel-based analysis (ODVBA), for determining the optimal spatially adaptive smoothing of images, followed by applying voxel-based group analysis. In ODVBA, nonnegative discriminative projection is applied regionally to get the direction that best discriminates between two groups, e.g., patients and controls; this direction is equivalent to local filtering by an optimal kernel whose coefficients define the optimally discriminative direction. By considering all the neighborhoods that contain a given voxel, we then compose this information to produce the statistic for each voxel. Finally, permutation tests are used to obtain a statistical parametric map of group differences. ODVBA has been evaluated using simulated data in which the ground truth is known and with data from an Alzheimer's disease (AD) study. The experimental results have shown that the proposed ODVBA can precisely describe the shape and location of structural abnormality.\nIndex Terms-Alzheimer's disease, Alzheimer's disease neuroimaging initiative (ADNI), Gaussian smoothing, nonnegative discriminative projection (NDP), optimally-discriminative voxel-based analysis, statistical parametric mapping, voxel-based morphometry."}, {"section_title": "", "text": "spatial detail, without the need to define a priori regions of interest (ROIs). As a result, numerous studies [7] , [11] , [23] , [33] , [48] , [49] , [50] during the past decade have better investigated brain structure and function in normal and diseased populations and have enabled the quantification of spatio-temporal imaging patterns.\nA fundamentally important aspect of VBA-SPM has been the spatial smoothing of images prior to analysis. Typically, Gaussian blurring of full-width half-max (FWHM) in the range of 8-16 mm is used to account for registration errors, to Gaussianize the data and to integrate imaging signals from a region, rather than from a single voxel. The effect of this smoothing function is critical: if the kernel is too small for the task, statistical power will be lost and large numbers of false negatives will result in missing many regions that might present group differences in structure and function; if the kernel is too large, statistical power can also be lost by blurring image measurements from regions that display group differences with measurements from regions that have no group difference. In the latter case, spatial localization is also seriously compromised, as significant smoothing blurs the measurements out and often leads to false conclusions about the origin of a functional activation or of brain atrophy. Moreover, a filter that is too large, or that is not matched with the underlying group difference, will also have reduced sensitivity in detecting group differences. As a result, Gaussian smoothing is often chosen empirically, or in an ad hoc fashion, an obvious limitation of such VBA-SPM analyses, in part because of its heuristic nature and in part because it can lead to overfitting of the data without proper cross-validation or correction for multiple comparisons.\nHowever, the most profound limitation of Gaussian smoothing of images prior to applying the general linear model (GLM) [18] is its lack of spatial adaptivity to the shape and spatial extent of a structural or functional region of interest. For example, if atrophy or functional activation in the hippocampus is to be detected, Gaussian smoothing will blur volumetric or activation measurements from the hippocampus with such measurements from surrounding tissues, including the ventricles, the fusiform gyrus, the amygdala, and the white matter. Previous work in the literature [13] has shown that spatially adaptive filtering of image data can dramatically improve statistical power to detect group differences. However, little is known about how to optimally define the shape and extent of the smoothing filter, so as to maximize the ability of VBA-SPM to detect group effects.\nIn this paper, we present a mathematically rigorous framework for determining the optimal spatial smoothing of structural (and potentially functional) images, prior to applying voxelbased group analysis. We consider this problem in the context 0278-0062/$26.00 © 2011 IEEE of determining group differences and we therefore restrict our experiments to voxel-wise statistical hypothesis testing. However, the mathematical formalism and algorithm are generally applicable to any type of VBA. In order to determine the optimal smoothing kernel, a regional discriminative analysis, restricted by appropriate nonnegativity constraints, is applied to a spatial neighborhood around each voxel, aiming to find the direction (in a space of dimensionality equal to the size of the neighborhood) that best highlights the difference between two groups in that neighborhood. Since each voxel belongs to a large number of such neighborhoods, each centered on one of its neighboring voxels, the group difference at each voxel is determined by a composition of all these optimal smoothing directions. Permutation tests are used to obtain the statistical significance of the resulting optimally-discriminative voxel-based analysis (ODVBA) maps.\nThis approach is akin to some fundamental principles of signal and image processing and more specifically to the matched filtering, which states that optimal detection of a signal in the presence of noise is achieved by filtering whose kernel is related to the signal itself. In the context of voxel-based statistical analysis, the \"signal\" is not known, as it relates to the underlying (unknown) group difference. Therefore, the purpose of our optimization is to actually find the kernel that maximizes the signal detection.\nODVBA has some similarities with the searchlight approach [29] , [30] , however it is significantly different. The searchlight method is basically a local multivariate analysis constrained to the immediate neighborhood of a voxel, whereas ODVBA performs a high-dimensional discriminative analysis using machine learning technique over large neighborhoods, which captures anatomical and functional patterns of larger range, thereby determining the optimally discriminative spatially varying filter. ODVBA also relates to the extensive literature using linear discriminant analysis (LDA) on multivariate patterns of whole brain images. However, implementing the standard LDA directly on the images usually suffers from the singularity problem [14] because the number of images is much smaller than the number of brain voxels. To overcome the problem, Kustra and Strother [31] used the smoothness-constrained, penalized LDA as a tool not only for a strict classification task of positron emission tomography (PEI) images, but also for extracting the activation patterns. Thomaz et al. [45] , [46] presented a PCA plus Maximum uncertainty LDA that solves the small sample size problem for classification and visual analysis of structural MRIs. Carlson et al. [6] used PCA plus LDA to classify brain activities of different stimulus categories [20] , [40] and to find which voxels contribute to the activity. Unfortunately, although the singularity problem has been addressed in the above LDA-based methods, a great deal of important information in the images would be lost, since they employ the smoothness constraint or PCA to reduce the dimensionality prior to implementing LDA. However, ODVBA does not have the singularity problem since it never involves the matrix inverse computation and the discriminative analysis is conducted on the data set constructed according to the local neighborhood so it avoids the curse of dimensionality naturally. More importantly, all these three methods attempt to obtain discriminants or a \"canonical image,\" which is a spatial distribution of voxels that maximally differentiates between different experimental conditions, for interpretation of abnormality or activation in the groups. However, the resulting discriminants are then usually analyzed based on visual inspection or simply thresholding without determining a voxel-wise statistical value; therefore, they do not produce the values for each voxel in the style of traditional SPM, whereas ODVBA does. Finally, ODVBA also employs a nonnegativity constraint, which is important as it prohibits canonical images with positive and negative value cancelations, which are often difficult to interpret, especially if a brain region is involved in many canonical images with different weights.\nThe rest of the paper is organized as follows. Section II describes the general formulation and its numerical optimization solution. Section III introduces a method of computationally efficient implementation for the ODVBA. Section IV presents a number of experiments with 1) simulated data of known ground truth and 2) structural images of elderly individuals with Alzheimer's disease (AD). These experiments demonstrate that the proposed methodology significantly improves both the statistical power in detecting group differences and the accuracy with which the spatial extent of the region of interest is determined by VBA-SPM analysis. Section V contains the discussion and conclusion. For convenience, Table I lists important notations used in the paper."}, {"section_title": "II. PROPOSED FRAMEWORK", "text": "The proposed framework consists of the following stages. 1) Regional nonnegative discriminative projection (NDP).\nFor each voxel, we examine a (typically large) neighborhood centered on it (sometimes referred to as a \"subvolume\") and use the NDP to find the direction that best discriminates the two groups being compared. This direction can be viewed as a spatially adaptive filter, which locally amplifies the group differences, since projection is a weighted average of all voxels in the subvolume, i.e., it is a filter. 2) Determining each voxel's statistic. A given voxel belongs to a number of neighborhoods centered on its neighboring voxels, so it may correspond to a collection of values, each being part of a different discriminative direction and reflecting underlying group differences. In order to eventually determine a single value for each voxel that represents the group difference at that spatial location and will be used for statistical analysis, we observe that the contribution of each voxel to a discriminative direction of a neighborhood to which it belongs is given by the respective coefficient of the optimally discriminative direction of that neighborhood. We sum up all these coefficients belonging to a given voxel to determine a quantity that reflects the voxel's discriminating value. 3) Permutation tests. Since assumptions of Gaussianity cannot be made for the derived voxel-wise discriminative measurements, we resort to permutation tests [24] , [39] to obtain statistical significance ( values). 4) Classification (optional). Although not necessarily part of ODVBA, classification is demonstrated here as an additional use of ODVBA. In particular, along the lines of the COMPARE algorithm [16] , the regional clusters showing the highest group differences are used as the input features to be fed to a classifier, e.g., an SVM."}, {"section_title": "A. Regional Nonnegative Discriminative Projection", "text": "For a given voxel in volume , we construct its neighborhood in which each voxel follows . To render this process computationally efficient when the neighborhood size is large, we randomly select voxels in this neighborhood and represent this neighborhood using a dimensional subvolume vector:\n. Provided that there are subjects, we can obtain subvolume vectors which form a data set:\nfor learning. The procedure can be illustrated as Fig. 1 . If there are voxels in each subject (i.e., if the template to which all subjects were normalized has voxels), we will have learning sets."}, {"section_title": "1) Basic Idea of NDP:", "text": "The NDP algorithm which is developed based on nonnegative quadratic programming [42] is used to find the optimal discriminative directions which project the high-dimensional samples onto a 1-D space that maximizes the classification accuracy and therefore the group differences. NDP is implemented on each learning set. The resultant optimally discriminant vector has a special property: it is nonnegative. This stems from the nonnegativity constraint that is incorporated into the objective function of the NDP method. This constraint is used to help us interpret the group differences. Specifically, our goal is not simply to find an image contrast, prescribed by , which distinguishes the two groups, but also requires that this contrast tells us something about the properties of the images we are measuring, e.g., about regional volumetrics or functional activity. We therefore limit ourselves to nonnegative, albeit arbitrarily shaped, local filters, each of which prescribes a regional weighted average of the signal being measured. In a regional volumetric analysis, for example, the optimal regional filter will reflect the shape of the region whose volume is different between two groups. In a functional image analysis, this filter might represent the region whose signal is summed up to reflect the activation. This is in contrast with the traditional methods of feature extraction for pattern classification, which are free to derive any feature obtained by any image filter that maximizes classification accuracy, but are not designed to necessarily measure (interpretable) group differences.\nTo better illustrate the idea of NDP, we show its results on a toy dataset before we describe the formulation. In this artificial test, we generated images that contained a square (the region of group difference) with intensity that varied from one image to another. We generated two groups of images: the first set of squares had intensities with mean 120.53 and standard deviation 5.79, while the second had 90.36 and 5.72, respectively. Fig. 2(a) shows the difference of means from the two groups. Fig. 2(b) shows the obtained from the learning set constructed according to the neighborhood I; it is basically noise with very small values of , indicating that no local filter can be found that distinguishes the two groups at that neighborhood. Fig. 2(c) shows the obtained from the learning set constructed according to the neighborhood II; the estimated optimal filter is well aligned with the underlying group difference, within which it has high values. The bottom line here is that, following the formulation to be presented next, the filter that locally amplifies the group difference in this set of images calls for a weighted average of the pixel values within the part of the square that is included in the neighborhood, correctly reflecting the underlying difference. We now present the details of the formulation.\n2) The Formulation of NDP: Using one given learning set constructed by the subvolume vectors from all the involved individuals, we probe into neighborhood elements' contributions for discrimination of the two groups. We expect to find such a nonnegative vector to describe the contributions of elements in the neighborhood: the larger the value of is, the more the corresponding element contributes to the discrimination. Equivalently, is the th coefficient of the regional filter denoted by . By exploiting , the learning set can be projected from the -dimensional space onto the 1-D space to be optimally classified, such as (1) where is the 1-D projection of . We expect that the two classes will be separated as much as possible along and at the same time the samples from the same class get more compact.\nA measure of the separation between the two classes is the distance of projected class means (2) where ; means the th class, ; denotes the number of samples in ; ; . And, the intra-class compactness is defined as follows: (3) where . and are called the between-class scatter matrix and the within-class scatter matrix separately, according to the classic Fisher linear discriminant analysis [14] in which the criterion function is based on the generalized Rayleigh quotient. Herein we consider and under the formulation of quadratic programming which is amenable to the nonnegative constraint as follows: (4) where ; is the controlling parameter;\nis the absolute value of the smallest eigenvalue of ; acts as the regularization parameter; is the identity matrix; is the vector with all ones; the second term is used to achieve which means the solutions of are not all zeros under the nonnegative constraint; is the balance parameter.\nTheorem 1: is a positive definite matrix. The proof is in the Appendix A. Since is positive definite, is a convex function and has the unique global minimum. We solve the above optimization problem using the nonnegative quadratic programming (NQP) [42] . According to [42] , let and denote the nonnegative matrices described as if otherwise (5) and if otherwise.\nIt is clear that . According to the two nonnegative matrices, the objective function in (4) can be written as the combination of three terms (7) where (8) We define their derivatives as follows: (9) Note that the partial derivatives on and above are guaranteed to be nonnegative because of the nonnegativity of .\nUsing the above derivatives, multiplicative updates rule which does not involve the learning rates is introduced to minimize the objective function iteratively (10) where . Equation (10) means that all the elements in are updated in parallel. Since and , the updated in (10) is always nonnegative.\nTheorem 2: The function of in (4) decreases monotonically to the value of its global minimum under the multiplicative updates in (10) .\nThe proof is in Appendix B."}, {"section_title": "B. Determining Each Voxel's Statistic", "text": "For all the voxels in one volume, we have discriminative directions, each applied to a different neighborhood, as described in Section II-A. For a given voxel , we obtain a list of values from different since may belong to a number of neighborhoods, as shown in Fig. 3 . (Recall that for each neighborhood to which belongs, the respective coefficient in reflects the discrimination power of this voxel in terms of the pattern seen in that neighborhood). To quantify the group difference measured at voxel , we use the following function, termed discrimination degree, which relates to the effect size [8] (11) where is a tuning parameter aiming to reduce potential outliers in the dataset. Let denote the set of neighborhoods that the given voxel belongs to, then we define the group difference on by summing up contributions from all neighborhoods to which it participates (12) where denotes the coefficients corresponding to voxels in , denotes that is the th element in and which acts as the weight for denotes the discrimination degree achieved in neighborhood and is defined in (11) .\nwill serve as the statistic reflecting group differences on the respective voxel and will be used next to determine statistical significance. Higher values of reflect stronger group differences. It is worth noting that, in ODVBA, one learning set is constructed according to one given neighborhood (subvolume vector) by different individuals. Actually, based on one learning set, the obtained coefficient has only one direction to maximize the classification accuracy. When ODVBA handles data that have both possible positive and negative differences, it does not need to calculate the twice using NDP described in Section II-A, but it has to determine two different statistical values for both positive and negative cases, before implementing permutation test respectively. In particular, only having the coefficient , by which the projected class means [referring to (2) ], involved in (12), we can get the statistical value for positive case . Conversely, only use by which the projected class means , we can get the for negative case. Moreover, for one given neighborhood, the optimal coefficients can only reflect the positive signals if the projected class means in this subvolume. However, the negative signals will never be ignored if they are really significant, because they may be highlighted in other random neighborhood where they are stronger than the positive ones, so that ."}, {"section_title": "C. Permutation Tests", "text": "Assuming that the null hypothesis is that there is no difference between the two groups, the statistical significance can be assessed by comparison with the distribution of values obtained when the labels are randomly permuted [24] , [39] . In particular, we randomly assign the subjects into two groups and then implement Sections II-A and II-B to calculate the statistic for each voxel. The above relabeling is repeated times. For one given voxel, let denote the statistic value obtained under the initial class labels and denote the ones obtained by relabeling. The value for the given voxel is calculated according to (13) where if otherwise.\nIII. COMPUTATIONALLY EFFICIENT IMPLEMENTATION\nThe original method described in Section II is based on voxelwise computation, an extreme solution that uses all the neighborhoods corresponding to all the voxels. Unfortunately, this approach would be complicated and computationally expensive. The simplest way to reduce the computational complexity is to randomly select a subset of the neighborhoods to represent all the neighborhoods and then the number of the involved learning sets can be reduced. However, with this method, the selected neighborhoods may not cover all the voxels and therefore, it is not guaranteed that statistics can be derived for each voxel. In this section, we use the Greedy Algorithm [10] to select the subset of the neighborhoods which include all the voxels and at the same time overlap each other under a certain rate. Moreover, to facilitate the greedy search, we introduce a new approach named Graph-assisted Greedy Neighborhoods Cover, which uses a graph to assist in seeking one neighborhood in each iteration of the greedy algorithm."}, {"section_title": "A. Minimum Subset of the Neighborhoods for ODVBA", "text": "We select the minimum subset of the neighborhoods as the replacement of all the ones , where and then the learning sets are constructed corresponding to the selected neighborhoods, respectively. To get a reasonable statistic value for each voxel after obtaining the discriminative directions using NDP, the selected neighborhoods are expected: 1) to cover all the voxels in , that is (15) 2) to overlap each other under at least an overlapping factor [51] , that is (16) for each in ."}, {"section_title": "B. The Traditional Greedy Neighborhoods Cover Algorithm", "text": "The problem introduced in Section III-A can be solved using the greedy algorithm [10] , [51] , which works by picking that covers the maximum number of remaining elements that are uncovered under certain constraint in each iteration. Let contain all the remaining uncovered elements at each iteration. The algorithm chooses the neighborhood that overlaps with the selected neighborhoods in and covers as many uncovered elements in as possible. Then, the selected is put into and the elements covered by is removed from . It finally terminates when is empty. The algorithm is summarized in Table II ."}, {"section_title": "C. Graph-Assisted Greedy Neighborhoods Cover Algorithm", "text": "It is worth noting that Line 5 of the algorithm in Table II may  be time-consuming because it picks from all the neighborhoods without using the neighbor information for searching in each iteration. We propose a Graph-assisted Greedy Algorithm which select by implementing simple operations on the small sub-block of the graph in each iteration. The algorithm is described as follows. \nObviously, each row of represents one neighborhood. Let denote the set of the elements covered by the neighborhoods from , that is , use to denote the index set of the selected neighborhoods and we can get the sub-matrix from as follows:\nwhere set follows:\nAmong the terms in (19), 1) means that the rows of come from ; 2) means that the neighborhoods to which the rows of correspond have never been selected to ; 3) means the sum of each row in are not equal to , that is, the neighborhood which are fully covered by the are removed; 4) means the neighborhoods having no intersection with are removed.\nCompute (20) and we can know is the number of elements covered by , in the th neighborhood. Let denote the index of element which is the minimum in with constraint:\n. Then the selected in this iteration should be . The proposed algorithm is summarized in Table III. "}, {"section_title": "IV. EXPERIMENTS AND RESULTS", "text": "In this section, we designed two different kinds of experiments to evaluate the performance of ODVBA compared with the original SPM [1] , [44] and nonparametric permutation based SPM (referred to SnPM) [24] , [39] . In the first experiment, we applied the three methods to the simulated atrophy data in which we know the ground truth. Here, it is easy for us to evaluate the accuracy and statistical power of ODVBA, in comparison with SPM and SnPM. The second experiment demonstrated the success of our method on the real data of AD patients from ADNI. 1 "}, {"section_title": "A. Simulated Atrophy Data 1) \"Blurring\" Case:", "text": "The dataset consisted of real MRI scans of 60 normal controls, with a relatively small age range, obtained from ADNI. The description of the MR Image acquisition and pre-processing protocol can be found in Section IV-B. Finally, RAVENS maps [13] which quantify the regional distribution of GM, WM and CSF, are formed for each tissue type. In this test, RAVENS of GM is employed. Next, 30 samples were randomly picked and manipulated to introduce 30% atrophy with \"U\"-like shape in the specific region (a gyrus). In other words, the corresponding RAVENS values in that region are decreased by 30%. Fig. 4 shows one selected slice of RAVENS map and the location of the atrophy.\nRegarding the simulated data as a group of patients and the remaining data as the control group, we conduct SPM, SnPM, and ODVBA for the group analysis. The smoothing size (FWHM of the involved Gaussian filter) in SPM and SnPM is 7 mm. The parameters in ODVBA are set as , , , , . The experimental results are shown in Fig. 5 . The background is the RAVENS map of a sample, appearing as a gray image and the overlapping areas are the red regions obtained by different value thresholds . We can see that the proposed ODVBA method precisely describes the \"U\"-like shape of the atrophy, while SPM and SnPM do not. In SPM and SnPM, the images are blurred so that the results are not accurate. For the simulated data, since we know the ground truth, we employ several types of metrics to evaluate ODVBA, compared with SPM and SnPM. We denote the significant voxels obtained from the three different methods as , the ground truth voxels as and all the voxels involved in analysis as . True positive rate (TPR) and false positive rate (FPR), two commonly used assessment metrics, are defined as follows: (21) where means the number of voxels. We varied the significance level of the group analysis from providing a series of TPR/FPR to build the receiver-operating characteristics (ROC) curve [35] , as demonstrated in Fig. 6 . We also list the TPR and FPR values with different specific value thresholds in Table IV . We can see that, for the \"Blurring\" case, SPM and SnPM not only produce worse accuracies but also suffer from high false positive errors. Otherwise, ODVBA offers a globally better result since for any FPR, the corresponding TPR is higher. 2) \"Different Degrees\" Case: The data used in this experiment contain 60 normal controls which also come from ADNI. The purpose is to evaluate the capabilities of three methods for detecting the simulated atrophies with different degrees. As well as in the \"Blurring\" case, RAVENS maps are finally created to represent the tissue density (which is proportional to regional volume, at that location). We randomly selected 30 volumes of GM and introduced the atrophy of 10%, 15%, 20%, 25%, 30%, and 35% (RAVENS values are reduced by 10%-35%) in the region around Hippocampus, separately. Fig. 7 shows one selected slice and the location of the simulated atrophy. The remaining 30 samples were regarded as control. The smoothing size in SPM and SnPM is 8 mm. The parameters in ODVBA are set as , , , , . Fig. 8 demonstrates the performances (TPR and FPR) of the three involved methods versus the different degrees of atrophy. The value which is used to get the significant region is 0.05. We can see that ODVBA has higher TPR but lower FPR on each dataset with different degrees of atrophy than SPM and SnPM. In Fig. 9 , we provide some representative slices on which we plot the ground truth and the detected significant regions obtained by the three methods. It is shown that ODVBA is much more powerful to detect the true atrophy hidden in the data.\n3) Effect of Kernel Size: In this section, we study the effect of the kernel size on the performance of the three methods, using the simulated data with 30% atrophy in the \"Different degrees\" case. For SPM and SnPM, the kernel size means the FWHM of the involved Gaussian filter, which is changed from 5 to 9 mm. For ODVBA, the kernel size means the size of neighborhood with varying from 9 to 17 mm, with an interval of 2 mm. By changing the kernel size, we can get a series of different results for the three different methods. Since the ground truth is known, we plot the corresponding ROC curve in Fig. 10 . As shown, the performance of ODVBA is stable. However, the sensitivity/ specificity of SPM and SnPM vary a lot with different kernel sizes and are companied with high FPR increasing."}, {"section_title": "4) Effect of Discrimination Degree:", "text": "In this section, we look into the effect of the discrimination degree on the performance of ODVBA, using the simulated data with 30% atrophy in the \"Different degrees\" case. By varying the tuning parameter described in (11), we can get a series of different resulting significant maps of ODVBA. Note that larger means the coefficient will be combined with a stronger discrimination degree to determine the statistical value [referring to (12) ] and means that only is used. Since the ground truth is known, we plot the corresponding TPR and FPR versus in Fig. 11 . As shown, along with the increasing of , the power of detecting the true positives is gradually enhanced, accompanied by low level FPR."}, {"section_title": "B. Real AD Data", "text": "With the development of computer-aided diagnosis, Alzheimer's disease has attracted a lot of attention [3] , [17] , [27] , [28] , [37] , [47] in the community of neuroimage. The data used in this experiment was obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database, which has recruited approximately 800 adults, ages 55-90, including 200 with normal control (NC), 400 with mild cognitive impairment (MCI), and 200 with AD. For up-to-date information, see website. 2 The goal of our study is to conduct complete evaluations of the structural MR images and identify potentially complex spatial patterns of brain atrophy in AD patients, compared with NC subjects. We randomly selected 100 subjects from the ADNI cohort. This included 50 NCs and 50 ADs, whose MRI scans were then analyzed. The datasets included standard T1-weighted images with varying resolutions. Adhering to volumetric 3-D MPRAGE or equivalent protocols, only images obtained using 1.5 T scanners were used. The sagittal images were preprocessed according to a number of steps detailed on the ADNI website, which corrected for field inhomogeneities and image distortion and were resliced to axial orientation. Images were preprocessed according to the following steps.\n1) Alignment of the brain with the ACPC plane.\n2) Removal of extra-cranial material (skull-stripping).\n3) Tissue segmentation into gray matter (GM), white matter (WM), and cerebrospinal fluid (CSF) using [41] . 4) High-dimensional image warping [43] to a standardized coordinate system, a brain atlas (template) that was aligned with the MNI coordinate space [26] .\n5) Formation of tissue density maps, i.e., RAVENS maps, typically used in the modulated SPM analysis [12] and in [2] . RAVENS maps quantify the regional distribution of GM, WM, and CSF, since one RAVENS map is formed for each tissue type. RAVENS values in the template's (stereotaxic) space are directly proportional to the volume of the respective structures in the original brain scan [12] . Therefore, regional volumetric measurements and comparisons can be performed via measurements and comparisons of the RAVENS maps. In this experiment, we used GM for evaluation purposes."}, {"section_title": "1) Resulting Significant Maps:", "text": "Based on the measurements of tissue density maps, we compared the performance of SPM, SnPM and our proposed ODVBA method. For SPM and SnPM, smoothing is performed using 8 mm FWHM kernel. For ODVBA, the parameters are set as follows:\n, Fig. 12(i) ]. As shown in the above mentioned sections in Fig. 12 , the significant regions detected by ODVBA are either totally or partially missing from the results of SPM and SnPM. Fig. 13 shows the surface rendering of significant regions obtained from the three different methods. Moreover, these are all regions that are generally known from histopathology studies [4] , [5] , [15] , [21] , [22] , [34] . Fig. 14 shows two representative magnified regions that were discovered by SPM, SnPM, and ODVBA. Among them, Fig. 14(a) shows the region near the Hippocampus and Fig. 14(b) shows the region around the Temporal Lobe. For the Fig. 14(a) , we can see that SPM and SnPM blurred the regions of the Hippocampus and Fusiform Gyrus. In contrast, a clear division between the two regions can be found in the results of ODVBA. For the Fig. 14(b) , SPM and SnPM blurred the different gyri and sulci in the region of the temporal lobe, while failing to detect other significant areas altogether; however, ODVBA delineates a more precise area of significant atrophy in that region.\nWe also employ the FDR procedure [25] , a powerful approach commonly used in neuroimaging applications to adjust for statistical error. FDR aims to control the portion of false positive error, instead of excluding this error [38] . In addition, FDR is adaptable since its value is computed directly on the observed value distribution. We partitioned the resulting significant maps with values of 0.001 and 0.05 (FDR corrected) respectively, according to predefined anatomical regions from the Jacob Atlas; calculated the means of the tissue density maps per region for all the samples and finally, computed the value based on these means according to the class information. Table V lists the sizes and statistics of major anatomical regions. We can see that not only the sizes detected by ODVBA, but also the corresponding values are generally greater than those detected by SPM and SnPM. This means that the regions found by ODVBA display a higher degree of differentiation between the two groups and that SPM and SnPM might have missed some significant information.\n2) Pattern Classification: In a separate experiment, we used the detected significant regions as the features input to a classifier of individual scans into NC or AD and compared the three different methods in terms of the performance of classification with SVM. We randomly divided the original 50 (NC) +50 (AD) into five subsets (10+10 each) and then implemented five-fold cross-validation.\nFor each fold, 1) we used 40+40 for training and got the significant regions (with the threshold) by the three different group analysis methods; 2) we calculated the means of the tissue density values of significant voxels in each predefined anatomical region (from the Jacob Atlas) for all the samples and using the means from different regions as the input features, we got the SVM classifier [9] ; 3) finally, we used the left testing set with size of 10+10 for validation.\nThe radial basis function (RBF) kernel is used in this study. Based on the five-fold cross-validation, the classification rate of ODVBA (90%) is superior to that of SPM (86%) and that of SnPM (87%)."}, {"section_title": "V. DISCUSSION AND CONCLUSION", "text": "In this paper, we have introduced a new framework, termed ODVBA, for group analysis of medical images. In the proposed framework, NDP is introduced to find the optimal discriminative direction in each learning set constructed by the neighborhood centered at the given voxel. Subsequently, each voxel's statistic is determined by a composition of all the smoothing directions which are associated with the given voxel. Finally permutation tests are used to obtain the statistical significance of the resulting ODVBA maps. In addition, to reduce the cost of computation, we developed a new method termed Graph-assisted Greedy Neighborhoods Cover to select a minimum subset of the neighborhoods which are used to learn the discriminative directions. We compared ODVBA to the traditional SPM and the nonparametric SPM (SnPM) with both simulated data and real AD data from the ADNI cohort. The experimental results have shown tested ODVBA against the conventional smoothing methods.\nThe main premise of our approach is that it effectively applies a form of matched filtering, to optimally detect a group difference. Since the shape of the target region of group difference is not known, regional discriminative analyses are used to identify voxels displaying the most significant differences. In addition to potentially improving sensitivity of detection of a structural or functional signal, this approach was shown in several experiments to better delineate the region of abnormality, in contrast with conventional smoothing approaches that blur through boundaries and dilute the signal from regions of interest with signal from regions that do not display a group difference. We use the coarse grid search over tuning parameters, e.g., , , and . Section IV-A-III) Effect of kernel size and Section IV-A-IV) Effect of discrimination degree are examples of the parameter selection that we studied the performance of ODVBA on different parameters. Generally, our method is not so sensitive to the tuning parameters once its performance is stable. We can determine the optimal parameters in the simulated data in which we know the ground truth. If the simulated data and the real data come from the same data source, have similar sample size and have similar size and degree of atrophy, we assume that the optimal parameters determined by the simulated data are also suitable for the real data. That is, the simulated data would be an appropriate reference for the real data to select the optimal parameters. As described in the Introduction, our method are related with methods which use LDA and its variants over the entire image to determine \"canonical image\" that best discriminate between two groups or conditions. However our approach has significant differences from these approaches. In particular, such global LDA-based methods tend to be very limited by the small sample size and high-dimensionality problem and therefore are typically able to only detect some of the regions that display group differences or activations, but not all. They are most suitable for classification purposes, rather than for voxel-based analysis. Most importantly, these methods produce both positive and negative loadings, which reflect cancelations in the data and therefore render it very difficult to interpret the data. In general, they are not designed to construct a precise spatial map of a group difference, but rather to find the best global discriminant. The nonnegativity constraints in our ODVBA are essential. Our results can be interpreted in terms of brain activity or atrophy, for example, and the regions found match exactly the underlying regions of interest. The nonnegativity constraints are by far not a trivial issue to implement, since they influence the entire optimization process."}, {"section_title": "APPENDIX A PROOF OF THE POSITIVE DEFINITE MATRIX", "text": ""}, {"section_title": "If", "text": ", the smallest eigenvalue of is which is greater than 0. If , the smallest eigenvalue of is just . In a word, all the eigenvalues of is greater than 0. Since , and are all symmetric matrices, is a symmetric matrix. Thus, we complete the proof. "}, {"section_title": "APPENDIX B PROOF OF CONVERGENCE AND OPTIMALITY", "text": "Auxiliary function [32] is used to derive the rule of multiplicative updates in (10) .\nDefinition 1: is an auxiliary function for if the conditions (22) are satisfied.\nLemma 1: if is an auxiliary function, then is nonincreasing under the update (23) One can refer to [32] for the proof of the above lemma. Following [42] , we introduce such an auxiliary function for (24) Note that and [42] , so it is clear that the conditions and are met. Rewrite the auxiliary function as the following form: (25) where means a function for each component in (26) Then, the minimization of can be achieved by minimizing each and according to (23) we have (27) Since the derivative of is (28) and considering , we obtain the update rule as follows:"}]