[{"section_title": "", "text": "T aken together, ischemic stroke (IS) and Alzheimer's disease (AD) place an enormous burden on global health care. Both are among the leading causes of acquired disability worldwide, 1, 2 and the lifetime risk of AD or stroke is as high as 1 in 2 for women and 1 in 3 for men. 3 An estimated 24.3 million people were thought to have dementia in 2001, and this is expected to rise to 81.1 million by 2040. 2, 4 Increasing evidence suggests epidemiological and pathological links between AD and IS. Population-based studies have shown AD to be a risk factor for developing IS, 5, 6 and vice versa, 7 suggesting that shared pathological processes may be involved in both conditions. Other studies have indicated a synergistic relationship between cerebral infarction and AD, with the combination of both leading to an increased risk of cognitive decline and dementia. Studies have also shown that cerebrovascular events lead to more-rapid cognitive decline in patients with AD. 8 Postmortem studies have shown that individuals with cerebral infarcts as well as neuropathological AD had a markedly increased risk of dementia in life compared with those with AD pathology without infarcts."}, {"section_title": "9-11", "text": "The predominant vascular lesion in AD is cerebral amyloid angiopathy (CAA), 12, 13 and although CAA is more prevalent in IS than controls, it is not a common cause of IS. 14 The predominant cerebral vascular pathologies in IS are large vessel atherosclerosis (large vessel disease; LVD) 15, 16 and small vessel arteriosclerosis (small vessel disease; SVD). 17 Both pathologies have been associated with AD. In particular, at least one third of AD cases have pathological evidence of moderate or severe SVD. 18 AD and vascular pathologies are, however, temporally and anatomically distinct. This has led to the hypothesis that cerebrovascular disease may make the brain more susceptible to AD pathology, potentially by impairing clearance of amyloid. 19 Alternatively, AD and IS may represent independent, but convergent, diseases that share some pathophysiological processes and therefore may be expected to share genetic risk factors. Genome-wide association studies (GWAS) have recently begun to identify the common genetic component of many diseases such as AD and IS. More than 20 variants have now been identified that contribute to AD, [20] [21] [22] and in IS recent progress has resulted in the identification of a number of variants, the majority of which have been associated with specific stroke subtypes. [23] [24] [25] [26] [27] [28] Indeed, recent evidence from GWAS indicates that a large proportion of risk in complex diseases such as AD and IS is attributable to the combined effects of a large number of common genetic variants, 29, 30 each conferring only a small amount of disease risk. [31] [32] [33] Recent studies estimate the proportion of variance explained by the genetic contribution from common variants to AD and IS to be approximately 24.0% and 18.0%, respectively. 29, 34 Genomic-relatedness-matrix restricted maximum likelihood (GREML) methods have been one of the key methodological advances that, in recent years, have improved understanding of the common genetic influence on and between complex traits. These approaches use distant relatedness between individuals to infer heritability and coheritability of complex traits and have been used to provide insights into and between many diseases. [35] [36] [37] We performed a bivariate GREML analysis in two large GWAS cohorts consisting of AD and IS cases and controls to assess evidence of a shared genetic contribution to the two diseases. We initially sought to determine whether there was evidence of a shared genetic contribution to IS and AD and then sought to determine whether this association was particular to a specific subtype of IS. Finally, through a meta-analysis and subsequent pathway analysis of the two data sets, we sought to identify the molecular pathways through which shared disease risk may be conferred."}, {"section_title": "Participants and Methods", "text": ""}, {"section_title": "Study Design and Participating Cohorts", "text": "Two different sets of cases and controls were used in two different parts of the analysis ( [GERAD] ). In stage 2, 11,632 SNPs were genotyped and tested for association in an independent set of 8,572 AD cases and 11,312 controls. Finally, a meta-analysis was performed combining results from stages 1 and 2. In this analysis, only results from stage 1 were used. All AD cases met criteria for either possible, probable (NINCDS-ADRDA, DSM-IV), or definite (CERAD) AD.\nFor the bivariate GREML analyses (analysis ii), we obtained genotype level data consisting of AD cases and controls from LOAD-CIDR, 43 the Alzheimer's Disease\nNeuroimaging Initiative (ADNI), and eMERGE (Group Health) 44 ; IS cases and controls from the WTCCC2 ischemic stroke study, 23 the Australian Stroke Genetic\nCollaborative, and Besta Stroke Register (Milano) 38 and independent controls from RADIANT, 45 People of the British Isles (POBI), 46 and the Health ABC studies. 47 All were genotyped on the Illumina 610k, 660k, 1M, or 1.2M arrays. We performed quality control independently on each data set, at the minimum removing SNPs genotyped in less than 97% of individuals, SNPs diverging from Hardy-Weinberg equilibrium (p<1e-6), and SNPs with minor allele frequency <1%. We then merged all individuals together and included only SNPs present in >99.9% of individuals, again removing SNPs diverging from Hardy-Weinberg equilibrium (p<1e-6). We performed ancestry-informative principal components analysis with smartpca (EIGENSTRAT), 48 removing\nany individuals more than 6 standard deviations from the mean on any of the first five principal components over five iterations. The remaining individuals were used to calculate the first 30 principal components."}, {"section_title": "Statistical Analyses", "text": "ANALYSIS OF GWAS SIGNIFICANT LOCI. We first determined whether any of the loci considered significant in large meta-analyses of IS and AD were significantly associated with risk of the other disease. In selecting IS associated SNPs, we considered the five loci (9p21, HDAC9, PITX2, ZFHX3, and 12q24.12) associated with stroke in METASTROKE and in a recent publication. 38, 39 We set a p-value threshold of p 5 0.01 to determine significance, using the Bonferroni method to correct for five independent tests. In selecting ADassociated SNPs, we considered all independent loci associated with AD in the largest meta-analysis to date, as well as any other loci which have been identified since that publication. 22, 49, 50 We identified 22 such associations and set the corresponding Bonferroni-corrected pvalue threshold at p 5 0.0023. Where SNPs were not available in METASTROKE (six SNPs), we evaluated the available SNP that most strongly tagged the associated SNP.\nGENETIC CORRELATION ANALYSIS. To estimate the genetic correlation between AD and IS, we performed a bivariate GREML analysis using the GCTA package (version 1.24.2). 51, 52 The approach involves estimating the distant relatedness between all individuals based on common SNPs represented on GWAS arrays. Linear mixed models are then used to estimate the proportion of (co)heritability explained by the relatedness between individuals. We present our results as the estimated genetic correlation between the two diseases, rG, which is a value between -1 and 1 that can be interpreted as the degree of genetic effects shared by the two traits. Intuitively, rG would be positive when AD-IS pairs are more related than IS-control and AD-control pairs and negative when AD-IS pairs are less related then IScontrol and AD-control pairs. We tested whether the correlation was significantly different from zero (rG6 ¼0), interpreting a significant test for rG6 ¼0 as evidence that genetic liability was shared between the two traits. In our analysis, we included the first 10 principal components in each analysis and removed distantly related individuals above a suggested threshold (>0.025). Estimates can be upwardly biased if related individuals remain in the sample 32 ; this threshold is included to avoid this problem from arising. In addition, we evaluated the sensitivity of the results by repeating the analysis using a stricter minor allele frequency threshold (0.05), genotyping missingness threshold (99.95%), relatedness threshold (0.02), and a greater number of principal components (20) in the model. In all analyses, only autosomal SNPs were included."}, {"section_title": "META-ANALYSIS OF AD WITH SMALL VESSEL STRO-", "text": "KE. The results of the 17,008 AD cases and 37,154 controls from IGAP and the 3,652 SVD cases and 58,657 controls from METASTROKE 1 were meta-analyzed using Stouffer's method, as implemented in METAL. 42 Because our aim was to identify the genetic variants contributing to both disorders, we attributed equal weights to each of the diseases. After meta-analysis, we extracted only those SNPs with no evidence of heterogeneity between the two data sets (p > 0.01), thereby removing SNPs that were associated with only one of the two traits. The remaining SNPs were then taken forward for further investigation, and all others were discarded. We used the Zaykin method to correct for inflation attributable to shared controls. 53 \nKE. Having established that susceptibility to AD appears to be shared only with SVD, we performed a meta-analysis of currently available GWAS data in SVD (METASTROKE1) and AD (IGAP). One region, near to ATP5H/KCTD2, was associated with AD and SVD at genome-wide significance (p 5 1.8 3 10"}, {"section_title": "IDENTIFICATION OF SHARED DISEASE PATH-", "text": "WAYS. We then determined whether the meta-analyzed results showed significant enrichment for annotated pathways and gene sets from the Gene Ontology (GO), BIO-CARTA, REACTOME, and Kyoto Encyclopedia of Genes and Genomes (KEGG) libraries. We used the gene set enrichment analysis (GSEA) approach, as implemented in the MAGENTA software package, 54 to determine the enrichment within the 1,488 gene sets that had more than 15 and less than 200 genes in our data set. A p value of significance for each gene set was then calculated, along with a false discovery rate (FDR) q value, estimated using the Benjamini-Hochberg procedure. 55 We used an FDR threshold of 0.05 to identify associated gene sets. We used a second pathway analysis approach (GSEA-VEGAS) to verify any associated sets as follows. We calculated gene-level association statistics for all genes using VEGAS 56 and then calculated a gene-set enrichment statistic for each of the pathways. We calculated an empirical p value by sampling random gene sets with the same number of genes as the tested pathway and compared GSEA-enrichment statistics between the simulated and tested pathways.\nADNI. Data used in the bivariate GREML analyses were obtained from the ADNI database (adni.loni.usc.edu). The ADNI was launched in 2003 as a public-private partnership, led by Principal Investigator Michael W. Weiner, MD. The primary goal of ADNI has been to test whether serial magnetic resonance imaging, positron emission tomography, other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of mild cognitive impairment and early AD. For up-to-date information, see www.adni-info.org."}, {"section_title": "Results", "text": ""}, {"section_title": "Analysis of GWAS Significant Loci", "text": "None of the SNPs associated with IS were associated with AD (p > 0.1). Similarly, none of the SNPs associated with AD passed Bonferroni correction for association with IS or any of the three subtypes. (20) in the model; all estimates of rG were between 0.35 and 0.37, and p values for rG>0 were all 0.026."}, {"section_title": "28", "text": "; Fig 2) . Variants in this region have been associated at genome-wide significance with AD in a recent study, 49 and this is the between two genes: Immature Colon Carcinoma Transcript 1 (ICT1) and adenosine triphosphate (ATP) synthase, H 1 transporting, mitochondrial Fo complex, subunit (ATP5H)."}, {"section_title": "IDENTIFICATION OF DISEASE PATHWAYS SHARED", "text": "BETWEEN AD AND SVD. The MAGENTA pathway analysis identified four significant pathways using the significance criteria of FDR q value < 0.05 (Table 2) . Three of these involve lipid transport (GO/phospholipid efflux, GO/cholesterol efflux, and GO/reverse cholesterol transport), whereas one involves immune response (GO/negative regulation of nuclear factor kappa B [NF-jB] transcription factor activity). When validating each significant pathway using an alternative method (GSEA-VEGAS), all pathways were associated at p 0.011, whereas three were associated at p 0.0015."}, {"section_title": "Discussion", "text": "Our results support the hypothesis that shared pathophysiological processes underlie both IS and AD, but suggest that this shared association is only with SVD and not with the other stroke subtypes. When investigating the genetic correlation between AD and IS, we found evidence that the cumulative effect of SNPs each individually conferring less risk, and therefore not reaching GWAS significance for stroke, are shared between AD and SVD, with no evidence to support association with any other stroke subtype.\nHaving established that AD and SVD share a substantial proportion of genetic susceptibility, we then sought to identify the genetic variants and shared molecular pathways through which AD and SVD disease risk is conferred. Our meta-analysis highlighted one particular region on chromosome 17 in a region encompassing three genes; ICT1/KCTD2/ATP5H, which has previously been implicated in AD. 49 In addition, we found evidence of association with four pathways. Three of these involve lipid transport, whereas the other involves immune response.\nIn addition, we used data from large GWASs in IS and AD to determine whether GWAS significant loci previously identified in AD are associated with stroke and whether known stroke loci associated with AD. We could find no significant associations, indicating that the contribution of specific associations identified thus far do not contribute a considerable proportion of genetic risk to the reciprocal disease.\nThe relationship between AD and IS is not fully understood. Vascular risk factors have been associated with AD, 57 and a variety of cerebrovascular pathologies including IS have been reported to be more frequent in AD cases than controls. [15] [16] [17] However, whether IS and AD pathologies are merely additive, or whether IS pathology directly promotes the development and progression of AD pathology, is debated. 57 Possible mechanisms for the latter include cerebral hypoperfusion induced by cerebrovascular disease initiating or accelerating the neurodegeneration cascade, causing amyloid deposition and synaptic and neuronal dysfunction. 57 In addition, whether there are shared pathological processes contributing to both IS and AD is uncertain. Our results offer new insights into this relationship. Previous studies have found that lacunar stroke, the hallmark of SVD, is associated with worse cognition in patients with AD pathology, 10 although the relationship is still debated."}, {"section_title": "57", "text": "A number of studies have reported that large artery atherosclerosis, in the carotid and intracranial arteries, is associated with AD risk. 15, 16, 58 Our results do not support this and instead suggest that the most important cerebrovascular pathology mediating the relationship between IS and AD is SVD. Our study has limitations. Cases from both IGAP and METASTROKE 1 are drawn from a number of international centers. We therefore cannot rule out the effect of differences in screening techniques and other diagnostic biases on our study. The relationship between IS and AD could be mediated, at least in part, by shared cardiovascular risk factors. We did not have risk factor data on all cases and controls to allow this to be adjusted for. However, if the association was driven by risk factors, we might expect this to affect all subtypes of stroke and would therefore not explain why our association is specific to small vessel stroke. When evaluating the APOE e4 allele, we used SNPs from HapMap II populations which are in partial linkage disequilibrium with the true variant. Without genotyping the causal allele, we cannot completely rule out an association, although if a strong association existed, we would expect it to be identified in our analysis. The diagnosis of AD was made using either established clinical criteria or pathophysiological confirmation; however, pathological studies having shown coexistent vascular pathology are not uncommon, and this could account for part of the shared risk. One other concern in analyses such as this, which include a large number of variables and individuals, is that subtle biases can influence the results. We took great care to only include samples that were genotyped on similar arrays from Illumina and directly assessed relatedness between individuals based on genotypes. In addition, our results were not sensitive to changes in parameters used, such as minor allele and relatedness thresholds.\nIn summary, our results demonstrate that a proportion of the common genetic susceptibility to AD is shared with SVD, but not with any other stroke subtypes. Our results provide a baseline for further study into the complex relationship between AD and SVD through genome-wide analyses."}]