[{"section_title": "Introduction", "text": "Obesity is a pressing national health problem. Recent statistics indicate that 30 percent of adults are obese, and another 35 percent are overweight. Obesity is also common among children: Sixteen percent of children aged 6-19 years old are obese (NCHS 2004a; NCHS 2004b) . 1 To date, few policy levers have been found that have much promise to impact obesity. Because children spend a substantial portion of their waking hours in school, and consume one-third to one-half of their daily calories there, school policies seem to be a promising place to look to implement public health strategies aimed at reducing obesity (see for example Haskins, Paxson, and Donohue 2006 ; Surgeon General of the United States 2001).\nThe National School Lunch Program (NSLP) serves lunch to almost 30 million students-60 percent of the total student population (ERS 2007) . Almost all public schools offer the NSLP, which annually provides $6.1 billion in total cash payments to local schools 2 and an additional $4.7 billion in in-kind surplus food commodities such as fruit juices and peanut butter. Although a large fraction of school lunch participants get their lunch free (48 percent) or at a reduced price (9 percent), a substantial share (43 percent) is from nonpoor families and pay full price for lunch. As a result, if school lunches play a contributing role in the child obesity epidemic, making them healthier has the potential to impact a large number of children across socioeconomic status, race, and geographic boundaries.\nIn this paper, I attempt to isolate the causal impact of school lunches on childhood obesity, by using two different approaches to address the identification problem, including looking at changes in obesity over time and using a regression-discontinuity approach. These approaches -which employ very different identification strategies and cover students from different parts of the income distribution -suggest that school lunch eaters gain more weight after starting school than do students who do not consume school lunch, who I call ''brown baggers. '' 3 I then present calculations from dietary recall data that indicate that children who eat school lunches consume an extra 60 or so calories per day, and that a calorie increase of this magnitude is large enough to cause a substantial increase in obesity rates among children. This suggests that a policy intervention to make school lunches less caloric might reduce the childhood obesity rate -at least among the elementary school-aged children studied here."}, {"section_title": "II. History, Previous Research, and Policy Context", "text": "Economists have relatively recently come to be interested in the study of obesity and overweight. In a recent paper, Cutler, Glaeser, and Shapiro (2003) study the doubling of obesity rates among adults over the past 20 years. They estimate that the increase in obesity can be accounted for by a calorie imbalance of 100 to 150 calories per day, and find that the recent increase is likely due to eating more calories (opposed to burning fewer calories through activity). 4 Comparing recent food dietary recall data to those collected in the early 1980s, they find that the increase in calorie intake appears to come from the consumption of more meals and snacks per day, and not from ''supersizing''-that is, eating a larger number of calories per meal.\nEven less work has been done by economists to examine overweight among children. Anderson, Butcher, and Levine (2003) use the National Longitudinal Survey of Youth to follow children over time, and measure the effects of increased maternal employment rates over the past 30 years-including all the attendant changes in children's lives that come when mothers become employed, such as eating more pre-prepared meals and potentially playing outside less. Altogether, increased maternal employment only can explain less than one percentage point of the nine percentage point increase in overweight. Anderson and Butcher (2005) investigate the impact of vending machines and find that a ten percentage point increase in access to vending machines is associated with a 2.2 percentage point increase in the body mass index of students who have overweight parents. 5 The role of school food environments in addressing children's overweight has gotten increased policy attention. In 1995, after research showed that many school lunches failed to meet nutrition requirements, Congress passed the ''School Meals Initiative for Healthy Children.'' The new policy required food served to meet one-third of the child recommended daily allowance (RDA) of calories, protein, calcium, iron, and vitamins A and C, and for no more than 30 percent of calories to come from fat. 6 In addition, schools were to restrict foods of ''minimal nutritional value,'' such as soda. In a subsequent survey, two-thirds of cafeteria planners reported that the new guidelines had at least somewhat changed their school menus. 7 Recently there has also been substantial policy activity restricting student access to vending machines. While vending machines are governed by state law and are not directly related to the Federal School Lunch Program, changes in vending machine availability certainly can play a role in the overall school-food climate. Research by Anderson and Butcher (2006) suggests that the introduction (or removal) of vending machines may have some impact on obesity rates among high school students, but since relatively few elementary school students have access to vending machines, the policies have a more limited scope to affect the younger children studied in this paper.\nPredecessors to the National School Lunch Program (NSLP) date back to the Great Depression, when the government began to distribute surplus farm commodities to schools with large populations of malnourished students. In 1946 Congress passed the National School Lunch Act (Gunderson 1971) . The act's statement of purpose indicates that a nonprofit school lunch program should be established ''as a measure of national security'' with the dual purposes ''to safeguard the health and well-being of the Nation's children and to encourage the domestic consumption of nutritious agricultural commodities and other food.'' A very nice recent historic evaluation of the impact of the NSLP in the 1960s found that the introduction of the program improved educational attainment of students exposed to the program, but did not appear to have long-term health impacts (Hinrichs 2007) . The number of students participating in the NSLP 5. Vending machines are much more prevalent in high schools. Almost 90 percent of high schools have vending machines or otherwise sell food not associated with the National School Lunch Program, while only 33 percent of elementary schools do (Centers for Disease Control 2006). 6. Saturated fat was to account for fewer than 12 percent of calories. 7. Fewer than 4 percent of schools meet all of the guidelines outlined in the Healthy Children Initiative (Source: Author's calculation from the School Nutrition Dietary Assessment-II data set).\nhas grown from 7.1 million in 1946 to 28.4 million in 2003, and the USDA estimates that 187 billion lunches have been served under the program.\nTo date, most research on the National School Lunch Program has been focused on how the program impacts intake of calories and various nutrients. Most research has found that NSLP participants consume more vitamins and minerals at lunch than nonparticipants, and that the 24-hour effect is smaller but still statistically significant (Fraker 1987; Devaney, Gordon, and Burghardt 1995; Suitor 2001, 2003) .\n8 Gleason and Suitor (2001) also find that NSLP participants consume more calories in a typical day than nonparticipants, but that all the additional calories come at lunch time, although in followup work (Gleason and Suitor 2003) they control for individual fixed effects and find no difference in energy intake comparing across days that students do and do not receive a school lunch. As public health priorities are shifting from combating malnutrition to addressing the epidemic of childhood obesity, it seems worthwhile to investigate the potential of the NSLP to contribute to childhood obesity."}, {"section_title": "9", "text": ""}, {"section_title": "III. Description of the ECLS-K Data", "text": "The data used in this study come from the Early Childhood Longitudinal Study -Kindergarten Cohort (ECLS-K), a panel data set collected by the United States Department of Education following children in the kindergarten class of 1998-99 from kindergarten through (eventually) eighth grade. The data set covers approximately 15,000 students in 1000 different schools and collected a wide range of information on children, their families, and their schools. Summary statistics are presented in Table 1. Children's heights and weights were directly measured by the survey collectors at the beginning and end of kindergarten, and at the end of first, third, and fifth grades."}, {"section_title": "10", "text": "From these data, I calculate children's Body Mass Index (BMI, a scaled weightfor-height measure calculated as one's weight in kilograms divided by their height in meters squared) and their obesity, overweight, and underweight status (calculated as whether the child's BMI is above the standard Centers for Disease Control sex-and age-in-months-specific threshold).\nInformation on a student's school lunch participation status was collected from the child's parents. The survey question I use as the main measure of lunch participation asks whether the child ''usually'' receives a complete school lunch offered at school (and not brought from home). The participation rate calculated using this measure of school lunch is 75.6 percent, which is comparable to the 67 percent average participation rate in elementary schools reported by Fox et al. (2001) . Parents also are asked whether their school participates in the school lunch program, and whether 8. An important recent paper by Bhattacharya, Currie, and Haider (2004) finds that the National School Breakfast Program improves the nutritional quality of food consumed, but does not increase the number of calories consumed. 9. An interesting paper by Figlio and Winicki (2005) finds that Virginia schools facing accountability sanctions increase the caloric content of their school lunches during test week by over 100 calories per day, in a probable attempt to boost students' short-term cognitive performance. 10. Data were collected on a small subset of the respondents at the beginning of 1st grade as well. "}, {"section_title": "IV. Measuring the Impact of School Lunches", "text": "In a simple look at the data, students who eat school lunches are more likely to be overweight than their classmates who brown bag their lunch. For example, at the end of first grade 14 percent of school lunch eaters are obese while 11 percent of brown baggers are obese. This simple correlation might not reflect anything causal about the impact of school lunches on obesity, but could instead reflect the impacts of other characteristics that influence both the probability of being obese and the probability of eating school lunch since (of course) children are not randomly assigned into school lunch and brown bag treatments. There are all sorts of observable and unobservable factors that predict the likelihood that a child will eat a school lunch -for example, low-income, African American, and Hispanic children are substantially more likely to eat school lunch -and many of these same observable and unobservable factors also are associated with being overweight. As a result, a naïve regression of school lunch on overweight may overstate the causal impact of lunch if all other related factors are not perfectly controlled."}, {"section_title": "A. Approach One: Changes Over Time", "text": "One way to isolate the effect of school lunches is to compare a cohort of children over time starting at school entry. The idea behind this approach is that the effects of unobservable family background characteristics that differ by a student's school lunch status can be captured by differences in obesity by the time a student starts school-that is, prior to being exposed to the school lunches. If those unobservable characteristics remain constant over time, then they can be differenced out by studying changes in obesity over time. Below I find that there is no difference in obesity rates by (future) lunch status at the time students enter kindergarten, and present several specification checks aimed at addressing the possibility that unobservable family characteristics might change over time in ways that correlate to school lunch status. Table 1 shows selected characteristics by school lunch status. The sample is limited in this section to only students who are ineligible for free or reduced-price lunch and who attend schools that participate in the school lunch program. Column 1 shows mean characteristics for students who brown bag their lunch in first grade, and Column 2 shows characteristics for students who buy a school lunch. Column 3 shows the p-value on the difference between brown baggers and school lunch eaters. Across the entire sample, brown baggers are from families that we might think of as more likely to invest in children's health. For example, brown baggers are more likely to have college educated parents, have higher baseline test scores, more children's books in the home, and higher measured socioeconomic status than school lunch eaters.\nMany of the differences in background characteristics, though, reflect different school lunch participation rates across schools drawing from student populations with different background characteristics. In order to control for characteristics that might vary at the school or neighborhood level-for example, differences in the availability of fast food restaurants, or spaces to play, or regional differences in food preferences-I present most results below conditional on school-level fixed effects. Column 4 shows the p-value on a test of whether each characteristic differs by lunch status conditional on school-level fixed effects. When students are compared within schools, some of the differences in background characteristics go away; nonetheless, the background characteristics are controlled directly in the results that follow. Table 2 shows regression-adjusted results of the following equation:\nwhere i indexes the child and s indexes schools. The dependent variable, obese, is equal to one if the child's body mass index (BMI) is above an age-and gender-specific threshold.\n12 X is only included in some of the specifications, and is a vector of student-level covariates such as race, gender, family characteristics, and program participation. 13 The term m s is a school fixed effect, and e is is the usual error term. As shown in Columns 1-4, the type of school lunch that children will go on to eat in kindergarten and first grade is not associated with any differences in obesity rates at the time students enter kindergarten, whether or not covariates are controlled. This suggests that any unobservable differences between brown baggers and NSLP participants have not materialized into obesity differences by kindergarten entry. By the end of first grade, however, school lunch eaters are 2.4 percentage points more likely to be overweight, controlling for observable characteristics and school fixed effects. When baseline obesity is included as an explanatory variable, the difference in obesity rates edges down slightly, to about two percentage points. In either case, after two years of exposure to school lunches children are about two percentage points (on a base of 9 percent) more likely to be overweight than their classmates who brown bag their lunch.\nA major cause of concern in interpreting these results is that unobservable family characteristics may be the true underlying cause of an increase in body weight. If those unobservable characteristics are correlated with school lunch eating status, then we might inappropriately assign causality to school lunches when in fact other characteristics are the driving force behind the increase in body weight. It is important to note, however, that because the lunch buyers and brown baggers enter kindergarten with the same level of overweight, the potentially confounding unobservable characteristics would have to be affecting change in body weight over time, and not just the 12. The threshold was set as the 95th percentile of the age-and gender-specific BMI distribution of a nationally representative group of children in the early 1970s, and is the standard measure for obesity in children aged 2-18. BMI is calculated as a child's weight in kilograms divided by its squared height, in meters. 13. The covariates included are categories of mother's education level, mother's employment status, presence of a father, language spoken at home, categories of numbers of children's books in the home, previous program participation in WIC, Food Stamps, AFDC and Head Start, and child's age, gender, birth weight, and indicator for premature birth. Results are similar if these covariates are not controlled, or if an even more saturated model is run. Notes: Sample size is 4,841. Linear probability models. Includes only students ineligible for free lunch. Robust standard errors that allow for correlated residuals across students in the same school in parentheses. Covariates include mother's education and employment, language spoken and number of children's books in the home, child age, gender, birthweight, premature birth indicator, participation in income support programs, Head Start participation, income category, and presence of a father.\nlevel. That said, even though brown baggers and lunch eaters come into school with the same rates of overweight, there might be other unobservable changes in the child's family that would contribute to changes in obesity and also would be correlated with lunch status. Theories about potential confounding effects here can typically be divided into two categories. First, some changes may occur at the same time as school enrollment that impact a child's food and activity environment differentially by school lunch status. For example, a school lunch eater's mother might start a new job when the child starts kindergarten, and might then have less time to prepare healthy meals or supervise outdoor play. A divergence between the lunch eater's obesity status and an otherwise similar brown bagger might then be caused by the change in home environment associated with the mother's new employment, but if that change is not accounted for then the increase in obesity may be erroneously attributed to school lunches. Second, there may be underlying differences between brown bag and school lunch families that are not measurable until a child is slightly older. For example, parents who care more about health may be more likely both brown bag their child's lunches and to enroll their children in sports teams. But if the opportunity to enroll in sports teams does not open up until after a child is old enough to also start school, the impact that sports have on reducing overweight may not kick in until after kindergarten enrollment, and may be erroneously attributed to school lunches in this case. Table 3 presents some robustness checks. Columns 1-4 attempt to address potential confounding effects caused by unobservable family-level changes that coincide with kindergarten enrollment and might be proxied by observable characteristics. To eliminate the potential bias from mothers who change their employment status when a child starts school, Columns 1 and 2 limit the sample to only children whose mothers did not change employment status between their child's entry into kindergarten and the end of first grade; the impact of school lunch on obesity remains about the same at two percentage points. 14 Another potential measure exploits the presence of younger siblings, since the home meal preparation and activity environment may be more stable if the kindergarten entrant is not the last child to enter school. Columns 3 and 4 show that the pattern continues to hold among these arguably more stable home environments: There is no difference in obesity rate at kindergarten entry, but by the end of first grade differences in obesity rates have appeared.\nTo address the second category of potentially confounding effects-that is, that there is something about families of lunch buyers that changes their investment in their child's food or exercise environment once school starts-I investigated proxy variables that might signal willingness to invest in child health. The ECLS data collected limited information about after-school activities such as participation in sports and dance, and also parental assessment of a child's activity level and amount of weekly aerobic activity. While measures of activity are themselves directly related to overweight-for example, children who are ''less active than other children'' are 13 points more likely to be obese-the activity measures are not related to a 14. Results are nearly identical if covariates are left uncontrolled. Notes: Linear probability models. Includes only student ineligible for subsidized lunch. Robust standard errors that allow for correlated residuals across students in the same school in parentheses.\nchild's school lunch status. 15 Further expanding the set of proxy variables to include variables that generally signal a ''high-quality'' home environment-such as trips to museums, whether a parent reads to the child, and TV viewing habits-showed no systematic difference between lunch buyer and brown bagger families. This suggests that at least along a wide variety of measurable dimensions the families are reporting similar investment behaviors in their children.\nUp to this point, this study has concentrated on the impact of additional calories consumed at lunch on a child's weight. But a person's body weight is a function of both calorie intake and calorie outflow, and it may be the case that children who brown bag their lunches also are for some reason more active and that is the true underlying cause of the weight disparity. While we cannot test the activity level of children directly, there are some indirect tests that can be conducted to shed light on whether differences in calorie expenditures could be driving the results. First, it is important to note that all results thus far have been estimated conditional on school fixed effects, so we would not expect differences in school-time physical activity to be driving the results-that is, since comparisons are made within school, all treatment and control students are likely subject to the same physical education requirements, regardless of school lunch status.\n16 But there may be important differences in nonschool activity levels that are correlated with lunch status. As noted above, however, the limited information on physical activities such as participation in sports and dance revealed no systematic difference between lunch eaters and brown baggers.\nAnother potential robustness check compares students who attend full-and halfday kindergarten. If school lunches were causing an increase in obesity, then the gap between school lunch buyers and brown baggers should not open up during kindergarten for half-day kindergarten students who do not yet eat lunch at school. In Columns 5-8 of Table 3 , students are separated by whether their kindergarten was full-or half-day, and lunch status is assigned based on first grade behavior for all students. School lunch eaters from full-day kindergartens (Column 5) are more likely than their schoolmates to be obese at the end of kindergarten, while half-day kindergartners (Column 7) have the same obesity rates as their classmates. The coefficient on school lunch is larger for both groups at the end of first grade (see Columns 6 and 8), though the differences are only suggestive and not statistically significant.\nThe effect is also similar when child weight status is measured differently, as shown in Table 4 . Measuring BMI in levels or logs (Columns 1-6) produces qualitatively similar results, and suggests that school lunch eating causes a 1 percent increase in BMI. Redefining the outcome of interest from ''obese'' to ''overweight'' (which is defined by the Centers for Disease Control as the 85th percentile of a fixed distribution of BMI conditional on age and gender, instead of the 95th percentile which is the cutoff for obesity) shows similar results (Columns 7-9), and indicates that school lunch increases the probability of a student being overweight by about two percentile points. Limiting the sample only to obesity ''movers''-that is, only including those who move from obesity in kindergarten to nonobese by the end of 15. One serious drawback of these measures is that they are measured at the end of kindergarten and not at baseline. 16. Although, students who buy their lunch may have to wait in line, and this may cut into their after-lunch recess time. No direct measure of this is available in the data. \n(8) Notes: All specifications include full covariates and school fixed effects. Sample consists of all students ineligible for free lunch. Robust standard errors that allow for correlated residuals across students in the same school in parentheses.\nfirst grade, and vice versa -reveals that school lunch eaters are much more likely to move into obesity (see Column 10)."}, {"section_title": "17", "text": "Another potential problem is that the measure of school lunch participation might proxy for participation in the School Breakfast Program (SBP), and the resulting measured effect might confound the impact of both programs. The correlation between school breakfast and lunch is much more severe among students eligible for free-or reduced-price lunches (and this is addressed in more detail below) than it is among the noneligibles included in this section of the analysis. About 10 percent of the children in this sample eat a school breakfast, and 75 percent of them attend a school that offers the SBP. School lunch participants are six percentage points more likely to participate in the SBP than brown baggers. To separate the impacts of SBP from the lunch program, I take two approaches: first, I control directly for SBP participation, and second I exclude all students who participate in the SBP. The effects of school lunch on obesity are essentially unchanged by these robustness checks. Table 5 extends the analysis through fifth grade. Columns 1-4 show that by the end of third grade lunch eaters are 2.3 percentage points more likely to be obese, are six percentage points more likely to be overweight, and have a 2.8 percent higher BMI. The results are similar or a bit larger by the end of fifth grade (Columns 5-8), with lunch eaters' obesity rates about 4.5 percentage points higher than brown baggers, and rates of overweight 6.7 points higher. The effect on mean BMI is 3 percent. Note that here (for comparability to earlier tables) the treatment is still defined as school lunch participation in first grade, but participation is very highly correlated over time. If treatment is defined instead by current-year lunch participation, the results look quite similar."}, {"section_title": "B. Approach Two: Regression Discontinuity", "text": "Another approach to isolating the causal impact of school lunches on obesity is to leverage the (theoretically) sharp eligibility cutoff for school lunch subsidies. By the rules of the program, if a student's family has income less than 130 percent of the Federal Poverty Line (FPL) the student is entitled to receive school lunch without cost. Students with incomes between 130 percent and 185 percent of the FPL are eligible for a reduced price lunch. The reduced-price charged varies somewhat by school, with an average price charged of 38 cents and a maximum allowable price of 40 cents (Fox et al. 2001) . Above 185 percent of the poverty limit the price reverts to ''full'' price, on average $1.66 per lunch for elementary schools (School Nutrition Association 2007). This means that students at 184 percent of the poverty limit face a dramatically different price for lunch than students at 186 percent of the poverty limit. This large difference in lunch prices faced by students who have similar levels of family income suggests a regression-discontinuity (RD) design (see for example Hahn, Todd, and van Notes: Sample size is 2,935. Linear probability models. School fixed effects are included in all columns. Includes only students ineligible for free lunch. Robust standard errors that allow for correlated residuals across students in the same school in parentheses. Covariates include mother's education and employment, child age, gender, birthweight, premature birth indictor, participation in income support programs, Head start participation, income category, and presence of a father.\nTo clarify the proposed framework, suppose that the relationship between a child's weight and school lunch eating can be modeled using a constant treatment effects model:\nwhere y i is a measure of the student's weight or obesity status, D i is an indicator variable for whether the student eats school lunch, R i is the student's family income measured as income-to-poverty ratio, and v i is a vector of other covariates that influence child obesity. The key to the approach is that students are discontinuously likely to participate in the school lunch program as their family income moves above the subsidy threshold, R 0 , of 185 percent of the FPL. This case is often called a ''fuzzy'' regression discontinuity, because the probability of treatment varies discontinuously around rule, but the rule is not deterministic (that is, not all children below the cutoff are forced to eat a school lunch, and those above the cutoff are allowed to eat a school lunch). The treatment in this case is a price reduction, but students ineligible for the subsidy may still purchase the exact same lunch for a higher price. The impact of the subsidy rule on lunch participation is therefore given by\nSimilarly, the impact of the lunch subsidy on a child's obesity status is given as\nTherefore, in order to uncover the estimated impact of school lunch on obesity rates, one must ''scale up'' the impact on obesity by the change in lunch eating rates around the subsidy cutoff using the Wald estimator u ¼ u/g.\nTo implement this approach, I regress various dependent variables on a 4 th order polynomial in R i , an indicator variable S i for whether the child is income-eligible for the lunch subsidy (that is, R i < R 0 ), and in order to improve precision I include a vector of covariates including age, race, and gender."}, {"section_title": "18", "text": "Results are shown in Table 6 , and graphically in Figure 1 . Results for the end of first grade are shown in Panel A of the Table. Using the RD approach, students just eligible for a school lunch subsidy are two percentage points more likely to be obese than students just on the other side of the income cutoff. For a sense of the magnitude of this finding, Column 3 displays the mean obesity rate of children near the cutoff; lunch eaters are about 16 percent more likely to be obese. Using log(BMI) as the dependent variable, the impact of school lunches is about a 1 percent increase in weight. Income-eligible students are much more likely to report receiving the lunch subsidy, but only about five percentage points more likely to report eating a school lunch. The lunch-eating rate among low income students is universally very high, with 82 percent of students from families with incomes just above the threshold participating in the school lunch program. There is a statistically significant 18. The results are similar if higher-order terms of R are included, if the covariates are omitted, or if S and R are fully interacted. discontinuity at the lunch cutoff in both lunch eating and in weight measures. Column 4 reports a falsification exercise, using a fictional cutoff threshold of 200 percent of the FPL, which is not actually associated with any change in lunch eligibility. There are no observed discontinuities in weight measures or lunch-eating measures, or on predetermined characteristics, when this fictional cutoff is used."}, {"section_title": "19", "text": "Panel B repeats the exercise with body weight measures and lunch participation information measured at the end of fifth grade. Because the income-to-poverty ratio is measured based on the family's income when the student was in kindergarten, the results are noisier as the student's grade level increases. Overall, students near the subsidy cutoff are much more likely to be obese by fifth grade (27.9 percent vs. 12.5 percent in first grade), but there is no longer a sharp difference in obesity rates on either side of the subsidy cutoff. There is still a jump in log(BMI) associated with the lunch subsidy threshold of a similar magnitude to the one found at the end of first grade, though the precision declined somewhat. The identification strategy employed here hinges on the notion that once the impact of income is controlled in a smooth manner, the remaining discontinuity in variables located at the lunch subsidy threshold is caused by the lunch subsidy. If families that particularly value the school lunch subsidy can alter their incomes (or reported incomes) to fall just below the threshold, though, the strategy would be invalid. To test the validity of the approach, I present several pieces of evidence that there is no obvious sorting into the subsidy around the neighborhood of the threshold.\nAs a test of the RD design, Panel C repeats the exercise for several pre-determined variables. If the design is legitimate, the pre-determined characteristics should not show discontinuities around the threshold. On the other hand, if certain types of families were more likely to fall just below the cutoff then there may be something else causing the discontinuity the income level equal to 185 percent of the FPL, such as sorting into the program or other programs with the same income eligibility cutoff. For example, some Medicaid/SCHIP programs have eligibility cutoffs at 185 percent of the poverty line, and one may be concerned that this approach may be picking up the effect of those other programs. 20 As shown in Panel C, there is no measured discontinuity at the subsidy cutoff along a wide variety of measures: race, test scores, family structure, or reported insurance status. Importantly, as shown in Figure 1 , there is no difference in baseline (that is, Kindergarten entry) obesity and weight, but the difference appears by the end of first grade. This suggests that the treatment identified in the RD approach is administered after school entry. Unfortunately, the treatment identified here might encompass more than school lunch and may also include school breakfast, as discussed further below.\nAnother test of the approach's validity is whether the density of R is discontinuous around the subsidy threshold, which might indicate self-selection to below the cutoff. There is some evidence in other studies that children from income-ineligible families receive the subsidy at surprisingly high rates -possibly as a result of families purposely under-reporting their income in order to qualify under lax eligibility rules. To qualify for the lunch subsidy, parents report their income and family size (or their TANF or food stamp case number) to their school at the beginning of the year. No documentation of income is required, though a random subset of eligibles is selected to provide followup at a later time in the school year (Burghardt et al. 2004) . A recent Department of Agriculture report (FNS 2003) found that after children receiving subsidies provided income verification, almost 20 percent were receiving a subsidy more generous than their eligibility implied. 21 The potential for this to be a problem in the data used here is smaller, since incomes are being 20 . Only a few states use 185 percent of the poverty line as the income cutoff for insurance for children in the ECLS cohort. States with 185 percent cutoff lines for seven-year-olds in the year 2000 are: CO, IL, IA, NE, OK, VA, and WI. 21. This could be due to inaccurate reporting when they qualified for lunches, or could represent variation in income over the school year between when they originally qualified and when the followup was done (Dahl and Scholz 2005). reported to an independent survey and there is little incentive to misreport one's income level to appear eligible for any programs. In fact, 34 percent of students with reported income between 185-230 percent of the FPL report receiving a subsidized lunch. 22 There is no apparent discontinuity in the measured income distribution around the subsidy threshold."}, {"section_title": "23", "text": "As described above, to account for the ''fuzzy'' nature of this discontinuity, the program impact is measured as the ratio of the impact on weight outcomes to the increase in lunch participation. The resulting point estimate of the impact at the end of first grade is too large to be credible -that is, for the obesity indicator the estimate is 0.020/0.047 ¼ 0.426, implying that school lunches increase the likelihood of obesity by 43 percent. The standard errors on these estimates are large, though, implying a 95 percent confidence interval between -14 percent and 100 percent. The results for BMI are similarly large but imprecise, the point estimates imply a 13 (12) and 29 (27) percent increase in body mass index by the end of first and fifth grades, respectively (standard errors of the Wald estimates in parentheses).\nThere are several reasons why the RD may overstate the true causal impact of the school lunch program. For one, students eligible for free or reduced price lunch are much more likely to eat a school breakfast. Using the same RD setup, students just under 185 percent of the poverty line are 12 percentage points more likely to eat school breakfast (on a base rate of almost 50 percent among students near the eligibility threshold), and school breakfast has been shown to substantially increase the caloric intake of children at breakfast (Devaney and Stuart 1998) . As a result, the RD results are almost certainly capturing the effects of both school lunches and school breakfasts.\nIn addition, if there are reporting errors in the measure of lunch consumption, the difference in lunch eating rates on either side of the subsidy threshold could be understated. One potential approach to address this is to calculate the Wald estimator using the mean difference in lunch eating rates on either side of the subsidy cutoff, instead of using the RD to identify the difference. Using observations with incomes between 85 and 285 percent of the Federal Poverty Line, the difference in lunch eating rates more than doubles to 9.5 percentage points, but the difference in obesity rates or log(BMI) is little changed from the RD approach. Calculating the Wald estimator using this approach brings down the estimate to a more reasonable (but still large) 20 percent increase in the obesity rate at the end of first grade. With the caveats that the results may be conflating the effects of breakfast and lunch, and that the standard errors on these estimates are large, it seems that overall the RD approach supports the hypothesis that school lunches have a positive, causal impact on students' body weight."}, {"section_title": "V. Are the Impacts Plausible?", "text": "The overall finding of this paper is that children who eat a school lunch are substantially more likely to be obese. In this section, I examine evidence on the plausibility of this finding by comparing reported calorie consumption at lunch by lunch status, and simulating the potential effect of extra calories consumed on child weight. I find that, on average, students eating a school lunch consume an extra 40 calories per dayall at lunch -and holding all else constant, that increase could account for a weight gain consistent with the results presented earlier."}, {"section_title": "A. Measuring Calories in School Lunches", "text": "In order to measure the difference in average calories consumed by brown baggers and school lunch eaters, I present results from a dietary recall survey collected as part of the NHANES III data set, a nationally representative health data set collected by the Centers for Disease Control spanning the years 1988-1994. Using dietary recall data is often problematic because food consumption is notoriously underreported (though it may actually be over-reported for young children).\n24 Furthermore, the very act of recording it is known to alter one's food intake. These problems may be attenuated in this case because I am measuring the difference in calories. If calories are underreported by the same amount by both groups of children, for example, the difference in calories would still be accurate. 25 Table 7 presents regression results where the first dependent variable is the number of calories consumed at lunch, and the second is all nonlunch calories consumed. The sample is limited to weekdays not during the summer.\n26 Students report -and I use as the school lunch variable -whether they eat school lunch ''every day'' or ''most days;'' there is no direct information about whether they ate the school lunch on the particular days that the food diary was collected. In addition, defining what is ''lunch'' is nontrivial, so I take several approaches. The food diaries collect information on what is eaten, when, where, and how the eater would categorize it (for example, breakfast, snack, etc.). One measure of ''lunch,'' of course, is everything eaten that the respondent categorizes as ''lunch.'' One problem arises with this definition because there are multiple words in Spanish for lunch -some children report the noontime meal as ''almuerzo'' while others report it as ''comida.'' Unfortunately, ''comida'' can also be used to describe other meals, so a definition that incorporates these three categories (lunch, almuerzo, and comida) as ''lunch'' will also contain an 24. For example, Cutler, Glaeser, and Shapiro (2003) simulate that if American men were really consuming the number of calories reported in NHANES food diaries, they would have an average weight of a mere 108 pounds. 25. It is possible that school lunches are more accurately reported if, for example, the family has a school lunch menu that they use as an aid when reporting the child's intake. On the other hand, if a parent packed the child's brown bag lunch then they may have a similarly good recollection of the child's intake. 26. There is no direct measure of whether the diary day is a ''school day,'' though the location of the consumption (for example, ''at school'') is reported. evening meal in many cases. To address this problem, one can instead define ''lunch'' as anything eaten around noontime, regardless of the name of the meal. It turns out that because of tight school and cafeteria schedules, some students eat lunch as early as 10 AM. 27 As a result, defining ''lunch'' as anything eaten between 10 AM (after breakfast for the most part, but early enough to catch early lunch times) and 1:30 PM (before after-school snacks, but late enough for late lunch shifts) appears to be a reasonable definition, and is my preferred method."}, {"section_title": "28", "text": "As shown in Table 7 , students in the NHANES who eat a school lunch daily appear to consume 46 more calories at lunch than those who regularly brown bag their lunch, but consume the same number of calories at other times of the day. That is, controlling for observable characteristics such as age, race, gender, parents' BMI and family size, school lunch eaters consume about 46 extra calories per day, but this additional consumption comes entirely at lunch. 29 These estimates are rather imprecisely estimated, but are broadly consistent with USDA evaluations of the National School Lunch Program. For example, Gleason and Suitor (2001) find (using a different dietary recall data set, the Continuing Survey of Food Intakes by Individuals, or CSFII, 1994-96) that school lunch participants consume up to an extra 120 calories per day at lunch."}, {"section_title": "B. Measuring the Potential Effect of Additional Calories", "text": "Are as few as 40 extra calories per day enough to cause a measurable difference in obesity rates in children? Following the approach in Schofield, Schofield, and James (1985) , I simulate the potential impacts of additional calories for first graders, based on the following equation where K is caloric intake in kilocalories, and W is weight in kilograms. The constants a and B represent the Basal Metabolic Rate for females and males ages 3-10, and vary only by gender in the current simulation. E is the energy expenditure constant, which represents the amount of physical activity the children engage in; calories burned through physical activity depend both on E and on the child's weight. 31 The final term 27. Many of the students who eat lunch early in the day (reasonably!) report the meal as a ''snack'' and report eating ''lunch'' either after school is over or not at all, so the category-based definition of lunch would have excluded these students' participation in the school lunch program. 28. Another method that seems reasonable at first glance is to separate all food consumed at ''school'' and at ''nonschool.'' but this inadvertently includes school breakfasts and any after-school snacks eaten at school during after-school programs or sports events. 29. It is worth noting that this does not imply that brown baggers themselves eat a ''healthier'' lunch, just that they eat fewer calories than NSLP participants. The number of calories consumed does not indicate whether the food packed is largely prepackaged or is a homemade sandwich and fruit, and in fact evaluations of the school lunch program (for example, Gleason and Suitor, 2001 ) often find that nutrient intakes are higher among school lunch participants. 30. This is similar to the simulations in Cutler, Glaeser, and Shapiro (2003) . 31. In the simulation, I hold constant the amount of physical activity when more calories and weight are added. In reality, children may be less active if they weigh more, and this method would therefore understate the increase in obesity from extra calories.\nin the equation represents the thermic effect of food-that is, the calories burned from eating and digesting food. The equation takes into account the fact that when one weighs more, one also expends more calories to maintain that weight, so a sustained increase in calorie consumption can lead to a new (heavier) equilibrium weight.\nResults from the simulation are presented in Table 8 . If a typical first grader consumes just an additional 40 calories per day, then the rate of obesity will increase by 1.7 percentage points in equilibrium. As a result, if the magnitudes of calorie differences calculated in Table 7 are correct, we could easily expect to observe school lunch eaters' obesity rates to be about two percentage points higher than brown baggers' rates, all else equal. If the number of additional calories consumed in response to school meals is as large as 120 per day, the difference in obesity rates could be as high as seven percentage points. In either case, the seemingly small difference in calories-if consumed every day -could lead to a measurable increase in overweight."}, {"section_title": "32", "text": ""}, {"section_title": "VI. Potential Impacts on Hunger", "text": "It appears that school lunches substantially increase the probability that a child is obese, and this suggests that making school lunches less caloric might be a possible policy intervention to reduce childhood obesity. But since the school lunch program's mission (at least historically) is primarily to combat hunger, it is important to also consider the potential impact of any policy changes on the underfed. For example, reducing calories served by 40 across the board increases the simulated rate of underweight by 0.5 percentage points-from 1.4 to 1.9.\nOne potential method to address hunger is through the school breakfast program. Fifteen percent of children who are underweight and from low-income families attend schools that do not offer the school breakfast program, even though they participate in the school lunch program. In addition, underweight students who do attend schools with a breakfast program are less likely to participate in the program than their classmates who are not underweight. Encouraging eligible students to enroll in the school breakfast program (and encouraging schools to offer the program) could be one route to offsetting any increase in underweight or hunger associated with reducing calories in school lunches.\nIt also appears to be the case that -as shown in Table 9 -schools with a higher fraction of low-income students already serve lunches that are lower in calories and higher in nutrients. 33 On average, schools from the lowest quartile of low-income students serve lunches with about 80 more calories than schools in the highest quartile. Other nutrition measures -such as meeting the standards for iron, calcium and vitamins, or keeping the percentage of calories from fat below 30 percent -are either flat or improve as the fraction of low-income students increases. This implies that an intervention in favor of healthier lunches may be best targeted at higher-income schools, which are less likely to have students suffering hunger."}, {"section_title": "VII. Conclusions", "text": "It appears that school lunches increase students' weight and the chance that they are classified obese or overweight. In this paper, I presented results from two different approaches to isolate the impact of school lunches on children's weights. First, limiting attention to students ineligible for free or reduced-price lunches, I find that students who eat school lunch gain more weight after starting school than students who brown bag their lunches, and that these differences cannot be explained by a wide variety of observable background characteristics. Second, concentrating on students on either side of the cutoff for a school lunch subsidy, I find that students just eligible for free or reduced price lunch enter kindergarten with the same BMI and obesity rates as those who are just ineligible for the subsidy, but that at the end of first grade they are significantly heavier. Analysis of food dietary recall data suggests that school lunch eaters consume more calories at lunch than brown baggers, and a simulation of the relationship between weight and caloric intake indicates that as few as 40 additional calories per day could lead to a two percentage point difference in obesity rates among children. School lunches can explain only a small part of the overall obesity rate, and are not a strong candidate for describing the cause of the large and rapid increase in the obesity rate over the last three decades. In addition, the results should be interpreted with caution, as they are estimated based on a group of young elementary school students who likely have less autonomy over their food choices than older students and might not be easily generalized to an older population. Nonetheless, these results suggest a potential role for public policy to address childhood obesity by encouraging or potentially mandating changes in school lunches."}]