[{"section_title": "Abstract", "text": "Introduction Automated brain MRI morphometry, including hippocampal volumetry for Alzheimer disease, is increasingly recognized as a biomarker. Consequently, a rapidly increasing number of software tools have become available. We tested whether modifications of simple MR protocol parameters typically used in clinical routine systematically bias automated brain MRI segmentation results. Methods The study was approved by the local ethical committee and included 20 consecutive patients (13 females, mean age 75.8 ± 13.8 years) undergoing clinical brain MRI at 1.5 T for workup of cognitive decline. We compared three 3D T1 magnetization prepared rapid gradient echo (MPRAGE) sequences with the following parameter settings: ADNI-2 1.2 mm iso-voxel, no image filtering, LOCAL− 1.0 mm isovoxel no image filtering, LOCAL+ 1.0 mm iso-voxel with image edge enhancement. Brain segmentation was performed by two different and established analysis tools, FreeSurfer and MorphoBox, using standard parameters. Results Spatial resolution (1.0 versus 1.2 mm iso-voxel) and modification in contrast resulted in relative estimated volume difference of up to 4.28 % (p < 0.001) in cortical gray matter and 4.16 % (p < 0.01) in hippocampus. Image data filtering resulted in estimated volume difference of up to 5.48 % (p < 0.05) in cortical gray matter. Conclusion A simple change of MR parameters, notably spatial resolution, contrast, and filtering, may systematically bias results of automated brain MRI morphometry of up to 4-5 %. This is in the same range as early disease-related brain volume alterations, for example, in Alzheimer disease. Automated brain segmentation software packages should therefore require strict MR parameter selection or include compensatory algorithms to avoid MR parameter-related bias of brain morphometry results. "}, {"section_title": "Introduction", "text": "Automated volumetry of brain magnetic resonance imaging (MRI) data is progressively recognized and used as biomarker for early detection and diagnosis. The currently best established example is hippocampal volumetry in mild cognitive impairment (MCI) and Alzheimer dementia (AD), which has become part of the latest generation of diagnosis recommendations from the National Institute on Aging and the Alzheimer's Association workgroup [1, 2] . Consequently, an increasing number of brain MRI segmentation tools are available. Most of the established tools which have been available for many years, including SPM (www.fil.ion.ucl.ac. uk/spm/software/spm12) and FreeSurfer (freesurfer.net), are clearly targeted for an academic setting and are usually used for group studies, comparing a group of patients versus a group of controls, typically acquired on the same MRI scanner. More recently, several cloud-based analysis tools became available, e.g., VolBrain (http://volbrain.upv.es), appMRI Hippocampus Volume Analyzer (www.mcmri. com), Biometrica AD (www.jung-diagnostics.de), Neuroreader (www.brainreader.net), and NeuroQuant (www. cortechslabs.com/neuroquant). These tools represent a fundamental paradigm shift, as now a radiologist can easily upload the 3D T1-weighted dataset of a given patient acquired on the local MRI machine, which is then compared to the reference database in the software tool. This raises the question whether differences in basic MR sequence parameters may systematically bias the automated volume estimation.\nTo address this question, the current investigation directly compares 3D T1 magnetization prepared rapid gradient echo (MPRAGE) protocols with different parameters acquired during the same imaging session for workup of cognitive decline.\nThe Alzheimer's Disease Neuroimaging Initiative (ADNI) [3] defined MR imaging standards [4] (http://adni.loni.usc. edu/methods/documents/mri-protocols) that include a highresolution MPRAGE sequence with high signal-to-noise ratio (SNR) and gray/white contrast-to-noise ratio; notably, this definition dates back several years [5] . As most analysis tools use the ADNI dataset as reference database, this type of image quality is intrinsically implied in most of these tools. In contrast, many radiologists using current-generation MRI systems prefer higher spatial resolution of 1.0 mm iso-voxel or even higher. We therefore directly compared these two different spatial resolutions.\nAnother parameter that may change the image contrast is the presence or absence of an image edge enhancement filter, which results in a subjective difference in the MR image perception. The use of this filter is variable and depends on the preference of the radiologist; we therefore assessed whether this image filter may bias automated brain volumetry.\nTo ascertain that the results are not the effect of a given single software analysis package, we analyzed all data with two different software packages to confirm the generalizability of our observations."}, {"section_title": "Material and methods", "text": "The study was approved by the local ethical committee and included 20 consecutive patients (13 females, mean age 75.8 ± 13.8 years) undergoing brain MRI for workup of cognitive decline. We explicitly chose a group of elderly individuals undergoing MRI workup of cognitive decline rather than a group of young healthy volunteers to assess the effect of MR sequence parameters on automated volume estimation in a real-world scenario."}, {"section_title": "MR imaging", "text": "MR imaging was performed on a whole-body 1.5 T clinical MR scanner (MAGNETOM Aera, Siemens Healthcare, Erlangen, Germany) using a 20-channel head/neck coil. Three different 3D T1-weighted sagittal volumes were obtained using the MPRAGE pulse sequences (see Fig. 1 ) using the imaging parameter settings described in Table 1 . All patients were scanned with ADNI-2 and LOCAL+ protocols. In order to study the effect of edge enhancement filter, unfiltered images were saved additionally to filtered ones for a subset of nine patients and are referred to as LOCAL− protocol. All MPRAGE scans underwent an automated quality assessment which is capable of detecting image degradation from bulk motion, blurring, and ghosting [6] . Based on the resulting quality indices, we excluded three patients. Overall, removing image volumes with low image quality resulted in a dataset of 17 patients with ADNI-2 and LOCAL+ protocols and 7 patients with LOCAL+ and LOCAL− protocols.\nAdditional MR sequences including axial T2, T2*, coronal FLAIR, and diffusion tensor imaging (DTI) were acquired during the clinical workup and analyzed to exclude spaceoccupying lesions such as meningioma, subdural hematomas, acute ischemia (DTI-derived b1000 trace and ADC), or other significant brain pathology."}, {"section_title": "Data analysis", "text": "The data from the three protocol variants was processed both with the in-house-developed automated segmentation framework MorphoBox [7, 8] and the FreeSurfer [9] software package (version 5.3.0) to compute volumes of the following brain tissues and structures: total intracranial volume (TIV), gray matter (GM), cortical gray matter (cGM), white matter (WM), hippocampus, ventricles, and cerebellum. Both packages were run on a 2.66 GHz Intel Xeon SixCore X5650 64bits Linux (Ubuntu 14.04.3 LTS) machine with 48 GB DDR3.\nIt is important to note that both MorphoBox and FreeSurfer segmentation tools were used with the default parameter settings, and no manual editing was applied at any stage of the segmentation process. An experienced observer visually inspected all segmentation results for gross segmentation errors."}, {"section_title": "Statistical analysis", "text": "The resulting estimated volumes per region were analyzed with the R software package (version 3.1.1).\nIn order to assess the presence of a potential systematic bias in the volumetric results, relative volume differences (RVDs) between the reference protocol (V r ) and each variant (V v ) were computed for each structure as\nwhere\nADNI-2 and LOCAL+ protocols were used as the reference protocol (V r ) in all subsequent analysis. Relative volume differences were averaged across the subjects. The statistical significance of the difference from the zero median in relative volumetric differences was tested using the Wilcoxon signedrank test, as the differences were not expected to be normally Fig. 1 Example of the three different parameter settings for the MPRAGE sequences in coronal, axial, and sagittal slices distributed. False discovery rate (FDR) correction was used to correct for multiple comparisons [10] . It has been shown that the variance of volume differences does not significantly change across different systems (different field strength, different vendors), but systematic offsets in volumes may be present [11] . Therefore, to compare our results to previously reported scan-rescan reproducibility studies [11] [12] [13] [14] [15] [16] [17] , absolute relative volume differences (ARVDs) between the reference protocol (V r ) and each variant (V v ) were recomputed for each structure as\nwhere ARVD(V r V v ) is in the range [0, 200 %]. ADNI-2 and LOCAL+ protocols were used as the reference protocol (V r ) in all subsequent analysis. Absolute relative volume differences were averaged across the subjects.\nNote that the RVDs correspond to systematic offsets in segmentation results and ARVDs represent the magnitude of errors."}, {"section_title": "Results", "text": "Effect of spatial resolution-1.2 versus 1.0 mm/contrast\nThe comparison of ADNI-2 versus LOCAL+ protocols with the FreeSurfer segmentation tool revealed significant changes in TIV, GM, WM, cGM, ventricles, and hippocampus volumes (see Fig. 3a ), even though they were barely visible upon visual inspection (see Fig. 2 ). The respective median RVDs were 2.34 % (p < 0.01), 3.11 % (p < 0.001), −2.62 % (p < 0.01), 4.28 % (p < 0.001), 2.04 % (p < 0.001), and −4.16 % (p < 0.01). For hippocampus volumes, the median ARVD was 4.16 ± 6.48 %.\nSegmentation results obtained with the MorphoBox segmentation tool revealed significant changes in TIV, WM, ventricles, and hippocampus volumes (see Fig. 3b ). The respective median RVDs were 1.77 % (p < 0.001), 2.00 % (p < 0.05), −0.97 % (p < 0.05), and 3.33 % (p < 0.05). For hippocampus volumes, the median ARVD was 3.39 ± 3.41 %."}, {"section_title": "Effect of image filtering", "text": "The comparison of LOCAL− versus LOCAL+ protocols with the FreeSurfer segmentation software revealed a significant change in TIV, GM, WM, cGM, and ventricle volumes. The respective RVDs were 0.12 % (p < 0.05), 1.22 % (p < 0.05), −1.72 % (p < 0.05), 1.25 % (p < 0.05), and −0.52 % (p < 0.05). The, median ARVD of the hippocampus volumes was 1.53 ± 9.05 % (see Fig. 4a ).\nIf the MorphoBox segmentation tool is used, there are significant changes in TIV, GM, WM, and cGM volumes. The respective RVDs were −0.27 % (p < 0.05), 5.40 % (p < 0.05), −3.24 % (p < 0.05), and 5.48 % (p < 0.05). The median ARVD of the hippocampus volumes was 3.39 ± 3.31 % (see Fig. 4b )."}, {"section_title": "Discussion", "text": "Basic MR sequence and image reconstruction parameters significantly modify automated brain volume estimation of up to 4.3 % in cortical gray matter and 4.2 % in hippocampus related to spatial resolution and contrast and up to 5.5 % in cortical gray matter related to image filtering. Equivalent results were obtained for two different software packages, indicating that this is not an effect of the post-processing tool. The majority of the currently available automated brain MR volumetry tools use the ADNI/ADNI-2 dataset as reference database, which consists of a 1.2 mm iso-voxel 3D T1w sequence with very strict parameters, but accept a wide range of parameter settings for the input dataset. The results of the current investigation imply that these tools should either restrict the input data to the same strict MR parameters or include compensation mechanisms [18] to exclude systematic bias in automated volume estimation related to different MR sequence parameters.\nIt is interesting to relate the size of the observed systematic bias to biological hippocampal volume differences, as hippocampal volumetry is an established biomarker for MCI and AD patients [1, 2] . There, two parameters are of particular interest: the absolute hippocampal volume and the rate of brain atrophy over time.\nAn instructive frame of reference for absolute hippocampal volume differences is provided by the study of Franko et al. which is based on the ADNI dataset [19] . As illustrated in Table 2 , the hippocampal volumes range between 1800 μl (AD patients) and 2400 μl (healthy controls). For the most important difference in the context of early diagnosis, notably MCI versus controls, the volume difference is on average −5.5 % (left) and −9.2 % (right). The variability introduced by varying MR sequence and reconstruction parameters is up to 4.2 % in the current investigation. It therefore represents a substantial and relevant misestimation. Note, however, that the interindividual variation in the absolute hippocampal volume is in the range of 20 % for each group, which clearly exceeds the average difference between groups. As a consequence, the absolute hippocampal volume provides significant differences between controls, MCI, and AD at the group level, yet the diagnosis at the individual level is impaired by this substantial inter-individual variability.\nDue to this high inter-individual variability in the hippocampal volume, the intra-individual rate of hippocampal volume loss over time has attracted growing interest, as this approach avoids the inter-individual variability and Fig. 3 Variability of the brain segmentation results for the effect of spatial resolution (1.2 versus 1 mm) and contrast by the comparison of ADNI-2 versus LOCAL+. Relative (left column) and absolute (right column) relative volume differences are presented as boxplots with median, interquartile range for Freesurfer (upper row) and MorphoBox (lower row). Whiskers extend to 1.5 times the interquartile range, and values beyond are indicated by dots. Note that the relative volume differences correspond to fixed offsets in segmentation results and do not represent scan-rescan variability of each protocol. TIV total intracranial volume, GM total gray matter, WM white matter, Cortical GM only cortical gray matter. *p < 0.05, **p < 0.01, ***p < 0.001; corrected for multiple comparisons estimates an intra-individual measure. A recent metaanalysis by Frisoni et al. includes nine investigations addressing the rate of hippocampal atrophy in a total of 645 AD patients and 348 controls [20] . The average rate of atrophy per year was 2.9-5.6 %, mean 4.25 % in AD, and 0.3-2-2 %, mean 1.25 % in controls, which results in a difference of on average 3 % atrophy per year between AD versus controls. This means that the methodological variability should be less than 1.5 % if baseline and follow-up investigations are done with an interval of 1 year.\nIn summary, these observations imply that the methodological variability of the brain MR volumetry should be below 1.5 % for the example of neurodegenerative Mean volume, standard deviation, variability, and comparison between groups. Adapted from [19] diseases notably MCI and AD. The variability of MR sequence and image reconstruction is however in the range of 4-5 %. This, in turn, implies that if brain MR volumetry results should be comparable between sites, the software analysis tools should either include compensation mechanisms to balance for MR parameter-related effects (which is however not trivial) or require strict MR protocols in order to obtain reliable and comparable brain volume estimations useful in particular for early diagnosis of neurodegenerative diseases. As we obtained equivalent results for two different software analysis tools, we assume that the observed results can also be generalized to other software post-processing tools. The currently most widely used application of automatic brain MRI morphometry is for early detection of AD, and we therefore conducted the study in the context of imaging workup of cognitive decline. In this context, hippocampal volumetry is of particular interest, as discussed above. However, we assume that automatic volumetry will have increasing importance in the future also for other diseases, such as frontal dementia, epilepsy, movement disorder, and psychiatric diseases. The different diseases will have different key regions, e.g., frontal regions for frontal dementia. Nevertheless, the fundamental concern of MR parameterrelated bias of automatic brain volume estimation remains valid for these other domains. The current study specifically assessed the variability of automatic segmentation related to modifications in MR parameters within the same session. Other related investigations assessed systematic bias in brain segmentation related to different MR systems [11] [12] [13] , retest reliability of repeated segmentation [21] , effects related to software version and operation system [22] as well as retest reliability of the same MR parameters [23] . Taken together, these results imply that a reliable automatic volumetry is possible only if all steps of the processing are strictly standardized, including patient positioning, MR parameters, data processing, and software version."}, {"section_title": "Limitations", "text": "One limitation of the current investigation is the small sample size. On the other hand, the presence of a significant and systematic bias relating to the sequence parameters despite the relatively small sample size implies the significant and reproducible effect of MR sequence and image reconstruction parameters on automated volume estimation. Moreover, we used two different software packages and found similar systematic effects for both software packages, again highlighting the systematic effect of MR sequence parameters on automated volume estimation. Another limitation is that we only tested two sequence/reconstruction parameters, notably spatial resolution and image filtering, which are very commonly different between different MR sites. We assume that multiple other MR sequence parameters also influence the automated segmentation, yet this remains to be clarified in future studies."}, {"section_title": "Conclusions", "text": "MR sequence parameters systematically bias automated volume segmentation results. To avoid systematic bias in particular with respect to early diagnosis of neurodegenerative diseases, we suggest that strict MR sequence and image reconstruction parameters should be respected for automated brain MR segmentation tools.\nCompliance with ethical standards We declare that all human and animal studies have been approved by the Geneva University Ethics Committee and have therefore been performed in accordance with the ethical standards laid down in the 1964 Declaration of Helsinki and its later amendments. We declare that the ethics committee waived individual patient consent."}]