[{"section_title": "INTRODUCTION", "text": "The National Agricultural Statistics Service's (NASS) mission is to provide timely, accurate and useful statistics on United States and Puerto Rico agriculture. NASS conducts hundreds of surveys for the purpose of making estimates on crops, livestock, production practices, economics, etc. The Agricultural Resource Management Survey (ARMS) is a multipurpose national survey conducted each year for varying commodities. ARMS is the primary vehicle by which NASS obtains data on chemical use and production practices for target commodities. ARMS also collects economic information used to assess the financial well-being of the agricultural sector. To optimize data collection efforts, NASS investigated using Global Positioning System receivers to obtain the latitude and longitude coordinates of the sampled agricultural fields containing the target commodity."}, {"section_title": "ARMS", "text": "The Agricultural Resource Management Survey provides information about agriculture's economic status and its impact on the quality of the environment. The ARMS is the primary source of economic data providing a true picture of the financial well being of all U.S. farms. The ARMS is composed of three phases. Phase I, conducted May through July, is the screening phase which determines whether the operation is in business, its type of operating arrangement, and whether the operation has those commodities targeted for the survey. Phase II, conducted October through December, focuses on chemical use and production practices on target commodities. The targeted commodities for 2004 were soybeans, peanuts, winter wheat, durum wheat and all other spring wheat. Phase III, conducted February through April of the following year, pertains to the financial condition of the farm sector, including income, expenses, assets, and debt. Operator characteristics are also collected."}, {"section_title": "PHASE II", "text": "Phase II of the 2004 Agricultural Resource Management Survey is the focus of the research project and this report. Operations sampled in Phase II are personally interviewed by field enumerators using paper questionnaires. For each selected operation, a substantial number of questions are devoted to collecting data on the targeted commodity in the sampled field. Historically, a field enumerator shows a county highway map to the respondent and asks him/her to point out the location of the sampled field (in particular the center point). The field enumerator then marks a red X for the field location and writes the operation's ID beside the X to identify it. Of course, this step of interpreting the location on the map and marking the map lends itself to human errors. After Phase II data collection is complete, the county highway maps are returned to the field offices. Next, office staff utilize the mapping software, DLG Map, to obtain the latitude and longitude coordinates of the red Xs recorded on the county highway maps. DLG Map is a digital street map software that displays roads, streams, and lakes. Office staff navigate within DLG Map and, to the best of their ability, mark the location that corresponds to the X on the county highway map. Overall this process is time consuming and also lends itself to human error. Next, DLG Map translates these Xs into latitude and longitude coordinates and creates a text file with the coordinates. This file is then sent to NASS' main data processing facility in Kansas City, Missouri. Finally, the DLG Map files from all states are reviewed by NASS Headquarters staff before being sent to the Economic Research Service (ERS), another agency of the United States Department of Agriculture, for further analysis. Geo-coding (linking multiple data sources together based on physical location) of the targeted fields is vital to ERS. These data allow ERS to better understand how farmers affect, and are affected by, soil quality, soil erosion, water quality, urban influence and climate. This knowledge is critical in making informed policy decisions. Specifically, ERS wants to be able to identify the exact location of the fields that the ARMS data come from so as to match these data with those obtained from the Farm Service Agency."}, {"section_title": "BIRTH OF A RESEARCH PROJECT", "text": "In July 2004 NASS' Washington Field Office (WA FO) asked NASS' Research and Development Division to research the practicality of using handheld Global Positioning System (GPS) receivers for the Agricultural Resource Management Survey -Phase II (ARMS II). The expectation was that using low-cost handheld GPS receivers to obtain the latitude and longitude coordinates would improve the quality of the data and enable the WA FO to save office time by not having to use the labor-intensive DLG Map software. Hence, the Washington Field Office and the Research and Development Division agreed to investigate the use of handheld GPS receivers for ARMS II in the hope of saving office staff time."}, {"section_title": "WHAT IS A GPS HANDHELD RECEIVER?", "text": "The Global Positioning System is comprised of at least twenty-four satellites orbiting the earth. These satellites transmit signals to GPS receivers on the ground. The majority of GPS receivers are about the size of a standard television remote control. A GPS receiver only receives signals from the satellites. It will not transmit. To function properly, a GPS receiver also requires an unobstructed view of the sky. First, the GPS receiver acquires signals from these various satellites. Next, the GPS receiver determines the location of the satellites from the information included in the satellites' transmissions. The receiver then determines the distance it is from each satellite. Finally, the receiver is able to determine where it is actually located on the Earth within a certain level of accuracy. The receiver displays its location in latitude and longitude coordinates. Latitude measures the distance north or south from the Equator while longitude measures the distance east and west from the Prime Meridian. A common use of GPS receivers is for hiking. Hikers utilize these receivers to trace their trail or to mark a unique location that they would like to return to at a later date. The particular GPS receiver selected was the Garmin GPS-72. See Figure 1. Garmin was selected since the company has been a respected manufacturer of GPS receivers for 15 years. The GPS-72 model was also among the lowest-price GPS receivers offering the Wide Area Augmentation System (WAAS). WAAS provides the potential to obtain a level of accuracy of ten feet. Typically, the GPS-72 receiver will provide a level of accuracy between 10 and 50 feet."}, {"section_title": "THE RESEARCH PROJECT", "text": "All thirty-three Washington FO field enumerators working on ARMS II were supplied with a Garmin GPS-72 receiver. Washington's 2004 ARMS II sample size was 300 agricultural operations. Winter wheat was the targeted crop. For all 300 agricultural operations, field enumerators were instructed to go to the edge of the field and, using their GPS receivers, obtain the latitude and longitude of the sampled field and record these coordinates on the paper questionnaire. Appendix A contains a copy of the page of the questionnaire where the coordinates were to be recorded. Although the goal is to obtain the center point of the field, entering the field was not required since fields are generally irregular in shape which would make determining the center point impossible. Also, NASS wanted to minimize the amount of intrusion in the fields to prevent any crop damage. Finally, it was deemed impractical to take multiple readings around a field's edge and calculate the center point through triangulation. The enumerators were also asked to record any mileage and time it took to access the field and obtain the latitude and longitude coordinates. These additional expenses were not incurred during the county highway map process since going to the sampled field was not needed. A copy of the Enumerator-GPS Receiver Usage Form is provided in Appendix B. For half of the samples (150), field enumerators were instructed to additionally proceed with their regular routine of recording where the sampled fields were located on the county highway maps. Additionally, the Washington FO was to record the amount of time and number of staff required to use the DLG Map software to obtain the latitude and longitude coordinates from the marked county highway maps. See Appendix C for a copy of the DLG Map Time Keeper Form."}, {"section_title": "ENUMERATOR TRAINING", "text": "Each year a survey workshop is conducted to train field enumerators on ARMS II data collection procedures and specifics of the questionnaire. Training these field enumerators to use the GPS receivers was incorporated into this workshop. Small group instruction was employed for teaching GPS receiver use, with each group consisting of a supervisory field enumerator and his/her enumerators. Hence, there were a total of six groups with approximately five enumerators per group. Training consisted of going outside and learning how the GPS receivers acquired satellites and operated. Each enumerator was also supplied with written instructions on how to operate the GPS receiver. The training lasted about 20 minutes per group and was incorporated into the workshop in such a way that while a particular group was learning their GPS receivers, the other groups were reviewing their survey manual. One statistician was responsible for all GPS training preparations and instruction which totaled three hours."}, {"section_title": "RESULTS", "text": "Two hundred eleven (70.3%) of the 300 operations sampled completed their ARMS II report. The 89 operations that did not have completed reports were due to the operator refusing to complete the questionnaire, the enumerator being unable to locate the operator, the operation being out of business, or the operation not having the targeted crop. Of the 211 completed reports, enumerators were unable to obtain coordinates for selected fields in only 22 cases (10.4%). The primary reasons cited for this were rainy weather making the fields inaccessible and agricultural operators not wanting enumerators in or around their fields. As far as the capability of the GPS receivers was concerned, there was only one account of the GPS receiver failing to acquire coordinates. The reason for this is unknown. However, a problem that a few field enumerators encountered was that when the GPS receiver's batteries started running out of power a \"low battery\" warning message would appear. This warning message overlaid the entire display. Thus, the installation of new batteries was required in order to continue using the receiver. Hence, carrying a spare set of AA batteries became a necessity. In general, the GPS receivers operated flawlessly. The enumerators also recorded their additional time and mileage to reach the field to record the latitude/longitude coordinates from the GPS receiver. The average additional time and mileage for an enumerator to obtain latitude/longitude coordinates was 20 minutes and 9 miles per field. See Figures 2 and 3 located on the following page. These statistics include 11 reports where time and/or mileage were incompletely reported. The missing data were estimated by using the average time and/or miles that the enumerator took for completing GPS readings at other operations along with any notes supplied on the enumerator's incomplete feedback form. This was done to achieve the best data set possible.  There were three outliers of time and mileage recorded by three enumerators for different fields. These are shown below: 150 minutes and 70 miles 120 minutes and 88 miles 120 minutes and 60 miles These three outliers were due to the general interview being conducted at night and the enumerator having to return the next day during daylight hours to access the field. Interviews in the evening will continue to be a fact of life since farmers often work from daylight to dark, and they are available for interviews only in the evenings. An oversight in the design of the enumerator feedback form was that it failed to ask for the additional time and mileage incurred in the 22 instances when the enumerators tried unsuccessfully to access the sampled fields and therefore could not obtain a GPS reading. This was brought to light when some of the enumerators ignored the form's skip patterns and completed the time and mileage anyway. Of the 150 sampled fields originally selected to be marked using both the county highway maps process (as well as the GPS receiver process), 98 were ultimately marked on county highway maps. An experienced statistician in the WA FO was assigned to use DLG Map to obtain the latitude and longitude coordinates for the Xs on the county highway maps. A little background information on DLG Map is worth noting. The software is an in-house package which was developed in 1991 by Martin Ozga of NASS. Basically, DLG Map is a road map software that displays roads, rivers/lakes, and railroads for each state. The user can zoom in at the county and street level to locate, to the best of his/her ability, the area that represents the X on the county highway map. The statistician, having DLG Map experience, spent 11.5 hours using DLG Map to obtain the latitude and longitude coordinates for the 98 Xs marked on the county highway maps. This averages to seven minutes per county highway map point and was done over a period of three days."}, {"section_title": "DLG MAP & GPS RECEIVER COMPARISON", "text": "The method of using GPS receivers versus the county highway map & DLG Map process was compared. Of the 98 sampled fields marked on county highway maps, 93 also had GPS readings obtained. The difference of five fields was due to inaccessible fields or fields that the operators did not want the enumerators around. Hence, a total of 93 sampled fields had latitude and longitude coordinates obtained by both methods. First, the differences between the measurements of latitude and longitude of both methods were examined. All measurements are in degrees. A standard univariate paired t-test was performed on the observed differences for latitude and longitude recorded by the two methods, as well as a univariate student's t-test and ranked sign test of H o (Null hypothesis): no difference in latitude or longitude measurements versus H a (Research hypothesis): a positive absolute difference in the measurements. These tests were unable to detect any significant difference at the alpha level of 0.10 for either latitude or longitude. Simply stated, these tests didn't show any evidence of a statistical difference between the two methods. The inability of the tests to show any difference (even with removing the top four outliers) is probably due to the observed differences having very small means and relatively large variances, with coefficients of variation over 900 percent for longitude and latitude. See Table 1. The tests were conducted in degrees so that there would be the opportunity for positive and negative differences. Using miles would only have provided positive values since distance can not be negative. This would have caused the tests' results to be meaningless. Figures 4 and 5, located on the following page, show the dispersion of the differences in latitude and longitude between the two methods per field.  Next, the physical distance between the two methods' coordinates in miles were examined using a different approach. In Washington, degrees of latitude and longitude translate to the following: One degree of latitude is approximately 69 miles and one degree of longitude is approximately 47 miles. The Greater Circle Distance Formula was used to calculate the distance between the coordinates of the two methods. The formula, shown below, measures the number of miles between two points if the coordinates of those points are in decimal degrees. [ "}, {"section_title": "÷ ÷ ÷ ÷", "text": "This formula accounts for the curvature of the Earth instead of just calculating a straight line distance. Of the 93 comparable points, there was one dramatic outlier whose GPS receiver reading was 132 miles different from those provided by DLG Map. The average distance was 1.9 miles and the standard error was 4.2 miles, excluding the outlier. Twenty-nine points or 31 percent had over a mile difference between the two methods. Even if the level of accuracy of the GPS receivers were a dismal 50 feet= 0.01 miles, the amount of inaccuracy of the GPS receivers does not account for the difference between the two methods. See Figure 6 for a frequency distribution of the distance between the GPS Method and the DLG Map method. Finally, the winter wheat fields' sizes were examined. The average land area of the fields was 0.27 square miles. Hence, unless there was an unusually long skinny field, the same 31 percent of the coordinates, noted above, obtained by DLG Map would have no probability of falling inside the field that they are trying to represent. This percentage may actually be substantially greater but was unable to be statistically justified. Hence, the use of GPS receivers would improve the quality of the coordinates provided to ERS. This improved data quality would help ERS determine the actual field and thus improve their ability to accurately overlap other data with NASS ARMS II data. The estimated time saved in the field office by having the enumerators use GPS receivers is 19.1 hours. This was calculated by first taking the average amount of time it took to plot a point using DLG Map multiplied by the total number of completed reports, (7 minutes per point • 211 reports = 24.6 hours). However, 22 of the 211 completed reports did not have GPS readings and still would have needed to be DLG Mapped which is estimated at 2.5 hours, (22 • 7 minutes per point). Also, the statistician spent a total of three hours in preparing training materials and in training the field enumerators. Hence, the total staff time saved is 24.6 hours minus 2.5 DLG Map hours and minus the 3.0 hours of training which equates to 19.1 hours of total time saved in the field office. "}, {"section_title": "COST -BENEFIT ANALYSIS", "text": "Conducting a cost-benefit analysis on the research project allows NASS to determine whether expanding the use of GPS receivers to more FOs for ARMS II should be implemented or not. The total operational expenditures for the research project were $6,700 and three hours of a WA FO statistician's time. The cost breakdown follows. Thirty-five Garmin GPS-72 receivers were purchased for a total cost of $4,961. This provided each ARMS II enumerator with a GPS receiver and allowed for two spares. One spare receiver was held by the WA FO and the other by the Research and Development Division for additional studying. Miscellaneous expenditures are estimated at $100. This includes the purchase of spare AA batteries (2 extra batteries per enumerator), paper to print the GPS instructions on, etc. The cost incurred by the additional enumerator time in reaching the field and using the receivers (including salary and benefits) was $4.13 per sample field. This calculates out to a total of $780 in enumerator salary and benefits. The additional mileage incurred in reaching the sampled fields equated to $3.24 per field. At the time of enumeration, NASS' reimbursable mileage rate was 37.5 cents a mile. This expands to a total additional mileage cost of $613. The GPS training of the thirty-three enumerators (20 minutes per enumerator) was expensed at $130 (includes salary and benefits). Costs of the hotel and conference room were excluded since the GPS training was incorporated into the regularly held ARMS II workshop. Enumerator costs for the 22 instances where a GPS reading could not be obtained was estimated at $89. This was calculated using the following method. Eleven feedback forms contained a reason why the enumerator was unable to obtain a GPS reading. Four times, equivalent to 36 percent, the operator refused access to his/her fields. Seven times, 64 percent, the enumerator could not physically get to the field. Of these seven times, three had mileage and time costs. These costs were then expanded to cover the 4 reports that didn't have costs reported. This left 11 cases, 50 percent, unknown as to why a GPS reading was not obtained. Hence, by doubling the enumerator costs obtained for the eleven feedback forms having a reason, an estimated total cost of $89 was obtained. A more accurate cost could have been determined if more data were available. As far as additional WA FO staff expenses, a statistician spent one hour preparing training materials and an additional two hours in training the enumerators (six sessions at twenty minutes each). This calculates out to a total of 3 hours (two hours for training and one hour for preparation). One GPS receiver was not returned by a field enumerator. This enumerator was ultimately removed from service for performance and personnel issues. Although, this lost receiver is not included as an additional cost, the replacement cost will factor into the cost for next year. Hence, the total expenditures for the research project were $6,700 dollars and 3 hours of a WA FO statistician's time. See Table 2 for a complete overview of the costs. * All enumerator costs were based on each enumerator's actual time and salaries incurred. The average salary of the enumerators was $9.99 per hour. The average salary and benefits of the enumerators (using NASS' formula of (salary • 1.0763) • 1.11) calculates to $11.94 per hour. Enumerator mileage costs were calculated at NASS' reimbursable rate of 37.5 cents a mile. On the benefit side, using GPS receivers saved the WA FO statistician approximately 19.1 hours that the statistician could spend on a reimbursable project and/or working on or improving upon the state's agricultural statistics. Using GPS receivers to acquire the coordinates for the sampled field did not adversely affect the precision of the data. Based on the limited analysis able to be conducted, the GPS receivers appear to provide more accurate coordinates of the sampled fields than the current county highway and DLG Map method. The ability of the enumerators to record the latitude and longitude coordinates at the time of the interview allowed this information to be provided back to the office at the same time the questionnaires were returned. All points, except for the twentytwo points noted earlier, were available in NASS' system by December 21 st . Based on the statistician's workload, the WA FO could easily have had all of the latitude and longitude coordinates in the NASS system by January 15 th . Therefore, NASS could move up the due date on having these coordinates from March 15 th to mid January. Hence, this provides NASS the opportunity to shorten the due date of the coordinates by 60 days. Now, the question becomes does the $6,700 offset the improved accuracy of the sampled fields' coordinates, the ability to provide the data 60 days quicker, and the 19.1 hours in statistician time saved? At first glance, the answer is \"maybe\". The Economic Research Service which funds part of the ARMS Program would have to decide if this improved accuracy is worth additional funding, which goes beyond the scope of this report. Being able to provide the coordinates to ERS sixty days earlier is not helpful to them since the coordinates are not useful without the survey data. However, this earlier date does change the DLG Map process from a post-survey activity to a task that can be accomplished during the survey. Hence, there would be one less post-survey activity that would need to be completed before closing out the survey. As far as the 19.1 hours saved in staff time, this provides the statistician with more time to analyze data and thereby improve the quality of the FO's estimates/products or spend time working on reimbursable projects. Also, GPS receivers can be re-used for future years' ARMS II and for other projects. For example, the North Carolina Field Office has been using similar receivers for five years. Each year their cost of using the receivers is in enumeration expenses and a supply of batteries. Hence, the initial startup costs can be spread out over time. This is good news since the ARMS II is conducted yearly, assuming the State is in the operational program each year. If the WA FO were to conduct another ARMS II and the targeted fields' coordinates needed to be obtained, the cost would be around $2,035. The $2,035 projected cost was determined by summing the $1,600 of enumerator expenses, the $100 in miscellaneous supplies, $150 for a replacement GPS receiver and adding a lofty 10 percent rate of inflation. Table 3 shows the cost per year and the total cost spread out over 4 years. Years 2, 3 and 4's costs were calculated by assuming the same sample size, similar sample dispersion, and includes training expenses, replacement GPS receiver, field enumerator costs, mileage costs, replacement batteries, miscellaneous expenses, and a 10 percent rate of inflation. Hence, using the receivers over two years (for ARMS II only) would spread out the average cost per year to $4,370. Over three years the cost would be spread out to $3,660 a year, and so on. In year five (not shown in Table 3), it is predicted that some receivers may need to be replaced. At the same time, the savings in staff time would average 19.1 hours a year for a total savings of 76.4 hours of staff time over the four years. The bad news is that for 2006 the WA FO is not selected in the part of ARMS II that requires the coordinates of targeted fields to be recorded. This does hinder the ability to spread the initial start-up costs over time. However, the Washington Field Office and the Research and Development Division are investigating other ways to use the GPS receivers. Surveys such as the Wheat Objective Yield Survey, June Area Survey, and a reimbursable Fruit Tree Survey are all being investigated. All expenditures and benefits are based on the research conducted in Washington. The average miles and time spent to get to the sampled fields in other states may vary, depending upon the size and contiguousness of each farm. During the study, a suggestion was made about using state-GPS atlases in place of DLG Map for those cases where the enumerators had to mark the sampled fields on county highway maps. After the county highway maps have been returned to the office, the statistician would determine the best locations using the GPS atlas that represent the marks on the county highway maps and finally record the appropriate GPS coordinates. Hence, NASS would no longer need the DLG Map software. Feasibility of this suggestion would require additional investigation."}, {"section_title": "NASS' NEXT GPS STEP", "text": "The research project showed that the use of GPS receivers for ARMS II improved data quality and saved office staff hours. Hence, recommend implementing the use of GPS receivers for ARMS II. The county highway map process would continue for those instances when the fields are inaccessible or the GPS receivers fail to acquire coordinates."}, {"section_title": "CONCLUSION -FUTURE OF USING GPS RECEIVERS IN NASS", "text": "Using Global Positioning System receivers to obtain latitude and longitude coordinates forms the basis for linking multiple data sources based on physical location of a land area. This practice, commonly called geo-coding, is becoming an increasingly popular and powerful way to link a variety of data sets to conduct very sophisticated data analyses that otherwise would not be possible. In the summer of 2005, the Washington Field Office and the Research and Development Division will conduct two additional research studies involving GPS receivers. The first research study pertains to the Wheat Objective Yield Survey. The study focuses on the enumerators' perception of the usefulness of GPS receivers in assisting them in returning to a particular location in an operator's winter wheat field. The second research study pertains to the June Area Survey. The study will obtain the enumerators' perspective on using GPS receivers to help locate a particular land area to conduct their enumeration of the June Area Survey. Hence, the Research and Development Division and the Washington Field Office will continue to investigate additional opportunities in utilizing GPS receivers, thereby shortening the time frame to realize a positive return on investment. 3. We will need additional information to complete this study. We will contact you in February or March, 2005, to collect it. I'll call you then to set up a time that is good for you. "}, {"section_title": "CONCLUSION", "text": ""}]