[{"section_title": "Abstract", "text": "Background. Diabetes is associated with decreased muscle mass. The effect of higher levels of glucose and insulin on muscle mass has not been studied in individuals without diabetes. We sought to determine the relationship of insulin and glucose measurements from the oral glucose tolerance test (OGTT) with muscle mass in persons without diabetes.\nMethods. We analyzed data from 587 participants in the Baltimore Longitudinal Study of Aging (mean age 67.3 years, range 26-95 years) without diabetes who underwent a 2-hour OGTT, including glucose and insulin measurements taken every 20 minutes and assessment of midthigh muscle cross-sectional area by computed tomography, taken as a proxy measure of muscle mass. Linear regression models and Bayesian model averaging were used to explore the independent cross-sectional association of various OGTT-derived measures and midthigh muscle cross-sectional area, independent of confounders.\nResults. Individually, fasting glucose, fasting insulin, OGTT glucose (40, 60, 80, 100, and 120 minutes), OGTT insulin (20, 60, 80, 100, and 120 minutes), homeostasis model assessment of insulin resistance, integrated glucose area, and integrated insulin area were inversely associated, and the Matsuda index was positively associated, with the midthigh muscle cross-sectional area (standardized to body weight) after adjustment for age, sex, race, height, physical activity, and peroneal motor nerve conduction velocity (all ps <.05). When considered together, the Matsuda index and fasting glucose were the strongest predictors of lower midthigh muscle cross-sectional area after covariate adjustment.\nHigher fasting and OGTT values of both glucose and insulin are associated with lower muscle mass. Longitudinal studies are needed to verify whether individuals free of diabetes that have higher glucose and insulin during an OGTT are at risk for accelerated muscle mass decline with aging."}, {"section_title": "D", "text": "IABETES is associated with accelerated loss of both muscle mass and strength with aging (1-3). Low muscle mass and poor muscle strength, in turn, can lead to functional impairment in older adults (4, 5) . Diabetes-related sarcopenia may explain why older adults with diabetes have an increased risk of functional disability in a wide range of physical tasks compared with adults without diabetes, including significantly greater difficulties walking a quarter mile or lifting objects overhead (6, 7) . Recent literature has found that glucose intolerance and insulin resistance are correlates of muscle strength even in individuals without diabetes (8) (9) (10) ; however, similar correlations with muscle mass have not been previously investigated in persons without diabetes.\nAssociations between higher glucose and/or insulin levels and muscle strength have been reported among older adults without diabetes signifying that chronic exposure, independent of the diagnosis of diabetes, can affect muscle function. A significant correlation between higher fasting insulin levels and lower handgrip strength has been reported in older men without diabetes in cross-sectional and prospective analyses (8) . Insulin resistance is also negatively associated with quadriceps strength in older adults without diabetes (9) . Among both men and women, higher quartiles of 2-hour glucose are significantly associated with lower grip strength across the range of normal glucose tolerance values (10) . These findings suggest that higher levels of glucose or insulin (reflecting decreased peripheral insulin sen- 2 Chee W. Chia, 2 Christopher D. Saudek, 1 and Luigi Ferrucci 2 sitivity or insulin resistance) may also be the mechanism by which diabetes causes accelerated decline of muscle mass. A critical step in testing this hypothesis is to verify whether the degree of glucose tolerance, as assessed, for example, by an oral glucose tolerance test (OGTT) and/or insulin sensitivity is associated with muscle mass independent of potential confounders. As far as we know, this hypothesis has not been previously tested.\nIn the present study, we sought to comprehensively examine and contrast the associations of various fasting and OGTT-derived glucose and insulin measurements with lower extremity muscle mass in participants of the Baltimore Longitudinal Study of Aging who were free of diabetes."}, {"section_title": "Research design and methods", "text": ""}, {"section_title": "Study Population", "text": "The Baltimore Longitudinal Study of Aging is a longitudinal cohort study conducted by the Intramural Research Program of the National Institute on Aging, National Institutes of Health, since 1958. Baltimore Longitudinal Study of Aging participants are community-dwelling men and women recruited primarily from the Baltimore-Washington, DC, area with above-average education, income, and access to medical care (11) . From 1958 to 1978, the initial cohort was exclusively men; since 1978, women have been included. Participants underwent extensive evaluations at predefined intervals. A total of 587 participants (aged 26-95 years) who had recent OGTT results (complete glucose measurements at 0, 20, 40, 60, 80, 100, and 120 minutes) and computed tomography (CT) of the thigh performed on the same visit between the years 2006 and 2010 were included in this study. Individuals with diabetes (fasting glucose ≥126 mg/dL, 2-hour OGTT glucose ≥200 mg/dL, self-reported history, or current use of oral hypoglycemic agents or insulin) were excluded. Only participants with normal glucose status or prediabetes (fasting glucose 100-125 mg/dL and/or 2-hour OGTT 140-199 mg/dL) were included. The research protocol was approved by the Intramural Research Program of the National Institute on Aging and the Institutional Review Board of the MedStar Health Research Institute, Baltimore, Maryland. All participants provided written informed consent."}, {"section_title": "Oral Glucose Tolerance Testing", "text": "Participants stayed overnight on the research unit and received the OGTT the next morning after a 10-hour fast. Blood samples were drawn at 0 (fasting) and at 5, 10, 15, 20, 40, 60, 80 , and 120 minutes after consuming 75 g of glucose. Participants on steroid treatment within 3 months prior to study visit were excluded from the OGTT. Plasma glucose levels were measured using a glucose analyzer (Beckman Instruments, Brea, CA). Plasma insulin was measured using enzyme-linked immunosorbent assay (Mercodia, Uppsala, Sweden). The inter-and intra-assay coefficients of variation for insulin using this assay were 2.6%-3.6% and 2.8%-3.4%, respectively.\nThe 587 study participants had 5,804 glucose observations for analysis as follows: fasting, n = 587; 5 minutes, n = 565; 10 minutes, n = 565; 15 minutes, n = 565; and 20 minutes through 120 minutes, n = 587 at each time point. Among the 587 participants, there were 3,928 insulin observations as follows: fasting, n = 579; 5 minutes, n = 239; 10 minutes, n = 247; 15 minutes, n = 247; 20 minutes, n = 575; 40 minutes, n = 244; 60 minutes, n = 242; 80 minutes, n = 489; 100 minutes, n = 489; and 120 minutes, n = 577."}, {"section_title": "Assessment of Skeletal Muscle Mass", "text": "With the use of a Somatom Sensation 10 CT scanner (Siemens, Malvern, PA), 10-mm (120 kVp, 200-250 mA) cross-sectional images were obtained at the midfemur level, considered to be the midpoint between the medial edge of the greater trochanter and the intercondyloid fossa in scout view images. A single cross-sectional image of the midthigh was analyzed with the use of BonAlyse (BonAlyse Oy, Jyvaskyla, Finland) software for processing CT images that identifies muscle tissue, fat, and bone. The muscle outline was traced manually, excluding subcutaneous fat and bone. When muscle area is quantified, the BonAlyse software quantifies voxels within a range corresponding to muscle density (9-271 mg/cm 3 ) and excludes voxels corresponding to fat density (-270 to 8 mg/cm 3 ). Muscle density is a proxy measure of the quantity of contractile proteins per volume. To obtain this measure, CT attenuation values expressed as Hounsfield units were translated into measures of relative density using an external phantom. The CV for average muscle attenuation from single-slice CT scans of the midthigh have previously been reported to be 0.51% for test-retest variability and 3.3% for within-subject variance (12) .\nThe total midthigh cross-sectional area (CSA) of nonadipose, non-bone tissue within the deep fascial plane of the left thigh was used as the measure of muscle mass. Cadaver studies demonstrate that these methods provide an estimate of muscle area that is highly correlated with direct anatomic measures (13) .\nMeasurements of CT CSA of the thigh muscle in square millimeters were divided by body weight in kilograms to provide a standardized measure of skeletal muscle mass, similar to previous authors who referenced measurements of skeletal muscle mass derived from bioimpedance analysis to body weight (4) ."}, {"section_title": "Covariates", "text": "Height and weight were measured by standard methods. Physical activity level was determined using a standardized questionnaire, modeled from the well-validated Minnesota Leisure Time Physical Activity Questionnaire (14) . Participants reported whether they had participated in a specific activity at least 10 times in the past 12 months including gardening, heavy chores, light house work, grocery shopping, laundry, climbing stairs, walking for exercise, walking for other purposes, aerobics, weight or circuit training, highintensity exercise activities, and moderate-intensity exercise activities. If so, participants were then asked whether they had done the activity in the past 7 days and the amount of time spent doing the activity, including intensity level. Information from the past week was used to calculate physical activity amounts. Each activity-intensity combination was assigned a metabolic equivalent value that was used to calculate the number of kilocalories per week per kilogram body weight spent on that activity. An overall physical activity score in kilocalories per week was calculated for each participant by summing and multiplying the scores of all performed activities by body weight. Similarly, a summary score of walking for exercise (reported as brisk) and highintensity exercise activities such as jogging, swimming, cycling, racquet sports, and use of gym equipment (eg, stair stepping, elliptical and stationary cycling machines) was created (15) . Approximately 1.4% of these variables (height, weight, physical activity) were missing.\nBecause glucose intolerance is associated with peripheral neuropathy even among persons without diabetes (16) , and motor neuropathy can lead to muscle loss, we explored the contribution of peripheral nerve function to the association of hyperglycemia and/or hyperinsulinemia with decreased muscle mass. Peripheral nerve function was evaluated for peroneal motor nerve conduction velocity (NCV) using standard techniques (Nicolet Viking Select, Madison, WI) (17) . Testing was performed on the right leg if no contraindications were present. Contraindications included amputation, ulcer, trauma, knee replacement, or surgery. The leg was heated with a heating pad until it was 32°C , if initially below this temperature. After cleansing the skin with alcohol or a degreaser, surface electrodes were placed on the leg to be tested with conducting gel. For peroneal nerve testing, the recording electrode was positioned on the extensor digiti minimi belly and the stimulating electrode was positioned where the peroneal nerve wraps around the fibular head. Distal stimulation was placed 8.5 cm proximal to the recording electrode, lateral to the tibialis anterior tendon, and the ground was positioned on the fifth metatarsophalangeal joint, lateral to the long extensor tendons. NCV was calculated in meters per second and rounded to the nearest one decimal (n = 472)."}, {"section_title": "Statistical Analysis", "text": "For the 587 participants, missing insulin data were left out of the analyses because most individuals had fasting insulin and 20, 80, 100, and 120-minute levels, but may have been missing multiple insulin values at other time points during OGTT. Missing covariate information was similarly handled.\nInsulin resistance was estimated by the homeostasis model assessment of insulin resistance (HOMA-IR), calculated using fasting glucose and insulin measurements similar to previous studies (18) . Whole-body insulin sensitivity was estimated using the Matsuda index, calculated as 10,000/square root of [(fasting glucose × fasting insulin) × (mean glucose × mean insulin during OGTT)], which provides a good approximation of measurements obtained by the euglycemic insulin clamp technique (19) . Integration of the glucose and insulin OGTT curves (ie, area under the curve [AUC]) was calculated by the standard trapezoid method. The insulin AUC was calculated using all available data for the participant. The correlation between using all measurements, and only the 20, 80, 100, and 120-minute insulin measurements (which most participants had available) was 0.97, with the former insulin AUC being 8% higher than the latter insulin AUC. Therefore, for participants who only had the latter measurements, the calculated insulin AUC was multiplied by 1.08.\nDifferences in baseline characteristics by quartile of muscle mass (standardized to body weight) were summarized as means ± standard deviation and tested by analysis of covariance. To examine which OGTT measurements were independently associated with muscle mass, a series of linear regression models were created. Model 1 was adjusted for demographics (age, sex, race); model 2 was adjusted for model 1 + height; model 3 was adjusted for model 2 + physical activity (high-intensity activity and walking); model 4 was adjusted for model 3 + neuropathy (peroneal motor NCV). Additionally, we used Bayesian model averaging, which explores uncertainty by fitting multiple regression models using different combinations of variables and providing weighted probabilities that their coefficients are not equal to zero (20) , to identify the best set of predictors for muscle mass across all feasible models.\nA two-tailed p value <.05 was used to indicate statistical significance. All analyses and graphs were completed using R version 2.10.1 (R Project for Statistical Computing, http://www.r-project.org)."}, {"section_title": "Results", "text": "The mean age of participants was 67.3 years. The baseline (unadjusted) characteristics of all participants by quartile of midthigh muscle CSA (mm 2 ), standardized to body weight (kg), are shown in Table 1 . From lowest to highest quartile of midthigh muscle CSA, participants were significantly younger, taller, and more likely to be men and nonwhite. They were also more physically active. Mean peroneal nerve motor NCV did not differ by quartile of midthigh muscle CSA. The following OGTT measurements were also significantly lower in participants in the higher (vs lower) quartiles of muscle mass: fasting glucose, 5-minute glucose, 80-minute glucose, 80-minute insulin, 100-minute glucose, 100-minute insulin, 120-minute glucose, 120-minute insulin, integrated glucose area, and integrated insulin area. The Matsuda index increased with higher (vs lower) quartiles of muscle mass. Fasting insulin, all other OGTT glucose and insulin measurements, and HOMA-IR were similar across quartiles of muscle mass.\nIn age-, sex-, and race-adjusted linear regression models where midthigh muscle CSA (standardized to body weight) was considered as a continuous dependent variable, higher fasting glucose levels and higher OGTT glucose levels at all time points except 10 minutes (p = .07) were significantly associated with lower midthigh muscle CSA (all ps < .05; Table 2 , model 1). Adjustment for height (Table 2 , model 2) slightly increased the size of the coefficients but did not alter the significance of the associations, except for the association of 10-minute glucose with mid-thigh muscle CSA, which became of borderline significance (p = .05). Further adjustment for physical activity (Table 2 , model 3) slightly attenuated the size of the coefficients but, again, did not change the significance of the associations except for 10-minute glucose, which was no longer significant (p = .12). Additional adjustment for neuropathy (Table 2 , model 4) reduced the size of the regression coefficients at 5 minutes (p = .07), 15 minutes (p = .06), and 20 minutes (p = .06). However, the negative associations of fasting glucose and OGTT glucose measurements at 40, 60, 80, 100, and 120 minutes with mid-thigh muscle CSA remained significant in fully adjusted models (all ps < .01).\nSimilarly, in the analysis adjusted for demographics, higher fasting insulin levels and higher OGTT insulin levels at all time points except 5 minutes (p = .05) and 10 minutes (p = .09) were significantly associated with lower muscle midthigh muscle CSA (all ps < .05; Table 2 , model 1). Adjustment for height (Table 2, model 2) slightly changed the size of the coefficients but did not alter the significance of the associations. Further adjustment for physical activity (Table 2 , model 3) slightly attenuated the size of the coefficients but did not change the significance of the associations. After additional adjustment for neuropathy (Table 2 , model 4), the size of the coefficients was reduced such that associations at 15 minutes (p = .25) and 40 minutes (p = .05) were no longer significant. However, the negative associations of fasting insulin and OGTT insulin at 20, 60, 80, 100, and 120 minutes with midthigh muscle CSA remained statistically significant in fully adjusted models (all ps < .005). Derived measures including HOMA-IR, integrated glucose area, and integrated insulin area were all significantly negatively associated, and the Matsuda index was significantly positively associated (indicating increased insulin sensitivity), with midthigh muscle CSA in demographicsadjusted models (all ps < .001; Table 2 , model 1). Further sequential adjustment for height (Table 2 , model 2), physical activity (Table 2 , model 3), and neuropathy (Table 2 , model 4) slightly attenuated the size of the coefficients; however, HOMA-IR, the Matsuda index, integrated glucose area, and integrated insulin area remained significantly associated with midthigh muscle CSA in fully adjusted models (all ps < .001).\nIn regression models using Bayesian model averaging, the Matsuda index had the highest probability (>99%), followed by fasting glucose (16.6%), 20-minute glucose (9.3%), and 10-minute glucose (7.2%) that the regression coefficient was nonzero (zero = no association with muscle mass) after accounting for demographics (Table 3 , model 1). After further adjustment for height, only the Matsuda index (>99%) and fasting glucose (12.2%) had a probability greater than 10% that the regression coefficient was nonzero (Table 3 , model 2). In models adjusted for physical activity (Table 3 , model 3), these probabilities were largely unchanged. In fully adjusted models including peroneal motor NCV (Table 3 , model 4), the Matsuda index (>99%) and fasting glucose (11.7%) remained the predictors most strongly associated with muscle mass (Table 3 , model 4). Among the covariates, age, sex, race, and height each had a probability of greater than 99%; physical activity had a probability of 36.0%; and peroneal motor NCV had a probability of 2.4% of having coefficients that were significantly different from zero in fully adjusted linear regression models where they were included."}, {"section_title": "Conclusions", "text": "In a population of healthy community-dwelling older adults without diabetes, higher fasting and OGTT glucose levels (at 40, 60, 80, 100, and 120 minutes), fasting and OGTT insulin levels (at 20, 60, 80, 100, and 120 minutes), HOMA-IR, glucose AUC, and insulin AUC, and lower insulin sensitivity as determined by the Matsuda index were all significantly and independently associated with decreased midthigh muscle CSA (standardized to body weight) in models adjusted for demographics, height, physical activity, and neuropathy. When considered together, the Matsuda index and fasting glucose were the most significant predictors of midthigh muscle CSA in fully adjusted models.\nTo our knowledge, this is the first study to explore the association of either fasting or postchallenge glucose and insulin measurements from OGTT directly with muscle mass in individuals free of diabetes, although associations with muscle strength have been reported. One study reported a cross-sectional association of higher fasting insulin levels and decreased grip strength (8) . Our findings similarly demonstrate that higher fasting insulin levels are associated with lower muscle mass. Other studies have described an association of insulin resistance (HOMA-IR) with decreased quadriceps strength (9) . We also found that HOMA-IR was inversely associated with lower muscle mass independent of confounders. Furthermore, higher 120-minute glucose levels are associated with decreased grip strength independent of weight among adults without diabetes (10) . We similarly found that higher 120-minute glucose levels in addition to many other OGTT levels of glucose and insulin are associated with lower muscle mass after accounting for weight and other covariates.\nWhereas in the general population the relationship between muscle strength and mobility is widely acknowledged, whether muscle mass independently contributes to mobility is still an open question (5, 21) . Our findings raise the hypothesis that at least in patients with glucose intolerance, the association of higher glucose and insulin levels with muscle strength demonstrated by previous studies (8-10) is mediated, in part, by reduced muscle mass. We were able to account for possible related factors such as demographics, height, physical activity, and neuropathy. Furthermore, we referenced CT-derived measurements of midthigh CSA to body weight to better ascertain reduced relative skeletal muscle mass, which was not done in previous studies exploring differences in muscle mass by diabetes status (3). CT-derived measurement of midthigh CSA is a valid feasible method that has been used as a proxy measure of skeletal muscle mass in previous studies (1, 5) and correlates well with other more invasive techniques. Häggmark and colleagues (22) were the first to demonstrate the usefulness of CT scanning for measuring CSA of the thigh muscle and that mean muscle fiber diameter was closely correlated with radiographic measurements. Thigh muscle area is a better predictor of muscle mass compared with midarm muscle area (23) . In cadavers, CT imaging for measurement of appendicular skeletal muscle area (excluding adipose tissue) is accurate and correlates well with direct tissue measurement (3).\nHowever, our study has several limitations. Baltimore Longitudinal Study of Aging participants are relatively well-educated health care-seeking population of communitydwelling volunteers; thus, our results may not be generalizable to all adults. Because our study is cross-sectional, we could not exclude possible reverse causality; it is, in fact, possible that individuals with lower muscle mass may have decreased glucose metabolism resulting in increased levels of blood glucose and/or insulin. Further longitudinal studies that explore the relationship of higher glucose and insulin levels with sarcopenia independent of diabetes are needed to better clarify the directionality of the association assessed in this study. We may have had decreased power to observe associations, especially in regards to the relationship of OGTT insulin measurements with muscle mass at time points other than fasting, and 20 and 120 minutes because not all participants had measurements at other times. Yet, we were still able to discern significant associations between OGTT glucose and insulin levels at numerous time points with muscle mass in fully adjusted models. Lastly, although midthigh muscle CSA is considered a good assessment of muscle mass and has also been used in previous studies (1, 5) , this more accurately reflects muscle area and not volume; however, small differences in midthigh muscle CSA as ascertained by CT have been linked to poorer lower extremity performance in older adults (5) .\nThe mechanisms by which higher glucose levels may be related to sarcopenia are not fully understood and may be direct or indirect. A chronic proinflammatory state may be evident in older persons and is associated with both higher glucose levels (24) and subsequent loss of muscle mass and strength (25) . In addition, low levels of insulin-like growth factor-1 have been associated with both insulin resistance (26) and sarcopenia (25) ; thus, hormonal pathways may also underlie the relationship of hyperglycemia with sarcopenia. Interestingly, frailty, a condition characterized by increased vulnerability to stressors and functional decline especially in older adults, has been associated with higher glucose levels, sarcopenia, inflammation, and low insulin-like growth factor-1 levels (27) , and may be the final common clinical manifestation of these pathways. Mitochondrial dysfunction could also potentially lead to both hyperglycemia and sarcopenia. Direct glucose toxicity on muscle tissue may have a role and could explain the significant association of higher levels of postchallenge glucose levels with sarcopenia. Lastly, sarcopenia itself can lead to decreased surface area for insulin-mediated (ie, GLUT4) glucose uptake; this may lead to a vicious cycle in which higher glucose levels further exacerbate muscle loss resulting in rapid declines that eventually manifest clinically as functional impairment.\nHigher insulin levels in individuals without diabetes reflect decreased insulin sensitivity in peripheral muscle. In relative insulin deficiency states such as diabetes, decreased insulin-mediated capillary recruitment in skeletal muscle (28) can lead to decreased vasodilation and skeletal muscle blood flow, ultimately resulting in decreased glucose uptake and muscle wasting. Decreased insulin-stimulated mitochondrial production of nitric oxide synthase is directly associated with insulin resistance (29) and could also have a role in skeletal muscle vasodilation and glucose uptake.\nFasting levels of glucose and insulin are not difficult to obtain in clinical practice yet may help identify individuals at risk for accelerated muscle loss. Performance of an OGTT may offer additional insight, especially if fasting levels are normal. The strong association of higher levels of glucose and insulin (though within the nondiabetic range) with sarcopenia may provide a compelling reason to perform future studies that investigate whether glucose-lowering and/or insulin-sensitizing strategies may be beneficial in older individuals who have some degree of insulin resistance, in order to preserve functional status. Though we did not specifically ascertain functional status in our study, the association of sarcopenia with poor physical function is well established (4, 5) . However, as recent literature has demonstrated (30), glucose-lowering therapy that is too aggressive may also be associated with adverse effects on mortality, and potential limitations of this therapy would need to be addressed. In addition, because greater muscle mass may be associated with improved glucose metabolism, other interventions (eg, exercise) that seek to improve muscle mass among persons without diabetes may also lower the risk of developing diabetes and prevent deterioration of glucose metabolism over time. Further studies are needed to confirm the exact mechanisms and direction of these associations but may ultimately lead to the use of medications that lower blood glucose and/or increase insulin sensitivity to reduce the burden of physical disability among vulnerable older adults. "}]