[{"section_title": "Abstract", "text": "During the strong 2015/16 El Niño, only normal to below-average precipitation fell across California in the late winter. This disagrees with both predictions by the ensemble mean of forecast models and expectations for strong El Niños. The authors examine one of the possible reasons why this event did not bring expected precipitation to California in the late winter. The maximum equatorial Pacific sea surface temperature anomalies (SSTAs) were located, compared to the 1982/83 and 1997/98 strong El Niños, farther to the west in the 2015/16 winter, which possibly caused less convection in the eastern tropical Pacific and shifted the teleconnection patterns westward in the North Pacific, thus weakening the influences on California. The SSTA and precipitation forecast for February-April 2016, based on the North American Multimodel Ensemble, showed large discrepancies from observations, with the ensemble mean of most of the models overestimating SSTAs in the eastern tropical Pacific and California precipitation. Atmospheric general circulation model (AGCM) experiments were conducted to test the hypothesis that the warmer eastern tropical Pacific SSTA forecast may have caused the wetter forecast in California in 2015/16 compared to observations. The AGCM experiments suggest it is difficult to assert that the eastern tropical Pacific SSTAs caused the toowet California precipitation forecast, especially in Southern California, given that the models disagree. Results indicate forecast error can be influenced by atmosphere-model sensitivity to forecast SSTs, but they also indicate atmospheric internal variability may have been responsible for the combination of a strong El Niño and near-normal California precipitation."}, {"section_title": "Introduction", "text": "El Niño, the warm phase of the El Niño-Southern Oscillation (ENSO) cycle, has far-reaching impacts on seasonal weather anomalies and interannual climate variability across the globe (e.g., Ropelewski and Halpert 1987, 1996; Kiladis and Diaz 1989; Mason and Goddard 2001; Larkin and Harrison 2005a; Chiodi and Harrison 2015; and many others) . During an El Niño event, anomalously positive sea surface temperature (SST) and enhanced deep convection in the tropical Pacific force an upper-level stationary wave. The stationary wave links the tropical forcing to extratropical climate, particularly in the Pacific-North American (PNA) region (e.g., Wallace and Gutzler 1981; Seager et al. 2010) , imposing a major control on the weather across western North America, including California (e.g., Ropelewski and Halpert 1986; Harrison and Larkin 1998; Ely et al. 1994; Cayan et al. 1999; Schubert et al. 2008; and many others) . The statistical link between El Niño and California winter precipitation, however, is less robust than elsewhere in southwest North America. The influences of El Niño vary from event to event (e.g., Schonher and Nicholson 1989; Hoerling and Kumar 1997) and are highly dependent on the region and time of year, with the late winter impact showing the strongest signal for Southern California (SoCal) precipitation (Jong et al. 2016) . The state of California, which has one of the largest economies in the world and is a major state for agricultural production, has experienced one of its worst droughts in the past five years (e.g., Seager et al. 2015a; Williams et al. 2015) , and it continued, surprisingly, despite the strong 2015/16 El Niño. A better understanding of El Niño's varying impact on California winter precipitation could potentially enhance the predictability of seasonal-to-interannual variability across the state, including drought onset and termination, and provide economic and societal benefit.\nAs the jet stream and extratropical storm track move southward during an El Niño event, California, particularly relatively dry Southern California, tends to get excessive amounts of precipitation (e.g., Schonher and Nicholson 1989; Cayan et al. 1999; Andrews et al. 2004; Hoell et al. 2016; Jong et al. 2016) . The probability of anomalous statewide wetness increases as El Niño's intensity increases, according to both historical observations (Jong et al. 2016 ) and model simulations (Hoell et al. 2016) . Furthermore, the influences of El Niño on California winter precipitation are statistically significant in late winter [February-April (FMA) ], but not in late fall or early winter, even though that is when an El Niño usually reaches its peak intensity (Lee et al. 2008 (Lee et al. , 2014 Jong et al. 2016) .\nThe 2015/16 El Niño, one of the strongest events in recent history, was comparable in strength to the 1982/83 and 1997/98 strong El Niño events. During the peak season of the event (November 2015-January 2016), climate models generally predicted wetter-than-normal conditions in the southern tier of the United States, including California, from December to February (DJF) to late winter (FMA) (Climate Prediction Center 2015a Steinschneider and Lall 2016) . However, despite expectations of excess precipitation and drought relief (Seager et al. 2015b) , the 2015/16 event only brought an about-average amount of precipitation to Northern California (NoCal; 101%) and below-average precipitation to SoCal (81%) in FMA 2016 (Table 1) . It is, therefore, interesting to ask why California did not receive the excess precipitation expected and predicted during the 2015/16 El Niño.\nThere are several possible factors that cause variations in North American climate between El Niño events. These include random atmospheric internal variability and sensitivity to differences in the detailed structure and longitudinal location of the SST anomalies (SSTAs) (e.g., Hoerling and Kumar 1997; Guo et al. 2017) . The different longitudinal locations of the SSTAs can cause shifts in the forced stationary waves, leading to different teleconnection patterns and impacts on North American climate (e.g., Mo and Higgins 1998a,b; Barsugli and Sardeshmukh 2002; Hoerling and Kumar 2002) . For some local regions, such as the Pacific Coast, the precipitation anomalies can be extremely sensitive to small shifts in the teleconnection patterns. For example, a slight shift in the anomalous Aleutian low during an El Niño event can differentiate between a dry and wet winter in California (e.g., Schonher and Nicholson 1989; Ely et al. 1994 ). Many researchers have discussed the sensitivity of North American climate to the diversity of El Niño based on the longitudinal locations of the SSTAs (e.g., Larkin and Harrison 2005b; Weng et al. 2009; Yu and Zou 2013; Capotondi et al. 2015; Taschetto et al. 2016; Infanti and Kirtman 2016; Guo et al. 2017) . Two specific El Niño types that have been discussed are the eastern Pacific (EP) El Niño and the central Pacific (CP) El Niño [also termed Dateline El Niño in Larkin and Harrison (2005b) and El Niño Modoki in Weng et al. (2009)] . A CP El Niño generally enhances the dry anomalies and weakens the wet anomalies across most United States regions. In California, however, they found the precipitation anomalies tend to be similar or even wetter during CP El Niño events compared to canonical EP El Niño events, particularly in SoCal (Weng et al. 2009; Yu and Zou 2013) .\nIn this study, we try to understand the 2015/16 California precipitation responses, from the perspective of both the characteristics and time evolution of the SSTAs and the anomalous circulation patterns using observations of the three most recent strong El Niño events (1982/83, 1997/98, and 2015/16) . Then, we examine the coupled climate forecast models from the North American Multimodel Ensemble (NMME) to determine to what extent the models are able to capture "}, {"section_title": "Data a. Observed data", "text": "The SST data are taken from the NOAA Optimum Interpolation Sea Surface Temperature version 2 (OISSTv2). OISSTv2 provides monthly SST data from 1981 to present with 18 3 18 spatial resolution (Reynolds et al. 2002) . Precipitation data over North America from 1981 to 2016 are taken from the National Centers for Environmental Prediction (NCEP)/Climate Prediction Center (CPC) (Chen et al. 2002) . The monthly global data with 0.58 3 0.58 spatial resolution are reconstructed by interpolation of gauge observations from over 17 000 stations, collected in the Global Historical Climatology Network (GHCN) version 2 and the Climate Anomaly Monitoring System (CAMS) datasets. Precipitation data over the Pacific are derived from NCEP/CPC CAMS and OLR precipitation index (OPI) (CAMS_OPI), which merged observations from rain gauges with precipitation estimates from satellites (Janowiak and Xie 1999) . CAMS_OPI provides monthly data from 1979 to present with 2.58 3 2.58 spatial resolution. Atmospheric circulation data (200-hPa geopotential height) are taken from the NCEP-NCAR reanalysis project, a joint project between NCEP and the National Center for Atmospheric Research (NCAR) that provides monthly atmospheric analyses from 1948 to the present with 2.58 3 2.58 spatial resolution (Kalnay et al. 1996) . The monthly climatology for the winter months (NovemberApril) used in this study is consistently based on winter 1981/82 to winter 2015/16."}, {"section_title": "b. Forecast data", "text": "The SST and precipitation forecasts are derived from NMME, an experimental multimodel seasonal forecasting system including coupled models from NOAA/ NCEP, NOAA/Geophysical Fluid Dynamics Laboratory (GFDL), NCAR, National Aeronautics and Space Administration (NASA), and Canadian Meteorological Centre (CMC) (Kirtman et al. 2014 ). Eight models from the NMME are used in this research: CCSM3, CCSM4, GFDL CM2.1, GFDL CM2.5, NASA GEOS5, NCEP CFSv2, CanCM3, and CanCM4. All the model data are provided with a spatial resolution of 18 3 18. In this study, we examine the FMA 2016 3-month average forecast initialized with 1 February 2016 atmospheric and oceanic conditions. The NMME data are accessible at the International Research Institute for Climate and Society, Columbia University, Data Library (http://iridl. ldeo.columbia.edu/SOURCES/.Models/.NMME/)."}, {"section_title": "c. AGCM experiments", "text": "To test California precipitation sensitivity to the tropical Pacific SSTAs, we conduct AGCM experiments by prescribing the observed and forecast SSTAs. The atmosphere models used are the NCAR Community Climate Model version 3 (CCM3; Kiehl et al. 1998) , and Community Atmosphere Model version 4 (CAM4; Neale et al. 2013 ) and version 5 (CAM5; Neale et al. 2012) . CCM3 has horizontal resolution of triangular spectral truncation at wavenumber 42 (T42) with 128 3 62 longitude-latitude grid (approximately 2.88 3 2.88) and 18 levels, with the model top at 2.9 hPa. CAM4 and CAM5 both have 144 3 96 longitude-latitude grid as horizontal resolutions (approximately 1.98 3 1.98). The vertical resolution in CAM4 is 26 levels, with the model top at 2.2 hPa. CAM5 has four extra levels in the boundary layer (below 2200 m) with a total of 30 vertical levels.\nIn each model, we conduct three sets of 100-member ensemble experiments. For each ensemble member, a random perturbation on the order of 10 214 was added to the initial 3D temperature field on 1 January 2016 and run for a month to reach equilibrium. For the first set of experiments, the climatological FMA 3-month averaged SSTs from 1982 to 2016, derived from OISSTv2, were prescribed globally and generate the control runs. For the anomaly runs, FMA 2016 3-month averaged SSTA was added to the climatological SSTs only in the tropical Pacific from 308S to 308N, with additional 58-width edges for tapering. Two SSTAs were applied; one is the OISSTv2 observed SSTA (OBS), and one is the NMME mean 3-month forecast made on 1 February 2016 (FRCST). Thus, for each model there are three experiments: a control run with climatological FMA SST, observed FMA 2016 SSTA runs, and forecast FMA 2016 SSTA runs.\nTo test if the too-warm SSTAs forecast in late winter, especially in the eastern tropical Pacific, influenced the California precipitation forecast, we turn to the AGCM experiments forced with climatological, observed, and forecast SSTAs. The precipitation and circulation anomalies shown in Figs. 7 and 8 are the differences between the ensemble means of the observed/forecast SSTA runs and control runs. Figure 7 presents the 100-member ensemble mean precipitation anomalies over the United States from the OBS and FRCST SSTA runs. All the experiments produce normal-to-wetter conditions in NoCal and wetter-than-average conditions in SoCal, but the differences between OBS and FRCST differ by model: (Figs. 7a-c) , FRCST predicts the entire state to be wetter than the climatology. In the OBS SSTA runs, while the southern part of the state is still wetter than the climatology, NoCal has close to normal conditions. Thus, differences between the OBS and FRCST show that the observed SSTA drives drier conditions over California region than does the forecast SSTA.\nd In CAM4 (Figs. 7d-f) , both OBS and FRCST produce wetter-than-average conditions across the entire state, with the OBS slightly drier in NoCal (at 90% statistical confidence level) and slightly wetter in SoCal (not statistically confident at 90% level).\nd CAM5 is similar to CAM4, with both OBS and FRCST predicting wetter-than-average conditions across California. However, the observed SSTAs, compared to the forecast SSTAs, makes SoCal much wetter, with an extra 20%-40% of the climatological precipitation. The differences in NoCal precipitation between these two SSTA runs are not statistically significant, though the ensemble mean from the OBS is slightly drier than the FRCST.\nTherefore, based on these experiments, the observed SSTA in all models tends to make NoCal drier than does the forecast SSTA. However, the models have no consensus on the variations in SoCal precipitation: CCM3, CAM4, and CAM5 have drier, about the same, and much wetter SoCal in the OBS compared to the FRCST, respectively.\nThe differences in California precipitation between these two SSTA experiments, as well as the differences among these three models, could be explained by the differences in their teleconnection patterns. Figure 8 presents the differences in anomalous precipitation and circulations over the Pacific-North American region between the OBS and FRCST. In all three models, the observed, colder, SSTA drives weaker convection in the eastern tropical Pacific compared to the FRCST (shaded area over the ocean in Fig. 8 ). As the tropical convection in the eastern equatorial Pacific weakens, the deepening Aleutian low is mitigated and shifted westward over the North Pacific across North America in the OBS, compared to the FRCST. The changes in the circulations can be identified in both low (Figs. 8d-f) and high (Figs. 8a-c) levels, given the barotropic structure of the deepening Aleutian low. The weakening and westward shift of the low-pressure anomalies in the OBS could subsequently result in drier conditions in California, as happens in the CCM3 experiments (Figs. 7a-c) . In contrast, in CAM4 and CAM5, SoCal gets wetter as the low-pressure anomalies weaken over western North America in the OBS runs, implying that California precipitation in these models is affected by other factors.\nIn the CAM4 and CAM5 experiments, besides the differences off the west coast of North America, the teleconnections also respond to the differences between OBS and FRCST in tropical SSTAs in the western Pacific (Figs. 8b,c) . Unlike the dipole pattern in the CCM3 experiments, which is a direct response to SSTAs in the eastern tropical Pacific, CAM4 and CAM5 show a wave train-like response from the western tropical Pacific. Why the models have differing precipitation anomalies over California can be seen by looking at the low-level flow (Figs. 8d-f) . Wetting in OBS relative to FRCST in California and Mexico is related to, in the OBS-minus-FRCST model difference, southerly flow on the eastern flank of a low-level cyclone over the North Pacific. In CCM3, the southerly flow difference is weak and over Mexico (and California is drier), while in CAM4 and CAM5, it is stronger and over California, wetting the state. It is not clear whether the differences between models in terms of the circulation anomalies over the coast of southwest North America are related to the different teleconnections patterns from tropical SSTs or not.\nTo examine how internal atmospheric dynamics may have contributed to the drier-than-expected California in 2015/16 winter, we examine the probability of NoCal and SoCal being wet or dry given the observed and forecast SSTAs using the AGCM experiments. Figure 9 shows the histograms of California precipitation from the 100 OBS SSTA runs and 100 FRCST SSTA runs for each model. In all three models for NoCal (Figs. 9a,c,e) , more members in the FRCST are wetter than the observations, compared to the OBS. In the CCM3 experiments (Fig. 9a) , 58% of the FRCST are wetter than the observation, compared to only 37% of the OBS. Also, in the OBS, the distribution is more centered on the observations. However, in CAM4 and CAM5 (Figs. 9c, e) , the number of members drier than the observation is quite similar for OBS and FRCST (CAM4: 27% of OBS vs 23% of FRCST and CAM5: 25% of OBS vs 21% of FRCST), and OBS even has more members at the wet end of the distributions. The ensemble means for OBS in CAM4 and CAM5 are about the same to slightly drier in NoCal, compared to the FRCST (Figs. 7f,i) . Nevertheless, the observed precipitation is within the range of uncertainties of the prescribed SSTAs for all models, indicating that internal variability could drive a near-normal NoCal even in the presence of a strong El Niño. The simulated precipitation in SoCal (Figs. 9b,d ,f) has even larger spreads compared to that in the north. In all three models, the distributions of precipitation anomalies from both SSTA runs show large spreads with long tails at the wet ends. Also, as discussed in the previous paragraphs, the responses in SoCal precipitation are inconsistent among these models. In the CCM3 experiments (Fig. 9b) , 83% of the FRCST and 76% of the OBS are wetter than the observations. However, the probability of being extremely wet (precipitation anomalies .100% of the climatology) drops in the OBS (12%), compared to the FRCST (23%). In the CAM4 experiments, both OBS and FRCST show large variances in SoCal precipitation. The percentage of the runs drier than the observations and the variances are similar in both experiments. In CAM5, the observed SSTA increases the variance of SoCal precipitation compared to FRCST, and the probability of being extremely wet (precipitation anomalies .100% of the climatology) is enhanced from 35% in the FRCST to 40% in the OBS with a 10% chance to be larger than 300% of the climatology. Thus, as shown in Fig. 7i , the CAM5 ensemble mean of SoCal precipitation is much wetter in the OBS. However, once more, the observations are within the ensemble spread in all distributions shown in Fig. 9 , implying that internal dynamics alone can cause the dry SoCal in the presence of a strong El Niño."}, {"section_title": "Results", "text": ""}, {"section_title": "a. Comparison of SST and circulation during the three strong El Niño events", "text": "The 2015/16 El Niño was among the strongest El Niño events since records began, with Niño-3.4 (58N-58S, 1708-1208W) SSTAs reaching 2.748C in the early winter [November-January (NDJ)] and 1.708C in the late winter (FMA) ( Table 1 ). The other two comparably strong events, 1982/83 and 1997/98, were slightly weaker in terms of the NDJ Niño-3.4 index but were stronger in terms of the FMA Niño-3.4 index than the corresponding 2015/16 event. Both these prior events brought excessive amounts of precipitation to California in the late winter: 212% and 207% of the climatology for NoCal and about 243% and 289% for SoCal in 1982/83 and 1997/98, respectively (Table 1 ). In contrast, the 2015/16 event only brought about-average precipitation to NoCal and below-average precipitation to SoCal in both early and late winter. To examine the possibility that distinct ocean conditions induced different teleconnection patterns and impacts on California precipitation for these three events, here we compare the associated tropical Pacific SST anomalies and anomalous atmospheric circulation patterns (Fig. 1) . As previous studies suggested, El Niño's impact changes throughout the winter (Lee et al. 2014; Jong et al. 2016 ), so we separate into early and late winter in Fig. 1 .\nIn the early winter, all three events had warm SSTA patterns occupying the entire eastern tropical Pacific from the date line to coastal South America (Figs. 1a-c) , with Niño-3 (58N-58S, 1508-908W) SSTAs being warmer than Niño-4 (58N-58S, 1608E-1508W) SSTAs (Table 1) . However, in the 2015/16 early winter, the SSTA maximum was located slightly westward compared to the 1982/83 and 1997/98 early winters, resulting in a slightly smaller Niño-3 SSTA but a stronger Niño-4 SSTA than the other two strong events (Table 1 ). Figure 2 shows that the anomalous tropical deep convection in the 2015/16 early winter was located closer to the date line and extended less to the eastern tropical Pacific than the prior events. As a possible consequence, the longitudinal location of the teleconnections pattern was also shifted westward during the 2015/16 early winter. The anomalous Aleutian low, a classic midlatitude response to El Niño, was located just off the west coast of North America (Fig. 1c) , unlike the patterns during 1982/83 (Fig. 1a) and 1997/98 (Fig. 1b) , when low-pressure anomalies extended across North America.\nThough the amplitude of the SSTAs had weakened in the 1982/83 and 1997/98 late winters (Figs. 1d,e) , the patterns remained similar to those in early winters, with maximum SSTAs centered at about 1208W and Niño-3 SSTAs of ;28C. The precipitation anomalies over the tropical Pacific extended farther eastward (Figs. 2d,e) compared to the early winters because the total SSTs in the eastern tropical Pacific were warmer in late winters (due to the climatological warming of the cold-tongue region). The low-pressure anomalies extended zonally from the North Pacific across North America (Figs. 1d,e) , which would steer storms and precipitation to California, causing the extremely wet late winters in the state (Table 1) . However, in FMA 2016 (Fig. 1f) , the SSTA maximum retreated farther westward, resulting in Niño-4 SSTAs of similar strength to Niño-3 SSTAs. The anomalous tropical deep convections (Fig. 2f) were also shifted substantially westward, showing a lack of anomalous convection in the eastern Pacific, especially as compared to the previous two strong events. We hypothesize that the westward-shifted patterns of SSTAs and tropical deep convections prevented the low-pressure anomalies in the extratropical North Pacific from extending eastward to reach the North American landmass (Fig. 1f) , resulting in near-normal to below-normal precipitation in California.\nThe time evolutions of the SSTAs in the central (Niño-4 region) and eastern (Niño-3 region) tropical Pacific (Fig. 3) illustrate more clearly the similarity and disparity of the SSTA patterns for these three events. During the 2015/16 event, the Niño-4 SSTA was warmer than the previous two events throughout the time period of the events (Fig. 3a) , while, after the peak of the events, the Niño-3 SSTA was weaker (Fig. 3b) . In the 2015/16 late winter, as Niño-3 SSTAs dropped faster than Niño-4 SSTAs, Niño-3 and Niño-4 SSTAs reached comparable strength, and the SSTA pattern shifted farther to the west, compared to the 1982/83 and 1997/98 events. The SSTA Hovmöller plots (Figs. 3c-e) show that in all three events, SSTAs weakened from their peaks in NDJ to FMA. They also show that the maximum SSTA in FMA was farther west for 2016 than for 1983 and 1998. Indeed, for FMA 1998, the maximum SSTA was at the coast of the Americas. The reasons for these SSTA evolutions and differences are beyond the scope of this research.\nThe knowledge that El Niño's impact on California precipitation occurs mainly in late winters (Jong et al. 2016 ) and the fact that California was extremely wet during FMA 1983 and 1998 but dry during FMA 2016 justifies the hypothesis that the weak Niño-3 SSTAs during the 2015/16 late winter may have played a role in suppressing the impact of El Niño 2015/16 on California precipitation. We begin exploring this question in the next section by examining the forecast models from the NMME to determine if there is any similar relationship between forecast SSTAs and California precipitation.\nb. Forecast of winter 2015/16 from the NMME Here we examine the coupled climate forecast models from the NMME to determine the agreements and discrepancies between forecasts and observations in winter 2015/16, focusing on the FMA 2016 3-month average and the NMME forecast initialized on 1 February 2016. Figure 4 shows the spatial patterns of the forecast SSTAs for FMA 2016 from the eight NMME models (Figs. 4a-h ), the multimodel ensemble mean (Fig 4i) , and observations ( Fig. 4j ) Four of the eight models (CCSM3, GFDL CM2.5, NASA GEOS5, and CanCM4; Figs. 4a,d,e,g), as well as the model ensemble mean, forecast a pattern of SSTAs that is much stronger than observations in the eastern tropical Pacific. The forecast SSTAs from the CCSM4 and NCEP CFSv2 models (Figs. 4b,h ) have about the right strength, but the patterns were too far to the east compared to observations. The GFDL CM2.1 model forecast shows a spatial pattern that is similar to observations with the maximum SSTA near the date line, even though the strength of the SSTA is slightly stronger than the observations. The CanCM3 produces an SSTA that is similar in both pattern and amplitude to observations. Figure 4k presents the scatterplot of Niño-4 versus Niño-3 SSTAs for each model, the model ensemble mean, and the observations, as a measure of the relative location of the SSTAs. Except for CanCM3 (light blue) and GFDL CM2.1 (orange), the rest of the eight models and model ensemble means all overestimate the Niño-3 SSTAs, which means they forecast warmer-than-observed conditions in the eastern equatorial Pacific in late winter. In summary, most of the models' ensemble means did not capture the longitudinal location of the SSTA pattern during the late winter of this event. Models CanCM3 and GFDL CM2.1 are the two exceptions. This situation may be relevant to the NMME bias of systematically producing too-warm SSTAs in the eastern tropical Pacific for events that have more local warming in the central tropical Pacific (Kirtman et al. 2013; Infanti and Kirtman 2016) . We next examine forecast precipitation over the California region for FMA 2016 (Fig. 5) . Most of the models predict wetter-than-normal conditions: CCSM3, NASA GEOS5, CanCM4, and NCEP CFSv2 (Figs. 5a ,e,g,h) predict a very wet late winter over the entire state, especially in SoCal. Models CCSM4 and GFDL CM2.5 (Figs. 5b,d ) predict a normal-to-drier winter in NoCal but overestimate the amount of precipitation in SoCal. The two models that had their SSTAs closest to observations, GFDL CM2.1 and CanCM3 (Figs. 5c,f) , both show drier-than-normal conditions in the north and normal or dry conditions in the south, respectively, which are much closer to the observations than the other six models. The scatterplot for precipitation in NoCal versus SoCal (Fig. 5k ) also shows that CanCM3 (light blue) and GFDL CM2.1 (orange) have the closest match to the observations, with neither NoCal nor SoCal being too wet.\nOverall, CanCM3 and GFDL CM2.1 are the only two models that did not overestimate the Niño-3 SSTAs in the late winter. They were also the only two models that did not forecast an anomalously wet late winter in California. There is less consistency when comparing anomalous tropical convection between observations and the NMME forecast, on the other hand. The forecast precipitation anomalies over the tropical Pacific (Figs. 6a-h ) suggest that all NMME models, including CanCM3 and GFDL CM2.1, overestimate the tropical eastern Pacific convection as compared to observations (Fig. 6j) . Thus, it is difficult to determine whether the two NMME models simulated realistic California precipitation for the right reason.\nThe time evolutions of Niño-3 and Niño-4 SSTAs from the NMME 3-month forecast are also shown in Fig. 3 . The model ensemble was correctly forecasting a Niño-4 SSTA for the 2015/16 event warmer than those of 1982/83 and 1997/98 (Fig. 3a) but did not capture the fast decay in Niño-3 SSTAs in FMA, resulting in Niño-3 SSTAs in the late winter warmer than observations (Figs. 3b,f) . The ensemble mean FMA forecast of the Niño-3 SSTAs for 2015/16 was closer to what happened in 1982/83 and 1997/98. Therefore, to add to our hypothesis, we surmise that the majority of the state-of-the-art forecast models forecast too-high California precipitation because they overestimated the SSTA strength in the eastern tropical Pacific in late winter."}, {"section_title": "Conclusions and discussion", "text": "The 2015/16 El Niño event was one of the strongest ever and was comparable to 1982/83 and 1997/98, both of FIG. 7 . FMA 2016 U.S. ensemble mean precipitation anomalies from AGCM observed SSTA runs, and forecast SSTA runs using (a),(b) CCM3, (d),(e) CAM4, and (g),(h) CAM5. (c),(f),(i) OBS 2 FRCST differences. Stippling denotes 90% significance using a two-tailed Student's t test. Red boxes indicate CA region (percent of climatology). which brought extremely wet late winters to all of California. In the late 2015/16 winter, however, this event only brought about-average precipitation to Northern California, while Southern California was drier than normal, allowing the multiyear drought to persist. The purpose of this paper is to examine a possible explanation for why this event did not bring excessive precipitation to California in the late winter, as was forecast by most prediction models and expected based on observational and model-based analyses (Seager et al. 2015b) .\nWe first compared the three strongest El Niños since records began (1982/83, 1997/98, and 2015/16 ) based on observations. In the 2015/16 winter, the maximum equatorial Pacific SSTA was located westward compared to those during 1982/83 and 1997/98 winters. This was particularly the case in the 2015/16 late winter, when the maximum SSTA weakened and retreated farther to the west. The North Pacific low-pressure anomaly was located away from the North American coast in 2015/16, unlike the patterns during 1982/83 and 1997/98, when low-pressure anomalies extended zonally across North America. These observations raised the question of whether the colder observed SSTAs in the eastern tropical Pacific in the 2015/16 winter prevented the teleconnections from extending from the North Pacific across North America and bringing extra precipitation to California.\nWe then examined the forecast of SSTAs and precipitation for February-April 2016 from the NMME. The NMME model ensemble overestimated the eastern tropical Pacific SSTAs in the late winter, as the models did not effectively capture the fast drop of the Niño-3 SSTA from its December 2015 peak. Consistently, the anomalous deep convection in the model ensemble over the tropical Pacific extended farther to the east than the observations. The model ensemble also predicted a wetter late winter in California, especially in Southern California, than the observations. Thus, consistent with the comparison among the three strongest events, we hypothesized that in FMA 2016, the too-warm Niño-3 SSTA forecast drove too-strong deep convection anomalies in the eastern tropical Pacific, triggering a toofar-east teleconnection and a wet bias in the forecast California precipitation.\nTo test this hypothesis, we conducted two SSTAforced experimental runs in three NCAR GCMs (CCM3, CAM4, and CAM5): one forced by the observed FMA 2016 SSTAs, and the other forced by the NMME model ensemble mean forecast FMA 2016 SSTAs. The observed SSTAs are colder in the central and eastern equatorial Pacific and are slightly warmer in the westernmost tropical Pacific than the forecast SSTAs. In response, all three models have a weaker and westward-shifted low-height anomaly over the North Pacific and west coast of North America when the observed SSTA is prescribed. As the result, precipitation in Northern California is either about the same (CAM5) or drier (CCM3 and CAM4) in the observed SSTA runs than in the forecast SSTA runs. However, over Southern California, the response of precipitation varies across models. One of the possible explanations is that in CCM3, the teleconnections respond mainly to the SSTA differences in the central-eastern equatorial Pacific, which causes weaker low-pressure anomalies and a drier Southern California in the observed SSTA runs. On the other hand, the teleconnection patterns in CAM4 and CAM5 are also sensitive to the small SSTA differences in the westernmost tropical Pacific, which influenced the teleconnected height response over North America. From a local perspective, subtle differences in the observed-minus-forecast model low-level height difference mean that southerly anomalies at the west coast are weak and located over Mexico in CCM3 but are stronger and over California in CAM4 and CAM5, creating wet anomalies in the latter two models. Thus, based on these experiments, we tentatively claim that the too-warm Niño-3 SSTA forecast might be partly responsible for the too-wet Northern California forecast, but it is difficult to claim it influenced the too-wet precipitation forecast for Southern California in FMA 2016. Nevertheless, the influences of atmospheric internal variability on California precipitation cannot be neglected, in spite of the strong tropical forcing (e.g., Hoerling and Kumar 1997) . The observed FMA 2016 California precipitation amounts are within the range of ensemble members in the AGCM experiments. Hence, a near-normal NoCal and a dry SoCal could have been driven by internal variability in the presence of a strong El Niño. In the NMME forecast, the observed California precipitation amounts were also within the range of uncertainties, even though more ensemble members prefer wetter-than-observed conditions (63% in NoCal and 74% in SoCal), resulting in the biased ensemble mean forecast. The 2015/16 California precipitation forecast only failed in terms of the ensemble mean, not the ensemble spread.\nAlthough we have not been able to prove our hypothesis that a forecast of too-warm water in the eastern equatorial Pacific led to a forecast of too-wet conditions across California in late winter, the observational and modeling work does show that such SST differences matter for atmospheric circulation and precipitation over North America. However, models disagree on the details of the circulation response, which can actually cause different models to respond to the same SST differences with opposite signs of precipitation differences over Southern California. This makes it clear that improved prediction over California will require improved SST forecasts and improved simulation of the atmospheric response to forecast SST anomalies."}]