[{"section_title": "Abstract", "text": "word count: 175 Structural Brain Correlates of Adolescent Resilience Abstract Background. Despite calls for integration of neurobiological methods into research on youth resilience (high competence despite high adversity)\n, we know little about structural brain correlates of resilient functioning. The aim of the current study was to test for brain regions uniquely associated with positive functioning in the context of adversity, using detailed phenotypic classification. Methods. 1,870 European adolescents (M age 14.56 years, SD age = 0.44 years, 51.5% female) underwent MRI scanning and completed behavioral and psychological measures of stressful life events, academic competence, social competence, rule-abiding conduct, personality, and alcohol use. Results. The interaction of competence and adversity identified two regions centered on the right middle and superior frontal gyri; grey matter volumes in these regions were larger in adolescents experiencing adversity who showed positive adaptation.\nDifferences in these regions among competence/adversity subgroups were maintained after controlling for several covariates and were robust to alternative operationalization decisions for key constructs. Conclusions. We demonstrate structural brain correlates of adolescent resilience, and suggest that right prefrontal structures are implicated in adaptive functioning for youth who have experienced adversity."}, {"section_title": "Structural Brain Correlates of Adolescent Resilience", "text": "The construct of resilience-high competence despite a history of high adversity-has captured the attention of clinical and developmental researchers for decades (Luthar, 2006) ; both developmental psychopathology (Cicchetti, 1984; Sroufe & Rutter, 1984) and positive psychology (Seligman & Csikszentmihalyi, 2000) perspectives have emphasized the scientific advantages of studying adaptive functioning in individuals as a complement to the study of disease and disorder (Kim-Cohen, 2007) . Although complicated by challenges of definition, measurement, and data analysis (Luthar, Cicchetti, & Becker, 2000) , research on resilience in youth has converged on a number of important findings (Luthar, 2006) . First, resilience following significant adversity can be widespread, and is often associated with what has been termed the \"ordinary magic\" (Masten, 2001) of strong fundamental adaptive systems such as receiving positive parenting, high cognitive ability, socioeconomic resources, and broad social support. Second, in-depth research on resilience depends on assessment of major domains of competence, often conceptualized as developmental tasks that vary in salience by age (Roisman, Masten, Coatsworth, & Tellegen, 2004) . Finally, resilience research has benefited from both variable-centered methodological approaches in which continuous variation of constructs is analyzed, as well as person-centered approaches-the approach taken in the current study-in which participants are classified into a number of categories based on their experienced adversity and demonstrated competence status (Masten, 2007) .\nMore recent reviews of the resilience literature have called for attention to the neurobiological and brain-based correlates of resilience (Charney, 2004; Curtis & Cicchetti, 2003) . Following these calls, several investigations have documented both neurobiological (e.g., stress hormone changes; EEG asymmetry) correlates of resilient adaptation in youth (Cicchetti & Rogosch, 2007; Curtis & Cicchetti, 2007) as well as interactions between genetic/neurobiological variables and environmental context in predicting resilience (Cicchetti, & Rogosch, 2012) . This research demonstrates both the multilevel and thus partly biological embeddedness of the phenomenon of resilience, as well as the complexities of biological/environmental interaction (e.g. variations in effects of specific genetic loci depending on environmental context).\nIn terms of brain imaging work on resilience, theorists have focused on the prefrontal cortex (among other brain regions) given its crucial role in planning and coordination of complex behaviors and mediation of emotional responses (Curtis & Cicchetti, 2003) , including adaptive responses to fearful stimuli (Haglund, Nestadt, Cooper, Southwick, & Charney, 2007) . However, empirical work in this area remains sparse, and the direct examination of differences in brain structure or function among high-adversity youth who are classified as \"doing well\" in major age-salient developmental task domains is absent.\nIn adults, structural and functional imaging work in this area has often focused on studies of individuals who do or do not meet criteria for Post-Traumatic Stress Disorder (PTSD) following a traumatic event, although more sophisticated sampling and design procedures are beginning to appear (see van der Weff, Pannekoek, Stein, & van der Wee, 2013, for related discussion) . It is important to stress that these studies differ from youth resilience research in multiple ways, notably in the focus on a single traumatic event rather than broad measures of adversity as well as a focus on PTSD symptoms as an outcome rather than broad measures of competence (Bonanno & Diminich, 2013) . However, such adult-based studies remain of interest given the lack of youth-focused imaging studies, with functional and structural imaging approaches seen as complementary and of importance.\nAs brief examples of functional imaging studies, police officers who did not show PTSD symptoms following exposure to a shooting showed increased medial prefrontal cortex activity (and decreased left amygdala activity) during fMRI scanning while exposed to event cues (Peres et al., 2011) . In addition, Special Forces personnel free from PTSD diagnoses despite exposure to traumatic events have shown differing fMRI activity in the subgenual prefrontal cortex (PFC) relative to age and sex matched civilian controls (Vythilingam et al., 2009 ). Reynaud et al. (2013) reported functional activation of right amygdala and left orbitofrontal regions in firefighters who score high on a scale of trait hardiness, a construct related to resilience. Finally, van der reported unique resting state functional connectivity profiles for adults who experienced childhood maltreatment but who did not go on to meet criteria for any DSM-IV axis I disorder. As noted above, we are not aware of youth fMRI studies of broad resilience, although some have investigated youth at risk for specific disorder categories (e.g., via family history): in particular, Heitzeg, Nigg, Yau, Zubieta, and Zucker (2008) demonstrated increased activation of the bilateral orbital frontal gyrus (OFG) and left insula/putamen in adolescent children of alcoholics with low levels of problem drinking.\nFew investigations have focused on structural brain correlates of resilient adaptation. Gilbertson et al. (2002) report data from a sample of monozygotic adult twins discordant for trauma exposure, detecting smaller hippocampal volumes based on severity of affected-twin PTSD even in unaffected co-twins, suggesting that lower hippocampal volume is a risk factor for the development of PTSD in the face of trauma (and, conversely, that larger hippocampal volume may be stress-protective) rather than a consequence of trauma itself. Galinowski and colleagues (2015), using extreme-groups subsets from the IMAGEN study (the large sample also employed in the current study) found diffusion tensor imaging differences in the anterior corpus callosum between stress-exposed adolescents with low rates of mental illness (n = 55) versus stress-exposed adolescents with higher rates (n = 68). These studies demonstrate a key advantage of structural imaging approaches, which is that findings are independent of moment-to-moment contextual effects during assessment and thus may be a better marker of one's accumulated interacting genetic-environmental history. However, no study has yet combined structural imaging data with the rich, multi-method and multi-domain assessments of adaptation characteristic of \"gold standard\" studies of resilience in youth, and many of the studies reviewed above are limited by relatively small sample sizes.\nThus, the primary goal of the present project was to determine whether structural brain differences would be observed when adolescents who have experienced adversity yet are doing well in life were compared with both youth not at risk and youth not doing well, utilizing a largescale sample with a range of experienced adversity and competence. Because of the limited number of empirical studies in this area, we did not have strong a priori predictions; however, we expected to find evidence for prefrontal differences in resilient vs. non-resilient youth given the well-documented role of the PFC in prior adult work (e.g., Peres et al., 2011; Vythilingam et al., 2009 ) as well as the importance of behavioral-based measures of planning and cognitive control in predicting resilient adaptation in prior youth work (e.g., Masten et al., 2004) .\nAs a secondary goal, we were interested in testing whether any identified brain regions would be associated with problematic drinking. We viewed this test as a potential extension of our results, examining prediction against a criterion that is related to competence (and psychopathology) but separate from our defining outcome measures. While problematic alcohol use can disrupt multiple developmental task domains, and is potentially quite dangerous, abstention from alcohol is not itself considered a developmental task, as some alcohol use is statistically normative in adolescence (Masten, Faden, Zucker, & Spear, 2008) . Therefore, we were interested if variation in identified brain regions would relate to this measure, both in the whole sample as well as within any identified resilient groups."}, {"section_title": "Methods and Materials", "text": "Participants Data for the current project come from the IMAGEN study (Schumann et al., 2010) , representing eight sites across Europe: London, Nottingham, Dublin, Mannheim, Berlin, Hamburg, Paris and Dresden. Adolescent participants (N = 1,870; 51.5% female; M age = 14.56 years, SD age = 0.44 years, range = 12.93-16.55 years; 10.8% left-handed) completed a series of self-report and interview measures, as well as structural MRI scans. Parent-report data were also included for some constructs. Local ethics research committees at each site approved the study.\nOn the day of assessment, written consent was obtained from the parent or guardian, and verbal assent was obtained from the adolescent. Detailed description of recruitment and inclusion/exclusion criteria are provided in Supplemental Appendix SA1, and additional information is available from Schumann et al. (2010) . For purposes of genetic analyses, the IMAGEN sample was designed as ethnically homogeneous; recruitment targeted individuals with all four grandparents from the indicated country. Participants were included in the current study if they responded to one or more of our primary measures of competence. All data reported below were cross-sectional."}, {"section_title": "Measures", "text": "Life-Events Questionnaire (LEQ). The Life-Events Questionnaire (LEQ), from which we drew items reflecting experienced adversity, is an adaptation of the Stressful Life-Event Questionnaire (Newcomb, Huba, & Bentler, 1981) , which uses 39 items to measure the lifetime occurrence and the perceived desirability of stressful events covering the following domains:\nFamily/Parents, Accident/lllness, Sexuality, Autonomy, Deviance, Relocation, and Distress. The life-events valence labels were as follows: 'Very Unhappy', 'Unhappy' ,'Neutral', 'Happy', 'Very Happy'. Specific items used in the current study are detailed below and in Supplemental Appendix SA2."}, {"section_title": "Development and Well-Being Assessment Interview (DAWBA). Individual items", "text": "assessing key competence domains were taken from the DAWBA (Goodman, Ford, Richards, Gatward, & Meltzer, 2000) , a series of semi-structured interviews and questionnaires completed by the adolescents and their parents. The DAWBA assesses a variety of domains and, depending on content area, items are scored as either present or absent, on a 3-point scale (never/sometimes/often), or a 4-point scale (never/perhaps/current/past year). For the purposes of the present study, 3-point and 4-point DAWBA items were recoded into absent versus present (within the past year)."}, {"section_title": "Strengths and Difficulties Questionnaire (SDQ).", "text": "The SDQ (Goodman, 1997 ) is a 25item questionnaire completed by both adolescents and parents in the current study. It is divided into five subscales: emotional symptoms, conduct problems, hyperactivity/inattention, peer relationship problems, and prosocial behaviors. Each item is scored on a three-point scale (0 = not true, 1 = somewhat true, 2 = certainly true)."}, {"section_title": "ESPAD.", "text": "The European School Survey Project on Alcohol and Drugs (ESPAD; Hibell et al., 1997) was administered using the computerized assessment platform Psytools (Delosis, London, UK). Psytools presented questionnaire items and response alternatives on a computer screen, with jump rules to skip inapplicable questions for the sake of brevity. As the Psytools program was run at the participant's home without direct supervision by the research team, the reliability of individual data was checked in a two-stage procedure. Before every task, adolescents were asked to report on the current testing context including questions about their attentional focus and the confidentiality of the setting. Automated flags highlighted potentially problematic testing situations and were followed up by research assistants in confidential face-toface sessions. Final reliability ratings were assigned which led to exclusion of the data in certain cases. Specifically, exclusion criteria for substance use measures included an indication that the participant was in a hurry, somebody was watching, or an indication of having known of or taken the sham drug \"Relevin\".\nESPAD variables were primarily employed to construct a composite variable of binge drinking risk, detailed below. However, a single ESPAD variable (self-reported grades) was included as part of the academic competence construct.\nCovariates. Age, sex, pubertal development, verbal and performance IQ, study site (dummy-coded), handedness, and total gray matter volume (GMV) were included as nuisance covariates, to determine whether any group differences in brain structure remained after accounting for these potential confounds. In addition, in a subset of analyses detailed below, five-factor personality (from the NEO-FFI; Costa & McCrae, 1992) and socioeconomic status (SES 1 ) were added as additional potential confounds. Pubertal development was assessed by an 8-item self-report scale based on Tanner stage (resulting in 5 ordered categories), assessing growth in stature and pubic hair as well as menarche in females and voice changes in males (Petersen, Crockett, & Richards, 1988) . IQ was assessed using four subscales of the Wechsler Imaging. Details of the magnetic resonance imaging (MRI) acquisition protocols and quality checks have been described previously, including an extensive period of standardization across MRI scanners (Schumann et al., 2010) . MRI Acquisition Scanning was performed at the eight IMAGEN assessment sites with 3T whole body MRI systems made by several manufacturers (Siemens: 4 sites, Philips: 2 sites, General Electric: 1 site, and Bruker: 1 site). To ensure a comparison of MRI data acquired on these different scanners, we implemented imageacquisition techniques using a set of parameters compatible with all scanners that were held constant across sites. High-resolution anatomical magnetic resonance images were acquired, including a 3D T1-weighted magnetization prepared gradient echo sequence (MPRAGE) based on the ADNI protocol (http://www.loni.ucla.edu/ADNI/Cores/index.shtml), with parameters adjusted to allow an isotropic 1.5mm voxel size. Full MRI acquisition parameters are provided in Supplemental Appendix SA4, with quality controls described in Supplemental Appendix SA5.\nStructural MRI processing included data segmentation and normalization (to the Montreal Neurological Institute template) using the SPM (Wellcome Department of Neuroimaging) optimized normalization routine (Ashburner & Friston, 2005) . Gray matter images were modulated (a typical post-processing step that scales the grey matter volume estimates to correct for changes brought about by the spatial normalization), and total gray matter volume included as a covariate, thus facilitating comparisons of regional volumetric, rather than tissue concentration differences (Ashburner & Friston, 2000) . The spatially normalized and modulated gray matter partitions were smoothed using an 8 mm full-width at half maximum Gaussian kernel allowing parametric statistical analysis. The planned comparisons were multiple-comparison corrected using a combination of uncorrected p values (p < .005) and a cluster extent of 356 voxels, thus correcting for multiple comparsions via a familywise error of p < .05 calculated using AFNI's 3dClustSim (Cox, 1996) ."}, {"section_title": "Data Reduction: Construction of Competence and Adversity Scores", "text": "Adversity. Judgments of adversity were made from self-report data on the LEQ.\nParticipants provided lifetime information on 39 potentially stressful life events; as data were also collected on the emotional impact of each event, we selected only those events for each participant which resulted in negative reported effects. In addition, ten events (e.g., trouble with the law, running away from home, receiving poor grades) were excluded from consideration as they were not independent of participant's own competence-relevant behavior, following prior resilience research (Gest, Reed, & Masten, 1999) . A total count of independent negative life events was calculated (range = 0-12; M = 3.73; SD = 1.96).\nCompetence. Continuous scores of competence in age-salient developmental tasks were constructed by averaging standardized scores across four domains: rule-abiding conduct, social skills and relationships, academics, and absence of internalizing problems (anxiety and depression). In each case, variables were first aggregated and standardized within measure, with extreme scores truncated at +/-3 SD from the mean. Rule-abiding conduct (α = .78) was a combination of 15 self-and parent-reported dichotomized DAWBA items assessing rulebreaking behavior within the past year (e.g. lies, fights, bullies) as well as 5 self-and 5 parentreported (0-2 scale) SDQ items (irritable, disobedient, fights/bullies, lies/cheats, and steals).\nOnce aggregated, these variables were reverse-scored such that higher scores represented greater rule-abiding conduct. Social competence (α = .80) was a combination of 10 self-and 11 parentreported DAWBA items representing prosocial behavior (each scored on 0-2 scale: sample items include \"generous\", \"outgoing/sociable\", \"caring\", \"good with friends\", and \"polite\") as well as 10 self-and 10 parent-reported SDQ items representing the Peer Problems (reversed) and\nProsocial Behavior subscales.\nAssessment of academic competence (α = .59) included two parent-reported DAWBA items (0-2 scale; \"good at school work\" and \"general reasoning and school work\"), one selfreported DAWBA item (0-2 scale; \"good at school work\"), and one ESPAD item (8-point scale representing \"A\" to \"C-\") assessing overall school performance. Finally, emotional health (α = .73) was measured as the reverse of 5 self-and 5 parent-reported SDQ Emotional Symptoms items.\nFull item descriptions of all variables entering into competence classification are presented in Supplemental Appendices SA6-SA9. Consistent with prior work (Achenbach, McConaughy, & Howell, 1987) , agreement between self-and parent-report on sub-components was moderate: conduct SDQ, r = .33; conduct DAWBA, r = .30; social competence, r = .27; academics, r = .49; and emotional health, r = .37, all ps < .001.\nCompetence/adversity groupings. Following prior resilience studies , we classified adolescents using two dichotomized variables. First, high/low competence scores were created based on whether participants scored within normal limits-operationalized as a zscore of -0.5 or above per prior research ) -on all four competence domains. This is a stringent definition of \"doing well\" as it encompasses not only meeting external developmental task criteria but also non-elevated emotional symptoms.\nSecond, high/low adversity scores were created based on participants scoring +1.0 SD or higher on negative independent lifetime events. Based on descriptive statistics, this cutoff represented 6+ events.\nThese two variables (high vs. low competence and high vs. low adversity) were used in our core voxelwise and ANCOVA analyses. Crossing them created an exclusive and exhaustive classification of our sample into one of four groupings, which we abbreviate below using the designations of \"C\" for high competence, \"c\" for low competence, \"A\" for high adversity, and \"a\" for low adversity: high competence and low adversity \"C/a\" (N = 643), sometimes termed \"competent\"; high competence and high adversity \"C/A\", termed \"resilient\" (N = 124); low competence (in at least one domain) and high adversity \"c/A\", sometimes termed \"maladaptive\" in prior research (N = 225); and low competence (in at least one domain) and low adversity \"c/a\" (N = 878), sometimes termed \"vulnerable\". Note that the final group contains a larger proportion of participants than seen in some prior studies, which is likely a consequence of including emotional health as a competence domain."}, {"section_title": "Results", "text": ""}, {"section_title": "Missing Data", "text": "The working sample for the current study were participants who had non-missing data for at least one competence indicator, thereby allowing computation of competence composites in some form (N = 1,870 across 8 sites; see Table 1 ). From this working sample, there were no missing data on life stress, sex, site, and gray matter volume. Missing data percentages for other included variables ranged from a low of 0.4% (age) to a high of 7.4% (IQ), or 8.8% when including the secondary covariate of SES. For consistency with prior IMAGEN studies, for variables with missing data-age, pubertal status, handedness, IQ, personality, and SESmissing values were replaced via site-and-sex-specific mean imputation."}, {"section_title": "Descriptives and Preliminary Analyses", "text": "Mean verbal IQ for the sample was 107.64 (SD = 14.37) and mean performance IQ was 110.78 (SD = 14.50). In terms of pubertal status, 1%/0% of males and females, respectively reported Tanner stage I, 12.7%/0.1% stage II, 50.9/9.8% stage III, 34.5%/80.2% stage IV, and 0.9%/10.0% stage V. Regarding associations among primary study variables, the four competence domains were moderately intercorrelated (rs ranging from .13-.38, all ps < .001).\nAggregated competence (z-scores averaged across domain) was modestly negatively associated with adversity, r = -.13, p < .001.\nFor group comparisons, we first tested whether or not the C/A group experienced similar "}, {"section_title": "Brain Structure Differences in Competence/Adversity Groups", "text": "Significant effects, representing anatomical volumetric differences between the competence and adversity variables, were identified in six regions. Two regions, one showing a main effect of competence and one showing a main effect of adversity, overlapped substantially (40% and 77%, respectively) with a larger cluster showing a significant interaction between competence and adversity. Given our particular focus on interactive effects, these main effect regions were dropped in lieu of the overlapping interaction area, leaving four regions of focus (see Table 2 and Figure 1 ). First, a main effect of competence was observed in the left orbitofrontal gyrus (Figure 1 , yellow cluster; greater volumes in the C/a and C/A groups relative to the other two): 2 = .008, p < .001. Second, significant interactions between competence and adversity were observed in two right frontal areas: the right middle frontal, 2 = .009, p < .001, and right superior frontal, 2 = .009, p < .001, gyri (Figure 1, red and blue clusters, respectively) .\nIn each case, post-hoc tests using Tukey's LSD method showed that effects were driven by elevated volumes in the C/A group relative to other groups; in the right superior frontal region, post-hoc tests also showed greater volume in the c/a group relative to the c/A group. Finally, a crossover interaction between competence and adversity was observed in the fusiform gyrus, 2 = .006, p = .001 (Figure 1, green cluster) , such that the C/a and c/A groups showed greater volumes than the c/a and C/A groups.\nResults were re-run excluding left-handed participants; all effects remained significant, with effect sizes within .001 of original values. Additionally, to test whether or not our missing data strategy affected our results, we repeated the analyses described above restricting our sample to only those participants who had valid data on all measures (N = 1,547); all findings remained statistically significant, and no new findings emerged, with all effect sizes (partial etasquared) within .002 of original values. Additionally, we re-ran our primary ANCOVA analyses testing continuous adversity and competence predictors (using aggregate competence across domains) and their interaction, as well as multiple alternative competence and adversity thresholds, finding broadly similar results in all cases; details of these robustness checks are provided in Supplemental Appendix SA10."}, {"section_title": "Follow-up Analyses", "text": "Personality and SES covariates. As expected, personality dimensions differed across groups. Specifically, c/A and c/a youth scored higher on neuroticism and lower on extraversion, agreeableness, and conscientiousness, than youth in the other two groups; in addition, c/a youth scored lower on openness to experience than C/a and C/A youth, and C/A youth scored higher on openness to experience than c/A youth. These results suggest that personality variables generally tracked competence composites. In addition, SES also differed across groups, with the C/a group showing higher SES than the C/A and c/a groups, with the c/a group also higher than the c/A group. Therefore, we tested whether or not ANCOVA results were affected by inclusion of personality variables and SES as covariates. In all cases, inclusion of these variables resulted in the same pattern of results: brain structure differences reported above were maintained at p < .01 and partial eta squared values held within .002 of original values. Personality variables were themselves modestly associated with ROI volumes (i.e., correlations with average grey matter volume for each region). Specifically, agreeableness was negatively correlated with GMV for the right superior frontal gyrus (r = -.07, p = .003) and right middle frontal gyrus (r = -.05, p = .033), two of the ROIs associated with the interaction of adversity and competence. Neuroticism was negatively correlated with GMV for all ROIs excepting the right MFG, rs ranging from -.06 to -.12, all ps < .05. Brain regions were also modestly correlated with maternal SES: right SFG r = .06, p = .01, right MFG r = .05, p = .028, left OFG r = .08, p < .001, right fusiform r = .12, p < .001.\nCorrelation with problematic drinking. Finally, we examined whether volumetric differences across the four ROIs predicted scores on a problematic drinking composite variable derived from the ESPAD assessment. The drinking composite variable (valid N = 1,433)\nrepresented an aggregate of 13 questions related to frequency of binge drinking and being drunk as well as alcohol tolerance (M = 20.04, SD= 9.64). For each group, partial correlations were conducted between ROI volumes and problematic drinking, controlling for total GMV. For the C/A group, one ROI negatively predicted problematic drinking: this was the right middle frontal gyrus ROI (partial r = -.22, p = .023; Figure 1, red cluster and scatterplot) . As a comparison, in the C/A group the multiple correlation predicting binge drinking from all five age 14 personality variables taken together was .16. No other ROI was associated with problematic drinking for any other group, partial rs ranging from -.07 to .05, ps ranging from .47 to .95."}, {"section_title": "Discussion", "text": "Despite prominent calls (Charney, 2004; Curtis & Cicchetti, 2003) for greater attention to the neurobiological and brain correlates of resilience, relatively few empirical reports are available in this area. In addition, existing studies are commonly limited by small sample sizes or special populations. The present study sought to fill this gap by examining structural brain differences in a large sample of European adolescents, while also following the developmental psychopathology literature on resilience in paying attention to assessment and aggregation of key outcome variables that represent attainment of age-salient developmental tasks.\nBased on crossing experienced adversity with a comprehensive aggregation of multiple developmental task domains key to adaptive functioning in adolescence-academics, social relationships, rule-abiding conduct, and emotional health-we grouped adolescents into competent (C/a), resilient (C/A), maladaptive (c/A), and vulnerable (c/a) categories. Notably, structural brain regions which differentiated these groups were located primarily in the right prefrontal area, suggesting that mechanisms related to executive control are implicated in resilience. Because C/A youth did not show greater average competence than their low-adversity peers, these results are not explicable by associations between brain volume and competence, but rather represent the conjunction of competence and adversity, and our robustness checks suggest that these results were not unduly driven by a particular choice of competence or adversity threshold. In addition, within the C/A subgroup, grey matter volume in the right middle frontal gyrus correlated with an important measure not included in the set of competence-defining indicators, namely risk of problems with alcohol use, with magnitude of prediction exceeding that of five broad personality variables together for the same outcome.\nGiven the role that the prefrontal cortex is likely to play in competence and resilience, based on both theoretical grounds and the small extant literature, we focus our discussion on the three effects that were observed there, noting that a more complex pattern of effects was observed in the fusiform gyrus. Further, psychological or functional interpretations of the observed structural effects are necessarily post hoc so should be treated with caution. With this caveat in mind, it is nonetheless of interest that right prefrontal cortex should be associated with resilience given the role of these frontal regions in emotional, behavioral and stress regulation and in executive control (Aron, Robbins, & Poldrack, 2014; Munakata et al., 2011; Staudinger, Erk, & Walter, 2011; Whelan et al., 2012) as well as prior resilience-relevant evidence that unaffected siblings of stimulant-dependent adults show functional hyperactivation of prefrontal areas (Morein-Zamir, Jones, Bullmore, Robbins, & Ersche, 2013) . In addition, these findings are consistent with prior behavioral evidence that suggests important roles for planning ability in fostering resilience in high-risk contexts (Rutter, 2013) as well as the role of cognitive ability more generally in buffering response to stress, reported for depression by Riglin and colleagues (2015) , and the potential role of PFC functioning in promoting healthy sleep as a component of resilience (Silk et al., 2007) Similarly, that the orbitofrontal cortex should be associated with competence, as assessed across a broad range of domains, may be related to the broad role that this region has in affective and social processes and their integration (Blumberg et al., 2003; Perlman et al., 2014; Watanabe & Sakagami, 2007) .\nWe stress that observed associations between ROIs and resilient outcome are correlational and do not represent a reduction of psychological resilience to the level of analysis of brain images. Nonetheless, these results represent a contribution to multilevel studies of resilience, proponents of which have highlighted the potential implications of this broad area for prevention and intervention work with at-risk youth (Curtis & Cicchetti, 2003) . At this point intervention implications remain largely speculative, but as our structural measurements become more detailed and we accumulate more information about the functions and interconnectivity of varied brain regions, it may be possible to use such data as part of assessments for the evaluation of intervention effectiveness, in combination with behavioral data and other genetic and neurobiological information (Curtis & Cicchetti, 2003) .\nBesides the cross-sectional nature of our data, this study has other important limitations.\nOur competence measures include information only from parental report and adolescent report, so we lack data on adjustment from sources outside the immediate family; more important, our measure of adversity comes entirely from adolescent report. Our competence measures were also not fully parallel across all domains, with different measures contributing to the estimates for different domains. Further, although our decisions in operationalizing and combining competence domains are based on prior resilience research, they represent a series of studyspecific choices and await replication with other operationalizations of resilience. In particular, our global adjustment composite approach can be contrasted with a focus on predicting specific outcome domains (Luthar et al., 2000) , and our threshold of average-level competence or greater in four domains led to a greater frequency of the two low-competence groups as compared to some prior work. In addition, our overall sample association of adversity and competence was modest, although within the range of related prior work . Our study is also limited in its focus on a single structural measurement, gray matter volume. To help address this latter issue in future research, we urge study of additional structural brain measurements and we echo the call of van der Werff and colleagues (2013) for greater study of the interconnectivity of brain networks theorized to be relevant for resilient adaptation.\nThese limitations notwithstanding, this investigation suggests that there are identifiable brain regions associated with resilient adaptation in adolescents-as defined by high competence despite high adversity-and that these differences are not simply due to common covariates such as IQ or personality traits. The identified regions are primarily in the right prefrontal cortical areas, suggesting that mechanisms of executive control may be of key importance in resilient outcomes."}, {"section_title": "Key Points:", "text": " Recent reviews of the resilience literature have called for focused attention on the neurobiological and brain-based correlates of resilience.\n The present study tested structural brain correlates of resilience, as defined by positive outcomes despite experiencing adversity, in a large adolescent sample.\n Increased grey matter volume was detected in right prefrontal areas in adolescents who were functioning well across multiple domains despite high life stress, and analyses controlled for personality, IQ, and SES.\nAuthor's Note Notes. Data represent MNI coordinates for each region's center of mass. BA = Brodmann Area. "}, {"section_title": "Figure Caption", "text": ""}, {"section_title": "SA1: IMAGEN study recruitment and inclusion/exclusion criteria", "text": "For details on the recruitment procedures for the IMAGEN study, please see: http://www.imageneurope.com/en/Publications_and_SOP.php, Work Package 4, chapter 3. "}, {"section_title": "Category Criterion Action", "text": ""}, {"section_title": "SA4: MRI acquisition parameters", "text": ""}, {"section_title": "SA5: MRI and data coding quality controls", "text": "A set of parameters compatible with all scanners, particularly those directly affecting image contrast or signalto-noise, was devised and held constant across sites. Where manufacturer-specific choices had to be made (for example, the design of head coil), the best manufacturer-specific option was used at all sites with the same scanner type. Two quality control procedures were regularly implemented at each site: (1) The American College of Radiology phantom was scanned to provide information about geometric distortions and signal uniformity related to hardware differences in radiofrequency coils and gradient systems, image contrast and temporal stability, and a custom phantom (Tofts et al., 2000) was scanned for diffusion-related parameters.\n(2) Several healthy volunteers were regularly scanned at each site to assess factors that cannot be measured using phantoms alone and at multiple sites to determine inter-site variability in structural and functional measures (for example, tissue contrast in raw MRI signal, tissue relaxation properties). The details of both quality control procedures are shown below. "}, {"section_title": "Construction of Competence Domains General Description", "text": "For all domains, items were first aggregated within measure, and then converted to z-scores. After truncation at +/-3SD from the mean, items were aggregated across informants and measures. Note that for problem-focused items, response scales were recoded from original measures such that higher scores = more competent/adaptive."}, {"section_title": "SA6: Items included in rule-abiding conduct", "text": "Measure/informant Item Response scale for current study DAWBA adolescent & DAWBA parent Often lies 0 = perhaps, current, or past year, 1 = no Often starts fights (as above) Often bullies (as above) Often stays out later than supposed to (as above)"}, {"section_title": "Steals", "text": "(as above) Has run away more than once (as above) Truant 0 = yes, 1 = no Used a weapon 0 = true within past year, 1 = no Cruel to people (as above) Cruel to animals (as above) Firesetting (as above) Property destruction (as above) Mugging (as above) Forced sex (as above) Broken into a house/car (as above) SDQ adolescent & SDQ parent Irritable 0 = certainly true, 1 = somewhat true, 2 = not true Obedient 0 = not true, 1 = somewhat true, 2 = certainly true Fights, bullies 0 = certainly true, 1 = somewhat true, 2 = not true Lies, cheats 0 = certainly true, 1 = somewhat true, 2 = not true Steals 0 = certainly true, 1 = somewhat true, 2 = not true"}, {"section_title": "SA7: Items included in academic competence", "text": "Measure/informant Item Response scale for current study DAWBA parent School work / ability to reason things out 0 = behind; 1 = average; 2 = ahead Good at school work 0 = no/not true, 1 = a little, 2 = a lot DAWBA adolescent Good at school work (as above) ESPAD adolescent School performance 1 = C-; 2 = C; 3 = C+; 4 = B-; 5 = B; 6 = B+; 7 = A-; 8 = A"}, {"section_title": "SA8: Items included in social competence", "text": "Measure/informant Item Response scale for current study SDQ adolescent & SDQ parent Solitary, likes to play alone 0 = certainly true, 1 = somewhat true, 2 = not true Has at least one good friend 0 = not true, 1 = somewhat true, 2 = certainly true Generally liked 0 = not true, 1 = somewhat true, 2 = certainly true Picked on or bullied 0 = certainly true, 1 = somewhat true, 2 = not true Gets on better with adults than other children 0 = certainly true, 1 = somewhat true, 2 = not true Considerate of others' feelings 0 = not true, 1 = somewhat true, 2 = certainly true Shares readily 0 = not true, 1 = somewhat true, 2 = certainly true Helpful if someone is hurt 0 = not true, 1 = somewhat true, 2 = certainly true Kind to younger children 0 = not true, 1 = somewhat true, 2 = certainly true Often volunteers to help 0 = not true, "}]