[{"section_title": "Introduction", "text": "Organic U.S. beef production has increased over the past decade along with rising consumer demand for the product. Organic beef is increasingly available to consumers mostly through higher-end restaurants and grocery stores, farmers markets, and direct purchase from producers. In 2008, 63,680 beef cows were on U.S. organic farms compared with 13,829 in 2000, an increase of 460 per cent (USDA-ERS 2011). Although growth has been strong, organic beef continues to represent a small portion of total beef production; in 2008, 32.4 million beef cows calved in the United States, so organic beef production represented 0.2 per cent of total U.S. beef production that year. This is compared with larger percentages of dairy cows and layer hens being produced as organic in the United States in 2008, 2.7 and 1.5 per cent, respectively. Despite the relatively small size of the organic beef segment, alternative beef production systems have received greater attention in recent years as consumers have increasingly demanded natural, local, and/or grass-fed beef. Producers for these markets are the most likely candidates for organic production, many weighing its benefits and costs in making their decisions. The relatively small organic beef niche along with a paucity of data for organic beef farms likely explains the relatively low level of attention paid by economists to organic beef production. In 2008, certified organic beef cows were present in 39 states. The state with the largest number, California, had 13,177 cows, more than twice the number of the second-ranked state, Nebraska with 6213 (USDA-ERS 2011). With relatively few farms in each state, few state-level analyses have been conducted, and we are aware of no national profitability studies on the subject. Furthermore, little work has addressed organic beef production economics in other countries (Zevelova et al. 2003;Hrabalova and Zander 2006). The objective of this study is to determine differences between the costs and returns of U.S. organic beef cowcalf production and those of U.S. conventional beef cow-calf production. We use matching samples and appropriate weighting procedures to determine these differences."}, {"section_title": "Organic requirements", "text": "Of the major alternative beef production systems (natural, hormone-free, grass-fed, etc.), organic production standards are generally considered to be the most stringent. The transition period to certified organic beef production is at least three years, a period when the beef production system must be treated as organic, but beef cannot be sold as organic. Because farms transitioning to organic are effectively producing as if they were organic, their cost structures are likely to be similar to those of certified organic farms. United States certified organic beef production disallows genetic modification; irradiation of foods; and use of antibiotics, growth hormones, synthetic pesticides, non-organically grown feed, and processed sewage sludge as fertilizer (Roberts et al. 2007). Animals treated with antibiotics must be taken out of the organic program. Animals must have access to pasture and land must have been without chemicals for three years before its produced feed can be certified as organic. The applicant must prepare written farm plans and undergo audit trials prior to certification (Roberts et al. 2007). These restrictions serve to increase beef production costs. To cover the additional costs, a premium price for organic beef is required. Some U.S. cattle farmers opt instead to raise grass-fed beef as non-organic. Grass-fed beef is produced without grains or grain by-products. The animal must have continuous pasture access throughout the growing season and may be fed 'hay, haylage, baleage, silage, crop residue without grain, and other roughage sources' (USDA-AMS 2011). The decision to produce grassfed rather than organic beef is likely often owing to the stringent requirements of organic production, availability of quality forage, and U.S. consumers' increased interest in grass-fed beef, as analyzed by Umberger et al. (2009). Grass-fed beef disallows some feeds, such as grains, that are allowed in organic production."}, {"section_title": "Previous work", "text": "Studies comparing costs of organic and non-organic beef production include Zevelova et al. (2003), Acevedo et al. (2006), and Wileman et al. (2009). Zevelova et al. (2003) and Hrabalova and Zander (2006) evaluated organic beef farming in the Czech Republic, finding that further development of the organic industry would depend upon government support. Acevedo et al. (2006) compared costs of producing beef steers in Iowa, assuming animals were finished and slaughtered. The highest costs were for organic grain-fed, followed by organic grass-fed, and finally conventional grain-fed production, which was estimated to be the most profitable. Wileman et al. (2009) showed that a $0.28/lb of bodyweight premium would be required for an organically raised animal to yield equal net return to a conventionally raised animal. Research characterizing organic beef operations has included Roberts et al. (2007) and Wiegel (2009). Roberts et al. (2007) surveyed U.S. organic beef producers, finding that most had produced conventional beef prior to organic; most organic beef herds had <100 cows; the average organic beef farm included 3200 acres; and 95 per cent were cow-calf, with 70 per cent raising finished beef (Roberts et al. 2007). Wiegel (2009) conducted case studies with 11 Missouri organic producers, three of whom produced organic beef. Results showed that dairy, produce, and row-crop farmers perceived greater economic advantages associated with organic production than did livestock/poultry farmers. She found that livestock farmers had fewer opportunities to observe organic livestock production prior to committing to it, perceived the complexity of organic production to present greater challenges, and had less opportunity to try organic production on a trial basis prior to committing to it. These results help to explain the relatively low level of adoption of organic beef production."}, {"section_title": "Materials and methods", "text": "Production economists have typically compared cost and/or profitability of production systems in one of several ways, common methods including (i) using experimental data to develop cost and return estimates for systems and comparing resultant performance measures (Gillespie et al. 2008), (ii) using regression analysis to determine the system impacts on performance measures (McBride and Greene 2009a), and (iii) comparing systems using efficiency measures derived from production frontiers (Nehring et al. 2009). An alternative is to compare costs and profitability of firms using one system directly with those of other firms similar in size and structure, but using a different system. In these cases, for each firm i using system W = 1, another firm is identified that is similar to i, but using system W = 0. This is the basis for the method of matching samples. If Y i (W i ) is the performance measure (outcome) for firm i for a given system, what is compared are Y i (1) and Y i (0), performance measures of firm i if treated or not treated, respectively. The method of matching samples has been used extensively in medical studies, with early applications by Cochran (1953) and Billowicz (1964), but has only recently been used by agricultural economists (Tauer 2009). It is useful for binary treatments, such as whether a medical procedure has been used or a technology adopted, and the objective is to determine the treatment's effect on a scalar performance measure, that is, survivability or profit. Two assumptions are required for effective use of the method (Imbens 2004): (i) overlap, that the two treatment groups have overlapping characteristics and (ii) unconfoundedness, that specific firm characteristics can be used to correct for selection bias. If selection bias cannot be effectively controlled for, then differences found for the outcome will be biased. Six treatment effect measures can be estimated using matching samples. These include the population average treatment (PATT) and sample average treatment (SATT) effects for the subpopulation of the treated, both average treatment effects for the treated (ATT) measures; the population average treatment (PATC) and sample average treatment (SATC) effects for the subpopulation of the non-treated control, both average treatment effects for the non-treated control (ATC) measures; and the population average treatment (PATE) and sample average treatment (SATE) effects, which include all observations, both the treated and the control, both average treatment effects (ATE) measures. Whether population or sample effects should be estimated depends upon whether inference is to be made for another sample that would be drawn from the population, where the population effect would be estimated, or if inference is to be made only for the sample, where the sample effect would be estimated. Using ATT measures, non-treated control(s) are matched with each treated observation to measure treatment effects. ('Control' would be plural if more than one match were used for each treated observation.) Using ATC measures, treated observation(s) are matched with each non-treated control. Using ATE measures, non-treated control(s) are matched with each treated observation and treated observation(s) are matched with each non-treated control. For this study, the SATT was chosen because we had a small subsample of treated (organic) farmers. Only 0.7 per cent of our U.S. cow-calf farmer sample was certified organic, so we matched treated farmers directly to farmers from the 99.3 per cent (untreated control) group to determine how the organic treatment influenced organic farm productivity. The ATC measures would have matched each of the 99.3 per cent of non-organic farmers to one of the 0.7 per cent of the sample that were organic farmers. The questionable appropriateness of estimating ATC measures in this case likewise extends to ATE estimates. Because our treated group is a relatively small subsample of the total cow-calf producer sample, we do not estimate population effects. The SATT, which we measure, is estimated as from Abadie et al. 2004: where N 1 is the number of farms receiving the treatment (organic). Multiple criteria may be used to match treated with untreated observations. If k variables are to be used to identify matched farms, then a k • k weighting matrix is used to find nearest matches. A k • k diagonal matrix of the inverse sample standard errors of the matching variables serves as the weighting index. Thus, the weighting matrix allows for normalization of the variables by their standard deviations. Suppose treated firm i has covariate values represented by x. A potential match for i has covariate values s, so ||s -x|| V represents the distance between vectors s and x. If M matches are to be selected for each treated observation, then all matches will be at least as close as the Mth match is to the treatment observation. In the case of SATT in Equation 1 , the estimate of the non-treated control depending upon the number of matches used. Abadie et al. (2004) and Tauer (2009) provide extensive discussion of these methods that is not repeated here. In finding closest matches using this method, nearest matches may still look different from the treated group. In the general case for ATE measures, bias may be reduced by estimating separate regression functions for the treated and untreated groups, with independent variables being the covariates included in matching the samples: For the SATT, this amounts to regressing the untreated control variable of interest (cost, profit, etc.) against all matching variables. Only those untreated control observations that are matched to the treated group are included in the regression, rather than including all untreated observations in the dataset. Following Rubin (1979) and Abadie et al. (2004) and similar to Tauer (2009), we use this method to correct for selection bias and refer the reader to those articles for greater detail on the biascorrection procedure. The z-test is used to determine differences in means, with differences considered at P £ 0.10. Because of correlation across observations within a strata using USDA's Agricultural Resource Management Survey (ARMS) data (which we use), the survey design makes a homoscedastic estimate unlikely. Thus, robust standard errors are estimated using the Huber-White estimator (Huber 1967;White 1980). Readers interested in STATA's nnmatch command for the method of matching samples are referred to Abadie et al. (2004)."}, {"section_title": "Data", "text": "Phase III 2008 ARMS, cow-calf version, data are used for this study. The data include 1966 usable observations from 22 United States. Farms included in the survey were chosen from a list held by the USDA-National Agricultural Statistics Service. These farms must have had ‡20 beef cows on the operation during 2008. In 2007, farms with <20 cows represented 53 per cent of U.S. beef farms according to the 2007 U.S. Census of Agriculture, but these farms represented only 10 per cent of the U.S. beef cow inventory. The farms in this sample represent 96 per cent of U.S. beef cow-calf farms having ‡20 beef cows (McBride and Mathews 2011). There was no limitation on other segments the cow-calf operator could also be involved with, such as the stocker or finishing segments of the beef industry. Roberts et al. (2007) reported that 95 per cent of U.S. organic beef producers were cow-calf producers. The ARMS includes expansion factors, or weights, for each observation to expand to the farm population. These weights are used for our analysis. Of the 1966 observations, 14 were classified as organic and four were classified as transitioning-to-organic. Thus, if each organic farm were matched to one non-organic farm, then 14 • 2 = 28 observations would be used for the analysis. Likewise, if both organic and transitioning (organic + transitioning) farms were used, then 18 • 2 = 36 observations would be used. The advantage of one match is that the farm closest by the selection criteria to the treated farm is compared with the treated farm."}, {"section_title": "Performance measures", "text": "We examine return, cost, and other productivity measures using matching samples. We also examine Calf Price. Because transitioning farms do not receive organic premiums, return measures are compared using only certified organic operations and their matched farms. Cost and productivity measures are examined for both certified organic only and combined organic + transitioning farms, as similar input use among transitioning and organic farms would be expected to yield similar cost structures. It is, however, acknowledged that transitioning farm cost structures may not have yet stabilized as their operators continue to climb a relatively steep learning curve."}, {"section_title": "Variables used for matching farms", "text": "Using matching samples, variables can be designated for exact matches. We chose five variables for exact matching: farm resource region in which the farm resided (USDA-ERS 2012); state in which the farm resided; farm size category as <100 Cows, 100 £ Cows < 200, 200 £ Cows < 400, or ‡400 Cows; whether the farm backgrounded calves past weaning; and whether the farm finished cattle to slaughter weight. As cow-calf production is conducted under widely varying forage types and climatic conditions, organic and their matched non-organic farms were to be located in the same farm resource region (Heartland, Southern Seaboard, etc.). These regions include similar farm types and production characteristics. Farm resource regions are, however, large, covering multiple states. Farms were further required to be located in the same state. Most states include multiple farm resource regions, making the effective allowable area for matching smaller than a state. Together, these variables ensured that organic and their matching nonorganic farms were operated under similar production conditions. Farm size category was used for exact matching to ensure that scale economies did not impact cost structure differences between organic and matched non-organic farms. The variables backgrounding and finishing of cattle indicate whether the farm had vertically integrated into one or both of these production phases. Relative to farms selling only weanling calves, farms backgrounding animals post-weaning and/or finishing animals to slaughter weight are expected to have different costs and revenues. The option to choose variables for exact matches is an advantage of this method over propensity score matching, used by Uematsu and Mishra (2012) to compare organic versus conventional crop farms. In addition to the exact-match variables, variables we chose that did not require exact matches were (i) the maximum number of beef cows on the operation during 2008; (ii) the number of acres operated; (iii) whether the farmer's age was >55; (iv) whether the farmer held a four-year college degree; (v) whether the farmer had adopted at least three of 10 technologies and management practices including artificial insemination, embryo transfer and/or sexed semen, regularly scheduled veterinary services, use of a nutritionist to design rations and/or purchase feed, forage testing, keeping individual animal records, computer usage for cow-calf record-keeping, internet usage for farm information, identification of animals as belonging to the operation, and use of a calving season; (vi) whether the farmer utilized a rotational grazing system as discussed by Kim et al. (2008); (vii) whether improved pasture was used; (viii) the portion of raised heifers kept as replacements; and (ix) the portion of animals produced that were purebred. The first two variables chosen above further ensured (in addition to the exact match for cow number intervals) similar organic and non-organic match farm sizes for both the cow-calf enterprise and whole farm. Variables farmer age and education ensured that organic and matched non-organic farmers were similar in demographic characteristics that influence management decisions. McBride and Greene (2009a) showed dairy cost of production differences by farmer age and education. Three variables ensured that organic and matched non-organic farms were similar in technology and system use: Number of technologies adopted and whether rotational grazing and/or improved pasture were used. Technology and management practice adoption can significantly impact beef production costs (Ramsey et al. 2005). We were particularly concerned about whether a rotational grazing system and/or improved pasture were used because both can significantly increase average costs and influence productivity. The portion of heifers kept as replacements was of importance as many organic producers have recently transitioned into organic and some are likely building herd size. Greater portions of heifers kept as replacements for expansion would reduce sales and alter costs. Finally, the portion of purebred sales would impact revenue and cost, as purebred animals are generally sold for show or breeding stock and cost/cow is generally higher. Table 1 presents weighted means of performance measures where one match was made for each treatment farm. Using the weights, the organic and matching dataset with 28 observations expands to 3646 total organic plus matching non-organic farms and the organic + transitioning and matching dataset with 36 observations expands to 4499 total organic + transitioning plus matching conventional farms. Performance measure means for the two datasets do not differ greatly, with Total Operating Cost and Total Allocated Cost both within $40/cow of each another. For both datasets, Gross Return did not cover Total Operating Cost. Total Allocated Costs were substantial, leading to Net Return over Total Costs averaging )$918.32/cow for the organic + transitioning + match dataset and )$969.05/cow for the organic + match dataset. Calf sales constituted the majority of income, although other cattle sold constituted 20 per cent of sales and some farms sold stockers. The most significant Operating Cost was for feed, about 70 per cent of Operating Cost. The largest Allocated Cost was unpaid labor, about 61 per cent of Allocated Cost. Capital Recovery Cost was also a significant portion of Total Allocated Cost."}, {"section_title": "Results", "text": ""}, {"section_title": "Sample characteristics", "text": "Of interest in using matching samples is to compare how well-matched the farms are. One match per treatment farm resulted in 86 per cent of the exactmatch variables being exact for the organic and 89 per cent for the organic + transitioning farms. In both cases, exact matches were found for all observations except for state in which the farm was located. In two cases, the matched farm was in a state neighboring the treatment farm. A matched farm in a neighboring state may be closer in distance, structure, and environment than a matched farm in the same state, so this did not cause great concern. Table 2 presents weighted means of selection variables used in the matching analyses for both the organic and matched samples. Overall, organic farmers were larger-scale, more likely to be >55 years old, more likely to be college graduates, greater adopters of technology and improved pasture, less likely to use rotational grazing, and keeping higher percentages of heifers as replacements than their conventional matches. A priori, it is unclear whether higher costs would result from this sample if all farms were of the same system (organic or conventional): economies of scale and lower usage of rotational grazing would suggest lower cost while greater adoption of technology, improved pasture, and more animals kept for replacements would suggest higher cost. Higher costs associated with improved pasture have been shown by Boucher and Gillespie (2011); cow-calf cost of production using improved pasture was $255/cow higher than with unimproved pasture. The revenue situation is also unclear, with fewer animals sold owing to higher replacement but the potential for heavier, more valuable calves with technology adoption and improved pasture. Although differences between organic and matched samples were not great, differences underscore the challenges associated with identifying close matches -with 1952 non-organic and 1948 non-organic, non-transitioning farms available to match to 14 organic and 18 organic + transitioning farms, respectively, sample differences remained. The bias adjustment regression was used to correct for selection bias resulting from dissimilar matching farms."}, {"section_title": "Matching analyses", "text": "Results of the matching analyses are shown in Table 3. More than 50 per cent of the comparisons show significant differences between organic and nonorganic measures. Results show that gross return per cow did not differ significantly between organic and non-organic farms. It is noted that sample organic farms were almost exclusively cow-calf, with backgrounding conducted in a few cases but little finishing. Differences were not found between organic and non-organic farms for stocker value sold or other cattle value (culls and finishers) sold. Furthermore, calf value sold did not differ. However, weaning weights of organic calves were 102 pounds heavier, the calf price was $0.52/lb higher, and resulting calves were $139.59 more valuable. The seeming discrepancy of higher-valued calves being sold by organic producers, but resulting in returns for calves that were no higher is owing to some of the organic producers not selling calves during 2008. This is likely owing to some of the farms being relatively new entrants to organic beef production. The difference in calf price between organic and non-organic operations, $0.52/lb difference, was higher than the simulated breakeven price shown by Wileman et al. (2009). Roberts et al. (2007) reported that U.S. organic producers received $1.07 for live cattle. According to USDA Agricultural Statistics (2003), the U.S. price for finished animals averaged $0.67 in 2002, suggesting a difference of about $0.40/lb, which would be expected to differ from ours because theirs is for a different year and different weight animal. Total Operating Cost differences were not found, nor were differences in feed or marketing costs. However, within the Operating Cost category, Veterinary and Medicine Costs were lower for organic and organic + transitioning farms than had the farms been conventional, of $15.13/cow and $12.38/cow, respectively. The lower Veterinary and Medicine Costs for organic are attributed to a couple of things. First, antibiotics cannot be used for animals entering the organic market. Second, Roberts et al. (2007) found that about half of the organic beef producers they surveyed vaccinated their cattle and that non-traditional products were used to treat internal and external parasites. This is compared to 68.9 per cent of U.S. cow-calf operations that vaccinated any cattle or calves during 2007(USDA-APHIS 2009. The most significant differences between treated and matched farms were with Allocated Costs. Differences in hired and unpaid labor opportunity costs were non-significant, although several studies have shown differences in organic versus non-organic labor costs for other products: McBride and Greene (2009a) for soybeans, McBride and Greene (2009b) for milk production, and Uematsu and Mishra (2012) for crop production. Capital Recovery Costs were estimated to be $284.03/cow greater for organic than conventional production. Acevedo et al. (2006) did not assume differences in machinery, equipment, and housing between organic and natural beef systems. McBride and Greene (2009b,c) showed higher capital costs for organic relative to conventional soybean and milk production, respectively. Tax and Insurance Costs were estimated to be $14.44/cow greater for organic production than they would have been had the farms been conventional, and $19.01/cow greater for organic + transitioning production than they would have been had the farms been conventional. Property taxes and insurance are estimated based upon the gross margin of the cow-calf enterprise relative to the whole farm. Overhead Costs were also higher for organic than had the farms been conventional, by $41.69/cow, and higher for organic + transitioning farms by $41.36/cow. We first rule out several potential reasons why taxes, insurance, and general overhead might be greater for organic farms. Our farms were mostly matched within the same states, ruling out different state property tax codes as an explanation. We would not initially expect large differences in insurance on machinery and equipment between organic and conventional beef production, particularly as similar production systems were matched. No differences were seen in farm specialization in beef, so greater allocation of general farm expenses toward or away from beef would not explain the difference. Differences were not found in grazing intensity by organic/conventional status. We attribute differences in taxes and insurance expenses to higher insurance rates for greater numbers of higher-valued animals and inputs. Organic farmers used more improved pasture, were greater technology adopters, and used higher-valued machinery and equipment. Uematsu and Mishra (2012) and McBride and Greene (2009b) found higher insurance costs for organic relative to conventional crop and soybean producers, respectively. We attribute differences in overhead expenses to be the result of increased general business expenses associated with organic production as follows: transaction costs associated with securing specialized organic inputs, the annual organic certification fee, and increased record-keeping expenses. Overall, considering capital recovery, taxes and insurance, and overhead costs per cow for organic, as well as positive but non-significant differences in other expenses such as labor cost, Total Allocated Cost for organic was $420.66/cow higher than had the beef enterprises been conventional, and $273.31/cow higher for organic + transitioning than had the beef enterprises been conventional. These results suggest the organic beef enterprise must realize substantially greater returns to cover fixed expenses than if the farm had been conventional. To gain perspective on additional revenue required by the organic beef enterprise to cover Total Costs, organic beef enterprises had higher costs of $564.86/cow than if they had been conventional, and organic + transitioning beef enterprises had higher costs of $310.70/cow than if they had been conventional. Examining Net Return over Total Cost, our organic beef farmers were estimated to have $575.26/cow less profit than had the farm been conventional, and our organic + transitioning farmers were estimated to have $154.60/cow less profit than had the farm been conventional."}, {"section_title": "Discussion and conclusions", "text": "Comparisons of economic performance among production systems can present challenges when there are relatively few farmers producing under one or both systems. Although experimental data holds strong advantages, it is expensive to collect, specific to locations where it is collected, and may not fully represent actual farm production practices. An alternative is to compare farms using both systems by matching farms that are similar in all respects except for the system of interest. We use the method of matching samples to compare organic and organic + transitioning with conventional cow-calf farms. By matching organic farms with other farms similar in size, structure and producer characteristics, differences that might accrue because of selection bias, economies of size, or land productivity can be minimized such that comparisons can be made. Our results do not show higher returns to organic than conventional beef production. This is in spite of heavier weaning weights of calves on the organic farms and a higher calf price. This discrepancy is largely owing to some of the organic operations not selling calves during 2008. As the organic segment expands and matures, we expect more calves, stockers, and finishers will be sold. This would have the effect of raising the gross returns of organic operations. Significant differences in costs between organic and conventional beef production were for veterinary and medicine, capital recovery, taxes and insurance, and overhead. All except for veterinary and medicine were higher for organic than conventional production. The latter three are likely because of the structure of organic relative to conventional beef farms: greater capital expense, insuring higher-valued inputs, and the greater general business expense associated with organic farming. Cost of production during 2008 was much higher on a per-cow basis for organic farms than had the farms been conventional. If one 500-lb calf were assumed to be sold per cow, then the premium required to cover the additional cost would be $1.13/lb to cover the added costs of organic production. Although we find several differences in cost and returns measures between organic and conventional beef production, more research is needed to determine whether there are differences in costs and returns by year, by segment, and with a larger number of observations. Although the ARMS weights expand the sample to a population estimate, a larger sample size for the organic and transitioning farms would have been preferred. There are, however, relatively few beef organic operations compared with some of the other agricultural enterprises, so obtaining larger samples will require significant effort through a larger list frame through ARMS -we recommend more research along these lines to further investigate the competitiveness of organic beef production."}]