[{"section_title": "Abstract", "text": "Summary. The aim of this paper is to develop a general regression framework for the analysis of manifold-valued response in a Riemannian symmetric space (RSS) and its association with multiple covariates of interest, such as age or gender, in Euclidean space. Such RSS-valued data arises frequently in medical imaging, surface modeling, and computer vision, among many others. We develop an intrinsic regression model solely based on an intrinsic conditional moment assumption, avoiding specifying any parametric distribution in RSS. We propose various link functions to map from the Euclidean space of multiple covariates to the RSS of responses. We develop a two-stage procedure to calculate the parameter estimates and determine their asymptotic distributions. We construct the Wald and geodesic test statistics to test hypotheses of unknown parameters. We systematically investigate the geometric invariant property of these estimates and test statistics. Simulation studies and a real data analysis are used to evaluate the finite sample properties of our methods. †Address for correspondence and reprints: Hongtu Zhu, Ph.D., Department of Biostatistics, Gillings School of Global Public Health, University of North Carolina at Chapel Hill, Chapel Hill, NC 27599-7420, USA. Email: hzhu@bios.unc.edu.\nData used in preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database.\nAs such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data but did not participate in analysis or writing of this paper. A complete listing of ADNI investigators can be found at: http://adni.loni.usc.edu/wpcontent/uploads/how to apply/ADNI Acknowledgement List.pdf.\nCornea, Zhu, Kim, and Ibrahim"}, {"section_title": "Introduction", "text": "Manifold-valued responses in curved spaces frequently arise in many disciplines including medical imaging, computational biology, and computer vision, among many others. For instance, in medical and molecular imaging, it is interesting to delineate the changes in the shape and anatomy of a molecule. See Figure 1 for four different examples of manifold-valued data. Regression analysis is a fundamental statistical tool for relating a response variable to covariate, such as age. In particular, when both the response and the covariate(s) are in Euclidean space, the classical linear regression model and its variants have been widely used in various fields (McCullagh and A.Nelder, 1989) . However, when the response is in a Riemannian symmetric space (RSS) and the covariates are in Euclidean space, developing regression models for this type of data raises both computational and theoretical challenges. The aim of this paper is to develop a general regression framework to address these challenges.\nLittle has been done on the regression analyses of manifold-valued response data.\nThe existing statistical methods for general manifold-valued data are primarily developed to characterize the population 'mean' and 'variation' across groups Patrangenaru, 2003, 2005; Fletcher et al., 2004; Dryden and Mardia, 1998; Huckemann et al., 2010) . In contrast, even for the 'simplest' directional data, there is a sparse literature on regression modeling of a single directional response and multiple covariates (Mardia and Jupp, 2000) . In addition, these regression models of directional data are primarily based on a specific parametric distribution, such as the von Mises-Fisher distribution (Mardia and Jupp, 2000; Kent, 1982) . However, it can be very challenging to assume useful parametric distributions for general manifold-valued data, and thus it is difficult to generalize these regression models of directional data to general manifold-valued data except for some specific manifolds (Shi et al., 2012; Fletcher, 2013; Kim et al., 2014; Shi et al., 2009; Zhu et al., 2009 ).\nThere is also a great interest in developing nonparametric regression models for manifold-valued response data and multiple covariates Dunson, 2010, 2012; Samir et al., 2012; Su et al., 2012; Muralidharan and Fletcher, 2012; Machado and Leite, 2006; Machado et al., 2010; Yuan et al., 2012 ).\nAn intriguing question is whether there is a general regression framework for manifold-valued response in a RSS and covariates in a multidimensional Euclidean space. The aim of this paper is to give an affirmative answer to such a question.\nThe theoretical development is challenging but of great interest for carrying out statistical inferences on regression coefficients. We make five major contributions in this paper as follows: (i) We propose an intrinsic regression model solely based on an intrinsic conditional moment for the response in a RSS, thus avoiding specifying We develop a general asymptotic framework for the estimates of the regression coefficients and test statistics. (v) We systematically investigate the geometrical properties (e.g., chart invariance) of these parameter estimates and test statistics.\nThe paper is organized as follows. In Section 2, we review the basic notion and concepts of Riemannian geometry. In Section 3, we propose the intrinsic regression models and propose various link functions for several specific RSS's. In Section 4, we develop estimation and test procedures for the intrinsic regression models. In Section 5, we carry out a detailed data analysis on the shape of Corpus Callosum (CC) contours obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) study. Finally, we conclude with some discussions in Section 6. Technical conditions, simulation studies, theoretical examples, and proofs are deferred to the Supplementary document. Our code and data are available from http://www.bios.unc.edu/research/bias."}, {"section_title": "Differential Geometry Preliminaries", "text": "We briefly review some basic facts about the theory of Riemannian geometry and present more technical details in the Supplementary Report. The reader can refer to (Helgason, 1978; Spivak, 1979; Lang, 1999 ) for more details.\nLet M be a smooth manifold and d M be its dimension. A tangent vector of M at p ∈ M is defined as the derivative of a smooth curve γ(t) with respect to t evaluated at t = 0, denoted asγ(0), where γ(0) = p. The tangent space of M at p is denoted as T p M and is the set of all tangent vectors at p.\nA Riemannian manifold (M, m) is a smooth manifold together with a family of inner products, m = {m p }, on the tangent spaces T p M's that vary smoothly with p ∈ M, and m is called a Riemannian metric. This metric induces a so-called\nThe geodesics are, by definition, the locally distanceminimizing paths. If the metric space (M, dist M ) is complete, the exponential map at p is defined on the tangent space\np is welldefined near 0 and is a diffeomorphism on an open neighborhood V of the origin in T p M onto U with V such that tV ∈ V for 0 ≤ t ≤ 1 and V ∈ V. The inverse map is the logarithmic map at p, denoted by Log\nThe radius of injectivity of M at p, denoted by ρ * (M, p), is the largest r > 0 such that Exp A Lie group G is a group together with a smooth manifold structure such that the operations of multiplication and inversion are smooth maps. Many common geometric transformations of Euclidean spaces that form Lie groups include rotations, translations, dilations, and affine transformations on R d . In general, Lie groups can be used to describe transformations of smooth manifolds.\nAn RSS is a connected Riemannian manifold M with the property that at each point, the mapping that reverses geodesics through that point is an isometry. Examples of RSS's include Euclidean spaces, R k , spheres, S k , projective spaces, P R k , and hyperbolic spaces, H k , each with their standard Riemannian metrics. Symmetric spaces arise naturally from Lie group actions on manifolds, see Helgason (1978) .\nGiven a smooth manifold M and a Lie group G, a smooth group action of G on M is a smooth mapping G × M → M, (a, p) → a · p such that e · p = p and (aa ) · p = a · (a · p) for all a, a ∈ G and all p ∈ M. The group action should be interpreted as a group of transformations of the manifold M, namely, {L a } a∈G ,\nThe L a is a smooth transformation on M and its inverse is L a −1 . The orbit of a point p ∈ M is defined as G(p) = {a · p | a ∈ G}. The orbits form a partition of M. If M consists of a single orbit, the group action is transitive or G acts transitively on M, and we call M a homogeneous space. The isotropy subgroup of a point p ∈ M is defined as G p = {a ∈ G | a · p = p}. When G is a connected group of isometries of the RSS M, M can always be viewed as a homogeneous space, M ∼ = G/G p , and the isotropy subgroup G p is compact.\nFrom now on, we will assume that the manifold M is an RSS and M = G/G p with G being a Lie group of isometries acting transitively on M. Geodesics on M are computed through the action of G on M. Due to the transitive action of the group G of isometries on M, it suffices to consider only the geodesic starting at the base point p. Geodesics on M starting from p are the images of the action of a 1-parameter subgroup of G acting on the base point p. That is, for any geodesic γ on M, γ(·) : R → M, starting from p, there exists a 1-parameter subgroup c(·) : R → G such that γ(t) = c(t) · p for all t ∈ R."}, {"section_title": "Intrinsic Regression Model", "text": "Let (M, m) be a (C ∞ ) RSS of dimension d M and geodesically complete with an inner product m p and let G be a Lie group of isometries acting smoothly and transitively on M with the identity element e."}, {"section_title": "Formulation", "text": "Consider n independent observations (y 1 , x 1 ), . . . , (y n , x n ), where y i is the M-valued response variable and\nOur objective is to introduce an intrinsic regression model for RSS responses and multiple covariates of interest from n subjects.\nThe specification of the intrinsic regression model involves three key steps including (i) a link function mapping from the space of covariates to M, (ii) the definition of a residual, and (iii) the action of transporting all residuals to a common space.\nFirst, we explicitly formalize the link function. From now on, all covariates have been centered to have mean zero. We consider a single-center link function given by\nwhere µ(x, q, β) is a known link function, q ∈ M can be regarded as the intercept or center, and β = (β 1 , . . . , β dβ ) T is a d β ×1 vector of regression coefficients. Moreover, it is assumed that µ(x, q, β) satisfies a single-center property as follows:\nWhen the regression coefficient vector β equals 0, the link function is independent of the covariates and thus, it reduces to the single center (or 'mean') q ∈ M. When all the covariates are equal to zero, the link function is independent of the regression coefficients and reduces to the center q ∈ M. An example of the single-center link function is the geodesic link function in (Kim et al., 2014; Fletcher, 2013) , which is given by\nwhere V k 's are tangent vectors in T q M and β includes all unknown parameters associated with the tangent vectors.\nMore generally, we will consider a multicenter link function to account for the presence of multiple discrete covariates and even a general link function defined as with the discrete variables. However, the details on these link functions are presented in the Supplementary document, and here, for notational simplicity, we focus on (1) from now on.\nSecond, we introduce a definition of \"residual\" to ensure that µ(x i , q, β) is the proper \"conditional mean\" of y i given x i , which is the key concept of many regression models (McCullagh and A.Nelder, 1989) . For instance, in the classical linear regression model, the response can be written as the sum of the regression function and a residual term and the regression function is the conditional mean of the response only when the conditional mean of the residual is equal to zero. Given the points y i and µ(x i , q, β) on a RSS M, we need to define the residual as \"a difference\" between y i and µ(x i , q, β). Assume that y i and µ(x i , q, β) are \"close enough\"\nto each other in the sense that there is an open ball B(0, ρ) ⊂ T µ(xi,q,β) M such that for all i = 1, . . . , n,\nHowever, according to a result in Le and Barden (2014) , Log µ(xi,q,β) (y i ) is well defined under some very mild conditions, which require that M dist M (p, y i ) 2 dp(y i ) be finite and achieve a local minimum at µ(x i , q, β), where p(y i ) is any finite measure of y i on M. Thus, Log µ(xi,q,β) (y i ) makes it a good candidate to play the role of a 'residual'. These residuals, however, lie on different tangent spaces to M, so it is difficult to carry out a multivariate analysis of these residuals.\nThird, since M is a RSS, this enables us to \"transport\" all the residuals, separately, to a common space, say T p M, by exploiting the fact that the parallel transport along the geodesics can be expressed in terms of the action of G on M. Indeed, since M is a symmetric space, the base point p and the point µ(x i , q, β) can be joined in M by a geodesic, which can be seen as the action of a one-parameter\nWe define the rotated residual E(y i , x i ; q, β) of y i ∈ M with respect to µ(x i , q, β)\nas the parallel transport of the actual residual, Log µ(xi,q,β) (y i ), along the geodesic from the conditional mean, µ(x i , q, β), to the base point p. That is,\nfor i = 1, . . . , n, where T p M is identified with R dM . The intrinsic regression model on M is defined by\nwhere (q * , β * ) denotes the true value of (q, β) and the expectation is taken with respect to the conditional distribution of y i given x i . Model (6) is equivalent to\n. . , n, since the tangent map of the action of c(1; x i , q * , β * ) −1 on M is an isomorphism of linear spaces (invariant under the metric m) between the fibers of the tangent bundle T M. This model does not assume any parametric distribution for y i given x i , and thus it allows for a large class of distributions. The model is essentially semi-parametric, since the joint distribution of (y, x) is not restricted except by the zero conditional moment requirement in (6)."}, {"section_title": "A Theoretical Example: The Unit Sphere S k", "text": "We investigate the intrinsic regression model for S k -valued responses and include several other examples in the supplementary document. We review some basic facts about the geometric structure of M = S k = {x ∈ R k+1 : ||x|| 2 = 1} (Shi et al., 2012; Mardia and Jupp, 2000; Healy and Kim, 1996; Huckemann et al., 2010) . For q ∈ S k ,\nThe canonical Riemannian metric on S k is that induced by the canonical inner product on R k+1 . Under this metric, the geodesic distance between any two points q and q is equal to ψ q,q = arccos(q T q )\nIf the points are not antipodal (i.e. q = −q), then there is a unique geodesic path that joins them. Therefore, the radius of injectivity is ρ(\n(Here, sin(0)/0 = 1.) If q and q are not antipodal, the Riemannian Logarithmic map is given by Log q (q ) = arccos(\nThe special orthogonal group G = SO(k + 1) is a group of isometries on S k and acts transitively and simply on S k via the left matrix multiplication. Specifically, the rotation matrix R q,q , which rotates q to q ∈ S k , is given by"}, {"section_title": "is the unique geodesic curve in", "text": "S k joining q with q, where c q ,q (t) takes the form\nSuppose that we observe {(y i , x i ) : i = 1, . . . , n}, where y i ∈ S k for all i. We introduce the three key components of our intrinsic regression model for S k −valued responses. First, we consider several examples of the general link function µ(x i , θ).\nSpecifically, without loss of generality, we fix the \"north pole\" p = (0, . . . , 0, 1) T ∈ R k+1 as a base point. Let e j be the (k +1)×1 vector with a 1 at the j-th component and a 0 otherwise for j = 1, . . . , k. Let q ∈ S k be the 'center', and we consider two link functions as follows:\nwhere T st,−p is the stereographic projection mapping from S k \\ {p} onto the d-\nB is a k × d x matrix of regression coefficients and β includes all components of B.\nSecond, we define residuals for our intrinsic regression model. The residual in (4) requires that y i is not antipodal to µ(x i , θ). In this case, the residual for the i-th subject is given by Log µ(xi,θ) (\nthere is an infinite number of geodesics connecting µ(x i , θ) and y i . In this case, Log µ(xi,θ) (y i ) is not uniquely defined, whereas their geodesic distance is unique. However, according to the results in Le and Barden (2014) , Log µ(xi,q,β) (y i ) is well defined almost surely.\nThird, we transport all the residuals, separately, to a common space, say T p S k .\nThe rotated residual is given by\nOur intrinsic regression model is defined by the zero conditional mean assumption in (6) on the above rotated residuals (8). A graphic illustration of the stereographic link functions in (7), rotated residual, and parallel transport is given in Figure 2 .\nAlternatively, we may consider some parametric spherical regression models for spherical responses. As an illustration, we consider the von Mises-Fisher (vMF) regression model. Specifically, it is assumed that\n. . , n, where κ is a positive concentration parameter and is assumed to be known for simplicity. Calculating the maximum likelihood estimate of θ is equivalent to solving a score equation\ngiven by\nwhich is a linear combination of the rotated residual."}, {"section_title": "Estimation and Test Procedures", "text": ""}, {"section_title": "Generalized Method of Moment Estimators", "text": "We consider the generalized method of moment estimator (GMM estimator) to estimate the unknown parameters in model (6) (Hansen, 1982; Newey, 1993; Korsholm, 1999) . We may view the\nW n be a random sequence of positive definite s × s weight matrices. It follows from (6) that\nWe define\nUnder some conditions detailed below, we can show the first order asymptotic properties of (q G ,β G ) including consistency and asymptotic normality of GMMestimators. We introduce some notation. Let || · || denote the Euclidean norm of a vector or a matrix; ∂ l f (t, β)/{∂(t, β) l } = ∂ l (t,β) f (t, β) for l = 1, . . . ; a ⊗2 = aa T for any matrix or vector a; V = Var[h(x; q * , β * )E(y, x; q * , β * )]; I d is the identity matrix; d → and p →, respectively, denote convergence in distribution and in probability. We obtain the following results, whose detailed proofs can be found in the supplementary document.\nTheorem 4.1. Assume that (y i , x i ), i = 1, . . . , n, are iid random variables in M × R dx . Let (q * , β * ) be the exact value of the parameters satisfying (6). Let {W n } n be a random sequence of s × s symmetric positive semi-definite matrices with (11) is consistent in probability as n → ∞.\n(b) Under assumptions (C1)-(C4) and (C6)-(C10) in the Supplementary document, for any local chart (U, φ) on M near q * as n → ∞, we have\nwhere\n. Moreover, for any other chart (U, φ ) near q * , we have\nwhere J(·) t denotes the Jacobian matrix evaluated at t.\nTheorem 4.1 establishes the first-order asymptotic properties of (q G ,β G ) for the intrinsic regression model (6). Theorem 4.1 (a) establishes the consistency of (q G ,β G ). The consistency result does not depend on the local chart. Theorem 4.1 (b) establishes the asymptotic normality of (φ(q G ),β G ) for a specific chart (U, φ) and the relationship between the asymptotic covariances Σ φ and Σ φ for two different charts. It follows from the lower-right d β × d β submatrix of Σ φ that the asymptotic covariance matrix ofβ does not depend on the chart. However, the asymptotic normality ofq G does depend on a specific chart. A consistent estimator of the asymp-\nand\nThis estimator is also compatible with the manifold structure of M.\nWe consider the relationship between the GMM estimator and the intrinsic least squares estimator (ILSE) of (q, β), denoted by (q I ,β I ). The (q I ,β I ) minimizes the total residual sum of squares G I,n (q, β) as follows:\nAccording to (2), the ILSE is closely related to the intrinsic meanq IM of y 1 , · · · , y n ∈ M, which is defined aŝ\nRecall that µ(0, q, β) is independent of β.\nThe (q I ,β I ) can be regarded as a special case of the GMM estimator when we set\nIt follows from Theorem 4.1 that under model (6), (q I ,β I ) enjoys the first-order asymptotic properties as well."}, {"section_title": "Efficient GMM Estimator", "text": "We investigate the most efficient estimator in the class of GMM estimators. For a fixed h(·; ·, ·), the optimal choice of W is W opt = V −1 , and the use of W n = W opt leads to the most efficient estimator in the class of all GMM estimators obtained using the same h(·) function (Hansen, 1982) . Its asymptotic covariance is given by\nWe first introduce some notation. For a chart (U, φ) on M near q * , let\nLet (q * ,β * ) be the GMM estimator of (q, β) based on h * φ (x) and W * φ . Generally, we obtain an optimal result of h opt (·), which generalizes an existing result for Euclideanvalued responses and covariates (Newey, 1993) , as follows. (i) (q * ,β * ) is asymptotically normally distributed with mean 0 and covariance W * φ ;\n(ii) (q * ,β * ) is optimal among all GMM estimators for model (6);\n(iii) (q * ,β * ) is independent of the chart.\nTheorem 4.2 characterizes the optimality of h * φ (x) and W * φ among regular GMM estimators for model (6). Geometrically, (q * ,β * ) is independent of the chart. Specifically, for any other chart (U, φ ) near q * , we have\nThus, the quadratic form in (11) associated with h * φ (x) and W * φ is the same as that which is associated with h * φ (x) and W * φ . It indicates that the GMM estimator (q * ,β * ) φ based on h * φ (x) and W * φ is independent of the chart (U, φ). The next challenging issue is the estimation of D φ (x) and Ω(x). We may proceed in two steps. The first step is to calculate a √ n-consistent estimator (q I ,β I ) of (q, β), such as the ILSE. The second step is to plug (q I ,β I ) into the functions E i (q I ,β I ) and ∂ (t,β) E(y i , x i ; φ −1 (t),β I )| t=φ(qI ) for all i and then use them to construct the nonparametric estimates of D φ (x) and Ω(x) (Newey, 1993) . Specifically, let K(·) be a d x -dimensional kernel function of the l 0 -th order satisfying\n. . , u dx )du 1 . . . du dx = 0 for any s = 1, . . . , d x and 1 ≤ l < l 0 , and u l0 s K(u 1 , . . . , u dx )du 1 . . . du dx = 0. Let K τ (u) = τ −1 K(u/τ ), where τ > 0 is a bandwidth. Then, a nonparametric estimator of D φ (x) can be written by\nwhere\nAlthough we may construct a nonparametric estimator of Ω(x) similar to (15), we have found that even for moderate d x , such an estimator is numerically unstable. Instead, we approximate Ω(x i ) = Var(E(y, x; q * , β * )|x = x i ) by its mean V E * = Var(E(y, x; q * , β * )). In this case, h * φ (x) and W * φ , respectively, reduce to\nFor any local chart (U, φ) withq I ∈ U , we construct the estimators of h * E,φ and W * E,φ as follows. LetV (q, β) = P n E(y, x; q, β) ⊗2 , we havê\nThen, we substituteĥ E,φ and W E,φ into (11) and then calculate the GMM estimator of (q, β), denoted by (q E ,β E ). Similar to (q * ,β * ), it can be shown that (q E ,β E ) is independent of the chart (U, φ) on M near q * withq I ∈ U . For sufficiently large n, dist M (q I , q * ) can be made sufficiently small and any maximal normal chart on M centered atq I contains the true value q * with probability approaching one.\nWe calculate a one-step linearized estimator of (q, β), denoted by (q E ,β E ), to approximate (q E ,β E ). Computationally, the linearized estimator does not require iteration, whereas, theoretically, it shares the first asymptotic properties with (q E ,β E ) as shown below. Specifically, in the chart (U, φ) nearq I , we have\nFurthermore, if (U , φ ) is another chart on M nearq I , then we have\nThus,β E,φ is independent of the chart φ and {t E,φ − φ(q I ) | φ is a chart on M } defines a unique tangent vector to M atq I . Moreover, if φ and φ are maximal normal charts centered atq I , then γ φ (τ ) = φ −1 (τt E,φ ) and γ φ (τ ) = φ −1 (τt E,φ )\nare two geodesic curves on M starting from the same pointq I with the same initial velocity vector, and thus these two geodesics coincide. Therefore, φ −1 (t E,φ ) is independent of the normal chart φ centered atq I . Finally, we can establish the first order asymptotic properties of (q E ,β E ) as follows. \nwhere\n) −1 . In addition, Σ E,φ is invariant under the change of coordinates in M and the asymptotic distribution ofβ E does not depend on the chart (U, φ). Also, if we set\nThis estimator is also compatible with the manifold structure of M. \nwhere Ω(x i ) is a consistent estimator of Ω(x i ) for all i, then the optimality of (q E ,β E ) still holds. We have the following theorem.\nTheorem 4.4. Assume that (C2)-(C17) and (C19) are valid. Then, as n → ∞, we have\nin which Σ * φ is given in Theorem 4.2. If we set\n, then n Σ E,φ is a consistent estimator of Σ * φ ."}, {"section_title": "Computational Algorithm", "text": "Computationally, an annealing evolutionary stochastic approximation Monte Carlo (SAMC) algorithm (Liang et al., 2010 ) is developed to compute (q I ,β I ) and (q E ,β E ).\nSee the supplementary document for details. Although some gradient-based optimization methods, such as the quasi-Newton method, have been used to optimize Q n (q, β) (Kim et al., 2014; Fletcher, 2013) , we have found that these methods strongly depend on the starting value of (q, β). Specifically, when E(y, x; q, β) takes a relatively complicated form, Q n (q, β) is generally not convex and can easily converge to local minima. Moreover, we have found that it can be statistically misleading to carry out statistical inference, such as the estimated standard errors of (q E ,β E ), at those local minima. The annealing evolutionary SAMC algorithm converges fast and distinguishes from many gradient-based algorithms, since it possesses a nice feature in that the moves are self-adjustable and thus not likely to get trapped by local energy minima. The annealing evolutionary SAMC algorithm (Liang et al., 2010 ) represents a further improvement of stochastic approximation Monte Carlo for optimization problems by incorporating some features of simulated annealing and the genetic algorithm into its search process."}, {"section_title": "Hypotheses Testing", "text": "Many scientific questions involve the comparison of the M-valued data across groups and subjects and the detection of the change in the M-valued data over time. Such questions usually can be formulated as testing the hypotheses of q and β. We consider two types of hypotheses as follows:\nwhere C 0 is an r × d β matrix of full row rank and q 0 and b 0 are specified in M and R r , respectively. Further extensions of these hypotheses are definitely interesting and possible. For instance, for the multicenter link function, we may be interested in testing whether all intercepts are independent of the discrete covariate class.\nWe develop several test statistics for testing the hypotheses given in (22) \nwhereΣ E,φ is given in Theorem 4.3 or Theorem 4.4 , andΣ E,φ;22 is its lower-right\n. Sinceβ E and its asymptotic covariance matrix are independent of the chart on M, the test statistic W\n(1) n,φ is independent of the chart. Second, we consider the Wald test statistic for testing the hypotheses given in (23) when there is a local chart (U, φ) on M containing bothq E and q 0 . Specifically, the Wald test statistic for testing (23) is defined by\nThird, we develop an intrinsic Wald test statistic, that is independent of the chart, for testing the hypotheses given in (23). We consider the asymptotic covariance estimator Σ E,φ based onq E and its upper-left d M × d M submatrix Σ E,φ;11 . Since both are compatible with the manifold structure of M, Σ E,φ;11 defines a unique non-degenerate linear map Σ E;11 (·) from the tangent space Tq E M of M atq E onto itself, which is independent of the chart (U, φ). In a maximal normal chart centered atq E , then in any such normal chart, the Wald test statistic for testing (23) is given\nWe obtain the asymptotic null distributions of W\nn,φ , and W\nM,n as follows.\nTheorem 4.5. Let (U, φ) be a local chart on M so thatq E , q * ∈ U . Assume that all conditions in Theorem 4.3 hold. Under the corresponding null hypothesis, we have the following results:\nn,φ and W (2) n,φ are asymptotically distributed as χ 2 r and χ 2 dM , respectively;\nM,n , for any normal chart (U, φ) centered atq E . n,φ can be used to construct an intrinsic test statistic.\nWe consider a local alternative framework for (22) and (23) as follows:\nwhere δ and v are specified (and fixed) in R r and T q0 M, respectively, and we establish the asymptotic distributions of W\nn,φ , W\nn,φ , and W\nM,n under these local alternatives.\nTheorem 4.6. Let (U, φ) be a local chart on M so thatq E , q * ∈ U . Assume that all conditions in Theorem 4.3 hold. Under the local alternatives (24) and (25), we have the following results:\nn,φ is asymptotically distributed as noncentral χ 2 r with noncentrality parameter δ T C 0ΣE,φ;22\nn,φ is asymptotically distributed as noncentral χ 2 dM , with non-\nThe noncentrality parameter does not depend on the choice of the coordinate system at q 0 . Here, J(f ) a denotes the Jacobian matrix of map f at a.\nM,n is asymptotically distributed as noncentral χ 2 dM , with noncentrality parameter mq E (( Σ E;11 ) −1 (J(Logq\nThe noncentrality parameter does not depend on the choice of the coordinate systems atq E and q 0 , respectively.\nWe consider another scenario that there are no local charts on M containing bothq E and q 0 . In this case, we restate the hypotheses H \nWe propose a geodesic test statistic given by\nwhich is independent of the chart (U, φ). Theoretically, we can establish the asymptotic distribution of W dist under both the null and alternative hypotheses as follows.\nTheorem 4.7. Assume that all conditions in Theorem 4.5 hold.\n(a) Under H\n0 , nW dist is asymptotically weighted chi-square χ 2 (λ 1 , . . . , λ dM ) distributed, where the weights λ 1 , . . . , λ dM are the eigenvalues of the matrix Σ E,Log q 0 ,11 , which is the upper-left d M × d M submatrix of the asymptotic covariance matrix Σ E,Log q 0 ofq E in a normal chart centered at q 0 . Moreover, the weights are independent, up to a permutation, of the choice of the normal chart centered at q * .\n(b) Under the alternative hypothesis, W dist is asymptotically normal distributed and we have\nwhere D dist is the column vector representation of grad q * (dist(·, q 0 ) 2 ) with respect to the orthonormal basis of T q * M associated with the normal chart used to represent the asymptotic covariance ofq E as the matrix Σ E,Log q * . In particular, when q 0 is close to q * , then\nTheorem 4.7 establishes the asymptotic distribution of W dist whenq E and q 0 do not belong to the same chart of M. In practice, the covariance matrix Σ E,Log q * ,11\nis not available, since Σ E,Log q * is not known; it also depends on the unknown true value β * , so we may use the estimate Σ E,Log q * as defined in Theorems 4.3 and 4.4.\nTherefore, under the null hypothesis, the asymptotic distribution of W dist can be approximated by the weighted chi-square distribution χ 2 (λ 1 , . . . ,λ dM ), in which the weightsλ 1 , . . . ,λ dM are the eigenvalues of the covariance matrix ( Σ E,Log q 0 ) 11 /n.\nFinally, we develop a score test statistic for testing H\n0 against H\n1 . An advantage of using the score test statistic is that it avoids the calculation of an estimator under the alternative hypothesis H (2) 1 . For notational simplicity, we only consider the ILSE estimator of (q, β), denoted by (q 0 ,β I ), under the null hypothesis H (2) 0 . For any chart (U, φ) on M with q 0 ∈ U , we define\nwhere the subcomponents F φi,1 and F φi,2 correspond to t and β, respectively. It can be shown that the score test W SC,φ reduces to \n0 , for any other local chart (U, φ ) with q 0 ∈ U , we have"}, {"section_title": "Real Data Example", "text": ""}, {"section_title": "ADNI Corpus Callosum Shape Data", "text": "Alzheimer disease (AD) is a disorder of cognitive and behavioral impairment that markedly interferes with social and occupational functioning. It is an irreversible, progressive brain disease that slowly destroys memory and thinking skills, and eventually even the ability to carry out the simplest tasks. AD affects almost 50% of those over the age of 85 and is the sixth leading cause of death in the United States.\nThe corpus callosum (CC), as the largest white matter structure in the brain, connects the left and right cerebral hemispheres and facilitates homotopic and heterotopic interhemispheric communication. It has been a structure of high interest in many neuroimaging studies of neuro-developmental pathology. Individual differences in CC and their possible implications regarding interhemispheric connectivity have been investigated over the last several decades (Paul et al., 2007) .\nWe consider the CC contour data obtained from the ADNI study. For each subject in ADNI dataset, the segmentation of the T1-weighted MRI and the calculation of the intracranial volume were done in the FreeSurfer package ‡ (Dale et al., ‡http://surfer.nmr.mgh.harvard.edu/ 1999), while the midsagittal CC area was calculated in the CCseg package, which is measured by using subdivisions in Witelson (1989) motivated by neuro-histological studies. Finally, each T1-weighted MRI image and tissue segmentation were used as the input files of CCSeg package to extract the planar CC shape data."}, {"section_title": "Intrinsic Regression Models", "text": "We are interested in characterizing the change of the CC contour shape as a function of three covariates including gender, age, and AD diagnosis. We focused on n = 409 subjects with 223 healthy controls (HCs) and 186 AD patients at baseline of the ADNI1 database. We observed a CC planar contour Y i with 32 landmarks and three clinical variables including gender x i,1 (0-female, 1-male), age x i,2 , and diagnosis x i,3\n(0-control, 1-AD) for i = 1, . . . , 409. The demographic info is presented in Table 1 .\nWe treat the CC planar contour Y i as a RSS-valued response in the Kendall's planar shape space Σ 32 2 . The geometric structure of Σ k 2 for k > 2 is included in the supplementary document. Each Y i is specified as a 32 × 2 real matrix, whose rows In order to use our intrinsic regression model, we determined the base point p and an orthonormal basis {Z 1 , . . . , Z 30 } for T p Σ 32 2 as follows. We initially set p 0 = [z 0 ] with z 0 = (1, −1, 0, · · · , 0) T / √ 2 and an orthonormal basis {Z 1 , . . . ,Z 30 } in T p0 Σ 32 2 , whereZ l = (1, · · · , 1, −(l + 1), 0, · · · , 0) T / (l + 1)(l + 2). Then, we projected all y i 's onto T p0 Σ 32 2 and calculated Log p0 (y i ) for all i. Finally, we set the base point p as Exp p0 (n −1 n i=1 Log p0 (y i )) and then used the parallel transport to rotate the initial basis {Z 1 , . . . ,Z 30 } to obtain a new orthonormal basis {Z 1 , . . . , Z 30 } at p.\nWe consider an intrinsic regression model with y i ∈ Σ 32 2 as a response vector and a vector of four covariates including gender, age, diagnosis, and the interac-tion age*diagnosis, that is, x i = (x i,1 , x i,2 , x i,3 , x i,4 ) T with x i,4 = x i,2 x i,3 . We used a single-center link function with model parameters (q, β) ∈ Σ 32 2 × R 240 as follow. The intercept q is specified by q = φ −1 p (t) = Exp p 30 =1 (t 2 −1 + jt 2 )Z , where t = (t 1 , . . . , t 60 ) T ∈ R 60 . The regression coefficient vector β includes four 60 × 1 subvec-\n, and β (ad) , which correspond to x i1 , x i2 , x i3 , and x i4 , respectively. Therefore, there are 300 unknown parameters in (t T , β T ) T . We define a 30×4 complex matrix as B = B o +jB e , with B o = β formed by the odd-indexed and even-indexed components, respectively, and a link\nThe Wald test statistic equals W (1) n,φ = 98.20 with its p-value around 0.001. Thus, the data contains enough evidence to reject H 0 , indicating that there is a strong age dependent diagnosis effect on the shape of the CC contours. The mean agedependent CC trajectories for HCs and ADs within each gender group are shown in Figure 4 . It can be observed that there is a difference in shape along the inner side of the posterior splenium and isthmus subregions in both male and female groups.\nThe splenium seems to be less rounded and the isthmus is thinner in subjects with AD than in HCs.\nFourth, we assessed whether there is a gender effect on the shape of the CC contour or not. We tested H 0 : β (g) = 0 60 versus H 1 : β (g) = 0 60 . The Wald test statistic is W\nn,φ = 73.34 with its p-value 0.116. Thus, it is not significant at the 0.05 level of significance. It may indicate that there is no gender effect on the shape of the CC contours. The mean age-dependent CC trajectories for the female and male groups within each diagnosis group are shown in Figure 5 . We observed similar shapes of CC contours in males and females."}, {"section_title": "Discussion", "text": "We have developed a general statistical framework for intrinsic regression models of responses valued in a Riemannian symmetric space in general, and Lie groups in particular, and their association with a set of covariates in a Euclidean space.\nThe intrinsic regression models are based on the generalized method of moment estimator and therefore the models avoid any parametric assumptions regarding the distribution of the manifold-valued responses. We also proposed a large class of link functions to map Euclidean covariates to the manifold of responses. Essentially, the covariates are first mapped to the tangent bundle to the Riemmanian manifold, and from there further mapped, via the manifold exponential map, to the manifold itself.\nWe have adapted an annealing evolutionary stochastic algorithm to search for the ILSE, ( q I , β I ), of (q, β), in the Stage I of the estimation process, and a one-step procedure to search for the efficient estimator (q E ,β E ) in Stage II. Our simulation study and real data analysis demonstrate that the relative efficiency of the Stage II estimator improves as the sample size increases. View publication stats View publication stats"}]