[{"section_title": "Introduction", "text": "Most of the debates over education reform focus, as they should, on direct inputs into the educational process, such as the quality of teachers, the financial resources available to schools, and the support students receive from their families. Nevertheless, the achievement of elementary school students may also be affected by the school environment, which depends in part on the abilities, attitudes, and performance of their classmates. Similarly, the neighborhood environment may affect school outcomes, via positive or negative role models and local attitudes about the value of schooling relative to other pursuits. These two factors tend to reinforce one another because schools are often directly or indirectly neighborhood institutions.\nMany previous studies have addressed school context effects and neighborhood effects on achievement. Researchers with good school data usually study school context effects, whereas researchers with good neighborhood-level data tend to study neighborhood effects. Given the high degree of correlation between school and neighborhood characteristics, any analysis that omits one of these factors runs the risk of overstating or misstating the effect of the other. These different groups of researchers may, in effect, be attributing the same variance in achievement to two different causes.\nFew datasets have both types of data together with individual and family control variables. Moreover, a large sample is necessary to disentangle the relative contribution of school and neighborhood characteristics. This paper addresses the limitations of earlier studies by using a longitudinal panel dataset including nearly 10 million students from the State of Texas compiled by the Texas Schools Project (TSP). The TSP recently completed geocoding all the schools in the state, providing a connection to the complete array of neighborhood-level census data, including poverty, employment, family structure, and housing characteristics.\nWe examine the relative impact of school context variables versus neighborhood characteristics on 5th through 8th grade math and reading scores. We also examine variations in these effects by race, ethnicity, and other factors."}, {"section_title": "School Context and Student Achievement", "text": "While students are graded individually, they participate in a group learning process in an interactive school environment (Manski, 1993) . For example, fellow students may indirectly affect a student's achievement level by his or her absorption of the prevailing attitudes towards the value of working hard in school. Classmates may also have a direct impact on a student's achievement if they study and work together. However, it is not just the cognitive abilities of classmates that may matter. Students with poor discipline or low morale may disrupt the classroom and slow the pace of instruction, resulting in poor achievement that in turn leads to dropping out.\nA number of studies examine the effects of peers and school environment on student achievement and school completion. For example, Zimmer and Toma (2000) examined mathematics test score data from over 16,000 public and private schools in five countries (Belgium, Canada, France, New Zealand, and the United States). They analyzed the effects of the classroom average test score on a student's test score after controlling for the student's previous test score. This so-called \"value-added\" approach implicitly controls for the student's own ability level and prior achievement (Hanushek, 1979 (Hanushek, , 1986 . The analysis also controlled for mother's and father's occupations and education levels and other family characteristics, as well as a number of school characteristics. Zimmer and Toma (2000) found that \"the higher the mean test score of the classmates, ceteris paribus, the higher the achievement level of the student.\" The effect is non-linear, with a decrease in the peer effect as the mean score of peers rises. This implies that the peer effect is greatest in low-performing schools such as those in poor neighborhoods. There is also a negative interaction between a student's pre-test score and the mean level of peer achievement. Thus, students who are already struggling are those most likely to be negatively affected by having underperforming fellow students. The peer effects were not significantly different in the five countries in the study, or between public and private schools, despite vast differences in school financing, student assignment policies, and pedagogy.\nThe Zimmer and Toma study is particularly strong because of the rich set of parental controls, but many other studies confirm these results. Hanushek et al. (2003) , using public school data from Texas, took a different approach by using \"fixed effects\" to isolate the peer effect from other confounding influences. In a fixed effects model, the variation across statistical units is effectively removed from the data so that only variation within the units contributes to the estimated effects. Hanushek et al. (2003) included fixed effects for students and schools by grade. They found that average peer achievement has a highly significant effect on learning across the test score distribution. Further, a higher proportion of students eligible for reduced price lunch significantly reduces math achievement gains in value-added models, although not in models with fixed effects for students, schools, or school-by-grade. To the extent that family income matters, it is presumably not the poverty of the students per se, but unobserved characteristics of the students that are correlated with family income. Summers and Wolfe (1977) analyzed 6th grade outcomes on the Iowa Test of Basic Skills, controlling for the 3rd grade score from 627 students in 103 randomly selected Philadelphia elementary schools, and control for a wide variety of student, family, teacher and school characteristics. They concluded that \"high achievers are relatively unaffected by the variation in the percentage of top achievers. But, for the low achievers, the intellectual composition associated with other characteristics of the student body has a direct impact on learning\" (647). In contrast, Argys et al. (1996) , analyzing the National Education Longitudinal Study (NELS) data, found that the gains lower-ability students experience when they share classes with higher-ability students are offset by nearly identical declines among the higherability students."}, {"section_title": "Neighborhood Effects on Achievement", "text": "Similarly, substantial support exists in the literature for a neighborhood effect on achievement. Wilson (1987) argued that many of the negative outcomes observed in high-poverty neighborhoods, including high levels of dropping and low levels of student achievement, can be attributed to \"concentration effects.\" Children in high-poverty neighborhoods \"seldom interact on a sustained basis with people who are employed,\" and that causes students to question the value of education. In this social milieu, both students and teachers become discouraged and put in less effort, leading to a vicious downward cycle of low expectations and low achievement.\nThe empirical evidence, though far from consistent, certainly includes studies finding evidence of neighborhood effects on education outcomes. Datcher (1982) , using the Panel Study of Income Dynamics (PSID), found that a $1,000 increase in the mean income at the zip-code level increased years of schooling by about one tenth of a year. Corcoran et al. (1990) , also using the PSID, found effects of zip-code level measures of family structure and welfare receipt. Zip codes, however, are quite a bit larger than our mental conception of what constitutes a neighborhood. Crane (1991) argued that high-poverty communities experience epidemics of social problems. Using a special tabulation of the 1970 Census based on neighborhood units much smaller than zip codes, Crane found a sharply non-linear effect of the percent of neighborhood workers in professional or managerial jobs on the probability of dropping out. Crowder and South (2003) found that neighborhood effects on dropping out among AfricanAmericans has increased over the past quarter century, perhaps tied to increasing concentration of poverty (see also Vartanian and Gleason 1999) .\nFew studies actually look simultaneously at school and neighborhood variables. Gonzales et al. (1996) did report significant effects on gains in GPA for both \"peer support\" and \"neighborhood risk\" for a sample of African-American high school students. However, the sample size was small (151), the sample was not randomly selected, and the peer and neighborhood variables were self-reported. Owens (2008) finds that both relative and absolute neighborhood resources have effects on high-school graduation and graduation from college in models that control for school environments.\nStudies of neighborhood effects must contend with selection bias (Tienda 1991) . Because parents choose neighborhoods, the attributes of parents may be correlated with neighborhood and school characteristics even after controlling for observed parental variables. If this selection effect is present, school and neighborhood variables may be biased by picking up the effect of the unmeasured parental characteristics. Experiments are a good way to deal with selection bias, because random assignment minimizes variation between the experimental and control groups.\nHowever, there are very few truly experimental studies of neighborhood effects, because it is both difficult and expensive to randomly assign families to neighborhoods and/or schools. The Moving to Opportunity (MTO) Program, however, did randomly assign families to a treatment consisting of a move from high-poverty public housing projects to Section 8 housing in lowerpoverty neighborhoods in five major cities. Early analyses indicated substantial gains in reading and math scores among young children in Baltimore, those between the ages of 5 and 12 at the time of random assignment (Ludwig, Ladd, and Duncan, 2001) . However, later studies on larger samples found no measurable effect on either reading or math test scores (Sanbonmatsu et al. 2006) . Final evaluation studies of MTO are ongoing, focusing on children who were young at the time they moved to lower poverty neighborhoods. Thus, the question posed in the title of this paper remains unanswered: should we worry more about negative environments to which children are exposed before or after the school bell rings?"}, {"section_title": "Data and Methods", "text": "Three types of data are used in this analysis. Data on students and schools are drawn from the (White, 1987) ."}, {"section_title": "School addresses obtained from the Texas Education Agency and other public sources", "text": "were used to geocode the schools by identifying the latitude and longitude of the school and linking that location to the corresponding census tract. While census tracts and elementary school attendance zones are similar in size, in practice they are unlikely to overlap exactly. Any given elementary or middle school's attendance zone is likely to include all or part of the census tract in which it is located and may contain all or part of neighboring census tracts. However, the sociodemographic characteristics of a school's census tract are likely to be highly correlated with the characteristic of the school's attendance zone, and in any event the tract variables reflect the actual local environment of the school itself.\nThe dependent variables in these analyses are test scores. Texas was an early adopter of a testing regime tied to school accountability. The TAAS test was administered statewide at various grade levels from 1991 until 2002, when it was replaced by a different testing system. The TAAS tests were not high stakes tests for students, but the passing rates (not average scores) were used to determine accountability ratings at the school and district levels.\nWe focus on the 5th to 8th grade TAAS tests (both math and reading) in 2000 as our outcome and the corresponding 4th to 7th grade TAAS tests in 1999 as controls for prior achievement and, implicitly, for the student's ability. scores, but students who for various reasons did not take the test: they were absent, ill, exempted, and so forth. The lower tail, students scoring 9 or lower, is so thin that nothing is lost by excluding all zeros from the analysis, even though it is theoretically possible that a handful of them were actual scores.\nEven with the zeros excluded, the frequency distribution of test scores is troubling. The scores are bunched up near the maximum value; the distribution is heavily skewed to the left.\nConverting the raw scores to z scores would only change the scale and not affect the shape of the distribution. Given the administrative focus on the use of TAAS passing rates for school accountability, the test is constructed to be more sensitive at the lower end of the scale. Very few questions differentiate students at the higher end of the achievement distribution, creating a ceiling effect (Clopton, 2000) . Vijverberg (2004) points out that the ceiling effect is not an example of censoring, which would be indicated by a spike in the histogram at the maximum score. Rather, the scale of the test is not constant, because a one point increase in the raw score in the lower or middle of the distribution represents a smaller increase in actual achievement than a one point increase near the top of the distribution. Linear regressions, as employed below, assume that a one unit increase in the test score \"represents the same amount of learning regardless of the students' initial level of achievement or the test year\" (Harris, 2009 ). Therefore, regression based on the raw scores or z scores are problematic.\nThe solution is to renormalize the scores to a scale such that a fixed increase represents the same increase in achievement at any score value. An assumption must be made about the actual distribution of achievement in the student population, since according to this argument the distribution is not accurately represented by the raw scores. The standard assumption is that most social psychological variables are normally distributed in the population (see Mayer 1960) . In effect, we calculate the percentile score of the student in the raw score distribution and convert it back to a z score as if the distribution were normal.\n1 A z score has a mean of zero and a standard deviation of one.\n1 For technical details of the transformation, see Vijverberg (2004) .\nThis procedure spreads out the scores at the upper end of the distributions, as shown in Figure 4 .2. While the normalized score is still less precise at higher levels, a one unit change in the normalized score has the same meaning at any point in the scale, conditional on the normality assumption. Further, the normalization is done separately by grade, resulting in a consistent mean and standard deviation across grades, allowing the data to be pooled for analysis.\nWe analyze the math test scores for all 5th to 8th grade students who took the test in 2000.\nInitially, there are slightly more than 1 million valid student scores across 4,755 schools. Since about 1.2 million students were enrolled in those grades in 2000, substantial numbers of students did not take the math test. Some students were exempt from taking the test. Some students are given a Spanish version of the test, which we choose not to include in our analysis. Local school officials may exempt some special education students and students not sufficiently proficient in English or Spanish to take one of those versions of the test. Finally, some students may have been ill or absent on the day of the test.\nWe attempt to match those students with valid 2000 scores to a corresponding test score in the previous grade in 1999, so that the prior year score can be used to control for prior achievement and ability. The identifier used to link the records across years is an encrypted version of the student's social security number. Twenty-two percent of the valid 2000 math scores could not be matched to previous grade test scores from 1999. In some cases, the students had temporary or mistyped identifiers in one of the years. In other cases, the students may have moved into Texas in 2000 from out of state or from private school. We also excluded students who, despite seeming to have a matching identifier, appear to be different students because of differences in race, gender, and/or birth date. Excluding the students who could not be reliably matched to a prior score drops the final analysis sample to 822,268 for math and 819,955 for reading. Of the students observed in both years, 62 percent were in the same school in both years, and 38 percent moved from one school to another between 1999 and 2000. The movements can occur either because the family moved or because the student moved to the next level of schooling, e.g. from elementary to a middle school. The exact year of structural school transition varies from district to district in Texas.\nThe inability to find a previous test score for so many of the students is a cause for concern. Simple t-tests comparing students with prior year matches to those without matches find significant differences in race, ethnicity, poverty status, and gender. While we control for the observed differences in our analysis, the possibility remains that there may be unobserved differences between the students we can track and those that we cannot track that are correlated with school and neighborhood characteristics. We attempt to control for these unobserved differences using a value-added model, as described below.\nStudent scores on a standardized test are a noisy measure of their skills and knowledge at a point in time, which in turn result from the confluence of several factors. Any given test score can be modeled as a function of individual and family characteristics, school characteristics, and neighborhood characteristics. Ideally, we should include variables for the entire history of the child's school and neighborhood experiences. In practice, we only have measures of these quantities at or near the time of test administration. Omitting past values of these variables is also problematic because a student and his classmates often have experienced similar schools and neighborhoods over time, potentially inflating the estimated coefficients for the current observed school and neighborhood characteristics (Hanushek et al. 2003) . Further, bias will be introduced if unmeasured individual or family characteristics that affect achievement are correlated with school and neighborhood characteristics as the result of geographic mobility and other parental choices that affect when and where a student goes to school.\nOne approach to this dilemma is to estimate value-added models, which include previous test scores for each student. The lagged test scores implicitly incorporate the influence of unmeasured factors in prior years. The prior test scores also implicitly incorporate individual student attributes for which we do not have good measures, such as native ability and motivation, so long as these attributes are constant over time. More than one prior test can be included; for example, in a model for the math score we include both a prior math score and a prior reading score, as these prior scores are included to capture a variety of past influences that may bear on the ability to learn a subject in the current period, not simply subject-specific knowledge. As a result, the coefficients in this analysis measure the current contribution of individual, school, and neighborhood factors to the change in the student's test score.\nIn addition to the lagged test scores, a number of individual level control variables are included in the analysis. These include indicator variables for race and ethnicity: Black, Hispanic, Asian, and Native-American; non-Hispanic White is the omitted category. Indicator variables for female and eligibility for free and reduced price lunch are also included. The latter indicates family income up to 185 percent of the federal poverty line. Several variables are included to indicate the academic classification of the student. These are gifted, special education, and limited English Proficiency. These three variables are taken from the student's 1999 record, rather than 2000, to avoid the possibility that they are caused by, rather than the cause of, the student's current academic performance.\nSeveral characteristics are included to capture the school context. These are computed at the school/grade level. Unfortunately, the TSP data do not identify the specific classroom and teacher of the student. If there are four 8th grade classes within one school, the data do not allow you to tell which students were in which classrooms. We computed the averages for all classes Descriptive statistics for these variables can be found in Appendix Results Table 4 .1 shows the 2000 normalized TAAS math and reading scores for the analysis sample by race and ethnicity. The normalization described above is computed using all students who took the test in a particular year (the full distribution of valid test scores), but the statistics in these tables only include those in our analysis sample, those who have a test in both 1999 and 2000 and can be linked over time via valid identifiers. This explains why the mean score is slightly greater than zero; the students whose scores cold not be matched had lower scores on average than those who could be matched.\nMean math scores vary by race and ethnicity. Anglo students are about one third of a standard deviation above the mean, while black students are about a third of a standard deviation below the mean. Hispanics are also slightly below the mean, while Asians and the small sample of Native Americans are above the mean. Lower income students, those eligible for free and reduced price school lunches, score lower in every racial and ethnic group. Overall, low-income students are about one-half standard deviation lower than higher income students.\nThere is a clear and consistent relationship between student math test scores and the poverty rate of the neighborhood, as shown in Figure 4 .3. Students in the lowest quintile of neighborhood poverty rates have an average math test score of more than 0.4. As neighborhood poverty increases, the average math score steadily declines. Students in the highest quintile of neighborhood poverty rates have an average math score of less than -0.2. Similarly, Figure 4 .4\nshows that the average math score is strongly positively correlated with the proportion to the neighborhood proportion of children in married couple families. 2 While these graphs present prima facie evidence of neighborhood effect on student achievement, one cannot attribute a causal effect to neighborhood characteristics without controlling for student characteristics and school environment variables. robust standard errors allowing for correlation in the disturbance terms within a school. Model 1 includes only the student variables, Model 2 includes student and school variables, Model 3 includes student and neighborhood variables, and Model 4 includes all three sets of variables simultaneously. The coefficients may be read as multiples of a standard deviation, because the normalized test score scale has a mean of zero and a standard deviation of one. In other words, a coefficient of 0.10 would indicate an effect size equal to one tenth of a standard deviation in the test score, which would be considered a very large effect.\nBoth math and reading prior scores, from the 1999 TAAS, have large and highly significant effects on the math test scores in all models. As expected, the size of the coefficient on the prior math score is larger for the math test and vice versa, but both are less than one indicating some regression to the mean. In other words, students who performed very well or very badly in a given year tend to move back towards the mean in the following year, other things equal.\nIndicator variables for race and ethnicity are included because of the large and persistent gaps between groups discussed earlier, but ultimately the goal is to understand the process that drives these gaps by adding variables that reduce the dummy variable coefficients to zero. The coefficient for black students is negative and significant in all models, but it is much lower than the unconditional gaps shown in Table 4 .1 that do not control for prior test scores or other variables. For example, in Model 1, the math score for a black student is 0.131 lower than for Anglo students, conditional on past scores and other student characteristics. The comparable figure for reading is somewhat smaller, -0.0931. This is a much smaller gap between black and white students than in Table 4 .1.\nThe unconditional Hispanic/Anglo gap is about one fourth of a standard deviation, but it is quite small in the math value-added specifications shown here, about -0.025. The reading gap is about three times larger. Asian students score about one fifth of a standard deviation better than Anglo students do in math, but not better in reading. The reduction in the racial gaps accomplished by including lagged test scores does not indicate that disparity between the race groups has been explained. It only indicates that the gap is somewhat persistent from year to year and was already reflected to a large extent in the 1999 test score.\nGirls score higher than boys do on reading tests by about 0.06 in all models, even controlling for past scores. There is also a very slight advantage for girls in math, about 0.003. By and large, the included school characteristics are not that sensitive to the inclusion of neighborhood variables. Contrary to expectations, the coefficient on the percentage of economically disadvantaged students in the same school and grade as the student is positive and significant. This finding is consistent with the Hanushek et al. (2003) , based on the same underlying data, who report positive coefficients for federal school lunch program participation.\nThey argue that school lunch is a noisy measure and that schools vary in their efforts to identify eligible children. However, simply omitting peer average math score (discussed below) from the model reverses the sign on classmates' school lunch participation. Thus, lower income peers are not harmful, and possibly an advantage, controlling for the academic performance of those peers and the other variables, including the student's own school lunch status and prior performance. This is possibly a relative deprivation or \"frog pond\" effect, where a student may get more resources or have more confidence if or she is relatively higher in the local social status ranking (Jencks and Mayer, 1989; Owens, 2008) .\nWhat is harmful, apparently, about having poor classmates is not that they are from lowincome families, but that on average they have lower academic performance. This is confirmed by the large and highly statistically significant coefficients on average performance of the student's peers in the school in the same subject (lagged two years), about one tenth of a standard deviation in both reading and math. The effect of peer scores is only slightly diminished when neighborhood characteristics are added in Model 4. Despite controlling for a student's past test score, this coefficient may be biased upwards by correlation between unmeasured factors that are common to the student and classmates, such as teacher quality. The two-year lag in the peer test scores mitigates this concern to a certain extent.\nAnother potential source of bias is the \"reflection problem\" (Manski, 1993) , which posits that cooperative and interdependent elements of teaching and learning lead to joint determination of student outcomes. Peers influence a student's performance, but by the same token the student influences the peers. For reasons stated earlier, the peer measure here is based not on the specific classmates of a student, but on all students at the same grade within a school. The inability to identify classrooms is a disadvantage in terms of measuring the actual quality of a student's peer group, especially if there is non-random sorting into classrooms. However, it serves to slightly diminish concern over the reflection problem, because students are far less likely to jointly determine outcomes of students in different classrooms.\nTurnover measures the proportion of students in the school and grade who attended a different school in the prior year. More turnover lowers academic performance, presumably by the disruptive effect of high turnover rates on the school and classroom environment. One potential problem in interpreting this coefficient is that school turnover is related to geographic mobility, given the geographic basis of school assignment. Therefore, school turnover is related to residential instability, which could also be construed as a neighborhood characteristic. We intend to introduce a residential instability measure in future models.\nNeighborhood poverty is the key measure in the theoretical and empirical literature on neighborhood effects. While the Census contains far more detailed measures of the income distribution than the poverty rate, it is the measure most comparable to the school lunch program eligibility variable. Recall that we are examining the relative contribution of school and neighborhood characteristics. If neighborhood socioeconomic status were measured with more precision than school socioeconomic status, we would tilt the playing field toward neighborhood effects.\nContrary to expectations, for both reading and math the neighborhood poverty rate is positive and significant in Model 3 (which does not include the school characteristics). The coefficients decline (and become negative in the case of reading) but lose statistical significance in Model 4, which includes the school/grade characteristics as well. In the absence of school controls, the neighborhood poverty rate is biased by the omission of the student poverty rate, which has a positive coefficient as discussed earlier. There is virtually no change in the R 2 when the neighborhood variables are added to the model that includes school variables. However, a joint test of the significance of the three variables rejects the Null Hypothesis that the coefficients are all zero.\nThe prior discussion gives evidence that neighborhood socioeconomic conditions affect student test scores. However, the models presented certainly do not include all of the ways in which schools might differ from one another. Given that there are left out variables concerning the school context, and given that school context and neighborhood conditions are clearly correlated, incompletely controlling for school context can easily bias the coefficients on neighborhood conditions. To overcome this issue and confirm the finding that neighborhoods have an independent effect, we employed a second strategy. We repeated the models of Tables 4.2 and 4.3 including fixed effects for schools. The fixed-effect model essentially discards the variation between the schools in test scores and explanatory variables, and uses the variation in those variables within schools to identify the effects on student achievement. Thus, the school fixed-effect models implicitly control for the influence of any school context variables that are common to all classes within the school.\nThe coefficients on the student characteristics were largely unaffected. However, the school/grade variables became miniscule and insignificant with the inclusion of school fixed effects. The reason for this is that these coefficients are only identified by variation across grade levels within a school. Apparently, the poverty, student turnover, and prior math scores of a student's peers vary much more across schools than across grades within schools.\nThe neighborhood variables perform differently in the school fixed effects model. The coefficients on neighborhood poverty became negative and, in the case of reading, statistically significant. As shown in Figure 4 .5, the coefficients on percent of children in married couple families were reduced by half or more relative to the models in Tables 4.2 and 4 .3 and, in the case of reading, the coefficient loses statistical significance. 3 The percent of college graduates remains large, positive, and statistically significant in both reading and math, and the magnitude of the coefficients increases by a factor of two or more in the case of math. When school context is maximally controlled by the inclusion of school fixed effects, the most powerful neighborhood variable turns out to be the higher education indicator. Taking this result at face value, it suggests that neighborhood effects on student achievement, after controlling for student and school characteristics, operate more through aspirations and attitudes toward education than resources or parenting styles.\nGiven the particular interest in how disadvantaged students are affected by living in poor neighborhoods and attending dysfunctional schools, we also estimated separate regressions for poor and non-poor students, again determined by their participation in the federal school lunch program. As shown in Figures 4.6 and 4.7, school effects are larger and more statistically significant for poor children than non-poor children. 4 In contrast, the positive effect of married couple families and college graduates in the neighborhood is stronger and more statistically significant for non-poor children in math. For reading, percent college graduates has a larger positive effect for the non-poor, and the neighborhood poverty rate, which has been insignificant in all the previous models that controlled for school/grade variables, has a negative and significant effect for poor children."}, {"section_title": "Conclusion", "text": "Looking at the results, several observations stand out. First, the school variables are more robust and explain a greater degree of the variance in test scores than the neighborhood characteristics.\nLittle harm is done in estimating school context effects without considering neighborhood effects, at least if neighborhood characteristics are measured by census tract variables. On the other hand, we note that very different estimates of neighborhood effects are obtained if school context variables are omitted, or if they are controlled via fixed effects. If researchers attempt to link significant coefficients to conclusions about causal mechanisms operating at the neighborhood level, perhaps through value formation, community role models, and so on, then the lack of control for school context can be misleading.\nOn the other hand, the neighborhood variables in this analysis are drawn form the census tract in which the school is located, which may or may be a good approximation of the school's physical neighborhood or any given student's residential setting. Despite this measurement error, which would tend to bias the coefficients toward zero, the neighborhood level variables as a group were statistically significant even in the presence of school variables. The particular pattern of effects varied by the way in which school context was controlled, by poverty status, move status, and location in the conditional achievement distribution. Nevertheless, neighborhood always mattered.\nFrom a policy perspective, the question is slightly different. School environments and school context are shaped by many factors, but clearly the characteristics of the families in the neighborhood are a principal driving force. Even if neighborhood conditions are less robust than school context effects, concern about neighborhood conditions is still justified. Schools are largely formed as a geographic overlay on residential segregation. Reducing the concentration of poverty and economic segregation generally may be the easiest way to decrease the \"savage inequalities\" that exist between schools (Kozol, 1991) . Thus, we ought to be concerned about neighborhood effects on school achievement both by direct mechanisms and indirectly through their role in shaping school environments. "}]