[{"section_title": "Abstract", "text": "Endothelial keratoplasty is now favored over full-thickness penetrating keratoplasty for corneal decompensation secondary to endothelial dysfunction. Although endothelial keratoplasty has evolved as surgeons strive to improve outcomes, fewer patients than expected achieve best corrected visual acuity of 20/20 despite healthy grafts and no ocular comorbidities. Reasons for this remain unclear, with theories including anterior stromal changes, differences in graft thickness and regularity, induced high order aberrations, and the nature of the graft-host interface. Newer iterations of endothelial keratoplasty such as thin manual DSEK, ultrathin DSAEK, and DMEK have achieved rates of 20/20 acuity of approximately 50%, comparable to modern cataract surgery , and it may be that a ceiling exists, particularly in the older age group of patients. Establishing the relative contribution of the factors that determine visual quality following endothelial keratoplasty will help drive further innovation, optimising visual and patient-reported outcomes while improving surgical efficacy and safety."}, {"section_title": "INTRODUCTION", "text": "Endothelial disorders such as Fuchs endothelial dystrophy (FED) and pseudophakic bullous keratopathy (PBK) account for over a third of corneal transplants. 40, 60 In recent years, selective replacement of the diseased endothelium with a donor endothelial graft has superseded traditional full-thickness penetrating keratoplasty (PKP), 92 with endothelial keratoplasty (EK) constituting 40% of all corneal grafts in the USA in 2010 -compared with only 4.5% in 2005. 5 Full thickness PKP may still be required when anterior stromal scarring has occurred secondary to the underlying endothelial pathology, although significant visual improvements have still been achieved with EK in such cases."}, {"section_title": "M A N U S C R I P T A C C E P T E D ACCEPTED MANUSCRIPT", "text": "Determinants of visual quality after endothelial keratoplasty Somewhat tempering these advantages, final best corrected visual acuity (BCVA) after EK is variable. Mean postoperative BCVA is 20/40 at 3-6 months postoperatively, 5, 8 and rates of patients achieving 20/40 or better following EK range from 38% to 100%. 5 Guerra et al reported that only 23% of DSAEK patients achieved VA >20/25 at 12 months follow-up, despite having otherwise healthy eyes and clear corneas with no evidence of graft failure, 44 and similar results with EK have been found by several others. 72, 77, 108, 138 . Possible explanations for this include optical degradation at the graftrecipient interface, 64 increased corneal thickness, increased high order aberrations, stromal scarring and fibrosis secondary to the underlying pathology, and increased light scatter. 54 In their review, Anshu et al commented that a higher proportion of patients receiving PKP for endothelial dysfunction may eventually achieve BCVA of 20/20 through the use of hard contact lenses; 5 however, no primary data was provided in support of this claim. Head-to-head comparisons of PKP and EK have failed to demonstrate statistically significant differences in final BCVA outcomes. 69, 86 Earlier, large series of PKP reported visual acuity of 20/40 or better in 47-65% patients treated for FED and 20-40% in patients treated for pseudophakic or aphakic bullous keratopathy, with follow-up ranging from two to eight years. 5 In contrast, 38-100% of patients undergoing manual or automated Descemet stripping endothelial keratoplasty (DSEK / DSAEK) achieve 20/40 or better across several studies. 5 Furthermore, a large study of the UK National Transplant Registry comparing patients with FED undergoing EK (n=678) or PKP (n=1087) found better mean BCVA at 2 years postoperatively in the EK group (0.30 logMAR; Snellen equivalent 20/40) than in the PKP group (0.40 logMAR; Snellen equivalent 20/50, p<0.0001). 43 These figures indicate that, while a proportion of DSEK / DSAEK patients fail to reach their full visual potential, visual outcomes are superior to those of PKP.\nDescemet membrane endothelial keratoplasty (DMEK) can deliver superior visual outcomes to DSEK / DSAEK. Poor visual outcomes after DMEK are almost always due to ocular comorbidity, central corneal scarring, or graft failure, 28 although DMEK remains more technically challenging than DSEK / DSAEK. 18 Busin's technique of ultrathin DSAEK has achieved visual outcomes comparable to DMEK, with greater proportions of patients achieving 20/20 BCVA than with older iterations of EK. 17 Busin reported 48.8% patients achieved BCVA 20/20 or better at 24 months after ultrathin DSAEK, excluding eyes with vision-limiting comorbidity. 17 Similarly, half of patients undergoing DMEK achieve BCVA 20/20 or better. 45, 103 As a comparison, excluding patients with ocular comorbidity, 94 .6% of patients undergoing cataract surgery with phacoemulsification achieve BCVA of 20/40 or better, and 52.3% achieve 20/20 BCVA. 59 In other words, modern iterations of EK may offer comparable results to routine cataract surgery in terms of BCVA.\nWe review what is currently understood about the optical effects of EK. We highlight areas yet to be fully elucidated that require further study in order to refine techniques and improve long-term visual outcomes. We do not seek to argue the case for one form of EK over another. Instead, we strive to explore what prevents patients achieving their greatest potential visual quality after EK in order to direct future surgical innovation and research.\nDeterminants of visual quality after endothelial keratoplasty 4\nVisual performance in the human eye depends on both corneal transparency and surface regularity. A highly organised matrix of corneal collagen fibrils maintains corneal clarity by minimising light scatter. Light scatter is limited by the small fibrillar cross-section, and any scattered light is further reduced by destructive interference by adjacent fibrils. Anything that disturbs this matrix or affects the corneal surface threatens the optical quality of the cornea.\nDeterminants of visual quality after endothelial keratoplasty 5\nDeterminants of visual quality after endothelial keratoplasty\nSimilarly, Rudolph et al demonstrated significantly fewer posterior corneal HOAs after DMEK compared with DSAEK and PKP, with the exception of coma and coma-like aberrations. 108 Mean posterior HOAs in the DMEK group remained higher than those in normal corneas, and no significant correlation was found between posterior HOAs and BCVA. 108 In the same study, BSCVA was significantly better post-DMEK (0.16 +/-0.08 logMAR) than post-DSAEK (0.27 +/-0.06 logMAR) (p<0.001), with the authors suggesting that thinner grafts may improve visual outcomes by reducing induced posterior aberrations and more closely approximating the physiological curvature of healthy corneas. 108 Further study comparing ultra-thin DSEK (<100 microns) with DMEK would help substantiate this.\nThe internal optics of the eye (posterior corneal surface and crystalline lens) directly oppose and reduce anterior corneal aberrations in normal eyes, 9, 33, 62, 118, 139 with compensation by the posterior corneal surface leading to an overall reduction in whole eye HOAs. Posterior corneal changes after EK affect its parallelism with the anterior corneal surface. 139 These changes include tilt and decentration, which have both been reported to increase whole-eye HOAs in the context of intraocular lenses, 16, 35 and increased corneal thickness. 139 Disruption of parallelism may reduce the compensatory ability of the posterior cornea, exaggerating the effects of anterior corneal irregularity and increasing whole eye HOAs, 54, 77, 139 and negatively impacting the modulation transfer function. 139 Using Scheimpflug 3D-reconstruction and ray-tracing in normal eyes, Dubbelman et al found that the posterior cornea compensated for 3.5% of the anterior corneal coma aberration. 32 In a wavefront study of keratoconus eyes, Chen et al found that the posterior cornea compensated for 14-24% of the coma aberration of the anterior cornea. 24 Yamaguchi et al developed a surface parallelism index (SPI) to quantify changes in parallelism, 139 with a lower SPI indicating a greater degree of parallelism between the anterior and posterior corneal surfaces. They compared normal eyes with those having undergone DALK, PK or DSAEK, and found reverse wavefront patterns in the normal, PK and DALK eyes, implying similar shapes of the anterior and posterior corneal surfaces. 139 In contrast, the anterior and posterior wavefront patterns differed in eyes post-DSAEK. The SPI of DSAEK eyes was significantly greater than that of normal and PK eyes, with the DALK group lying approximately in the middle. SPI was found to correlate significantly with posterior corneal HOAs. 139 Total corneal astigmatism and HOAs were significantly lower than anterior corneal astigmatism and HOAs in the normal, PK and DALK groups, whereas in the DSAEK group, total and anterior corneal astigmatism and HOAs were similar. 139 This work supports the role of the posterior cornea in compensating for anterior corneal irregularities, with EK causing disruption of parallelism. Across the groups, the posterior corneal surface decreased total corneal HOAs by approximately 10%. 139 Contrastingly in the DSAEK group, rather than being reduced through posterior compensation, total corneal HOAs were in fact increased by up to 20% compared with anterior HOAs. 139 Significant correlation was found between visual acuity and anterior corneal\nHOAs, but not posterior corneal HOAs. 139 The authors concluded that this correlation was a byproduct of the loss of compensation by the posterior cornea. \nDeterminants of visual quality after endothelial keratoplasty 116 Graft thickness reduced significantly between day one and week one, and again between week one and month one post-operatively, after which it stabilised. 116 Visual rehabilitation took longer, improving progressively up to six-months postoperatively. Moderate, significant correlation was found between graft thickness and visual acuity at six-months postoperatively. Correlation at one month and at final follow-up was very weak, and we acknowledge the significant association at six months could represent a type 1 error. There was no correlation between total corneal thickness and visual acuity at any time-point. 116 No significant difference in visual acuity was found between grafts <100 microns thickness and grafts >100 microns. Similarly, there was no difference between the thick and thin graft groups when the median graft thickness (142 microns) was used as a cut-off, as per the methodology of Neff et al. 87 We recognise our paper had several limitations because of its retrospective nature, with grafts analysed at different time intervals with unequal sample sizes at each time point.\nStudying pseudophakic eyes post-DSEK, Seery et al found no correlation between graft thickness and BCVA at either 12 or 24 months. 112 While there was no correlation between graft thickness and total\nHOAs at 12 months, there was a strong association at 24 months, although total HOAs did not change between 6 and 24 months. 112 No correlation was found between total HOAs and BCVA at 12 months, but weak correlation was found at 24 months. The authors suggested the difference in correlation between HOAs and graft thickness at 12 and 24 months may be secondary to a change in thickness of the donor lenticule. 112 Separately, Seery et al reported increased forward-scatter post-DSEK compared with healthy pseudophakes, which was unrelated to either host, graft, or total corneal thickness.\nDeterminants of visual quality after endothelial keratoplasty\nQuestions regarding the impact of total corneal and graft thickness post-EK remain unanswered by suitably powered, prospective trials. Thin grafts have been found to have fewer irregularities than thick grafts, 30, 108 and it may be this, rather than thickness per se, that is the crucial aspect. Further work is required to elucidate the precise role of corneal thickness in visual quality after EK, and to establish whether a cut-off point exists with graft thickness, below which significantly better visual outcomes are achieved, independent of the nature of the interface.\nDeterminants of visual quality after endothelial keratoplasty"}, {"section_title": "Determinants of corneal optical quality after endothelial keratoplasty", "text": ""}, {"section_title": "Visual acuity versus visual quality", "text": "There are several theories regarding why some patients fail to achieve their full visual potential after EK. Visual acuity is an important component of visual quality, but quality of vision can also be degraded by several other factors. These include abnormal diffraction in the posterior graft, anterior host cornea, and the interface; high order aberrations (HOAs) related to surface and interface irregularity; and light scatter from corneal haze. 84, 91, 137 Patients with high contrast visual acuity of 20/20 or better may complain of poor visual quality secondary to phenomena such as glare and poor contrast sensitivity that do not always correlate with visual acuity. A full assessment of visual quality therefore requires testing of these visual functions, not just high contrast acuity."}, {"section_title": "High order aberrations and light scatter", "text": "Correlation has been found between HOAs and visual acuity after DSAEK, 111 femtosecond laserassisted keratoplasty, and PKP, 22 due to the degradation by HOAs of the small-angle domain of the retinal point-spread function. 112 McLaren and Patel studied induced forward light scatter and wholeeye HOAs in healthy eyes. 77 They induced light scatter greater than would be expected after DSEK, but found only a minimal effect on BCVA. In contrast, they found that induced HOAs had a much greater adverse impact on acuity, suggesting that HOAs rather than scatter are the predominant cause of reduced vision after EK. 77 Pantanelli et al demonstrated significantly improved visual acuity and contrast sensitivity after DSAEK using wave aberration correction with adaptive optics (AO) technology to eliminate the majority of ocular aberrations. 91 91 The PKP and DALK groups, however, were comprised of predominantly younger phakic patients with keratoconus, compared to an older pseudophakic group undergoing DSAEK for FED. Therefore, comparisons between the study groups cannot be accurately made, although the authors suggested that the discrepancy in visual outcomes could be partially attributed to light scatter caused by corneal haze. 91 This hypothesis was supported by Maier et al, who compared 10 patients who had received DMEK in one eye and DSAEK in the other. 75 Both BCVA and contrast sensitivity were significantly better in the DMEK eyes, but this was not explained by any significant difference in LOAs or HOAs between the two techniques, thus implicating other factors. 75 Several other studies have found correlation between corneal haze and visual acuity following EK, and these will be discussed in section 5."}, {"section_title": "Low order aberrations", "text": "Low order aberrations (LOAs) also play a role, including defocus and cylinder. EK is known to result in hyperopic shift owing to increased thickness and curvature of the posterior cornea. 56 LOAs are easily recognised and are amenable to refractive correction and are therefore less problematic than other determinants of vision. Accordingly, we concentrate on those factors that cannot be readily diagnosed or rectified. To try and disentangle the many variables that influence visual quality after EK, we will discuss each element of the post-EK cornea separately."}, {"section_title": "Influence of the anterior cornea (host recipient)", "text": "While endothelial dysfunction is the primary pathology indicating EK, secondary abnormalities of the anterior cornea occur depending on the underlying disease. These include chronic stromal edema and resultant collagen disorganisation, 54, 58 Although EK involves substantially greater manipulation of the posterior than the anterior cornea, it is widely suggested that the anterior cornea is the key determinant of visual outcomes. The effect of anterior corneal changes on vision relates to the larger change in refractive index than that which occurs at the posterior corneal surface, 95 meaning a small change anteriorly will have a greater impact than the equivalent change posteriorly."}, {"section_title": "An argument for earlier intervention?", "text": "These anterior corneal changes have led to the theory that earlier surgery may produce superior visual outcomes by limiting the duration of stromal edema and reducing fibrosis. 66, 81, 84, 133 Controversy exists regarding this, with Yamaguchi et al finding no correlation between duration of bullous keratopathy and postoperative visual acuity or anterior or posterior corneal HOAs. 137 Morishige and co-workers found that subepithelial fibrosis and anterior stromal scatter post-DSAEK were reduced in patients with preoperative stromal edema of less than 12 months' duration, 82 with significantly better VA achieved in patients with shorter disease duration. 81 Similarly, a histological study in cases of PBK undergoing PK found significantly increased stromal scarring, inflammation, and neovascularisation in the group with disease duration exceeding one year. 73 A definitive answer to this question would only be provided by a sufficiently powered, prospective randomised trial, but such a study is unlikely to be conducted because of the ethical implications of delaying necessary intervention."}, {"section_title": "Anterior cornea and HOAs", "text": "HOAs have consistently been found to be higher post-EK than in normal corneas. 67, 95, 112 Chamberlain et al found that anterior corneal HOAs were higher after DSAEK than in age-matched controls, showing that the underlying disease process and / or the surgical technique (i.e. corneal incisions) have a tangible effect on the anterior cornea. 21 Whole-eye HOAs were found to be higher post-DSEK than in corneas that had undergone non-wavefront guided LASIK surgery. 20 This has generated M A N U S C R I P T"}, {"section_title": "A C C E P T E D ACCEPTED MANUSCRIPT", "text": "Determinants of visual quality after endothelial keratoplasty 6 considerable interest, given that EK itself causes minimal disruption of the anterior corneal surfacesuggesting other sources of increased HOAs must exist.\nYamaguchi et al found that anterior rather than posterior corneal surface irregularity influences visual acuity after DSEK for bullous keratopathy. 137 Anterior corneal HOAs decreased from preoperatively to one and three months postoperatively, whereas there was no difference in posterior corneal HOAs. 137 There was significant correlation between anterior HOAs, but not posterior HOAs, and visual acuity at three months. This may reflect the resolution of other visionlimiting factors such as stromal edema and interface irregularity.\nThe same group subsequently found that anterior corneal irregularity was greater after PKP than after DSAEK, whereas there was no significant difference in the posterior surface. 138 Posterior corneal HOAs were found to be significantly greater post-DSAEK than in normal eyes. 138 This study also demonstrated no significant difference in anterior HOAs between normal and post-DSAEK corneas, although there was a trend for greater anterior HOAs in the DSAEK group, 138 possibly representing a type 2 error.\nKoh et al demonstrated significantly lower anterior corneal HOAs after DSAEK than after PKP or DALK, but still greater than in normal control eyes. 67 Patients with residual corneal edema or central M A N U S C R I P T\nDeterminants of visual quality after endothelial keratoplasty anterior corneal HOAs in the central 4mm zone and BCVA after DMEK, but did not discuss this further in their paper. 108 \nDeterminants of visual quality after endothelial keratoplasty 9 macrofolds are known to affect vision. 36, 71 Graft folds affect the posterior corneal surface, and are believed to be due to a mismatch in curvature between the host stroma and anterior graft surface. 112 Letko et al reported uneven graft thickness and graft folds in the visual axis of the donor graft in cases of unsatisfactory visual acuity after DSAEK. 71 Seery et al found that thicker grafts were associated with more graft folds, which in turn correlated moderately and significantly with HOAs at 24 months (r=0.44). 112 \nDeterminants of visual quality after endothelial keratoplasty be negligible. While interface irregularities may be a source of HOAs, these would only have a noticeable effect on vision if they were transmitted to the endothelial surface -where the change in refractive index is greater than at the interface.\nWhereas a Cochrane database systematic review of randomized clinical trials demonstrated no significant differences in BCVA outcomes between PKP and non-laser assisted DLEK, PKP outperformed FLEK significantly in patients with FED or PBK (BCVA 0.35+/-0.20 logMAR in the PKP group versus 0.55+/-0.20 logMAR for FLEK). 25, 86 This was attributed to interface haze and increased stray light, potentially caused by laser-activation of keratocytes, as well as irregularity of the laserdissected graft surface. 25 Refinements in graft preparation (manual and automated microkeratome techniques) and progressively thinner lenticules may reduce the role of interface irregularities in determining postoperative visual outcomes.\nDeterminants of visual quality after endothelial keratoplasty found between PKP and DALK, 7 although this may relate to the fact that HOAs could not be measured in the most irregular corneas.\nThese studies support the theory that the stroma-stroma interface obtained via DSEK / DSAEK is optically inferior to the DM-stroma interface obtained via DMEK that more faithfully replicates the natural cornea.\nDeterminants of visual quality after endothelial keratoplasty significantly at 12 months post-DSEK for FED. [131] [132] Younger patients were affected by increased straylight more than older patients, supporting the theory that younger patients may be symptomatic with FED despite having good visual acuity. 131 Younger patients also enjoyed greater reduction in straylight post-DSEK, suggesting faster and more complete repair of the host stroma. 131 Koh et al investigated corneal light scatter by using the 'densitometry' program of the rotating Scheimpflug camera to examine patterns of backscattered light after PK, DALK and DSAEK. 68 Transmitted light attenuation (or \"corneal density\", as referred to in the original study) was graded from 0 (no clouding) to 100 (completely opaque). 68 A normal pattern (gentle slope from periphery with a slight peak in the anterior cornea) was seen in all control eyes and 75% of PKP eyes, whereas 57% of DSAEK eyes and 92% of DALK eyes had a \"double-peak\" pattern, with two sharp peaks in the anterior and posterior cornea. 68 42% DSAEK eyes exhibited an anterior peak pattern, with a single sharp peak in the anterior cornea. 68 Visual acuity correlated significantly with corneal scatter, and the results suggested that increased light scatter originated from both the anterior and posterior cornea after DSAEK. 68 The effects of light scatter on visual acuity and contrast sensitivity may be more apparent in everyday life, with varying ambient lighting and sources of glare in the environment. 77 Hindman et al measured BSCVA, glare disability, corneal light scatter, and corneal thickness pre-and post-DSAEK in 20 pseudophakic eyes. 54 Corneal light scatter decreased significantly from preoperative levels and continued to decrease in all corneal layers between 1 and 12 months post-DSAEK. 54 The largest decrease in light scatter occurred at the interface. There was weak but significant correlation between BSCVA and scatter in the subepithelial region, host stroma and interface. 54 There was no correlation between decreasing light scatter and corneal thickness, suggesting that reduction in scatter was due to changes in cellular activity and extracellular matrix remodeling, rather than deturgescence. 54 Mean BSCVA improved postoperatively, and continued to improve between 1 and 12 months (from 0.47+/-0.05 to 0.22+/-0.03 logMAR). 54 Importantly, BSCVA varied with different glare conditions, with acuity improving significantly in low glare (dim) and non-significantly in moderate glare conditions, but remaining poor (0.8 logMAR) in high glare (bright) conditions. 54 The effect of high glare on acuity was greater than that expected in normal corneas, 54 which reflects findings of other authors. 77 This variation in acuity in different glare conditions is presumed secondary to corneal light scatter. 54 Significantly greater corneal haze has been demonstrated three months post-DSAEK than post-PKP. 127 Subepithelial, anterior stromal and interface haze has been found to persist for up to two years after EK, although there is a tendency for improvement. 15, 94 The anterior recipient cornea has been shown to be the primary source of haze after DSEK and DLEK. 15, 77, 94 A confocal microscopy study of DSAEK found that haze reduced between one and six months after surgery, and that subepithelial and interface haze persisting at six months was a risk factor for decreased visual performance. 64 Accordingly, good preoperative vision secondary to milder anterior corneal changes is a predictor of better visual outcomes postoperatively. 94, 121 6. The effect of corneal thickness M A N U S C R I P T\nDeterminants of visual quality after endothelial keratoplasty 13 DSEK / DSAEK are additive procedures, with a variable amount of donor stroma transplanted along with the endothelium and Descemet membrane. Therefore, central corneal thickness is greater post-DSAEK than post-PKP. 138 This has led to the suggestion that varying graft or total corneal thickness may explain the different visual outcomes after EK, 71, 87, 98, 100 and this in turn has encouraged surgeons to strive for ever thinner grafts -with \"ultrathin\" DSEK (sub-100 micron) and DMEK being the latest incarnations.\nDeterminants of visual quality after endothelial keratoplasty patients without other ocular pathology. 59 Persistently striving for 20/20 in patients requiring EK may be futile, or only achieved at the expense of more complex surgery with a higher risk of complications and needing further operations.\nDeterminants of visual quality after endothelial keratoplasty below which correlation with VA exists independent of the nature of the interface, but above which there is little influence on visual outcomes, other than in exceptional cases with unusually thick grafts. This may explain why several studies have failed to demonstrate significant correlation. Further comparison of DMEK with ultra-thin DSEK / DSAEK maintaining a stroma-stroma interface may elucidate this theory.\nWhen considering wavefront error, most studies so far have reported high-contrast visual acuity as the primary outcome measure, although it is known that HOAs have a greater impact on lowcontrast visual acuity and contrast sensitivity. This could explain why studies have failed to reach consensus on links between anterior and posterior corneal HOAs, graft thickness and vision. Highcontrast visual acuity is a less sensitive measure of visual performance, perhaps leading to some papers suffering type 2 statistical error when exploring associations between visual outcomes and other variables. Relatively few studies to date have utilised whole-eye aberrometry, with most generating aberrometry data from corneal topographic height data. Devices that combine multiple measurement modalities, including corneal topography and Hartmann-Shack or ray-tracing aberrometry, may shed further light on the impact of wavefront error and its link with other parameters.\nAnterior segment imaging continues to evolve, with ever-increasing image resolution promising superior in vivo visualisation than has been possible previously. New devices will further characterise the shape, regularity, composition and apposition of the graft and host cornea, with the ability to monitor this over time. This could increase our understanding of the source and contribution of light scatter and posterior corneal compensation.\nWhile one explanation for DMEK outperforming DSEK / DSAEK in terms of visual acuity is the difference in graft thickness, another is the nature of the interface. Convergence of host and donor stromal fibres and differences in refractive index are two possible theories as to why a stromastroma interface might be inferior to the more anatomically correct DM-stroma interface. However, studies have already started to emerge showing that 'ultrathin' DSEK can emulate the results of DMEK, suggesting the stroma-stroma interface may not be the limiting factor. It remains unclear why more eyes without ocular comorbidity do not achieve BCVA of 20/20, even with DMEK. Failing to fully restore the structure of the virgin cornea seems the probable explanation, but what exactly prevents us from achieving this -anterior haze, the interface, graft thickness, anterior-posterior parallelism, or something else? Establishing the answer to this question will help guide future developments in endothelial keratoplasty. Another important factor is the conditions under which visual acuity and other parameters of visual quality are measured. Most studies to date have been retrospective, without the assurances of standardisation afforded by carefully conducted prospective trials. While such retrospective studies provide useful 'real-world' data, they do not enable precise head-to-head comparison of different treatment modalities.\nWhile scientifically interesting, do subtle variations in HOAs and light scatter result in changes in visual quality appreciable by patients? Studies to date suggest perhaps not, meaning that striving for optical perfection may be outweighed by preserving the ease of surgery, conserving endothelial cell count, and improving long-term graft survival. Reducing graft thickness leads to greater difficulty with surgical handling, and it remains to be seen from longer-term studies whether this M A N U S C R I P T\nDeterminants of visual quality after endothelial keratoplasty 19 manipulation leads to accelerated endothelial cell loss and increased rates of late graft failure. Patients may not feel that a marginal improvement in optical quality, perhaps only appreciable with special testing, justifies a potentially increased risk of future re-grafting. Therefore, when striving to minimise aberrations and scatter, the actual impact on the patient should be borne in mind. Accordingly, PROMs represent an important variable in this area of study. It is also interesting to note that the rate of 20/20 achieved following routine cataract surgery is similar to that following EK -and there may indeed be a ceiling for visual acuity in many patients, particularly the elderly, regardless of surgical refinements.\nDeterminants of visual quality after endothelial keratoplasty M A N U S C R I P T\nDeterminants of visual quality after endothelial keratoplasty M A N U S C R I P T\nDeterminants of visual quality after endothelial keratoplasty M A N U S C R I P T\nDeterminants of visual quality after endothelial keratoplasty M A N U S C R I P T\nDeterminants of visual quality after endothelial keratoplasty M A N U S C R I P T\nDeterminants of visual quality after endothelial keratoplasty M A N U S C R I P T\nDeterminants of visual quality after endothelial keratoplasty M A N U S C R I P T\nDeterminants of visual quality after endothelial keratoplasty"}, {"section_title": "Anterior cornea and light scatter", "text": "Melles' group studied backscattered light (haze) and corneal HOAs post-DMEK, comparing these with age-matched controls. 133 While haze and posterior corneal HOAs were reduced at six months postoperatively, anterior corneal HOAs remained unchanged. After recipient age and preoperative BSCVA, anterior corneal HOAs and haze were found to have the strongest association with postoperative BSCVA. 133 Using confocal microscopy, Patel and McLaren found abnormal subepithelial cells in the host cornea and reduced anterior stromal cell density, independent of preoperative oedema or fibrosis, up to three years post-DSEK for FED. 96 They suggested these abnormalities may be implicated in postoperative visual outcomes."}, {"section_title": "Influence of the posterior cornea (donor graft)", "text": "If the anterior cornea is predominant in determining postoperative vision, why should DMEK produce different outcomes to DSEK / DSAEK? Theories include a more regular posterior graft surface with greater thickness uniformity , 31, 77, 112 thinner grafts with a better match in curvature, and improved parallelism between the graft and recipient and improved optical compensation by the posterior cornea. 139 Posterior corneal HOAs are increased after all forms of EK compared with normal controls, 21, 54, 84, 108, 137 and posterior corneal HOAs after DSAEK seem to be comparable to or greater than post-PKP. 21, 108 It has been suggested that the posterior corneal surface is the source of increased whole-eye HOAs after DSEK compared with normal eyes or eyes post-PKP. 54, 95 This may be secondary to graft decentration, differences in curvature between the recipient and the graft, or uneven graft thickness from asymmetric trephination. 67, 84, 108 While the change in refractive index between air and the anterior cornea / tear-film is high, the change between the posterior cornea and aqueous humour is low. This has led some authors to reason that changes in the posterior cornea should not affect visual acuity. 54, 138 Although correlation has been demonstrated between anterior corneal HOAs and postoperative BCVA, 84, 108, 137, 139 several studies have failed to find a similar association between posterior corneal HOAs and postoperative BCVA. 68, 81, 84, 133, 137 Despite this, the impact of the posterior corneal surface on visual outcomes should not be ignored. "}, {"section_title": "Posterior corneal compensation, parallelism and HOAs", "text": "In patients with various indications but predominantly FED / PBK, Chamberlain et al found that DSAEK resulted in greater posterior corneal HOAs than PKP, with the exception of spherical aberration, with weak correlation between increased HOAs and reduced BCVA. 21 While all forms of keratoplasty had increased posterior corneal HOAs compared with normal controls, femtosecond laser-assisted keratoplasty (FLAK) resulted in the least, with the authors hypothesising that FLAK more closely replicates the natural posterior corneal curvature than DSAEK or PKP."}, {"section_title": "21", "text": ""}, {"section_title": "Graft Folds", "text": "The role of graft thickness and graft folds on whole-eye HOAs and visual acuity after DSEK for FED has been investigated. 112 Graft folds can be sub-divided into micro-and macrofolds -of which only M A N U S C R I P T"}, {"section_title": "Influence of the graft-host interface", "text": "Since the first emergence of anterior lamellar keratoplasty, the graft-host interface has been suspected of contributing to postoperative visual limitation. 120 While little is known for certain regarding the role of the graft-host interface in visual performance post-EK, it is thought that interface opacity induces HOAs, loss of contrast sensitivity 140 and loss of acuity. 51 Convergence between the differently orientated host and donor stromal collagen fibres at the interface is considered to be a source of optical aberrations in DSEK / DSAEK -a situation theoretically overcome by DMEK.\n74,79"}, {"section_title": "Interface opacity", "text": "Usually, the graft-host interface post-EK is almost invisible on slit-lamp examination, 120 because of its lack of induced backscatter, with specialised equipment usually required to detect interface opacity; however, increased reflectivity at the interface after EK has been found with Scheimpflug imaging, 74 with significant correlation demonstrated between interface reflectivity and BSCVA. 51 Another study\nused confocal microscopy to demonstrate reflective particles in the interface post-DSAEK, but could not identify their source. 101 Similarly, \"needle-shaped\" particles have been found within the deep host stroma, but again their source and importance is uncertain. 64 An optical coherence tomography (OCT) study of 14 eyes with interface haze post-DSAEK found that,although haze tended to improve, it caused persistently reduced vision in 3 eyes, necessitating re-grafting. 63 In these re-grafted eyes, histopathology revealed no inflammation, foreign body deposits or fibrosis, and the authors proposed that retained ophthalmic viscosurgical device (OVD), or another adhesive property of the OVD, was the cause for interface haze 63 -a suggestion supported by an earlier study. 6 Epithelial ingrowth of the interface has also been reported in up to 2% of DSAEK cases, often requiring a re-graft. 8, 114, 119 Despite these reports, it remains uncommon for interface opacity to be visible on slit-lamp examination, and light scatter only affects visual acuity in extreme cases, 111 While small interface opacities may reduce visual quality through increased light scatter (i.e. glare), they seem unlikely to play a major role in determining visual acuity. Certainly, interface opacity does not explain why some patients have reduced visual acuity in the presence of a clear cornea."}, {"section_title": "Interface irregularity", "text": "Irregularities in the dissected stromal surface of EK grafts are often referred to as \"interface irregularities,\" from this surface interfacing with the host cornea. In reality, these interface irregularities represent uneven graft thickness. Once fully adherent, uneven graft thickness manifests as irregular curvature of the posterior (endothelial) surface, as the stiffer anterior host stroma resists deformation. The refractive index at the interface has not been studied, but is likely to M A N U S C R I P T"}, {"section_title": "The interface in DMEK", "text": "DMEK theoretically eliminates the stromastroma interface associated with DSEK / DSAEK. 133 Faster and improved visual rehabilitation has been achieved with DMEK. 46, 48, 70 In the largest series of DMEK reported to date, 41% eyes without ocular comorbidity attained BCVA of 20/20 or better at six months."}, {"section_title": "107", "text": "In studies of patients with predominantly FED, 50-75% of eyes undergoing DMEK achieved 20/25 at six months, compared with only 6% of those receiving DSAEK. 26, 123 Theories of why DMEK optically outperforms DSEK / DSAEK include reduced graft thickness and the different nature of the interface, with the lack of a stroma-stroma interface, avoiding its associated optical issues. 57, 74 Although many patients achieve 20/20 vision after DMEK, others do not. This suggests that it is not just the nature of the interface that determines visual outcomes."}, {"section_title": "The interface in DALK -what does it tell us about the interface in EK?", "text": "Studies of DALK may have some applicability to endothelial keratoplasty. One study of DALK in patients with keratoconus compared visual results of those with a stroma-stroma interface (pre-DM-DALK) against those with a DM-stroma interface (DM-DALK). 37 Low-contrast visual acuity was significantly inferior to PKP in the pre-DM-DALK group, but equivalent to PKP in the DM-DALK group. Pelli-Robson contrast sensitivity was comparable after PKP and DM-DALK, but significantly worse in the pre-DM-DALK group. A quarter of DALK eyes had some interface opacity, and HOAs were similar between both types of DALK and PKP. 37 This suggests the difference in interface may influence contrast sensitivity and low-contrast visual acuity, but not necessarily HOAs or high-contrast acuity. Non-significant trends for better high-contrast VA after DM-DALK compared with pre-DM-DALK have been found. 1, 37 In a similar study of 236 keratoconic eyes, Sarnicola et al found no difference in highcontrast VA outcomes between DM-DALK and pre-DM-DALK at a mean follow-up of 2.5 years."}, {"section_title": "110", "text": "Trends for decreased visual acuity have been found in eyes undergoing DALK compared with PKP."}, {"section_title": "7,115", "text": "Ardjomand et al found inverse correlation between the recipient corneal stromal thickness after DALK and visual acuity-with recipient beds <20 microns producing similar visual outcomes to eyes receiving PKP. 7 Recipient bed thickness >80 microns led to significantly inferior visual acuity postoperatively. 7 Despite differences in recipient stromal bed thickness, no differences in HOAs were M A N U S C R I P T"}, {"section_title": "The interface in LASIK -what does it tell us about EK?", "text": "While laser in situ keratomileusis (LASIK) involves a stroma-stroma interface, visual outcomes of millions of patients worldwide have been excellent -excluding complicated cases involving infection, 61 uveitis, 78 interface haemorrhage, 128 interface edema, 83, 117 or clinically obvious opacity. 38 This suggests that a stroma-stroma interface per se does not impair vision. The difference with LASIK compared with lamellar keratoplasty is that the LASIK flap is replaced in the same orientation in which it was cut, despite the stromal ablation, thus more closely recreating the normal corneal structure. Conversely in DSEK / DSAEK, the graft and host are (by definition) from different corneas, with convergence of the host and donor stromal fibres lying in different orientations. causality.\nAn alternative measure of glare disability is straylight, which is an objective physiologic measure of the large-angle domain of the retinal point-spread function. 130, 132 The precise source of straylight cannot be determined by slit-lamp examination, 132 as it is a product of forward rather than backscatter. It is estimated however that one third of the total straylight in the normal eye is corneal in origin, 132 with ageing changes in the crystalline lens contributing more straylight in older individuals. [131] [132] This is an important consideration when comparing measures of light scatter or straylight in phakic patients, with studies of pseudophakic eyes generally yielding more reliable information as the variable contribution of the crystalline lens is negated. 132 Seery et al and van der Meulen et al both found significantly less straylight in healthy pseudophakic eyes compared with eyes treated with DSAEK / DSEK respectively for FED, with the difference assumed to be predominantly secondary to the cornea. 111 , 132 Seery et al found no correlation between straylight and high-contrast VA at six months post-DSAEK, with the authors concluding that forward scatter does not affect acuity except in extreme cases, 111 although this study did not explore changes in straylight and acuity over time. Van der Meulen et al found straylight improved M A N U S C R I P T"}, {"section_title": "Hyperopic shift and regular astigmatism", "text": "Hyperopic shift (mean spherical equivalent of up to 1.5D) occurs after DSEK / DSAEK due to increased corneal thickness and posterior curvature. 18, 41, 56, 141 Reduction in posterior corneal curvature over time leads to diminishing hyperopia. 56 Hyperopia is increased by grafts with thick peripheries and thinner central regions acting as minus meniscus lenses. 8, 141 Newer techniques with thinner grafts have produced less hyperopic shift, in the order of 0.75D. 18 Additionally, thin DSAEK and DMEK result in only slight changes in astigmatism, 17, 45 unlike thicker DSEK / DSAEK that may induce up to 0.6D of cylinder. 18 Regardless, hyperopic shift and astigmatism are correctable with refraction and so should have minimal effect on BCVA."}, {"section_title": "Reducing graft thickness", "text": "With DSEK / DSAEK, donor graft thickness is variable even with automated microkeratome dissection. In one study, 87% grafts measured 100-200 microns, 10.9% >200 microns and only 2.1% <100 microns. 135 Femtosecond laser dissection may offer advantages in creating consistently thin grafts that preserve endothelial cell density, but with current techniques this is offset by a rough stromal surface when observed with scanning electron microscopy. 99 With refinements in surgical technique, more consistently thin donor lenticules have been possible. In our practice, we recently reported 10 consecutive cases of thin manual DSEK (TMDSEK) using tissue pre-soaked in balanced salt solution, achieving a mean graft thickness of 90.7 microns (range 48-137 microns) at one month postoperatively. 125 Busin has also reported better visual outcomes with his ultrathin-DSAEK technique compared with conventional DSAEK, achieving grafts of 73+/-14 microns.\nA DMEK, which aims to replace donor endothelium-Descemet membrane (EDM) with no overlying stroma, has been shown to be superior to DSEK / DSAEK in terms of visual outcomes, particularly in the early postoperative period. [46] [47] 50, 76, 97, [103] [104] [105] 123 Tourtas et al found that central corneal thickness reduced from 652+/-92 microns to 517+/-45 microns after DMEK and from 698+/-137 microns to 618+/-66 microns after DSAEK. 123 This difference in thickness is one explanation for the improved visual outcomes."}, {"section_title": "Graft thickness and visual outcomes", "text": "Neff et al compared \"thick\" and \"thin\" DSEK, by using the median graft thickness (131 microns) to divide the grafts into two groups. Significantly superior BSCVA was achieved in the sub-131 micron group at one-year follow-up. 87 They suggested that graft thickness and curvature are key determinants of visual quality, rather than the nature of the interface, although they did not include a correlation analysis between graft thickness and BSCVA. Thinner grafts may also suffer less from crush injury caused by injector systems, although this is more likely to affect long-term graft survival than postoperative vision. 99 "}, {"section_title": "111", "text": "In a series of 418 eyes, Terry et al found significant but weak correlation between preoperative thickness of pre-cut graft lenticules and BSCVA at 6 months, with the thinnest grafts (80-124 microns) achieving significantly better acuity than the thickest (200-265 microns). 122 Nevertheless, graft thickness accounted for only 5% of the visual outcome. They concluded that, while extremes of graft thickness (either very thin or very thick) may affect visual outcomes, the relationship between thickness and vision is otherwise tenuous, and the possible small benefit to visual outcomes of sub100micron grafts may be offset by the increased difficulty of tissue-handling. 122 In patients with unacceptable vision after DSEK / DSAEK, Melles' group reported significant visual improvements after re-grafting with secondary DMEK, as well as significantly lower coma and trefoil. 31 In this study, identifiable causes of reduced visual performance after initial DSEK / DSAEK included host-Descemet remnants in the visual axis, irregular graft thickness, stromal waves and high reflectivity at the interface. 31 The original DSEK / DSAEK procedures referred to in this paper were a heterogeneous group, with grafts ranging in thickness from 57 -390 microns. It is unclear whether the improvements produced by DMEK were related to a reduction in corneal thickness, with thinner and more anatomically faithful grafts, or a change in the nature of the interface.\nIn summary, there may be a ceiling effect with post-EK visual acuity in the elderly population. As previously discussed, 20/20 visual acuity following routine cataract surgery is achieved in just 52.3% M A N U S C R I P T"}, {"section_title": "The effect of graft dislocation", "text": "Graft dislocation is the commonest early complication of DSEK / DSAEK, with a mean incidence of 14.5% (range 0% to 82%). 22 Following graft dislocation, 're-bubbling' is required to reattach the graft, but this may itself cause problems. Intracameral air causes endothelial cell loss, 34, 126 and re-bubbling / graft manipulation may lead to a further decline in endothelial cell density. 22 This could be a concern with DMEK, given the higher incidence of graft dislocation. 108 Reassuringly, while Tourtas et al reported a significantly increased need for re-bubbling in DMEK (82%) compared with DSAEK (20%), this had no effect on either endothelial cell density or visual acuity at 6 months."}, {"section_title": "123", "text": "Two studies found no significant differences in HOAs between eyes with primary adherent transplants and those needing up to two re-bubblings. 84 , 108 Rudolph et al did show a significant increase in coma and coma-like aberrations in eyes needing three re-bubblings, possibly secondary to peripheral Descemet's rolls that persisted despite multiple attempts. "}, {"section_title": "The effect of recipient age", "text": ""}, {"section_title": "Age and aberrations", "text": "Even in the absence of specific vision-limiting ocular pathology, visual quality tends to decline with increasing age. 39 According to Gittings and Fozard's report from the Baltimore Longitudinal Study of Aging, the majority of people retain distance acuity of at least 20/40 into their 9 th decade. 39 Increased recipient age has been shown to predict worse visual acuity post-EK in eyes without vision-limiting comorbidities. 94, 102, 133 Recipient age has been found to correlate positively with anterior corneal HOAs, 95, 134 and there is evidence that age is a factor in the optical quality of the cornea post-EK. 95, 111 While mean recipient age varies among published studies, EK is usually performed on patients in their 7 th decade or above. This contrasts with other graft modalities such as PKP and DALK, which are often performed on a younger patient population for different indications. Large studies of EK by Massimo Busin and Gerrit Melles reported a mean patient age of 68 years. 17, 107 Sicam et al have shown in normal eyes that spherical aberration increases with age. 118 Contrastingly, Oshika et al found no correlation between age and spherical aberration, but identified weak but significant correlation between age and coma-like aberration. 90 Seery et al found significant positive correlation between recipient age and retinal straylight in eyes post-DSEK, but failed to demonstrate correlation between age and the small-angle domain of the retinal point-spread function."}, {"section_title": "Reduced posterior corneal compensation", "text": "Dubbelman et al found that the compensatory ability of the posterior cornea to reduce total corneal HOAs diminished with increasing age. 32 Whereas whole-eye HOAs tend to be lower than corneal\nHOAs in younger patients, whole-eye HOAs become higher than corneal HOAs with increasing age. [9] [10] This reflects a progressive reduction in the ability of the internal optics to compensate for corneal irregularity."}, {"section_title": "The role of neural adaptation in visual rehabilitation", "text": "In addition to the structural changes associated with corneal disease and EK, neural adaptation also plays a role in visual performance. 91 An interesting confounding factor in Pantanelli et al's study (see section 1.2), which used adaptive optics correction to investigate the impact of HOAs on visual acuity, was that the PKP group were tested a significantly longer period after surgery than the DSAEK group. 91 The authors hypothesised that the better visual performance in the PKP group could support the role of neural adaptation in compensating for postoperative HOAs. 91 Importantly though, the underlying diagnosis in the PKP group was predominantly keratoconus (4 of 5 cases) and all patients were phakic. Conversely, the DSAEK group (n=5) were exclusively pseudophakes affected by FED and of a mean older age -factors that could affect the contribution of neural adaptation.\nThe impact of neural adaptation has been demonstrated in a study of keratoconic and normal eyes. 109 In this study, keratoconus eyes performed better than normal control eyes that had the same keratoconic aberration imposed on them with adaptive optics technology. 109 The authors suggested that this was secondary to the keratoconus eyes having had a longer period of time to adapt to their aberrations than the normal eyes."}, {"section_title": "109", "text": "These studies support the role of neural adaptation in visual rehabilitation. Longer follow-up of patients undergoing EK may elucidate how important this role this."}, {"section_title": "The effect of EK on macular thickness", "text": "The impact of EK on macular morphology has been discussed in two recent papers. 52, 113 Heinzelmann et al reported the results of 155 eyes undergoing DMEK; 52% were pseudophakic and the remaining 48% underwent combined DMEK and cataract surgery. 52 Of the whole cohort, 13% developed cystoid macular edema (CME) and this correlated significantly with BSCVA. 52 Following medical treatment, CME resolved and had no significant effect on long-term visual acuity. 52 ShehadehMashor et al reported a significant increase in macular thickness in patients undergoing combined DSAEK and cataract surgery, but no significant change in patients receiving DSAEK alone. 113 Careful examination and imaging of the macula represents an important investigation for patients with suboptimal vision following EK."}, {"section_title": "The importance of the patient experience", "text": "Although HOAs, light scatter, and other variables may result in statistically significant adverse effects on vision, are these effects clinically relevant? In other words, do they result in a tangible worsening of visual quality appreciable by patients?\nHigh satisfaction rates have been reported post-EK. 11 This could be due to numerous factors, including faster visual rehabilitation, fewer sutures and less induced astigmatism compared with PKP. A survey of patients who had undergone PKP in one eye and DSAEK in the other found that all preferred the DSAEK experience. 14 While high-contrast visual acuity can occasionally disappoint after EK, increased contrast sensitivity may produce subjective improvement in visual quality. 88 Contrast sensitivity has been shown to improve significantly after DMEK. 19 While this may not always manifest itself in improved high-contrast visual acuity, it represents an important factor in determining the overall visual quality perceived by patients.\nGreater patient satisfaction was also reported with DSAEK compared with DLEK. 13 While no significant difference in measured visual outcomes was found between the groups, 75% patients perceived better vision post-DSAEK. 13 There was a non-significant trend for better contrast acuity and contrast threshold post-DSAEK. 13 In similar studies of patient-reported outcome measures (PROMS) looking at patients receiving DSAEK in one eye and DMEK in the other, patient satisfaction was high for both techniques; an overall preference was expressed for DMEK -a finding attributed to faster recovery, better UCVA and BCVA, and improved contrast sensitivity. 42, 44, 75 A confounding factor in contralateral eye patient satisfaction studies is that the more affected eye tends to be the first eye to receive a graft, and in turn tends to be managed with the older surgical technique. This exposes the data to a risk of bias. In a study of patients who had received either PK, DLEK or DSEK, no differences in vision-related quality of life were found between the groups after three years, but quality of life improved quicker in the DSEK group. 124 "}, {"section_title": "Conclusion", "text": "The origin of suboptimal visual outcomes after EK is multi-factorial. It is difficult to disentangle the factors that degrade visual quality in order to establish definitive answers. Direct comparison of different studies is hampered by the variability in primary outcome measures, surgical technique and experience, ocular comorbidity, duration of follow-up and time-points of measurements, amongst other factors. HOAs and light scatter are likely to be synergistic in reducing visual quality in the early postoperative period. As certain variables reduce over time postoperatively, for example stromal edema, other components may become the predominant vision-limiting factors.\nThe impact of graft thickness remains unresolved, with studies producing conflicting conclusions regarding its correlation with visual acuity. It may not be the graft thickness or total corneal thickness per se that influences vision, but rather the degree of parallelism between the graft and the recipient cornea. This is likely to be influenced indirectly by graft thickness, with thinner grafts more faithfully replicating normal corneal anatomy and optimising posterior corneal compensation. DMEK combines an inherently thinner graft with both improved parallelism and a smoother interface, and so it is difficult to separate these variables. There may be a \"critical thickness\" of graft, M A N U S C R I P T"}, {"section_title": "Method of literature search", "text": "A PubMed search was undertaken in December 2014 using the following search terms: \"Descemet stripping\", \"Descemet membrane\", \"endothelial keratoplasty\", \"DSEK\", \"DSAEK\", \"DMEK\", \"outcomes\", \"visual acuity\", \"optics\", \"aberration\" and combinations thereof using Boolean operators. Abstracts were screened and those with relevance to this review were retrieved for more detailed analysis. Articles cited in these papers were also obtained. Abstracts of non-English language articles were also screened for relevance and the full articles obtained where appropriate.\nThe literature search was repeated in May 2015, in order to include the latest developments prior to manuscript submission. As endothelial keratoplasty represents a relatively recent surgical innovation, the review is based mainly on articles published during the last ten years, but relevant older articles have also been included."}, {"section_title": "Funding: Nil", "text": ""}, {"section_title": "Conflicts of interest:", "text": "The authors report no proprietary or commercial interest in any product mentioned or concept discussed in this article M A N U S C R I P T"}]