[{"section_title": "Abstract", "text": "for the Alzheimer's Disease Neuroimaging Initiative IMPORTANCE Biomarkers do not determine conversion to Alzheimer disease (AD) perfectly, and criteria do not specify how to take patient characteristics into account. Consequently, biomarker use may be challenging for clinicians, especially in patients with mild cognitive impairment (MCI).\nOBJECTIVE To construct biomarker-based prognostic models that enable determination of future AD dementia in patients with MCI. \nClinical end points were AD dementia and any type of dementia after 1 and 3 years.\nOf the 525 patients, 210 (40.0%) were female, and the mean (SD) age was 67.3 (8.4) years. On the basis of age, sex, and MMSE score only, the 3-year progression risk to AD dementia ranged from 26% (95% CI, 19%-34%) in younger men with MMSE scores of 29 to 76% (95% CI, 65%-84%) in older women with MMSE scores of 24 (1-year risk: 6% [95% CI, 4%-9%] to 24% [95% CI, 18%-32%]). Three-and 1-year progression risks were 86% (95% CI, 71%-95%) and 27% (95% CI, 17%-41%) when MRI results were abnormal, 82% (95% CI, 73%-89%) and 26% (95% CI, 20%-33%) when CSF test results were abnormal, and 89% (95% CI, 79%-95%) and 26% (95% CI, 18%-36%) when the results of both tests were abnormal. Conversely, 3-and 1-year progression risks were 18% (95% CI, 13%-27%) and 3% (95% CI, 2%-5%) after normal MRI results, 6% (95% CI, 3%-9%) and 1% (95% CI, 0.5%-2%) after normal CSF test results, and 4% (95% CI, 2%-7%) and 0.5% (95% CI, 0.2%-1%) after combined normal MRI and CSF test results. The prognostic value of models determining any type of dementia were in the same order of magnitude although somewhat lower. External validation in Alzheimer's Disease Neuroimaging Initiative 2 showed that our models were highly robust.\nThis study provides biomarker-based prognostic models that may help determine AD dementia and any type of dementia in patients with MCI at the individual level. This finding supports clinical decision making and application of biomarkers in daily practice."}, {"section_title": "", "text": "A lzheimer disease (AD) has a long predementia phase that is often referred to as mild cognitive impairment (MCI). The cumulative progression incidence from MCI to dementia is approximately 50% over 3 years. 1, 2 This finding simultaneously implies that the other half of patients with MCI will remain clinically stable or return to a normal state. Therefore, there is an urgent need for individualized risk assessments in patients with MCI. 3 Identification of abnormal biomarkers in patients with MCI helps to identify individuals at high risk of progression to AD dementia. 4 Atrophy on brain magnetic resonance imaging (MRI) and cerebrospinal fluid (CSF) concentrations of amyloid-β1-42 (Aβ1-42) and tau protein are among the most widely used AD biomarkers and are associated with an increased risk of AD dementia at follow-up. [5] [6] [7] [8] [9] [10] These findings resulted in the National\nInstitute on Aging and Alzheimer Association (NIA-AA) criteria, stating that biomarker evidence enhances the pathologic specificity of the diagnosis of AD dementia and MCI due to AD dementia, facilitating an accurate and early diagnosis. 3, 11, 12 However, these criteria do not specify how to deal with conflicting or borderline biomarker results and how to take patient characteristics into account. Moreover, although MRI and CSF are increasingly used in clinical practice, their diagnostic and prognostic value is not perfect. Therefore, optimal use of these biomarkers in daily clinical practice is challenging. 3, 13 We aimed to construct prognostic models based on MRI measures and CSF biomarkers for patients with MCI, taking into account patient characteristics to obtain individualized probabilities of progression."}, {"section_title": "Methods", "text": ""}, {"section_title": "Participants", "text": "This study is part of the Alzheimer's Biomarkers in Daily Practice (ABIDE) project. 14 We included 525 patients with MCI from the Amsterdam Dementia Cohort (eFigure 1 in the Supplement). Inclusion criteria were baseline diagnosis of MCI, availability of Mini-Mental State Examination (MMSE) scores, MRI and/or CSF data, and at least 6 months of follow-up. All patients had their baseline visit in our memory clinic from September 1, 1997 , through August 31, 2014 . Data were analyzed from November 1, 2015 , to October 1, 2016 . We obtained written informed consent from all patients. The study was approved by the Medical Ethics Review Committee of the VU University Medical Center, Amsterdam, the Netherlands. All data were deidentified. Diagnostic workup consisted of a standardized, 1-day baseline assessment. Clinical diagnosis was made by consensus in a multidisciplinary meeting. 15 Until early 2012, the diagnosis of MCI was based on the Petersen criteria. 11 From 2012 onward, we used the core clinical criteria of the NIA-AA for MCI. 3 The standardized annual follow-up included a visit with the neurologist and neuropsychologist. The diagnosis was reevaluated in a multidisciplinary meeting of the professionals involved. Alzheimer disease dementia was diagnosed according to the National Institute of Neurological and Communicative Disorders and Stroke and the Alzheimer's Disease and Related Disorders Association criteria or NIA-AA criteria. 12, 16 Other types of dementia were diagnosed using established clinical criteria. [17] [18] [19] [20] [21] MRI Acquisition 22 of which we only used sagittal 3-dimensional T1-weighted images with coronal reformats in this study. All images were reviewed by experienced neuroradiologists. Visual rating of MRIs was performed according to established, validated semiquantitative visual rating scales (medial temporal lobe atrophy scores, 0-4; global cortical atrophy scores, 0-3). 23, 24 Left and right hippocampal volumes (HCVs) were quantified using FSL FIRST (the integrated registration and segmentation tool of the Oxford Centre for Functional MRI of the Brain) and summed for analysis. 25 Normalized whole-brain volumes (NWBVs) were estimated with Structural Image Evaluation using Normalization of Atrophy Cross-sectional (SIENAX)."}, {"section_title": "26", "text": "Volumetric data were available for 394 patients (75.0%)."}, {"section_title": "CSF Analysis", "text": "The CSF samples (available in 417 patients [79.4%]) were obtained by lumbar puncture, collected in polypropylene tubes (Sarstedt), and processed according to international guidelines. [27] [28] [29] The CSF biomarkers Aβ1-42 and total tau were measured using sandwich enzyme-linked immunosorbent assays on a routine basis (Innotest, Fujirebio)."}, {"section_title": "9", "text": ""}, {"section_title": "Statistical Analysis", "text": "We used Stata 14SE software (StataCorp) for statistical analyses. We used Cox proportional hazards regression analysis to construct prognostic models (determinants as continuous measures; CSF biomarkers were log transformed). The models were based on complete cases only; therefore, the number of patients varied across models (eFigure 1 in the Supplement). The primary clinical end point was probable AD dementia. 12, 16 Patients who progressed to dementia not caused by AD (n = 56) were included in the analysis (non-AD group) and censored at the time of diagnosis of non-AD dementia. Subsequently, we repeated the analysis with conversion to any type of dementia as the clinical end point. We first constructed a prognostic model based on the patient characteristics of age, sex, and MMSE score (demographic model; for comparison). We expanded this model with MRI (HCV and NWBV) or CSF (Aβ1-42 and tau). Finally, we combined the previous 2 models into 1 prognostic model containing CSF biomarkers (Aβ1-42 and tau) and MRI biomarkers (HCV and NWBV) to allow a clinician to appreciate the combined value of both modalities. We focused our report on the volumetric measures and provide a model for visual measurements in the Supplement. In addition, we corrected the volumetric MRI models for field strength. Interaction effects among biomarkers and between biomarker and patient characteristics were included using backward selection. Effects were included in the model if P ≤ .10. The prognostic accuracy of the model was estimated by the Harrell C statistic. 30 Three-year and corresponding 1-year cumulative progression probabilities with 95% CIs were calculated using the Stata survci command. 31 Because of variation in clinical follow-up visit times, cutoffs were set at 3.5 years for 3-year follow-up and 1.5 years for 1-year follow-up. Specific probabilities of progression with accompanying CIs were read from the survival function for specific patients using the established models. As an example, we determined probabilities of progression for men and women, patients with a younger (60 years) and older (75 years) age, and those with an MMSE score of 29 and 24. We selected the 20th percentile as abnormal and the 80th percentile as normal for each biomarker (for tau, 80th percentile as abnormal and 20th percentile as normal) (eFigure 2 in the Supplement). When these models are used, any value can be entered for the variables, resulting in a personalized value and CI for each patient. We internally validated the models by 5-fold crossvalidation. External validation was performed on the Alzheimer's Disease Neuroimaging Initiative 2 (ADNI-2) cohort (eAppendix and eTable 1 in the Supplement). We fitted the established models to z score-converted biomarker values and calculated the Harrell C statistic."}, {"section_title": "Results", "text": "Of the 525 patients, 210 (40.0%) were female, and the mean (SD) age was 67. 3 (8.4) years. During a mean (SD) of 2.4 (1.0) years of follow-up, 201 (38.3%) patients progressed to AD dementia, 52 (9.9%) developed another type of dementia, and 272 (51.8%) remained stable ( Table 1) . 32 We constructed models to determine AD-type dementia. The variables included in each model (demographic model, CSF model, MRI model, and combined model) and their corresponding regression coefficients are presented in Table 2 . Risk estimates in the models that included a single biomarker are provided in eTable 2 in the Supplement. Inclusion of field strength only slightly affected the models (eTable 3 in the Supplement). To enable translation of findings to clinical practice, we used the models to determine the risk of progression after a 3-year follow-up, with a corresponding 1-year progression risk. Cumulative progression to AD dementia after 3 years occurred in 162 patients (30.9%) (58 [11.0%] after 1 year). Subsequently, as an example, we estimated risk of progression for men and women with a younger (60 years) and older (75 years) age and an MMSE score of 29 and 24. The model based on sex, age, and MMSE score only identified the highest risk of AD dementia for older women with lower MMSE scores. The 3-year progression risk ranged from 26% (95% CI, 19%-34%) in younger men with an MMSE score of 29 to 76% (95% CI, 65%-84%) in older women with an MMSE score of 24, and the corresponding 1-year progression risk ranged from 6% (95% CI, 4%-9%) in younger men with an MMSE score of 29 to 24% (95% CI, 18%-32%) in older women with an MMSE score of 24 ( Table 3) .\nNext, we added biomarker values. For illustrative purposes, we entered the 20th percentile of each biomarker as abnormal and the 80th percentile as normal. With these models, any value can be entered for the continuous variables, resulting in individualized values. The model that included MRI biomarkers showed that the main effects of HCV, NWBV, age, and MMSE score were associated with AD dementia at follow-up (Table 2 ). In the MRI model, age modified the prognostic value of MRI measures (NWBV × age: β = 0.003, SE = 0.002, P = .04). As an example, lower NWBV (20th percentile) increased the 3-year progression risk to 47% (95% CI, 33%-64%; 1 year: 10% [95% CI, 6%-16%]) in younger patients with an MMSE score of 29 but not in older patients (35% [95% CI, 25%-48%]; 1 year: 7% [95% CI, 4%-11%]). By contrast, absence of atrophy (80th percentile) decreased 3-year progression to 18% (95% CI, 13%-27%; 1 year: 3% [95% CI, 2%-5%]) in younger patients with an MMSE score of 29 and to 24% (95% Table 1 CI, 15%-36%; 1 year: 4% [95% CI, 3%-8%]) in older patients with an MMSE of 29 ( Table 3) . The corresponding C statistic of model performance was 0.67. The MRI model with visual rating scales is given in eTable 3 and eTable 4 in the Supplement and performs similarly. Subsequently, we constructed a prognostic model with CSF biomarkers (containing Aβ1-42 and tau). Aβ1-42, tau, and MMSE score were related to AD dementia at follow-up, whereas the effect of age was excluded from the model ( Table 2) . Having abnormal tau values was a stronger determinant of AD dementia in patients with normal Aβ1-42 values (Aβ1-42 × tau: β = 10.4365, SE = 2.8548, P < .001). The CSF model showed that abnormal biomarkers (Aβ1-42 and tau) increased 3-year progression risk to 82% (95% CI, 73%-89%) from a 1-year risk of 26% (95% CI, 20%-33%) in patients with an MMSE score of 24 and to 64% (95% CI, 53%-74%) in patients with an MMSE score of 29 from a 1-year risk of 16% (95% CI, 11%-23%). By contrast, the models showed a strong negative predictive value of CSF biomarkers, with normal biomarkers (Aβ1-42 and tau) decreasing 3-year progression risk to 6% (95% CI, 3%-9%) from a 1-year risk of 1% (95% CI, 0.5%-2%) in patients with an MMSE score of 29 and to 9% (95% CI, 5%-17%) from a 1-year risk of 2% (95% CI, 1%-4%) in patients with a MMSE score of 24. The corresponding C statistic of model performance was 0.75.\nFinally, we combined both MRI measures and CSF biomarkers in 1 model. In this model, the effect of HCV was not significant ( Table 2 ). The interaction effect between Aβ1-42 and tau remained significant (Aβ1-42 × tau: β = 10.4364; SE=2.8548;P < .001). The Figure shows isographs based on the combined model and the probability of progression within 1 and 3 years by Aβ1-42 and tau, stratified for NWBV. Threeyear progression risk ranged from 4% (95% CI, 2%-7%) in patients with an MMSE score of 29 and normal biomarkers to 89% (95% CI, 79%-95%) in patients with an MMSE score of 24 and all abnormal biomarker results, and their corresponding 1-year progression risk ranged from 0.5% (95% CI, 0.2%-1%) to 26% (95% CI, 18%-36%) ( Table 4) . The corresponding C statistic of model performance was 0.77.\nSubsequently, we repeated the analyses with dementia as the clinical end point, resulting in selection of the same variables for the demographic model (Harrell C = 0.59), MRI model (Harrell C = 0.67), and CSF model (Harrell C = 0.66) (eTable 5 in the Supplement). For the combined model, the interaction between tau and Aβ1-42 was not included in the final model via backward selection. The final model existed of tau, Aβ1-42, NWBV, age, MMSE score, and an interaction between Aβ1-42 and age (Harrell C = 0.70).\nInternal validation confirmed prognostic discrimination in all 3 models (eTable 6 in the Supplement). External validation showed robustness of the models in the ADNI-2 (Harrell C = 0.63 in the demographic model, 0.64 in the MRI model, 0.76 in the CSF model, and 0.73 in the combined model) (eFigure 3 in the Supplement).\nThe models provide risk estimates for any given value of each biomarker, taking full advantage of their continuous nature. On request, we can provide a spreadsheet calculator, which is freely available for academic use. This calculator automatically calculates probabilities with accompanying CIs of AD dementia at 3-and 1-year follow-up. The model also appreciates the value of additional testing by comparing determinations of "}, {"section_title": "Discussion", "text": "In the present study, we constructed prognostic models that provide a framework for a precision medicine approach by allowing personalized identification of clinical progression in patients with MCI using an equation based on patient characteristics and continuous biomarker values.\nClinicians show great variation in how they use and interpret biomarkers related to MCI. This variation is partly attributable to the imperfection of these markers. In addition, borderline (abnormal) or conflicting results are especially difficult to interpret. Furthermore, the meaning of biomarkers depends on the context as defined by the specific characteristics of a patient. Therefore, many clinicians are reluctant to disclose biomarker results to patients with MCI.\nThe clinical relevance of biomarker results in terms of their prognostic value for an individual is not clear. Although studies have repeatedly demonstrated the prognostic value of CSF and MRI biomarkers, these studies almost invariably showed prognostic value on group level (highly significant), precluding direct translation to the individual patient. The innovative aspect of our study is that our models allow neurologists to interpret individual patient data. We provide a calculator to translate hazard ratios to probabilities, which are easier to interpret from a clinical perspective. Finally, we provide CIs around each individually estimated probability. This process allows the clinician to appreciate the imperfectness of each biomarker and, for example, can help the identification of best-and worst-case scenarios. As such, we believe that our models can support clinicians in interpreting test results and provide them with a tool to determine AD dementia risk for an individual patient, thereby enabling them to start treatment or provide more accurate patient management. Of note, the models may have particular value in the case of normal biomarkers because the models revealed the negative predictive value of the MRI and CSF biomarkers. 33, 34 The model with both MRI and CSF measures provided the best prognostic value, which reveals the complementary value of both types of diagnostic tests and matches observations in earlier studies. 6, 35, 36 When evaluating individual modalities, CSF biomarkers, especially tau, performed better than MRI biomarkers, particularly in determining risk of AD dementia, which is in line with earlier findings. 9, 29, 35, [37] [38] [39] Several former studies 38, 39 developed models to determine the risk of AD dementia among patients with MCI, revealing the utility of biomarkers. Those studies 38, 39 often explored an optimal set of variables of progression from MCI to AD dementia, not taking into account the risk differences related to specific patient characteristics available without further diagnostic workup. We deliberately determined interactions between biomarkers and patient characteristics to secure optimal interpretation of biomarker results for AD dementia risk in individual patients. In agreement with an earlier study, 40 we found that MRI markers, particularly low NWBV, were more accurate in determining AD dementia risk in younger compared with older patients. This finding may be explained by the fact that at an older age, brain atrophy occurs in general and is not always related to underlying neurodegenerative disease. Several studies 41, 42 found that CSF AD biomarker performance also varies as a function of age because amyloid pathologic findings increase with age. In our study, we found no such age effect when determining the risk of AD dementia. By contrast, when examining the risk of any type of dementia, the prognostic value of amyloid was stronger in younger patients. This finding might fit with the notion that with increasing age, dementia is more often attributable to multiple pathologic findings and less often attributable to AD. We used volumetric MRI measurements, which tend to be better determinants of AD dementia in patients with MCI than a qualitative rating or the assessment MRIs. 43 To account for changes in measurements attributable to scanner differences, we included field strength as an additional determinant in the models. Of note, this factor did not improve the prognostic performance, a finding that shows the robustness of our models for scanner differences. Volumetric measures\nare not yet applicable in daily practice. However, software tools are in development to enable quantitative analysis of MRI in daily practice. [44] [45] [46] Because qualitative rating is used more frequently by clinicians, we also constructed prognostic models for medial temporal lobe atrophy and global cortical atrophy visual rating with broadly similar performance. These models can be found in the eAppendix in the Supplement."}, {"section_title": "Limitations", "text": "A potential limitation of this study is the mean (SD) follow-up period of 2.4 (1.0) years, which was short and varied among patients. Therefore, we did not have sufficient power to determine a 5-year outcome. In addition, we cannot completely rule out circularity in diagnostic reasoning because information from MRI and CSF biomarkers was available for the clinician at followup. To reduce the effect of this risk of circularity, we included any type of dementia as an additional clinical end point. The syndrome diagnosis of dementia is not influenced by knowledge of biomarkers because this diagnosis is a reflection of clinical functioning only. Furthermore, the outcome of any type of dementia may be considered to have more clinical relevance than that of AD dementia as long as there are no disease-modifying therapies available. The models for both outcomes were largely comparable, although the prognostic performance of the models for any type of dementia was slightly lower. This outcome was expected because we primarily evaluated AD biomarkers. An alternative approach would be the use of continuous outcome measures, such as the MMSE or Clinical Dementia Rating Scale-Sum of Boxes, which are not accounted for in the current study because we deliberately attempted to identify a clinical, dichotomous outcome measure. Another potential limitation is the drift of Aβ1-42 levels over time, which might confound results and reduce statistical power. [47] [48] [49] We did not include biomarker drift in our models because the models are intended for use in future patients, and we cannot identify how drift will develop in coming years. Furthermore, the effect of drift on overall prognostic performance is probably low. Finally, both CSF concentrations and volumetric MRI measurements vary considerably across different methods. The generalizability of the models is restricted to the use of identical methods. We validated our models in ADNI-2 using a z score approach, and we demonstrated that the prognostic models performed well despite differences in samples and methods."}, {"section_title": "Conclusions", "text": "The prognostic models described in our study could be easily implemented in daily practice, contributing to personalized diagnostic care and harmonization of clinical practice. In this article, we present a framework for a precision medicine approach. Worldwide translation of these models remains challenging and requires particular attention to generalizability across samples and measurement methods. Furthermore, models will further improve when longer-term follow-up becomes available. Nonetheless, our models show how biomarker research can be translated into clinical practice in a tractable manner. Our models may aid the clinician in interpreting biomarker values and providing individually tailored prognostic information, and the models also allow the appreciation of the incremental value of additional testing. After further validation, we intend these models to serve as input for a webbased tool (application) to support clinicians in integrating biomarkers in their daily diagnostic practice. NWBV*age: interaction between NWBV and age, Abeta(log)*Age: interaction between Abeta(log-transformed) and age #interaction between Abeta and Tau. Interaction term was centered and standardized to allow inclusion in the model."}, {"section_title": "eAppendix. ADNI Methods", "text": ""}]