[{"section_title": "INTRODUCTION", "text": "Urbanization has negative impacts on both the hydrologic health and the water quality of receiving water bodies [1][2][3] due to an increase in impervious surfaces, such as parking lots and rooftops. Increased impervious land surface reduces the infiltration of water into native soils, thereby increasing overland flow volumes and velocity [4,5]. Traditional land development relies heavily on grey infrastructure, which concentrates and quickly carries stormwater away from buildings and roadways to nearby receiving streams. The resulting increased runoff volume and velocity also contributes to significant downstream erosion, thereby degrading stream ecosystems, scouring structures (e.g., bridge foundations, catch basins), and decreasing water quality via suspension of eroded solids and sediments [6,7]. Many jurisdictions nationwide are developing stormwater infrastructure plans under the guidance of the EPA (e.g., total maximum daily loads) to address surface water bodies identified as threatened and/or impaired. Other communities are grappling with long-term water quality threats to their drinking water source including harmful algal blooms, such as Toledo, Ohio as evidenced during the Water Crisis of 2014 [8]. Extreme precipitation events, often attributed to global climate change, are exacerbating the aforementioned impacts of urbanization by decreasing water quality and increasing localized flooding [9,10]. Due to poor maintenance over the past many decades, urban infrastructures, including stormwater conveyance systems, are undersized and in disrepair [11]. To address these stormwater management issues, communities are designing and implementing green stormwater infrastructure in lieu of or in conjunction with upgrades to existing gray infrastructure. Green stormwater infrastructure includes the implementation of low impact development controls in new construction and in retrofits or redevelopment sites. Bioretention cells (BRCs), the most widely applied green stormwater infrastructure in North America, aim to restore some functions of the natural systems, including attenuation, evapotranspiration, and infiltration, present prior to urbanization and to manage stormwater close to its source [12]. BRCs are vegetated depressions that allow shallow ponding of runoff and gradual infiltration through an engineered soil and storage layer, thereby removing some stormwater contaminants (e.g., suspended solids). BRCs have been determined through direct monitoring to have water quality, hydrologic, and flow attenuation benefits in several previous studies [13][14][15][16][17][18]. Specifically, Davis [14] reported that 18% of 49 rainfall events resulted in complete capture of all inflow volume [14]. Another published study reported that the BRCs in urban Charlotte, N.C. significantly mitigated the flow (>96%) generated from small and midsized precipitation events (precipitation <40 mm) [13]. Actual hydrologic benefits from BRC implementation are highly dependent upon site-specific factors such as native soils, site imperviousness, and weather conditions (e.g., quantity and frequency of precipitation). Previous studies have reported performance based on existing BRCs and extensive data collection at individual sites but have not compared the performance of potential installations with varied soils. This manuscript outlines a novel approach to estimating BRC potential performance by utilizing continuous simulations to quantify the long-term (annual) benefits of implementing BRCs and compares performance for a wide range of soils. This transferable approach can be used to compare and identify preferred sites for planning installation of green stormwater infrastructure."}, {"section_title": "MATERIALS AND METHODS", "text": "In this study, the potential hydrologic benefit of bioretention at developed sites was estimated using a complex hydrologic model (EPA Stormwater Management Model), which allows simulation using long-term precipitation data. The models revealed the potential reduction in stormwater runoff following implementation of a BRC and as a function of the native soil type."}, {"section_title": "Stormwater Runoff Modeling", "text": "The hydrologic performance of the BRCs as a function of soil type was estimated using the hydrologic-hydraulic modeling software PCSWMM (Computational Hydraulics International or CHI, Guelph, Ontario). PCSWMM utilizes EPA's SWMM (Stormwater Management Model), originally developed by the EPA in the early 1970s, can perform both single-event and continuous simulation on catchments having storm sewers, or combined sewers and natural drainage, for prediction of flows, stages and pollutant concentrations. Several analyses of mathematical rainfall runoff models have identified SWMM as a comprehensive and representative rainfall runoff model [19][20][21]. SWMM has been used extensively to model urban runoff and runoff mitigation with green stormwater infrastructure [19,[22][23][24][25][26]. In SWMM, stormwater runoff is estimated using a nonlinear reservoir model over each subcatchment being considered [27]. From the conservation of mass equation, the net change in depth of stormwater accumulated on the land surface per unit of time is the difference between inflow and outflow rates over the area. Inflow rates include precipitation and run on from any other upstream subcatchment. Outflow rates include evaporation, soil infiltration, and stormwater runoff leaving the site (overland flow or through stormwater infrastructure)."}, {"section_title": "dd5i2e2f 2q", "text": "(1) where, i is the rate of rainfall plus run on from upstream areas (cm/h); e is the evaporation rate (cm/h); f is the soil infiltration rate (cm/h); q is the runoff rate (cm/h). Rainfall (i) and evaporation (e) can be provided by local weather and precipitation data. In order to predict stormwater runoff (q), it is necessary to estimate soil infiltration (f) during and immediately following precipitation events. Several options for modeling infiltration exist in SWMM including Horton's equation, the Green-Ampt method, and the NRCS Curve Number method (CN). In this study, the Green-Ampt method of modeling infiltration was used, due to the wide range of soil hydrologic properties considered and the ability of the Green-Ampt model to provide a good representation of soil infiltration properties less than and exceeding the rate of rainfall [28]. The Green-Ampt rate equation: where, f is the infiltration rate (cm/h); K is the hydraulic conductivity of soil (cm/h); / is the soil porosity (volume of air/ volume of voids); ⍜ i is the initial water content (volume water/total water volume), S f is the effective suction at the wetting front (cm); and F is the accumulated infiltration (cm).   Hydraulic conductivity (K), soil porosity (/), and effective suction at the wetting front (S f ) may be estimated based on local or regional soil database information. In accordance with general practice, the saturated hydraulic conductivity (K sat ) or the intrinsic permeability of the soils was used in this research."}, {"section_title": "Bioretention Cell Design", "text": "The design of the bioretention cells in this research followed the Ohio Department of Natural Resources (ODNR) Rainwater Manual guidelines [30]. The suggested design calculations base bioretention cell area on water quality volume from contributing watershed area and runoff coefficients. The guidelines also indicate that the bioretention area should be 5%-9% of the impervious contributing area if the site is greater than 25% impervious, as is the case with most developed sites as defined by C-CAP (>21% impervious). For this research, bioretention cells were sized at 7% of the impervious contributing area. The bioretention cell specification ( Figure 1) features approximately 30 cm maximum ponding depth (berm height), at least 61 cm of sandy loam texture class engineered soil media, and up to 30 cm of gravel water storage bed. The gravel storage bed contains a perforated underdrain (15 cm diameter) set above 8 cm of gravel. Bioretention cells are drained through either infiltration into the surrounding native soils or through an underdrain system in an underlying water storage layer, connected to gray stormwater infrastructure [29]. Underdrains are recommended to be included on sites composed of poorly drained soils (K sat < 1.44 cm/h) ( Figure 2). SWMM models were developed to compare before (pre BRC) and after the proposed installation of BRC. Runoff volumes (in millions of liters) generated at the sites for each scenario were compared. Changes in runoff volume post BRC were attributed to infiltration, surface depression storage, and evaporation only. All other flows, including the flow through the underdrain system and any overflows, were routed to the site outfall and calculated as runoff volume generated."}, {"section_title": "GIS Data", "text": "The models for this work were created based on the geographic information system (GIS) analysis of readily available parcel data (e.g., geographic location, soil, and area) and remote sensing from the National Oceanic and Atmospheric Administration's (NOAA) Coastal Change Analysis Program for Lucas County, Ohio. The USDA National Resources Conservation Service Soil Survey Geographic Database (SSURGO) was used to determine the soils as it contains the most detailed county level data (Soil Survey Staff, 2015), which is likely to yield better model results than the other available soil databases [30,31] and has been used extensively in hydrologic modeling studies [32,[38][39][40]. The NOAA Coastal Change Analysis Program (C-CAP) Regional Land Cover products were used for classifying developed land in Lucas County, OH [33]. This approach generates inventories of features that can be detected using remote sensing including extent of development, vegetation, and percent imperviousness. The C-CAP inventories are nationally standardized and raster-based. For this project, developed land considered includes: high intensity, medium intensity, and low intensity as well as developed open space. High Intensity contains significant land area and is covered by concrete, asphalt, and other constructed materials (80%-100%). Medium Intensity contains areas with a mixture of constructed materials (50%-79%) and vegetation or other pervious cover. Low Intensity contains areas with a mixture of constructed materials (21%-49%) and substantial amounts of vegetation or other cover."}, {"section_title": "Candidate Site", "text": "To develop the model details, a candidate site consisting of a large medical complex comprised primarily of office buildings and parking lots (56,000 m 2 ) located in Lucas County was used ( Figures 5 and 6). The generation of the model for this site required the delineation of subcatchments using an original site drainage and utility plan. The contributing watershed area composed of curbed parking lot is 100% impervious. Stormwater was quantified from parking lot runoff on the commercial site. The modeled version of the site was then retrofitted with BRCs placed in previously curbed parking lot islands or adjacent to the parking lots. The change in runoff generated following bioretention implementation in the model was quantified. Rainfall amount, site imperviousness, and site storage were based on local precipitation and any available infrastructure data. A continuous simulation, including 5 years of rain data, was used to improve the accuracy of the model since long term continuous simulations allow models to adjust parameters as a function of precipitation events, diminishing the impact of initial assumptions including initial soil moisture [26] (Figure 3). The rain gauge data for the simulation was acquired from the City of Toledo and was recorded at a station (<5 miles away) near the study site from January 1997 to December 2001. For this research, average wetting front soil suction and porosity values [34] were used for 11 soil textures representing all four HSG Classes; however, three saturated hydraulic conductivities (low, medium, high) were employed for each soil texture [35] (Table 1)."}, {"section_title": "RESULTS AND DISCUSSION", "text": "This study focused on the efficacy of bioretention cells as a function of soil characteristics (66 possible scenarios). For each scenario, the hydrologic model simulation results were compared before and after BRC implementation. Measures of efficiency included an increase in the amount of runoff infiltrated (volume) and bioretention cell performance (infiltration, evaporation, and runoff depths). Reductions in stormwater released to the environment will result in a decrease in contaminants discharged to surface waters and may result in groundwater recharge and reduced localized flooding, depending on site and soil characteristics."}, {"section_title": "Runoff Volume Reduction from the Watershed", "text": "The effects of saturated hydraulic conductivity on total runoff volume (L/yr/m 2 ) for the continuous simulations are presented in Figure 5. The simulated volume produced in the absence of a bioretention cell was estimated at approximately 450 L/m 2 watershed area per year regardless of the soil scenario because the study site is an impervious commercial site with a curbed parking lot. Thus, native soil conditions did not have a significant bearing on runoff production before the installation of green stormwater infrastructure. Prior to BRC implementation, the runoff generated is directly carried to gray stormwater infrastructure without opportunity for infiltration. After BRC implementation, the simulated volume of runoff increased with decreasing soil K sat since BRCs encourage infiltration of the captured volume. Specifically, runoff volumes in the models with BRCs ranged from 100 to almost 345 L/yr/m 2 of drainage area or 22%-76% of the volume of runoff produced in models without BRC. Statistically significant increases in runoff volume generated per year occurred when the soil K sat was less than or equal to 1.44 cm/h, defined as HSG class C and D soils. Until that point, infiltration and evaporation volumes combined are consistently above 340 L/yr/m 2 . Below a K sat of 1.44 cm/ h, the infiltrated volume consistently declines with the decrease in saturated hydraulic conductivity. The percent volume reduction drops below 50% (225 L/yr/m 2 ), where stormwater runoff exceeds infiltration, when the soil saturated hydraulic conductivity is at or below 0.3 cm/h. Therefore, some Type C soils, including all those containing loam (sandy loam, loam, silt loam, clay loam, sandy clay loam), indicate performance at or above 50% volume reduction. This finding highlights the importance of clarifying soil classification beyond hydrologic soil group, because BRC performance drops off significantly within hydrologic soil group C. Some developed sites previously considered to have poor infiltrating soils (e.g., HSG C) may be good candidates for BRC installation and performance depending on the site soil characteristics including saturated hydraulic conductivity and effective suction at the wetting front."}, {"section_title": "Bioretention Cell Performance", "text": "Continuous simulations were also used to calculate the total inflow (cm/yr) of stormwater to the bioretention cell estimated from precipitation data and site characteristics including soil infiltration rate, slope, and impervious area ( Figure 6). The outflow mechanisms from the BRC, including evaporation, infiltration, and site runoff via underdrain or overflow, were also quantified in cm per year. Each BRC, regardless of soil characteristics, received a total flow of 90 cm/yr of which 7.56 cm were lost to evaporation. In the model, available local data (monthly average temperatures) were used to estimate evaporation (Office for Coastal Management). Evapotranspiration, which is anticipated to vary   widely by season as well as plants selected, is not estimated by SWMM. Infiltration and runoff (cm/yr) were affected by the soil properties including saturated hydraulic conductivity of the native soil surrounding the BRC. The amount of infiltration (cm) was quantified in the continuous simulation by using the Green-Ampt infiltration rate equation (Eq. 2). The infiltration depth was greater than 75 cm/yr for all soils with saturated hydraulic conductivity above 1.44 cm/h (HSG Class A and B). At saturated hydraulic conductivities below 1.44 cm/h, simulated infiltration dropped off significantly from 75 cm/yr to just below 30 cm/yr. In the soils with saturated hydraulic conductivity below 0.3 cm/h, there is significant variability in the data indicating that K sat is not the only parameter affecting simulated infiltration depth (Figure 7). Other soil characteristics, including effective suction at the wetting front and porosity, also likely affect infiltration, as they are integral to the Green-Ampt equation (Eq. 2). In Figure 8, Green-Ampt infiltration rate was plotted as a function of soil texture with varying porosity, effective suction at the wetting front and saturated hydraulic conductivity for all of the soils considered in this study (11 soil textures). Initial water content (0.1) and accumulated infiltration (0.5 cm) were held constant for all soils. Although variations in the initial water content and accumulated infiltration values changed the infiltration rate slightly, the relative trends of the data (calculated Green-Ampt infiltration rate) remained the same. For soils with hydraulic conductivities of less than 0.3 cm/h, effective suction at the wetting front (S f ) was an indicator of infiltration rate since those soils in the \"higher\" range of effective suction at the wetting front, indicated by squares, resulted in higher infiltration rates. Therefore, effective suction at the wetting front likely influenced infiltration amounts in the bioretention cells for soils with hydraulic conductivities of less than 0.3 cm/h. Within the clusters of lower and higher infiltration rates (lower and higher effective suction), soils with higher porosity values generally had slightly larger infiltration rates (filled symbols) as compared with those with lower porosity (open symbols) for the same K sat . Therefore, for some Class C and all Class D soils, effective suction at the wetting front may be a more important indicator of infiltration than saturated hydraulic conductivity."}, {"section_title": "Developed Land in Lucas County", "text": "The findings of this study were applied to Lucas County, Ohio to estimate the performance of bioretention cells on developed sites. GIS analyses indicated that there are approximately 400 km 2 of developed land in Lucas County, Ohio of which the largest portion (>180 km 2 ) is low intensity developed land ( Table 2). The average volume of runoff that could be infiltrated for each soil type per contributing watershed area (L/m 2 /yr) was used to estimate the annual volume of runoff that could be infiltrated for developed properties in Lucas County, Ohio ( Table 3). The soil data set available from Lucas County, Ohio included only soil texture information. Therefore, average values were used for soil parameters for each texture including saturated hydraulic conductivity, porosity, and effective suction at the wetting front to estimate the Green-Ampt infiltration rate (Table 1).  The vast majority (>90%) of developed land identified in Lucas County was positioned on soils that demonstrated good performance (K sat > 0.3 cm/h) in this study. Besides Type A and B soils (sand, loamy sand, sandy loam), which were expected to have good infiltration rates (>345 L/m 2 / yr), Type C soil (loam) also showed significant potential for infiltration (311 L/m 2 /yr). Of all the developed land in Lucas County, the majority of it (almost 20%) is positioned on loam soils (HSG Class C) with saturated hydraulic conductivity ranging from 0.4 to 0.61 cm/h [35], resulting in a potential infiltration volume of over 6 billion liters of stormwater per year. Sand and loamy sand site simulations also resulted in significant infiltration volumes of over 5 billion liters each. Note, approximately 18% of the developed land in Lucas County was positioned on soil characterized as undefined, typically urban fill, and was excluded from this study due to a lack of soil data (e.g., saturated hydraulic conductivity, porosity, effective suction at the wetting front) needed for the hydrologic simulations ( Table 2). The total volume that could be infiltrated per year at developed sites following implementation of green stormwater infrastructure to infiltrate parking lot flow was estimated at approximately 25 billion liters per year. Since there was less area defined as high intensity developed in the county, the total volume that could be infiltrated for those parcels (4,861 M liters per year) was significantly lower than for low or medium intensity developed sites (each over 10,000 M liters per year). This finding is specific to the developed land in Lucas County, OH. Sites classified as developed (low, medium, and high intensity) were primarily located on soils exhibiting good infiltration properties (>70%) as estimated in this study."}, {"section_title": "CONCLUSION", "text": "This manuscript outlines a novel approach to predicting the long-term (annual benefits of green stormwater infrastructure [GSI]) performance by utilizing continuous simulations. SWMM models were created from an existing commercial site and local weather data in combination with readily available GIS data from Lucas County, OH. The study findings indicate that sites with saturated hydraulic conductivity greater than or equal to 0.3 cm/h will result in an annual decrease of at least 50% of the stormwater runoff volume. The bioretention cell performance for Type C and D soils (<1.44 cm/h) were dependent on soil characteristics, particularly soil saturated hydraulic conductivity and effective suction at the wetting front. When these findings were specifically applied to GIS data from Lucas County, OH, it was estimated that over 60% of the developed land is suitable for installing efficient bioretention cells, which will significantly (>70%) reduce stormwater runoff from parking lots. In order to use this data to further prioritize sites for green stormwater infrastructure implementation, communities could identify neighborhoods or locations with localized flooding or documented water quality issues and then select developed sites positioned on soils (K sat > 0.3 cm/h) that will result in the desired performance."}, {"section_title": "LITERATURE CITED", "text": ""}]