[{"section_title": "Abstract", "text": "Diffusion tensor imaging (DTI) has become the predominant modality for studying white matter integrity in multiple sclerosis (MS) and other neurological disorders. Unfortunately, the use of DTI-based biomarkers in large multi-center studies is hindered by systematic biases that confound the study of disease-related changes. Furthermore, the site-to-site variability in multi-center studies is significantly higher for DTI than that for conventional MRI-based markers. In our study, we apply the Quantitative MR Estimation Employing Normalization (QuEEN) model to estimate the four DTI measures: MD, FA, RD, and AD. QuEEN uses a voxel-wise generalized additive regression model to relate the normalized intensities of one or more conventional MRI modalities to a quantitative modality, such as DTI. We assess the accuracy of the models by comparing the prediction error of estimated DTI images to the scan-rescan error in subjects with two sets of scans. Across the four DTI measures, the performance of the models is not consistent: Both MD and RD estimations appear to be quite accurate, while AD estimation is less accurate than MD and RD; the accuracy of FA estimation is poor. Thus, in some cases when assessing white matter integrity, it may be sufficient to acquire conventional MRI sequences alone."}, {"section_title": "Introduction", "text": "Diffusion tensor imaging (DTI) has become the predominant modality for studying white matter integrity in multiple sclerosis (MS) and other brain disorders, including Alzheimer's disease, traumatic brain injury, epilepsy, depression, and stroke. In MS, DTI is generally understood to provide information about diffuse changes in the microstructure and integrity in the white matter of patients. Numerous studies have shown that certain DTI measures differ between MS subjects and controls. In particular, researchers have found that patients with MS have increased mean diffusivity (MD) and decreased fractional anisotropy (FA) in normal appearing white matter (NAWM) compared to healthy controls (Vrenken et al., 2006; Ciccarelli et al., 2003; Senda et al., 2012; Werring et al., 1999) . As traditional MRI based measures of white matter changes in MS show only limited associations with disability, these DTI findings have been noted for their promise of clinical utility (Barkhof, 2002) ; (Zivadinov, 2016) . Moreover, many studies promote the use of DTI by suggesting that DTI can measure microstructural changes, whereas conventional magnetic resonance imaging (MRI) is only able to identify changes at the macrostructural level (Senda et al., 2012; Rocca et al., 2006; Wilson et al., 2003) .\nUnfortunately, the use of DTI-based biomarkers in large multi-center studies is hindered by systematic biases (Pfefferbaum et al., 2003; Vollmar et al., 2010) , which confound the study of disease-related changes. Furthermore, the site-to-site variability in multi-center studies is significantly higher for DTI (Zhu et al., 2011; Teipel et al., 2012) than that for conventional MRI-based markers (Teipel et al., 2010; Ewers et al., 2006) . These issues necessitate larger sample size in multi-center studies using DTI and highlight the potential for less generalizable findings from single-scanner studies. Additionally, DTI sequences require additional scanning time, which increases the cost of MRI in both clinical and research settings. In this paper, we investigate whether conventional MRI can be used to detect microstructural changes and estimate DTI measures.\nSynthesizing or estimating a specific imaging modality or sequence from other imaging sequences can be advantageous for several reasons. Doing so allows for larger multicenter imaging studies in which patients, or even entire centers, are missing particular types of images. It also allows researchers to capitalize on imaging datasets that have already been acquired. For example, the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (Mueller et al., 2005) contains thousands of conventional MRIs, and the Comprehensive Longitudinal Investigation of Multiple sclerosis at the Brigham and Women's Hospital (CLIMB) contains conventional MRI from thousands of MS patients (Gauthier et al., 2006) ; there are also numerous well controlled phase 3 studies that have acquired conventional MRI data. Using image estimation, these and other databases could be used to conduct largescale studies with quantitative imaging not acquired at every study site. Image synthesis also has significant applications in multi-modal image registration (Michel and Paragios, 2010; Jog et al., 2013a; Ye et al., 2013) and normalization (Jog et al., 2013a) . Thus, there has been a growing interest in this field in recent years. A recent study on image synthesis showed that it is possible to synthesize T 2 -weighted contrasts from T 1 -weighted images and to synthesize 3-tesla T 1 -weighted magnetization prepared rapid gradient echo (MPRAGE) images from 1.5-tesla MPRAGEs using an atlas image-based nonlinear regression (Jog et al., 2013b; Ye et al., 2013 ) uses a generalized patch-based label propagation method to synthesis arbitrary target image modalities. Specifically, they use T 1 -weighted MRI to synthesize T 2 MRI and, with much less accuracy, DTI-fractional anisotropy.\nIn our study, we adopt the methods introduced by Mejia et al. (2016) , in which quantitative T 1 maps (qT 1 ) are estimated from the conventional MRI sequences: T 1 -weighted (T 1 w), T 2 -weighted (T 2 w), proton density-weighted (PDw), and T 2 -weighted fluid attenuated inversion recovery (FLAIR) images. We apply their Quantitative MR Estimation Employing Normalization (QuEEN) model to estimate the four DTI measures: MD, FA, radial diffusivity (RD) and axial diffusivity (AD)."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study sample", "text": "The dataset we use in this study includes 73 subjects with clinically diagnosed MS and at least one set of MRI and DTI scans. After performing quality control to exclude images that exhibit subject movement, major segmentation errors, and registration problems, we have 50 subjects, including 14 with relapsing-remitting MS (RRMS), 12 with secondary-progressive MS (SPMS), and 24 with primary-progressive MS (PPMS). The resulting study sample is 64% female with a mean age of 53 (S.D. 11). Additionally, a second set of MRI and DTI scans was acquired for 19 subjects, which we use to evaluate the predictive accuracy of the model. The median time between scans is 181 days (range 147-301). Additional summary statistics are provided in Table 1 . The distributions of these summary statistics are similar in males and female, though the males have slightly higher EDSS scores (Appendix Tables A.1 and A.2)."}, {"section_title": "Imaging protocol", "text": "Each MRI study includes the following volumes, all collected on a Siemens Skyra 3 T scanner equipped with a 32-channel receive coil: T1-MPRAGE (Magnetization-Prepared RApid Gradient Echo) [TR = 3000 ms, TE = 3.03 ms, TI = 900 ms, FA = 9]; PDw and T2w images from a dual-echo turbo-spin-echo (TSE) sequence [TR = 3000 ms, TE = 11 ms/101 ms, FA = 150, ETL = 14]; and a 3D T2-weighted FLAIR image acquired using a T2-selective inversion pulse optimized for T2 of 120 ms [TR = 4800 ms, TE = 354 ms, TI = 1800 ms, variable FA]. All scans are acquired at 1.0 mm isotropic resolution except the PDw/T2w TSE sequence, which is acquired at 0.93 × 0.93 × 3.0 mm resolution.\nEach DTI study was obtained using a two-acquisition method with opposite phase encode directions to minimize influence of B 0 -related image distortions. Each acquisition acquired 1 reference image without diffusion weighting and 30 images with radially spaced diffusion directions and a diffusion weighting of b = 1000 s/mm 2 . Diffusion weighted images were acquired at 2 × 2 × 2 mm isotropic resolution."}, {"section_title": "Image processing", "text": "We perform image preprocessing as described in Mejia et al. (2016) . Briefly, we rigidly align all images to the MNI152 1.0 mm nonlinear template. To remove extracerebral voxels, we use the SPECTRE skull-stripping algorithm (Carass et al., 2011) . To segment tissue classes, we use Lesion Topology Preserving Anatomy Driven Segmentation (Lesion-TOADS) (Shiee et al., 2010) . We visually inspect the segmentations and exclude subjects with major errors, but we do not manually tune the segmentation method. We correct for ventricular segmentation errors using non-topologically constrained maximum membership classes. We generate brain masks by excluding cerebrospinal fluid (CSF), hypointense voxels in FLAIR, and any voxels outside the field of view on any image. To create conservative tissue class masks, we use a 3 × 3 × 3 diamond-shaped kernel for erosion of the Lesion-TOADS segmentation. We use the conservative masks for training and validation, but we use the full masks for whole-image predictions. Overall, the image processing takes approximately one to two hours per subject on a single computer core."}, {"section_title": "Image normalization", "text": "As conventional structural MRI is acquired in arbitrary units, intensity normalization is required to compare values across images acquired at different sites; using different hardware, software or protocols; or even on different dates using the same scanner and protocol. Historically, image normalization has been performed with respect to NAWM (Shinohara et al., 2014) or CSF Pujol et al., 1992; van Waesberghe et al., 1998; Bakshi et al., 2002; Tjoa et al., 2005; Brass et al., 2006 , Neema et al., 2009 ) as a reference region. However, both of these tissue classes are less than optimal for this study. CSF is highly variable in intensity, which can lead to inconsistent normalization. Changes in NAWM are of primary interest, and thus normalizing with respect to NAWM could obscure disease-related changes.\nInstead, we utilize the adaptation of the z-score normalization method (Shinohara et al., 2014; Shinohara et al., 2011) proposed by Mejia et al. (2016) . The z-score method subtracts a measure of location and divides by a measure of scale; we refer to these two steps as scaling and shifting, respectively. The adapted method proposed by Teipel et al. (2010) utilizes a combination of NAWM and cerebellar gray matter (CBGM). Although using NAWM alone as a reference can confound the normalization, the standard deviation of NAWM is well estimated and can be used for scaling. Abnormalities of CBGM in MS are poorly detected by conventional MRI methods, and thus CBGM signal intensity should be similar between subjects and disease groups. Thus, CBGM can be used for shifting. Previously, CBGM has been used for normalization in positron emission tomography (PET) in MS (Ratchford et al., 2012 ) and Alzheimer's disease (Kropholler et al., 2007) .\nThe normalized units are given by\ndenotes the intensity of voxel v for subject i in modality M ∈ {FLAIR, PDw, T 1 w, T 2 w}. For subject i in modality M, μ i;M ðCBGMÞ is the mean intensity in CBGM, and σ i;M ðNAWMÞ is the standard deviation of intensities within NAWM. "}, {"section_title": "Statistical prediction model", "text": "To model each DTI modality, we apply the QuEEN statistical model to generate \"statistical DTI\" measures of MD, FA, RD and AD. QuEEN uses a voxel-wise generalized additive regression model to relate the normalized intensities of one or more conventional MRI modalities to a quantitative modality, such as qT1 or DTI. We specify a set of models to use the standard MRI modalities, T 1 w, T 2 w, PDw, and FLAIR, to predict the DTI measures MD, FA, RD, and AD. As in the QuEEN T 1 model, we fit a separate model for each tissue class, c. Here we use the nine tissue classes identified as lesion, CBGM, GM, caudate, thalamus, putamen, brainstem, CBWM, and NAWM. Thus, for each DTI measure, we relate the value at each voxel v in class c of subject i to the corresponding predictor modalities by:\nwhere j = 1 , 2 , 3 , 4 indexes the four DTI measures we wish to predict. The smooth functions f jk c (·), k = 1 , 2 , 3 , 4, relate predictor modality k to DTI measure i within tissue class c. We implement the models in R using the gam function from the mgcv package (version 1.7-28, (Wood, 2006; Wood, 2011) as described in Mejia et al. (2016) . The gam function represents the smooth curves as penalized regression splines. The degree of smoothness is estimated using generalized cross-validation, and the smoothing parameter estimation criterion is optimized using the Newton method (Chong and Wahba, 1991) . The statistical DTI measures (stat-MD, stat-FA, stat-RD, and stat-AD) are estimated by applying the estimated regression curves to the respective predictor modalities."}, {"section_title": "Model validation", "text": "To evaluate each model, we assess the accuracy and utility of the statistical DTI measures. First, we assess the accuracy of the models by comparing the scan-rescan mean square error (MSE) to the statistical prediction MSE in subjects with two sets of scans. We define the scanrescan MSE as the voxel-wise squared difference in intensity between the original acquired images and the second set of images (the rescan images) averaged across voxels. In contrast, we define the statistical prediction MSE as the voxel-wise squared difference in intensity between the statistical DTI measure and the rescan image, averaged across voxels. We summarize both measures by tissue class. These two MSEs describe how accurately the statistical and acquired DTI measures predict a second acquired DTI measure obtained within one year. Assuming that the best available prediction of the acquired rescan DTI measure is the acquired DTI measure from the first visit, we use these MSEs as benchmarks for predictive performance.\nSecond, we assess the utility of the model. Liu et al. (2012) found evidence that RRMS patients had decreased FA and increased MD, RD, and AD in white matter regions compared to healthy controls, so we compare the mean DTI values in NAWM across MS subtypes for the statistical and acquired images. For each DTI measure, we conduct two-sided Wilcoxon rank sum tests between each subtype."}, {"section_title": "Associations with clinical measures", "text": "To investigate the use of these images as potential biomarkers we conduct a preliminary assessment of the association of the observed and predicted DTI measures and two commonly used scores for disability and cognition. First, we test the correlations between mean MD and mean RD in NAWM and the Expanded Disability Status Scale (EDSS) score (Kurtzke, 1983) , a common measure designed to assess neurological impairment in MS. We also test the correlation of mean MD and mean RD in NAWM with the Symbol Digit Modality Test (SDMT) (Smith, 1982) score, a tool for measuring cognitive function. We use the nonparametric Kendall's Tau coefficient for assessing correlations."}, {"section_title": "Results", "text": "The normalization method relies on the assumption that the distribution of intensities in CBGM is similar across the MS subtype groups. We check this assumption using Kruskal-Wallis tests of association between each acquired DTI measure and MS subtype. Indeed, there are no significant associations (Table 2 ). Fig. 1 shows the relationships between the normalized predictor images and each acquired DTI measure within NAWM. The relationships between the normalized predictor images and MD (top row) and RD (second row) appear to be similar across subjects, while the relationships between the normalized images and AD (third row) appear less similar. In FA (bottom row), there appears to be a large amount of heterogeneity across subjects in the relationships with the normalized predictor images.\nSample images from two randomly selected subjects are shown in Fig. 2 . The subject in Fig. 2a has PPMS and the subject in Fig. 2b has SPMS. The top rows in Fig. 2a/b show the acquired DTI images, the middle rows show the statistical DTI images estimated using the leave-onesubject-out cross-validation (LOOCV), and the bottom rows show the absolute value of the difference between the acquired and statistical DTI images. Both stat-MD and stat-RD appear to be quite accurate estimates of MD and RD, respectively, while stat-AD is less accurate than stat-MD and stat-RD, and the accuracy of stat-FA is poor (although stat-FA still captures the strong gray/white differentiation typical of FA maps).\nTo assess the accuracy of our statistical DTI models, we compare the prediction MSE of the statistical DTI images to the scan-rescan MSE of the acquired images. Fig. 3 shows boxplots of the scan-rescan log-MSE for the acquired DTI images (shown in green) and the prediction log-MSE for the statistical estimate of each DTI image (shown in orange) for three tissue classes of interest: NAWM, GM, and lesions. Each boxplot was constructed based on the MSE from 19 subjects with two sets of DTI scans. In MD and RD, the MSEs are comparable in NAWM and lesions. In MD, the prediction log-MSE in the statistical images and the scan-rescan log-MSE in the acquired images have means in NAWM of − 7.4 mm 2 s −1 (25th percentile = − 7.5, 75th percentile = − 7.3) and − 7.4 mm 2 s − 1 (− 7.5, − 7.3), respectively, and means in lesions of −7.4 mm 2 s −1 (−7.5, −7.1) and − 7.5 mm 2 s −1 (− 7.6, − 7.3), respectively. In RD, the prediction log-MSE and the scan-rescan log-MSE have means in NAWM of − 7.3 mm 2 s −1 (−7.5, −7.3) and −7.3 mm 2 s −1 (−7.5, −7.2), respectively, and means in lesions of −7.2 mm 2 s −1 (−7.3, −7.1) and −7.4 mm 2 s −1 (−7.6, −7.1),\nrespectively. Across all four DTI measures, the statistical prediction log-MSE of the estimated images is smaller in GM compared to the scanrescan log-MSE of the acquired images, indicating that our models can accurately estimate GM. However, in FA and AD, the prediction log-MSE is much larger in NAWM and lesions compared to the scan-rescan log-MSE of the acquired images, suggesting that the FA and AD models may be incorrect.\nFigs. 4 and 5 show the MS subtype group differences for mean MD and mean RD, respectively, in NAWM. In all comparisons, the differences between subgroups were not significant. However, the spread of the data is tighter in the statistical images compared to the acquired images. As shown in Fig. 5 , the level of significance between groups was similar for the statistical and acquired RD images. Fig. 4 shows more pronounced differences in statistical MD between PPMS and each of the other subtypes compared to the acquired images as well as a smaller spread. Table 3a provides the results of the exploratory analyses of the correlations between mean MD in NAWM and EDSS and SDMT scores, respectively. Table 3b provides the correlations between mean RD in NAWM and the EDSS and SDMT scores. None of the results withstand the multiple comparisons correction, however these results suggest that higher RD values may be associated with lower SDMT scores, and this association is stronger using the statistical RD measure."}, {"section_title": "Discussion", "text": "Here, we have used conventional MRI to estimate several common DTI measures, namely MD, RD, AD, and FA. Across the four DTI measures, the performance of the models is not consistent: while MD and RD are accurately estimated within NAWM using statistical methods, AD and FA are less so. It is currently unclear whether the inaccuracies in the AD and FA predictions are due to failures of the model or due to The relationships between MD and RD and the normalized predic-tor images appear much more similar across subjects, whereas the relationships between AD and FA and the normalized predictor images varies greatly across subjects. a b Fig. 2 . a DTI images from a PPMS subject. The four DTI measures are shown for a PPMS subject. The top row shows the acquired DTI, the middle row shows the statistical DTI, and the bottom row shows the abso-lute value of the difference between the acquired and statistical DTI. The models for MD and RD perform relatively well, while the models for AD and FA appear to fail. 2b DTI images from a SPMS subject. The four DTI measures are shown for a SPMS subject. The top row shows the acquired DTI, the middle row shows the statistical DTI, and the bottom row shows the absolute value of the difference between the acquired and statistical DTI. The models for MD and RD perform relatively well, while the models for AD and FA appear to fail. missing information. It may be that the differences in the performance of the models are explained by what each DTI measure describes. MD is a global measure sensitive to tissue microstructure, and in practice it is highly correlated to RD, which, in NAWM, represents diffusivity perpendicular to white matter bundles. On the other hand, AD quantifies diffusivity along the major orientation of the axon bundles and is substantially less sensitive to pathology, such as diffuse inflammation, demyelination, and edema -all of which are detectable by the conventional MRI approaches. Finally, FA represents tissue anisotropy as a measure of contrast between AD and RD; thus, any prediction errors for either AD or RD are likely to be magnified in the FA prediction (Song et al., 2002; Alexander et al., 2007) . Furthermore, the four MRI contrasts that we use in the estimation are not sensitive to fiber orientation, but another contrast, T2*, can be quite sensitive to fiber orientation. Thus, if the failure of the model to predict AD and FA is due to inadequacies of the standard MRI modalities, then including T2* in our statistical model may improve the accuracy of our AD and FA estimations. As described above, we fit a separate model within each tissue class for each DTI prediction model. Model performance differs by tissue class both within and across DTI measures, as seen by the prediction MSE plots. Across all DTI measures, we predict GM well with respect to the acquired DTI scans. This is likely due to the lack of variation in structured diffusion across the brain in GM. In NAWM, we can accurately predict MD and RD but not AD and FA, again indicating that the model is insufficient for the latter DTI measures or that additional information exists in the AD and FA maps. In lesions, the statistical DTI predictions are generally worse than the acquired DTI predictions for each measure, which may be due to the greater amount of variability in DTI measures within lesions.\nIn addition, although none of the MS subtype group differences in NAWM are significant, we show that there are more pronounced differences in the statistical MD images than in the acquired MD images. This finding needs further examination in a larger sample which would provide more power to detect true group differences in MD, which has been shown to be sensitive to diffuse and focal white matter pathology as well as changes in the gray matter in MS (Senda et al., 2012; Ontaneda et al., 2014; Harrison et al., 2013) .\nImplementation of these models as a tool for studying and monitoring MS requires that the images produced are accurate and reproducible. We have shown that the proposed models perform well for the specific imaging protocols used in this study. The f j (v) elements of the model are functions estimated from a large number of voxels whose intensities are known to be highly reproducible (Teipel et al., 2010; Ewers et al., 2006) . However, it remains to be shown how the models perform across different DTI protocols and platforms. Such validation studies will be crucial before this methodology can be adopted in the clinic."}, {"section_title": "Conclusions", "text": "We have discussed the differences in the performance of our statistical estimation across the four DTI measures and various tissue classes. Although we do not present accurate estimation models for AD or FA maps, we can accurately estimate MD and RD. Thus, we have shown that the information in the latter image types is not unique, and that the information may be captured using statistical methods on conventional imaging. Therefore, in studies that are not interested in anisotropy, or only interested in MD, it may be sufficient to acquire only conventional MRI sequences."}, {"section_title": "Acknowledgments", "text": "We thank Dr. Govind Nair for his insightful comments and discussions about this work. We acknowledge the contribution of the NINDS Neuroimmunology Clinic, which recruited the patients and performed Fig. 5 . Distribution of RD in NAWM between MS subtypes. Differences in RD in NAWM between MS subtypes were tested using (a) the acquired DTI images and (b) the statistical RD images. The plots show the mean RD in NAWM for each subject (gray) and the Wilcoxon 95% confidence intervals for each subtype. The p-values are reported for the two-sided Wilcoxon tests. There are no significant differences between the subgroups in either DTI RD or statistical RD. "}]