[{"section_title": "Abstract", "text": "Background: Preschool involves an array of new social experiences that may impact the development of early externalizing behavior problems over the transition to grade school. Methods: Using longitudinal data from a nationally representative sample of over 600 pairs of US twins, we tested whether the genetic and environmental influences on externalizing problems differed between children who did versus did not attend preschool. Results: At age 4, the genetic and environmental etiology of externalizing did not differ by preschool attendance. In contrast, by age 5 years (kindergarten age), the genetic and environmental etiology of externalizing significantly differed by preschool attendance. Among children who did not attend preschool, externalizing at age 5 was predominantly due to environmental influences (52% shared environment, 34% non-shared environment) rather than genetic differences (13%), whereas among children who had attended preschool, externalizing at age 5 was primarily due to genes (67%), and shared environmental influences were negligible (0%). These interactions represented the differential longitudinal persistence of genes and environments that contributed to externalizing at age 4. Sensitivity analyses ruled out confounding due to early mental ability, socioeconomic status, minority status, child age, and prior history of childcare. Conclusions: These results indicate that preschool enrollment is associated with increased genetic and decreased shared environmental influences on the development of early externalizing behavior problems."}, {"section_title": "Introduction", "text": "Aggression and other externalizing behaviors typically decline from toddlerhood through early childhood; however, some children persist -or even escalate -in behavior problems across the schoolentry transition (Hill, Degnan, Calkins, & Keane, 2006; NICHD Early Child Care Research Network, 2004; Tremblay, 2000) . Externalizing behavior problems, which are marked by children's failure to regulate their behavior to meet the expectations of the 'external' world (e.g. parents, teachers, and social norms), include defiance, aggression, and antisociality. Externalizing disorders 'dominate both therapy research and clinical practice,' (Kazdin, 2003, p. 254) , accounting for 50% of treatment referrals in children. In particular, early-onset externalizing behaviors are associated with academic underachievement and heightened risk for school drop-out (Alexander, Entwisle, & Horsey, 1997; Hinshaw, 1992) , and children who persist in externalizing behaviors are more likely to show, in adulthood, a pattern of serious violence, multiple mental and physical health problems, and economic difficulties (Odgers et al., 2008; Tremblay, 2000) . Thus, understanding the intrapersonal and interpersonal processes that contribute to longitudinal stability versus change in externalizing problems during early childhood remains a topic of considerable practical and theoretical importance. Preschool (i.e. formal, center-based day-care programs that include didactic learning objectives and are intended for children under the age of 5 years) involves a set of interpersonal experiences that may provoke differentiation in children's externalizing behavior problems as they transition to kindergarten. A longstanding nexus of research and controversy regarding preschool and other forms of non-parental care is its potential negative impact on children's aggressive behavior (Belsky, 2001) . Despite intensive research efforts, there remains no clear consensus regarding the effects of preschool on early externalizing. Some studies have found that preschool attendees have persistently higher rates of externalizing even into middle school (Belsky et al., 2007) . Other researchers, however, have argued that center-based care may actually have salutary effects on children's externalizing, after appropriately correcting for children's background risks (Borge, Rutter, Côté, & Tremblay, 2004) . Still other researchers, including the NICHD Early Child Care Network, have found null effects for early childcare on child aggression (NICHD Early Child Care Research Network, 2004) . berg et al., 2001; Vandell, 2004; Votruba-Drzal, Coley, & Chase-Lansdale, 2004) . However, the effects of childcare may depend not only on the characteristics of the childcare program, but also on the characteristics of the children themselves. In particular, children's genetic predispositions may govern their differential vulnerability to the effects of preschool on externalizing behavior -a gene · environment interaction (G · E). Although not directly testing G · E, evidence suggestive of G · E comes from research by Gunnar and colleagues on individual differences in children's cortisol responses to preschool. (Cortisol is a validated biomarker of stress response.) Specifically, on days when children stay home from preschool, cortisol decreases from morning to evening, whereas cortisol increases from morning to evening on days when the same children attend preschool. However, this stress response to preschool is only evident for children rated as more socially anxious and those who have difficulty with emotion regulation (Dettling, Gunnar, & Donzella, 1999; Watamura, Donzella, Alwin, & Gunnar, 2003) -temperamental characteristics that have been found to have a genetic basis in early childhood (Saudino, 2005) . Given this association between temperamental characteristics and childcare associated stress-responses, it is possible that the effects of preschool on child behavior may vary according to initial genetic predispositions. In other words, the social experiences of preschool may serve to activate genetic differences between individuals.\nThe hypothesis that preschool activates children's genetic predispositions for externalizing problems is also consistent with a large body of previous behavioral genetic research demonstrating that genetic influences on aggression and externalizing increase with age, whereas as family-level environmental influences decrease with age (Bergen, 2007) . Agerelated increases in heritability pose something of a paradox: How do genetic influences increase, if individuals are accruing more environmental experiences over the course of development? One resolution for this paradox is an appreciation for the role of gene-environment correlation (Scarr & McCartney, 1983) . As children have more latitude to select (and be selected into) environmental niches, these niches become increasingly reflective of their own genetically-influenced characteristics. These environmental inputs, in turn, serve to reinforce initial differences in genetically-influenced traits, leading to an amplification of genetic variance in a given phenotype. If the age-related increase in the heritability of externalizing is, in fact, due to children's increasing ability to select (and selectively attend to) environmental experiences, then one would expect that the transition to school settings -with its array of new teachers, peers, and learning experienceswould lead to increases in the importance of genetic influences.\nAt the same time, children who are not exposed to the extra-familial social experiences of preschool may be more vulnerable to family environments that confer risk for externalizing. Consistent with this hypothesis, Borge et al. (2004) found that, among high-risk families -characterized by low occupational level, low maternal education, large sibships, and low family functioning -children who were taken care of by their own parents demonstrated higher levels of aggression than children enrolled in day-care, but no such effect of parental-care was evident among low-risk families."}, {"section_title": "Goals of the current study", "text": "The aim of the current study was to test the hypothesis of a gene · environment interaction on the development of externalizing behavior problems between ages 4-and 5-years. This period of time, which marks the typical transition point from either preschool or home-based care to kindergarten, has been identified by numerous researchers as a developmentally significant period that may be particularly challenging for children (Bohan-Baker & Little, 2004; Rimm-Kauffman & Pianta, 2000) . We hypothesized that preschool attendance would interact with genetic and environmental influences on the development of externalizing over this transition, such that among children who attended preschool, development of externalizing would be primarily driven by genetic factors, whereas, for children who remained at home, development of externalizing would be governed by family-level environmental influences. These hypotheses were tested using a large, nationally representative sample of twins."}, {"section_title": "Method", "text": ""}, {"section_title": "Participants", "text": "Participants were drawn from the twin sample of the Early Childhood Longitudinal Study -Birth Cohort (ECLS-B), a nationally representative longitudinal study of children born in the United States in the year 2001. Informed parental consent was obtained by ECLS-B staff for all study participants. Data on twin zygosity and preschool enrollment were available for over 1200 twins from over 600 families.\n1 Of these twins, 61% were White, 16% were African-American, 16% were Hispanic, 3% were Asian, 4% were multiracial, and 50% were female. Twenty-five percent of families lived below the poverty line at study entry. The distribution of parental educational attainment was as follows: Less than high school for 8.0% of families; high school diploma or equivalent for 16.5%; vocational-technical program for 6.0%; some college for 25.7%; bachelor's degree for 21.2%; graduate school with no degree for 1 Sample sizes are rounded to the nearest 50 in accordance with ECLS-B data security regulations.\n3.9%, masters degree for 10.8%; and doctoral or professional degree for 7.3%. Externalizing symptom ratings were available for 100% of the twins at age 4, and 84% of the twins at age 5. Missing data was handled via full information maximum likelihood estimation."}, {"section_title": "Measures", "text": "Zygosity. At age 2-years, trained investigators rated the similarity of same-sex twins on six aspects of physical appearance (e.g. hair texture, complexion, facial appearance, and earlobe shape). Using the method described in Tucker-Drob, Rhemtulla, Harden, Turkheimer, and Fask (2011), these ratings were used to diagnose twins as monozygotic (MZ) or dizygotic (DZ). Zygosity determinations from such physical similarity ratings have been found to be over 90% accurate when cross-validated using twins of known zygosity (ForgetDubois et al., 2003) Same sex pairs who would have received a DZ diagnosis were excluded from analyses if their parents indicated that there was a medical reason for their dissimilarity.\nPreschool enrollment ()0.5 = did not attend preschool, 0.5 = attended preschool). At age 4-years, parents indicated whether the children were currently enrolled in Head Start, a day care center, nursery school, preschool, or prekindergarten program on a regular basis. Fifteen percent of twins were enrolled in Head Start, 61% were enrolled in other forms of centerbased care, and 26% were not enrolled in any form of center-based care. A twin was considered enrolled in preschool if he or she was enrolled in any form of center-based care, including Head Start. Only six pairs were discordant for preschool enrollment and were excluded from analyses.\nEarly history of center-based care. At age 2-years, parents reported on whether the twins were enrolled in center-based care (15% = yes). At the 4-year wave, parents retrospectively reported how old (in months) each child was when he or she was first enrolled in center-based care. First enrollment occurred prior to 40 months for 55% and occurred prior to 4-years for 72% of children who had received center-based care by the 4-year wave.\nExternalizing behavior problems. At age 4-years (preschool age), and again at age 5-years (kindergarten age), parents rated each twin separately on each of the following symptoms using a 5-point scale (never, rarely, sometimes, often, very often): has temper outburst or tantrums, bothers and annoys other children, destroys things that belong to others, is physically aggressive (e.g. hits, kicks, or pushes), gets angry. Items were drawn from two previously validated clinical instruments (Canivez & Rains, 2002; Fantuzzo, Manz, & McDermott, 1998) : the Preschool and Kindergarten Behavior Scales-Second Edition (PKBS-2) and the Social Skills Rating System (SSRS). Sum scores were created from these ratings for each individual twin at each occasion. The coefficient alpha reliability for these sum scores was .74 at 4-years and .82 at 5-years. The sum scores were right skewed. Log transforming these scores resulted in an approximately normal distribution. All analyses were based on z-scored (relative to M and SD at 4-year wave) versions of these log-transformed scores. Histograms of the untransformed and transformed scores are supplied in the Online Supplement ( Figure S1 ).\nPossible confounds. Based on the previous research reporting their associations with both preschool enrollment and externalizing behaviors, we identified four variables that might potentially account for any observed moderating effects of preschool: Children's early mental ability (standardized to M = 0, SD = 1), socioeconomic status (SES; M = .13, SD = .85), minority status (0 = non-White, 1 = White) based on parentreported race, and age in months (standardized to M = 0, SD = 1) at the 4-years assessment. Early mental ability was measured by trained investigators at the 2-year wave using the Bayley Short Form test of mental ability (Andreassen & Fletcher, 2007 ; reliability estimate = .88), which is an abbreviated version of the wellvalidated Bayley Scales of Infant Development, Second Edition (Bayley, 1993) . SES was a composite index of parent-reported paternal and maternal educational attainment, prestige of parent-reported occupations, and parent-reported family income, collected during the 4-year wave. Extensive treatments of how SES, minority status, and early mental ability relate to one another in these data can be found in Tucker-Drob et al. (2011) and Tucker-Drob (2012) ."}, {"section_title": "Results", "text": "Does preschool enrollment interact with genetic and environmental influences on the development of early externalizing?\nBiometric structural equation models were fit using maximum likelihood estimation in Mplus software (Muthén & Muthén, 2010) . These models decompose variation in each given phenotype into variation attributable to additive genetic factors (A), shared environmental factors (C) that serve to make twins from the same family more similar to one another, and nonshared environmental factors (E) that serve to differentiate twins from the same family. A factors are assumed to correlate at 1.0 between MZ twins and at .50 between DZ twins; C factors are correlated at 1.0 between both MZ and DZ twins, and E factors are uncorrelated between both MZ and DZ twins (Neale & Cardon, 1992) . The longitudinal nature of the ECLS-B data allowed us to implement a Cholesky approach, depicted in Figure 1 . This approach decomposes variation in externalizing at age 5 into genetic and environmental factors that are shared with externalizing at age 4 (A, C, and E factors with the subscript 4), and genetic and environmental factors that are unique of externalizing at age 4 (A, C, and E factors with the subscript 5). In this diagram, the lowercase terms, a, c, and e, are regression coefficients of externalizing on the A, C, and E factors.\nRather than estimating a single set of a, c, and e coefficients for all twins in the sample, we estimated models that allowed each coefficient to differ according to preschool status. This was achieved by controlling for the main effect of preschool, and including an interaction term in addition to a main effect for each of the nine a, c, and e parameters depicted in Figure 1. [The algebraic equations for this model can be found in the Online Supplement (Data S1)] If a given interaction term was significantly different from 0, this indicated that the corresponding parameter differed across preschool and no-preschool groups. Table 1 presents parameter estimates from the full model, with all interactions estimated, and a reduced form of the model, in which interactions that were not significant in the full model have been dropped. The reduced model fit no worse than the full model (v 2 [7] = 8.104, p = .32), and because the reduced model is more parsimonious than the full model, we accept it as the best representation of the data."}, {"section_title": "2", "text": "Preschool did not interact with A, C, or E in predicting externalizing symptoms at age 4, indicating that the genetic and environmental influences on externalizing at age 4 did not differ by preschool attendance. For both groups, at age 4, externalizing symptoms were approximately equally influenced by A, C, and E (h 2 = 39%, c 2 = 23%, e 2 = 38%). In contrast, preschool significantly interacted with the genetic and shared environmental components of the cross-time relation between externalizing symptoms at ages 4 and 5 (the paths labeled a b and c b ), indicating that genetic and environmental influences on externalizing at 4 years differentially carried over to predict externalizing at 5 years depending on preschool attendance.\nThese interactions are shown in Figure 2 , which presents Cholesky parameter estimates separately by preschool status (parameter estimates from reduced model). For children who did not attend preschool, the across-time relation between externalizing at ages 4 and 5 was mediated by the shared environment (c b = .754) and the nonshared environment (e b = .235), but not by genes. In contrast, for children who did attend preschool, the cross-time relation between externalizing at ages 4 and 5 was mediated by genes (a b = .796) and the nonshared environment (e b = .235), but not by the shared environment. Further illustrating these results, Figure 3 plots the total amount of variance in externalizing symptoms at 4 and 5 years attributable to A, C, and E, for each group separately. It can be seen that for children who did not attend preschool, genetic variance diminishes (from 39% at 4 years to 13% at 5 years), and shared environmental variance increases (from 23% at 4 years to 52% at 5 years), whereas for children who did attend preschool, genetic variance increases (from 39% at 4 years to 67% at 5 years) and shared environmental variance diminishes (from 23% to 0%). Preschool is an effects-coded variable representing whether or not the child attended preschool at age 4 ()0.5 = did not attend preschool, 0.5 = attended preschool).\n2 We also fit Cholesky models individually to the preschool group and non-preschool group. For the preschool group, v 2 (17) = 14.894, p = .603, RMSEA = .000, CFI = 1.000, TLI = 1.003. For the non-preschool group v 2 (17) = 11.530, p = .8277, RMSEA = .000, CFI = 1.000, TLI = 1.021. The parameter estimates from the separate models were equal to those implied by the parameters produced in the full interaction model."}, {"section_title": "Do the interactions apply to children with and without histories of very early center-based care?", "text": "To examine whether these results were specific to enrollment in preschool in the 1-2 years directly preceding the kindergarten year, rather than to a longer history of early center-based care, we refit the full model excluding children who had been enrolled in center-based care at age 2-years. The pattern was unchanged (a b interaction = 1.029, c b interaction = ).745, both ps < .01). The pattern was also unchanged when the model was run excluding children whose parents retrospectively reported initiation of center-based care prior to 40 months (a b interaction = .946, p < .01; c b interaction = ).716, p < .05), and prior to 4-years (a b interaction = .939, p < .01; c b interaction = ).541, p < .05). Finally, when excluding children who attended preschool at 4-years but had no history of center-based care prior to 4-years, the same interactions on the cross-time relations remained significant (a b interaction = 1.056, c b interaction = ).898, both ps < .01), and there continued to be no significant interactions on the etiology of age-4 externalizing (a 4 = .059, p = .73; c 4 interaction = ).263, p = .09). This suggests that the preschool interactions are developmentally specific to the kindergarten transition (age-4 to -5), regardless of when a child first began center-based care. Are the interactions robust to controls for possible confounds?\nBecause preschool was not randomly assigned, we identified four possible variables from past literature that have been linked with both preschool enrollment (e.g. Magnuson, Meyers, Ruhm, & Waldfogel, 2004; Tucker-Drob, 2012 ) and the development of externalizing behaviors (e.g. Moffitt, 1993 ): children's early mental ability, SES, age, and minority status. We estimated a multiple logistic regression that predicted the log-odds of preschool attendance from the four variables, using only one twin per pair to avoid distorted standard errors. Both SES and age were uniquely predictive of preschool attendance (logodds = .253 and .555, respectively, both ps < .01), whereas early mental ability and minority status were not (log-odds = ).017 and .008, respectively, both ps > .40). It is therefore possible that SES and age, but not early mental ability or minority status, confounded the results reported in Table 1 . To address this possibility, we ran a multivariate version of the structural equation model described earlier that controlled for both the main effects of SES and age, and the interactions of the A, C, and E factors with SES, and age. The pattern of results remained unchanged (a b interaction = .657, p < .01; c b interaction = ).778, p < .01), indicating that the preschool interactions reported earlier were not spurious results of the non-random selection of children into preschool on the basis of SES or child age."}, {"section_title": "Discussion", "text": "The question of how early non-maternal care experiences affect child development has been described as 'a core developmental question of the modern age' (Belsky, 2011, p. 1) . We investigated this question, specifically as it pertained to the development of externalizing behaviors over the transition from the preschool year (age 4) to the kindergarten year (age 5), a period that is routinely characterized as encompassing a developmentally significant transition (Rimm-Kauffman & Pianta, 2000) . Our results indicate that rather than having uniform effects on all children, the experience of attending preschool can serve to differentiate children's externalizing behaviors on the basis of their genetic propensities, leading to increased heritability of externalizing symptoms for preschool attendees compared to nonattendees. We found that for children who did not attend preschool, genes for externalizing symptoms at age 4 did not confer any risk for externalizing symptoms at age 5, but for children who did attend preschool, genetic influences on externalizing symptoms at age 4 were highly predictive of externalizing symptoms at age 5. At age 4, genes accounted for 39% of the variation in externalizing symptoms, regardless of preschool status. By age 5, genes accounted for only 13% of the variation in externalizing symptoms among children who had not attended preschool, but accounted for 67% (a fivefold difference) among children who had attended preschool. Results applied to children with and without histories of center-based care during infancy and very early childhood, and when early mental ability, SES, minority status, and age were considered as possible confounds. While we found evidence for a significant interaction effect between genes and preschool attendance, the main effect of preschool on externalizing was not significantly different than zero, despite substantial reordering of individual levels of externalizing. Taken together, these results indicate that preschool does not simply exacerbate genetic risk for child externalizing. (If this were true, then one would anticipate both a significant G·E effect and a main effect of preschool). Rather, these results are consistent with the hypothesis that preschool has differential effects -a socializing influence resulting in reduced levels of externalizing for children at low genetic risk but an adverse influence for children at high genetic risk. These differential effects may help to explain the contradictory results of previous literature: Depending on the proportion of children with genetic vulnerabilities towards externalizing in a given sample, estimates of the net effect of preschool may be positive, negative, or null.\nHeterogeneity in preschool effects are likely further compounded by differences in preschool quality. This study focused on variation in children and families that led to differential effects of preschool attendance, but did not examine characteristics of preschools themselves that were associated with differential outcomes. Notably, a number of previous studies have identified characteristics of preschools that are associated with differences in children's later behavioral outcomes Peisner-Feinberg et al., 2001; Vandell, 2004) . Previous studies (e.g. LoCasale-Crouch, have also identified specific 'transition practices' that can assuage the psychosocial challenges associated with transitioning from preschool to kindergarten. However, we are aware of no studies that have examined whether these characteristics or transition practices modify the genetic and environmental influences on behavioral development. This is a promising avenue for future research.\nAs Belsky (2011) has recently commented, genetic thinking has typically been offered as a challenge to the hypothesis that childcare can affect child development: 'One view is that because development is largely shaped by genes rather than by experience, the effects of non-maternal childcare, like the effects of care provided by mothers, will be rather minimal.' However, our findings indicate that, rather than rendering behavioral outcomes resistant to experiential influences, genetic influences are, in fact, most strongly evident among the children who have had the additional experiential 'input' of preschool. As is also suggested by research showing age-related increases in heritability of externalizing (Bergen, 2007) , high estimates of genetic variance may be an outcome of accumulating social-environmental experiences.\nOf further significance is our finding regarding the shared environment. At age 4, the shared environment accounted for 23% of the variation in externalizing symptoms regardless of preschool status. However, at age 5, this proportion rose to 52% for children who had not attended preschool, and declined to 0% among children who had attended preschool. Thus, not attending preschool served to enhance shared environmental influences on externalizing symptoms."}, {"section_title": "Limitations", "text": "The strengths of this study included the use of a diverse and nationally representative sample of twins born in the United States, the availability of longitudinal data on externalizing symptoms across the transition to kindergarten, and the estimation of biometric models with terms for gene · environment interaction. Nevertheless, in addition to the need for future research to incorporate measures of preschool quality, there are three other limitations to be taken into consideration.\nFirst, while the twin design implemented here is quite powerful for estimating the effects of children's genes on their behavior, it is incapable of determining the extent to which family-level influences on children's behavior, including the decision to enroll one's children in preschool, are themselves influenced by parents' genes. More extensive familybased designs, such as extended twin-family or children-of-twin designs, are necessary to resolve the role of parental genotype.\nSecond, while the longitudinal nature of our data allowed us to uncover a prospective relation between preschool attendance and the magnitude of genetic and environmental influences on subsequent externalizing development that was robust to statistical controls, the observational nature of our data limits our ability to draw strong causal inferences. An even more rigorous test of individual heterogeneity in the effects of preschool attendance would be a randomized experiment (Tucker-Drob, 2011) .\nThird, externalizing behaviors were measured only through parental report. While parent reports of children's emotional problems are often only modestly correlated with teacher reports or child selfreports (Achenbach, McConaughy, & Howell, 1987) , it is important to note that informant discrepancies are generally lower for the outcome assessed hereobservable externalizing behaviors in young children (Achenbach et al., 1987; Duhig, Renk, Epstein, & Phares, 2000; reviewed in De Los Reyes & Kazdin, 2005) . Moreover, previous behavioral genetic analyses of aggressive behavior in young children have found that heritability estimates at age 3 and 7 were highly consistent across mother, father, and teacher reports, although estimates of the shared environmental contribution were markedly lower for teacher reports than for parent reports (Hudziak et al., 2003) . Future research on gene-by-preschool interactions on child behavior problems should examine the robustness of these interactions across ratings by different informants (e.g. parent vs. teacher)."}, {"section_title": "Conclusions", "text": "In summary, this study presents initial evidence that enrollment in preschool may serve to differentiate children's genetic propensities towards externalizing over the transition to kindergarten. Although the associations derive from observation data, they were found to be robust to a number of plausible confounds. Future research will be necessary to investigate specific aspects of the preschool experiences that are responsible for these effects, and whether effects vary as functions of specific center characteristics."}, {"section_title": "Supporting information", "text": "Additional Supporting Information may be found in the online version of this article: Figure S1 Distributions of externalizing scores. Data S1 Algebraic equations for gene-by-preschool interaction model.\nPlease note: Wiley-Blackwell are not responsible for the content or functionality of any supporting materials supplied by the authors. Any queries (other than missing material) should be directed to the corresponding author for the article. the U.S. Department of Education National Center for Education Statistics. John Loehlin and Greg Duncan provided valuable feedback on previous versions of this article. "}, {"section_title": "Correspondence to", "text": ""}, {"section_title": "Key points", "text": "• Rather than having uniform effects on all children, the experience of attending preschool may serve to differentiate children's externalizing behaviors on the basis of their genetic propensities.\n• Longitudinal ratings of externalizing were obtained from a nationally representative sample of US twins.\n• Among children who did not attend preschool at age 4, externalizing at age 5 was predominantly due to environmental influences (52% shared environment, 34% non-shared environment, 13% genes).\n• Among children who attended preschool at age 4, externalizing at age 5 was primarily due to genes (0% shared environment, 23% nonshared environment, 67% genes) • Results were robust to controls for mental ability, socioeconomic status, minority status, age, and prior history of childcare."}]