[{"section_title": "", "text": "now have comparable if not higher graduation rates. Our estimates suggest that these changes will have striking consequences for the distribution of skill across countries in the years to come."}, {"section_title": "Comparing Academic Performance across Countries", "text": "Press coverage of differences in academic performance across countries is typically based on two surveys: the Trends in International Mathematics and Science Study (TIMSS, sponsored by the International Association for the Evaluation of Educational Achievement) and the OECD Programme for International Student Assessment (PISA). Both of these surveys focus on students who are teenagers or younger. The TIMSS tested students in fourth and eighth grades in 1995, 1999, 2003, and 2007 (2007 data are not yet available) in mathematics and science. It includes about 50 countries and is planned to continue on a four-year testing cycle. The PISA tested 15 year-olds in reading, math, and science in 2000, 2003, and 2006 , and is planned to continue on a three-year cycle.\n1 In addition to individual student performance on the relevant assessments, these surveys also collect data on student demographics and school characteristics.\nOur focus here is on changes in skill between the teenage years and adulthood. Two large-scale assessments have been conducted to permit an analysis along these lines, measuring the informationprocessing skills of populations aged 16-65 in different countries. The International Adult Literacy Survey (IALS) was organized by Statistics Canada and the Educational Testing Service and administered in conjunction with national household surveys in 1994, 1996, and 1998 . The Adult Literacy and Life Skills Survey (ALL) included different countries in different years, with testing taking place in 2003 and 2005 (OECD, 2005 . In both surveys, respondents were administered the same test, regardless of age. We can thus compare how skill changes from age 16-where the TIMSS and the PISA leave off-into adulthood.\nBecause the IALS covered 17 OECD countries and the ALL covered only five (plus one Mexican state),\nwe use the IALS for the analysis here.\nThe design of international assessments for the school-aged population is controversial; designing an international assessment for adults is even more fraught. What curricular content would be covered?\nWould adults be expected to remember high school mainstays like trigonometry? (Would researchers and policymakers care if they did?) The approach taken in the IALS is to measure practical skills in three domains-quantitative literacy, prose literacy, and document literacy-rather than academic mastery of high school content. Quantitative literacy is defined as the application of \"arithmetic operations, either alone or sequentially, to numbers embedded in printed materials.\" Prose literacy is defined as the understanding and ability to use \"information from texts.\" Document literacy is defined as the ability to \"locate and use information in various formats\" (OECD and Statistics Canada, 1995) . In each domain, proficiency is categorized from level one (the ability to locate information in text) to level five (the ability to locate information in dense text with multiple distractors and to make high-level inferences). The median performer in each country scores at either level two or level three.\nTo measure their proficiency, IALS respondents were given several passages of text and, following each passage, were asked a series of questions, with the proficiency level of each question based on the proportion of respondents that answered it correctly (OECD and Statistics Canada, 1995) . A respondent's overall proficiency level in a particular domain was then calculated based on the number of questions at each level that she answered correctly in that domain; Brown and Micklewright (2004) provide an excellent discussion of this procedure . For our purposes, it is important to note that the hardest questions were sufficiently difficult that higher education could affect performance. For example, one level-four quantitative item gave respondents a table describing compound interest on a given amount of principal over various time horizons (rows) and for various annual interest rates (columns) and asked for the minimum annual interest rate required to double the principal within a five-year horizon.\nInternational data sets like these can be extremely useful in learning about education production functions at all ages. When studying primary or secondary education within a country, variation in measured educational inputs typically is related to unmeasured parental resources and decisions; for example, smaller class sizes may be more common in communities where parents also emphasize education in many other ways. As a result, it is difficult to estimate the true effect of smaller classes on student achievement. Correlations between inputs and achievement across countries may suffer less from such biases, because otherwise similar children in different countries may attend very different schools.\nResearchers have investigated the effect of elementary and secondary educational spending and organizational structures on test scores using data from the TIMSS or the PISA and this empirical approach (for example, Woessmann, 2003; Fuchs and Woessmann, 2007; Hanushek and Woessmann, 2006) . In a similar spirit, we use the IALS to investigate how the organization and funding of secondary and higher education influence university graduation and-through university graduation-the skills of adults."}, {"section_title": "How Do Countries Differ in the Age Profile of Literacy?", "text": "We begin by using the International Adult Literacy Survey to compare the literacy of two age groups-16-17 year-olds and 26-30 year-olds-across countries. The younger group includes those close to or at the end of compulsory schooling, which in the countries under investigation (listed below) is typically either age 15 or 16 (for international compulsory schooling ages, see Murtin and Viarengo, 2007;  for U.S. compulsory schooling ages, see Oreopolous, forthcoming). The older group includes those at or close to the end of the period of formal education and training. Although reports of the current enrollment status of the IALS respondents appear inaccurate, data on expected graduation ages suggest that most individuals will have finished their first university degree (for example, a bachelor's degree) by age 25. We do not explore the evolution of literacy from age 18 through 25 because of sampling limitations in the IALS; most notably, the sample excludes U.S. college students residing in dormitories.\nAs noted, the International Adult Literacy Survey provides distinct measures of prose, document, and quantitative literacy. Because correlations in performance across the three domains are strong, we define literacy as an average across the three domains. Previous papers using the IALS have taken a similar approach (for example, Blau and Kahn, 2005; Devroye and Freeman, 2001; Hanushek and Zhang, 2006) , and the relationships we describe remain substantively unchanged when using literacy defined in any one domain. We are particularly interested in the role of higher education in the age profile of literacy and expect university graduation-our measure of higher education-to have the greatest effect on performance at the top of the score distribution. 2 Our analysis therefore focuses on an indicator that is set to one if an individual's average score across domains is at or above the test-score threshold for achieving level-four proficiency (illustrated above in terms of the compound interest question).\nWe restrict our attention to the subset of International Adult Literacy Survey participant countries that had GDP per capita exceeding $20,000 in 2002, as these countries could in principle offer the most similar postcompulsory schooling opportunities. Other OECD countries that participated in the IALS but are excluded from the analysis because of this income threshold are the Czech Republic, Hungary, and Poland, which in 2002 had GDP per capita of $16,585, $14,365, and $11,194 , respectively. We also exclude Canada, because the public-use data for Canada do not disclose the age and nativity of respondents. These variables are necessary for our analysis, since we limit our sample to the native born. This sample restriction allows us to focus on respondents likely to have been schooled in their current country of residence. It also ensures that our estimates are not influenced by differing compositions of immigrant populations across countries, for example in terms of skill (Mayda, 2006) or age. Three patterns stand out in Figure 1 . First, in nearly all countries sampled, the group aged 26-30 performs better than the group aged 16-17. Second, there is considerable variation across these countries in the difference in test performance between the younger and older groups. In some countriesSwitzerland, the Netherlands, and Italy-performance is broadly the same; in others-Sweden, Belgium, Germany, Norway, and the United States-the difference in performance between the older and younger groups is striking. Third, the difference in performance between the older and younger groups is greater in the United States than in any other country in the sample, except for Norway. For the remainder of the paper, we refer to the performance differential between the older and younger groups in a country as the country's \"age profile of literacy.\"\nBefore we consider these facts in more depth, it is important to note that the International Adult\nLiteracy Survey data are cross-sectional. Because younger and older test takers were born at different times, the age profiles of literacy that we estimate reflect both life-cycle changes in literacy-including any gains from higher education, as well as potential cognitive gains or losses due to aging-and differences in literacy across age groups due to cohort-specific differences in learning environments. In this symposium, Deming and Dynarski document one source of different learning experiences across cohorts in the United\nStates: age of entry into first grade. They show that test performance at ages nine and thirteen was lower among U.S. cohorts that, in first grade, had large fractions of \"redshirted\" students over age six. This outcome might arise because greater shares of these cohorts had been exposed to one fewer year of formal schooling by the time they were tested. Following this logic, if the younger U.S. IALS cohort started school later than the older U.S. IALS cohort then, at age 17, we might expect the younger age cohort to perform worse. The performance difference between the older and younger age groups measured in the mid 1990s would then overstate the life-cycle gain in literacy, since it would reflect this gain plus the difference in test scores at age 17 between the older and younger cohorts.\nBecause \"redshirting\" differences between the cohorts under study are small, they are unlikely to have a large impact on the age profile of literacy in the United States estimated here. In particular, while 2.5 percent of American six year-olds were enrolled in kindergarten as opposed to grade one in 1974 (the cohort of 26 year-olds in the 1994 IALS), this grew to only 5.6 percent in 1984 (the cohort of IALS 16 year-olds). Consistent with this claim-and consistent with the absence of other cohort-specific shocks to the learning experience in the United States-differences between the cohorts under study in achievement at age 17 as measured by the National Assessments of Educational Performance appear small. Certainly, performance was not lower in the mid 1990s than it was in the early 1980s (Krueger, 1998) , which suggests we are not overestimating life-cycle literacy gains.\nOf course, cross-sectional age profiles of literacy may reflect more than purely life-cycle gains for a myriad of reasons, and these apply to the other countries in the analysis as well as to the United States.\nNevertheless, several pieces of evidence suggest that the differences in test performance across age groups documented in Figure 1 are rooted in life-cycle changes rather than in cohort effects. First, Hanushek and Zhang (2006) show that within-country associations between schooling and literacy are essentially the same for 26-35 year-olds and 36-45 year-olds in the IALS, suggesting that the two cohorts attended schools with comparable levels of productivity. While they do not include data on 16-17 year-olds, as we do, it is notable that they only identify significantly different literacy \"returns\" to schooling for cohorts (and countries) immediately affected by World War II. Second, we reestimated country-specific age profiles of literacy while holding constant maternal education, a commonly used proxy for the home learning environment. This made only a small quantitative difference and no qualitative difference to the age profiles implied by Figure 1 and shown in subsequent figures. 3 This finding also suggests that most of the cross-sectional differences in test scores across age groups are driven by life-cycle differences rather than cohort effects.\nFinally, because several countries-Italy, Norway, Switzerland, and the United States-have data in both the IALS and the ALL, we were able to examine the age profile of literacy within cohorts. . The variable testscore ic represents an indicator for whether individual i from country c achieved at least levelfour proficiency, ages26_30 i is an indicator variable set to one if i is between the ages 26 and 30, x i is a vector of indicators for maternal education, and ε ic is the regression error, which captures all other determinants of individual test performance. The coefficient β c gives the expected difference in test scores between 16-17 and 26-30 year-olds in country c, holding constant maternal education. Following convention, we impute maternal education with age-by-country specific means where missing and include in the vector x indicators set to one for each variable if imputed. In doing this, we allow the relationship between test scores and maternal education to differ across countries, because some school systems may do a better job of compensating for disadvantage than others (Schuetz, Ursprung, and Woessmann, 2005) . 4 Age is reported in 10-year intervals in the ALL for the United States, precluding us from following only the 16-17 year-olds in the 1994 IALS over time.\ngreater divergence between the within-and across-cohort differences in literacy. However, the divergence is not systematically positive or negative. This suggests that our use of cross-sectional data adds noise but not bias to our estimates of the true age profile of literacy."}, {"section_title": "Education and the Age Profile of Literacy", "text": "To understand how education shapes the age profile of literacy, individual-level longitudinal data would be ideal: we could see how individuals' scores change from their teen years through their twenties, and how this evolution depends on whether the individual participates in higher education. However, our cross-sectional data do not permit us to link individual-level literacy scores over time to identify whether specific 16 or 17 year-olds will go on to higher education or to infer whether sampled 26 year-olds who attended or graduated from college enjoyed larger literacy gains through the late teens and early 20s than sampled 26 year-olds that did not attend or graduate from college. Thus, we structure our analysis to consider how country-level differences in literacy rates over this part of the life cycle are associated with country-level differences in average educational attainment across age groups.\nAmong the high-income countries in our sample, there is a great deal of heterogeneity in the age profile of literacy from the teenage years into adulthood, as already shown. Perhaps surprisingly, these country-specific age profiles are not strongly correlated with differences between the older and younger age groups in the conventional measure of educational attainment-years of schooling. We show this in Figure 2 , which plots the difference in the fraction of 16-17 and 26-30 year-olds performing at level-four or -five proficiency (from Figure 1) against the difference in years of education between the older and younger age groups for each country in the sample. The least squares line fit to the data is upward sloping, but quite flat, suggesting at best a weak effect of time spent in school after age 16 on skill levels. However, Figure 2 does not take into consideration the diversity of postcompulsory programs in which individuals might participate and which, potentially, have very different effects on skill acquisition.\nFor example, in countries where the gain in years of schooling after age 16 is relatively large, much of the marginal education may be unproductive. In other countries, the average person might spend less time in school after age 16, but this time might be spent in types of education that have larger effects on skill acquisition.\nTo get a sense of this possibility, Table 1 reports graduation rates from various postcompulsory programs and the years of full-time enrollment required to complete these programs. Because this type of information is not available in the International Adult Literacy Survey, we use data from OECD Education at a Glance from years chosen to correspond as closely as possible to the cohorts observed in the IALS.\nThe graduation rate is the ratio of program graduates to population at the expected age of graduation, as reported by OECD (multiplied by 100). The expected duration of a program is the expected number of years to degree if enrolled (based on midpoints of the ranges of expected graduation ages for each level of study). In the first four columns of Table 1 , we report on four types of programs: general upper secondary (high school) programs, vocational or apprenticeship upper secondary programs, nonuniversity tertiary (community college) programs, and university first degree (bachelor's degree) programs. In the final column, we combine these numbers to estimate the average total years of schooling acquired between ages 16-17 and 26-30. This total is equal to the sum, over all programs, of the product of the probability of having graduated from the program and its expected duration. This measure thus excludes years of schooling that do not lead to degrees and so underestimates years of schooling in the total population. However, it is the most consistent estimate of program-specific years of schooling available to us for the entire group of countries. As one would hope, this sum is highly correlated with the difference in years of completed education between the older and younger age groups in the International Adult Literacy Survey shown in Figure 2 . Table 1 shows that, in the mid 1990s, great variation existed across countries in how time was allocated across educational programs after age 16. For example, average years of postcompulsory education were the same in the United States, the Netherlands, and Sweden (3.2 years). In the United States, the additional years were weighted toward tertiary education, particularly at the university firstdegree level. In the Netherlands and Sweden, by contrast, the additional years were weighted toward upper secondary education, especially vocational programs. The U.S. advantage in years of university education was attributable to the high fraction of the U.S. population that graduates from colleges and universities.\nThe U.S. population also had more expected years of university education (university graduation rate times expected duration of study) and higher university graduation rates than countries such as Belgium, Germany, Switzerland, Denmark, Finland, and Norway, all of which had more expected years of education after age 16.\nOf the educational programs described in Table 1 , only university education is correlated with the age profile of level-four or -five proficiency on the IALS assessment, and this correlation is very strong.\nFigure 3, Panel A shows this correlation, plotting the difference in high-proficiency performance between the younger and older age groups against expected years at university (now calculated as the fraction with a university first degree in the IALS times expected duration of study, from OECD). The regression line implies that on average, an additional year of university education increases the share of a cohort reaching at least level-four proficiency as adults by roughly 14 percentage points. This effect is a large one, given that in most countries in our sample, between 20 and 40 percent of the older age group is proficient at level four (as shown in Figure 1) . A one-year increase in average years of university education is, however, an enormous change, representing an increase in university graduation rates of 25 percentage points (assuming an expected duration of 4 years). Such an increase would more than double expected years of university education in most of the countries listed in Table 1 . As shown in Panel B, cross-country variation in graduation rates appears to explain much of the cross-country variation in the age profile of high-proficiency test performance; by comparison (graph not shown), very little of this variation is explained by the duration of university degree programs reported in Table 1 .\nHow should we interpret the correlations shown in Figure 3 ? If the points plotted on this graph represented individuals in a given country, we would be very concerned about omitted variables and selection. After all, teenagers who choose to obtain university degrees would likely have different literacy gains between ages 16-17 and 26-30 whether they received a university degree or not. As a result, it would be difficult to infer from simple correlations how the skills of the typical adult would evolve if policies were introduced to encourage teenagers to attend and complete college.\nA version of this concern also applies when looking across countries: Are countries with higher university graduation rates those that would otherwise have larger gains in literacy from the teenage years into adulthood? Low skill levels for teens within a country may cause two distinct outcomes: 1) marginal returns to investment in human capital-whether through formal schooling or life experience-may be relatively high, so the average skill level of a cohort may improve considerably between the teenage years and adulthood even in the absence of university education, and 2) students may disproportionately obtain university degrees to compensate for low skills upon graduating from high school. In either of these cases, the correlation between the age profile of literacy and university graduation rates at the country level would imply nothing per se about the role of university education in building skill. The data in Figure 1 These arguments, while suggestive, do not prove that our estimates are free of bias, and some doubt remains as to whether policy-induced changes in university graduation would have effects of the magnitude documented in Figure 3 . It is important to understand whether the correlation shown above between university education and the age profile of literacy should be interpreted as causal. Our estimates are based on data from the 1990s, and since then, university graduation rates have risen dramatically in a number of countries. As seen in Table 2 , the striking advantage the United States sustained over highincome countries in university graduation rates has largely been eliminated. 6 By 2004, nearly all of the countries considered in this table had higher rates of university graduation than the United States. If even a portion of the observed relationship between university education and the age profile of literacy were causal, these recent trends in university graduation rates could have dramatic effects on future literacy patterns across countries. We next delve deeper into the question of interpretation, examining the sources of variation across countries and over time in university graduation rates."}, {"section_title": "Determinants of the Demand for University Education", "text": "University graduation rates are equilibrium outcomes in the higher education market. We therefore discuss possible explanations for why graduation rates vary across countries by first considering those on the demand side and then in the next section considering factors on the supply side. To make this discussion tractable, we limit our attention to the United States and high-income countries in Europe. For completeness, we present statistics in the tables on all countries meeting the income criterion.\nHow secondary schools are organized has a first-order effect on demand for a university degree by determining whether all individuals in a country can in principle receive a university education or whether 6 Graduation rates reported in Table 2 for 1970 through 1995 are approximated by taking the ratio of university first degree (International Standard Classification of Education level 6) graduates to the estimated country population aged 22 in that year. The number of graduates is from UNESCO at <http://www.uis.unesco.org/pagesen/DBGTerIsced.asp>. The 22 year-old population in a country is estimated with births in that country 22 years prior, taken from the Berkeley Mortality Database at <http://www.demog.berkeley.edu/~bmd/>. This is the source of discrepancy between the university graduation rates reported for 1995 in Table 1 and access to universities will be restricted to a privileged few. Among students eligible to enroll in universities, the enrollment decision then depends on the expected costs and benefits of a university degree. The costs include both direct costs, like tuition, and indirect costs, like the opportunity cost of foregone earnings; the benefits are both pecuniary and nonpecuniary. Cultural dimensions of postwar society, such as the expansion of human rights and the related \"education for all\" ethos, may also affect university enrollment decisions independently of these economic considerations (Schofer and Meyer, 2005) .\nWhich of these demand-side factors have contributed to the variation in university graduation rates documented in Table 2 ? Consider first the practice of school tracking, whereby students are assigned to different types of education depending on perceived academic ability. Students assigned to the lower tracks of these systems typically follow a curriculum that is oriented to the labor market and which might not include the courses required for university enrollment. Even if these students could take the requisite courses and become eligible for university after finishing their secondary schooling in a vocational track, this process may appear too difficult, time-consuming, and costly to accomplish.\nCross-country data support the hypothesis that countries that track have lower university graduation rates. As seen in Table 3 , countries characterized by low university graduation rates, such as Belgium, Germany, Italy, and the Netherlands, select students into tracks at relatively young ages (12, 10, 14, and 12 respectively) and have relatively small fractions of students graduating from the final stage of secondary school with degrees that grant them access to higher education. Country-specific studies of tracking reforms have generally reached much the same conclusion. For example, Aakvik, Salvanes, and\nVaage (2003) show that the expansion of comprehensive schooling in Norway increased the probability that affected students attended university. Exploiting variation in the timing of its implementation across municipalities, Meghir and Palme (2005) show that a Swedish reform allowing students to choose their curricular tracks, rather than assigning them to tracks based on grades, increased average years of education, especially among students with less-educated parents. However, studying a Romanian reform that postponed tracking for two years, Malamud and Pop-Eleches (2007) find that the postponement of tracking increased the proportion of students who were eligible to attend university, but did not increase the proportion of students who completed university, in part because the supply of university slotsdirectly controlled by the government-did not change.\nThese studies have several limitations. In Norway and Sweden, the reduction in tracking was accompanied by an increase in compulsory schooling, making it difficult to attribute the gain in educational attainment to the adoption of comprehensive schooling. Malamud and Pop-Eleches (2007), on the other hand, do not examine the longer-run effects of tracking on university graduation rates, focusing instead on two adjacent cohorts-one exposed to the old system and the other to the new regime. We nevertheless surmise that eliminating tracking creates pressure from the rising number of university-eligible students-pressure that grows stronger with every additional cohort that passes through the untracked system. After some time, such pressure may persuade governments to expand the number of university slots, an issue to which we speak in more detail below. This \"delayed\" demand story is consistent with the recent increases in university graduation seen in the United Kingdom and the Scandinavian countries, all of which had abolished tracking by the mid 1970s.\nWe find less empirical support for other demand-side explanations for the trends in university graduation shown in Table 2 . For example, consider the variation across countries and over time in returns to education and local labor market conditions. Historically, returns to education in the United States were not significantly larger than returns to education in European countries (Psacharopoulos, 1973; Psacharopoulos and Patrinos, 2004 Tuition, fees, and other out-of-pocket costs of university enrollment also cannot account for these patterns because they traditionally have been highest in the United States. As shown in Table 4 , a larger share of U.S. students attends (costlier) private institutions of higher education, and those that attend public institutions pay more in tuition. Although some of the costs of higher education are offset by scholarships and grants, data from the mid 1990s confirm that public subsidies to households for education per student enrolled are far higher in European countries (OCED, Education at a Glance: OECD Indicators, 1997, table B3.1b). Higher out-of-pocket costs of college have been found to deter college completion in the United States (Dynarski, 2003; forthcoming) , suggesting that with lower tuition and fees, the historical U.S. graduation advantage would have been greater still. As we discuss below, the apparent paradox of a positive correlation between fees and graduation rates across countries may be explained by the fact that low prices in other countries have often been accompanied by shortages of university slots.\nThe historical U.S. advantage in university graduation may, however, be related to another fundamental determinant of the cost of university education-the typical number of years required to obtain a first degree. A degree that takes longer to achieve is less attractive if higher education displays \"sheepskin effects\"-that is, if the returns to a degree that students quit halfway through are less than half of the full return to the completed degree-and if students perceive longer degrees as riskier investments.\nIn several European countries, the first university degree takes more than five years to obtain, as shown in Table 1 , whereas in the United States it requires four years of full-time enrollment. This demand-side factor cannot, however, explain recent increases in European graduation rates, as the time required to obtain a degree has remained relatively constant in Europe."}, {"section_title": "Determinants of the Supply of University Education", "text": "The supply of university education is characterized by a level of government involvement that is generally high, while varying widely across countries. Governments regulate the education that can be supplied (like the fields that can be offered), subsidize the education that is supplied, and often supply some of this education directly via universities that are government owned and government controlled. In many cases, governments directly determine the number of students who may enroll. Governments also set prices for many universities and determine standards for financial aid.\nAmong rich countries, the United States has the least government involvement in the provision of higher education (as suggested in Table 4 by the relatively high faction of U.S. graduates from private universities and the relatively high tuition paid by students to attend U.S. public colleges and universities).\nWell over half of U.S. college and university revenues are derived from private sources-payments of tuition and other fees. By contrast, in nearly all high-income European countries, higher education is funded primarily by the government, either directly (through government purchases of educational resources or grants to institutions) or indirectly (through the provision of grants or loans to students to offset tuition and living costs). These cross-country patterns are quite stable over time.\nThe natural first question to ask is how have varying degrees of government involvement in the provision of higher education historically affected university supply? Card and Lemieux (2001) and Bound and Turner (2007) provide a useful framework for answering this question and estimating the elasticity of university supply within the United States. They look at the impact of demographic-driven demand shocks-that is, sharp changes in the size of the college-age cohort-on university graduation rates. If supply changed to accommodate these shocks, the graduation rate would remain constant, and hence would be unrelated to demand shifts measured by cohort size. If, however, the supply of university slots were fixed, the number of graduates would remain unchanged across cohorts, but the graduation rate would fall as cohort size increased and rise as cohort size fell. Using variation in cohort size across states and over time, both studies find that a 10 percent increase in cohort size in the United States reduces the university graduation rate by about 0.5 percentage points. This finding implies that the university sector expands to accommodate some, but not all, of the shock to demand for higher education. We ran an ordinary least squares regression with university graduation rates by country and by year as the dependent variable. The key explanatory variable was the natural log of the population 22 years of age in that country during that year. We also included a constant term and a full set of country-and yearspecific intercept terms. The country intercept accounts for the fact that some countries have persistently higher rates of college completion, while the year-specific intercept captures trends in university graduation rates that would have been shared by all of these countries in the absence of changes in cohort size. 9 Our estimate of the coefficient on the population term is around -0.098 (with a standard error of 0.044). This estimate implies that a 10 percent increase in cohort size is associated with about a one percentage point decrease in university graduation rates-roughly double the magnitude of the effect found for the United\nStates by Card and Lemieux (2001) and Bound and Turner (2007) . This finding suggests that the supply of university slots may be more flexible in the United States than in Europe.\nWhy might the supply of university slots be more flexible in the United States? Limited and decentralized public sector involvement in higher education could generate more flexible supply-side responses, because institutions that generate larger shares of their revenue from tuition and other private sources can adjust revenues more quickly than institutions relying more heavily on government funding.\n(Recall the Malamud and Pop-Eleches (2007) finding on Romania.) Indeed, looking across university types 9 We estimate the following regression model: In 1970 In , 1975 In , and 1980 In -1998 , the dependent variable, Graduation Rate ct is calculated as the number of graduates in country c in year t (from UNESCO at <http://www.uis.unesco.org/pagesen/DBGTerIsced.asp>) divided by the size of the population aged 22 in year t in country c (estimated as described below). From 1999-2005, Graduation Rate ct is reported by UNESCO (at <http://stats.uis.unesco.org/unesco/TableViewer/document.aspx?ReportId=136&IF_Language=eng&B R_Topic=0>). The coefficient of interest is that on the natural log of the number of births 22 years prior to year t in country c, ln(pop22 ct ), taken from the Berkeley Mortality Database (at <http://www.demog.berkeley.edu/~bmd/>). Because this is only an approximation of the number of 22 year-olds in country c in year t, and because not all university graduates are 22 years old, the estimated effect of cohort size is likely a lower bound on its true effect. The parameters λ c and γ t represent countryand year-specific intercepts, respectively. To account for differences in the definition of the graduation rate before and after 1998, we also interact the country fixed effects with an indicator set to one for years 1999 and later. In the estimates reported, we use data on the countries listed in the text in all available years (1970, 1975, ; the total number of observations is 266.\nwithin the United States, Bound and Turner (2007) estimate that changes in cohort size have almost no impact on enrollment rates into private colleges and universities in the United States. In other words, private-sector supply adjusts immediately to accommodate demand changes. Bound and Turner also find that public community colleges are quite sensitive in their supply responses. While these colleges do rely on government funding, access is the central part of their mission, and they expand supply to serve more students even if it is with significantly fewer resources per student. Only the presence of public universities generates a negative relationship between cohort size and university enrollment rates in the United States.\nBecause the European university market is dominated by public universities, this story is consistent with our results.\nIn addition, the competition generated by a large private sector and a decentralized public sector could lead universities to supply education to lower-ability students or to provide the types of education (for example, short-duration courses in more applied fields) that lower-ability students might prefer, thereby removing an implicit cap on the number of university slots available. More flexible government regulations in the United States, such as those allowing students to transfer to four-year universities after completing courses in two-year colleges (Kane and Rouse, 1999) , or allowing universities to determine permissible courses of study without government approval, likely matter as well.\nThe relative flexibility of the U.S. supply side, which may be due in part to the decentralized and deregulated U.S. higher education sector, thus appears to contribute to the historical U.S. graduation rate advantage. This argument does not imply that a centralized and largely public higher education sector cannot expand access. Just as some European countries moved from selective to comprehensive secondary education by the 1970s, many have recently shifted from \"elite\" higher education to \"mass\" higher education, which Trow (1974) characterized as serving at least 15 percent of the \"age grade\" by increasing access to both elite university programs and \"popular nonelite institutions.\" This transition appears to have occurred because European governments have increased supply-not continuously and flexibly, but through discrete policy responses to long-standing shortages (for example, Moscati and Rostan, 2000; Greenaway and Haynes, 2000) . Combined with declines in the size of college-aged population brought about by the drop in fertility in Europe in prior decades (see Feyrer, Sacerdote, and Stern in this symposium), such policy shifts have almost certainly been at the heart of the dramatic increases in university graduation rates shown in Table 2 ."}, {"section_title": "Conclusions", "text": "Literacy gains into adulthood vary across countries, and these gains are strongly correlated with participation in higher education. A country's university graduation rate is tied to how secondary education is organized and how higher education is funded. We do not want to claim that all of the correlation between university graduation and the age profile of literacy into adulthood reflects the causal effects of university graduation. After all, educational systems are not randomly assigned to countries. Instead, they reflect the preferences of a country's citizens and therefore may be correlated with other institutions, such as labor market regulation, that shape the incentives to acquire skills after compulsory schooling has ended.\nBearing this limitation in mind, we reach some tentative conclusions. First, the historical advantage that the United States has enjoyed in college graduation appears to be an important reason why, between the teen years and the late 20s, American literacy rates appear to catch up with those in other high-income countries. The share of native-born Americans in the IALS that were able to make high-level inferences was nearly five times higher among those in their late twenties (23 percent) than among those in their teens (4.7 percent). Taken at face value, our estimates suggest that much of this difference was driven by the relatively high rate of university graduation in the United States at the time. If the university graduation rate in the United States had been 15 percent instead of 30 percent-roughly the average among the European countries in our data at this time-the literacy difference for Americans in these age groups would have been roughly half as large, and the United States would have continued to rank near the bottom of the test-score distribution among individuals in their late twenties. Second, and by the same token, the recent convergence of other high-income countries' university graduation rates to that of the United States could push the test scores for U.S. young adults down the international distribution.\nJust as the adoption of mass secondary education in Europe in the postwar period shined a light on the low output of U.S. elementary and secondary schools (Goldin, 2003) Table 1 . Notes: The variable on the vertical axis is the difference between 26-30 year-olds and 16-17 year-olds in the estimated population share achieving at least level-four proficiency on the IALS test. In Panel (A), the variable on the horizontal axis is the product of the difference between the two age groups in the university first degree graduation rate (from the IALS) and the theoretical time to degree (from Table 1 ). The least squares fitted line has a slope of 0.137 (standard error=0.056) and an Rsquared of 0.315. In Panel (B), the variable on the horizontal axis is the university first-degree graduation rate in the IALS. The least squares fitted line has a slope of 0.721 (standard error=0.304) and an R-squared of 0.378. See text for more details. Non-university tertiary (1995) 1st university degree (1995) Upper secondary (1991) Sources: OECD Education at a Glance (1993, 1995, 1997, 1998) . Notes: Graduation rates are ratios of public and private graduates to population at the expected age of graduation, multiplied by 100. Expected duration of studies is calculated using midpoints of theoretical graduation age ranges by level of study. Expected years of education after age 16 are obtained first by calculating theoretical duration*(graduation rate/100) at each level of study, then summing across the levels. "}]