[{"section_title": "Abstract", "text": "Strawberry (Fragaria ·ananassa) production practices followed by growers in the United States vary by region. Understanding the challenges, needs, and opportunities in each region is essential to guide research, policy, and marketing strategies for the strawberry industry across the country, and to enable the development of general and region-specific educational and production tools. This review divided the United States into eight distinct geographic regions and an indoor controlled or protected environment production system. Current production systems, markets, cultivars, trends, and future directions for each region are discussed. A common trend across all regions is the increasing use of protected culture strawberry production with both day-neutral and short-day cultivars for season extension to meet consumer demand for year-round availability. All regions experience challenges with pests and obtaining adequate harvest labor. Increasing consumer demand for berries, climate change-induced weather variability, high pesticide use, labor and immigration policies, and land availability impact regional production, thus facilitating the adoption of new technologies such as robotics and network communications to assist with strawberry harvesting in open-field production and production under controlled-environment agriculture and protected culture."}, {"section_title": "", "text": "T he United States produced more than 3015 million pounds of strawberries in 2011, thus earning the rank of second in the world for strawberry volume [Food and Agriculture Organization of the United Nations, 2015; U.S. Department of Agriculture (USDA), 2013]. The United States produces almost 20% of the world crop and leads the world in production per unit area. The farm gate economic value of strawberries has been between $2.3 billion and $2.8 billion during the past 3 years (USDA, 2017) . In addition, the fresh market value of strawberry production in the United States was second to commercial apple [Malus ·domestica (USDA, 2014a) ]. In 2017, an estimated 91% of the crop was produced in California, 8% was produced in Florida, and all other states combined produced %1% (USDA, 2018a). This 1% is produced on %17% of the available acreage and by 85% (>9000) of farms, thus indicating the wide geographic distribution of production and extreme variability in farm size. Other major production states include North Carolina, Oregon, and Washington.\nThe U.S. production acreage has increased %17% since 1990, with the largest expansion in Florida and California (USDA, 2013) . Production declined in many states during this period of rapid expansion in California and Florida due to the inability to adapt to new technologies and compete in the national marketplace; however, acreage in California has declined in recent years (USDA, 2017 (USDA, , 2018a . Numerous factors such as drought conditions, increased urbanization, expensive land leasing, and lack of labor availability at harvest have contributed to this decline. With the expansion of U.S. farmers markets and interest in local foods, smaller-scale production has occurred throughout the United States for local and regional markets, and small farm acreage is expected to increase to meet consumer demands. U.S. consumption of strawberries has increased significantly during the past two decades, from 2 lb per capita in 1980 to 8 lb in 2013 (USDA, 2014a) . Consumption is expected to increase as a result of increased awareness of the health benefits associated with berry consumption, year-round availability made possible through domestic production and protected berry culture, increased imports, and improved cultivars. Fresh strawberries, either domestic or imported, are available year-around, with peak volumes occurring from February through June. However, the United States imports berries during the offseason, primarily from Mexico, which represents %11% of the market share. The production and import of berries from Mexico increased considerably in 2012 and 2013, with the production in Mexico exceeding 800 million pounds (Secretariat of Agriculture, Livestock, Rural Development, Fisheries and Food, 2014) . Periodically, imported product has resulted in an oversupply of berries on the U.S. market, creating tremendous pressure on the pricing for U.S. strawberry growers (Wu et al., 2012) . Approximately 15% of the U.S. crop is exported annually; Canada received a majority (81%) of fresh and frozen product in 2012 (USDA, 2013) .\nThe majority of strawberry production revenue is generated from fresh fruit sales through direct markets, from grower to consumer [pick-yourown (PYO), produce stands, farmers markets], or direct sales (grocery stores, wholesale providers, restaurants, retail bakery, etc.). The remainder of the market comprises frozen strawberry sales or processed strawberry for products like jams, syrups, yogurt, or ice cream. These products can be available for sale in the same market space as fresh strawberries.\nCommercial strawberry production in the United States is primarily based on annual hill production (AHP) systems [California Strawberry Commission (CSC), 2018a; Poling, 2015] . This system relies on the combination of plastic mulches and preplant fumigants to minimize infestation of soil-borne diseases and weeds, to conserve soil moisture, and to maintain profitable yields. AHP uses drip irrigation, which helps to promote water-use efficiency and reduce disease pressure in the canopy. AHP has replaced older technology such as perennial matted row (PMR) production in many regions of the United States, and nearly all berry supply by volume comes from AHP. Strawberry types (short-day or dayneutral), cultivars, and nursery plant material vary by region. Short-day cultivars are actually facultative short-day plants that will initiate flower buds in the fall and early spring when days are shorter than 14 h, or even during long days when temperatures are below 60°F; fruit is produced during the spring season and, depending on the region, the summer season (Durner et al., 1984; Pennsylvania State University, 2013) . Therefore, they are also referred to as June-bearing or spring-bearing cultivars. Day-neutral cultivars produce branch crown and flower buds throughout the season; however, when temperatures rise (above 86°F), flowering and fruiting are inhibited (Durner et al., 1984; Pennsylvania State University, 2013) . Everbearing strawberry cultivars initiate flower buds throughout the growing season except in early spring, when initial fruiting occurs (Durner et al., 1984) . Protected culture strawberry production using day-neutral and short-day cultivars in low tunnels or high tunnels and greenhouses has gained increased interest from growers in recent years. The use of protected culture has allowed for season extension, reduced pest pressure, and improved fruit quality; it also minimizes the risk of damage from adverse weather conditions. Because of new developments in strawberry production technology and management, expansion of production in nontraditional areas, and new developments in cultivars, this workshop was designed to provide a benchmark for the industry in several regions of the United States to identify production challenges in each region and to look forward to the future development of the industry.\nSpecific goals of this workshop were: 1) to become familiar with production practices of strawberry across the different regions of the United States; 2) to identify threats, priorities, and challenges for each of the strawberry production regions; and 3) to discuss the future outlook for strawberry production in the United States. Information disseminated during the workshop and summarized in this manuscript was gathered from the USDA census and surveys, available scientific literature, communications with state strawberry specialists and advisors, agriculture extension agents, growers, and industry sources. Tables 1 and 2 provide an overview of information pertaining to the first two goals of the workshop. Additional information regarding strawberry production is described here by region. Figure 1 defines the states included in each region."}, {"section_title": "Region 1: California", "text": "California strawberry production is concentrated in three primary coastal production regions: Salinas/ Watsonville, Santa Maria, and Oxnard. These regions have a mild climate that facilitates year-round production with the use of modified production practices such as protected culture and off-cycle plantings of day-neutral and short-day cultivars (Geisseler and Horwath, 2014) . California continues to be the major producer of strawberries in the United States and supplies %90% of the total U.S. volume and 72% of the planted area (USDA, 2018a). Recent planting areas have declined from 38,937 acres (in 2014) to 33,791 acres (in 2018) (CSC, 2018b). The majority of strawberries are annual plantings, with 27,804 acres planted in the fall for the winter, spring, and summer harvests. Summer plantings for the fall harvest comprised 5988 acres for 2017. Fall plantings in the fruiting fields are started using bare-root plants from high-elevation nurseries. Summer plantings use frigo plants. Frigo plants are dormant strawberry plants that have been cold-stored for months at 29.3°F after being dug from the field in late fall to winter, and the plant foliage has been taken off (Durner et al., 2002; B.E. Poling, personal communication) . Organically produced strawberry for 2018 included 3023 acres of fall plantings and 968 acres of summer plantings (CSC, 2018b) .\nApproximately 75% of California strawberries are harvested for the fresh market, and the remaining 25% are frozen for processing. Most California strawberries are consumed domestically, but %16% are exported to the major markets in Canada, Mexico, Japan, and Hong Kong (CSC, 2017) . Recent acreage surveys reported that %59% of the acreage was planted with University of California (UC) cultivars. Among the major UC cultivars are Monterey, San Andreas, Fronteras, and Cabrillo. Approximately 38% of the acreage was planted with proprietary cultivars, and the remainder of the acreage was planted with University of Florida and publicly available cultivars (CSC, 2017) .\nMajor challenges for California strawberry producers include labor shortages, fumigant regulations and restrictions, and high costs such as Table 1 . Overview of current production systems, cultivars, transplanting, and harvest season for fruit production and starter plant types used in the different strawberry production regions of the United States. (Durner et al., 2002; E.B. Poling personal communication) . Plug plants are grown from unrooted runners, which are referred to as tips. These tips are rooted in peat-based soil-less media (Durner et al., 2002) . land prices. Farm labor availability is a major problem in California because 100% of the fruit has been picked by hand (Martin, 2017) . There is much interest in mechanical harvesting of strawberry fruit; however, so far, no commercial harvesting machines have attained widespread use. Methyl bromide (MB) is no longer available for use in fields for fruit production for soil disinfestation; it has been replaced by chloropicrin and 1,3dichloropropene products. However, fumigant use regulations require buffer zones near sensitive sites like hospitals and schools, which complicates the placement of strawberry fields. There is much interest in developing nonfumigated production systems for strawberry; among these methods, anaerobic soil disinfestation (ASD) is the most promising so far (Shennan et al., 2018) . It is likely that the development of nonfumigated production systems, including soil disinfestation with steam, will continue (Fennimore et al., 2013) . It is also likely that the proportion of organic production and summer plantings will continue to increase to meet consumer demands for organic produce and strawberry fruit year-round. However, the increasing costs of land, labor, and inputs will provide a challenge to California strawberry producers."}, {"section_title": "Region", "text": ""}, {"section_title": "Region 2: Pacific Northwestern North America (Pacific Northwest)", "text": "Pacific Northwest production is concentrated in the western areas of Oregon (especially the Willamette Valley), Washington (especially the Skagit and Nooksack Valleys), and British Columbia, Canada (especially the Fraser River Valley) (Statistics Canada, 2012; USDA, 2017). The 5-year average production in the region was 3460-3707 acres planted, producing %31.9 million pounds annually. Production is concentrated in these regions because the temperatures are relatively mild in the summer and winter seasons; furthermore, although winter rains are plentiful, there is relatively little rain during the ripening season. This combination of a moderate climate with sunny, warm conditions during the day and dry, cool conditions at night during ripening leads to optimal conditions for fruit quality, especially flavor and color development.\nCanning in the late 1800s and early 1900s, and freezing in later years, when it was developed for large-scale use, allowed a processing industry to develop where the fruit could be grown and harvested in sparsely populated, but ideal, growing areas in the Pacific Northwest, and then shipped to distant population centers. Because the focus was on processing, cultivars and production practices have always been geared toward producing an ideal product for these uses (Finn et al., 2014) . Today, processing for the wholesale markets is still the major use of the fruit in Oregon and Washington; however, the fresh market for local sales is very strong throughout the region (Giombolini et al., 2011) . Fruit are primarily frozen as individually quick-frozen (IQF) fruit, frozen as a sugared and sliced packs, pureed, or juiced to serve as a basic ingredient for a myriad of products. Fresh fruit is most commonly marketed through farmers markets or on-farm sales.\nPerennial matted row production systems have been the primary production system for more than 100 years in Oregon and Washington. Growers may not preplant fumigate or use plastic mulch; however, they use regular fertilization, pest control, and overhead irrigation programs to maximize fruit quality and yield. For fresh market production, the soils are not typically fumigated; however, fumigation is used occasionally. Shortday cultivars grown for the fresh market are often grown without mulch in open field production, whereas day-neutral cultivars for the fresh market are typically grown on raised beds with plastic mulch, drip irrigation, and, in some places, under tunnels (Hoashi-Erhardt and Walters, 2014). The last significant processing plant in British Columbia shut down in the early 2000s, and production shifted almost completely to the production of day-neutral cultivars such as Albion on AHP, and often with tunnels. For the processing market, the long-term standards were 'Hood' and 'Totem'. Beginning in the 2000s, 'Tillamook' started to become the most important processing cultivar, although significant amounts of Totem and Hood are still grown specifically for ice cream manufacturers (P.P. Moore, personal communication). For the fresh market, 'Hood', 'Rainier', 'Shuksan', 'Puget Reliance', and 'Puget Crimson' are commonly grown to produce the main spring crop for local sales (Finn et al., 2014) . 'Albion' has become the second most important cultivar in the region after 'Tillamook' because it is the predominant cultivar throughout the region for fresh fruit production outside of the typical spring harvest season. New cultivars such as Sweet Sunrise, Charm, and Marys Peak are being widely tested in commercial trials.\nIn Oregon, short-day cultivars such as Sweet Sunrise and Hood usually begin ripening in late May to early June, with midseason cultivars such as Tillamook and Totem ripening in early to mid-June (Finn et al., 2014) . Production in northern Washington and British Columbia occurs 3 to 4 weeks later than that in Oregon. Day-neutral production extends from early spring until frost occurrence (typically in October) if plants are unprotected, although there is typically a lull in production after the short-day season (late May to early July), which coincides with some of the warmest weather of the summer.\nLabor availability and cost are the biggest challenges for the processing and fresh-market industries. To remain competitive with the inexpensively priced, processed fruit from California, Pacific Northwest growers must produce a high-quality product, particularly for fresh markets, that can command a premium price and keep the costs of production low (DeVetter et al., 2017; Hokanson and Finn, 2000) . The future is strong for local fresh production whether it be for on-farm or farmers' markets sales or sales through high-value, generally smaller, grocery chains (e.g., market of choice). New cultivars that are easy to harvest and high-quality will have a market for the coming decade."}, {"section_title": "Region 3: Upper Midwestern United States (Upper Midwest)", "text": "The Upper Midwest region includes Iowa, Michigan, Minnesota, North Dakota, South Dakota, and Wisconsin. Total production in this region is relatively small, %2630 acres, with average annual yields near 22.4 million pounds (USDA, 2012) . Almost all commercial strawberry growers in the Upper Midwest use the PMR system, whereby short-day strawberry crops are managed as perennial crops using straw mulch (Domoto et al., 2008) . The best time to plant these are in early spring, but they can be planted later depending on the soil thawing conditions. Popular Junebearing cultivars include Annapolis, Itasca, Jewel, and Honeoye.\nUpper Midwest yields using PMR practices are low, with an average of 7000 lb/acre per year (Hoover et al., 2016) , but the short harvest window of 4 to 6 weeks from early June through early to mid-July allows growers to focus on other crops throughout the summer and fall. Upper Midwest strawberries are predominantly sold through the direct market via farmers markets or restaurant sales and also PYO operations. The main challenge of this system is lower yields, but short-day cultivars have traditionally performed better in Upper Midwest climates than other flowering types, leading to the widespread use of this perennial practice.\nThere has been a recent emphasis on using day-neutral cultivars rather than traditional short-day cultivars. Newly released cultivars, in combination with adjusted cultural practices, allow growers the opportunity to use day-neutral strawberry for the first time. During University of Minnesota research and grower trials, cultivars Portola, Albion, Monterey, and Seascape produced reliably from July to the end of October during the 2013-16 growing seasons (Petran et al., 2017) . When managed as AHP, the white-on-black plastic system with low tunnel coverings, scaled yields ranged from 20,000-38,000 lb/acre per year (Petran et al., 2017) . It is believed that reduced weed competition due to the plastic mulch, reduced fungal pressure under low tunnel coverings, and more vigorous genetics in the recent cultivars will lead to better adaptation of day-neutrals in this cold climate.\nOngoing research of day-neutral strawberry in the Upper Midwest has grown considerably since 2013. Current projects include testing low tunnel plastic types for differences in fruit marketability and pesticide effectiveness, inoculation of plants with arbuscular mycorrhizal fungi for possible increases in annual yield, determining the effects of native wildflowers on pollination efficiency and fruit weight, and using biodegradable films as a replacement for white-on-black plastic mulch. Spotted wing drosophila (Drosophila suzukii) and tarnished plant bug (Lygus lineolaris) remain challenges for the adoption of day-neutral strawberry production (Foord et al., 2015) . Another concern is how the extended season, with this adoption, will conflict with farm plans that divert labor to other crops after the June-bearing season ends. However, the extended yield and season enhance the potential of these new regional practices, resulting in increased production in the future."}, {"section_title": "Region 4: Lower Midwestern United States (Lower Midwest)", "text": "In the Lower Midwest (Illinois, Indiana, Kansas, Missouri, Nebraska, Ohio), 1451 acres of strawberry were produced on 1347 farms (USDA, 2012) . In Ohio, it was reported that 598 acres averaged 4299 lb/acre (USDA, 2012) . Strawberry acreage has declined from its peak in the 1970s, but it has remained relatively stable over the past decade. Strawberry farms are located throughout most states of the region, but they tend to be more concentrated with 1 to 2 h (driving distance) of high-population centers for direct-to-consumer marketing.\nGrowers mainly market fruit directly to consumers through PYO sales, on-farm retail farm markets, or community farmers markets (Hokanson and Finn, 2000) . Wholesale produce auctions handle some volume. Wholesaling also occurs through local and regional buyers because the region has many large produce distributors and chain store distribution centers. Overall, few berries are shipped out of the individual states. There has been interest throughout the region to grow for the developing ''Farm to School'' programs; however, because school break begins in mid to late June, only • https://doi.org/10.21273/HORTTECH04135-18 those farms harvesting early berries on AHP or in high tunnels can supply these markets. There are a few IQF custom processing operations where fruit is destemmed, frozen, packed in buckets or bags, and sold to bakeries and ice cream manufacturers throughout the year.\nMost farms in the region are diverse fruit and vegetable operations, with a few farms growing only strawberry. Farms with strawberry tend to have a diverse mix of other crops to extend the fruit and vegetable marketing season. Growers have been adopting season extension techniques over the past 20 years, including AHP, summer production of day-neutral cultivars, and high and low tunnels so strawberries can be marketed along with other summer and fall produce (Gude et al., 2018) . This has extended strawberry marketing up to 5 months.\nStrawberry is grown in PMR systems in the majority of the states (Hokanson and Finn, 2000; Ohio State University, 2006) . As in other regions, the fruiting season for PMR is relatively short; it comprises 3 to 4 weeks beginning in late May/early June in southern regions and beginning in late June in northern areas. Commonly grown PMR cultivars include Earliglow, Jewel, Allstar, Honeoye, Cavendish, AC Wendy, and AC Valley Sunset (Ohio State University, 2006) . Twenty years ago, some farms adopted the practice of planting coldstored, bare-root eastern U.S. cultivars on AHP in June or July and fruiting them immediately for a summer harvest. The fall AHP system was adopted in early 2000 to extend the harvest and marketing season into the fall.\nRecently, the cultivar selection has changed. AHP system cultivars being grown include Chandler, Camarosa, Sweet Charlie, San Andreas, Albion, Sweet Ann, Camino Real, and Flavorfest. Many Lower Midwest growers are using multiple production methods to extend the harvest and marketing seasons. By managing these systems, growers can almost triple the length of harvest compared with growing using PMR alone. This production strategy has allowed growers to capture a preexisting high-value retail consumer market for strawberries (Gude et al., 2018) .\nOne approach to increasing yields and expanding markets is to double-crop day-neutral cultivars that are planted in the fall as plug plants on AHP. These plants flower and fruit in the spring, are renovated immediately after harvest by hand-thinning the leaf canopy and branch crowns, and then resuming fertigation of nitrogen fertilizer. This renovation process forces the plant to begin blooming again, with the second harvest beginning %30 d after renovation. Although several day-neutral types are being used, 'Albion' and 'San Andreas' seem to be the best overall performers.\nAlthough some larger acreage growers are likely to adopt soil fumigation technologies used in other regions, only a small number of farms will use fumigation due to the added expense, management, and negative impact on the environment. Most farms are monitoring and improving soils and using crop rotation as alternatives to soil fumigation. Interest in controlled-environment agriculture (CEA) of strawberry is developing where fruit can be produced close to population centers and transportation costs are low. Preliminary research has shown that these systems can have reduced pest pressure; when insect pests do occur, biological controls are often effective (Kroggel, 2014; Stanley, 1998) . Water and fertilizer solutions are recycled and efficient light-emitting diode (LED) lighting is used. However, the economic feasibility of such protected systems has not been demonstrated.\nThe current PYO market is not the same as that during the 1970s (Hokanson and Finn, 2000) . The current PYO market is an ''agritainment'' (agricultural entertainment) adventure for families, providing an opportunity to visit an operating strawberry farm and allowing these families to pick a few strawberries. However, unlike the PYO customer of the 1970s, a majority of the consumer sales consist of prepicked strawberries because households are not freezing and processing the volumes that families did in the 1970s (Hokanson and Finn, 2000) . Because 95% of the strawberries consumed in the Lower Midwest are grown outside the region, opportunities exist for growers to take advantage of this ready-made consumer strawberry market, thus allowing bright futures for strawberry production in the Lower Midwest.\nThe availability of highly efficient harvest labor is the largest limiting factor for rapid acreage expansion.\nWith labor shortages increasing, more growers are adopting self-propelled harvest aids that allow more acreage to be harvested by fewer people. There are engineering companies in Ohio that have developed prototype harvesting robots (Adev Automation, Inc., 2015) that may reduce the human component of strawberry harvest in the future. The future increase or decrease in strawberry acreage in the Lower Midwest will be dependent on future labor availability."}, {"section_title": "Region 5: Midsouthern United States (Mid-South)", "text": "Strawberry production in the Mid-South (Arkansas, Louisiana, Mississippi, Oklahoma, and Texas) ranges from 150 to 450 acres each, for a total of %1000 acres (USDA, 2012). This accounts for less than 0.5% of total U.S. production. Soil pH, especially in regions where it may be 7.0 to 8.0 (Oklahoma and Texas), and warm temperatures are limiting factors for strawberry production. Soil amendments including sulfur, compost, or high-acid fertilizers are often needed to lower the soil pH. Variable winter temperatures, late spring freezes, high temperatures in early summer, hail, precipitation during harvest, and strong winds can also limit production (Wallace and Webb, 2013) .\nStrawberry production occurs primarily at small family-run retail operations with 3 to 5 acres (or fewer) of berries. Strawberry is generally grown with various other vegetables and berries for rotation. Larger farms with 20 to 35 acres may contract with local wholesalers for berries for processing ice cream, jams, and jellies.\nThe harvest season for this region typically ranges from February until late May or early June depending on production method. Retail sales are targeted to farmers markets, roadside stands, community-supported agriculture (CSA) associations, and PYO operations (Hokanson and Finn, 2000) . Sales of fresh market and organic local strawberries continue to increase because of the high demand by consumers. Depending on the location, markets, and grower, strawberries may be ready as early as November (in high-tunnels); however, peak open-field production typically occurs from April through May.\nStrawberry production in the region typically uses an AHP system and drip irrigation, although some growers continue to raise strawberries using PMR systems (Hokanson and Finn, 2000) . Strawberry planting occurs mid-September to October; however, some late plantings or replanting may occur in November. Most producers transplant bare-root plants, but plug use is increasing. Until recently, the use of black plastic mulch was limited due to concerns regarding high temperatures and potentially lower yields. However, within recent years, plastic mulch use has increased. For example, within the past 2 years, the entire strawberry production region of Poteet, TX (%100 acres with 40 growers) switched from bare ground, furrow-irrigated production to AHP to aid water use efficiency, improve weed control, and increase berry yield and quality. Although most growers prefer black plastic, a few use white-on-black plastic to reduce heat. More than 95% of production occurs in open fields; however, the use of high and low tunnels is slowly increasing.\nHigh and low tunnels are particularly beneficial to small-acreage, limited-resource growers in the Mid-South. Tunnels aid growers with earlier fall and/or spring production and higher yields and quality, and they protect crops from typical southern adverse weather conditions such as freezing temperatures, high winds, hail, and heavy rainfall (Wallace and Webb, 2013) . However, the costs of tunnels can limit their use.\nDay-neutral cultivars like Albion and San Andreas are common for shipping and processing, but most small producers prefer short-day types such as Chandler, Camarosa, Strawberry Festival, Camino Real, and many others (Fontenot et al., 2014) . Production of 'Sweet Ann' is increasing. Other cultivars grown depend on regional grower and consumer preferences. Yields typically average 1.25 lb/plant. For university and extension programs, there is a critical need to research heat-tolerant cultivars that do well in southern climates.\nThe warm climate in the Mid-South also increases the risk of strawberry disease and insect pests. Typical strawberry pests include spider mites (Tetranychus sp.), strawberry aphids (Chaetosiphon fragaefolii), thrips (Frankliniella occidentalis), tarnished plant bugs, sap beetles (Nitidulidae), field crickets (Gryllus sp.), and various moths and butterflies (Lepidoptera) (Vafaie and Porter, 2014) . Economically damaging diseases include grey mold (Botrytis cinerea), powdery mildew (Podosphaera aphanis), anthracnose (Colletotrichum sp.), root and crown diseases like black root rot (Rhizoctonia sp.), and phytophthora crown rot (Phytophthora cactorum) (Giesbrecht and Ong, 2014) . Crop rotation is a critical tool for pest management. Currently, soil fumigation is seldom used, and growers rotate fields or use other strategies for disease and weed control. Preplant and postplant herbicides and plastic mulch, along with hand-weeding, are widely used for weed control. Small organic farms may use weed fabric between the rows. Very little preplant fungicides are used for root diseases; however, if they are used, then they are generally applied at transplanting and through fertigation techniques. Foliar sprays are used as needed for leaf and fruit diseases.\nThe increased demand for locally grown strawberries in the Mid-South continues (Hinson and Bruchhaus, 2008) . This has resulted in increased strawberry acreage in the region, but there are many challenges facing growers. Increased training opportunities and continued research for the region are needed. Because of the climate, land availability, costs, increasing population densities, growth of metropolitan areas, and expanding economies of the ''sunbelt'' region, the opportunity for expanded production does exist."}, {"section_title": "Region 6: Northeast and Mid-Atlantic United States (Northeast)", "text": "Strawberry acreage has declined from its peak in the 1970s, but it has remained relatively stable over the past decade. In the Northeast, strawberries are produced by more than 3000 farms on more than 3800 acres (USDA, 2012) (Table 3) and marketed directly to consumers, mostly through PYO sales or farmers markets. In this region (Connecticut, Delaware, Maine, Maryland, New Hampshire, New Jersey, New York, Pennsylvania, Rhode Island, Vermont, West Virginia), some fruit is sold wholesale to regional distributors and/or local supermarkets, but few berries are shipped outside of the region. Because of this marketing structure dominated by small acreage, strawberry farms are not concentrated in any one area; instead, they are distributed across the region near population centers. Few farms exclusively grow strawberry, and farms tend to have a diverse mix of other crops to extend the fruit and vegetable season because strawberry alone produces fruit for only 3 to 4 weeks. The average farm in the region has 1.4 acres of strawberry (Table 3) , with 5 acres of strawberry being considered relatively large (USDA, 2012) .\nA portion of acreage (%20%) is not used for production at any one time because most strawberries are grown using the PMR production system. During the establishment year, PMR plants are being established and do not produce fruit. Dormant bare-root plants are set in early spring, and runners (stolons) are produced during the summer to establish the PMR. After fruiting begins in the second year, plantings may be held over for several more years. The fruiting season for PMR is relatively short, extending for %4 weeks beginning in late May/early June in warmer regions and in late June in cooler regions.\nCommonly grown cultivars in the Northeast are from breeding programs in Canada, New York, and Maryland; these include Jewel, Allstar, Honeoye, Cavendish, AC Wendy, and AC Valley Sunset. Typical yields range from 5000 to 15,000 lb/acre, depending on many factors such as cultivar, the length of the fall flower bud initiation period, midwinter low temperatures, the length of time plants are protected from cold temperatures with straw mulch, incidence of spring frost, spring pollinator activity, and pest activity (Pritts and Handley, 1998) . Although Northeast cultivars are typically flavorful, hardy, and at least partially resistant to soil pathogens such as Phytophthora sp., Pythium sp., and Rhizoctonia sp. (Wing et al., 1994) , yields are low compared with cultivars grown in AHP and have not increased significantly for decades (Harbut et al., 2016) . Other regions of the country have moved away from PMR systems in favor of annual production systems that use freshly dug or plug plants set in fall, but Northeast growers have continued to use perennial systems because, in its variable and cold climate, PMR creates less risk (Hancock et al., 1997) . However, this strategy has limited growers to sell to local markets rather than distant wholesale markets that demand longer seasons and more fruit volume.\nTo increase yields and expand markets, Northeast growers must adopt some of the strategies used by growers in other regions, particularly methods that extend the season, reduce weed pressure, and maintain soil health. Whereas soil fumigation attempts to kill all of the potentially pathogenic organisms in the soil, improving soil health aims to enhance the physical, biological, and chemical properties of the soil so pathogens will not thrive in this microbiologically competitive environment (Moebius-Clune et al., 2016) . Maintaining healthy soil is usually considered a longer-term solution to managing soil pathogens than repeated fumigation.\nOne approach to increasing yields and extending the season is the use of day-neutral cultivars that can be planted in early spring and fruit through summer into fall. These cultivars can be overwintered to fruit again in the following spring. The first-year yield plus the second-year spring yield are usually larger than what PMR plantings produce during the first 2 years. Although several California day-neutral cultivars are being used by Northeast growers, Albion seems to be the best overall performer in the region, with excellent flavor development. Another challenge with growing 'Albion' involves overwintering it for a second fruiting year, because it is less hardy than standard short-day cultivars from Northeast breeding programs.\nThe first-year production of dayneutrals can be extended using low tunnels covered with wavelength selective plastics (Orde et al., 2018) . Coverings that reduce radiation and certain wavelengths of ultraviolet light help moderate temperatures, reduce disease, deter insect feeding, and improve the microclimate (Condori et al., 2017) . Interest in day-neutral low-tunnel production systems is growing throughout the Northeast.\nSome growers in the warmer regions of the Northeast use plug plants in AHP systems. Plugs have several advantages over bare-root plants; one advantage is their ability to be planted later in the summer at high density when runnering is considerably reduced (Durner et al., 2002) . Higher densities result in higher yields, and, with plastic mulch, less time is spent on weed management. PMR growers expend a significant amount of labor and materials managing weeds during the first year, much of which can be avoided by planting plugs later in the season. However, in more northern areas, plugs have to be set early (e.g., mid-August) to establish them before the onset of cold weather. Commercial plug producers do not have plants available that early, nor do they propagate the appropriate cold-hardy cultivars for the region. Opportunities exist for a plug producer to fill this niche for northern growers. Plugs might be especially useful for dayneutral strawberry growers located where early establishment is essential for good first-year production. Establishing plants in the fall could provide day-neutral plants with an earlier start on fruiting the following year, and perhaps higher total yield.\nAlthough fumigation is used in most other parts of the country to reduce pathogen loads between crops, in perennial strawberry systems, fumigation is correlated with increased root disease over time (Wing et al., 1995) ; therefore, it is not usually used. Although Northeast growers are likely to adopt several of the technologies used by growers in other regions, they are unlikely to adopt fumigation because of the increased production expense and negative impact on the environment. Fumigation eliminates almost all organisms from the soil. If pathogens are introduced to roots of transplants, then there is little competition, and these pathogens thrive. Within a short amount of time, they dominate the rhizosphere and cause reductions in yield that are greater than what a grower may experience without fumigation when the soil microflora remains diverse and abundant. Annual fumigation can help control pathogens, but this is not possible in perennial systems where pathogens can grow with little competition over several years. Therefore, assessing and improving soil health is being adopted as an alternative to soil fumigation (Moebius-Clune et al., 2016) .\nInterest in CEA of strawberry is developing in the Northeast, where fruit can be produced close to markets and transportation costs are low. Such systems often have reduced pest pressure; when pests do occur, biological controls are often effective. Water and fertilizer solutions are recycled and efficient LED lighting is used . The economic feasibility of such systems has not been demonstrated, but commercial-scale trials have begun in multiple locations.\nBreeding programs in the Northeast are expanding their selection criteria to include day-neutrality, adaptation to the nonfumigated ground, resistance to foliar diseases, and improved fruit quality (size, color, unique flavors). New tools for genomic selection and access to locally adapted wild germplasm [virginia strawberry (Fragaria virginiana)] should help accelerate the selection process.\nConsumers are becoming increasingly interested in knowing the origin of their food, and they are localizing the food system through their purchasing choices (Pirog et al., 2014) . Because 95% of the strawberries consumed in the Northeast are grown outside the region, and because of the large population and, therefore, markets, opportunities exist for growers to take advantage of the interest in locally produced food. Sixty million people live in the Northeast, thus comprising 18% of the U.S. population on 5% of the land area; therefore, markets are very accessible.\nStrawberry production in the Northeast has a bright future because fresh water and productive soils are available. Production technologies such as row covers, low and high tunnels, CEA, and use of mulch are helping growers manage extreme weather (Condori et al., 2017; Demchak, 2009; Kroggel and Kubota, 2016) . Labor availability continues to be a challenge; therefore, PYO operations will persist, and planted strawberry acreage will likely continue to be relatively small compared with the major production centers. Because other regions struggle with fumigation restrictions, weather extremes, labor restrictions, increasing land prices, and water availability and quality, the Northeast remains somewhat buffered, and strawberry growers should remain a contributor to local agricultural economies for years to come."}, {"section_title": "Region 7: South Atlantic United States (South Atlantic)", "text": "Outside of California and Florida, the South Atlantic is the most productive region for fresh market strawberries in the United States. The states included in this region include Alabama, Georgia, North Carolina, South Carolina, and Virginia (Table 4) . Collectively, this region produces 2342 acres of strawberry. The yield ranges from 10,500 to 19,000 lb/acre, with an average yield of 13,979 lb/acre and a total annual farm gate value of $47,158,000.\nThe majority of the fruit produced in these states is destined for the direct market. These markets include PYO, prepicked (usually sold on farms and at roadside stands), and wholesale. The five most popular ways to locally market fresh strawberries in North Carolina are PYO, ready-pick (prepicked) berries at the farm, roadside stands, satellite markets, and farmers markets (Poling, 2015) . In North Carolina, approximately half of the fruit is produced on a few large farms that produce a minimum of 10 acres of fruit. The remaining fruit is produced on small farms with 1 to 3 acres. Farmers markets are common outlets for sales in rural areas and near large urban and suburban areas throughout this region. There are small processing industries in some states (Georgia, North Carolina, and Virginia) that freeze whole fruit or produce jams and jellies. Local sales through CSA subscriptions are becoming another means of marketing prepicked berries to customers who pay up-front for a season's share of fresh farm produce (Poling, 2015) . The major production system in this region is AHP. Plants are set in the fall and fruit is produced in the following spring for %6 to 8 weeks. Other systems include PMR and tunnel production in a few locations. The PMR system is favored by some growers because it is less expensive and requires less frost protection in the spring, and it is most common in the mountainous regions of these states. Tunnels are used by a few growers in North Carolina and South Carolina because they allow for offseason late-fall/early-winter production, with fruit being produced until the end of December. 'Chandler' and 'Camarosa' have been the dominant cultivars for more than 25 years, with the majority of the growers planting 'Chandler' at their farms. However, 'Camarosa', has recently gained acreage and is now favored by many of the PYO growers who produce fruit in the warmer regions of each state. 'Chandler' is now second in terms of acres planted, even though it still the most reliable producer in the wide range of environments in this region (coastal plains to high mountain elevations). 'Sweet Charlie' is planted by a few growers who want early production, but they limit the amount to just enough plants to get customers to their farms. 'Camino Real' is favored by the wholesale growers because it ships well and produces high yields. 'Albion' is planted by growers who want to extend fruit production in the summer. 'Ruby June' is a new cultivar from a private breeding program that has the potential to fill an early harvest window for many states in this region.\nIt is expected that production will remain steady or grow moderately over the next decade. The demand for locally grown produce is driving the increase in acreage in many states of this region. Wholesale markets will remain strong as long as there is a demand for more locally produced fruit (i.e., not grown in California or Florida). Growers are trialing new cultivars from a number of breeding programs; this may lead to a wider selection of cultivars that are planted in the future. There is continued interest in season extension through the use of low and high tunnels and row covers, especially where produce can be sold at local markets (Gu et al., 2017) .\nThe early success of the industry in this region is due, in part, to the use of MB as a soil fumigant to control soil-borne pests. Although MB is no longer available, most growers still use chemical soil fumigation to control soil-borne pests. These chemicals are typically less effective than MB and require significant personal protection equipment and fumigant management plans. The use of sustainable practices to improve soil health as a part of conventional and organic systems has been encouraged (McWhirt et al., 2014) . However, growers using organic and sustainable production in the region have struggled to survive because of the lack of access to clean nursery stock, and they experience crop failures as a result of bringing infected plants to their fields.\nIn the early 2010s, strawberry growers in the Carolinas noticed an Table 4 . Current production in harvested acres, yield, and value of the strawberries in five states in the south Atlantic U.S. in 2017."}, {"section_title": "State", "text": "Area ( increased incidence of gray mold in their fields despite the use of recommended fungicides. Researchers found that there was resistance to one or more of the fungicides used to control grey mold (Fern andez-Ortuño et al., 2015) . Clemson University now has a fungicidal resistance profiling program; growers can send them tissue samples at the beginning of the growing season and within 1 week, they are provided with a report including site-specific disease management advice. The implementation of this disease management tool was estimated to prevent yield loss of %10% annually. Moreover, this program has been used to detect fungicide resistance in many other states in and outside of this region (Schnabel, 2015) . The future sustainability of this region's industry is dependent on the development of new cultivars that are adapted to the wide range of climates across the South Atlantic. For AHP, new short-day cultivars need to have consistent yields, improved flavor and postharvest shelf life, and a minimal chilling requirement (400-800 h). Cultivars developed by the University of Florida do not do well in the South Atlantic because they have little or no chilling requirement and will therefore produce flowers all winter, which are killed by the sublethal winter temperatures. Perpetual flowering or day-neutral types such as 'Albion' developed by UC have some merit, although the hot summers hamper the full yield potential in the region. The most critical component of the continued success of strawberry production in this region will be the development of cultivars that have tolerance or resistance to disease. Anthracnose diseases Colletotrichum acutatum and C. gloeosporioides cause anthracnose fruit rot and crown rot, which are highly destructive to both the strawberry plant nursery and the fruit production industry. These two diseases, although not the only problematic diseases, have consistently been identified as the most destructive pathosystems in this region (Howard et al., 1992; Peres et al., 2005; Poling, 2008; Rahman et al., 2013) .\nGrowers, no matter the size, have indicated that a shortage of labor is a persistent problem on their farms. Therefore, labor-saving technology such as the development of phone applications that help to predict when to apply pesticides and when to protect from frost and freezing events would be useful. Finally, perhaps the major threat to the entire U.S. strawberry industry each year is the introduction of plants with an array of disease problems ranging from anthracnose to viruses. There is a critical need for an integrated nursery system that can produce cleaner plants that are free of disease, not only for this region but for the entire United States."}, {"section_title": "Region 8: Florida", "text": "Florida is ranked second after California in U.S. strawberry production with 20% of the acreage and 9.6% of the value of used production in 2017. In 2017, 10,800 acres of strawberry were planted in Florida, resulting in a production value of $336,894,000 and placing strawberry production value second only to citrus (USDA, 2018a (USDA, , 2018b . The yield per acre is considerably lower in Florida (25,200 lb/acre) than in California (85,680 lb/acre) because the Florida crop is confined to winter months. Strawberry planting begins in September and is complete by mid-October [Florida Department of Agriculture and Consumer Services (FDACS), 2016]. Although the majority of the harvest occurs in February and March, harvest generally begins by mid-December and ends by mid-May (FDACS, 2016) .\nConventionally produced strawberry comprises the majority of the crop, which uses the AHP system. Beds are treated with a preplant soil fumigant such as 1,3-dichloropropene plus chloropicrin to manage plant-parasitic nematodes, soil-borne diseases, and weeds. Virtually impermeable and totally impermeable films are used to limit the size of buffer zones and to increase soil fumigant efficacy. Despite improved films, fumigant alternatives to MB have proven to be less effective for weed control; therefore, alternative options for weeds that are not well-controlled by alternative fumigants are needed (Yu and Boyd, 2017) .\nStrawberry transplants are sourced annually from nurseries located in Canada and California. Although the use of plug transplants has been increasing, freshly dug, bare-root transplants are still widely used due to greater affordability. Because of the impaired root systems typified by bare-root transplants and the high temperatures that result from the black plastic mulch used with the strawberry crop, growers routinely apply sprinkler irrigation for 10 to 12 d during establishment to moderate air temperatures to promote crown survival. Recommendations have been developed to reduce water use for bare-root transplant establishment by reducing the volume of sprinkler irrigation and foliar application of a kaolin clay suspension (Santos et al., 2012) .\nThe west central Florida industry is primarily wholesale because it provides much of the United States with berries during late fall and early winter. Outside of the main production area, farms are smaller, often grow organically, and are more likely to supply local markets and CSAs. In recent years, the Florida strawberry industry has been experiencing economic instability. Therefore, Guan et al., (2015) surveyed Florida strawberry growers to delineate what growers considered the primary challenges to the industry. The top five in order of declining importance were Mexican competition, government regulation, shortage of labor, volatile prices, and soil fumigation.\nA simulation of the effects of the expansion of Mexican strawberries imported into the United States confirmed the growers' impression that imported fruit is a critical constraint for U.S. strawberry production (Suh et al., 2017) . Additional increases in imports from Mexico are expected to further diminish profitability and adversely affect the economic sustainability of the U.S. industry. The greatest impact is likely to be in Florida because the industry in Mexico, like that in Florida, targets the winter market. Prices for Florida strawberry tend to be highest in December, when California production is at its lowest levels; however, prices decline rapidly through March as the Florida production and supply from Mexico increase (Wu et al., 2012) . A second major concern is that the Florida industry is largely dependent on migrant labor; this has been constrained by labor shortages resulting from immigrant workers staying at home due to more favorable job prospects and more stringent immigration regulations (Guan et al., 2015) .\nThe strawberry acreage in west central Florida is dominated by University of Florida cultivars. 'Florida Radiance' (Chandler et al., 2009 ) is the most commonly planted cultivar, with increasing acreage of Sweet Sensation Ò 'Florida127' in recent years (Whitaker et al., 2015) . Two recent releases, 'Florida Beauty' and 'Florida Brilliance', are early fruiting cultivars intended to capitalize on higher strawberry prices in the fall (Florida Foundation Seed Producers, 2017; Whitaker et al., 2017) .\nGreater emphases on branding to distinguish Florida-grown strawberry and on sweetness and flavor attributes are likely to win and retain consumers. Organic acreage is still a small percentage of production. The 2012 Census of agriculture indicated 242 Florida strawberry farms, but only 12 of those farms produced organic strawberry (USDA, 2014b (USDA, , 2016 . Organic strawberry production may offer improved economic stability due to more favorable premium prices for organic fruit.\nDevelopment of earlier flowering and fruiting cultivars with heatstress resistance and/or adoption of cultural practices that alleviate heat stress can be used to enhance early yields to take advantage of higher prices. Shifting to plug transplants can accommodate mechanical transplanting while eliminating the need for sprinkler irrigation during transplant establishment (Dash et al., 2017) and may attract water conservation incentives that can defray the difference in transplant costs. Mechanical transplanting along with the development of a mechanical harvester (Karst, 2018) will help to address much of the labor constraints currently impacting the Florida strawberry industry."}, {"section_title": "Controlled-environment production and indoor production", "text": "Substrate-based strawberry production under CEA (greenhouse, high tunnels) is a fast-growing sector in North America. North American CEA has been well-established with other crops such as tomato (Solanum lycopersicum), cucumber (Cucumis sativus), and leafy greens, and scientists have been working to apply CEA technology to off-season strawberry production (Cantliffe et al., 2007; Durner, 1999; Kroggel and Kubota, 2016; Takeda, 1999) . Recently, along with the increasing interest in local production, several greenhouse industries began to produce strawberry in controlled environments. Anecdotally, there are %40 acres of greenhouses for strawberry production in Canada. These Canadian greenhouses are typically modern glass greenhouses using raised troughs filled with coconut-coir-based substrates as the growing system. Standard greenhouse technologies such as integrated pest management and drip irrigation with precise management of nutrient and root zone pH and EC are applied to minimize the use of pesticides, water, and fertilizers. In California, in the regions with an optimum climate, so-called tabletop production systems (Van Delm et al., 2016) have been introduced. This is a similar type of substrate-based production system, but it was designed to be placed inside simple structures such as high tunnels.\nAnecdotally, a major strawberry producer based in California now has tabletops on more than 60 acres of their production area (with a possible total of %90 acres including other growers using tabletops). Typically, CEA growers prefer ever-bearing (or day-neutral) cultivars so that flower initiation is not totally depending on day length. Photoperiodic lighting (or night interruption lighting at a very low intensity of 1-2 mmolÁm -2 Ás -1 ) has been successfully used to promote the facultative long-day response of everbearing cultivars.\nThe commonly selected cultivars for greenhouses include Albion and Monterey because of their flavor, but it is premature to say that they are the most widely grown cultivars because some growers also use proprietary cultivars. The yield of Albion in a greenhouse was reported as 2 lb/ft 2 in Arizona over 6 months starting in late October through the end of April , which suggested a light-based fruit productivity rate of 2.1 gÁmol -1 of photosynthetically active radiation (PAR) . More productive cultivars could achieve %3 gÁmol -1 of PAR (C. Kubota and M. Kroggel, unpublished data), but fruit quality needs to be evaluated before introducing such cultivars. This cumulative PAR-based analysis of fruit productivity has been proposed as the base for evaluating electrical costs and the profit return of possible increased fruit production from supplemental lighting, so that the efficacy of supplemental lighting as well as sole source lighting using LED lights can be justified . In fact, several ventures have been experimenting with strawberry production in fully controlled environments inside warehouse-type structures (or vertical farms); however, electricity costs for lighting and cooling can be too high to be profitable. More research and development are needed before such indoor production systems are profitable.\nIn this new, capital-intensive sector of industrial strawberry production in controlled environments, some business failures at various levels might occur because strawberry has complex physiology, and there is limited relevant information to guide growers, for example, in cultivar selection and production methods. Therefore, more technologies and science-based information are needed to support sustainable growth of this new industry sector as it matures."}, {"section_title": "Future of the industry in the United States", "text": "The future of strawberry production will be dictated both by grower production needs and consumer demands for the fruit. The grower production needs are largely influenced by labor and immigration policies, access and restriction to fumigants and pesticides (herbicides and fungicides), and access to suitable land with adaptable soils and climate. After the loss of MB, the number of growers who have reduced the use of fumigants has increased. In those regions that rely on fumigants to control soilborne pests and weeds, there is increasing interest in alternative treatments such as ASD, biofumigating with mustard seed meal and other alternatives, crop rotation practices, and thermal treatments such as the use of steam, enhanced soil solarization, or hot water treatments (Samtani et al., 2011 (Samtani et al., , 2016 Shennan et al., 2018) . Until the economic viability of these alternative treatments is determined, growers facing pest pressures at their production sites will continue to use fumigation despite regulations. China's recent ban on imported recycled plastic (Brooks et al., 2018) and challenges associated with the disposal of field-used plastic could influence production costs and fumigation possibilities under plastic in the future. Biodegradable mulches may have a greater role in the future of strawberry production (DeVetter et al., 2017) .\nSmall farm acreage in urban and peri-urban areas is expected to increase to meet consumer demands. The ability to produce fruit on small acreages in diverse regions of the United States indicates the potential for small-scale production complementing the two primary production regions and satisfying increasing consumer demand of increased per capita consumption and growing population. Further distributing wholesale production outside of the two primary regions would reduce transportation distances from farm to market, thereby resulting in a corresponding reduction in transportation costs and increasing the berry shelf life for consumers while reducing loss through the distribution chain. Organic berry production is likely to increase in the future with increasing consumer demand and the consumer's willingness to pay a premium price for organically grown produce (Gliessman, 2012) . Grower emphasis will be on selecting cultivars and technologies that will favor year-round, high-quality, delicious strawberries to cater to the increasing consumer demand for locally grown, fresh foods. Challenges caused by fumigation, expensive land pricing, lack of access to land around an urban consumer base, unfavorable environmental conditions for strawberry production in open fields in certain regions, pest and disease challenges in the open field, labor shortage, and weather variability from season to season will prompt certain growers toward CEA. These growers are likely to be urban growers, venture capitalists, new growers, and those without access to land holdings. Automation and robotics to assist with the more labor-intensive tasks of planting, maintaining, and harvesting will be developed and used (Karst, 2018) . The use of CEA will expand both the regions and seasons of production, thus increasing consumer accessibility and reducing the use of pesticides and corresponding environmental impact."}]