[{"section_title": "Abstract", "text": "Recently, Mexican farming has shifted from a process of extensive ranching and exportation of live cattle to highly technical processes for exporting a higher quality of fresh and frozen meat. This production dynamic is reflected in the greater stake of livestock in the agri-food industry and the gross domestic product (GDP) of Mexico and its share of the United States (U.S.) market. This paper quantifies the effect of production dynamics in the domestic market and the competitiveness of fresh beef in the U.S. using the constant market share (CMS) and relative export advantage (REA) techniques. We identified a stable growth path without presenting a comparative advantage. Similarly, this dynamic has generated a substantial increase in the U.S. market share, which is generated by a growth in the target market and increased competition within the meat sector in Mexico.\nKeywords: livestock, beef, competitiveness, relative export advantage, constant market share.\nRecientemente la ganadería mexicana ha transitado de un proceso de ganadería extensiva y exportación de ganado en pie, hacia procesos tecnificados y orientados a la exportación de carne fresca y congelada de mejor calidad. Esta dinámica productiva se refleja en una mayor participación ganadera en el PIB agroalimentario de México y en su participación en el mercado estadounidense. El objetivo de este documento es cuantificar el efecto de la dinámica productiva en el mercado nacional y la competitividad de la carne fresca de res en Estados Unidos mediante la participación constante de mercado y la ventaja relativa de exportación. Encontramos una senda de crecimiento estable sin presentar aún ventaja relativa. De forma similar esta dinámica ha generado un incremento sustancial en la participación en el mercado estadounidense, generada por un crecimiento del mercado receptor y por la mayor competitividad del sector cárnico en México.\nPalabras clave: ganadería, carne de res, competitividad, ventaja relativa de exportación, participación constante de mercado."}, {"section_title": "Introduction", "text": "In 2012, the importation of 90,005 tons of fresh Mexican beef represented 12.08% of the total import of beef to the United States (U.S.). In 1994, the average importation  Universidad Autónoma de Baja California, Facultad de Economía y Relaciones Internacionales. Address: Ave. Universidad 14418, Otay Universidad, Tijuana, Baja California, México. Email: lic.ja.rios@gmail.com; licmlca@gmail.com of fresh meat was 1,152 tons with a 0.15% contribution to the U.S. market. These data indicate an average annual growth of 4.35% from 1994 to 2012, which rendered Mexico as the country with the largest trade dynamics for this product. The livestock contribution to the agroindustrial gross domestic product (GDP) has increased over the last ten years. In 2003, the livestock contribution represented 9.9%, which increased to 13.7% in 2012 due to the increased production of frozen and fresh meat and the competitiveness of new producers via intensive farming.\nThe success achieved by the livestock sector during this time period was marked by obstacles. During the 1994 crisis, the exchange rate served as a tariff by increasing the cost of food imports. This occurrence opened a window of opportunity for the domestic producer, who was unable to adapt with enthusiasm because the undercapitalization of the sector prevented a favorable reaction to this opportunity. The importation of beef for feedlot and slaughter in 1995 increased by 87%, which implied a 13% decrease in breeding stock and a 60% decrease in meat exports.\nConversely, livestock activities have achieved substantial increases in global and U.S. shares of beef since 1997 (Omaña et al., 2014) . From 2002 to 2008, the average annual growth in livestock production was 1.9% with a total contribution to the sector total of 24%. Compared with agricultural production, the livestock sector has steadily developed (Escalante and Catalan, 2008) . The recent success in the production and export of beef is linked to the strengthening of the country's competitiveness with regard to this product. New producers have made significant strides by extending the value chain and increasing their share in the distribution of livestock products via improved financing and marketing systems (Cavalloti, 2012) . The process of meat production has been linked to international methods of certification and standardization via the implementation of the Federal Inspection Type (TIF by its acronym in Spanish) meat processors, who permit penetration and expansion into international markets.\nGiven the production dynamics of the livestock sector, primarily in meat products, an exploration of this topic is worthwhile. Although numerous studies have addressed this issue, the majority of studies are descriptive and historical. This paper employs quantitative techniques to analytically address this issue. Given the importance of the U.S. market for Mexican exports of fresh beef, this study analyzes the market share and competition dynamics in this specific market using two techniques to measure the competitiveness of agricultural products: the relative export advantage (REA) and the constant market share (CMS) according to the Ahmadi-Esfahani methodology (1995). This paper is divided into five sections. Section one provides a brief review of the livestock sector in Mexico, historical aspects, and primary characteristics. Section two presents an overview of the production and international trade of fresh beef, primarily in the U.S. market. Section three explains the employed methodology, which is based on two measures -REA and CMS-which are indirect and complimentary. Sections four and five offer analyses of the results and the conclusions, respectively."}, {"section_title": "The livestock sector in Mexico", "text": ""}, {"section_title": "History", "text": "The expansion of cattle raising in Mexico from the mid-1950s to the early 1980s was based on feeding livestock via natural grazing, which favored an extensive model that accelerated the clearing of large areas. Grazing livestock for feedlots had two main markets: the export of calves to the U.S. and meat production for the domestic market. For decades, the supply to these markets was divided based on cattle-raising areas. The northern part of the country supported the sale of calves as its primary activity due to its ecosystem, the proximity of the U.S. market, and regulations. This support granted a form of exclusivity to the states of this region, whereas the tropical region entailed the domestic market (Chauvet, 1999) .\nThe livestock sector has undergone two stages and reached a turning point between 1995 and 1997. In the first stage, the most significant product by volume, value, and continuity comprised the export of calves at weaning. In addition, various meats in small volumes, such as fresh beef, frozen pork cuts, boneless poultry, and horse meat, were primarily exported to the U.S. The domestic market for beef lacked coordination among the different stages, from the first stage to distribution. Because the marketing process was exceedingly artisanal and fragmented, improvements and investments in production did not affect consumers in terms of quality and price. For example, cattle sales from breeders to feedlots were performed in heterogeneous batches, either directly or via an intermediary, without considering any classification by breed or weight (Chauvet, 1996) .\nRegarding the exportation of live cattle, insertion into the world market was gradual. In practice, it was integrated to the regional market as sales of Mexican cattle were executed in Border States, particularly Texas, where Mexican calves are suitable because a rapid fattening process is ensured once they are placed on U.S. soil. After the 1995 devaluation, however, this scenario changed. The change in parity served as a tariff, which increased the cost of food imports and opened a window of opportunity for the domestic producer, who could not be taken advantage of due to the undercapitalization of the sector. Cattle imports increased (both feedlot and slaughter) by 87% over 1994. Exports of beef from the United States decreased by 60% in volume and 63% in value. Livestock sales declined by 90% during the first seven months of 1995 when the price increased by 50% due to the devaluation effect (United States Department of Agriculture [USDA], 1995 and 1996) .\nWith the introduction of intensive farming and the proliferation of TIF slaughterhouses during the second stage, the sector began to experience a turnabout in the profitability situation. After trade liberalization, the cattle industry began to recover. In the past ten years, more dynamic and competitive enterprises have emerged with solid financing systems and greater integration into the world market, which has generated a greater degree of concentration in the sector. When comparing the results of the agricultural census of 1991 and 2007, a distinct decrease in the number of production units was observed. 1,131,272 (INEGI, 2007) . During this period, 321,973 units disappeared. The 1991 census reported that 72% of all production units of 20 cattle or less represented 27% of the country's livestock, whereas 0.2% of the economic entities with more than 500 head of cattle accounted for 12% of the national inventory.\nThe existing livestock production process has yielded interesting results. Table 1 shows the change in livestock industry share and temporal dynamics regarding products produced by the food and agriculture industry in Mexico from 2003 to 2012.\nA distinct finding in the current process of Mexican livestock industry is that its share in the agricultural sector has increased from 9.91% in 2003 to 13.72% in 2012. The changes in the livestock share of fresh and frozen meat are examples of the elevated production dynamics and the generation of greater value, at the expense of exports of live cattle shares. Escalante and Catalán (2008) , Carrera and Bustamante (2013) and Omaña et al. (2014) present evidence on the growth and progressive dynamics of the sector using productivity indicators, the REA, and the increasing global market share, which are a reflection of their competitiveness. The effect of the company SuKarne on the concentration and production dynamics of livestock exports should be considered. Between 1992 and 2006, the mean growth rate in cattle inventory, slaughter, and meat production were 26%, 19%, and 25%, respectively. In 2006, SuKarne slaughtered 400,000 heads of cattle, which is equivalent to 22% of the slaughters in TIF slaughterhouses nationwide. With respect to international trade, the company held 68% of the total exports of meat products, which encompassed 95% of Mexican exports to the U.S., 68% of exports to Japan, and 7% of exports to South Korea (Cavalloti, 2012) . The company slaughtered 735,000 cattle in 2010 and 1,058,000 cattle in 2012, which reflected the degree of concentration in production and trade (SuKarne, 2013)."}, {"section_title": "Characteristics", "text": "Beef is one of the most consumed meats in Mexico. It is obtained from taurine or zebu cattle (Bos taurus, Bos indicus), which are vertebrates, mammals, and ungulates. They are ruminant herbivores that are capable of digesting herbaceous plants, straw, fodder, and hay. The grains and fodder that are commonly employed to feed cattle include alfalfa, sorghum, corn, barley, silage, oats, and a variety of grasses. These animals survive in an extensive range of climates, including desert, tundra, and tropical forests. Approximately 30 varieties of breeds are employed for the production of meat, including Hereford, Charolais, Brahman, Nelore, Brown Swiss, Indobrazil, Gir, Beefmaster, Simmental, Limousin, Brangus, and Angus (Financiera Rural, 2012) .\nProduction systems are related to the climatic factors in the different regions. According to the Secretary of Agriculture, Livestock, Rural Development, Fisheries and Food (SAGARPA by its acronym in Spanish, n.d., May 20, 2013), cattle regions are classified into three regions: 1) arid and semi-arid, 2) temperate, and 3) wet and dry tropical. The arid and semi-arid region is composed of North Baja and South Baja in California, Sonora, Chihuahua, Coahuila, Nuevo León, Durango, Zacatecas, and part of Tamaulipas and San Luis Potosí. A predominance of pure European breeds, such as Hereford, Angus, and Charolais, is evident. The region is known for developed cow-calf systems and feedlots. They are almost exclusively dependent on grazing, and production is geared toward raising calves and heifers for exportation or feedlots, in which modern feed methods and technologies are primarily based on grains. These containment systems are technologically advanced and costly.\nThe temperate region includes Aguascalientes, Guanajuato, Hidalgo, Jalisco, Mexico, Michoacán, Oaxaca, Puebla, Querétaro, Tlaxcala, and the Federal District. A predominance of cattle crossed with European breeds exists in this region. Many of these land holdings are extensive and sustained by grazing during the rainy season.\nThe prevailing system consists of cow-calf for local consumption or feedlot. In this region, breeding, development, and fattening are performed using extensive systems.\nThe humid and dry tropical regions include Campeche, Colima, Chiapas, Guerrero, Morelos, Nayarit, Quintana Roo, Sinaloa, Tabasco, Veracruz, and Yucatán. A predominance of zebu breeds and their crosses with European breeds is observed. It is a natural area for providing calves for fattening and feedlots, as well as the supply of beef carcasses for the Federal District and the metropolitan area. The production of abundant grass in the region is attributed to the ecological character of the area, where dual-purpose cattle (meat and dairy) are produced. The average production per state and their share in domestic production are shown in Table 2 .\nThe major producing states include Veracruz, Jalisco, Chiapas, Chihuahua, and Baja, California. The average total meat production is 70% in 12 states. Baja, California, Sinaloa, Michoacán and San Luis Potosí have experienced sustained growth, whereas Jalisco and Tabasco have lost market shares. According to the Census of Agriculture, Livestock, and Forestry, 2007 (INEGI, 2007) , 1.13 million cattle production entities exist in Mexico: 10.3% are located in Veracruz, 7.7% are located in Chiapas, 7.4% are located in Oaxaca, 6.5% are located in Guerrero, 6.1% are located in the State of Mexico, 5.5% are located in Jalisco, and the remaining production occurs in other states of the country. The primary activity in approximately 60% of these units is the development or fattening of cattle.\nApproximately 30 million heads of beef cattle exist. Between eight and nine million cattle, whose average weight is 205 kg per head are annually slaughtered for meat production. Between 2005 and 2010, the production of beef livestock in Mexico increased at a mean annual rate of 2.8% until 3.3 million tons, valued at 59,251 million pesos, was attained in 2010. In 2011, this number increased to 3.4 million, which indicated an increase of 2.2% during the previous year and a value of 61,946 million pesos. Beef carcasses increased during the same period at an annual rate of 2.3% and increased to 1.74 million tons in 2010, with a value of 57,954 million pesos (Financiera Rural, 2012) . This type of meat experienced the second-highest annual growth in volume -sheep meat yielded the highest annual growth-for this period and the third-highest annual growth in value -poultry and sheep yielded the highest annual growth-which resulted in an average growth of 4.3% between 2005 and 2010. By 2011, production increased to 1.8 million tons, which entailed an increase of 3.1% over the previous year and a value of 60,761 million pesos. Beef is the second-highest produced domestic product -poultry yields the highest production-with a 30.5% share in total production of carcass meat and 35.3% of the total generated value. Similarly, it contributes 9.2% to the volume of produced food in the domestic livestock sector and 23% of the total livestock value. The production of beef is influenced by regional climatic conditions and exhibits high seasonality. The highest production volume occurs between October and December of each year, whereas the lowest production volume occurs during April (Financiera Rural, 2012) ."}, {"section_title": "International production and trade in beef", "text": "In recent years, global meat production has increased at a moderate pace due to changes in people's diets in favor of healthier diets based on chicken meat. In 1980 and 2011, the global share of beef was 33.3% and that of chicken and pork was 21%, with a production of 45.6 million tons and 62.5 million tons, respectively. Figure 1 shows the evolution of the three main meat products. Although the global beef market share has declined, the market remains dynamic. In some regions of the world, such as the U.S., consumption has increased, and the shares of other countries have changed. European shares were 30% of the global production in 1980; however, this number decreased to 17% in 2011. The reduction in European shares was conceded to Brazil and China, which account for 24.3% of the beef production. Mexico has experienced slow but steady growth, from 1.63% in 1980 to 2.88% in 2011, which indicates a relative increase in productivity. Table 3 shows the shares of major beef-producing countries.\nThe countries with the highest growth in meat production are China and Brazil; conversely, the European Union and Argentina have lost market share. Although the European market share has declined in terms of production, its share in terms of trade is inconsistent. In the case of China and Brazil, the former has geared its production almost exclusively toward the domestic market, whereas the latter has focused on the international market, as demonstrated by substantial growth in exports and a steady decline in the volume of imports. To analyze the case of Mexico, Figure 2 shows imports and exports for the 1988-2010 period per share of volume and value. The U.S. is the primary destination of the exports of live cattle and fresh boneless meat. In the case of fresh bone-in meat, exports are shared between the U.S. and Japan, whereas the majority of frozen meat is exported to Japan. The origin of the majority of imports is the U.S. (Secretary of Economy, 2013) . This relationship with the U.S. market requires further analysis regarding competition and market share. Figure 3 shows the share in the volume of exports of beef to the U.S., which demonstrates the competitive dynamics of this market. 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 Australia Canadá Nueva Zelanda México Brasil Nicaragua Uruguay Argentina Resto shares to other countries. Argentina has lost its share at an average annual rate of 9%. However, Mexico and Uruguay experience the highest rate of growth in the U.S. market share in recent years. Mexico declined from a 0.15% share in 1994 to a 12.08% share in 2012, which indicates an average decline of 30% per year, whereas Uruguay shifted from 0.34% to 3.05%.\nThe significant increase in Mexico's shares of beef imports from the U.S. emphasizes the relevance of the analysis of the competitiveness of these exports by explaining the REA and CMS, which will be discussed in the next section."}, {"section_title": "Methodology", "text": "To analyze the competitiveness of beef exports to the U.S. market, two indirect measures that provide an approximation of this product's export performance should be calculated. These measures include the REA index proposed by Vollrath (1989) and the CMS according to Ahmadi-Esfahani's methodology (1995) . The first measure is calculated for Mexico's case in the world and in the U.S. market. The second measure analyzes the shares and competitiveness in the U.S. market with Australia, Canada, New Zealand, Mexico, Brazil, Nicaragua, Uruguay, and Argentina as the main competitors from 1994-2012 with the annual data expressed in tons. Both indicators have been extensively applied in various studies, such as Contreras (1999) , Avendaño (2008) , and Race and Bustamante (2013), as a complementary manner to improve the export performance of the markets and individual products. The REA index is defined as\nwhere REAai is the relative advantage of exports of product a in country i; Xai is the value of exports of product a in country i; Xni is the value of total exports in country i, excluding product a; Xar is the value of total exports of product a in the world, excluding country i and Xnr is the value of total exports in the world, excluding product a and country i.\nThe CMS method explains the changes in exports for a product based on its structural and competitiveness components. This method, which was proposed by Leamer and Stern, was subsequently adapted to extend the analysis of export growth (Avendaño, 2008) . This paper applies the version prepared by Ahmadi-Esfahani (1995) , which decomposes the change in exports on two levels; the first level is decomposed by direct effects, and the second level is decomposed by the components of each effect.\nThe first level of decomposition is performed as The second level of decomposition is performed by obtaining six additional effects from the components described in the first level of decomposition using the following formula\nWhere St0ΔQj = Growth effect. Reflects the portion of increased exports due to increased global demand while the global market share for the exporting country remains constant.\n(Sj0ΔQj-St0ΔQj) = Market effect. Measures the additional changes in exports while the exporting country share in the target market remains constant. A positive value implies a concentration of exports to a given market. ΔStQj0 = Pure residual effect. Reflects the change in exports that would occur due to a change in the total competitiveness.\n(ΔSjQj0-ΔStQj0) = Residual static structural effect. Reflects the change in exports attributed to a change in competitiveness in a given market.\n(Qt1/Qt0-1) ΔSjQj0 = Pure second order effect. Measures the interaction between the change in an exporting country's share in the target market and the change in global demand, and\nReflects the interaction between changes in the exporting country's market share in the target market and the changes in demand in that market.\nS represents market share (percentage) of a specific country; Q is the export volume of the group of competing countries exporting to the reference market (the standard); Δ is the change in the variable over time; 0 is the beginning of the period; and 1 is the end of the period, such that S1=S0+ΔS. Similarly, St is equivalent to the market share of one country in the global market, and Qt is equivalent to the exports of a group of countries to the global market."}, {"section_title": "Analysis of the results", "text": "The results of the beef REA are presented in Figure 4 . It shows that Mexican beef does not have a comparative advantage in the U.S. market but does show a consistent upward trend, which indicates that it could be achieved in the near future. On the global level since 2005, a comparative advantage with indicator values greater than one is reflected. Although this indicator may vary with respect to the particular product and the market in which it is located, the trend is consistently upward toward strengthening the sector in both cases. Source: Created by the author with data from the USDA (n.d., June 2, 2013) and FAOSTAT (n.d., May 8, 2013 ).\nAn upward trend indicates that the livestock sector is becoming streamlined by decreasing exports of live cattle and an increase in the production and export of beef. With a herd of 23,200,000 million heads, the production of beef in 2008 was 1,666,655 tons, which is an increase in 267,000 since 1999 and also indicates an increase in slaughter operations. The latter is performed in municipal and TIF slaughterhouses, whose owners are large cattle ranchers who have made progress in integrating themselves into the value chain (Cavalloti, 2012) .\nAccording to information from SAGARPA (n.d., June 2, 2013), significant changes in the structure of slaughter operations occurred during the past decade, which significantly increased in TIF slaughterhouses but remained constant in municipal slaughterhouses. In 1999 and 2008, 31% and 48%, respectively, of slaughtering occurred in TIF slaughterhouses. Consumption increased by 208,000 tons during the same period but remained constant per capita consumption between 12 and13 kg. 50 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 REA world REA USA Table 4 lists the different effects that cause changes in market share in the U.S., which comprises the main market for Mexican fresh beef. After reviewing some of the causes for competitiveness, either by the increased use of TIF slaughterhouses, increased certifications, and greater business dynamics among livestock producers, the causes that determine the increase in market share should be analyzed. Source: Created by the author with data from the USDA (n.d., June 2, 2013). Table 4 lists the major exporters of beef to the U.S. From 1994-2012, Canada, Mexico, Nicaragua, and Uruguay exhibited positive results in terms of market share, whereas Argentina, Australia, Brazil and New Zealand showed negative results. Table 4 and Figure 4 confirm that Argentina and Australia's stake has gradually decreased since the beginning of the period. Argentina decreased from 4.4% in 1994 with 34,105.5 tons to less than 1.5% in 2012 with 10,265.5 tons. Australia decreased its share by 35.9% to 21.9% within the same period. Mexico and Uruguay gained market shares, with 12.08% and 3.05%, respectively. The main increase in market share was due to competitiveness based on the residual static structural effect and the pure secondorder effect. In the Argentine and Australian cases, the loss of shares was an effect of competitiveness. In all cases, the changes in market share were primarily attributed to competition in the U.S. market instead of total competitiveness.\nAlthough the Mexican livestock sector initially experienced substantial difficulties, it has gained competitiveness in the last 10 years. This apparent improvement in competitiveness was supported by increased dynamics in the U.S. market (residual static structural effect) and the participation of new livestock enterprises with technological developments in the production process and connections to the global certification sector.\nThe positive effect of the degree of concentration on the livestock industry is evident. It has achieved a greater degree of integration and scaling in the international value chain via enhanced marketing. It has been oriented toward a more technical production that ensures healthier products. In addition, the production structure and its regional supply channels have facilitated this growth. For example, the SuKarne Company (2013) maintains 15 production units according to their target markets. The markets in Northern Mexico are located in a traditional cattle region that has historically been integrated into the U.S. market. Particularly, the unit in Vista Hermosa Michoacán is located between the two large markets of Guadalajara and Mexico City. It has an installed capacity for holding 75,000 cows in inventory, which originate from the coast along the states of Michoacán, Jalisco, Chiapas, Oaxaca, Veracruz, and Tabasco.\nOnce the intermediation costs are eliminated, the benefits of integration are distinct. By managing economies of scale and diversification in production and markets, large profit margins can be obtained. The results reflect a substantial increase in the competitiveness of the sector and a relatively larger share in the U.S. market."}, {"section_title": "Conclusions", "text": "The evidence presented in this paper demonstrates distinct growth in the livestock sector, primarily fresh beef, which exhibits an increasing share in the U.S. market. The beef export sector in Mexico has gained productivity and productive concentration. The U.S. market has decreased due to changes in consumer's tastes and preferences for chicken and low-carbohydrate diets, which indicates that the change in market shares and growth is attributed to the competitiveness of the meat sector in Mexico. These results are consistent with the results obtained by Cavalloti (2012) , Carrera and Bustamante (2013) and Omaña et al. (2014) . Although these authors do not find a comparative advantage in the sector during the study period or in this context, the positive trend is consistent across all cases.\nThe growth and diversification of the livestock sector are distinct. The growth in the agri-food industry's market share remains constant for the entire study period, whereas the livestock sector has begun to diversify in terms of product type, particularly fresh meat exports for the U.S. market, and in terms of specialization in production regions. Best practices in financing and modernization of the sector have simultaneously enabled productive and competitive development by ensuring food safety and the expansion to the most demanding and highest paying markets.\nThe dynamics of the meat exporting companies, which included livestock export companies and beef producers who exclusively worked for the domestic market, have substantially changed since the twentieth century. The experience generated by this type of livestock enterprise serves as a distinct example for the primary sector. To obtain better competitive performance requires that enterprises become more integrated and scaled to the value chain, with new types of marketing and product processing techniques. These measures will aid their venture into more competitive markets, which will produce larger profit levels."}]