[{"section_title": "Abstract", "text": "While the link between thermoregulation and aging is generally accepted, much further research, reflection, and debate is required to elucidate the physiological and molecular pathways that generate the observed thermal-induced changes in lifespan. Our aim in this review is to present, discuss, and scrutinize the thermoregulatory mechanisms that are implicated in the aging process in endotherms and ectotherms. Our analysis demonstrates that low body temperature benefits lifespan in both endothermic and ectothermic organisms. Research in endotherms has delved deeper into the physiological and molecular mechanisms linking body temperature and longevity. While research in ectotherms has been steadily increasing during the past decades, further mechanistic work is required in order to fully elucidate the underlying phenomena. What is abundantly clear is that both endotherms and ectotherms have a specific temperature zone at which they function optimally. This zone is defended through both physiological and behavioral means and plays a major role on organismal senescence. That low body temperature may be beneficial for lifespan is contrary to conventional medical theory where reduced body temperature is usually considered as a sign of underlying pathology. Regardless, this phenomenon has been targeted by scientists with the expectation that advancements may compress morbidity, as well as lower disease and mortality risk. The available evidence suggests that lowered body temperature may prolong life span, yet finding the key to temperature regulation remains the problem. While we are still far from a complete understanding of the mechanisms linking body temperature and longevity, we are getting closer."}, {"section_title": "Introduction", "text": "The earliest scientific reference of centenarian longevity comes from the astronomer Hipparchus of Nicea who confirmed that Democritus of Abdera lived 109 y (c. 470/460 -c. 370/360 BC). 1 While such extended life spans appear relatively often nowadays, aging and longevity are among of the most rapidly advancing areas in biological research, with an ever-increasing number of physiological, molecular, pharmacological, and dietary factors being implicated in organismal senescence that may serve as targets for treatment. In this light, evidence-based research indicates that the rate of aging is mainly determined by genetics, environmental factors, and lifestyle choices. 2, 3 Interestingly, while a large number of gene variants are associated with aging, they explain a small fraction of hereditary longevity. 4, 5 Indeed, a number of studies have shown that only 23-33% of lifespan variation can be attributed to genetic factors, while the rest is determined by behavior and environmental factors (Fig. 1) . 2, [5] [6] [7] Therefore, it appears that the accumulation of molecular disorder that contributes to somatic deterioration is subject to considerable plasticity. Among the most important environmental factors known to affect longevity is body temperature (Tb) and the majority of the available evidence suggests that increased Tb leads to shorter lifespan. 3 However, while the link between thermoregulation and aging is generally accepted, much further research, reflection, and debate is required to elucidate the physiological and molecular pathways that generate the observed thermal-induced changes in lifespan. Our aim in this review is to present, discuss, and scrutinize the thermoregulatory mechanisms that are implicated in the aging process in endotherms and ectotherms. We hope that this comparative approach will aid our understanding of aging and longevity and will contribute toward future advancements that could compress morbidity and lower disease and mortality risk."}, {"section_title": "Aging, Physiology, and Functional Integrity", "text": "Aging encapsulates all time-induced phenomena occurring during an organism's lifespan. While the term 'aging' is often used to describe the accumulation of molecular disorder that contributes to somatic deterioration ( Fig. 1) , aging is not always associated with a decline in structural or functional integrity. For instance, aging in the first quarter (or more) of an organism's lifetime is associated with significant growth and marked improvements in a broad range of physiological functions. At the other end of the life span, aging in the final quarter (or more) of an organism's lifetime is associated with tissue damage and physical decline, usually linked with underlying pathologies and disease susceptibility (Fig. 1) . This latter form of aging will be the principal focus of the current review. Specifically, we present the available state of knowledge in endotherms and ectotherms regarding the link between thermoregulation and different physiological adaptations that lead to loss of functional capability and senescence."}, {"section_title": "Body Temperature and Longevity", "text": "In all organisms, Tb is affected by many factors and exerts pleiotropic effects that influence almost all bodily systems and organs. As such, its impact on aging and longevity has been difficult to isolate. Nevertheless, the effects of reduced Tb on health and longevity have been circulating since 1917 (reviewed in South et al., 1972) 8 , and it is now unanimously accepted that low Tb benefits lifespan. 3, [9] [10] [11] [12] For instance, men exhibiting Tb below the median demonstrated significantly higher survival rates over 25 y of follow-up in the Baltimore Longitudinal Study of Aging. 12 In mice, reducing Tb through genetic manipulation results in 20% increase in life span, 9 while male C57B1/6 mice (one of the most common inbred strain of laboratory mice) display a lower Tb and live longer than their female peers. 13 Similar results are also observed in ectotherms, where many organisms, including fish, butterflies, and C. elegans, demonstrate increased lifespan at low ambient temperatures. [14] [15] [16] [17] [18] Interestingly, the general understanding until recently was that Tb is an indicator of metabolic rate 19 and, therefore, it merely portrays the effect of altered metabolic rates on longevity. However, recent data revealed that thermosensory neurons involved in thermoregulatory behavior play a key role in determining lifespan. 17, 20, 21 This discovery brought forth the interesting view that thermal sensation serves as a vital input for organismal homeostasis in addition to its role in regulating behavioral and autonomic thermoregulation."}, {"section_title": "Endothermy and Longevity", "text": ""}, {"section_title": "Endothermic thermoregulation", "text": "The defining characteristic of endotherms is the maintenance of their internal environment at a metabolically favorable temperature achieved primarily through heat released by internal bodily functions (instead of almost complete dependence on ambient heat, as seen in ectotherms). This internal heat release originates primarily from routine metabolism since the fundamental chemical reactions generating ATP are highly inefficient. Indeed, dissipation of the electrochemical gradient produced when electrons are pumped across the mitochondrial inner membrane occurs not only by protons entering the mitochondrial matrix through ATP synthase (in a process that generates ATP) but also by protons bypassing the ATP synthase entrance and returning to the mitochondrial matrix through uncoupling agents (such as thyroxine and uncoupling protein 1). The latter process converts the energy of the electrochemical gradient to heat and represents approximately 70-95% of the energy released through substrate oxidation.\nUnder conditions of cold exposure or low metabolic activity, endotherms employ heat production mechanisms to maintain Tb at the desired level. These mechanisms include shivering (i.e., increased muscle metabolism leading to heat release as described above) and non-shivering (i.e., uncoupled oxidative metabolism in brown adipose tissue) thermogenesis. The latter depends entirely on the function of uncoupling protein 1, 22, 23 a mitochondrial inner membrane protein that is expressed exclusively in brown adipose tissue. 24, 25 The presence of uncoupling protein 1 in brown adipocytes provides an alternative biochemical pathway compared to the rest of eukaryotic cells, which results in the production of heat instead of ATP. Indeed, brown adipocytes express large amounts of uncoupling protein 1 which allows protons to bypass the ATP synthase entry and return to the mitochondrial matrix. Through this process, the energy of the electrochemical gradient is dissipated as heat. 22, 26, 27 In addition to heat production, endotherms employ also heat conservation (sympathetic cutaneous vasoconstriction and blood redistribution), heat loss (cholinergic cutaneous vasodilation and eccrine sweating), and behavioral thermoregulation (conscious decisions directly aiming at Tb regulation) mechanisms (Fig. 2) . These powerful mechanisms (reviewed in detail elsewhere) [28] [29] [30] [31] allow endotherms to maintain their internal environment at a metabolically favorable temperature."}, {"section_title": "Mechanisms linking low Tb and longevity in endotherms", "text": "The beneficial effects of low Tb on longevity are contrary to conventional medical theory where reduced Tb is usually considered as a sign of underlying pathology, particularly in the elderly. [32] [33] [34] [35] [36] [37] Nevertheless, studies in mice show that low Tb extends life span by exploiting metabolic pathways that are known to attenuate autoimmunity in old age. 38 Further contradicting common medical theory, reduced Tb has been shown to augment resistance to environmental stressors such as irradiation. 38, 39 In addition, low Tb has been shown to favorably influence immune function (reviewed in Walsh and Whitham, 2006) . 40 Specifically, core temperature reductions of 0.5 C 41 and 0.6 C 42 result in elevated natural killer cell activity, while further attenuation to 0.8 C in core temperature does not affect total leukocyte numbers, 43 and a 1 C core temperature drop during surgery leads to reduced lymphocyte proliferation and interleukin 2 production 24 and 48 hours post surgery. 44 More importantly, chronic reductions in Tb, have been shown to either benefit 45, 46 or not hamper 47 immune responsiveness. These results are in line with in vitro experiments showing that monocytes incubated for one hour at 34 C killed a greater number of E. coli compared with incubation for one hour at 37 C. 48 Chronic attenuation of Tb in mice via repeated cold exposure induces heat shock proteins in brown adipose tissue, with increased binding of heat shock transcription factors to DNA that may contribute to the development of cold tolerance. [49] [50] [51] The transcription of heat shock proteins is initiated by norepinephrine after binding to brown adipose tissue adrenergic receptors. In turn, the heat shock proteins facilitate the translocation and activity of the enzymes involved in heat generation and may interfere with the inflammatory response mediated by tumor necrosis factor a. 49, 50, 52 Therefore, it could be cautiously proposed that low Tb may lead to increased lifespan through beneficial effects on immune function. However, the link between low Tb and immune function is not completely understood, while the connections between inflammation and immune function with low Tb appear to depend on the severity of the stress imposed by the extent and duration of the cold exposure, as well as the acclimation level of the individual. [53] [54] [55] Indeed, cold exposure that is sufficiently severe to induce an unremitting stress leads to augmented cortisol production and, in turn, immunosuppressive response. 54 Therefore, while cold acclimation leads to suppressed cortisol response 53 and immune system activation, 45 the overall immune response to cold exposure appears to be context-dependent especially in non-acclimated individuals.\nIn a previous study we showed that being born during the colder seasons of the year is associated with increased birth weight, gestational age, and longevity, as well as with lower risk of fetal growth restriction, and premature birth. 56 In contrast, being born during the warmer seasons is negatively associated with birth weight, gestational age, and longevity. 56 These Figure 2 . The key avenues of heat exchange between the body and the environment that, ultimately, determine body temperature in endotherms and ectotherms.\nfindings are supported by European and African data showing that birth weight and longevity are positively associated with being born during the colder seasons but negatively associated with being born during the remaining periods of the year."}, {"section_title": "57-59", "text": "These data support the notion that the rate of aging may be affected by low Tb at critical periods of early development. It is well known that the fragile biochemical equilibrium of the mammalian intrauterine environment is significantly associated with environmental factors. [60] [61] [62] [63] [64] Therefore, it could be proposed that low Tb during pregnancy and early development may be linked to permanent structural, functional, and metabolic changes, which, in turn, can lead to physiological or metabolic 'programming' of the newborn with beneficial effects on longevity. One example of early-life programming that may be beneficial for long term health and longevity pertains to brown adipose tissue which is maximally recruited at birth in response to the cold challenge of the extra-uterine environment. 65 While the extent to which brown adipose tissue content and function during adulthood are affected by early-life factors remains to be established, the available data in mammals show that the physiology of this tissue during early life is dependent on the exposure of the offspring to the cool temperature challenge of the extrauterine environment. 66, 67 At this point, it is important to note that the aforementioned link between rate of aging and low Tb may, in fact, reflect differences in tissue perfusion (i.e., low tissue perfusion) and/or metabolism. Nevertheless, this contention remains to be explored by future studies.\nThe beneficial effects of low Tb on health outcomes and, in turn, longevity, may be explained, at least in part, by enhanced activity of uncoupling proteins. Uncoupling protein 1 is a transporter located in the inner mitochondrial membrane of brown adipose tissue. Its role is to enhance proton conductivity by uncoupling ATP production from substrate oxidation resulting in heat production when the animal is exposed to a cold environment (reviewed in Rial and Zardoya, 2009 ). 68 When maintained in a standard housing temperature (23 C), uncoupling protein 1 deficient mice develop an age-associated increase in diet-induced obesity. 69 Uncoupling protein 2 knock-out mice reveal increased prevalence for autoimmune diabetes characterized by increased macrophage infiltration of islets, enhanced interleukin 1b and nitric oxide production from macrophages, as well as augmented molecular damage induced by reactive oxygen species. 70 In humans, obesity has been genetically associated with attenuated uncoupling protein 1 gene expression caused by an uncoupling protein 1 promoter polymorphism. 71 Furthermore, acceleration of cellular respiration resulting from uncoupled oxidative phosphorylation for the purpose of heat release leads to attenuated production of reactive oxygen species (reviewed in Rial and Zardoya, 2009). 68 Consequently, uncoupling proteins have been recognized as key players in the antioxidant defense system of eukaryotes 68 and their activity may explain, at least in part, the improved health and increased longevity associated with a low Tb.\nBody mass represents the capacity of the body to store heat and it is linearly associated with Tb in most species. In humans, increased body mass 72, 73 and obesity 74 are associated with higher Tb independently of age. A reduction in white adipose tissue content in low Tb animals is a relevant consistency that has significant health implications. 3 For example, increased adiposity has been linked to high levels of inflammation which, in turn, have been associated with several chronic diseases. 75, 76 Moreover, it is worth noting that the link between Tb and obesity has been also assessed through environmental observations, demonstrating that continuous exposure to neutral or high ambient temperatures may partly contribute to the obesity epidemic. 77 Based on these findings, it could be argued that the inverse association between Tb and longevity may reflect, at least in part, the wellknown 78, 79 pathophysiological processes related to obesity. On the same topic, chronic low Tb is also known to result from caloric restriction. 80, 81 Some have argued, therefore, that part of the longevity conferred by Tb may be due to caloric restriction, or vice versa. 11 However, an elegant study by Conti and colleagues 9 has provided solid evidence that Tb has an independent role in determining lifespan. In that study, chronic low Tb in transgenic mice resulted in a 12% and 20% increase in median lifespan from birth, in male and female mice, respectively. Interestingly, these transgenic animals gained body mass during this study without a significant change in food intake, a finding that effectively dissociates the longevity effect of low Tb from that of caloric restriction. Nevertheless, the fact that low Tb may reflect, at least in part, the beneficial effects of caloric restriction on longevity cannot be ruled out. 9 The proposed mechanisms linking caloric restriction and Tb as well as their beneficial effects on longevity are illustrated in Figure 3 ."}, {"section_title": "Ectothermy and Longevity", "text": "Ectothermic thermoregulation While Tb in endotherms is mainly determined and controlled by cellular metabolism, 82 ectotherms regulate Tb mainly though behavioral mechanisms. 83 Thermoregulation in ectothermic organisms is a neuronal process and, interestingly, the pathways that link thermal stimuli to metabolic acclimation in ectotherms are comparable to those associated with thermoregulation in endotherms. Specifically, the afferent signals originated in thermosensory receptors are conducted through the dorsal horn of the medulla, reach the hypothalamus, and are translated as efferent sympathetic outflows that stimulate transcriptional regulators of metabolic processes and behavioral mechanisms to maintain a constant internal environment relative to external environmental variation. 82, [84] [85] [86] In some ectotherms, metabolism is also regulated at organ (e.g. cardiovascular modulation rates) and cellular (e.g., mitochondrial capacities) levels, and it is always subject to environmental temperature. 86 For example, short-term exposure to extremely high or low ambient temperature may alter the expression of heat shock genes, thereby protecting proteins from temperature-induced damage. 86, 87 Long-term exposures to extreme ambient temperature (e.g., acclimatization) may cause greater tolerance to subsequence thermal variation which can alter performance and affect fitness. [88] [89] [90] Many ectothermic organisms have developed the capacity for thermal acclimatization and can adjust their metabolism to tolerate extreme temperatures or seasonal variation. [91] [92] [93] For instance, some reptiles, including the Alligator mississipiensis, present acclimatization which, combined with maximized sun exposure, leads to higher Tb's in winter than in summer. 94 Ectotherms can maintain their Tb within a relatively narrow temperature range despite the temporal and geographic variation in the thermal habitats they occupy. 95 Nevertheless, Tb during inactivity and the amount of hours of activity exposed to a selected ambient temperature may vary due to constrains of the specific thermal environment. 96 Heat exchange with the environment occurs via radiation, convection, and conduction and varies in relation to body composition and size (Fig. 2) . 97, 98 For example, evaporative cooling in reptiles occurs via panting which minimizes dehydration. In amphibians, evaporative cooling can lead to dehydration if the access to water is not available. These mechanisms of heat exchange are illustrated in Figure 4 . With respect to body size, a higher surface to volume ratio translates into higher rates of heat exchange and, in amphibians, also generates higher rates of water loss. Most invertebrates, fish, anurans and reptiles present an inverse relationship between ambient temperature and body size (the \"temperature size rule,\" Atkinson, 1994; Atkinson & Sibly 1997) which is commonly associated to a higher survival in cold environments and lower predation risk (Ray, 1960 . Variation in body size in ectotherms determine differences in the total time of exposure (e.g., to predators, to solar radiation) and time of activity (e.g., foraging, mating) among populations that share the same preferred temperature and may result in variations in life-history traits such as aging and longevity. 99 Metabolic rate increases with activity time (e.g., pursuing prey and mating) together with an increase in energy utilization that is maximized at or near the peak Tb. [100] [101] [102] [103] [104] The utilized energy that is not expended will be allocated to reproduction, growth and storage. 96 Following maturity, a pronounced reallocation of energy from maintenance and growth to reproduction is observed; shaped by natural selection, the investments in each of these functions result in a broad variety of life history traits and phenology (e.g., age at maturity and longevity). 105 Ectothermic mechanisms linking low Tb and longevity Among ectotherms, variation in body size and life-history traits -such as age at maturity and longevity -are usually highly geographically variable and are heavily dependent on the local climate. [106] [107] [108] The effects of reduced Tb on ectotherm health and longevity have been circulating since 1917. 8 In poikilotherms, early studies showed that fish living in 15 C water lived significantly longer than fish living in 20 C water. 15 Similarly, Drosophila melanogaster was shown to live approximately twice as long at 21 C than at 27 C, 109 while the lifespan of C. elegans was increased by 75% by reducing temperature by 5 C. 110 In 1960, Ray 111 observed that plants and animals at low ambient temperatures grew slowly and delayed sexual maturation long enough to attain maturation at larger sizes than at high ambient temperatures. One probable explanation for these findings is that, since reproductive events are relatively less frequent in colder environments, larger body size would be favored by natural selection to enhance fecundity. On the other hand, in colder environments a larger body size at maturity is adaptive only if it coincides with a low survivorship of adults. 112 Finally, in colder environments larger females produce larger offspring or offer better parental care when mating with larger males. 113, 114 Living in hot regions and/or having longer activity seasons allow ectotherms to spend more time at high Tb and this usually results in fast growth and an early sexual maturity. 99, [115] [116] [117] [118] For example, growth rates of juvenile Lacerta vivipara, Sceloporus occidentalis, and S. graciosus increase with daily activity time due to high Tb via radiant heat, 104 ,119120 while maturity may be accelerated in laboratory animals that are maintained under optimal thermal conditions. 103, 121 These mechanisms can have different effects in individual animals within a species or population and further research will help us understand the relationships among temperature, growth rate and body size.\nGrowth rates and ages at metamorphosis, sexual maturation, and death in ectotherms are associated traits that depend on metabolic rate. 122 Due to their dependence on ambient temperature, ectotherms exhibit significant differences between the chronological and physiological growth and longevity. These are combined in different ways and applied in diverse environments and are, ultimately, linked to adaptive and evolutionary processes imposed by natural selection. 123 For instance, reproductive fitness is negatively affected when delayed maturity is associated with a short lifespan. 18, 112, 124 In ectotherms, especially in thermoconformers, cold and warm ambient temperatures attenuate and increase metabolic rate, respectively. Thermoregulatory ectotherms (e.g., lizards) may maintain a Tb within a narrow range but they are subjected to seasonal and daily variations that determine their hours of activity and affect their overall growth and lifespan. Therefore, populations of the same species may exhibit different growth rates and longevity when inhabiting or exposed to different environments. 18, 125 Nevertheless, the relationships between Tb and metabolic rate, as well as low Tb-increase in lifespan and high Tb-premature mortality, are commonly observed in ectotherms 17 and -to date -have been generally attributed to the link between Tb and metabolic rate. 20, 126 Different thermoregulatory mechanisms enable ectotherms to influence the effect of ambient temperature over their physiological processes (e.g., temperature-sensitive circadian mechanisms). 127, 128 Behavioral thermoregulation is the main mechanism by which ectotherms maintain their Tb as close as possible to an independently defined target range at which their performance tends to be maximal. [129] [130] [131] [132] [133] [134] Given that behavioral thermoregulation functions through conscious decisions, it can have a significant impact on lifespan. For instance, in lizards and fish, neurons in the preoptic hypothalamus function as feedback reflex that direct thermoregulatory behavior 135 encompassing changes of microhabitat, [136] [137] [138] [139] [140] [141] site and retreat selection, 134, [141] [142] [143] [144] shifts in activity hours, [100] [101] [102] [145] [146] [147] [148] variations in the frequency of exposure and duration of stays in full sun, [148] [149] [150] [151] as well as modifying posture. 140, 143, 152 Importantly, the most common thermoregulatory behavior consists in shuttling between sun and shade or hot and cold microenvironments. [153] [154] [155] For example, thermoregulatory diurnal lizards would maintain their Tb within the preferred range especially during the activity hours, basking in the sun until they reach near-critical high Tb and shuttling to the shade to retreat until achieving cooler Tb. 90, 130 Also, nocturnal geckos are active after sunset when ambient temperature is low but they retreat in refuge that will offer appropriate temperatures for optimal physiological functioning during the day. [156] [157] [158] These examples exemplify that, despite the obvious physiological benefits of thermoregulation for ectotherms, there are also many associated costs that ultimately affect aging and longevity. 101, 102, [159] [160] [161] For example, when shuttling from sun to shade a lizard spends energy for locomotion and the risk of being predated is increased, thus indirectly affecting lifespan. 116 Moreover, the necessity to thermoregulate may interfere not only in finding mates but also in foraging and acquiring the food required for growth. 161 Costs and physiological benefits are independent and may vary in different environments. The physiological optimal temperature of an organism corresponds usually to the tissue or cellular systems 162 and it is generally inferred from the animal's preferred temperature. However, the latter is not necessarily near the ecologically optimal temperature, which is more relevant when trying to understand the whole-animal system. 161, 16, 164 Thus, the maximal performance of ectotherms is affected by how distant its ecologically optimal temperature is from its operative temperature: whole-organismal activities, like healing and surviving rates, predation success, egg production, metabolic scope, reproductive output, individual growth and longevity, depend directly not only on the environmental temperature but also on the efficiency of the animal's thermoregulatory behavior.\nPhysiological adjustments associated with thermal regulation in ectothermic vertebrates, such as cutaneous losses of water, panting, salivation, and urination which are all considered evaporative cooling processes, have been described since the early 1940s 153, 165 but little is known about the thermoregulatory pathways that are involved in these processes as well as the way they may affect aging and longevity. Several studies have demonstrated similarities between mammalian and crocodilian afferent and efferent pathways (e.g., similar cardiovascular response to peripheral temperature variation). 166, 167 Cardiovascular responses in other reptiles have been reported as principally mediated by autonomic mechanisms in snakes, 168 countercurrent heat exchangers in desert lizards (Phrynosoma sp., and Holbrookia sp) 169 and marine turtles (Chelonia mydas, and Caretta caretta), 170 as well as stimulated locally by prostaglandins as well as nitric oxide in lizards (Pogona vitticeps) 94 and crocodiles (Crocodylus porosus). 171 At the cellular level, variations in mitochondrial capacity and density are observed within species that occupy broad territories and diverse thermal environments. 172, 173 This mechanism was also reported for several aquatic vertebrates like Anguilla Anguilla, 174 Champsocephalus esox and Eleginops maclovinus, 172 as well as Zoarces viviparus 175 and Fundulus heteroclitus 173 in response to changes in the thermal environment.\nIn the summer, the cellular capacity to oxidize piruvate and palmitoyl carnitine, associated with lower enzyme activities, in the red muscle of Oncorhynchus mykiss is reduced 176 and, consequently, reaction rates and mitochondrial capacity are maintained constant throughout the year despite the difference of 15 C in Tb found between summer and winter. 177 A complex network of sensory, neural, hormonal, and effector systems provide the means by which ectotherms sense and respond to environmental factors that may impose upon their thermal biology and longevity. 178 Experiments in the soil nematode Caenorhabditis elegans suggested that thermosensory neurons evolved in order to prevent lifespan reductions in warm environments by means of inhibiting thermosensory neurons through mutations or laser ablation. 20 At high ambient temperatures the amphid neurons with finger-like ciliated endings promote the transcription of the daf-9 gene, responsible for increasing the production of steroid hormone. The activation of the steroid signaling pathway blocks the activity of the DAF-12 nuclear hormone receptor and, thus, contributes to the observed anti-aging effects. 17 Another example is the positive effect of corticosterone on metabolic rate and Tb. In stressful situations the hypothalamus-pituitary-adrenal axis is activated and corticosterone is secreted in the blood stream, which promotes behavioral and physiological processes associated with survival mechanisms (e.g., appetite, cardiovascular functions). 179, 180 In some reptiles, this hormone is also found in the plasma in benign environments, yet the reasons for this phenomenon remain unclear. 181 In the New Zealand common gecko, Hoplodactylus maculatus, the variation in non-stress-induced corticosterone is correlated with the variation in Tb. 182, 183 Similar corticosterone-Tb correlations were found in green turtles (Chelonia mydas), 184 in male tautara (Sphenodon punctatus), 185 and in the marine iguana (Amblyrhynchus cristatus). 186 Geckos implanted with corticosterone would consume oxygen at a rate of 50% higher that the placebo geckos, display heat-seeking behaviors, present a higher Tb in their terraria and selected higher ambient temperature when in thermal gradients. 187 This mechanism might be of significance for the survival and lifespan of ectotherms inhabiting non stable environments with ample thermal daily and seasonal variations. 187 In the last decade, studies focusing on specific thermoregulatory mechanisms and innate factors that may be directly associated with longevity in ectotherms have flourished, yet many of the interactions between the physiological and ecological processes involved remain unclear.\nThermal plasticity and the efficiency of thermoregulation through physiological and behavioral mechanisms may compensate for environmental extreme conditions that could affect growth, aging and longevity, and subsequently fitness. Natural selection may favor changes in the physiology that determine the efficiency with which resources are assimilated and used for growth, therefore, promoting faster growth through thermal specialization. 188 To date, our knowledge on the interaction of these factors within the populations of ectothermic vertebrates remains limited and encourages us to pursue ways to further understand the natural framework in which the temperature-size relationships have evolved."}, {"section_title": "Comparative Remarks", "text": "The mechanisms through which thermoregulation may be implicated in the aging process in endotherms and ectotherms are illustrated in Figure 5 . In endotherms, low Tb has been shown to extend life span by augmenting resistance to environmental stressors 38, 39 and by exploiting metabolic pathways that are known to attenuate autoimmunity in old age. 38 In addition, low Tb has been shown to favorably influence immune function, 40 but this link is not completely understood, while the connections between inflammation and/or immune function with low Tb appear to depend on the severity of the stress imposed as well as the acclimation level of the individual. [53] [54] [55] The beneficial effects of low Tb may be also exerted during pregnancy and early development which are known to generate structural, functional, and metabolic changes in adult life. 56 One example of early-life programming that may be beneficial for long-term health and longevity pertains to brown adipose tissue which is maximally recruited at birth in response to the cold challenge of the extra-uterine environment. 65 While the link between early life Tb and later life brown adipose tissue function requires further research, enhanced activity of uncoupling proteins (particularly uncoupling protein 1 that is expressed in brown adipose tissue) are known to attenuate production of reactive oxygen species which, in turn, benefit longevity. 68 Finally, increased body mass 72, 73 and obesity 74 are associated with higher Tb independently of age, while reduced white adipose tissue content in low Tb animals is a relevant consistency that has significant life-prolonging implications. 3 Among ectotherms, variation in body size and life-history traits -such as age at maturity and longevity -are usually highly geographically variable and are heavily dependent on local climate. [106] [107] [108] Ectothermic plants and animals at low ambient temperatures grow slowly and delay sexual maturation long enough to attain maturation at larger sizes than at high ambient temperatures. 111 Moreover, larger body size is favored by natural selection to enhance fecundity. 111 On the other hand, living in hot regions and/or having longer activity seasons allow ectotherms to spend more time at high Tb and this generally results in fast growth and an early sexual maturity. 99, [115] [116] [117] [118] These processes as well as the relationships between temperature and metabolic rate, low temperature-increase in lifespan and high temperaturepremature mortality are generally attributed to the link between Tb and metabolic rate. 17, 20, 122, 126 Another link between thermoregulation and aging in ectotherms relates to the fact that behavioral thermoregulation functions through conscious decisions that, ultimately, affect aging and longevity. 101, 102, [159] [160] [161] For example, when shuttling from sun to shade a lizard spends energy for locomotion and the risk of being predated is increased, thus indirectly affecting lifespan. 116 In this light, the maximal performance of ectotherms is affected by how distant its ecologically optimal temperature is from its operative temperature: whole-organismal activities including healing and surviving rates, predation success, egg production, metabolic scope, reproductive output, individual growth and longevity, depend directly not only on the environmental temperature but also on the efficiency of the animal's thermoregulatory behavior. Finally, recent studies in C. elegans showed that the sensation of heat via thermosensory neurons may affect lifespan. This suggests that thermal sensation serves as a vital input for organismal homeostasis, in addition to its role in regulating behavioral and autonomic thermoregulation."}, {"section_title": "Concluding Remarks", "text": "Our aim in this review is to present, discuss, and scrutinize the thermoregulatory mechanisms that are implicated in the aging process in endotherms and ectotherms. Our analysis demonstrates that low Tb benefits lifespan in both endothermic 3,9-13 and ectothermic [14] [15] [16] [17] [18] organisms. Research in endotherms has delved deeper into the physiological and Figure 5 . The mechanisms through which thermoregulation may be implicated in the aging process in endotherms (A) and ectotherms (B). molecular mechanisms linking Tb and longevity. Our knowledge on the physiological and molecular pathways linking Tb and longevity in ectotherms has been steadily increasing during the past decades, yet further mechanistic work is required in order to fully elucidate the underlying phenomena. What is abundantly clear is that both endotherms and ectotherms have a specific temperature zone at which they function optimally. 18, [189] [190] [191] [192] This zone is defended through both physiological 166, 167, 193, 194 and behavioral [135] [136] [137] [138] [139] [140] [141] 195, 196 means and plays a major role on organismal senescence. 3, 17, 20, 21 That low Tb may be beneficial for lifespan is contrary to conventional medical theory where reduced Tb is usually considered as a sign of underlying pathology. [32] [33] [34] [35] [36] [37] Regardless, this phenomenon has been targeted by scientists with the expectation that advancements may compress morbidity, as well as lower disease and mortality risk. In his 1978 article 10 in Geriatrics, Saul Kent wrote that \"it is possible that lowered body temperature may prolong the human life span; finding the key to temperature regulation remains the problem, but the search is on.\" Thirty-seven years later we are still far from a complete understanding of the mechanisms linking Tb and longevity, but we are getting closer."}, {"section_title": "Disclosure of Potential Conflicts of Interest", "text": "No potential conflicts of interest were disclosed. "}, {"section_title": "About the Authors", "text": ""}]