[{"section_title": "Abstract", "text": "Prekindergarten programs are expanding rapidly, but to date, evidence on their effects is quite limited. Using rich data from Early Childhood Longitudinal Study, we estimate the effects of prekindergarten on children's school readiness. We find that prekindergarten increases reading and mathematics skills at school entry, but also increases behavioral problems and reduces self-control.\nFurthermore, the effects of prekindergarten on skills largely dissipate by the spring of first grade, although the behavioral effects do not. Finally, effects differ depending on children's family background and subsequent schooling, with the largest and most lasting academic gains for disadvantaged children and those attending schools with low levels of academic instruction."}, {"section_title": "", "text": ". Since 1990, overall state funding for prekindergarten has increased 250% to approximately $1.9 million (Education Week, 2002) . In 2000, a total of 39 states had prekindergarten initiatives, although fewer --Connecticut, Georgia, Illinois, Kentucky, Massachusetts, Ohio, and Oklahoma -had made substantial per capita investments Ripple et al., 1999; Education Week, 2002) .\n1 Local school districts also invest in prekindergarten programs independently, although the bulk of this money comes from federal funding streams (Smith et al., 2003) .\nEvidence of effects of prekindergarten on school readiness and subsequent educational performance is quite limited. We know that model early education programs promote academic skills, but know much less about typical programs. Data are particularly lacking for prekindergarten programs. This paper begins to fill this gap by addressing three specific questions. First, does prekindergarten increase school readiness at kindergarten entry, as assessed by reading and mathematics skills, and behavioral problems? Second, do any effects of prekindergarten attendance at the time of school entry persist over time, or do they quickly dissipate? Third, do the effects differ depending on children's family background or characteristics of subsequent schooling?\nWe use data from the newly available Early Childhood Longitudinal StudyKindergarten Class of 1998-99 (ECLS-K), a large, nationally representative sample of children who entered kindergarten in the fall of 1998. The ECLS-K collects data on school performance and a rich array of family background, school, and other control variables, including early education and child care experiences. Data are available currently through the spring of 2000, when most children are completing first grade. The outcomes we examine are reading and math skills, and classroom self-control and aggression. We assess school readiness using data from the fall of kindergarten, and the persistence of effects with information from the spring of first grade.\nA significant challenge is to adequately control for differential selection into early education programs. For example, favorable selection, whereby parents whose children attend prekindergarten possess characteristics resulting in high levels of school performance, would result in a spurious positive correlation between preschool enrollment and later outcomes. Our primary econometric strategy is to use the detailed information available in the ECLS-K to measure many potential confounding factors. We also estimate models that instrument prekindergarten attendance with state expenditures on these programs.\nOur main results are as follows. 1) Prekindergarten significantly increases math and reading performance at school entry -effect sizes range from 0.10 to 0.13 in the preferred models. 2) Prekindergarten attendance increases aggression and decreases self-control (with effect sizes of 0.09-0.12). 3) Other types of center-based child care have positive effects on academic outcomes and negative effects on behavior, although in both cases these are smaller than for prekindergarten. 4) For most children, the cognitive benefits of prekindergarten quickly fade, but the behavioral effects persist. 5) However, there are more lasting cognitive gains for disadvantaged children and for those experiencing minimal levels of instruction in the early school years. This last finding suggests that further expansions of prekindergarten should be mainly focused on children who are disadvantaged or who will go on to attend low instruction schools."}, {"section_title": "Prior Research", "text": "The benefits from high-quality intensive early education interventions are well documented and include short-term improvements in cognitive and language development as well as long-term increases in academic achievement and reductions in special education placement and grade retention (see Barnett, 1995; Currie, 2000; Karoly et al., 1998; BrooksGunn, 2000; Farran, 2000; Ramey and Ramey, 2000; Vandell and Wolfe 2000; Waldfogel, 2002) . However, we know much less about the effects of more typical preschool or prekindergarten programs (Gilliam and Zigler, 2001) . Lacking experiments, researchers have used naturally occurring variation in families' use of child care arrangements to assess the effects. Unfortunately, these analyses often include only a few controls for potential selection factors, raising the possibility that the resulting associations are spurious rather than causal (Blau, 2001; Currie, in press ). Methodological concerns notwithstanding, the bulk of evidence suggests that center-based care during the third and fourth year of life promotes academic outcomes at school entry (Barnett, 1995; Gilliam and Zigler, 2001; NICHD ECCRN, 2002b; NICHD ECCRN and Duncan, 2003) ."}, {"section_title": "2", "text": "Many of the advantages bestowed by early education fade by the time children are in their second or third year of formal schooling (Barnett, 1995) , as children not attending early education programs catch up to those who did. In response, some researchers suggest that subsequent schooling experiences are key to understanding whether early education program effects persist, but exactly how later schooling matters is unclear (Takinishi and DeLeon, 1994) .\nOne possibility is that children without early education who experience high levels of academic 2 The Head Start program has also been extensively studied with non-experimental research designs. However, selection bias is a major problem, given the disadvantaged nature of the Head Start population. Studies most successfully addressing this issue tend to find the most positive and long-lasting academic benefits (e.g. Currie and Thomas, 1995; Garces et. al. 2001). instruction in the first years of school catch up to their peers more quickly than those who experience lower levels of instruction. However, other scholars speculate that \"skills beget skills\" and therefore children entering elementary school with a higher level of academic skills may be uniquely poised to gain from subsequent instruction (Carneiro and Heckman, in press ).\nAlthough cognitive outcomes have tended to receive most attention in the economics literature, school readiness and later school success also depend on behavior adjustment (RimmKaufman et al., 1998; Shonkoff and Phillips, 2000) . When teachers are asked to describe the key components of school readiness, positive behavior including enthusiasm, cooperation, following directions, and not disrupting the class are rated as more important than knowing specific skills such as letters of the alphabet or counting numbers (Lewit and Baker, 1995) . Furthermore, high levels of aggressive behavior and low-levels of self-control predict lower academic achievement, although whether these associations are causal remains controversial (Alexander, Entwisle, and Dauber, 1993; Hinshaw, 1992) .\nNon-experimental evidence indicates that early and extensive non-maternal child care, particularly center-based care, is associated with higher levels of behavior problems in school (see review in Belsky, 2001; NICHD ECCRN, 2003) . However, evidence is mixed as to whether attending center-based care or early education programs during the year or two prior to school entry has detrimental effects on behavior.\n3 Particular types of early education programs may contribute to behavior problems. Stipek and colleagues (1998) found that early education programs with teacher-directed basic skill instruction had negative social climates, measured by teachers' warmth and nurturance and 3 For example, an experimental evaluation of the Perry Preschool program, a model program serving 3 and 4 year olds, indicated that the program had no effect on school misbehavior (Schweinhart, Barnes, and Weikart, 1993) . However, non-experimental studies have found that children in center-based care for a larger proportion of the year prior to kindergarten had higher levels of problem behavior in kindergarten (Bates et al., 1994) .\nfrequency of rewarding positive behavior rather than disciplining negative behavior.\nFurthermore, attending a preschool or kindergarten with a basic-skills emphasis was associated with having higher levels of problem behavior, compared to attending programs with lower levels of basic skill instruction and more child-directed learning approaches. Because this study relied on naturally occurring variation in early education experiences, it was unable to determine whether classrooms that combined basic skills instruction with a positive social climate are associated with behavior problems. However, Stipek and colleagues (1998) suggest that model programs, such as Perry Preschool, may not have detrimental effects because the caregivers are able to provide basic skills education while fostering positive social environments.\nTaken together, the prior literature suggests that early education may increase children's academic skills but also children's misbehavior. However, prior research has been limited because most experimental studies have been based on model programs serving small nonrepresentative samples. In contrast, larger and more representative studies have generally used naturally occurring variation in children's experiences, but have typically included only a few covariates in analyses, and consequently have not adequately addressed the selection biases that may pervade non-experimental designs (Duncan and Gibson, 2000) .\nMoreover, nearly all studies have combined all types of early education programs into one category even though the effects may differ depending on the quality and emphasis of the programs. With the exception of Head Start, few studies have considered whether specific types of preschool programs are more or less beneficial than other early education programs. Childstaff ratios, class sizes, and caregiver education and pay are important determinants of the quality of care (NICHD, 2002a; Phillips, Mekos, Scarr, McCartney, and Abbott-Shim, 2001) , and data on these indicators suggest that school-based prekindergarten provides relatively high quality care (Ripple et al., 1999; Smith et al., 2003) ."}, {"section_title": "4", "text": "Only one previous study has analyzed prekindergarten programs as distinct from other types of preschool or center-based care. Using data from the ECLS-K, Magnuson and colleagues (in press) provide evidence that prekindergarten programs may confer larger academic benefits than other center-based programs, with particularly large gains for disadvantaged children.\nHowever, the effects on behavioral outcomes were not considered, and concerns about bias due to the differential selection of children into prekindergarten programs were not thoroughly addressed.\nThis study addresses five limitations of prior research. First, we examine the effects of different types of early education programs using a large and nationally representative sample.\nSecond, we consider the impacts on behavior problems as well as academic skills. Third, we are able to better deal with selection effects due to the extensive array of child, family background, school, and classroom characteristics included in our data set, and by using IV methods to test the robustness of the findings. Fourth, we analyze whether the differences observed at school entry persist over time or fade out. Fifth, we evaluate whether the impacts differ as a result of the child's family background or the type of academic instruction received during kindergarten and first grade."}, {"section_title": "Data", "text": "Data are from the Early Childhood Longitudinal Study, Kindergarten Cohort of 1998-99\n(ECLS-K), a nationally representative sample of children attending kindergarten in the fall of 1998. Designed and carried out by the U.S. Department of Education, the ECLS-K collected data over children's first two years of school. We use information from the fall of 1998 (kindergarten) and spring of 2000 (for most children, first grade). The ECLS-K includes academic assessments, child, parent, teachers and school administrator surveys, and observational ratings of school environments. Our sample consists of 9,547 children entering kindergarten (for the first time) in the fall of 1998. 5 This sample size reflects the exclusion of 3,555 children in the fall of kindergarten for whom information on child care/early education or one of the outcomes was missing. 6 Similarly, 4,651 children for whom data was not collected in the spring of first grade were dropped from the sample. This large number of exclusions partially reflects planned attrition (only half the children changing schools after the fall of kindergarten were retained in the study), as well as lower completion rates among children followed after changing schools (64 % compared with 95 % for non-movers). "}, {"section_title": "Outcomes", "text": "During the fall of kindergarten and the spring of first grade, children's math and reading skills were assessed during one-on-one testing sessions. 8 The assessments were created especially for the ECLS-K by a team of experts, with some items adapted from existing instruments. The reading test assessed knowledge of letters and word recognition, beginning and 5 The ECLS-K had high completion rates with close to 90% of children and teachers, and 85% of parents participating in the study in the fall of kindergarten, and non-response did not differ by child or family characteristics, with the exception that parents of Asian children were slightly less likely to complete parent interviews, due to language barriers (National Center for Education Statistics, 2001). 6 About 30% of those who were excluded in the fall of kindergarten were non-English speaking, and therefore were not administered reading assessments. Just over 50% were missing parent report data and an additional 676 were excluded because they were repeating kindergarten in 1998, or because data for this measure was missing. We also excluded children with missing outcome data in the spring of kindergarten (N=268) and 44 children because the sizes of missing data cells were too small to be included in our first stage IV analyses. Robustness checks performed by adding these children back to the sample did not substantively change any of the results. 7 Overall completion rates were high among those children who were followed through the spring of first grade, with 92% of child assessments, 86% of parent interviews, and 83% teacher interviews completed (National Center for Education Statistics, 2002 A potential concern is that we are not able to determine how parents distinguish between different types of programs, with misclassification seeming most likely for preschool and prekindergarten. Our presumption is that programs that parents identify as prekindergarten correspond to either school-based programs or publicly funded state prekindergarten initiatives, and are thus more explicitly educational than other types of center-based care. 14 One reassuring piece of evidence is that the 17% prekindergarten enrollment rate for this sample is close to the 14% national estimate recently obtained by Smith et al. (2003) . Any classification errors seem likely to attenuate the parameter estimates, such that the regression results probably understate the true effects."}, {"section_title": "Additional Explanatory Variables", "text": "Most of the regressions contain exhaustive controls for child, family background, and neighborhood characteristics, exploiting the rich information contained in the ECLS-K. Our goal is to include covariates that either directly affect child outcomes or proxy unobserved characteristics. Thus, most models control for demographic and family characteristics such as race/ethnicity, age, health status at birth, height, weight, and gender, the household income-toneeds ratio, parental education, region of the country, family structure and size, and language spoken in the home. Appendix Table 1 provides details on all of the covariates.\nAlso incorporated as covariates are measures of the child's home environment created from parent survey data collected in the fall and spring of kindergarten. 15 These include a diverse set of home and family resources and parenting practices that may be related to early child care, education experiences, academic skills, and behaviors. The learning environment is proxied by a range of activities such as reading books and singing songs, children's participation in structured activities outside of the home, their use of home computers, and the number of books in the home. There are also indicators of the parent's expectations of the child's educational attainment and attitudes about the importance of particular skills, controls for the family members'\n14 Although parents with children in private school kindergarten disproportionately report prekindergarten attendance, separate analyses of these children yielded similar results for academic outcomes as those reported. However, for this subsample, preschool did not appear to have any negative effects on children's behavior problems. 15 Parent surveys were primarily conducted with mothers. If the child's mother was unable to complete the interview, another knowledgeable adult in the household did so.\ninvolvement in the child's schooling, parental responses to questions about the warmth and affection of the relationship with their child, the frequency of physical discipline, a composite measure of the parent's depressive symptoms, and several variables measuring the regularity of the family routines (like eating meals together)."}, {"section_title": "16", "text": "To proxy the effects of neighborhood and state characteristics, we included a neighborhood quality composite index (constructed from parent responses to questions about the prevalence of crime, abandoned buildings, drugs, and safe places for children to play in the neighborhood), as well as state level measures of the log of per capita income and public spending on public welfare and education programs in 1998. Data for these state variables are taken from US Bureau of the Census (2001).\nData on one or more background characteristics are lacking for some children. 17 To retain these cases, the relevant regressors are set to zero and dummy variables created to denote the presence of missing values. For example, for children missing data on parental reports of birth weight, the two low birthweight variables were recoded to have a value of zero, and a dummy variable indicating missing data on birthweight was created.\nTo measure children's exposure to academic instruction, we combine two items from teacher surveys conducted in the fall of kindergarten and spring of first grade about how much time children spend working on projects or lessons about math and reading. We categorized classes that spent an hour or less combined on reading and math skills as \"minimal\" instruction 16 Because most family characteristics are measured during kindergarten, they could be influenced by prekindergarten (or other preschool) attendance. In most cases, this problem is likely to be minor (e.g. parents are unlikely to base meal routines on the availability of prekindergarten). However, some components of the home learning environment could be shaped by the early education experiences. For instance, parents may be instructed by prekindergarten teachers to frequently read to their children or receive information about the availability of structured activities such as art classes. If so, the inclusion of these covariates may absorb a portion of the effect of prekindergarten (or preschool), resulting in biased estimates. Generally, this seems likely to lead us to understate any positive effects of prekindergarten, but over estimate any negative effects. 17 Rates of missing data are quite low, below 2% for most child and family characteristics.\nclassrooms. About 12% of children were in minimal instruction classrooms in kindergarten and about 1% in first grade.\nFinally, we estimated a series of instrumental variables (IV) models, using a measure of access to state prekindergarten as an instrument. To estimate the proportion of poor children under five with access to a publicly funded prekindergarten, we divided a state's prekindergarten spending by the number of poor children under 5 (since most states target prekindergarten programs to economically disadvantaged children) and calculated this as a fraction of the average cost of center-based care for four-year-olds. 18 This share ranges from 0 to 0.33."}, {"section_title": "Methods", "text": "Conceptually, we can think of outcomes for child i in state j (O ij ) as being \"produced\" by a series of inputs such as the non-market \"leisure\" time of parents, purchased inputs like educational resources provided in the home, and nonparental child care provided prior to school entry. We do not attempt to determine the structural parameters of this child production function. Instead, most models estimate the reduced-form association between experiences in the year prior to kindergarten and early school outcomes, after controlling for a comprehensive set of explanatory variables.\nThe basic regression equation is:\nOutcomes are measured in the fall of kindergarten and spring of the first grade. PRE is a dummy variable for prekindergarten attendance. X is a set of child, family, and neighborhood characteristics, and S is vector of state characteristics. Because schools were the primary 18 Information on state prekindergarten spending and the cost of center-based care was taken from Blank et al. (1999) ; estimates of the number of poor children under age 5 were from US Census Bureau (2003) .\nsampling unit in the survey, in all analyses we correct the standard errors for non-independence of observations within schools.\nBecause equation 1 does not include controls for types of care other than prekindergarten, β captures the difference in outcomes between children who attended prekindergarten and those experiencing any other type of care (including parental care). However, we also estimate models that add controls for preschool, Head Start, and other non-parental care. These analyses estimate the effects of prekindergarten and other forms of nonparental care, relative to children experiencing only parental care.\nOne strategy in our analysis is to include a sufficiently rich set of covariates that the error term in (1) is orthogonal to O ij . However, a potential concern is that even our extensive set of controls may not fully account for the selection into prekindergarten. For this reason, we also present results for instrumental variable (IV) estimates, where the level of state spending on prekindergarten programs (adjusted for the number of children in poverty and the cost of care) instruments prekindergarten enrollment. The first-stage equations for this analysis is:\nBecause PREK ij is dichotomous, (2) is estimated as a probit model. The second stage is then estimated by OLS, using Huber-White estimation to correct standard errors for the clustering of data at the school level, and additional corrections for the two-stage estimation process (Murphy and Topel, 1985) . 19 As detailed below, state prekindergarten expenditures predict attendance quite well and are likely to be a satisfactory instrument. 19 The IV standard errors are not corrected for the fact that the spending variable takes the same value for all children in a given state. Doing so would probably increase the standard errors. We have not undertaken this correction since we are primarily using the IV models to detect the direction of any remaining bias in the OLS estimates, rather than to estimate the magnitudes of the effects from the IV regressions. Ideally, we would have also included other types of care in our IV models. However, we did not do so because it is more difficult to find good instruments for other types of child care (e.g., preschool). We did consider using federal spending on child subsidies Table 2 presents results from regressions of children's academic and behavioral outcomes in the fall of kindergarten on prekindergarten attendance, with increasing levels of controls for potential selection effects. As in Table 1 , absent other controls, model (1) shows that as additional instruments. However, child care funding across states is based on a formula that is largely determined by the number of low-income children within a state (identified by the number of children who qualify for free and reduced lunch), a state's prior level of spending on child care for welfare recipients, and their ability to match and draw down federal funds (Gish, 2002) . Consequently, variation across states in the proportion of publicly funded slots available to low income children is much smaller than for prekindergarten funding, and much more likely to be driven by error in measuring either the number of poor children or the cost of care per child."}, {"section_title": "Descriptive Statistics", "text": "prekindergarten is positively and strongly associated with reading and mathematics skills --children enrolled in prekindergarten have reading scores 3.17 points higher than other children.\nAs shown in models (2) through (4), the addition of covariates reduces the prekindergarten effects by 60 percent, most of which is due to the inclusion of demographic characteristics.\nWe focus below on the results of the most comprehensive specification (model 4), because this model includes controls for many family and neighborhood conditions and is likely to best account for potential selection factors. In this case, prekindergarten attendance predicts a statistically significant 1.26 higher reading score and 0.93 higher math scores, corresponding to an effect size of 0.13 and 0.09 respectively. This represents about one more question answered correctly, and effects of this size would move the average child from the 50 th to the 55 th percentile for reading and from the 50 th to the 54 th percentile for math. 21 The large number of covariates included and small changes in estimated effects observed with the addition of more controls (beyond the basic demographic variables) increase our confidence that these estimates may represent causal effects, rather than remaining heterogeneity. We use IV models in the following section to further test this assumption.\nBy contrast, teachers report that children who attended prekindergarten exhibit statistically significantly more externalizing (aggressive) behavior than their counterparts and insignificantly lower levels of self-control (Table 2 , model 1). The addition of covariates has virtually no effect on the estimates for externalizing behavior (effect sizes are 0.12 in all four models) and slightly increases the negative associations with self-control -to an effect size of -0.09 (Table 4 model 4). Effects of these magnitudes imply that prekindergarten is predicted to 21 Percentile changes were calculated by converting the standardized scores into percentile scores using the cumulative distribution function (cdf), determining the corresponding position in the cdf, and then adding the estimated effect size of prekindergarten. The resulting value was translated back into a percentile using the cdf.\nraise children from the median to the 55 th percentile of externalizing behavior, and lower them to the 46 th percentile of self-control."}, {"section_title": "22", "text": ""}, {"section_title": "IV Estimates", "text": "The OLS estimates, discussed above, suggest that prekindergarten has positive effects on academic outcomes, but negative effects on classroom behavior. We have included an exceptionally rich set of controls for potential confounding factors, increasing our confidence that these results may indicate causal relationships. Nevertheless, it is possible that some sources of selection bias remain, even after including the exhaustive set of covariates. We address this possibility by conducting a set of instrumental variables (IV) estimates.\nIn the late 1990s, spending on prekindergarten varied greatly across states, and we take advantage of this by using state spending as an instrument for prekindergarten participation. It is plausible that access to state-funded programs will predict prekindergarten enrollment and have no independent effect on child outcomes (other than through its effect on 22 One concern about using teacher reported outcomes is that children who attended kindergarten may be selected into different classrooms than other children. A solution is to estimate teacher-fixed effect regressions, which compares children who attended prekindergarten with children in their classrooms who did not. Results from such analyses are somewhat smaller but consistent with the OLS findings -prekindergarten effects from teacher fixedeffects models are about 0.80 for reading, 0.73 for math, -0.66 for self-control, and 0.88 for externalizing behavior. Very similar results are obtained from models with school fixed-effects. 23 We use funding during the 1998-1999 school year because data are unavailable for 1997-1998, the year these children would have attended prekindergarten programs. enrollment). 24 Results from the first stage indicate that state spending significantly predicts children's participation -the probit estimates indicate that a 10 percentage point increase in the number of available slots in a state increases the probability of prekindergarten attendance by a highly significant 2.5 percentage points, from the base rate of 17%. The Chi-square statistic for the test of the instrument's significance is 25.4, well above the recommended guideline of 10 (Bound, Jaeger, and Baker, 1995) .\nResults from the second stage are presented in Table 3 . For comparison purposes, the first row repeats the OLS effects obtained in model 2 of Table 2 . The IV estimates are always in the same direction as but much larger than the corresponding OLS effects. For example, the IV model suggests an effect size of prekindergarten on reading of 0.73, compared to an OLS effect size of 0.13. For externalizing behavior, the IV estimates predict a prekindergarten effect size of .71, whereas the OLS effect size is .12. In all cases, the predicted effects are much larger for the IV estimates than for the OLS estimates. Our conclusion is that these results provide no indication that the OLS results are biased upwards.\nA potential concern with using spending as an instrument is that states that invest money in prekindergarten may also invest in other programs that benefit children. If so, the instrument could be correlated with the regression error term leading to biased IV estimates. Both the OLS and IV estimates shown in Table 3 include controls for two state characteristics--per capita income and per capita spending on education and public welfare. We tested the sensitivity of our IV estimates to the inclusion of other state policies and characteristics, by estimating alternative specifications with additional measures of state level policies and characteristics including proxies for generosity of the welfare system (TANF benefit levels and rules, Medicaid spending) 24 State spending for prekindergarten programs is a state policy decision and is unlikely to be linked to the characteristics of children and families within a state, and so may be exogenous. and the state's political climate (e.g., the percent of representatives in the House and Senate that are Democrats, percent of state population that is female, elderly, or black). Our findings were robust to these specification changes."}, {"section_title": "25", "text": ""}, {"section_title": "Prekindergarten Versus Other Preschool Child Care Arrangements", "text": "Like prekindergarten, preschools and many center-based child care programs provide curriculums designed to promote academic skills and enhance school readiness. However, because structural indicators, such as levels of teacher education, suggest that prekindergarten programs are typically of higher quality, we expect that other early education programs will have positive effects on achievement, but that the benefits may be smaller. It is less clear how the other types of early child care and education will be related to behavior. Although high quality care is associated with lower levels of problem behavior (Peisner-Feinberg et al., 2001) , there may be features of prekindergarten, such as teacher directed basic skill instruction, that are associated with less positive social climates and thus more behavior problems. We expect Head\nStart to have less positive effects on academics and more detrimental effects on behavior outcomes because the quality of Head Start centers varies greatly and is often quite poor, partly due to low levels of funding.\nThe top panel of Table 4 displays the findings of models that include measures of participation for prekindergarten, preschool, Head Start, and other non-parental care (e.g., babysitters or relative care), with children receiving only parental care as the reference group.\nThe results support a \"dose-response\" model. For all academic outcomes, prekindergarten is predicted to yield consistently larger benefits than preschool. For instance, prekindergarten's effect size for reading is 0.19 and for math is 0.17. Preschool's effects are about 0.12 for both reading and math.\nWe also find a dose-response pattern for classroom behavior but, in this case, with prekindergarten having larger adverse effects than other types of center-based care. The effect size of prekindergarten is -0.13 for self-control and 0.19 for externalizing behavior as compared with -0.06 and 0.13 respectively for other types of preschool."}, {"section_title": "26", "text": "Head Start enrollment is associated with higher levels of externalizing behavior and possibly lower levels of self-control, but is less strongly related to academic outcomes, whereas care in non-center-based settings has no effect on academic skills, but may be associated with lower levels of problem behaviors."}, {"section_title": "Do the Effects of Prekindergarten Persist?", "text": "The OLS and IV results indicate that prekindergarten boosts children's reading and math scores, but also increases classroom misbehavior during the fall of kindergarten. However, prior research has found that early academic advantages associated with preschool fade over time, lasting only through one or two years of elementary school (Barnett, 1995) . The extent to which the effects fade out over time may have important policy implications since the case for using public funds to invest in early education is likely to be weakened if the academic gains are only temporary, rather than lasting.\nWe address this issue in the lower panel of Table 4 , by presenting estimates for academic and behavior outcomes measured in the spring of the first grade (2000). Compared to the kindergarten fall results (displayed in the top panel), the positive effects of prekindergarten on academic outcomes have largely dissipated -effect sizes are 0.04 for reading and 0.05 for math, which is only one-third to one-fourth as large as those obtained in the fall of kindergarten. In contrast, the negative effects of prekindergarten on classroom behavior persist and actually have increased in size by the spring of first grade -effect sizes are -0.14 for self-control and 0.23 for externalizing behavior."}, {"section_title": "27", "text": "Children attending early education programs prior to kindergarten are 4 to 6 times more likely than their counterparts to be in center-based care before or after school in kindergarten and first grade. 28 To test whether this accounts for some of the previously observed negative effects on behavior, we estimated models that added covariates for attending center based care in kindergarten and first grade. Doing so reduced the effect size of prekindergarten from 0.23 to 0.20 for externalizing behavior, and from -0.14 to -0.12 for self-control, suggesting that the adverse effects of early education programs on behavior persist, but do not increase over time."}, {"section_title": "29", "text": "These results ---that prekindergarten raises academic achievement (although possibly only temporarily) while having persistent negative effects on classroom behavior --raise the question as to whether prekindergarten does more harm than good. Although we cannot definitively answer this question, we do note all three types of formal education are associated with lower probabilities that the child will be held back in kindergarten, although with such a small share (3%) of children being retained, the estimates are small and statistically insignificant."}, {"section_title": "Does School Instruction Influence the Persistence of Effects?", "text": "27 Effects of this magnitude would raise the average first-grader's position in the externalizing distribution from the 50 th percentile to the 56 th and lower the child from the 50 th to the 44 th percentile in the self-control distribution. Negative effects on children's behavior are still apparent for Head Start. 28 The rates of center-based care in kindergarten, by type of care children were in the prior year, are as follows: prekindergarten 29%; preschool 29%; Head Start 5%; Other non-parental care 10%; Parental care 5%. In the spring of first grade: prekindergarten 25%; preschool 22%; Head Start 9%; Other non-parental care 12%; Parental care 7%. 29 Coefficients for center-based care in kindergarten and first grade indicate large negative effects on behavior. For instance, the effect sizes of center-based care on externalizing behavior are 1.40 in kindergarten and 1.65 in first grade.\nResearchers have suggested that the effects of preschool fade because children without prior early educational experiences \"catch up\" to their peers when they enter formal schooling."}, {"section_title": "30", "text": "This suggests that the persistence of prekindergarten effects may vary with the amount of instruction received in subsequent schooling, with smaller and perhaps less persistent effects of early education found for children in classrooms with greater amounts of academic instruction.\nWe consider this possibility by examining a subsample of children who are in minimal instruction classrooms during the fall of kindergarten and the spring of first grade (n=1,240)."}, {"section_title": "31", "text": "The results of this analysis, presented in Table 6 , suggest that prekindergarten (and to a lesser extent preschool) has larger and more persistent effects on academic outcomes for students in low instruction classrooms than other children. For example, the effect size of prekindergarten on reading is 0.46 at school entry and 0.25 in the spring of first grade, compared to 0.19 and 0.04 for all children.\n32 On average children were scoring at the 50 th percentile in reading in these classrooms, and attending prekindergarten would raise their score to the 68 th percentile at school entry and the 60 th percentile by the spring of first grade. Moreover, in contrast to the full sample, prekindergarten is associated with large reductions in grade retention in kindergarten, with substantial benefits also observed for preschool and Head Start. However, given that we have not modeled children's selection into classrooms, we note that these results should be interpreted with caution.\nSmaller differences are observed for classroom behavior. Predicted effects of prekindergarten on externalizing behaviors are larger for children in low instruction classrooms 30 Consistent with this, we find slightly larger effects of preschool and prekindergarten for children tested earlier in the school year (e.g. prekindergarten effect sizes for math are 0.19 for children tested in October and 0.15 for those tested in November). Interestingly, this pattern does not hold for children's classroom behavior. For example, effect sizes of prekindergarten on externalizing behavior are 0.20 in both October and November. 31 Minimal instruction is defined as spending less than an hour a day combined on reading and math instruction. 32 Analyses with interaction terms for low instruction by prekindergarten indicate that the effects on reading and math at school entry and reading at spring of first grade are significantly different for children in low instruction classrooms compared to children in classrooms with greater amounts of academic instruction.\nthan for the general population both at school entry (effect sizes of 0.27 vs. 0.19) and in the spring of first grade (0.28 vs. 0.23) but insignificantly lower for self control in the fall of kindergarten (-0.10 vs. -0.13) and identical in the spring of first grade (-0.14 vs. -0.14)\nIn summary, these results provide some indication that early education may have longer lasting effects for children provided with little academic instruction in the first years of school.\nHowever, the fact that these effects are larger even in the fall of kindergarten suggests that selection into these types of classrooms may also be a factor."}, {"section_title": "Disadvantaged Children", "text": "Prior studies have suggested that early education programs have larger effects for economically disadvantaged populations, primarily because these children come from homes with lower quality learning environments (Karoly et al., 1998; Peisner-Feinberg et al., 2001; Waldfogel, 2002) . Next, we consider this issue, employing two definitions of economic disadvantage. The first defines disadvantage broadly, including children in poverty (income-toneeds ratio of less than one) or whose mother or father who did not complete high school. The second definition is more narrow, children whose parent reported receiving welfare during the fall or spring of kindergarten. 33 Table 6 summarizes the results of analyses with these subsamples.\nAs expected, the estimated effects of prekindergarten and preschool on academic outcomes are slightly larger for disadvantaged children than the general population. For example, the effect size of prekindergarten on reading scores at school entry is 0.28 for disadvantaged children (see Table 6 ), compared to 0.19 for the full sample (Table 2) . To put this in perspective, the average disadvantaged child (in poverty or with an uneducated parent) scored at the 33 rd percentile in reading; attending prekindergarten would raise their predicted performance to the 44 th percentile. The effects of prekindergarten on disadvantaged children's academic outcomes also last longer. By spring of the first grade, the effect sizes for the two disadvantaged groups are 0.20 and 0.23 for math, and 0.09 and 0.21 for reading; these compare with small and non-significant effect sizes for the general population (Table 5) ."}, {"section_title": "34", "text": "Prekindergarten does not have consistently larger negative behavioral effects at school entry for disadvantaged children than for the full sample -effect sizes on externalizing behavior are 0.25 for children in poverty or with less-educated parents and 0.15 for children of welfare recipients, compared with 0.19 for the general population. However, prekindergarten's detrimental effects on externalizing behavior increase over time, for both groups of disadvantaged children, such that the effect sizes range from 0.36 to 0.42 by the spring of the first grade, as compared with 0.23 for all children (Table 5) . 35 On average, children in poverty or with less-educated parents are in the 55 th percentile of the externalizing behavior distribution; attending prekindergarten is predicted to raise their score to the 69 th percentile. Once again, however, prekindergarten does not appear to increase the probability that a child will repeat kindergarten, and in one case reduces this probability."}, {"section_title": "Discussion & Policy Implications", "text": "Using new data from the ECLS-K, this analysis suggests that prekindergarten increases school readiness, as measured by math and reading skills at kindergarten entry, but is also associated with an increase in classroom behavior problems. The effect sizes for the academic 34 Analyses with an interaction term for disadvantage by prekindergarten attendance indicate that the effects were significantly larger for both groups of disadvantaged children for one outcome-math in first grade spring. In addition, prekindergarten's beneficial effects on being held back were significantly larger for children from welfare families. 35 The effect sizes for prekindergarten fall modestly when controls are added for subsequent center-based care in the fall of kindergarten and spring of first grade.\noutcomes, compared to children cared for only by parents prior to kindergarten, are 0.19 for reading and 0.17 for math, which would move the average child from the 50 th to the 55 th and 54 th percentiles respectively. Attending (a nonprekindergarten) preschool has similar, but smaller effects (effect sizes of about 0.12 for both outcomes). Conversely, prekindergarten and other preschool attendance are predicted to raise externalizing behavior problems (the effect sizes are 0.19 and 0.13) and reduce self-control (effect sizes are -0.13 and -0.06). We tested for potential bias in the OLS estimates by conducting a series of IV models using state spending on prekindergarten to instrument attendance. The results suggest that, if anything, the OLS models understate the positive effects on academic skills and negative impact on behavior.\nThe second major finding is that, for most children, 70 to 80 percent of the cognitive gains associated with attending prekindergarten have faded out by the spring of the first grade (leaving effect sizes of 0.04 and 0.05 for reading and math). In contrast, the correlation with problem behaviors persists over time, suggesting that the early socialization of aggressive behavior and self control may uniquely influence children's later behavior, and that exposure to subsequent formal schooling does not lead to the same levels of aggressive behavior. By the spring of first grade, prekindergarten's effect sizes are about -0.14 for self-control and 0.23 for externalizing behavior. Children attending preschool or prekindergarten are also more likely to attend center-based care during the first two years of formal schooling, which has additional negative effects on children's behavior. Analyses that control for children's experiences of center-based care during kindergarten and first grade indicate that prekindergarten's and preschool's negative behavioral effects persist, but do not increase over time.\nTwo qualifications are important to understanding the observed negative effects on children's behavior. First, classroom behavior is not necessarily indicative of behavior in other settings, so children attending prekindergarten might not exhibit higher levels of aggression at home. Second, in this study, absolute levels of aggressive behavior were typically quite low, and levels of self-control quite high, even for children who attended prekindergarten.\nWhy might prekindergarten have larger effects on academic outcomes, but also behavior problems, than other forms of child care? As noted, prekindergarten programs usually have relatively high quality, as indicated by structural characteristics of the classrooms such as teacher education and pay, and probably are more academically oriented, which bodes well for children's reading and math skills. However, structured instruction may also cause greater levels of behavior problems if the emphasis on basic skills leads to a less positive social climate in which children receive less individual attention and more punitive discipline (Stipek et al., 1998) .\nThe average effects of prekindergarten and preschool mask considerable heterogeneity among subgroups of children. First, the impacts tend to be larger and longer lasting for children receiving minimal amounts of instruction in kindergarten or first grade. When children who did not attend early education programs are exposed to academic instruction in kindergarten, generally they quickly \"catch up\" to those who did. However, when children are exposed to only minimal levels of instruction in kindergarten or first grade, the gap between children who have and have not attended early education programs is larger, and persists through the spring of first grade. Classrooms with low levels of academic instruction appear to be slightly more prevalent in schools that serve advantaged children. For example, in this study, classrooms with minimal instruction have lower than average proportions of minority and poor children. If schools with relatively high shares of disadvantaged children provide high levels of basic skills instruction, this may explain why some studies have noted that effects are more likely to fade among disadvantaged children Thomas, 1995, 2000) .\nSecond, the initial benefits of prekindergarten and preschool are much larger for disadvantaged children (with effect sizes of 0.27 for reading and 0.19 to 0.36 for math in the fall of kindergarten). These effects also decline less over time than for the full sample, with the result that effect sizes by the spring of first grade were still substantial, in the range of 0.08-0.21\nfor reading and 0.20-0.24 for math. However, the effects of prekindergarten on behavioral problems initially are not larger for disadvantaged children than for the full sample, but are more persistent -resulting in effect sizes of 0.36 to 0.46 in the spring of first grade. Yet, we find no evidence that these behavior problems increase grade retention.\nWhy might children from disadvantaged backgrounds benefit the most from participating in early education programs? One explanation is that they are less likely to experience home environments that facilitate early learning (Bradley, Corwyn, McAdoo, and Garcia Coll, 2001 ).\nFor example, on average they have fewer books at home, spend less time reading with their parents, and have less stimulating verbal interactions with them than children from middle-class households (Linver, Brooks-Gunn, and Kohen, 2002) . Attending a prekindergarten program that provides a cognitively stimulating environment may partially compensate for a less stimulating home environment (Bradley, Burchinal, and Casey, 2001; Caughy, DiPietro, and Strobino, 1994; Hubbs-Tait et al., 2001 ).\nOur findings should be interpreted in light of at least two limitations. First, without data on long-term outcomes, it is difficult to determine how much weight to put on our findings. In particular, it is unclear whether increases in relatively low levels of problem behaviors will be consequential for subsequent schooling outcomes. It is reassuring that although children attending prekindergarten display more problem behaviors in first grade, they were not more likely to be held back. In addition, we need to learn more about happens inside the \"black box\"\nof prekindergarten. Future research should consider whether these associations are moderated by factors such as prekindergarten group sizes, staffing ratios, and curriculums. Second, although we have detailed information on child care in the year before kindergarten, we know less about experiences in earlier years, and therefore can not precisely model children's outcomes as a function of their cumulative experiences of preschool or center-based care.\nThe main conclusion of this analysis is that prekindergarten has few lasting positive effects on advantaged children's skills and persisting adverse effects on their behavior, but yields larger benefits for disadvantaged children. This suggests that the greatest return to public investments in early education may be obtained by using funds to increase disadvantaged children's enrollment in preschool and prekindergarten. Currently, most state funding initiatives do target at-risk children, but funding falls far short of providing all eligible children with access to these programs (Ripple et al., 1999) . Additional expenditures to increase disadvantaged children's early education experiences are likely to improve their academic skills at school entry.\nAdditional research is needed to determine whether these benefits result in long-term improvements in human capital. O r e g o n P e n n s y l v a n i a R h o d e I s l a n d S o u t h D a k o t a T e n n e s s e e T e x a s U t a h V i r g i n i a W a s h i n g t o n W i s c o n s i n W y o m i n g Tables 2 and 3 . All models include the full set of covariates, corresponding to (model 4, Table 2 ). \"Held Back\" is a dichotomous variable set to 100 (zero) for individuals who are retained in kindergarten. . "}, {"section_title": "$ Prekindergarten", "text": ""}, {"section_title": "Parental reports of neighborhood quality, kindergarten spring", "text": "Neighborhood quality composite Mean of 6 items asking about neighborhood problems."}, {"section_title": "Parental reports of home learning activities, kindergarten fall", "text": "Choice of home location Parents chose home location for current school (dummy variable). Family has computer Dummy variable.\nT.V Number of hours child watches TV on weekdays.\nReading, visiting educational settings outside of school Frequency of child looking at picture books/reading outside of school, visiting zoo, library, museum, concert (6 variables).\nOther non-school activities Child has ever taken lessons or participated in performing arts or organized clubs outside of school (7 dummy variables)."}]