[{"section_title": "Abstract", "text": "Food and eating environments likely contribute to the increasing epidemic of obesity and chronic diseases, over and above individual factors such as knowledge, skills, and motivation. Environmental and policy interventions may be among the most effective strategies for creating population-wide improvements in eating. This review describes an ecological framework for conceptualizing the many food environments and conditions that influence food choices, with an emphasis on current knowledge regarding the home, child care, school, work site, retail store, and restaurant settings. Important issues of disparities in food access for low-income and minority groups and macrolevel issues are also reviewed. The status of measurement and evaluation of nutrition environments and the need for action to improve health are highlighted. "}, {"section_title": "INTRODUCTION", "text": "Substantial research clearly indicates that diet plays an important role in prevention of chronic diseases and obesity (96, 98, 106) . Nutrition has come to the fore as one of the major modifiable determinants of chronic diseases (106) . Changes in Americans' dietary and lifestyle patterns could produce substantial gains in the population's health (96) . Specifically, increasing consumption of fruits and vegetables, whole grains, and calciumrich foods, while reducing saturated fats, trans fats, sodium, added sugars, and excess calories and reducing obesity could dramatically improve Americans' health and well-being (98) .\nMajor changes in our food system and food and eating environments over the past decades have been driven by technological advances; U.S. food and agricultural policies; and economic, social, and lifestyle changes. Food is now readily available and accessible in multiple settings throughout the day. More processed and convenience foods are available in larger portion sizes and at relatively low prices. Parents are working longer hours, there are fewer family meals, and more meals are eaten away from home (51) . The school food environment is remarkably different than a few decades ago: High-calorie, low-nutrition foods are available in multiple venues throughout the school day (91) . Food marketing aimed at children has drastically increased over the past 30 years (50). We have seen an exodus of grocery stores and an influx of fast-food outlets in low-income urban areas, which has contributed to the income and racial/ethnic disparities in access to healthy foods (66, 75) . Collectively, these environmental changes have influenced what, where, and how much we eat and are believed to have played a substantial role in the current obesity epidemic (50, 51) .\nIndividual behavior to make healthy choices can occur only in a supportive environment with accessible and affordable healthy food choices (97) . This article presents an overview of food environments and strategies for creating healthy eating environments. A conceptual framework is presented first, followed by a description of key environmental factors organized by specific settings: home, child care, schools, work sites, retail food stores, restaurants, and broader macrolevel issues such as food and agriculture policy and food marketing. Issues of disparities in food access for low-income and minority groups are highlighted. The aim is to advance readers' understanding of how the environment influences food choices and to highlight promising intervention and policy strategies to promote population-wide healthy eating. Measurement and evaluation issues in conducting environmental and policy research and surveillance is also discussed."}, {"section_title": "AN ECOLOGICAL FRAMEWORK", "text": "Eating behavior is highly complex and results from the interplay of multiple influences across different contexts. An ecological approach is useful to guide research and intervention efforts related to eating behavior because of the emphasis on multilevel linkages, the relationships among the multiple factors that impact health and nutrition, and the focus on the connections between people and their environments (83, 88, 93 ). An ecological framework depicting the multiple influences on what people eat is shown in Figure 1 . Individual-level factors related to food choices and eating behaviors include cognitions, behaviors, and biological and demographic factors. These individual factors can impact food choices through characteristics such as motivations, self-efficacy, outcome expectations, and behavioral capability. Environmental contexts related to eating behaviors include social environments, physical environments, and macro-level environments. The social environment includes interactions with family, friends, peers, and others in the community and may impact food choices through mechanisms such as role modeling, social support, and social norms. The physical environment includes the multiple settings where people eat or procure food such as the home, work sites, schools, restaurants, and supermarkets. The physical settings within the community influence which foods are available to eat and impact barriers and opportunities that facilitate or hinder healthy eating. Macrolevel environmental factors play a more distal and indirect role but have a substantial and powerful effect on what people eat. Macro-level factors operating within the larger society include food marketing, social norms, food production and distribution systems, agriculture policies, and economic price structures. These four broad levels of influence (Figure 1) individual, social environment, physical environment, and macrolevel environmentsall interact, both directly and indirectly, to impact eating behaviors.\nThe study of environmental and policy influences on nutrition and eating behaviors is a new and growing science. Thus, there are few well-articulated theoretical models with related data to test the interactions among personal, social, and environmental factors. Little is known about the mechanisms and causal pathways by which specific environmental influences might interact with individual factors to influence eating behaviors (3, 11) . Furthermore, little research has been done on which aspects of the food environment are more influential than others or about the most feasible and effective interventions and policies to improve food environments in various populations (3, 11, 59, 100) . The field is also hampered by a lack of validated environmental measures (39) . The challenge is to accelerate multilevel ecological research in this area. The following section addresses key issues in environmental settings and promising interventions and policies to improve population-level eating behaviors."}, {"section_title": "SETTINGS AND PLACES FOR HEALTHY EATING", "text": ""}, {"section_title": "Homes", "text": "National survey data indicate that Americans consume roughly two thirds (68%) of their total calories from foods prepared within the home (43) . A variety of factors within the home environment have been associated with healthful dietary behaviors; among the strongest factors are availability and accessibility of healthy foods, the frequency of family meals, and parental intake and parenting practices (for children's diets). Both household food availability (foods present in the house) and accessibility (whether available foods are in a form or location that facilitates their consumption, such as fruit on the counter) have been positively associated with healthful dietary intake in youth (19, 42, 100) . NeumarkStzainer and colleagues (72) found that home availability and taste preferences were the two strongest correlates of fruit and vegetable intake among adolescents. Home availability was mediated by parental social support for healthy eating, family meals, and household food security. Even when taste preferences for fruits and vegetables were low, if fruits and vegetables were available in the home, intakes increased. Collectively, studies suggest that readily available and easily accessible healthful foods within the home are likely to enhance healthful dietary intake among youth and families.\nAvailability of soft drinks in the home has also been strongly associated with softdrink consumption among children (42) . A recent home-based environmental pilot study was conducted through weekly home deliveries of noncaloric beverages to displace sugarsweetened beverages (SSBs) to reduce SSB consumption among adolescents, who were frequent consumers of SSB (23) . The results of this relatively simple environmental intervention showed that SSB intake decreased in the intervention group, and investigators saw a significant body mass index (BMI) change among adolescents in the highest BMI tertile group.\nSocial-environmental influences within the home such as modeling of healthful dietary intake by parents and siblings, authoritative feeding style (i.e., high in limit setting but also high in nurturance), and more (18, 27, 44) and may be the strongest predictor of fruit and vegetable consumption among young children (18) . A recent systematic review by van der Horst and colleagues (100) report an association between parent and child intake of fat, fruits, vegetables, and soft drinks.\nAnother factor that may influence children's dietary intake is parental feeding style and parenting practices. An authoritative feeding style has been positively associated with preschool children's intake of dairy and vegetables (73) , and mother's authoritative parenting style is associated with adolescent intake of fruits and vegetables (63) . Birch (5) found that parental practices such as restricting foods, pressuring children to eat, or using foods as rewards may inadvertently promote behaviors counter to their intentions. For example, parental pressure could result in decreased preference for certain foods, whereas food restriction could increase preferences for certain foods.\nFrequency of family meals may also have a positive impact on healthful dietary intake among youth. Research suggests that family meal frequency may be positively associated with child and adolescent intake of several vitamins and minerals, fruits, vegetables, grains, and calcium-rich foods and fewer fried foods, SSBs, and saturated and trans fat (34, 71) .\nThere have been relatively few homebased interventions to improve dietary intake. A recent comprehensive research review on interventions to reduce obesity and related chronic-disease risk factors in children and youth found that of the 147 studies included in the critical review only 4 interventions were implemented in the home (28) . Thus environmental interventions targeting the home environment represent an area for further study."}, {"section_title": "Child Care", "text": "Child care facilities provide a valuable opportunity to promote healthy eating and energy balance in children. Although much has been written on creating healthy food environments in schools, surprisingly little has been written regarding child care settings. Research examining the nutritional quality of foods and beverages served in child care settings has been extremely limited, and the few studies suggest that nutritional quality needs to be improved (90) . Furthermore, little intervention research has been done on changing the food environment. This is a missed opportunity because the majority of children under age five (60%) spend an average of 29 hours a week in some form of child care setting and 41% spend 35 or more hours per week (52) .\nThe Child and Adult Care Food Program (CACFP), administered by the USDA (U.S. Department of Agriculture) through grants to state agencies, provides meals and snacks for nearly 2.1 million children in center-based care and almost 900,000 children in family child-care homes (80) . The CACFP guidelines require that meals and snacks include a minimum number of age-appropriate servings from four food categories, but they do not require meals and snacks to meet any nutrient-based standards or be consistent with the Dietary Guidelines for Americans, nor do they prohibit offering foods or beverages that might be high-calorie, low-nutrition foods. There are no funding provisions or legislative requirements for nutrition education in the CACFP. To encourage healthier eating among children, CACFP regulations for meals and snacks for children two and older should be consistent with the Dietary Guidelines for Americans.\nWith the exception of the federal Head Start program, child care facilities are regulated by states, and state rules vary widely. Only 2 states require that meals and snacks follow the Dietary Guidelines for Americans, and only 15 states specify the percentage of children's daily nutritional requirements to be provided per meal or per a given number of hours in care (90) . Stronger state licensing requirements on nutrition quality of foods served and training for child care providers can help ensure healthier food environments. The current situation reflects an important missed opportunity to promote health."}, {"section_title": "Schools", "text": "The school food environment can have a large impact on children's and adolescents' dietary intake because up to two meals and snacks are eaten at school every day (91) . Food at school is typically available through federally reimbursed school meals and \"competitive foods,\" so called because they compete with the school meals program. Competitive foods are all foods and beverages sold outside of the federal meal programs and include vending machines, a la carte offerings in the cafeteria, snack bars, school stores, and fundraisers. Meals served in the National School Lunch Program and School Breakfast Program must meet federally defined nutrition standards and the Dietary Guidelines for Americans. However, federal requirements currently do little to limit the sale of competitive foods or to set school-wide nutrition standards. Competitive foods are widely available in schools; 9 out of 10 schools sell them (99) and the majority of offerings are high-fat or high-sugar foods and beverages (45, 99) .\nIn response to growing concerns over obesity, attention has focused on the need to establish school nutrition standards and limit offerings of competitive foods. The Institute of Medicine (IOM) Report Nutrition Standards for Healthy Schools concluded that federally reimbursable school nutrition programs should be the main source of food at school and that competitive foods should be limited (49) . The report set forth nutrition standards for competitive foods and recommended that if competitive foods are available, they should consist solely of fruits, vegetables, whole grains, and nonfat/low-fat dairy products to help children and adolescents develop healthful eating patterns.\nIn recent years, many states and local school districts have passed regulations or legislation on competitive foods (8) , which are more restrictive than USDA regulations, although they differ greatly in the type and extent of restrictions. About half of all states (29) have adopted competitive school food and beverage policies, and almost all this activity has occurred in the past five years (49) . Only 16 states require nutrition standards for competitive foods and beverages at school, and none has standards as strong as the IOM recommendations. The Center for Science in the Public Interest issued a report evaluating state competitive food policies and concluded that although changes are occurring at the state level, such changes are \"fragmented, incremental and not happening quickly enough to reach all schools in a timely way. The nation has a patchwork of policies addressing the nutritional quality of school foods and beverages and the majority of states have weak polices\" (15, p. 3) . Congressional action to grant the USDA broader authority to regulate the content and sale of competitive foods and to require nutrition standards for all foods and beverages sold during the school day could improve children's health and nutrition.\nA recent federal policy initiative that has implications for improving the school food environment requires school districts participating in the federally reimbursable school meal programs to establish local school wellness policies addressing nutrition and physical activity. Although the school wellness policies only went into effect at the beginning of the 2006-2007 school year, preliminary data show mixed results in terms of the implementation, compliance, and impact of the policies (1).\nMore support and regulatory action is needed by federal, state, and local authorities to strengthen and improve healthy eating and nutrition education in schools. At the federal level this could not only include stronger regulations for competitive foods in schools, but also expand the USDA fruit and www.annualreviews.org • Creating Healthy Food Environmentsvegetable pilot program to improve fruit and vegetable intake among school children, especially among schools with a high proportion of low-income students. Other efforts to improve the quality of foods in schools could include farm-to-school programs, which link local farmers providing fresh locally grown produce to school food service cafeterias and school gardening programs. There is also a need for classroom nutrition education to complement changes in the school environment to increase students' skills for adopting healthy lifestyles.\nA number of measures of school food environments have been carefully developed, most often for use in intervention research. Largescale studies of school food policies and environments have been conducted using surveys of school administrators and food service managers (20, 103) . These data are limited by the usual concerns with self-report (bias, forgetting, etc.) and may also suffer from nonresponse bias. A state nutrition-environment policy classification system has recently been developed to track developments in 11 policy areas, among them school meal environments, reimbursable school meals, BMI screening, and competitive foods. This system is based on a social-ecological model and should enhance the surveillance opportunities for all 50 states and the District of Columbia (64) .\nLocal and regional studies typically use a combination of data-collection methods, including surveys of food service managers, observations and data-based inventories of foods available, observations/analysis of students' bag lunches, and food service sales data. Often the food availability and/or sales data are combined with nutritional information and subjected to nutrient analyses (33, 82) . The measures are carefully designed and subjected to quality assurance, but few psychometric data are available. A key limitation of on-site measures is that the sales data are usually recorded manually rather than obtained from automated cash register systems. Details of the instruments and protocols used in peerreviewed research have not been widely disseminated, most likely because the tools were developed in specific settings as part of larger intervention studies."}, {"section_title": "After-School and Summer School Programs", "text": "After-school settings are important environments for the promotion of healthy eating. More than 6.5 million youth are in afterschool programs such as schools, park and recreational centers, YMCAs, and Boys and Girls Clubs. African American and Hispanic children are more likely than other children to participate in after-school programs. More than half (55%) of high-poverty urban schools provide summer-school programs (95) . These settings also reach millions of children through federal food assistance programs, such as the Afterschool Snack Program, which provides free snacks to children and adolescents, and the Summer Food Service Program, which provides meals and snacks to youth. Studies are needed to assess the nutritional quality of snack foods and beverages in these programs and intervention strategies to improve healthy eating in these programs.\nAfter-school care programs in seven states (Delaware, Illinois, Michigan, Missouri, New York, Oregon, and Pennsylvania) were recently authorized by Congress to serve dinner in addition to snacks to children in areas where more than 50% of the children qualify for free or reduced price school meals (30) . This means that some low-income children may consume three meals and a snack every weekday during the school year from federal food programs. This highlights the growing importance of the federal child nutrition programs in providing nutrition to children in low-income families and the need to ensure that the foods served through these programs are consistent with the Dietary Guidelines for Americans."}, {"section_title": "Work Sites", "text": "As schools are for children, work sites are ideal settings for reaching adults because 66% of U.S. adults are employed (12) . The work site environment provides opportunities for both individual-level behavior changes and physical and social work site environmental change. Research suggests that nutrition behaviors can be positively influenced by work site health-promotion programs that include healthful modifications of the work site environment (4, 25, 86) . Dietary intake has been positively influenced by environmental strategies such as increasing the availability and variety of healthful food options (54) , reducing the price of healthful food in work site cafeterias (54) and vending machines (32) , and sending tailored nutrition education email messages (7) . A recent systematic review of work site health-promotion programs found that fruit, vegetable, and fat intake can be positively influenced by environmental strategies that include point-of-purchase labeling, promotional materials, expanded availability of healthy foods, and targeted food placement (25) . A review of these programs found that most studies had small but significant decreases in dietary fat and increases in fruits and vegetables or fiber (31) . Although the changes were modest, they may be meaningful from a population perspective.\nStrengthening the social environment of the workplace may also be beneficial (4, 86) . Involving employees in program planning and implementation and obtaining supervisory support and commitment from management are important for program sustainability (86) . Priorities for future work site-based interventions include identifying and reducing barriers to organizational and environmental change, addressing social contextual factors driving behaviors, and building expanded networks of community partnerships."}, {"section_title": "Retail Food Stores: Supermarkets and Small Grocery Stores", "text": "The presence of food stores, and the availability of healthful products in those stores, are important contributors to healthy eating patterns among neighborhood residents (41) . Grocery stores play a major role in food purchasing: Households make an average of two visits to a supermarket per week, and average weekly household grocery expenses were $93 in 2006 (29) . Several studies have found associations between access to supermarkets and healthier food intakes (16, 60, 66) . For example, Morland et al. (66) found that fruit and vegetable intake increased with each additional supermarket in a census tract, and that increase was nearly three times as large for African Americans. Laraia et al. (60) found that pregnant women who lived more than four miles from a supermarket were significantly more likely to have poor diet quality, even after controlling for individual socioeconomic status and the availability of smaller grocery and convenience stores. Powell and others (76) found that increased access to chain supermarkets was associated with lower adolescent BMI and that greater availability of convenience stores was associated with higher BMI and overweight. Cheadle and others (16) found that the diets of neighborhood residents were healthier when the supermarkets in their neighborhoods offered more healthful products. However, a recent analysis found that both higher neighborhood density of small grocery stores and closer proximity to chain supermarkets were associated with higher BMI among women (101) . More emerging research should shed light on the complexities of these relationships.\nAmong various types of retail stores that sell food, supermarkets offer the greatest variety of food at the lowest cost (29, 40) . Lowincome and minority neighborhoods have fewer chain supermarkets than do middle-and upper-income neighborhoods (67, 77, 107) . A recent study linked availability of food store outlets in the United States across 28,050 zip codes to Census 2000 data (77) . Lowincome neighborhoods had fewer chain supermarkets with only 75% of stores available in middle-income neighborhoods. Data also showed large disparities by race in the availability of chain supermarkets even after controlling for differences in income, similar to those found in the Detroit area by Zenk and others (107) . For example, the availability of chain supermarkets in African American neighborhoods was only 52% that of their counterpart white neighborhoods (77) . The lack of availability of large supermarkets is of concern because large supermarkets tend to offer food at lower prices and provide a wider variety of and higher-quality food products than do small grocery stores (47, 75) .\nLack of access to supermarkets is also a problem in some rural areas. Morton & Blanchard (68) examined the distribution of U.S. counties in which residents have low access to large food retailers (low access defined as living more than 10 miles from any supermarket or supercenter). They found that of all U.S. counties, 418 are food deserts and most of these had high poverty rates. The most affected rural counties were in the Great Plains and Rocky Mountain regions, the Deep South, the Appalachian region of Kentucky and West Virginia, and the western half of Texas. In rural America, it will take community action and public policy improvements to strengthen the capacity of rural grocery stores to provide nutritious high-quality and affordable foods.\nBoth large supermarkets and smaller groceries and food stores are important environments where environmental interventions may increase the availability of and access to healthier food choices (41) . Pointof-choice nutrition information to help consumers identify healthier products can and has been tried in grocery store settings, with www.annualreviews.org • Creating Healthy Food Environmentsmixed results but some notable successes (37, 41) . In addition, interventions to increase availability, variety, and convenience; pricing; and promotional strategies have been found feasible and modest evidence has demonstrated their efficacy in influencing healthy eating behavior (41) . Thus, retail food environments at both the community level (e.g., presence of supermarkets) and the consumer level (e.g., healthful, affordable foods in food stores) are promising venues for positive change (39)."}, {"section_title": "Eating Out: Restaurants and Fast-Food Outlets", "text": "Americans are eating out more often and consuming more calories from away-from-home establishments than ever before. The National Restaurant Association estimates that sales will total $537 billion in 2007 for the 935,000 U.S. restaurants (70). The number of food establishments in the U.S. has nearly doubled in the past three decades (94) . Today nearly half (47.9%) of all food expenditures are spent eating out, up from 34% in 1974 and nearly double from what it was in 1955 (70). Away-from-home foods tend to be more calorie dense and of poorer nutritional quality than foods prepared at home (43) . Currently, Americans consume about 32% of their calories from food away from home (43) . Whereas fast-food restaurant meals are typically high in calories and fat, foods consumed at fullservice restaurants can be as high or higher in fat, cholesterol, and sodium (87) . An observational study of 217 fast-food and sit-down restaurants in the Atlanta area found that it was not possible to choose a healthy main dish on the basis of readily available information in most restaurants (81) . Studies have linked frequent eating out to higher caloric intake, weight gain, and obesity (9, 65, 74) .\nTrends toward large portion sizes in restaurants encourage over consumption because people consume more food and more calories when presented with large portions (102) . Several restaurant items, such as soft drinks and desserts, are now served in portions that are two or more times larger than the standard serving size (53). It is not uncommon for restaurant entrees to contain one half to one day's worth of recommended calories (1100 to 2350 calories) (53) . Most consumers may be unaware of the high levels of calories, fat, saturated fat, and sodium found in many menu items (13, 46) and may underestimate actual calorie content by as much as 50% (13) .\nFederal and state laws do not require restaurants to provide nutrition content information to consumers. Rather, the provision of nutritional information for menu items is voluntary and the information may appear on menus, Web sites, brochures, tray liners, food wrapper packages, or posters. One survey found that only 44% of the top 300 U.S. restaurant chains provided nutrition information for most of their standard menu items (104) . Of the restaurants with nutrition information, 86% provided it on the company Web site, which requires Internet access and does not make the information available at the point of decision making.\nIn 2006, the Keystone Center, a nonprofit policy organization, released a report requested by FDA to develop recommendations on away-from-home foods (94) . Among the recommendations were that food establishments should provide consumers with caloric information in a standard, easily accessible format and should increase the availability of low-calorie menu items. They also recommended that research should be conducted on how consumers use nutrition information for away-from-home foods, how this information affects caloric intake, and how nutrition information affects restaurant operators. Restaurant executives identify their most important priorities as growing sales and increasing profits, so they will only offer healthy food options if there is adequate consumer demand (38) . Provision of nutritional information at the point of choice may increase customer awareness and stimulate demand for smaller portions and more healthful choices. Although there are several models for changing environments and policies in restaurants to increase healthy eating, most have not been systematically evaluated (36) . There is a need to disseminate promising strategies, increase public-private partnerships, and to study further the effects of policy and environmental changes including the provision of nutrition information in restaurant settings.\nLegislation has been introduced in Congress and in more than a dozen state legislatures that would require chain restaurants and fast-food outlets to list calories and other nutrition information on their menus to make it easier for consumers to make more healthful food choices (105) . To date, none of these measures have been enacted. On a local level, the New York City Board of Health passed a regulation to require some restaurants to post calorie information on menus or menu boards. In a surprising attempt to circumvent this requirement, several major chains took down their Web site-based nutrition information, suggesting the need for fewer loopholes in such laws. Also, cities such as New York and Philadelphia have recently passed bans or restrictions on trans fats in restaurants, which will go into effect in 2008."}, {"section_title": "Disparities in Food Access in Low-Income Communities", "text": "Inequalities in income underlie many health disparities in the United States. In general, population groups that suffer the worst health status, including nutritional health and obesity, are also those that have the highest poverty rates (96) . Several studies have shown differential availability and affordability of healthy foods in low-income neighborhoods (2, 58, 62, 66, 67) . Lack of access to affordable and healthy foods may be contributing to disparities in diet-related chronic diseases and obesity rates. (See section above on Retail Stores for background).\nAmong the important opportunities to reduce disparities are initiatives to encourage the development of grocery retail investments in low-income communities. A recent survey among urban and economic planners in 32 large cities found few activities to encourage any form of food retail in underserved areas, such as development of large supermarkets, farm stands, or assistance to neighborhood grocery businesses (75) . Successful initiatives were characterized by political leadership at the highest levels and effective partnerships with community-based nonprofit organizations. Case studies showed supermarkets that had entered deprived inner-city neighborhoods experienced significant business and customer loyalty. Creative strategies by these stores included shuttle services, calculators on carts, services provided to immigrants and non-English speakers, automated teller machines, rooftop parking, and technology linking inventory to checkout data to facilitate efficient flow of high-demand products in limited spaces (75) .\nOther potential strategies to get healthy, local foods into low-income neighborhoods include fostering neighborhood farmers markets, cooperative food stores, community gardens; incorporating fresh produce and healthy foods into corner stores and convenience stores; having neighborhood churches and community centers purchase produce from local farmers to be sold to community members following church or community events; and having local community clinics and public health departments provide local produce to patients during clinic visits as part of a healthpromotion initiative (61) . We also need to find ways to have food banks and food shelves obtain fresh produce and healthy foods.\nFederal, state, and local efforts and publicprivate partnerships are needed to create and facilitate new and expanded food systems programs to help underserved areas develop retail food markets and increase access to a healthy, affordable food supply. Because little research has been done on the most effective and promising programs in this area, more evaluation and intervention efforts are needed."}, {"section_title": "www.annualreviews.org • Creating Healthy Food Environments", "text": ""}, {"section_title": "MACRO-LEVEL APPROACHES U.S. Food and Agriculture Policies", "text": "The obesity crisis has focused attention on the role of federal agricultural policies on the U.S. food supply and how policies may impact public health and diet-related chronic diseases and obesity. Agricultural policies determine which crops the government will support. Government support influences which crops U.S. farmers produce, the prices of those crops, and subsequently, which products food processors, distributors, and retailers make available to consumers and at what market price (84) . U.S. farm policies have contributed to the overproduction of certain crops, specifically commodity grain and oilseed crops (i.e., corn and soybeans), thereby creating artificially low prices, often below the cost of production (84) . U.S. farm policy for commodity crops has made sugars and fats some of the most inexpensive food substances to produce and may have indirectly influenced food processors and manufacturers to expand their product lines to include more fats and sweeteners in their products (84, 85) . High fructose corn syrup and hydrogenated vegetable oils (high in trans fats)-products that did not even exist a generation ago-are now prevalent in foods, likely owing to the availability of inexpensive corn and soybeans (84) . Food companies can purchase these commodities at artificially cheap prices, contributing to the increased prevalence of added sugars and fats in our food supply. In the American food supply, per capita daily supply of added fats and oils increased 38% from 1970 to 2000, and added caloric sweeteners increased 20% during this time (78) . In 2000, the average American consumed 152 pounds of sweeteners, which was equivalent to 52 teaspoons of added sugar per day of which 40% came from high fructose corn syrup (10) . The current U.S. diet derives close to 50% of calories from added sugars and fats (78) .\nThe low cost of cheap corn and soybeans and higher-priced fruits and vegetables are believed to be a direct consequence of U.S. agriculture policy over the past 30 years (69). Government support for grain and oilseed crops comes in many forms, from research dollars to infrastructure investments to subsidy payments that mitigate low prices (84) . Healthy fruits, vegetables, and other specialty crops (i.e., nuts) receive little government support. This lack of government support may be reflected in the higher cost of fruits and vegetables. Between 1985 and 2000, fruits and vegetables led all other food categories in retail price increases, with price increases for fresh fruits and vegetables being much higher than those for processed products (78) . For example, over this 15-year period the percent change in food price increases was 118% for fruits and vegetables and only 35% for fats and oils, 46% for sugars and sweets, and 20% for carbonated soft drinks (78) . Although there may be a correlation between the drop in prices and expanding production of corn and soybeans, the increasing use of added fats and high-fructose corn syrup in processed foods, and the increase in obesity, these factors are complex and not well understood.\nCurrent agricultural policies have helped make food environments less healthy for Americans. Farm and food policy should be aligned with national public health and nutrition goals. The key purpose of our food and farming policies should be to advance the health and well-being of Americans. Some of the same reforms that could make our farm policy healthier would also benefit family farmers (84) . Every five to seven years there is an opportunity to change the system through the federal Farm Bill, which addresses agricultural production, food and nutrition assistance, rural development, renewable energy, conservation policies, and research.\nThe Farm Bill also reauthorizes some of the key domestic food and nutrition assistance programs including the Food Stamp Program, which serves 1 in 12 Americans, or nearly 24 million low-income people per month, more than half of whom are children (30) . Currently, food-stamp recipients have insufficient benefits to purchase the foods necessary for a healthy diet over the course of a month. We need to ensure that all Americans are able to access and afford healthy foods. Increasing access to healthier foods in food assistance programs could include expanding coupon programs that allow food assistance beneficiaries to purchase fruits and vegetables, whole grains, and other healthy foods at local farmers markets and other retail food outlets; expanding the programs that bring fresh local farm products into schools; and revising the commodity portion of the food assistance programs (84, 85) . A shift toward healthier farm policies that would benefit the public's health also includes promoting local and regional sustainable food systems to increase access to healthier foods. Additionally, federal and state policies could facilitate increased institutional and agency procurement of local and regional agricultural food products, such as fruits and vegetables, by child care centers and schools, hospitals, food banks, senior centers, and prisons (26) ."}, {"section_title": "Economic and Pricing Issues", "text": "The cost of food is the second most important factor affecting food decisions, behind taste (35) . Government regulations that affect price are consistent influences on the purchase of fresh fruits, vegetables, and meats (79). Drewnowski (21, 22) has hypothesized that the observed links between food supply trends and rising obesity rates are mediated by the economics of food choices. The current structure of food prices is that highsugar and high-fat foods provide calories at the lowest cost (22) . Thus individuals and families with limited resources may select energydense foods high in refined grains, added sugars, and fats as a way to save money. Fresh fruits and vegetables are more expensive on a per calorie basis than are fats and sugars. Little is known as to whether variations in food prices account for differences in diet quality or weight status. Sturm & Datar (92) merged data from the Early Childhood Longitudinal Study with metropolitan data on food prices and found that lower neighborhood prices for fruits and vegetables predicted lower gains in BMI in young children. Lowincome families spend less on fruits and vegetables than do higher-income families (6) . A 10% reduction in price for fruits and vegetables increases consumption by 7.2% (48) . Thus, reducing the price of healthy food may increase intake.\nIt is surprising how little is known about whether healthier diets cost more. Recently, Jetter & Cassady (55) conducted a marketbasket study in 25 stores in Los Angeles and Sacramento to compare the cost of a standard market basket [based on the USDA's Thrifty Food Plan (TFP)] to a market basket with healthier substitutes. For the two-week shopping list, the average TFP market-basket cost was $194 and the healthier market-basket plan was $230. The cost of the healthier basket was due to higher costs for whole grains, lean ground beef, and skinless poultry. This study suggests that the higher cost of healthier foods could be a deterrent to eating healthier among low-income consumers. More studies are needed on economic factors influencing eating behavior and the relationship between diet quality and food costs. This has important implications for strategies to modify the food environment, for national food policy, and for food assistance programs for low-income populations."}, {"section_title": "Food Marketing and Media Influences", "text": "Although multiple factors influence eating behaviors of youth, one potent force is food marketing. Today's youth live in a media-saturated environment. Over the past few decades, U.S. children and adolescents have increasingly been targeted with aggressive forms of food marketing and advertising practices (50, 89) . Multiple techniques and channels are used to reach youth, beginning when they are toddlers, to foster brand loyalty and influence product purchase behavior. Recently the Kaiser Family Foundation conducted the largest study on TV food advertising to children (57) and found that children ages 8-12 see the most food ads on TV, an average of 21 ads per day or more than 7600 per year. Most of the ads were for candy, snacks, sugared cereals, and fast foods; none of the 8854 ads reviewed marketed fruits and vegetables. Food marketing to children now extends beyond television, is widely prevalent on the Internet (56) , and is expanding rapidly into a ubiquitous digital media culture of new techniques including cell phones, instant messaging, video games, and three-dimensional virtual worlds, often under the radar of parents (17) .\nThe IOM Committee on Food Marketing to Children and Youth conducted a systematic review of the evidence and concluded that food and beverage marketing practices geared to children and youth are out of balance with recommended healthful diets and contribute to an environment that puts their health at risk (50). The report set forth recommendations to guide the development of effective marketing strategies that promote healthier food, beverages, and meals for children and youth. Among the major recommendations for the food, beverage, and restaurant industries was that industry should shift their advertising and marketing emphasis to healthier childand youth-oriented foods and beverages. If voluntary efforts related to children's television programming are unsuccessful in shifting the emphasis away from high-calorie and low-nutrient foods and beverages to healthful foods and beverages, Congress should enact legislation mandating the shift. Advocacy and public health groups are also calling on the Federal Trade Commission, the Federal Communications Commission, and Congress to work together with industry to develop a new set of rules governing the marketing of food and beverages to children-rules that account for the full spectrum of advertising and marketing practices across all media and which apply to all children, including adolescents (17) . Marketing efforts need to serve, rather than undermine, the health of children (17) ."}, {"section_title": "MEASUREMENT ISSUES", "text": "To make significant progress in the area of eating and nutrition environments, we need valid, reliable measures of nutrition environments and policies (39) . Although there are an increasing number of reports of various dimensions of nutrition environments, there is no guidance in the literature on how best to measure nutrition environments in a comprehensive manner. Research on school food environments, neighborhood food environments (stores, restaurants), and state policies are illustrative of welldeveloped measurement tools and important needs in this area. This section provides examples of accomplishments and needs in the area of measurement of nutrition environments in schools, stores, and restaurant settings."}, {"section_title": "Neighborhood Food Environments: The Community Nutrition Environment", "text": "Key categories of food sources in neighborhoods include stores and restaurants. It is useful to distinguish where people get food and what type of food they can get within those establishments. The community nutrition environment is composed of the number, type, location, and accessibility of food outlets such as grocery stores, fast-food restaurants, and fullservice restaurants. The consumer nutrition environment is what consumers encounter in and around places where they buy food, such as the availability, cost, and quality of healthful food choices (39) . Community nutrition environment data are available from various commercial sources such as Dun & Bradstreet business lists (76, 77) , as well as from county health or agriculture department food license lists, telephone books, and the Internet. Although national studies may rely on business lists, local and regional studies suggest that more complete and accurate enumeration of food-sale locations can be achieved using a combination of sources (40, 81) and supplemented with ground truthing by systematically walking or driving each street in a neighborhood."}, {"section_title": "Consumer Nutrition Environments in Stores", "text": "Some of the earliest published measures of availability of healthy foods in stores were reported nearly two decades ago by Cheadle and others (16) , who calculated the percentage of shelf space used for healthy food options, such as low-fat milk, whole wheat bread, cheese, and lean meats. They found high inter-rater reliability (0.73 to 0.78) and test-retest reliability ranging from 0.44 to 1.00. These measures are theoretically robust but may be difficult to apply in contemporary grocery stores that are larger and more varied in layout than they were two decades ago. Horowitz and others (47) measured availability of five diabeticrecommended foods in grocery stores and reported excellent inter-rater reliability ranging from 0.94 to 1.00. Other published reports have been less clear about the rigor of their methods or did not report reliability of the measures.\nRecently, the Nutrition Environment Measures Study developed observational measures of the nutrition environment within retail food stores (NEMS-S) to assess availability of healthy options, price, and quality for ten food categories (e.g., fruits) or indicator food items (e.g., ground beef), aligned with the U.S. Dietary Guidelines (40) . Inter-rater reliability and test-retest reliability of availability were high: Inter-rater reliability kappas were 0.84 to 1.00, and test-retest reliabilities were 0.73 to 1.00. These measures are being disseminated through training workshops (http://www.sph.emory.edu/NEMS), and as of mid-2007, raters and trainers in 28 states have learned to use these tools and the NEMS-R restaurant measures."}, {"section_title": "Consumer Nutrition Environments in Restaurants", "text": "Research on the environment within restaurants is limited. Some recent advancements have been made in the measurement of food environments within restaurants, including www.annualreviews.org • Creating Healthy Food Environmentsgood interobserver reliability for availability of fruits and vegetables (24) . Cassady and colleagues (14) developed a reliable restaurant menu checklist for use by community members, which assesses food preparation, number of healthful choices, and fruit/vegetable availability. However, this checklist did not assess the whole restaurant environment and was tested in only 14 family-style restaurants.\nThe NEMS-R observational measure for restaurants was recently developed to assess factors believed to contribute to food choices in restaurants, including availability of more healthy foods, facilitators and barriers to healthful eating, pricing, and signage/promotion of healthy and unhealthy foods. Inter-rater and test-retest reliability were assessed in 217 sit-down and fast-food restaurants in 4 neighborhoods, and interrater reliability was generally high, with most kappa values >.80 (range 0.27-0.97) and all percent agreement values >75% (77.6%-99.5%). Test-retest reliability was high, with most kappa values >.80 (0.46-1.0) and all percent agreement values >80% (80.4%-100%) (81) . Like the NEMS-S store measure, it has been widely disseminated and continues to be adopted for research and community program use.\nThere is much more work to be done in designing and testing food-environment measures that are adoptable to a variety of locations. The options for self-reported measures include survey reports from individual consumers or residents (perceived reports) and reports from administrators or key informants (factual reports). Audit and observational tools also comprise a range of measurement methods: on-site observations, menu reviews, sales data, inventories, policy documentation, etc. Each type of method has pros and cons, and the relative advantages and disadvantages should be carefully considered when using or creating these measures for research and action projects. Developers and users of these measures will be challenged to be attentive to the nutritional meaningfulness of indicators, relevance and feasibility of measures, and potential for linking environmental and individual assessments in subsequent studies. A range of psychometrically sound measures are needed to obtain accurate and reliable estimates of the relation between nutrition environments and individuals' dietary intake, as well as to evaluate change in nutrition environments secondary to intervention."}, {"section_title": "CONCLUSIONS", "text": "Improving dietary and lifestyle patterns and reducing obesity will require a sustained public health effort, which addresses not only individual behaviors but also the environmental context and conditions in which people live and make choices. Individual behavior change is difficult to achieve without addressing the context in which people make decisions. Initial, significant steps are needed to make healthful food choices available, identifiable, and affordable to people of all races and income levels and in all types of geographic locations (e.g., urban, suburban, rural). Our ultimate goals should be to structure neighborhoods, homes, and institutional environments so that healthy behaviors are the optimal defaults."}, {"section_title": "DISCLOSURE STATEMENT", "text": "The authors are not aware of any biases that might be perceived as affecting the objectivity of this review. "}]