[{"section_title": "Abstract", "text": "The purpose of this study was to collect site-and condition-specific hydrology data to better understand the water flow dynamics of tidal creeks and terrestrial runoff from surrounding watersheds. In this paper, we developed mathematical models of tidal creek flow (discharge) in relation to time during a tidal cycle and also estimated terrestrial runoff volume from design storms to compare to tidal creek volumes. Currently, limited data are available about how discharge in tidal creeks behaves as a function of stage or the time of tide (i.e., rising or falling tide) for estuaries in the southeastern United States, so this information fills an existing knowledge gap. Ultimately, findings from this study will be used to inform managers about numeric nutrient criteria (nitrogen-N and phosphorus-P) when it is combined with biological response (e.g., phytoplankton assemblages) data from a concurrent study.\nWe studied four tidal creek sites, two in the Ashepoo-Combahee-Edisto (ACE) Basin and two in the Charleston Harbor system. We used ArcGIS to delineate two different watersheds for each study site, to classify the surrounding land cover using the NOAA Coastal Change Analysis Program (C-CAP) data, and to analyze the soils using the NRCS Soil Survey Geographic database (SSURGO). The size of the U.S. Geological Survey's Elevation Derivatives for National Application (EDNA) watersheds varied from 778 to 2,582 ha; smaller geographic watersheds were delineated for all sites (except Wimbee) for stormwater modeling purposes. The two sites in Charleston Harbor were within the first-order Horlbeck Creek and the second-order Bulls Creek areas. The ACE Basin sites were within the third-order Big Bay Creek and the fourth-order Wimbee Creek areas. We measured the stage and discharge in each creek with an acoustic Doppler current profiler (ADCP) unit for multiple tide conditions over a 2-year period (2015-2016) with the goal of encompassing as large of a range of tide stage and discharge data measurements as possible. The Stormwater Runoff Modeling System (SWARM) was also used to estimate the potential water entering the creeks from the land surface; this volume was very small relative to the tide water volume except for the more-developed Bulls Creek watershed.\nThe results show that the peak discharge occurred on the ebb tide and that the duration of the flood tide spanned a longer period of time; both of these observations are consistent with traits associated with an ebb-dominated tidal creek system. The tidal inflow and outflow (flood and ebb tides, respectively) showed an asymmetrical pattern with respect to stage and discharge; peak discharge during the flood (rising) tide occurred at a higher stage than for the peak discharge during the ebb (falling) tide. This is not an unexpected result, as the water on an ebb tide is moving down gradient funneled through the creek channel toward the coast. Furthermore, water moving with the rising flood tide must overcome frictional losses due to the marsh bank and vegetation; i.e., the peak discharge can only happen when the water has risen above these impediments. We infer from the flow dynamics data that faster water velocities during ebb tide imply that more erosive energy could transport a larger mass of suspended solids and associated nutrients (e.g., orthophosphate) from the estuary to the coastal ocean. However, the discharge and"}, {"section_title": "INTRODUCTION", "text": "Tidal creeks are common landscape features in southeastern US coastal areas. They act as a primary hydrologic link between estuaries and the terrestrial environment, and they also provide feeding grounds, spawning areas, and nursery habitats for shellfish, fish, birds, and mammals (Sanger et al., 2015) . In South Carolina, the estuaries exhibit a semidiurnal tidal pattern (two high tides and two low tides daily) and are classified as mesotidal systems with an average tidal range of 1.4-2.6 meters (Barwis, 1977) . These creeks are between 5 and 100 meters in width and 0 to 15 meters in depth (Blanton et al., 2006) . Along the South Carolina coast, the SC Estuarine and Coastal Assessment Program (SCECAP) estimated that 17% of the estuarine water area is tidal creek habitat. This generally includes creeks that are approximately 10-100 m wide (Van Dolah et al., 2002) .\nThe hydrology of the bidirectional-flow in tidal creeks is unique when compared to unidirectional nontidal systems. The bidirectional nature of flow means that water-borne constituents have the ability to enter the system from both the coastal ocean (downstream) and terrestrial (upstream) sources. Furthermore, the flow characteristics (i.e., the relationship between stage/water depth and discharge/flow rate) of tidal creeks cannot be interpreted using a typical rating curve approach where increasing water depth corresponds to increasing discharge, such as what occurs following a storm event. In tidal creek systems, the maximum discharge occurs at an intermediate stage between high and low tides. In many cases, the discharge is not symmetric on the flood (rising tide) and ebb (falling tide) cycles.\nAlthough stage varies with time in a smooth sinusoidal manner (Leopold et al., 1993) , this is not true for velocity or discharge. Previous studies in South Carolina marsh creek systems have shown that the ebb-dominant estuaries are common south of Cape Romain, South Carolina (Barwis, 1977) . Ebb-dominant systems usually have longer lag times at high water than low water, longer-duration rising tide periods, and stronger ebb than flood currents, and they tend to be deeper with extensive regions of flats and marshes (Speer et al., 1991) . These systems experience inefficient water exchange between the extensive intertidal marshes and the deep channels near the time of high water (Blanton et al., 2006) . This tidal distortion is the result of nonlinear interaction of the oceanic tide (or the semidiurnal lunar tide, M2) with shallow water in the estuary, which produces harmonic and compound tides, such as the M4 lunar quarterdiurnal tide and the M6 sexta-diurnal lunar tide (Dronkers, 1986; Blanton et al., 2002; Huang et al., 2008) .\nThe objective of this study was to describe a new methodology to measure tidal creek discharge with respect to time and stage. The motivation for this study was to provide the site-and timing-specific data needed to inform management decisions for coastal wetlands, specifically whether hydrodynamic data can help inform nutrient (nitrogen and phosphorus) thresholds in South Carolina coastal systems. Four tidal creek sites were used here: two are in the Ashepoo-Combahee-Edisto (ACE) Basin estuary, and two are in the Charleston Harbor estuary (Figure 1 ). The two sites in Charleston Harbor were located within the first-order Horlbeck Creek and the second-order Bulls Creek areas. The ACE Basin sites were within the third-order Big Bay Creek and the fourth-order Wimbee Creek areas. All four creeks are classified as blackwater systems, meaning that the streams originate in the Coastal Plain (and not in the Piedmont), have a moderate freshwater surface inflow, may have substantial fresh groundwater inflow, and receive dissolved organic matter inputs from terrestrial vegetation (Chow et al., 2013; Alber et al., 2015) , though considerable dissolved organic carbon (DOC) may also be internally regenerated (Reed et al., 2015) . Previous studies have shown that South Carolina blackwater systems, including creeks used herein, are primarily nitrogen limited. Developed areas in particular may be susceptible to increases in phytoplankton growth, particularly in response to elevated concentrations of reduced nitrogen, especially dissolved organic N (as urea), as determined experimentally (Reed et al., 2015; Reed et al., 2016) . DOC concentrations have also been shown to be higher in undeveloped watersheds than developed ones, with urea stimulating a greater contribution of phytoplanktonderived DOC in developed watersheds, suggesting that N-inputs may affect the biogeochemical cycling of carbon in these systems (Reed et al., 2015) . We also hypothesized that more developed and populated watersheds would generate more stormwater runoff as a result of increased impervious surfaces from roads, homes, and soil compaction. This was tested using a stormwater runoff model calibrated for coastal systems.\nrunoff modeling indicate that land-based flux was important in the developed Bulls Creek watershed, but not at the larger and less-developed Big Bay Creek watershed. At Big Bay Creek, the relatively large tidal discharge volume compared to the smaller potential runoff generated within the watershed indicates that the creek could potentially dilute terrestrial runoff contaminants. Smaller, more-urbanized tidal wetland systems may not benefit from such dilution effects and thus are vulnerable to increased runoff from adjacent developed landscapes. Volume 4, Issue 1 (2017)"}, {"section_title": "Measuring and Modeling Flow Rates in Tidal Creeks", "text": ""}, {"section_title": "METHODS", "text": ""}, {"section_title": "STAGE-DISCHARGE DATA COLLECTION AND INTERPRETATION", "text": "Four tidal creeks in South Carolina were studied over the course of 2 years to understand the relationship between tide stages (water depth) and discharge (volumetric flow rate). Two of the creeks (Wimbee and Big Bay) were in the relatively undeveloped ACE Basin and two in the more urbanized Charleston Harbor (Horlbeck and Bulls), as shown in Figure  1 . Within each drainage system, one creek was classified as more disturbed or developed than the other; thus, in order of degree of impact from least to greatest, the creeks are Wimbee (WC), Big Bay (BBC), Horlbeck (HC), and Bulls (BC). The degree of development in each watershed was quantified using 2010 NOAA Coastal Change Analysis Program (C-CAP) GIS data. We selected the USGS Elevation Derivatives for National Application (EDNA) data to establish the watershed units for land cover analysis and comparison.\nFor the Atlantic coast of the United States, tides are classified as semidiurnal, meaning that two high tides and two low tides typically occur in a lunar day (24 hours, 50 minutes). For an ideal symmetric semidiurnal tidal system, high tides occurs 12 hours and 25 minutes apart, with 6 hours and 12.5 minutes between high and low tide (NOS 2008) . In our study, the time of the discharge measurements was normalized to high water slack (HWS) for each day's effort. In this way, we can compare many different days' efforts relative to time in the tidal cycle. Additionally, by plotting discharge as a function of time, we were able to integrate the area under each curve to determine the total volume of water for any period of the tidal cycle (Boon, 1975; Blanton et al., 2006) .\nDischarge measurements were recorded using a Teledyne RD Instruments acoustic Doppler current profiler (ADCP) WorkHorse Monitor 1,200 kHz model (Teledyne RD Instruments 2011 , 2014 . This equipment uses sonar pings to measure water velocity within a consistent-sized subarea all along the transect cross section. The equipment calculated the discharge for each width-depth increment across the creek and then summed the increments to provide a total discharge for the entire cross section at a specific time. To differentiate between the flood and ebb data, we noted the flow direction as a positive discharge for ebb tide flow (toward the mouth of the creek), and a negative discharge was considered flood tide flow (toward the headwaters of the creek). At each study site, we designated a single transect location (a perpendicular cross section to the flow in the Tidal creek discharge example data (symbols) showing the endpoints and peak discharge for flood (left) and ebb (right) . Flood tide onset and end were defined as low water slack (LWS) tide stage and high water slack (HWS; time = 0, discharge = 0), respectively . Conversely, ebb tide onset and end were defined as HWS and LWS, respectively . The solid curves represent a polynomial function best-fit curve to the data, interpreted separately as flood tide data and ebb tide data . Note the longer period for flood tide relative to ebb tide, due to the larger rate of ebb tide discharge (i .e ., larger average water velocity during ebb) .\ncreek). To assure consistency in discharge measurements, we performed three to four measurements along the same transect. These groups of measurements were spaced at intervals of 30-40 minutes throughout a day's monitoring effort, with the goal of capturing as much of a tidal cycle as possible (usually about 8-10 hours of data). We followed the Teledyne RDI methodology for rejecting any measurements that produced a transect measurement with more than 25% Bad Bins (Teledyne RD Instruments 2007) . The field monitoring efforts were planned during the 2015-2016 period to observe as many different tidal conditions (flood, ebb, spring tide, and neap tide) as possible for each study site to account for variability in creek stages and velocities.\nThe data for each field campaign at each site were inspected separately as flood and ebb tide conditions ( Figure 2 ). Several nonlinear regression models (sine functions and polynomial functions) were developed using RStudio software (RStudio Team 2016), which is a free and robust mathematical and statistical software package. The resulting regression equations were plotted using a graphing calculator to determine 1) the duration of the tidal cycle, 2) the time and value for the peak discharge, and 3) total volume for each tidal cycle. The duration of the flood tide is the time from low water slack (LWS) to HWS. For the purpose of this study, HWS is defined as time = 0 when discharge = 0. Similarly, the length of the ebb cycle is the time from HWS to LWS. The length of the tidal cycle was determined by using built-in functions in the graphing calculator to determine the x-intercept of the equation to find the point of LWS (e.g., the point where the best fit line crosses the x-axis at discharge = 0). If the best fit line did not cross the x-axis, the time of LWS was assumed to be the minimum (for ebb) or maximum (for flood) point of the curve. Finally, the equations for discharge versus time were integrated to obtain the total discharge (or tidal prism) for the flood and ebb, respectively (Boon, 1975) ."}, {"section_title": "GIS ANALYSIS OF LAND COVER AND POPULATION", "text": "Two different watershed types were utilized during this study ( Figure 3 ). The USGS EDNA watersheds were utilized in lieu of a generic buffer distance around each study site as a way to quantify population density and land use/land cover differences. We assumed that the EDNA served as a \"hydrologic buffer\" rather than one based on an arbitrary distance. Please note that the study site location could fall anywhere in the EDNA watershed, so it was not necessarily a consistent landmark in each EDNA watershed (such as the outlet). Land cover data were obtained from the 2010 NOAA Coastal Change Analysis Program (C-CAP) files, and population density was calculated using 2010 US Census block data.\nThe second watershed type was a manual delineation of the watersheds upstream of our transect and nutrient sampling locations; this provided us with the ability to assess the area expected to drain past the sampling location (compared to the EDNA). The geographic watershed was not able to be delineated for the Wimbee Creek study site due to the complicated systems of impoundments (managed for waterfowl) and braided creek channels. Land cover data were obtained from the 2010 NOAA C-CAP files, and soil Ellis, Callahan, Greenfield, Sanger, Robinson, Jones data was obtained from the NRCS Soil Survey Geographic database (SSURGO). The results from this geographic watershed analysis were input directly into the stormwater runoff model described below.\nThe EDNA land cover analysis for each watershed supported the initial classification of the ACE Basin sites as relatively undisturbed \"reference\" watersheds in contrast to the more developed Charleston Harbor watersheds ( Figure  3 ). Wetland land cover comprised the largest percentage for all sites except for Bulls watershed, for which wetland was second to developed land cover classes. The ACE Basin creeks were less developed than the two Charleston Harbor system creeks. The two in the ACE Basin were predominantly forest and wetland land types, making up nearly 80% of the watershed land cover. Development of any kind made up a very small percentage of the land cover in the ACE Basin creeks (11% in Big Bay and 2% in Wimbee). Conversely, the largest land use component (32%) in the Bulls Creek watershed was \"developed-low, \" and total development land classes for that watershed made up more than half of the land (56%). The total of all development classes made up about 40% of the land cover in Horlbeck Creek, with wetlands (55%) and forests (18%) making up the other significant classifications. These findings supported Reed et al. (2016) , who used a 2000 m radius around each site and 2010 NOAA C-CAP land cover data. They calculated the contribution of forest and wetlands as 75% with 0% developed land; forest and wetlands at Bulls Creek contributed 37%, while \"developed-high\" and \"low\" intensity land categories at Bulls Creek were 7% and 35%, respectively.\nIn addition to land cover, population density was calculated for the EDNA watersheds as an indicator of level of development in each of the creek systems. As expected, the ACE Basin Creeks had the lowest population density with 0.21 people/hectare (ha) at Wimbee and 0.41 people/ha at Big Bay, and the larger population densities were found at Horlbeck (4.63 people/ha) and Bulls Creeks (12.84 people/ha)."}, {"section_title": "STORMWATER RUNOFF MODELING", "text": "Land-based runoff was estimated for three of the four study sites by the Stormwater Runoff Modeling System (SWARM). Wimbee was not included in this analysis because a geographic watershed could not be delineated. SWARM has been calibrated to reflect stormwater runoff generated in the shallow slopes and poorly drained soils of the South Carolina coastal plain (Blair et al. 2014a; Blair et al. 2014b ). We calculated runoff volumes for several design storm scenarios at the three sites. The discharge volume calculated for each of the creeks was compared to potential stormwater runoff calculated by SWARM.\nStormwater runoff volume was calculated for three study watersheds (Big Bay, Horlbeck, and Bulls) for two scenarios: a 2-inch (50-mm) and 4.5-inch (114-mm) design storm. The 50-mm storm reflects a stormwater volume control requirement in Beaufort County, and the 114-mm storm is an approximation of the 2-year, 24-hour design storm typically used in engineering design to account for flood protection. SWARM calculated a modified curve number (CN) of 83 for Bulls Creek and 77 for both Big Bay and Horlbeck Creeks. We have observed that the differences in the potential impact of stormwater runoff are related to both watershed land cover and size of the individual creeks. Big Bay Creek is a third order creek system, and thus has a larger overall discharge volume than either Bulls (second order) or Horlbeck (first order). Although the overall watershed size, creek volume, and modeled stormwater runoff volume were largest at Big Bay, the potential stormwater volume was a very small proportion of the flood or ebb volume in Big Bay Creek. Bulls Creek was the only site out of the three different locations in which the predicted stormwater runoff surpassed the volume of the tidal prism ( Figure 8 ). Whereas Big Bay and Horlbeck have relatively small runoff volumes compared to design storms, especially for the 95th percentile and 2-year, 24-hour storms, the runoff volume at Bulls Creek for the smallest design storm is equivalent to about one-third of the tidal prism. The runoff generated for the 2-year, 24hour storm surpasses the tidal prism volume by about onethird. The runoff predicted for the 25-year, 24-hour storm is about 300% of the tidal prism. The runoff volume at Big Bay does not surpass the tidal prism volume for the four different design storm scenarios. The runoff from the 25-year, 24-hour storm (203 mm) is equivalent to about 22% of the tidal prism in Big Bay Creek. The runoff volume at Horlbeck does not surpass the tidal prism volume for the four different design storm scenarios. The runoff from the 25-year, 24-hour storm Measuring and Modeling Flow Rates in Tidal Creeks (203 mm) is equivalent to about two-thirds of the tidal prism in Horlbeck Creek.\nWatersheds with more development and higher population, such as Bulls Creek, have the potential to generate more stormwater runoff as a result of increased impervious surfaces from roads, homes, and soil compaction. Previous research has used the amount of impervious cover in tidal creek watersheds as an indicator of coastal development; in fact, documented impacts of coastal development on the ecology of tidal creek systems include increased flooding potential and impairment of headwater and intertidal sections due to increases in nonpoint source pollution (Sanger et al., 2015) . Reed et al. (2015; 2016) found that biological (i.e., phytoplankton) growth and biomass responses were augmented in developed systems following inorganic N (ammonium and nitrate) and organic N (urea) additions.\nHypothetically, a rainfall event during high tide could generate more stormwater runoff because more of the marsh platform is inundated or saturated with water. However, the larger volume of water present in the creek at high tide could also help dilute the effect of the influx of nonpoint source pollutants such as nutrients, sediments, and chemicals. Nutrient concentrations in tidal creeks from the two NOAA National Estuarine Research Reserve Systems (NERRs) in South Carolina are highest at low tide and lowest at high tide ( NOAA National Estuarine Research Reserve Systems, 2016). Although nutrient concentrations in the creek water are generally highest at low tide, a storm event occurring at or near low tide could deliver additional chemical or sediment load to the wetland and/or creek due to higher concentrations in the stormwater."}, {"section_title": "RESULTS AND DISCUSSION", "text": ""}, {"section_title": "STAGE AND DISCHARGE RELATIONSHIPS", "text": "The stage and discharge relationship for the tidal creeks had a cyclic pattern and not the traditional \"rating curve\" unidirectional pattern (downstream flow), which is usually observed in nontidal systems. Starting at high-water slack (HWS, Figure 2) , where discharge would be zero with the stage at or near the maximum, discharge increased as the stage decreased as tide ebbs out of the estuary. Peak discharge occurred midway between HWS and low-water slack (LWS); once peak discharge was attained, the discharge rate decreased as the stage decreased to the point of LWS. As the subsequent flood tide commenced after LWS, the discharge increased until nearly the stage of HWS. Rather than a rating curve describing stage versus discharge, the pattern can better be described as a rating ellipse in tidal systems. This illustrates additional important characteristics of the circular stage-discharge \"rating ellipse. \" First, for the same stage, a different discharge on the flood and ebb tide was observed, and therefore the same discharge value occurred at different stages. Generally, for the same stage value, the discharge in the creek was greater for the ebb tide period than for the flood tide. At our four study sites, the peak ebb discharge was always greater than the peak flood discharge. Also, the peak flood discharge occurred at a higher stage than that for peak ebb discharge for all four of our study sites. Wimbee showed the most ebb-dominant and asymmetric pattern of the rating ellipse of all four sites. This is likely due to the large terrestrial land area that drained from the upper Combahee River basin past our monitoring site (Figure 1 )."}, {"section_title": "DISCHARGE AS A FUNCTION OF TIME", "text": "Discharge data for each site were plotted in relation to time before or after HWS. It is important to note here that HWS and high tide are not coincident; neither is LWS and low tide, as is illustrated in Figure 4 . As found in other studies (Leopold et al., 1993) , we have observed a lag between the time at which the water is at its highest stage (part B of Figure  4 ; high tide) and when the water stops moving upstream (part C of Figure 4; HWS) . Similarly, a lag can be seen between when the water reaches its lowest stage (low tide) and when the water stops flowing downstream. In a tidal creek study in California, velocity continued for one-half to one hour after the gage height reached its maximum or minimum; the researchers stated that the inertia of flowing water kept the water velocity flowing in a particular direction until the slope (water-surface elevation of the creek at the mouth compared to headwaters) reversed (Leopold et al., 1993) . The durations of the flood and ebb tides were not symmetrical at the field sites, supported by qualitative observation evidence and previous studies (Blanton et al., 2002) . In general, the Volume 4, Issue 1 (2017) Measuring and Modeling Flow Rates in Tidal Creeks predicted (and observed) duration of the flood tide was longer than that for the ebb (Table 1) for all four study sites.\nWe evaluated three different methods for describing the relationship between discharge and time using a nonlinear regression: (1) we modeled the data collectively (flood and ebb) as a sine function; (2) we separated the data and modeled a unique sine function for the flood and ebb; and (3) we modeled the separate flood and ebb data as individual polynomial equations. We found that each of the three regression models had differences in residual standard error (RSE), cycle duration, peak discharge, and discharge volume (or tidal prism), as shown in Table 1 . The polynomial regression expressions (example in Figure 2 ) appear to more accurately model discharge at each of our four study sites, having the smallest RSE values; however, we believe that a sine function more accurately represents the physical Figure 4 . Discharge as a function of time after high water slack tide for the Lag times between peak flood discharge (A), high tide (B), high water slack (C), and peak ebb discharge (D) . Blue arrowed lines indicated water discharge rate (left-hand y-axis); red box symbols represent transect maximum water depth (right-hand y-axis) . (Boon, 1975; Pethick, 1980; Blanton et al., 2002) . Using the sine functions involves tradeoffs as well. The model that incorporates both the flood and ebb data appears to better reflect the transition of the discharge from flood to ebb; when the data are analyzed separately, the duration of the flood or ebb tide can become too long (e.g., the predicted flood tide duration at Big Bay and Bulls Creeks, as listed in Table 1 ) because the regression model tries to minimize the residuals between the data points rather than match the observed physical phenomena of HWS or LWS (it ends up overshooting the HWS or LWS points). We know that a complete tidal cycle (low tide and high tide) should take about 12 hours and 25 minutes; but the division between flood and ebb tides is unequal in an ebb-dominate system. We expect the flood tide to be longer than the ebb in all models for these systems (Blanton et al., 2002) , but the total duration should be close to 12.5 hours. In Table 1 , the \"sine\" (separate for flood and ebb) model consistently predicts the longest total tidal cycle duration and actually predicts an irrationally long tidal cycle (16.5 hours) for Bulls Creek.\nConversely, when modeling the complete flood and ebb data as one sine function, the model tends to undershoot the peak ebb discharge values and overshoot the peak flood discharge (as is especially evident for Big Bay Creek in Figure   5 ). In Table 1 , the peak flood discharge predicted by \"sine all\" is always greater than the other two models, and peak ebb discharge is always smaller than the other two models. This shows that the model is making tradeoffs in minimizing residuals to try to come up with a single expression to describe two related but very different hydraulic processes.\nIn summary, the three different regression models predict an \"average\" discharge with respect to time at each of the study sites. While the polynomial regression most accurately fits the actual observations, it has no relevance to tidal functions. The sine regression model with the flood and ebb data separated may not provide an accurate prediction for flood or ebb duration, but it appears to predict the peak discharge more accurately. Finally, the sine regression model that incorporates both the flood and ebb data gives a more accurate depiction of duration but underestimates the peak discharge, as shown in Figure 5 . This figure illustrates the results of interpreting all the flood and ebb data at each site to generate a single sine function regression model and parametric bootstrap, which represents the 95% confidence interval for discharge data."}, {"section_title": "PEAK DISCHARGE", "text": "At all four sites, the peak discharge on the ebb was larger than the peak on the flood (Table 1) Measuring and Modeling Flow Rates in Tidal Creeks the ebb), and the smallest peak discharge was estimated for Horlbeck Creek (-8.63 m 3 /s on the flood). The predicted timing of the peak ebb discharge occurred closer to HWS than peak flood discharge, except for on Wimbee Creek. For example, the average peak flood discharge on Big Bay Creek occurred 2.68 hours before HWS, whereas the average prediction for peak ebb discharge occurred about 2.05 hours after HWS, a 37-minute difference. The magnitude of the predicted peak discharge values for both the flood and ebb at Horlbeck and Bulls sites appear more similar than those measured at Big Bay and Wimbee, which show a larger skew toward ebb dominance. Perhaps the larger creek sizes or larger upstream watershed size would also contribute to the more pronounced ebb dominance seen in Big Bay and Wimbee."}, {"section_title": "VOLUME CALCULATIONS", "text": "The resulting regression equations were integrated to determine a total average volume discharged (tidal prism) on the flood and ebb tide for the sampling point along each creek system. From smallest to greatest discharge, the creeks ranked as Horlbeck, Bulls, Wimbee, and Big Bay ( Figure 6 ). All of the creeks, except for Wimbee, had relatively equal discharge on the flood and ebb with the differences being less than 10%. A previous study in tidal creek hydrology found that peak ebb discharge exceeded the flood by more than 50% in some cycles, but the measured volumes entering and leaving the marsh typically differ less than 7% (Boon 1975 ). Thus, Wimbee was a clear outlier, with the ebb discharge exceeding the flood by more than 50%. We believe that Wimbee's ebb dominance was influenced by its distance from the open ocean (it is the furthest inland sampling site) and the fact that the Combahee, a large river that extends even farther inland, discharges into Wimbee; our assumption is that the flood tide influence is less pronounced at this site due to greater inland nontidal water sources (flowing in the ebb direction) and frictional losses to flood tidal energy as the water moves upstream (Blanton et al., 2002) ."}, {"section_title": "YEARLY PRECIPITATION OBSERVATIONS", "text": "Precipitation for water years October 2014-September 2015 and October 2015-September 2016 are illustrated in Figure 7 . Precipitation for each site was referenced to a NOAA climate monitoring station at Charleston International Airport (CHS) for Bulls and Horlbeck Creeks, Yemassee, SC, for Wimbee Creek, and Middleton Plantation on Edisto Island for Big Bay Creek. In 2014-2015, the total precipitation for Charleston Airport (CHS) was 1,360 mm, 1,258 mm for Edisto, and 1,258mm for Yemassee. The annual precipitation increased at all three sites for 2015-2016: 1,895 mm recorded at CHS, 1,524 mm at Edisto, and 1,700 mm at Yemassee. The wettest month for 2015-2016 was October 2015, which is a reflection of Hurricane Joaquin; the precipitation totals for the duration of the storm accounted for about 25% of total yearly precipitation for CHS and Edisto and 15% of the yearly total for Yemassee. Previous work by Reed et al. (2015) showed that precipitation was significantly and positively correlated with concentrations of DOC, including Wimbee Creek and Bulls Creek, suggesting that rainfall markedly impacts the delivery of DOC and potentially other nutrients from the land to the receiving waters."}, {"section_title": "IMPLICATIONS", "text": "Tidal distortion in these coastal wetland systems is a result of the frictional distortion in creek channels and intertidal storage in marshes and tidal flats (Friedrichs et al., 1988) . The distortion of the time it takes for the water to move from HWS to LWS (ebb tide) or LWS to HWS (flood tide) affects the water velocity and thus discharge. In the four creeks in this study, we have observed ebb-dominated creek systems typical of the Southeast. In an ebb-dominated system, the length of time of the flood is longer than that of the ebb, but the peak discharge on the ebb is greater. This has two implications. First, the systems are essentially moving the same volume of water, or tidal prism. If the duration of the ebb tide is shorter than the flood tide, the water velocity on the ebb must be higher to get the same volume of water out. Second, if the ebb current is dominant, the higher velocities on the ebb have the potential to move a greater load of sediment (Dronkers, 1986; Friedrichs et al., 1988; Huang et al., 2008) and other nonpoint source pollution, such as chemicals, bacteria, and viruses, from the headwaters out to the estuaries (Sanger et al., 2015) . The ebb dominance was most pronounced at Wimbee Creek, which had almost twice the volume of water moving past our study site on the ebb than for the flood tide ( Figure 6 ). We suspect that this creek behaved differently from our other three sites because it is located relatively further inland and away from the coast. The flood tide loses more energy as it moves father up the tidal creek, reducing the total volume of water delivered to this site. Furthermore, Wimbee Creek is connected to the Combahee River, a large system that has nontidal and tidal inputs and does not have true headwaters. We believe that the force of the nontidal headwater inputs from the Combahee River contribute to the overall larger ebb discharge on Wimbee Creek.\nWe found that for site-specific discharge data related to time, a polynomial regression model provided the best fit for the data. However, future work could include developing a more robust regression equation incorporating multiple sine functions to more accurately predict discharge as a function of time. We still believe the single sine function has merit for predictive capabilities, and we are working to develop relationships between the discharge and the morphometric characteristics of each creek (such as velocity, width, and depth, as shown in Appendix B) to allow discharge estimates to be made at other tidal creek systems that are not gauged.\nDue to limitations of time and funding, we were only able to make seven visits to each site (except Big Bay, which we visited six different days). As we will be able to add more time/discharge observations in the future, we should be able to generate regression models for more specific tidal conditions. For example, we could choose to analyze the data from spring and neap tidal conditions separately. Currently (2017), our regression models include a wide variation of tidal conditions, and even our 95% confidence intervals on the discharge predictions miss many \"outlier\" conditions (as can be seen in Figure 5 , with many data points lying outside of the gray swath of curves).\nFuture work will build off of these models to estimate nutrient fluxes in tidal wetlands. Moving forward, we will evaluate the nutrient types and concentrations at mid-ebb and mid-flood at each of the four study sites for spring and summer samplings in 2015 and 2016. We hope to determine (1) if there are significant differences in nutrient concentrations and loads on the ebb versus the flood and (2) if there are differences between nutrient loads between sites and (3) if these loading differences are indicative of an underlying hydrodynamic phenomena that may help explain nutrient (nitrogen and phosphorus) fluxes and the respective biologic responses (e.g., phytoplankton growth). The future work will focus on not just how much nitrogen is in the water (loading) but also how the specific type of nitrogen (chemical form) influences phytoplankton composition. Furthermore, we postulate that the changes in nutrient concentrations are Volume 4, Issue 1 (2017) Ellis, Callahan, Greenfield, Sanger, Robinson, Jones appenDix a: SaMple Velocity MeaSureMentS anD hyDraulic geoMetry curVeS Measuring and Modeling Flow Rates in Tidal Creeks "}]