[{"section_title": "Abstract", "text": "Background-There is a direct association between level of lung function, measured by forced expiratory volume in 1 second (FEV 1 ) and mortality rates. A low FEV 1 may result from an increased decline in FEV 1 with age, which may be an independent predictor of mortality. Objective-To examine the association between decline in FEV 1 and mortality in a cohort from a community health study. \nSetting and methods-From\nConclusion-Decline in lung function, measured by FEV 1 is a predictor of death, independent of average FEV 1 and risk factors for cardiovascular disease. (J Epidemiol Community Health 1999;53:230-234) Numerous studies have now established that there is an association between level of lung function (ventilatory performance) and mortality from cardiovascular diseases, cancer, respiratory diseases, and from all cause deaths.\nThe parameter of lung function most often studied for these observations is the forced expired volume in one second (FEV 1 ). The level of FEV 1 at any time in an adult will be determined by the level attained by growth from childhood to early adulthood, the duration of the plateau of FEV 1 in early adult life, and the subsequent rate of decline with age.\nTwo published studies and an abstract publication have shown evidence that decline in lung function is a predictor of mortality.\nThe Honolulu Heart Study showed the rate of decline in lung function over a six year period was a significant predictor of total mortality in men and that the association was stronger for current or ever smokers than never smokers. "}, {"section_title": "", "text": "Numerous studies have now established that there is an association between level of lung function (ventilatory performance) and mortality from cardiovascular diseases, cancer, respiratory diseases, and from all cause deaths. [1] [2] [3] [4] [5] [6] [7] [8] [9] [10] [11] [12] [13] [14] [15] [16] [17] The parameter of lung function most often studied for these observations is the forced expired volume in one second (FEV 1 ). The level of FEV 1 at any time in an adult will be determined by the level attained by growth from childhood to early adulthood, the duration of the plateau of FEV 1 in early adult life, and the subsequent rate of decline with age. 18 Two published studies and an abstract publication have shown evidence that decline in lung function is a predictor of mortality. [19] [20] [21] The Honolulu Heart Study showed the rate of decline in lung function over a six year period was a significant predictor of total mortality in men and that the association was stronger for current or ever smokers than never smokers. 19 In the Baltimore Longitudinal Study of Aging, the rate of decline in lung function was an independent predictor of mortality from coronary heart disease in men who were initially free of coronary heart disease. 20 In white adults from six cities in the United States the all cause mortality was highest in both men and women with the highest declines in FEV 1 . 21 The mechanism for this association has not been determined.\nLung function was measured in five cross sectional surveys of men and women in the town of Busselton in Western Australia from 1969 to 1981. The aim of this study was to examine the association between decline in lung function and mortality and to see if any association could be explained by smoking or cardiovascular disease risk factors."}, {"section_title": "Methods", "text": "The Busselton health study has comprised a series of cross sectional surveys of adults and children from the Shire of Busselton. Busselton is coastal, rural, has a Mediterranean type climate and the population is predominantly of European origin. Cross sectional surveys of adults listed on the electoral roll were undertaken at intervals of three years from 1966 to 1981. Enrollment to vote is compulsory in Australia. The cohort for this longitudinal study comprises 751 men and 940 women, aged 25 to 79 years, who first attended a survey in 1969 or 1972 or 1975 and attended two further surveys and therefore had a baseline and two follow up measurements of lung function over a six year period.\nThe health related data gathered in each survey included demographic variables, general health and lifestyle variables, health history variables, and physical, biochemical, haematological, and immunological measurements. General descriptions of the surveys and two reviews of some results have been published.\nMcDermott dry spirometer. All values obtained were the volume at body temperature and pressure and saturated with water vapour corrected (BTPS). The FEV 1 from each survey used for analysis was the highest from three successive maximum expiratory manoeuvres provided that at least two recordings were within 10% of each other. Decline in lung function was taken as the change of FEV 1 in litre per year using the slope of the linear regression equation of this highest FEV 1 from each of three surveys over the six year period.\nParticipants were asked to report if they had ever been treated for bronchial asthma (1969 and 1972) or asthma (1975) . Smoking, alcohol consumption, and use of antihypertensive medication were obtained from a questionnaire. This information was not checked by other sources. Smoking was categorised as never, ex or current smokers. People consuming less than 20 grams of alcohol per day were classified as light drinkers and those consuming 20 or more grams per day as heavy drinkers.\nSystolic and diastolic blood pressure were measured by mercury sphygmomanometer after five minutes in a resting position. Height and weight were measured and body mass index (weight (kg) divided by height (metres) squared) was calculated. Serum total cholesterol was determined from a fasting blood sample. Coronary heart disease was determined from the Rose questionnaire for angina and myocardial infarction, a 12 lead electrocardiogram, and a self reported confirmation that their doctor had said they had heart disease. There were too few deaths attributable to respiratory disease for analysis.\nCox proportional hazards regression was used to assess the relation between average FEV 1 and decline in FEV 1 (simultaneously) and mortality after adjusting for age, height, smoking, coronary heart disease, and cardiovascular risk factors. 27 The eVect of average FEV 1 or decline in FEV 1 on mortality was expressed as a hazard ratio (relative risk). If the 95% confidence interval for the hazard ratio excludes 1.0 then the estimated hazard ratio was considered statistically significant. Three mortality rates were analysed; all causes, cardiovascular disease, and coronary heart disease. All variables were taken from the first assessment for each person except for average FEV 1 , which was the average of the highest FEV 1 measured at each of their three survey attendances, and for decline in FEV 1 (litre/ (table 2) . Approximately half of the deaths were attributable to cardiovascular disease and about one third of deaths to coronary heart disease. There was a significant association between average FEV 1 and all cause mortality for men and women, after adjusting for smoking, history of asthma, coronary artery disease, and cardiovascular disease risk factors (table 3) . The strength of the association was greater in women than in men, the hazard ratio for a decrease in average FEV 1 of 1.0 litre was 1.60 for all women and 1.43 in all men. The trend for higher risk of death with average FEV 1 was seen for all smoking categories in both sexes apart from men who never smoked cigarettes. The association was statistically significant only for men who were current smokers and women who were ex smokers. The relative risk of death from cardiovascular disease and coronary artery disease was greater, although not statistically significantly greater than 1, in all categories apart from men who never smoked tobacco.\nAfter adjusting for average FEV 1 , the decline in FEV 1 , in litre per year, was significantly associated with death from all causes in women, after further adjusting for age, height, history of asthma, smoking habits, coronary heart disease, and cardiovascular disease risk factors (table 3 ). An increase in the decline of FEV 1 of 50 ml per year was associated with a 22.4% increased risk of death from all causes (95% confidence intervals, 5.2%, 42.6%). The trend for a greater decline in FEV 1 being associated with increased risk of death from cardiovascular and coronary heart disease was seen but not statistically significant.\nIn men the level of association between decline in FEV 1 and death was in general less than in women and not statistically significant for any association. Again, men who never smoked tobacco were diVerent from the other groups with hazard ratio for death being less than 1, however these hazard ratios did not reach the level of statistical significance."}, {"section_title": "Discussion", "text": "This study provides further evidence for an association between decline in FEV 1 and mortality, independent of risk factors for cardiovascular disease, cigarette smoking, and average FEV 1 . The women in this study had an increased risk of death from all causes that was statistically significant for the whole group and for the group of women who had never smoked tobacco. The women also had similar patterns of association between decline in FEV 1 and death resulting from cardiovascular disease and from coronary heart disease. In men there was a similar trend for these associations except for the group who had never smoked tobacco.\nLongitudinal studies of FEV 1 in populations have allowed observations on normal persons and examination of factors associated with an increased decline in FEV 1 . 18 Estimates of the decline in FEV 1 in never smokers show a variation with age; in subjects aged 25-50 the FEV 1 falls by about 15-30 ml per year and after age 50 this increases to 30-50 ml per year. 18 The magnitude of decline is slightly greater in men than women. 18 In a summary of several studies, Kerstjens and colleagues concluded that men who were moderate to heavy smokers have, on average, a 15 ml per year greater decline than non-smokers. The eVect was slightly lower in women. 18 Other risk factors for an accelerated decline in FEV 1 from studies of general populations are airway hyper-responsiveness, atopy, childhood respiratory infections, air pollution, and occupational hazards. 18 In addition, accelerated decline in FEV1 is likely to be present in many respiratory diseases. The finding of an association between decline in FEV 1 and mortality in women adds to the similar findings in men reported in the two published studies. 19 20 In a (preliminary) report of a study that included both women and men Xu and colleagues found an association between decline in FEV 1 and mortality that was stronger in women. 21 The number and age range of the men included in the present study was similar to the men in the Baltimore Longitudinal Study of Aging 20 whereas the Honolulu Heart Program 19 was larger (4000 subjects) and included only men aged 45 to 68 years. The study of Xu et al 21 was also larger than our study with 2607 men and 3223 women but had a similar age range of 25 to 74 years. The time period when the cohorts were assembled and duration of follow up was similar in all three studies.\nThe magnitude of the eVect in this study was that in women a 50 ml per year increase in decline in FEV 1 was associated with a 22% increase in the risk of death from all causes and in men an 8.2% increase in death from all causes. In the Honolulu Heart Program 19 the relative risk for total mortality was 1.48 when comparing the tertile with the highest change in FEV 1 (a decrease of 61 ml per year) with the tertile with the lowest change in FEV 1 (an increase of 9 ml per year). In the Baltimore Health Study 20 the relative risk for death resulting from cardiac disease was greater; the quintile with the highest decline in FEV 1 had a relative risk of death of 3.27 compared with the quintile with the smallest decline in FEV 1 . In the study of Xu et al 21 the average relative risk associated with an increase of 30 ml per year in decline in FEV 1 were 1.26 in women and 1.11 in men.\nRodrigues et al postulated four hypotheses to explain the association between decline in FEV 1 and mortality. 19 Firstly, a larger decline in FEV 1 leads to death from obstructive or non-obstructive respiratory diseases. This does not explain the association seen in the present study. There were too few deaths from respiratory disease in the Busselton cohort to analyse and the increased risk for death with greater decline in FEV 1 was attributable to all causes of death that were predominantly cardiovascular disease and coronary heart disease although relative risks for these causes separately were not statistically significant. This probably reflects the size of the study. In the Baltimore Longitudinal Study of Aging the association was with cardiac death and independent of death because of lung disease. Secondly, it is possible that the increased change in FEV 1 is a mark of existing disease that ultimately results in death. To avoid this problem deaths that occurred within three years of the final measurement of FEV1 were excluded from analysis. The Honolulu Heart Study was analysed with and without deaths occurring within the first five years of follow up; this comparison showed a similar pattern of association although the magnitude of the association was reduced when deaths within five years were excluded. 19 Thirdly, the association between decline of FEV 1 and total mortality could be because of confounding. The principal factor associated with decline in FEV 1 and death is cigarette smoking and results are similar for all smoking categories apart from non-smoking men. The relative risk has been adjusted for asthma, which may be associated with an increased decline in FEV 1 29 and an increased risk of death. 30 There is no obvious relation between cardiovascular risk factors and decline in FEV 1 . We were unable to adjust for factors such as air pollution, occupational hazards, airway hyperresponsiveness, and childhood respiratory infections, which have been associated with a more rapid decline in FEV 1 . 18 Air pollution is minimal in Busselton.\nThe fourth postulate was that FEV 1 decline by itself contributes to the development and the progression of the disease that ultimately results in death predominantly because of cardiovascular disease. The mechanism of such a direct eVect is not clear.\nAn association between FEV 1 and mortality demonstrated in this study has been well reported. [1] [2] [3] [4] [5] [6] [7] [8] [9] [10] [11] [12] [13] [14] [15] [16] [17] It has been suggested that the rate of the decline in FEV 1 is greater in persons with a lower FEV 1 , the so called \"horse racing eVect\" although this is debated. 31 In this study the eVect of decline in FEV 1 on death was examined after adjusting for each subject's FEV 1 using the average FEV 1 of three measurements over the six year period.\nMethodological factors that may influence the accuracy of the results include repeated measures of lung function, ascertainment of death and cause of death, and the selection and number of subjects studied. There are well recognised sources of error in the measurement of lung function and the study was performed before first publication of recommendations for standardisation of measurement of FEV 1 . 33 Period eVects whereby the learning experience and perhaps changes in technique lead to a systematic increase in results that would tend to reduce the magnitude of decline in FEV 1 . The decline in FEV 1 found in this group was similar to values previously reported. 18 32 A few deaths among people who have left the state of Western Australia may have been missed. The underlying cause of death was determined from the death certificates, which are sometimes inaccurate; in the other two published studies medical records of deceased subjects were reviewed by a panel of physicians to determine the cause of death. 19 20 A more accurate ascertainment of cardiac death may explain why a stronger association was seen in the Baltimore study in which there were 79 cardiac deaths from 883 subjects in the cohort whereas there were 81 deaths in 751 men attributed to coronary heart disease in our study. The subjects in this study were those who voluntarily attended two follow up assessments in a six year period and may not be representative of the community in general.\nTherefore, this and other studies have shown that lung function, measured by FEV 1 , both as an absolute level and the rate of decline with age is a predictor of death from all causes and"}]