[{"section_title": "Introduction", "text": "SARS-CoV-2 causes pneumonia-associated respiratory syndrome, like coronavirus SARS-CoV and MERS-CoV [1] . An ongoing outbreak of SARS-CoV-2 started from the Huanan Seafood Wholesale Market in Wuhan, China since December of 2019. The genome sequence of SARS-CoV-2 is 89.1% identical to bat SARS-like-CoVZXC45 and 96% identical to bat CoV RaTG13, suggesting that bat is the origin of SARS-CoV-2 [2e4]. A familial cluster of pneumonia associated with the SARS-CoV-2 and a retrospective study indicated person-to-person transmission [5] . Moreover, people seem to be generally susceptible to this strongly infectious disease. WHO has listed the novel coronavirus-infected pneumonia as Public Health Emergency of International Concern (PHEIC). Cases have already been diagnosed in dozens of countries.\nThe genome sequence of SARS-CoV-2 is 82% identical to SARS-CoV [4] . Angiotensin converting enzyme II (ACE2) was identified as the cell entry receptor of SARS-CoV-2 to infect human, similar to SARS-CoV [6] . ACE2 belongs to the angiotensin-converting enzyme family and catalyzes the cleavage of angiotensin II into the vasodilator angiotensin 1-7. ACE2 is enriched in the epithelia of lung [7] , while single-cell RNA-seq data analysis of ACE2 expression reveals potential risks of more human organs vulnerable to SARS-CoV-2 infection [8] . In reproductive system, single-cell transcriptomes of adult human testis showed high expression of ACE2 in spermatogonia, Leydig and Sertoli cells [9] . Coronaviruses are prone to mutation and recombination due to their error-prone RNA-dependent RNA polymerase (RdRP) [10] , and virus variation may allow some subtypes of the virus to better bind to the receptor ACE2. Therefore, it is very important to reveal how ACE2 expression is regulated for both prevention and treatment of the infectious diseases caused by these coronaviruses in the future.\nThe major epigenetic markers in mammals include covalent modifications of DNA and post-translational modifications of histones. Since the N-terminal of histone is exposed to the surface of nucleosome, histone can undergo dynamic chemical modifications including methylation, acetylation, phosphorylation and ubiquitination [11] . Methylation of H3 lysine residues such as K4, K9, K27 and K36 are intensively studied because of their high correlationship with transcriptional activity. K-to-M mutants of histone H3.3 play a dominant-negative role to suppress specific histone H3 methylation and are valuable tools for screening regulatory pattern of gene expression. During mammalian embryonic development, H3K27me3 is associated with transcriptional silencing and is involved in repressing key developmental genes during embryonic stem cell (ESC) differentiation. H3K27me3 is catalyzed by the polycomb group (PcG), a group of conserved transcriptional gene repressors. EZH2 (enhancer of zeste homologue 2) is a human homologue of enhancer of zeste in drosophila and the key member of PcG [12, 13] , which is composed of PRC1 and PRC2 complexes [14] . EZH2 encodes the catalytic subunit of PRC2 and functions as a histone methyltransferase of H3K27 dimethylation and trimethylation [15] for silencing at specific genomic loci [16] . In ESCs, EZH2mediated H3K27me3 is necessary for cell identity and cell differentiation [17] .\nTo study the epigenetic regulation of ACE2 expression, we detected the level of Ace2 expression by overexpression of K-to-M H3.3 mutants in mouse germ cell line GC-2 (GC-2 spd, transformation of freshly isolated mouse spermatocytes). Then we compared the levels of ACE2 expression and its epigenetic status at promoter region before and after EZH2 knockout in human ESCs. Generally, we found that EZH2-mediated H3K27me3 inhibits ACE2 expression, and this pattern may be conserved among mammalian cells. Our study provides clues for prevention and targeted therapy of coronavirus disease 2019 (COVID-19)."}, {"section_title": "High-throughput sequencing data analysis", "text": "For RNA-seq data, raw reads were processed with cutadapt v1. 16 to remove adapters and perform quality trimming with default parameters except for: quality-cutoff ¼ 20, pair-filter ¼ both. Trimmed reads were mapped to the mouse/human genome (GENCODE release M23/33), using STAR (v2.5.1b) with default settings. RSEM was used to calculate FPKM value. Reported RNAseq data was from GSE83115 (RNA-seq of 14 Human Tissues), GSE36552 (RNA-seq of human early embryos and ESCs), GSE76626 (ChIP-seq and RNA-seq of EZH2-deficient human ESCs), GSE122876 (RNA-seq of MERS-CoV infected Calu-3 cells), GSE147507 (RNA-seq of SARS-CoV-2 infected primary human bronchial epithelial cells). Analyzed ChIP-seq data was from GSE76626."}, {"section_title": "Ace2 expression was enhanced by SARS-CoV-2 infection", "text": "We examined transcriptome of human tissues [18] to find that ACE2 is abundantly expressed in heart, kidney, testis, colon and gut (Fig. 1a) , indicating the risk of multiple organs to be targeted by SARS-CoV-2.\nACE2 expression was reported to be upregulated after infection of various viruses [19] . Here, we examined the transcriptome of cells originated from human lung and found that 24-h infection of SARS-CoV-2, but not MERS-CoV [20] which does not use ACE2 as cell receptor, led to enhanced ACE2 expression (Fig. 1b) , probably accelerating replication and spread of the coronavirus."}, {"section_title": "Ace2 expression was increased by H3K27me3 inhibition in male germ cell line by RNA-seq", "text": "To investigate epigenetic regulation of ACE2 expression, we chose mouse germ cell line GC-2 as the model. Previously, we used transposon to convey wildtype or dominant negative H3.3 mutants H3.3K4/9/27/36 M into GC-2 cell lines, followed by stable cell line generation for RNA-seq analysis [21] . The overexpression of H3.3 Kto-M mutants inhibited endogenous H3K4/9/27/36me3 respectively through sequestering catalytic SET domains of corresponding histone methyltransferases. Notably, we identified that Ace2 was significantly upregulated when H3K27 M was overexpressed to inhibit H3K27me3 level in GC-2 cells. In contrast, the levels of Ace2 expression were similar to the control group when H3.3 K4/9/36 M was overexpressed (Fig. 2a) . In comparison with Ace2 expression change, Gapdh gene had consistent expression in all these cell lines (Fig. 2b) . Above result indicated that Ace2 expression was specifically orchestrated by global H3K27me3."}, {"section_title": "ACE2 expression was upregulated upon EZH2 knockout in human ESCs", "text": "We found that ACE2 is highly expressed in human preimplantation embryos shown by RNA-seq result [22] (Fig. 2c) . Further examination showed that its expression peak is different from cleavage embryonic genes (Fig. 2d) or pluripotent genes (Fig. 2e) , indicating that regulation of ACE2 expression is independent of cell fate control. A more recent report showed that the nucleocapsid protein of SARS-CoV-2 greatly dampened pluripotency of human induced pluripotent stem cells and turned them into fibroblasts [23] . Note that preimplantation embryos are manipulated in vitro in assisted reproductive technology, handling of them should be especially cautious to avoid infection and transmission of SARS-CoV-2.\nHere, we chose human ESC as the model to study transcriptional regulation of ACE2, and found that ACE2 level was upregulated after EZH2 knockout and recovered to a similar level as control group after adding EZH2 back [24] (Fig. 2f) . This trend was consistent with that of mouse GC-2 cells. EZH2 regulates developmental factors in human ESCs for cell fate decision. However, the levels of cleavage embryonic genes (Fig. 2g) and pluripotent factors (Fig. 2h) were not influenced after EZH2 knockout [24] , supporting that change of ACE2 expression was not caused by cell fate change. Taken together, our analysis indicated that presence of EZH2 impeded ACE2 expression."}, {"section_title": "Upregulation of ACE2 upon EZH2 knockout correlated with changed histone modifications", "text": "EZH2 catalyzes H3K27me3 at target promoters for gene silencing. In order to determine whether EZH2 inhibits ACE2 expression by mediating histone modifications, we analyzed ChIPseq data of wildtype, EZH2-deficient and EZH2 add-back human ESCs. ChIP-seq analysis showed that H3K27me3 level was decreased at ACE2 promoter region after EZH2 was knocked out [24] (Fig. 3a) . Meanwhile, there was a significant increase of acetylation of H3K27 (H3K27ac) levels at ACE2 promoter in EZH2deficient ESCs [24] (Fig. 3b) , supporting an antagonism between H3K27 acetylation and trimethylation. In agreement with above result, H3K27me3 and H3K27ac at ACE2 promoter were reestablished upon EZH2 restoration [24] (Fig. 3a and b) . H3K4me1 (Fig. 3c) and H3K4me3 (Fig. 3d ) levels at ACE2 promoter area were also examined and no obvious change was observed upon EZH2 disruption [24] , which indicated no crosstalk between H3K27 and H3K4 trimethylation at ACE2 promoter. Taken together, our analysis demonstrates that EZH2-mediated H3K27me3 inhibits ACE2 expression."}, {"section_title": "Discussion", "text": "Usually, coronavirus is a relatively common human virus and causes a cold. In the 21st century, three coronaviruses caused acute respiratory syndrome severely were discovered: SARS-CoV, MERS-CoV and SARS-CoV-2. Spike protein of the coronavirus can bind to the receptor protein on the host cell membrane, thereby helping the coronavirus enter into the host cell. Both SARS-CoV and SARS-CoV-2 infect human respiratory epithelial cells through the interaction of spike protein with human ACE2, and only cells expressing ACE2 can be infected with SARS-CoV-2 in vitro [25] . Therefore, characterization of ACE2 may become a breakthrough in related study on SARS-CoV-2.\nACE2 is located on the X chromosome, and is expressed widely in different tissues and cell types. SARS-CoV-2 may target multiple organs in the human body, causing various organ dysfunctions. The digestive system and other human organs including heart is a potential route of 2019-nCov infection based on single-cell RNA-seq data analysis on the receptor ACE2 expression [8, 26] . ACE2 Expression in cholangiocytes, kidney and testis may cause liver, kidney and testis damage after SARS-CoV-2 Infection [27, 28] . ACE2 encodes a type I transmembrane glycoprotein, a key molecule of the renin-angiotensin-aldosterone system (RAS). ACE2 is mainly composed of two domains. Its N-terminus is a zinc metallopeptidase domain similar to that of ACE. Its C-terminal domain is more conserved with collectrin, a non-catalytic protein involved in amino acid reabsorption in kidney and pancreatic b-cell proliferation. ACE2 is an important candidate gene for pathogenicity in a hypertensive rat model [29] . Therefore, ACE2 may be a potential target for the treatment of hypertension. ACE2 also plays an important role in maintaining normal heart function, and cardiac dysfunction was identified in Ace2-depleted mice [30] . People with high level of ACE2 may be more susceptible to SARS-CoV-2 and get more severe symptoms. The expression level of ACE2 in the lung is positively correlated with smoking, which explained partly that the smokers, most of whom are medium-elderly, are more susceptible to SARS-CoV-2 [31] . Meanwhile, there is no difference observed in the expression level of ACE2 between male and female. In addition, the expression level of ACE2 did not differ significantly in ACE2 highly expressed tissues between different races, which suggested regulatory mode of ACE2 expression applies to different races including Asian, African and European [32] . Moreover, ACE2 expression was significantly higher in adipose tissue (including subcutaneous fat and visceral fat) and some specific tumor tissues than in the lung, which suggested that obese population and certain types of cancer are more susceptible to the new coronavirus [33] .\nTo study whether ACE2 gene expression is affected by specific epigenetic modifications, we firstly analyzed the transcriptome of mouse GC-2 after forced expression of H3.3 K-to-M mutants and identified that Ace2 gene expression is specifically associated with H3K27me3 modification. To examine whether impact of H3K27me3 level on ACE2 expression is also true in human, we next analyzed RNA-seq and ChIP-seq data in EZH2-deficient human ESCs, and the result demonstrated that EZH2-mediated H3K27me3 inhibits human ACE2 expression. Further studies are needed to examine this phenomenon in more human cells and test whether infection of the new coronavirus leads to epigenetic changes. In summary, multiple factors regulate ACE2 expression (Fig. 4) , and our study indicates that EZH2 activity seems to be a promising candidate to orchestrate ACE2 expression. Our analysis provides clues for pathogenesis and targeted therapy of coronavirus disease 2019 (COVID-19)."}, {"section_title": "Declaration of competing interest", "text": "The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. "}]