[{"section_title": "Abstract", "text": "Increasing income inequality particularly since the economic crisis of 1997 has called attention to the issue of growing educational inequality in South Korea. Although much recent research has been directed at understanding the socioeconomic gap in academic achievement, few studies have empirically examined how this gap has changed over time during the past decade in South Korea. Using nationally representative data for the most recent three cohorts (1999, 2003, and 2007) of eighth-grade South Korean students from Trends in International Mathematics and Science Study (TIMSS), this study examines trends in the relationship between socioeconomic background and student achievement. The eighth-grade TIMSS data demonstrate that the influence of socioeconomic background on student achievement has increased over time during the past decade, offering evidence of growing educational inequality in South Korea. Various factors may contribute to higher educational inequality, including the widening income gap and recent educational transformations geared toward school choice and tracking."}, {"section_title": "INTRODUCTION", "text": "Over the half century from 1950 to 2000, the Republic of Korea (hereafter South Korea) has achieved remarkable economic and educational development. From an economic perspective, it has achieved rapid economic growth, with per capita income rising from under US$100 in the 1950s to more than US$16,000 in 2000 (Organisation for Economic Co-operation and Development [OECD], 2009) . From an educational perspective, it has experienced dramatic expansion, with the participation rate of young people in secondary education rising from approximately 20% in 1945 to almost 100% in 2000 (Ministry of Education, Science, and Technology [MEST], 2009a) . In this process of dramatic economic and educational transformation, many South Koreans have benefited significantly from the expansion of educational opportunities. As a result, the majority of South Koreans believe that they and their children will achieve upward mobility through education if they work hard (Seth, 2002) .\nHowever, increasingly, this meritocratic belief has been threatened by the emerging inequality in income distribution, particularly since the economic crisis of 1997. Increasing social polarization has called attention to the issue of growing educational inequality in academic achievement among South Korean children (Kim, 2005) . Although much recent research in the sociology of education in South Korea has been directed at understanding the socioeconomic gap in academic achievement, few studies have empirically examined how this gap has changed over time during the past decade. Accordingly, the purpose of this study is to investigate the issue of the growing educational inequality in South Korea during the past decade.\nOne useful way of assessing inequalities in learning opportunities is to examine the extent to which socioeconomic background relates to students and their school performance (OECD, 2007; Willms, 2003a Willms, , 2003b Willms, , 2006 . If student and school performance were to strongly depend on socioeconomic background, large inequalities in the distribution of learning opportunities might remain. In contrast, if students and schools were to perform well irrespective of socioeconomic background, learning opportunities might be more equally distributed. Employing this analytic strategy, we examine the trends in the relationship between socioeconomic background and student achievement in South Korea in the past 10 years, using nationally representative data for the most recent three cohorts (i.e., 1999, 2003, and 2007) of eighth-grade South Korean students from the Trends in International Mathematics and Science Study (TIMSS) database.\nThe international TIMSS database is especially useful for our study because it allows us to compare the observed trends in the relationship between socioeconomic background and student achievement in South Korea to those of other world regions, including the United States. The U.S. case is particularly interesting because its recent educational efforts such as No Child Left Behind (NCLB) have focused on boosting student achievement of low performing, poor, and minority students (Loveless, Parkas, & Duffett, 2008) . This effort contrasts with South Korea's recent educational reforms focusing on raising student achievement of highachieving students in the name of promoting excellence (Kim, Cho, Na, Cha, & Gim, 2004; Kim, Lee, & Cheong, 2008 ; Ministry of Education [MOE], 2004) . Therefore, although this study aims to inform South Korean policymakers and scholars about educational inequality, findings can also inform U.S. educational researchers and policymakers, as well as those worldwide.\nIt is important to note that this study does not examine the causal link between specific educational reform strategies (e.g., tracking) and the widening socioeconomic gap in student achievement. Rather, we aim to offer empirical evidence on the growing educational inequality in South Korea. The next section provides a brief description of recent socioeconomic and educational changes in South Korea and discusses their implications for the growing educational inequality. Next, we describe the methodologies of this study. We then examine the changes in the estimated effects of socioeconomic background on student achievement over time by using the TIMSS data. Finally, the chapter concludes with a discussion of the results.\nrelatively slow rate of growth, with the average annual growth of approximately 7% between 1999 7% between and 2007 7% between (OECD, 2009 .\nThe impact of the economic crisis of 1997 in South Korea has gone beyond its economy. Since 1997, income inequality has been rising, as evidenced by several indicators. For example, the Gini coefficient, measuring the inequality of income and ranging from 0 (perfect equality) to 1 (perfect inequality), rose from .30 in 1999 from .30 in to .32 in 2007 from .30 in (Park, 2008a . This trend indicates that wealth has been increasingly concentrated in the hands of the few. Indeed, the ratio of the average household income of the top 20% of the income distribution to that of the bottom 20% increased from 5.15 in 1999 to 6.12 in 2007 (Park, 2008a) .\nFurther, the number of nontraditional (single-parent) families has been increasing in the South Korean society over the past decade, reflecting the dramatic increase in divorce particularly since the late 1990s (Park, 2008b) . Fig. 2 shows the recent trend in the crude divorce rate (CDR: the number of divorce per 1,000 population) from 1991 to 2008 in South Korea (Korea National Statistical Office [KNSO], 2009a) . South Korea's divorce rate rose from 1.1 in 1991 to 2.5 in 1999, and rose further to 3.4 in 2003. Although it has been decreasing over the past few years, South Korea's divorce rate still remains relatively high in comparison to other countries. For example, in 2006, South Korea's divorce rate was 2.5, whereas the corresponding rates in Japan and Germany were 2.0 and 2.3, respectively (United Nations Statistics Division [UNSD], 2008) .\nIn addition to these transformations, another important demographic change in the past few decades is the dramatic decline in the fertility rate. Finally, the population of South Korea, once self-portrayed as an ethnically homogeneous nation, has been becoming more racially, ethnically, and culturally diverse as a result of a dramatic increase in immigration and international marriages. The number of migrant workers in South Korea has dramatically increased over the past two decades. Fig. 4 shows the growth in the number of migrant workers in South Korea from 1981 to 2008 . Sources: Seol (2005) and Yoon (2008) . (Seol, 2005; Yoon, 2008) . In 1981, there were less than 10,000 migrant workers in South Korea; two decades later in 2008, there were more than 540,000 migrant workers. Likewise, international marriages have rapidly grown in South Korea particularly since the late 1990s. International marriages had accounted for only 3.2% of the total number of marriages in 1997; they constituted more than 10% of the total number of marriages a decade later (Yoon, 2008) ."}, {"section_title": "Recent Trends in South Korea's Secondary Schooling", "text": "Over the past three decades, educational opportunities have dramatically increased for South Korean children. The growth of postsecondary education has been more dramatic in proportional terms than that of primary and secondary education over the recent decades. The advancement rate from upper secondary to postsecondary education was less than 30% in 1970, but it went up to more than 80% in 2005. In other words, these days, 8 out of 10 South Korean high school graduates go on to college. This dramatic expansion has resulted in a large gap in higher education attainment between the young and the old generations in South Korea. In fact, South Korea currently shows the largest generation gap in high educational attainment among OECD countries (Organisation for Economic Co-operation and Development [OECD], 2008) .\nIn general, South Korean secondary education is organized along egalitarian educational policies (Kim & Lee, 2003) . South Korea's egalitarian approach to education can be best described by its randomized school assignment policy in which (with a few exceptions 2 ) most secondary school students are assigned to schools within their residential areas by a random lottery system. Because this policy applies to both public and private schools, there has been little variation between the two sectors in terms of students' academic abilities. In addition, because South Korean private schools are to a large extent subsidized and controlled by the government, there has been relatively little variation between private and public schools in terms of school resources and curriculum (Ministry of Education [MOE], 1998) .\nHowever, since the mid-1990s when educational excellence emerged in South Korea as a key issue regarding national competitiveness in the global market, there has been an important shift from this egalitarian approach to the market-oriented one in South Korean secondary education. In particular, South Korea's random school allocation policy in upper secondary education, known as the High School Equalization Policy 3 (HSEP), has been heavily criticized as being a representative regulatory policy that would undermine excellence in education (Kim & Lee, 2003) . The HSEP was first introduced in 1974 to address social and educational problems that were caused by the excessive competition to enter elite high schools (MOE, 1998) .\nBefore 1974, upper secondary education in South Korea was based on a national free competition system. Students were allowed to choose their schools, and individual high schools were allowed to select their students through their own entrance exams. In those days, a few elite high schools, most of which were public and located in large cities such as Seoul (the capital and the largest city) and Busan (the second largest city), selected only those students in the upper tier, leading to serious inequalities between the elite high schools and the remaining schools in terms of the academic ability of students, parental support, and the quality of teachers (MOE, 1998) . The result was severe competition for students wanting to enter these elite high schools.\nThe intensive competition in turn caused many educational problems, including a competition-oriented school climate, heavy workloads, and a cram-based, memorization approach to education (Park, 1988) . Under these circumstances, the MOE proposed in 1972 the HSEP, where the main provisions were the elimination of the high school entrance exam and the introduction of random school assignment (MOE, 1998) . The HSEP was first implemented in 1974 in Seoul and Busan, where educational and social problems that were caused by the intense competition had been the most severe. Since its introduction, the HSEP has been gradually expanded to many cities across the country. 4 Advocates of the HSEP argued that the policy would promote the equality of opportunity because it would create schools that would be less polarized in terms of the ability of students, school resources, and the quality of teachers. However, critics of the HSEP argued that this random school assignment policy would deprive students and parents of their right to choose schools and restrict the operational autonomy of private schools, consistent with the arguments for school choice (Moe & Chubb, 1990) . Furthermore, opponents claimed that the equalization policy would lead to a decline in student achievement, especially for high performing students, a phenomenon referred to as the ''downward leveling effect''. The opponents argued that this policy would result in a heterogeneous classroom setting in which both high achievers and low achievers would be mixed, resulting in difficulties for teachers with respect to individual differences in students' academic abilities (Kim, Lee, Lee, & Lee, 2004) .\nAs the neoliberal alternatives supporting the idea of the introduction of market competition into the school system began to dominate the process of policy making in the mid-1990s and early 2000s, the combination of the market metaphor and criticism of the ''downward leveling effect'' became a more serious challenge to the HSEP. The result was a revision of the original HSEP. In 1996, limited school choice was permitted in Seoul by creating the so-called common catchment area schools, where students were allowed to apply to schools of their own choosing (MOE, 1998) . In 2002, a limited number of private schools that meet certain criteria such as financial resources were allowed to be transformed into independent private schools with greater autonomy, including school choice. Most recently, a new type of high school was established. Referred to as autonomous private high schools, these schools had greater autonomy in terms of curricula and financial management (Ministry of Education, Science, and Technology [MEST], 2008) .\nAlthough the randomized school assignment system has remained largely intact at the lower secondary level, the criticisms with respect to the heterogeneous (untracked) classroom setting have led to an increase in tracking (i.e., the separation of students by their abilities and sometimes by curricula) in the South Korean lower secondary schooling (MOE, 2004) . Until recently, regardless of whether they are private or public, most South Korean middle schools had offered six 45-minute-long lessons a day 5 and taught Korean language, English, math, social studies, and science as core subjects. In addition, regardless of their learning abilities, most middle school students were taught the same curricular content at the same pace and promoted at the same time from grade to grade with their same-age peers. In other words, neither ability grouping nor grade retention were common at the lower secondary level in South Korea until very recently, which contrasts the school system in Western societies such as the United States where ability grouping and grade retention have long been practiced (Hoffer, 1992; Jimerson, 2001) .\nHowever, with the implementation of the 7th National Curriculum in 2000, which mainly aimed at curriculum differentiation, grouping practices have dramatically increased across the nation. The proportion of middle schools implementing tracking rose from approximately 5% in 2003 to 17% in 2004, and increased to more than 54% in 2008 (Kim et al., , 2008 . The following section discusses the impact of these recent demographic and educational changes on the growing educational inequality in the contemporary South Korean society."}, {"section_title": "Implications for Growing Educational Inequality in South Korea", "text": "Recent socioeconomic and demographic transformations, including the widening income gap, a growing proportion of single-parent families, and a reduced number of offspring, have an important implication for achievement gap, given that studies investigating the sources of the unequal achievement in the South Korean context have identified a number of family background factors, including parental education, household income, family structure, family size, and parental involvement (Byun & Kim, 2008a , 2008b Chang & Sohn, 2005; Kim, 2005 Kim, , 2006 Park, Kim, & Byun, 2009) , that are consistent with evidence from other countries such as the United States (Baker & Stevenson, 1986; Coleman et al., 1966; Lareau, 1987) . The increasing diversity in South Korea's population also has an implication for achievement gap. Although evidence from South Korea is limited because of insufficient data, prior research conducted elsewhere has suggested that the immigrant status of an individual is another source of unequal achievement (Kao, 2004; Kao & Turney, 2009 ; see Zhou, 1997 for a literature review).\nIn the context of South Korean secondary education, the widening income gap is especially important because of its relationship with ''shadow education'' or supplementary private tutoring opportunities (Byun, 2009) . In South Korea, high-stakes assessments play a crucial gatekeeper role to adolescents' future educational and economic opportunities. Therefore, hundreds of thousands of South Korean youth have used various forms of shadow education, including cram schools (hagwon), to prepare for a series of the high-stakes exams. For example, almost 8 out of 10 students had participated in at least one or more forms of private tutoring in 2008 (Korea National Statistical Office [KNSO], 2009c). Because parents must pay for various types of shadow education for their children, children from low-income families are often disadvantaged because poor parents generally cannot afford the high cost of shadow education. Indeed, there has been a significant gap in shadow education opportunities between children from high-and low-income families. In 2008, 9 out of 10 students whose monthly average family income was more than 7,000,000 South Korean Won (KRW) (approximately 6,300 U.S. dollar) received at least one or more forms of private tutoring, whereas only 4 out of 10 students whose monthly average family income was less than 1,000,000 KRW (approximately 900 U.S. dollar) did so (KNSO, 2009c) .\nThe opportunity gap in shadow education between high-income and lowincome children is likely to lead to a gap in student achievement between the two groups. Recent studies (Byun, 2009; Byun & Kim, 2006) have provided some evidence supporting this notion. In their structural equation analyses of 12th-grade general high school students in South Korea, Byun and Kim (2006) found that although financial resources (measured by family income and other financial resources such as assets) did not have a significant direct effect on student achievement, they did have a significant indirect effect on student achievement through shadow education (which had a decisive effect on student achievement). Their finding suggests that a family's financial resources play an important role in student achievement through the investment in shadow education. In short, the widening income gap may lead to a growing gap in shadow education opportunities, increasing achievement gap between high-and low-income students.\nRecent South Korean educational movements in the direction of expanding school choice and grouping practices have another important implication for the widening achievement gap between children from advantageous and disadvantageous backgrounds. Critics have argued that increasing school choice and grouping would lead to the greater socioeconomic polarization of students among schools and classes because disadvantaged students would more likely be placed in less desirable schools and classes (Brown, 1990; Gamoran, 1987) . The result could be a reduction in educational benefits for disadvantaged students because of a decrease in contextual effects of heterogeneous schools and classrooms (i.e., where diverse students are mixed in terms of their family backgrounds and learning abilities) that favor disadvantaged students (Willms & Echols, 1993) .\nIndeed, a good deal of research conducted in other countries has suggested that increasing school choice (Lee, Croninger, & Smith, 1994; Wells, 1993; Willms & Echols, 1993) and ability grouping (Alexander & McDill, 1976; Hoffer, 1992; Kerckhoff, 1986) would reduce student achievement among disadvantaged students. Although limited, emerging evidence from South Korea also has suggested that expanded school choice and increased curriculum differentiation (Park, 2009 ) would have negative effects on student achievement, particularly for disadvantageous and lowachieving students. In fact, many empirical studies on the impact of South Korea's randomized school assignment policy (i.e., the HSEP) have suggested that the government intervention in school assignment would not lead to a decline in student achievement, rejecting arguments for the downward leveling effect (Kang et al., 2005; Sung, 2002 Sung, , 2004 . In summary, along with its demographic changes, South Korea's market-based educational transformation may contribute to a widening socioeconomic gap in student achievement by reducing educational benefits for students with a lower socioeconomic background. The following section presents the study methodology."}, {"section_title": "METHODOLOGY", "text": ""}, {"section_title": "Data and Sample", "text": "To examine the trends in the relationship between socioeconomic background and student achievement during the past decade, we used data from the international TIMSS database. TIMSS has been the source of one of the most extensive, large-scale international assessments of student achievement since 1995, with more than 60 countries around the world participating as of 2007 (Mullis, Martin, & Foy, 2008) .TIMSS is conducted on a four-year cycle, measuring student performance in math and science among fourthand eighth-grade students. Because we are interested in how the influence of socioeconomic background on student achievement has changed over time since the financial crisis of 1997-1998 in South Korea, we restrict our analysis to the most recent three cycles (i.e., 1999, 2003, and 2007) of TIMSS. In addition, because there has been no fourth-grade TIMSS assessment in South Korea since 1995, we focus only on eighth-grade students.\nTIMSS employs a stratified sampling design in which each participating country randomly samples the schools to be tested; one class is randomly chosen for each of these schools, and all students within the randomly selected class are tested in both math and science, yielding a nationally representative sample of students for each country (Olson, Martin, & Mullis, 2008) . In addition to math and science achievement scores, TIMSS offers a variety of information on the background of students, teachers, and school principals. Given the rigorous procedures taken to ensure high-quality sampling and testing in all countries and the standardized procedures to ensure comparability across countries, the TIMSS student performance and background data are comparable across countries and all TIMSS assessments Olson et al., 2008) .\nAs noted earlier, we included the U.S. data for comparison purposes because its school system has been known to have one of the highest levels of betweenschool differentiation. Further, the United States has been making efforts recently to reduce disparities between schools, offering an interesting contrast with South Korea's recent educational reforms (Lee, 2001) "}, {"section_title": "Measures", "text": "This study examines trends in the relationship between socioeconomic background and student achievement. Accordingly, the variables of interest are (1) socioeconomic background of students and (2) student achievement. Each variable was measured as follows.\nSocioeconomic Status TIMSS provides information that can be used as a proxy for family socioeconomic status (SES), including (1) father's education, (2) mother's education, (3) the number of books in the home, and (4) home educational resources. In each cycle, TIMSS measures these variables by using the same scale, with the exception of parental education. In 1999, TIMSS asked parental education in seven categories: (1) some primary school, (2) finished primary school, (3) finished some secondary school, (4) finished secondary school, (5) some vocational education, (6) some university, and (7) finished university. In 2003 and 2007, TIMSS measured parental education by using the International Standard Classification of Education (ISCED) of UNESCO, including (1) did not finish ISCED 1 (primary education), (2) ISECD 1, (3) ISCED 2 (lower secondary), (4) ISCED 3 (upper secondary), (5) ISCED 4 (non-tertiary postsecondary), (6) ISCED 5B (vocational tertiary), (7) ISCED 5A (theoretically oriented tertiary and postgraduate) first degree, and (8) beyond ISCED 5A. We recoded father's and mother's highest levels of education into estimated years of schooling (e.g., finished primary or ISECD 1 ¼ 6 and finished university or ISCED 5A ¼ 16). The number of books in the home was categorized as follows: (1) 1 ¼ 0À10, (2) 2 ¼ 11À25, (3) 3 ¼ 26À100, (4) 4 ¼ 101À200, and (5) 5 ¼ more than 200 books. Finally, an index of home educational resources (i.e., the sum total) was constructed by using information on whether the respondent had the following items at home: (1) calculator, (2) computer, (3) student desk, and (4) dictionary. Using these four variables, we created an index of family SES to easily interpret the results, following the methods proposed by Willms (2003a Willms ( , 2003b Willms ( , 2006 . The index was scaled to have a mean of zero and a standard deviation of one (i.e., standardized) for each cohort and country, not across cohorts and countries, to avoid capturing differences in this measure between cohort groups and countries. Missing values were substituted by the mean of each factor. Student Achievement TIMSS assesses students' knowledge of a wide array of content dimensions in math and science. In this study, we restrict our analysis to math performance because math skills in lower secondary education represent an important foundation for future learning at the upper level of education as well as future opportunities for employment and income .\nMath performance was measured by five plausible values of math achievement with a scale having an international mean of 500 and an international standard deviation of 100. Following the recommendations of TIMSS (e.g., Olson et al., 2008) , the five values were simultaneously used to generate correct standard errors. Table 1 presents the descriptive statistics on student achievement and family background data for South Korea and the United States. The data were weighted by the sampling probabilities of each student to generate representative means and standard deviations for each cohort and country. With respect to the family background variable, two interesting trends emerged: The average years of both father's and mother's education among the South Korean eighth-grade TIMSS cohorts followed the expected trend of increasing schooling. For example, the average years of father's education for South Korean students rose from 12.0 in 1999 to 13.3 in 2003 and14.14 in 2007, reflecting the educational expansion in South Korea. On the contrary, the trend of increasing parental education was less evident for the United States: The average years of father's education was 12.2 in 1999 and 14.2 in 2003, and fell to 14.0 in 2007. Another interesting trend is the average number of books in students' homes, which is another proxy for the educational and social background of the students' families; the number had decreased over time in the United States, whereas that was not the case in South Korea."}, {"section_title": "Analytic Strategies", "text": "To examine the trends in the relationship between SES and student achievement, we used a series of multilevel models, often referred to as hierarchical linear models (HLM). HLM was chosen over ordinary least squares (OLS) regression to address the nature of nested data in TIMSS (Raudenbush & Bryk, 2002) . For the HLM analysis, we first estimated the fully unconditional model separately for each cohort and country, which contained only the dependent variable (i.e., math achievement) with no covariates. This unconditional model allowed us to partition the total variance in the dependent variable into the individual and between-school levels (Raudenbush & Bryk, 2002) . Next, we estimated the model to investigate the relationship between family SES and student achievement, which was specified for each cohort group and country as follows:\nLevel 1 model: where j refers to the schools and i refers to the students sampled from school j; b 0j is the average math achievement in school j; b 1 is the effect of family SES on math achievement in school j; and r 1j B N (0, s 2 ) is the variability of students within school j. The SES variable was centered on the grand mean.\nLevel 2 model:\nwhere w 00 is the grand mean of math achievement and u 0j BN (0, t 00 ) is the error term with t representing the variance between schools. Subsequent to the application of the recommendations of TIMSS (e.g., Olson et al., 2008) , the final student weights (TOTWGT) supplied by TIMSS were used to correct for design effects after the normalization for each cohort group and country; this allowed the results to be generalized to the target population (i.e., Grade 8) in each cohort and country. The following section presents the results."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Variance among Schools", "text": "We first examine the extent to which the variance in student achievement is attributable to the school level across cohort groups. Table 2 presents "}, {"section_title": "Trends in the Relationship between SES and Student Achievement", "text": "Next, we examine to what extent the influence of family SES has changed since 1999, 2003, and 2007 in South Korea in comparison to that in the United States. We expected a greater impact of family SES on student achievement among the more recent cohort students (e.g., 2007) than among the earlier cohort students (e.g., 1999) in South Korea, given the socioeconomic and educational transformations that took place over the decade. Table 3 presents the changes in the relationship between socioeconomic background and the student performance in South Korea and the United States.\nThe first two columns of Table 3 show the unadjusted and adjusted mean scores in math achievement across cohorts in South Korea and the United States. Looking at the changes in the unadjusted mean scores, we found that the average math scores tended to increase in South Korea as well as the United States, with the South Korean eighth-grade students outperforming their counterparts in the United States across cohorts. For example, in 1999, the average math score among the South Korean students was approximately 587, whereas the corresponding average score among the U.S. students was approximately 481, showing more than a 100-point difference between the two countries. However, the increases in the average performance among the students appeared to be more dramatic in the United States than in South Korea, resulting in relatively smaller differences in the math achievement between the two countries. In 2007, the average mean score among the South Korean students was approximately 596, whereas the corresponding mean score among the U.S. students was approximately 508, showing a 88-point difference.\nThe third column of Table 3 shows the trends in the strength of the relationship between SES and math performance across cohort groups in South Korea and the United States. Results show that, although the relationship between SES and student achievement tended to be stronger among the recent cohorts (e.g., 2007) than among the earlier cohorts (e.g., 1999) in both South Korea and the United States, it tended to be stronger among the students in South Korea than among those in the United States across cohort groups. For example, in South Korea, the influence of SES explained approximately 13% of the variance in math performance in 1999, , 14% and 13% in 1999, 2003, and 2007, respectively . The last column of Table 3 displays the changes in the magnitude of the impact of SES since 1999 SES since , 2003 SES since , and 2007 in South Korea and the United States. The results clearly show that the influence of SES on student achievement has increased over time in South Korea. In 1999, one standard deviation difference in the index of SES was associated with an average performance difference of approximately 25 score points. In 2003, it was associated with an average performance difference of approximately 29 score points. In 2007, an average score difference was 32 score points. This tendency was less evident for the United States. The corresponding average score differences remained in the range of 17-18 score points. The following section discusses these results."}, {"section_title": "DISCUSSION", "text": "Education has long been seen as a powerful instrument of social mobility in South Korean society (Oh, 2000) . In recent years, however, education has been increasingly recognized as playing a role in reproducing class conditions rather than promoting social mobility in contemporary South Korean society, with many South Korean scholars documenting the gap in student achievement among students with differing socioeconomic backgrounds (Byun, 2009; Byun & Kim, 2006 , 2008a , 2008b Chang & Sohn, 2005; Kim, 2005 Kim, , 2006 Park et al., 2009 ). There have been growing concerns with regard to whether this socioeconomic gap will continue to widen in South Korea. However, little is known about whether achievement gap between children from advantageous and disadvantageous home backgrounds has indeed grown over time during the past decade, when income inequality began to rise and market-based educational alternatives also began to reshape South Korean secondary schooling. This study addresses this gap in empirical knowledge by investigating the trends between socioeconomic background and student achievement in South Korea, using data from the three most recent assessment cycles (i.e., 1999, 2003, and 2007) of TIMSS and comparing the results of South Korea with those of the United States.\nThe TIMSS data revealed several contrasting trends between South Korea and the United States with respect to the variance in student achievement among schools and the relationship between socioeconomic background and student achievement. First, the between-school variance in student achievement has increased during the past decade in South Korea, whereas it has decreased over time in the United States. Yet, South Korea's between-school variance has remained much smaller than that of the United States. Second, although South Korean students have consistently showed higher math performance than their counterparts in the United States, the extent to which socioeconomic background relates to student achievement has remained much stronger in South Korea than in the United States across different cohort groups. This finding is somewhat surprising, given that the United States has been known to produce relatively large performance differences between students of different backgrounds. However, prior research found similar evidence (Wo¨Xmann, 2000) . Last, but not least, the influence of socioeconomic background on student achievement has increased over time during the past decade in South Korea, suggesting growing educational inequality. On the contrary, the impact of socioeconomic background has remained relatively stable across cohort groups in the United States.\nTo facilitate a more meaningful interpretation, Fig. 6 graphically depicts the contrasting trends in the relationship between socioeconomic background and student achievement in South Korea and the United States. The level of the socioeconomic gradient line in Fig. 6 indicates the average math achievement score reached by those students having similar SES for each cohort and country (see column 2 of Table 3 ). The slope indicates the extent of the inequality in math performance attributable to SES and is measured in terms of the difference that one unit on the SES scale makes on the student performance in math (see column 4 of Table 3 ). Higher levels of the gradients indicate higher math performance (i.e., greater excellence), whereas steeper gradients indicate the greater impact of SES on student performance (i.e., greater inequality). Fig. 6 clearly shows that South Korean students outperformed their U.S. counterparts across cohort groups. Noteworthy is that the South Korean students at the bottom of the SES distribution performed as well as their U.S. counterparts at the top of the SES distribution, suggesting excellence in lower South Korean education in terms of relatively high performance in math. However, the steeper gradient line slope among the recent cohort students (i.e., 2007) in comparison to that among the earliest cohort students (i.e., 1999) in South Korea suggests a widening socioeconomic gap in student achievement. For the United States, the slope of the gradient line across cohort groups has remained relatively stable across different cohort students, showing a relatively less clear trend in the widening socioeconomic gap.\nTaking a closer look at Fig. 6 reveals another important trend. Although there has been a tendency toward improvement in average math performance between 1999 and 2007 in both South Korea and the United States, South Korea's improvement appears to largely reflect the gains among the students from higher SES families (e.g., þ2 standard deviations above mean SES), whereas the United States's improvement appears to equally reflect the gains across students of varying socioeconomic backgrounds. In fact, the average math performance of the South Korean students at the bottom of the SES distribution (e.g., À2 standard deviations below mean SES) appears to have worsened. The strong positive correlation between socioeconomic background and student achievement is consistent with a recent study that found a widening gap between highand low-achieving students in South Korea (Park, 2009 ). Together, the findings suggest that the trend of growing educational inequality is more evident in South Korea than in the United States.\nThe contrasting trends between South Korea and the United States could be attributable to various differences between the two countries, reflecting the consequences of the different educational reform strategies employed (as discussed in the ''Background'' section above). On the one hand, the relatively low level of variance in student achievement among schools in South Korea may be attributable to certain structural features of South Korea's egalitarian approach to lower secondary education. On the other hand, the trend of the increasing between-variance and influence of socioeconomic background may be the result of the recent educational transformation that has been increasingly geared toward school choice and curriculum differentiation in South Korea's secondary schooling. Likewise, the relatively high level of between-school variance in student achievement in the United States may reflect the high degree of heterogeneity among schools, whereas the decreasing between-school variance may be attributable to the greater effort that the United States has been making toward the reduction of inequality between schools over the recent decades. This study has important policy implications for the reduction of educational inequality in South Korea as well as other countries. A growing body of cross-national research of student achievement (e.g., Buchmann & Parrado, 2006; Park, 2008c; Pong, Dronkers, & Hampden-Thompson, 2003; Xu, 2008) has shown that institutional and policy arrangements matter in the process of educational stratification and inequality, offering evidence in support of institutional theory arguments (Kerckhoff, 1995 (Kerckhoff, , 2001 . Our comparative analysis adds more evidence to demonstrate that different educational approaches lead to different results with respect to educational equality. In South Korea, the recent shift from the egalitarian approach to the market-oriented approach (e.g., increasing school choice and curriculum differentiation) to education may lead to higher educational inequality unless other policy interventions are also considered. Indeed, a recent study (Green, 2009) found that countries with the most comprehensive education systems (e.g., the Nordics) have the most equal outcomes, whereas countries with school choice and diversity (e.g., the United Kingdom) have a high degree of educational inequality. Taken together, the findings suggest that institutional educational changes can make a difference in educational inequality. 2. The high school-bound students in the non-HSEP region are exceptional. In a region that has not implemented the HSEP, general high schools are allowed to select their students mainly on the basis of their middle school academic records. Special purpose high schools such as foreign language and science schools are also allowed to select their students on the basis of their middle school academic records and other criteria (e.g., written essays and in-depth interviews).\n3. Although varying from region to region, general assignment procedures under the HSEP are as follows: (1) high school-bound students are screened on the basis of their middle school records (e.g., school performance), (2) screened students are allowed to apply to three general high schools within their school district, and (3) they are assigned to one of those schools by a computerized lottery system. In a region that has not adopted the HSEP, students are allowed to apply to high schools that they wish to enter, and individual general high schools select their students on the basis of students' middle school performance. Decisions with respect to the adoption of the HSEP are made by the local education office based on an agreement among the members of the community (e.g., parents and teachers).\n4. As of 2009, 28 cities had adopted the HSEP, affecting approximately 75% of the total general high school student population (MEST, 2009b) .\n5. Extra lessons are often provided before and after regular lessons."}]