[{"section_title": "Abstract", "text": "Abstract Low participation and completion rates in the science, technology, engineering, or mathematics (STEM) careers are a world-wide concern. This study tracked American college students over a 5-year period and identifies factors that lead to choosing a STEM major and in turn successfully earning a STEM degree. Characteristics of female and minority students who participated in the STEM pipeline during 2008-2013 were compared with their counterparts. Results show significant gender and racial differences in entering, completing, and persistence in the STEM pipeline. Female and minority students, except for Asian American students, were less likely than male or White students to declare a STEM major. Similarly, among those who completed a STEM major, a smaller percentage of female and minority students completed their degree in 5 years than their counterparts. White male students, high school GPA, college GPA, and first year college credit hours earned significantly predicted persistence in completion of a STEM major, whereas first time college students, transfer students, and students took remediation courses were less likely to persist. Implications for counseling interventions are discussed."}, {"section_title": "Background/Objectives and Goals", "text": "Disparities in educational attainment across racial/ethnic groups in educational outcomes have been consistently reported (Crissey, [7] ; Kim, [8] ; National Science Foundation, [19] ). According to recent data from the US Census Bureau, non-Hispanic Whites and Asians have higher educational attainment than African Americans and Hispanics. Although recent trends in undergraduate enrollment show growth of all racial/ethnic groups, and more women than men enrolling in college, women and minorities are still underrepresented in the science, technology, engineering, and mathematics (STEM) professional careers (National Science Foundation, [18] ). Low participation and completion rates in college majors are a national and international concern. The importance of increasing the number of college students completing degrees in STEM has been by organizations and government agencies (National Governors Association [15] ; National Science Board [16] ; U.S. Department of Education [17] ).\nSince 2000, underrepresented minorities' participation in engineering and the physical sciences has been flat, and participation in mathematics has dropped (National Science Foundation, [19] ). Women's participation in science and engineering occupations is lower than it is in the U.S. workforce as a whole and varies greatly by occupation. For instance it is higher among psychologists and lower among mathematical/computer scientists and engineers. Women continue to constitute the vast majority of those employed in traditionally female occupations, such as nursing and K-12 teaching. Despite steady improvement in enrollment and educational attainment of women and minority students in the biological and life sciences, women and minorities are still underrepresented in the supply pipeline, which has prompted researchers and policymakers to examine this phenomenon. The tracking of educational progress among races/ethnicities and by gender is important because substantial gaps persist among these groups (Kim, [8] [23] ). Fewer than 40% of freshmen students will earn a bachelor degree within four years, and barely 60% will graduate within six years (Coley, C., & Coley T., [6] ). While much has been learned about issues related to access, persistence or degree attainment of college students in general, comparatively not much is [24] ). Other characteristics examined in relation to persistence and student success include the following: the intensity of STEM course taking in the first year (Chen, [4] ), whether students enrolled in a developmental course; whether they enrolled in Algebra I or a higher level mathematics course, and/or enrolled in Biology I or a higher level science course in their first semester, their first-semester GPA, and institutional characteristics (Kitsantas, Winsler & Huie, [9] ; Stumpf & Stanley, [24] ).\nThis study identifies factors that lead to choosing a STEM major and in turn successfully earn an undergraduate degree in science, technology, engineering, or mathematics (STEM).\nSpecifically this study is an attempt to answer the following questions: 1) What are the characteristics of students' who declared a STEM major? 2) What are the characteristics of students who completed a STEM major? 3) What factors influence students who persisted to complete a STEM major?"}, {"section_title": "Methods", "text": "Sample There were 256,978 enrolled in seven public universities in a Midwest state of the United States. This study tracked undergraduate students enrolled in 2008 through 2013. Institutional data submitted by the seven regent universities during this period were included in the analysis. Subsets of the participants (N = 7 1,405), described in the analysis section, were included based on the nature of the research question. As of 2008, there were 8,814 (12.3%) first year students, 13,755 second year students (19.3%), 16,199 (22.7%) third year students, 32,386 (45.4%) fourth year students, and 251 (.4%) fifth year students. The sample comprises 34,093 (48%) male students and 37,295 (52%) female students; 53,487 (74.9%) White Americans, 695 (1.0%) American Indians and Alaskans, 1,916 (2.7%) Asian Americans, 2,614 (3.7%) African Americans, 2,483 (3.5%) Hispanic Americans, 4709 (6.6%) Resident Aliens, and 5,501 (7.7%) did not indicate their race.\nThe declared major/degree variable used for research question #2 and 3 was coded into a dichotomous variable, STEM or non-STEM, based on the taxonomy of the Classification of Instructional Program (CIP) codes. Of 2,453 CIP majors listed, 498 majors (20%) were classified as STEM majors that involve Science (CIP code 40), Technology (CIP code 11), Engineering (CIP code 14) , and Mathematics (CIP code 27). The persistence dependent variable use for research question 3 is defined in the analysis section.\nThree cluster of independent variables were included in this study:\n(1) Demographic variable: Sex, race, and age when first enrolled.\n(2) Pre-College Variables: High school GPA and ACT scores. Missing data from HS GPA and ACT scores were replaced with a mean score (Series Mean). "}, {"section_title": "Analysis", "text": "Descriptive and bivariate statistical analyses were conducted to answer the research questions: 1) who entered STEM majors, 2) who completed STEM majors, and 3) what factors predict enrollment/declaration of STEM major (3a) and persistence/completion of STEM degree (3b). The first two research questions were analyzed using both Chi-square test and ANOVA depending on the type of data, i.e., nominal or continuous variables. Logistic regression analysis (Model 1-Model 3) were conducted to answer the research question (3a) What factors predicting students who declare a STEM major and (3b) what factors influence students to persist to complete a STEM major? Statistical analyses were conducted using IBM SPSS statistical software version 21.0.\nLogistic regressions for the full sample (N = 71,405) are conducted to examine 3 clusters of variables (Model 1 to Model 3) predicting STEM majors as well as persistence in STEM major. Model 1 is a baseline analysis model including demographic variable, i.e., sex, race and age, without any controls. Model 2 adds pre-college variables to the baseline model which includes High school GPA and ACT score. Next, Model 3 adds college variable, institution, type of students, developmental courses, college GPA and credit hours earned. Stepwise variable selection procedure was used within each model.\nPersistence is defined as following: Persisted and completed (1): Any student who declared a STEM major in any given year and completed at least one STEM major in 5 years.\nIncomplete (0): Any student who declared a STEM major in any given year and did not complete any STEM major in 5 years. "}, {"section_title": "Factor Influencing Students Who Persisted In Completing A STEM Major", "text": "The logistic regression analysis examined the influence of demographic (Sex, Race, Age), pre-college (ACT, High school GPA), and college variables (institution, type of students, academic remediation, college GPA, and credit hours earned) on whether a student declared a STEM major or a non-STEM major. Table 2 displays the parameter estimates, significance values, and fit statistics for the three regression models. The beta coefficient (β) value in the logistic regression tables represents the change in log odds of the dependent variable occurring related to one unit change in the predictor or independent variable, with other variables held constant. The greater the β value, the more the predictor is weighted in the model. Model 1 examined the demographic variables, sex, race, and age. Results showed that race significantly predicted persistence in STEM degree completion. White students were more likely than other racial groups to persist in STEM completion. Model 2 added pre-college variables to the baseline model which include high school GPA and ACT score. Race, ACT, and high school GPA significantly predicted STEM persistence when other variables were controlled.\nModel 3 includes all three clusters of variables, demographic, re-college, and college variables, in the multiple regression analyses using the Enter method. A review of the parameter estimates and associated probabilities identified that the likelihood of declaring a STEM major was uniquely influenced by students' sex, race, ACT, high school GPA, institutes, type of students, remediation courses, first year GPA as well as cumulative number of credit hours earned.\nAn examination of the odds ratios showed that holding other thing equal, minority students were less likely than White American students to persist in a STEM major. Other things being equal, younger students were more likely to persist than older students and students who had earned more course credits were more likely to persist than those who earned fewer course credits. Of all variables selected in the model, high school GPA appears to be the strongest predictor of persistence in completion of a STEM major. "}, {"section_title": "Conclusions", "text": "To address the question of who majored in the STEM fields, this study looks at various characteristics of beginning postsecondary students who enrolled between 2008 and 2013. A total of 31 percent of all beginning postsecondary students declared a STEM field. This shows an 8% increase in participation from a previous survey of 1995-2001 of postsecondary students (Chen & Weko, [5] ). A similar trend of growth in STEM enrollment is also shown in a national study (National Science Foundation, [18] ). Among students who began 4-year colleges in 2003-2004, the proportion majoring in science or engineering in 2009 was higher than the proportion majoring in science and engineering in 2004. Thus, the number of students switching majors out of science and engineering fields was lower than the number entering science and engineering fields as a whole.\nStudents entering STEM fields had characteristics different from those who did not enter STEM fields. Consistent with findings from other studies (Mau, [12] , [13] ; Mau, Domnick, & Ellsworth, [14] ), we found female and minority students, except for Asian American students, were less likely than male or White students to declare a STEM major. Similarly, among those who completed a STEM major, a smaller percentage of female and minority students completed their degree in 5 years than their counterparts. Although studies have shown improvement of enrollment and degree completion of female and minority students over recent decades, this study showed that they continue to be underrepresented in the STEM career pipeline.\nWe believe early interventions to recruit and guide underrepresented students into the STEM pipeline is critically important. Federal programs such as Gear up and Upward Bound Math and Science prepares low-income and first-generation high school students to pursue degrees and careers in math and science. It is also very important to target underrepresented students who aspire to STEM careers in their early education. In a recent study examining STEM aspirations of high school students Mau [13] suggests that math or science identity played a key role. More female students than male students believe that math and science teachers show differential treatment toward their students. Counselors serve an important role in working with math and science teachers to develop curricula that are unbiased and culturally sensitive to the needs of female and minority students.\nOnce students enter the STEM pipeline, persistence becomes an important issue. Our study shows that older students are less likely than younger student to persist. Whether it is because of financial factors or issues related to academic skills, more programmatic support needs to be offered to these students. For example, Federal funded programs offering tutoring support and scholarships would be especially important. Bright young women and underrepresented minorities simply cannot be recruited into the STEM pipeline without continued support and encouragement. Informal support groups may be helpful in addressing problems that young women and ethnic minority students enrolled in non-traditional programs or course work may face. Efforts to strengthen support systems and lessen barriers may better enable students to persist toward their career goals (Mau, [12] ).\nWe notice several limitations of this study. Unlike survey studies, this study was based on institutional data or information that is considered as important factors affecting persistence and degree completion, for example, familial variables such as SES or psychological variables such as subject specific self-efficacy. Interpretation is limited to a 5-year period for completion or persistence. Tracking a longer period would yield a more complete picture of degree completion and persistence. It also should be noted that the characteristics of students in a primarily agricultural state may differ from other states in demand/supply of STEM majors."}]