[{"section_title": "Abstract", "text": "Scholars have long sought to understand the advantages different types of firms may have in generating innovation. A popular notion is that startup companies are able to attract employees with \"fire in the belly,\" allowing them to be more productive. Yet research has paid little attention to the motives and incentives of startup employees. This paper compares startup employees' pecuniary and non-pecuniary motives with those of employees working in small and large established firms, and examines the extent to which existing differences in motives distinguish employees' innovative performance. Using data on over 10,000 U.S. R&D employees, we find significant differences across firm types with respect to motives, although these differences are more nuanced than commonly thought. We also observe that startup employees have higher patent output, an effect that is associated primarily with firm age, not size.\nMoreover, we find evidence that differences in employee motives may indeed be an important factor distinguishing the innovative performance in startups versus established firms. Rather than intrinsic motives or the quest for money, however, it is employees' willingness to bear risk that appears to play the most important role. We discuss implications for future research as well as for entrepreneurs, managers, and policy makers.\nI am indebted to Wes Cohen for many stimulating discussions of this and related projects. I also thank"}, {"section_title": "Introduction", "text": "Many scholars have suggested that entrepreneurial ventures appeal to a wide range of motives, including not only pecuniary gain, but also the will to create a private kingdom, to succeed for the sake of success itself, the joy of creating and of getting things done, and exercising one's energy and ingenuity (Schumpeter, 1942; Cooper, 1964; Roberts, 1991; Hamilton, 2000; Shane et al., 2003; Neff, 2012) . Large established firms, on the other hand, are often thought to squelch intrinsic motives and innovative spirits through increased bureaucracy and routinization, while also diluting individuals' sense of ownership and responsibility for their work (Schumpeter, 1942; Kornhauser, 1962; Blume, 1974; Sorensen, 2007) .\nSchumpeter, in particular, expressed concern that the increasing shift of the innovation function to the large established firm would replace the powerful entrepreneurial motives typical of startup firms with those of salaried employees and shareholders. These motives, he thought, would not be able to sustain the economically critical function of the innovator and entrepreneur, thus threatening the very survival of the capitalist enterprise (see Schumpeter, 1942, ch. XII; Cohen & Sauermann, 2007) .\nPartly inspired by Schumpeter's work, economists, sociologists, and organizational scholars have studied the role different types of firms play in generating technological advance, and the potential advantages some types of firms may have in generating innovation (Acs & Audretsch, 1990; Zenger, 1994; Cohen & Klepper, 1996; Powell et al., 1996; Gans et al., 2002; Lowe & Ziedonis, 2006; Arora et al., 2009; Agrawal et al., 2012) . This research has made considerable progress by studying a broad range of firm level factors such as differences in resources, coordination costs, or economies of scale (see Cohen, 2010) . However, little work has examined whether firm types differ with respect to the motives of their employees, even though individual employees are typically responsible for a large part of the innovative activity inside firms. The lack of attention to employee motives is particularly surprising given that entrepreneurship research has highlighted important differences in the motives and incentives of individual entrepreneurs compared to those of managers and employees working in large established firms (e.g., Amit et al., 2001; Shane et al., 2003; Elfenbein et al., 2010; .\nMoreover, there is increasing evidence that these founder motives have important implications for outcomes such as entry decisions, strategic choices, firm persistence, and even competitive dynamics in industries (Hamilton, 2000; Morton & Podolny, 2002; Ding, 2009; Arora & Nandkumar, 2011) . Given the growing body of work on entrepreneurs' motives and their strategic implications, it seems natural to extend this line of research and ask if startup employees may also differ from their counterparts in established firms, and what implications such differences might have for innovative performance.\nWe begin to address these questions by comparing employees' pecuniary and non-pecuniary motives between startups and established firms and by examining the extent to which any existing differences in motives distinguish employees' innovative performance across types of firms. To ground our inquiry, we draw on three conceptual building blocks. First, we build upon prior literature in organizational theory and economics to consider structural characteristics and constraints that may condition the types of job characteristics and incentives startups and established firms are able to provide to their employees. While prior work has examined such characteristics focusing on either firm size or age (Freeman et al., 1983; Zenger, 1994; Sorensen & Stuart, 2000; Brown & Medoff, 2003; Elfenbein et al., 2010) , startups may have unique profiles since they are both small and young (see Haltiwanger et al., 2013) . Second, the literature on labor market sorting and career choice suggest that firms that offer different types of job characteristics and incentives will attract workers with different motives (Rosen, 1986; Besley & Ghatak, 2005; Agarwal & Ohyama, 2013) , suggesting that the employees who are joining startups may differ systematically from those working in small or large established firms. Finally, we relate workers' motives to innovative performance within and across firms. In doing so, we draw on recent research suggesting that individuals' motives may condition not only levels of effort but also the productivity of that effort in generating innovative outcomes (Amabile, 1996; Sauermann & Cohen, 2010) . Thus, to the extent that startups offer different types of job characteristics and incentives than established firms, they may attract employees with different sets of motives. Differences in employee motives, in turn, may lead to differences in innovative performance.\nWe examine these relationships using survey data from the National Science Foundation's Science and Engineering Statistical Data System (SESTAT). Drawing on data from over 10,000 U.S.\nscientists and engineers working in startups and established firms, we find significant differences across firm types with respect to employees' pecuniary as well as non-pecuniary motives. Interestingly, the largest differences exist not with respect to the financial or intrinsic motives commonly discussed but with respect to desires for job security. We also observe that startup employees have more patent applications than employees in small or large established firms. Using a series of regression analyses, we find evidence that differences in employee motives may indeed be an important factor distinguishing the innovative performance in startups versus established firms. Rather than intrinsic motives or the quest for money, however, employees' willingness to bear risk seems to play the most important role. We conduct a series of robustness checks to address endogeneity concerns and alternative explanations. This paper makes several contributions. First, we contribute to the entrepreneurship literature by providing unique insights into the motives of startup employees and how they compare to those of employees in other types of firms. While the entrepreneurship literature has developed a large body of work on the characteristics of founders (e.g., Hamilton, 2000; Amit et al., 2001; Shane et al., 2003; Hsu et al., 2007; Eesley & Roberts, 2012) , very little work has studied the characteristics of those individuals who join founders in their entrepreneurial efforts. This lack of attention to \"joiners\" is particularly problematic in the context of technology-based ventures, where early employees are often critical for firm success (Freiberger & Swaine, 1984; Burton, 2001; Neff, 2012) . Our results show important differences in individuals' characteristics across organizational types, highlighting the value of future research on startup employees as a distinct group of employees and as important entrepreneurial actors.\nSecond, we contribute to the literature on human capital, especially in knowledge-intensive settings. Most of the existing work in this domain focuses on ability or experience as key individual characteristics (Agarwal et al., 2009; Toole & Czarnitzki, 2009; Braguinsky et al., 2012; Campbell et al., 2012) . We add to this literature by examining employee motives, which are typically hard to observe but may have important implications for labor market choices and outcomes, even controlling for ability (see also Stern, 2004; Agarwal & Ohyama, 2013) . Our results suggest that future work may fruitfully consider a broader set of dimensions of human capital, including both ability as well as motivational factors.\nFinally, our discussion contributes to a large body of innovation literature that has examined performance differences across firms of different size or age. Most of the existing research has focused on firm-level correlates of size and age such as resources or coordination costs, yet little attention has been paid to characteristics of the individuals who actually perform innovative activities in different types of firms. Scholars have recently begun to examine differences in the ability and human capital of employees across the firm size distribution (Zenger & Lazzarini, 2004; Elfenbein et al., 2010) and the SESTAT data allow us to add unique insights into individuals' pecuniary and non-pecuniary motives. Moreover, our results suggest that firm age and size have quite different relationships with innovative outcomes, highlighting the need to conceptualize them as distinct constructs and to consider them jointly in empirical work (see also Cohen, 2010; Haltiwanger et al., 2013) . We discuss additional implication of our results for future research as well as for managers and policy makers in the final section of this paper."}, {"section_title": "Conceptual Background", "text": ""}, {"section_title": "Differences in Motives across Firm Types", "text": "We conceptualize employee motives as individuals' preferences for pecuniary and nonpecuniary work related benefits such as pay, intellectual challenge, autonomy, or job security.\n1 Some of these benefits, such as job security or autonomy, are job characteristics that depend primarily upon employment in a particular organization or job. 2 Other benefits are contingent upon effort or performance, and these contingent elements are typically called incentives (Zenger & Lazzarini, 2004; Lacetera & 1 We conceptualize preferences as parameters in the utility function such that a stronger preference for a particular job attribute increases the utility derived from that attribute (see Goddeeris, 1988; Hwang et al., 1992; Stern, 2004) . 2 Some job characteristics may not be considered positive and thus not be a \"benefit\" in a strict sense. However, such benefits can typically be reframed in terms of a positively valued opposite (e.g., risk of job loss versus job security). For simplicity, we focus our discussion on job characteristics that are generally evaluated positively. Zirulia, 2012) . In line with prior research, we consider individuals' motives to be relatively stable and \"trait-like\", i.e., heterogeneity in motives exists even before workers join particular types of organizations (Killingsworth, 1987; Hwang et al., 1998; Halaby, 2003; Cable & Edwards, 2004) . A key premise of this paper is that different types of organizations differ in the kinds of job characteristics and incentives they offer, thus potentially attracting individuals with different kinds of motives (Özcan & Reichstein, 2009; Elfenbein et al., 2010) . These mechanisms have been formalized in career choice and sorting models, which suggest that individuals sort into jobs that maximize the expected utility from pecuniary as well as non-pecuniary work benefits (Stern, 2004; Agarwal & Ohyama, 2013) . 3 How much utility an individual derives from a particular benefit depends on his motives, suggesting that individuals should sort into organizations that offer particularly high levels of those benefits for which they have strong preferences.\nThis sorting and selection logic underlies a significant body of prior research that has examined differences in individuals' characteristics across organizational contexts or types of jobs. In particular, a large stream of work has examined differences between entrepreneurs on the one hand, and managerial employees working in established firms on the other. This line of work relies on the notion that entrepreneurship involves higher levels of factors such as risks, independence, or task variety than jobs in established firms. As such, entrepreneurship should attract especially those individuals who have strong preferences for these \"entrepreneurial\" job attributes. Consistent with this idea, empirical studies suggest that entrepreneurs tend to be characterized by stronger preferences for risk (or lower levels of risk aversion), higher desires for freedom, or a \"taste for variety\" (Stewart & Roth, 2001; Shane et al., 2003; . Related work has extended beyond motives to individual-level differences in cognitive styles and decision making processes, suggesting that entrepreneurs tend to exhibit particularly high levels of overconfidence in their own skills and abilities as well as overoptimism with respect to the value of their ideas or the chances of entrepreneurial success (Busenitz & Barney, 1997; Camerer & Lovallo, 1999; Lowe & Ziedonis, 2006; Dushnitsky, 2010) . The hypothesized mechanism is again that individuals with these characteristics should find starting their own venture relatively more attractive than other job options, leading them to select into entrepreneurship and resulting in higher average levels of these characteristics in the population of entrepreneurs.\nDespite the considerable body of research on the characteristics of founders, little work has extended this line of thinking to startup employees. Our discussion of sorting and self-selection suggests 3 This discussion assumes that scientists and engineers have a choice regarding where to work. While faculty positions are scarce (Stephan, 2012) , industry positions are more readily available, levels of unemployment among scientists and engineers are very low (National Science Board, 2012) , and many scientists receive multiple job offers (Stern, 2004 ). While we focus on worker self-selection, future research may fruitfully examine two-sided matching process between workers and different types of firms. Existing models suggest similar sorting patterns as our simplified view, i.e., firms with advantages in offering particular types of job attributes will match with workers who place a high value on these job attributes (see Hwang et al., 1998; Stern, 2004) .\nthat predictions regarding differences in employee motives between startups and established firms first require a careful consideration of differences in the job characteristics and incentives available to employees in startups versus established firms. In a general sense, we argue that structural features of startups and established firms may either directly affect job characteristics and incentives or constrain management's ability to provide them. In discussing such differences more concretely, we focus on five job characteristics that are particularly salient in prior work in economics and organizational theory and that have typically been tied to either firm size or firm age. We consider these arguments jointly to develop conjectures regarding the job characteristics and incentives available in startups (defined as young and small firms) versus established firms (i.e., old firms that may be either small or large). Even though firm age and size have a positive correlation (Evans, 1987) considering both explicitly may be very important. First, the correlation between age and size is far from perfect and some firms may remain small even as they age (Jovanovic, 1982) . Second, age and size may have different relationships with job characteristics and, therefore, appeal to employees with different motives. As a result, focusing on either size or age without controlling for the other may confound their potentially different roles.\nA first job characteristic that is likely to distinguish startups and established firms is job security.\nResearch in economics and organizational theory suggests that firms become more stable over time and survival rates tend to increase with firm age (Jovanovic, 1982; Carroll & Hannan, 2000) . Similarly, large firms have higher survival rates to the extent that they can draw on slack resources, economies of scale, or higher degrees of diversification (Evans & Leighton, 1989; Agarwal & Audretsch, 2001; Brown & Medoff, 2003) . More stability and higher chances of firm survival, in turn, should translate into higher levels of job security for individual employees. Recent empirical work has shown that differences in job security offered by startups versus established firms are very salient to prospective workers as they consider different employment alternatives. For example, Roach and Sauermann (2010) asked a sample of science and engineering PhD students at U.S. research universities about their expectations regarding the availability of a range of benefits in startups versus established firms, and their respondents expected significantly higher job security in the latter. Indeed, in an open ended question, over 70% of respondents indicated that the lack of job security and employment stability was the factor they would dislike most about working in a startup. At the same time, Neff (2012) suggests that many dotcom startups were able to attract human capital by targeting workers who either underestimated the risk of job loss or who placed a low value on job security. 4 Job security may directly enter employees' utility function and may be valued more highly by those individuals who desire stability or are risk averse. However, job security also conditions the availability of other types of work-related benefits such as pay or interesting work, since losing a job typically means losing those benefits. As such, preferences for job security may be correlated with preferences for other job attributes, and we will consider these preferences jointly in our empirical analysis.\nBased on this discussion of differences in job security across firm types, and assuming that workers sort with respect to their corresponding preferences, we predict: A second factor that figures prominently in discussions of career choice is salary. Labor economists have examined levels of pay as a function of firm size in general population samples and consistently found that large firms offer higher wages than small firms (Idson & Feaster, 1990; Oi & Idson, 1999) . Possible explanations for this wage premium include higher levels of resources and thus ability to pay, as well as higher levels of undesirable job attributes such as bureaucracy, resulting in a need to pay higher wages as compensating differentials. At the same time, small firms may provide higher-powered performance-contingent financial incentives because they are better able to measure individuals' output and because the link between individual effort and firm performance is more direct (Kandel & Lazear, 1992; Zenger, 1994; Zenger & Lazzarini, 2004) . Thus, while levels of (base) salary are likely to be lower in small firms than in large firms, differences in total financial income (fixed salary plus contingent pay) are more ambiguous. Turning to firm age, prior work has shown that older firms tend to pay higher wages but this relationship weakens once differences in employee ability are taken into account (Brown & Medoff, 2003; Bengtsson & Hand, 2012) . Assuming that job seekers sort with respect to their corresponding preferences for salary, we predict:\nProposition 2: Employees working in startups have a lower preference for salary than employees working in large established firms.\nThe entrepreneurship literature suggests that the prospect of greater independence is one of the key reasons for individuals to become self-employed and to start entrepreneurial ventures (Blanchflower & Oswald, 1998; Hamilton, 2000; Shane et al., 2003) . While startup employees are likely to have less decision making authority than founders, startups may still offer higher levels of autonomy to their employees than do large established firms. In particular, organizational theorists suggest that older and larger organizations are more bureaucratic and routinized (Idson, 1990; Sorensen, 2007) , which may reduce individuals' autonomy and sense of independence. An alleged \"conflict\" between scientists' and engineers' desire for autonomy and the bureaucratic management systems of the large business enterprise has also received much attention in the literature several decades ago (e.g., Kornhauser, 1962; Ritti, 1968; Blume, 1974) . On the other hand, even large established firms may be able to provide their R&D employees with significant levels of freedom to the extent that they are more likely to have the slack resources to allow their personnel to pursue pet projects that may provide only distant payoffs to the firm (Hounshell & Smith, 1988) or that they are better able than small firms to find commercialization opportunities for inventions that result from employees' self-directed exploration (see Nelson, 1959; Kacperczyk, 2012) . Despite these potentially offsetting effects, we expect that the structural constraints arising from age and size put large established firms at a disadvantage with respect to their ability to provide employees with a sense of autonomy in their work. Assuming that job seekers sort with respect to their corresponding preferences for independence, we predict:\nProposition 3: Employees working in startups have a higher preference for independence than employees working in large established firms.\nThe literature also suggests differences across firm types with respect to responsibility for a wide range of tasks and work activities. In particular, Lazear (2005) argues that entrepreneurs have to engage in a broader range of activities than employees since entrepreneurship offers fewer opportunities for specialization. This logic is likely to extend to startup employees who may have fewer opportunities to specialize in particular aspects of R&D than employees in large firms and who may also have to handle non-R&D responsibilities in addition to their R&D work (see Sorensen, 2007) . Early qualitative evidence is provided by Cooper (1966) , who finds that R&D employees in small firms tend to be \"generalists\"\nwhile those in large firms focus on particular aspects of a given project. More recently, Elfenbein et al. (2010) showed that science and engineering graduates working in small firms engage in a broader range of R&D and non-R&D activities than those working in large firms. Assuming that workers sort with respect to their preferences for responsibility, we predict:\nProposition 4: Employees working in startups have a higher preference for responsibility than employees working in large established firms.\nFinally, we return to some of the nonpecuniary and \"intrinsic\" factors highlighted by Schumpeter and other qualitative accounts, including exciting work and intellectual challenge. Popular accounts of the early startup cultures of firms such as Google or Apple suggest that young firms may provide a more exciting and dynamic work environment than established firms because they allow employees to participate directly in a firm's growth and development (Freiberger & Swaine, 1984; Vascellaro & Morrison, 2008) . Scherer makes a similar argument with respect to firm size when he argues that \"it is easier to sustain a fever pitch of excitement in small organizations, where the links between challenges, staff, and potential rewards are tight\" (Scherer, 1988, p. 4) . Moreover, some authors suggest that startups are more likely than established firms to push the technological frontier (Prusa & Schmitz, 1991; Christensen, 1997) , possibly providing more technological challenges to scientists and engineers. On the other hand, some large firms also invest considerable resources to pursue exciting and cutting-edge \"blue sky\" research, sometimes in separate organizational units such as Bell Labs or Google X.\nNotwithstanding some prominent examples, however, few established firms have such dedicated research laboratories and most scientists and engineers working in established firms will not work for one of these elite units (see Ganapati, 2008) . PhD students in the Roach and Sauermann (2010) study shared this general impression, indicating that they expected employment in an established firm to offer significantly lower levels of intellectual challenge than employment in a startup."}, {"section_title": "Proposition 5: Employees working in startups have a higher preference for intellectual challenge", "text": "than employees working in large established firms."}, {"section_title": "Motives and Innovative Performance", "text": "In addition to examining differences in employee motives across firm types, the second goal of this paper is to explore the degree to which any such differences are related to differences in innovative performance. Towards this end, we can draw on a growing body of research that has studied the relationship between individuals' motives and the production of creative and innovative ideas.\nFirst, social psychologists argue that intrinsic motivation based on task enjoyment or intellectual challenge is more conducive to creativity than motivation based on financial rewards. The rationale is that intrinsically motivated individuals explore a larger solution space and are less likely to seek quick (but possibly inferior) solutions. In contrast, extrinsic rewards such as money are often tied to external evaluation, which may lead to conformity with existing standards and reduce creativity (Amabile, 1996) .\nAs such, individuals who are driven by intrinsic motives and who value autonomy rather than conformity may be more creative. Supporting the notion that intrinsic motives are particularly conducive to innovation, many successful scientists and engineers emphasize factors such as challenge or the joy of discovery as the primary drivers of their efforts (Stephan, 2012) . Similarly, employees' nonfinancial motives such as challenge or the desire to prove one's competence figure prominently in qualitative descriptions of successful research and development efforts in firms (e.g., Kidder, 1981) . Other scholars, however, argue that even financial incentives may foster creativity if they explicitly specify novelty as an objective (Eisenberger & Shanock, 2003; Byron & Khazanchi, 2012) . Thus, while there is general agreement that intrinsic motives are particularly conducive to innovation, the role of extrinsic motives remains debated. The existing empirical evidence often relies on laboratory studies that do not necessarily generalize to firm R&D (see Shalley et al., 2004) . In a recent paper, Sauermann and Cohen (2010) study a sample of PhD trained industrial scientists and find a strong relationship between intrinsic motives and innovative performance, while motives related to pay had a weaker -but still positive -effect.\nSecond, risk aversion and security motives may have a negative impact on innovative performance (Amabile & Gryskiewicz, 1987; Dunbar, 1995; Friedman & Foerster, 2005) . Innovation involves experimentation with new and untested elements, but the success of these experiments, both in terms of achieving technological goals and in terms of acceptance by the market or other evaluators, is uncertain (Simonton, 2003; Weisberg, 2006) . As such, individuals who seek to minimize risks may avoid projects or solution approaches that have a higher likelihood of failure, even if these projects are also more likely to result in particularly new and valuable outcomes. In a related vein, organizational scholars and economists argue that organizations seeking to foster innovation should encourage employees to take risks and should avoid punishing failure (see O'Reilly, 1989; Amabile & Conti, 1999; Azoulay et al., 2011) . While our focus is more narrowly on technological innovation, one would expect similar relationships between risk preferences and innovation in other domains -in particular, entrepreneurial efforts by founders of new businesses. Indeed, prior work suggests not only that entrepreneurs tend to have a higher risk taking propensity than non-entrepreneurs, but also that among entrepreneurs, those with higher risk taking propensity experience higher business success (Rauch & Frese, 2007) .\nOverall, this discussion suggests that intrinsic motives related to challenge and independencewhich we predicted to be characteristic of startup employees -are particularly conducive to creativity and innovation. Two of the motives that we predicted to be more salient in established firms (in particular, job security and pay) are likely to have less positive or even negative relationships with creativity and innovative performance. Of course, other factors such as resources, economies of scale, or coordination costs can also affect innovation and may distinguish innovative performance in startups versus established firms (Cohen, 2010) . However, the focus of our analysis is not on performance differences across firm types per se but rather on the degree to which the particular motives typical of startup employees are associated with higher innovative performance, potentially giving startups an advantage over established firms in generating innovation."}, {"section_title": "Proposition 6: Ceteris paribus, the profile of motives typical of startup employees is associated", "text": "with higher innovative performance than that typical of employees in small or large established firms."}, {"section_title": "Data and Measures", "text": ""}, {"section_title": "Data", "text": "Our empirical analysis uses data from the Scientists and Engineers Statistical Data System (SESTAT), developed by the National Science Foundation. The sample population includes individuals who have a college degree or higher and who are either working in a science and engineering occupation or who are trained in related fields. Most data were collected via a mailed questionnaire; a smaller number of questionnaires were administered by telephone, in personal interviews, and via the Internet. Response rates for the SESTAT component surveys ranged from 60-80%."}, {"section_title": "5", "text": "Our primary analyses use data from the 2003 SESTAT. More specifically, we use data from 10,585 respondents who hold a Bachelors, Masters, or PhD degree and who are full-time employees in for-profit firms in a range of industries (see online appendix Table A1 ). The largest industries in our sample are computer systems design, scientific R&D services, semiconductors, aerospace, telecom services/internet, chemicals, and pharmaceuticals. Since we are primarily interested in innovative activities and performance, we restrict the sample to respondents who indicate that their primary type of work is basic research, applied research, development, design, or computer applications. 6 For supplementary analyses, we also draw on additional data from the 2001 Survey of Doctorate Recipients (a component of SESTAT), which are available for 2,519 of the 10,585 respondents."}, {"section_title": "Key Dependent and Independent Variables", "text": "Firm type: Respondents indicated the size of their employer in terms of the number of employees in all locations combined. Respondents indicated one of eight size classes (EMSIZE): 10 or fewer employees, 11-24, 25-99, 100-499, 500-999, 1000-4999, 5000-24999, and 25000+ employees.\nRespondents also indicated whether their employer came into being as a new business within the past 5 years (NEWBUS=1). We use the age and size measures to define three focal firm types:\n• Startups (NEWBUS=1, EMSIZE<100 employees);\n• Established small firms (NEWBUS=0, EMSIZE<100);\n• Established large firms (NEWBUS=0, EMSIZE>100); 7\nThroughout our econometric analysis, the STARTUP category will generally be the omitted reference group. Overall, 580 respondents work in startups, 1,059 in established small firms, and 8,946 in established large firms."}, {"section_title": "8", "text": "Innovative performance: Each respondent reported the number of U.S. patent applications in which he or she was named as an inventor over the last 5 years prior to the survey (PATENTS). We recognize that patent applications are an imperfect measure of innovative performance. For example, not all inventions are patented (Cohen et al., 2000) and patent propensity may differ across industries, scientific fields, and different types of R&D. To mitigate this concern, we routinely include controls for industry, scientific field, as well as the type of R&D (see Table 1 ). In addition, we utilize an industry level measure of patent propensity taken from Cohen et al. (2000) in a robustness check. A second limitation is that patent counts and especially patent applications provide limited insight into the quality of inventions.\nWhile NSF does not allow the matching of SESTAT data to external data sources such as patent citations, the survey asked for patents granted in the last five years. Given that they have passed the standards of the patent office (e.g. novelty and non-obviousness), granted patents may provide some insights into quality and will be used for auxiliary analyses.\nMotives: Respondents were asked to rate the importance of different work benefits in response to the following question: \"When thinking about a job, how important is each of the following factors to you…?\". The benefits and their respective importance measures are salary, job security, intellectual challenge, degree of independence, and level of responsibility. Economists routinely assume individuals' motives and preferences to be exogenous, and many social psychologists consider motives to be largely stable and \"trait-like\" (see Amabile et al., 1994; Cable & Edwards, 2004; Stern, 2004; Lacetera & Zirulia, 2012 ). However, we will also explore potential changes over time in auxiliary analyses.\nA concern with measures using the same scale is that correlations may be inflated due to common methods bias (Podsakoff et al., 2003) . The correlations between motives range from 0 (salary and challenge) to 0.44 (responsibility and independence), suggesting that the measures capture distinct constructs. More importantly, common methods bias is unlikely to affect the relationships between our key dependent and independent variables since they were measured using different types of scales and include subjective as well as objective measures.\nJob characteristics: SESTAT includes proxies for two of the job characteristics featured in our conceptual discussion. First, the survey asked respondents for their basic annual salary, excluding bonuses or overtime pay. We use the natural logarithm to adjust for the skewed nature of this measure. Second, respondents indicated which of 9 non-R&D work activities occupied more than 10% of their time (including accounting, employee relations, management, production, professional services, sales/marketing, quality management, teaching, other). We use the count of these non-R&D activities as a proxy for the range of responsibilities respondents have in their jobs.\nAbility: It is important to consider potential differences in ability since workers may sort into startups based on their ability (Zenger, 1994) and ability may also be correlated with motives (Halaby, 2003; Stern, 2004) . We follow prior work by using measures of educational attainment as proxies for ability (Brown & Medoff, 1989; Zenger, 1994; Zenger & Lazzarini, 2004; . We first code a set of dummy variables indicating whether a respondent's highest degree was a Bachelors, Masters, or PhD. In addition, we include a set of 5 dummy variables indicating the Carnegie classification of the degree granting institution, including research I, research II, doctorate granting, comprehensive/liberal arts, and other institutions. Formal education should be a particularly relevant measure of ability in R&D, where performance depends critically on domain-relevant technical and cognitive skills and on substantive knowledge (Amabile, 1996; Fleming, 2001; Singh & Fleming, 2010) .\nMoreover, measures of educational attainment may also reflect more innate differences in ability and intelligence to the extent that high ability individuals choose degrees and programs that are particularly demanding or to the extent that top tier institutions selectively admit students with higher ability."}, {"section_title": "Additional Variables and Measures", "text": "We include a range of additional variables to control for potential sources of heterogeneity across industries, employers, individuals, as well as the nature of respondents' work (see Table 1 ). As such, many of the factors that are commonly unobserved in prior work are explicitly controlled for. We will consider potential remaining sources of endogeneity in robustness checks and auxiliary analyses.\n--------- Tables 1 and 2 about here --------- Table 2 compares the means of key variables across the three types of firms. We find that startup employees consider challenge, independence, and responsibility to be significantly more important than do employees in established large firms. At the same time, startup employees rate salary and job security significantly lower. 10 Differences between startup employees and employees of established small firms are less pronounced and only the security motive is significantly different, with a higher rating in established small firms. To allow for an easier interpretation of the magnitude of these differences, we created a new set of binary measures that indicate whether a respondent considers a particular motive \"very important\" (score of 4) versus not very important (score lower than 4). Figure 1 uses these measures to compare employees in the three types of firms with respect to their profile of motives, also indicating which differences are statistically different. Figure 1 shows that the largest difference in employee motives is with respect to the importance of job security: only 40% of respondents in startups rate job security \"very important\", compared to 52% in small established firms and 59% in large established firms. The differences with respect to other motives are considerably smaller (see Table 2 for details)."}, {"section_title": "Results", "text": ""}, {"section_title": "Motives in Startups versus Established Firms", "text": ""}, {"section_title": "Figure 1: Profile of Employee Motives Across Firm Types", "text": "Note: Share of respondents in each firm type rating a particular motive \"very important\". *= significantly different between startups and established large firms (at 5%), # =significantly different between startups and established small firms Thus, by far the biggest differentiator between employees working in startups and those working in established firms is a lower concern with job security, perhaps reflecting a more general willingness to bear risk. This result is consistent with prior work showing that scientists and engineers view the lack of job security as the key concern with employment in startups and that those with lower levels of risk aversion are more likely to find startup employment attractive (Roach & Sauermann, 2010; Neff, 2012) .\nThis result also complements prior work on the risk preferences of founders (Van Praag & Cramer, 2001; Shane et al., 2003; Xu & Ruef, 2004) by providing novel insights into the risk preferences of startup employees. Whether the observed differences with respect to other motives are judged large or small depends upon one's priors, but some of these differences -especially those related to \"intrinsic\" motives such as challenge and independence -are smaller than might be expected based on common stereotypes about startups and their employees.\nTo complement Figure 1 , Table 3 security motives than employees in small or large established firms. While challenge and responsibility motives are significantly higher than in large established firms, salary motives are significantly weaker. In models 6-10 we additionally include respondents' demographic characteristics such as gender, age, and family situation. Several of these variables have significant coefficients, suggesting that some motives differ for males and females (see Niederle & Vesterlund, 2007) and may also change over individuals' life cycle. Even when these sources of variation in motives are accounted for, however, significant differences across firm types in security motives and in the importance of salary remain. Overall, Figure 1 and Table 3 provide support for propositions 1, 2, 4, and 5 but show only weak support for proposition 3 (differences in independence motives).\n--------- Table 3 about here ---------"}, {"section_title": "Job Characteristics across Firm Types", "text": "The data provide measures that allow us to probe differences across firm types with respect to two of the job attributes discussed in the conceptual part -salary and responsibility (Table 4 ). Model 1\nshows that controlling for ability as well as the nature of work and demographic characteristics, startup employees earn higher salaries than employees in established small firms and roughly the same as employees in established large firms. The measure of annual salary is limited, however, in that it does not account for potential differences in how much employees work. Table 2 shows that startup employees work longer hours (47.5) than employees in small and large established firms (45.5 and 45.2, respectively), and accounting for hours worked (model 2), startup employees earn significantly less than those in large established firms. Model 3 additionally includes the measure of respondents' salary motives and shows a large and positive coefficient. This observation is consistent with our conceptual argument that employees who care strongly about money sort into jobs that offer higher salary. Models 4-6 examine differences in job responsibilities, as proxied by the number of non-R&D work activities. We find that scientists and engineers in startups report a significantly larger number of activities than those working in large established firms, consistent with the notion that startups offer fewer opportunities for specialization and that it is not only founders who engage in a broad range of activities (Lazear, 2005) but also startup employees. Not surprisingly, individuals who work longer hours also report a larger number of work activities (model 5). Model 6 includes the responsibility motive and shows a strong positive relationship, again consistent with sorting and selection arguments.\nIn conjunction with the our earlier results regarding differences in motives across firm types, the observed differences in salary and responsibility lend further support to our conceptual argument tying firm age and size to job characteristics and individuals' motives. Unfortunately, we do not have objective measures for other job attributes. However, the survey provides a measure of respondents' overall satisfaction with their jobs. Using this measure, models 7-9 in Table 4 show no significant differences in job satisfaction across firm types. Although job satisfaction reflects complex psychological processes (Freeman, 1978) , one potential interpretation is that startups and established firms offer different types of job characteristics and benefits but that shortcomings with respect to some benefits (e.g., job security) are offset by advantages in others (e.g., challenge) (Rosen, 1986) . Future research on such potential compensating differences using detailed measures of job characteristics is clearly needed.\n--------- Table 4 about here ---------"}, {"section_title": "Innovative Performance in Startups versus Established Firms", "text": "We now turn to the question whether the observed differences in motives across firm types are related to differences in innovative performance. Our featured performance regressions use counts of patent applications as the dependent variable and are estimated using negative binomial regression (Table   5 ). Model 1 includes only control variables and the firm type dummies. Compared to startup employees, researchers in small established firms have 52.6% lower patent application counts and researchers in large established firms have 31.8% lower counts.\nEmploying the mediation approach used by Elfenbein et al. (2010) , model 2 adds individuals' motives to examine the degree to which controlling for motives reduces the estimated performance gap.\nConsistent with proposition 6, we find that both firm type coefficients are significantly reduced (Chi 2 (2)=16.11, p<0.01). 11 After accounting for differences in employee motives, employees in established small firms have 45.8% fewer patents, and employees in established large firms have a 16.7% lower count. Examining the coefficients of motives, we find that challenge and independence motives have a significant positive relationship with output. More specifically, a one-SD increase in the challenge motive is associated with a 26% higher expected patent count, and a one-SD increase in the independence motive is associated with a 10.9% higher expected count. In contrast, researchers with strong security motives have significantly lower patent output; a one-SD higher security motive is associated with a 18.3% lower patent count. These results are consistent with the notion that intrinsic motives are particularly conducive to creativity while risk aversion and a concern with failure may reduce the scope of search and lead individuals to pursue safer but also potentially less novel projects and approaches (Amabile, 1996; Sauermann & Cohen, 2010) . Model 3 excludes motives but includes the measures of educational attainment. PhDs and Masters have significantly higher output than Bachelors, but including these measures has only minor impacts on the firm type dummies. Model 4 includes motives and ability simultaneously and supports the earlier findings.\nTo examine the degree to which the effects of motives are mediated through levels of effort, model 5 additionally includes the measure of hours worked. As expected, this measure has a positive coefficient -an additional hour of effort is associated with a roughly 1.9% higher expected patent count (quadratic terms were not significant). However, including hours worked does not significantly change the coefficients of motives. Finally, model 6 includes the two measures of job characteristics, i.e., the number of non-R&D activities and salary. While the former has no significant coefficient, salary has a strong positive relationship with patent output. The salary coefficient should not be interpreted as causal, however, since even base salary (which excludes bonuses) may be endogenous to performance in the longer term. 12 In our context, the more important observation is that including these two measures has no effect on the firm type dummies. Similarly, while the coefficients of motives are somewhat reduced, job security and challenge motives continue to have large and significant relationships with patent output."}, {"section_title": "Potential Changes in Motives over Time", "text": "Our conceptual discussion emphasized selection mechanisms, i.e., that individuals with preexisting motives sort into organizations that offer high levels of the corresponding job characteristics.\nConceptualizing motives as fixed individual traits is common in the economic literature (Stern, 2004; Agarwal & Ohyama, 2013) and also among social psychologists (Amabile et al., 1994; Cable & Edwards, 2004) . Similarly, sociologists have shown that motives -especially those related to \"entrepreneurial\" job attributes -tend to be shaped very early in life and remain relatively stable in later stages (Halaby, 2003) . However, other studies have argued that individuals' preferences and attitudes may also change due to socialization processes in a given organizational context (Allen & Katz, 1992; Sorensen, 2007) . While both selection and socialization mechanisms would imply meaningful and relevant differences in motives across firm types, we now explore their relative role.\nA first piece of indirect evidence comes from prior work using samples of scientists and engineers prior to their initial career transitions, i.e., before they were exposed to potential socialization in a particular type of firm. In particular, Roach and Sauermann (2010) surveyed U.S. science and engineering PhD students, collecting measures of both motives and career preferences. The authors found that those respondents who aspired to a career in startups were less risk averse and tended to have a stronger desire for responsibility and autonomy than those who preferred a job in an established firm. Our interpretation of these results is that heterogeneity in motives exists before employment and that motives may have an important role in shaping career choices and sorting patterns. \"very important\" ratings) compared to 9.9 (74.1% vs. 64.2%) in the older cohort, suggesting that the large firm environment may indeed have a noticeable impact on employees' intrinsic motives (Sorensen, 2007) .\nIn a second set of analyses, we draw on additional data available for the subsample of 2,519 PhD respondents who also responded to the 2001 Survey of Earned Doctorates (SDR). That survey included the same questions on motives and allows us to examine changes over time by comparing responses in the two time periods. Descriptively, we find that motives are quite stable; the share of respondents reporting the same importance in both time periods exceeds 60% for each of the five motives. 13 In Table 6 , we regress the observed changes in motives on control variables as well as a set of dummy variables indicating whether and how a respondent changed his/her employer type (e.g., move from startup to established large firm, from established small firm to startup, etc.). We find a small number of significant coefficients, some of which are consistent with socialization effects while others are not. On the one hand, we find that PhDs who move from startups to established large firms show an increase in salary motives, while those who move from established large firms to a startup show a decrease in job security motives.\n13 75.7% for challenge, 69.3% for salary, 64.11% for security, 66% for independence, and 62.3% for responsibility.\nOn the other hand, we also find that PhDs who moved from an established small firm to a startup show a decrease in salary motives (even though startups pay higher wages) and that those who move from a startup to an established large firm show an increase in independence motives. Note that even the coefficients that are consistent with socialization cannot be interpreted as causal effects since employer type changes were not randomly assigned but may reflect selection decisions by individuals whose motives have changed exogenously.\n14 In addition to changes in motives due to socialization, we now consider whether motives may be endogenous to actual performance, e.g., that researchers who are successful begin to care more about challenging work, while those who underperform start to worry about job security. We examine this possibility in two ways. First, we use the sample of PhDs who also responded to the 2001 SDR and include a measure of individuals' performance in 2001 in the regression of changes in motives over time (Table 6 , models 1-5). We find no association between prior performance and subsequent changes in motives. Second, we conduct the following thought experiment: Given that many cases in our sample have no patent application, having even just one indicates relatively good R&D performance. As such, any reverse effects running from performance to security or challenge motives should be observed primarily between those individuals with no patent and those with one patent. Any additional patents should have a smaller impact on motives. In contrast, the mechanisms highlighted in our conceptual discussion -such as the potentially detrimental impact of risk aversion on creativity -should happen across the full range of output, and may even be most pronounced at the high end of the performance distribution. Thus, reverse causality concerns would be strengthened if coefficients of motives are particularly strong in a regression distinguishing respondents without patents and those with one patent, while stronger coefficients in a performance regression predicting the count of patents conditional upon having at least one would provide support for causality running from motives to performance. Results for both models are reported in Table 6 . Mitigating endogeneity concerns, we find that motives have stronger effects in the regression predicting the count of patents conditional upon patenting (model 7) than in the regression distinguishing individuals without a patent from those with one (model 6).\nOverall, the analyses in this section show some evidence of socialization in large established firms, but these effects appear to be relatively small compared to selection effects. We find no evidence that motives changed in response to realized performance.\n--------- Tables 5 and 6 about here ---------"}, {"section_title": "Supplementary Analyses and Robustness Checks", "text": "NSF confidentiality regulations do not allow us to match individual-level SESTAT data to external data sources, preventing us from using patent citations as proxies for the quality of innovative output. However, in addition to patent applications, the SESTAT survey includes a measure of the number of patents granted in the prior 5 year period. Since the mean of this variable is very low (0.6) and the share of individuals with granted patents is small (16%) we estimate regressions of this variable using probit models. As such, these regressions examine which individuals have produced at least one patent that passed the quality threshold set by the patent office. The qualitative patterns are similar to our featured analyses (Table 7 , models 1-3); R&D active startup employees are more likely to have a granted patent than those employed in established firms, and these differences are significantly reduced once individuals' motives are included in the regression (Chi 2 (2)=24.77, p<0.01). Given the limitations of the patent measures available in SESTAT, however, this result is only suggestive; future work is needed to examine differences in the quality and nature of output across different types of firms using more detailed measures (see Sorensen & Stuart, 2000; Balasubramanian & Lee, 2008) .\nNext, we examine the possibility that motives play different roles in different types of firms. For that purpose, we interact each of the motives with the two firm type dummies. Similarly, we interact hours worked with the firm type dummies to examine potential differences in the relationship between effort and performance. Since interaction terms can be problematic in nonlinear models (Chunrong & Norton, 2003; Hoetker, 2007) , we estimate these regressions using OLS. The results show only one significant difference: security motives have a more negative relationship with patenting in startups than in established firms (online appendix, Table A4 , models 1-3). One possible interpretation is that the negative impact of a concern with security on creativity is larger if workers actually find themselves in particularly risky organizational environments.\nOur measure of innovative performance (patent applications) has a skewed distribution with some individuals reporting a very high number of applications. To ensure that our results are not driven by a small number of outliers, we estimated key regressions dropping those cases with more than 20 patent applications (i.e., more than one patent per quarter). The results are robust (online appendix, Table A4 ).\nOur analysis thus far has focused on the degree to which employees' motives differ across firm types and may give startups a performance advantage relative to small and large established firms. We abstracted from other factors that may shape innovative performance and made no predictions as to overall performance differences across types of firms. We now briefly discuss additional factors that may lead to differences in patent output across firm types and how they may affect our results.\nA first possibility is that startups can be found primarily in more nascent technological areas with greater technological opportunities. To a large degree, the inclusion of industry fixed effects as well as controls for respondents' degree field should address this possibility. In addition, all regressions control for the nature of research (i.e., basic, applied, etc.) and for different sources of funding. We further probe robustness by restricting the sample to firms in industries with high startup activity (i.e., more than 5% of respondents working in a startup). Regressions 4-6 in Table 7 show that our results hold.\nAnother possibility is that there are differences in patent propensity, e.g., that startups rely more strongly than other firms on patents as a signal of their quality or as a mechanism to appropriate value from inventions (Graham et al., 2009; Conti et al., 2011; Belenzon & Pattaconi, 2012; Hsu & Ziedonis, 2013 ). Such differences may be reflected in the coefficients of firm type dummies in our regressions; however, they are unlikely to be related to employee motives and would not explain why firm type dummies change once motives are included. We nevertheless tried to gain a better understanding of the potential role of patent propensity by using a measure taken from Cohen et al. (2000) , who report the average share of inventions that is patented across a range of manufacturing industries (Table A1 in their paper). While this measure does not allow us to account for differences in patent propensities across firm types, we interact it with firm types to see whether the patenting gap across firm types depends on the general appropriability conditions in an industry. We estimate regressions using the 5,639 individuals employed in industries for which the patent propensity measure is available and we use OLS to be able to more clearly interpret potential interaction effects (Table 7 , models 7-9). 15 While the interaction terms are slightly negative (suggesting that the patenting gap between startups and established firms may be larger in industries that more heavily rely on patents), none of the coefficients is statistically significant.\nAn important question is whether observed performance differences across firm types may reflect survival bias and selection effects at the firm level. The seminal model developed by Jovanovic (1982) provides a useful framework for thinking about this possibility. 16 Assume that young firms start out small, vary in randomly assigned capabilities, and learn about these capabilities over time. Those firms that turn out to possess superior capabilities have an incentive to leverage them and grow, while firms below a certain capability threshold exit. Firms that are good enough to stay in the industry but not good enough to grow remain small. By incorporating heterogeneity in firm capabilities, this framework provides an explanation for our observation that small established firms perform worse (and pay less) than large established firms and than startups: they are those firms that had a draw from the lower end of the capability distribution and were not good enough to grow. 17 A selection on capabilities does not, however, provide a ready explanation for the observed higher performance in startups than in large established 15 Cohen et al. use a somewhat different industry classification than we employ to create our primary industry controls. We matched industries as closely as possible using more detailed industry classifications available in SESTAT. 16 We thank an anonymous reviewer for this suggestion. 17 Our main models in Table 5 show that performance in small established firms is significantly lower than in startups even controlling for employee characteristics, consistent with the notion of firm-level differences in capabilities.\nfirms since the latter should be more strongly selected based on superior capabilities than the former (Jovanovic, 1982) . Thus, both considerations of heterogeneity in capabilities and our focus on differences in job characteristics related to firm size and age can provide useful and complementary insights.\nA related possibility is that startups and established firms have different aspiration levels with respect to innovation, e.g., because startups realize that superior innovative performance is required to survive competition with better-resourced established firms. As such, startups may specifically hire R&D employees with higher productivity profiles than established firms. This possibility raises the question why startups would be able to attract such individuals, especially given the high demand for S&E human capital (National Science Board, 2012). Our study suggests one potential answer, namely that startups offer job characteristics that appeal to workers with motives that are particularly conducive to innovation.\nFinally, prior work has discussed a wide range of other factors that may also affect innovative performance across types of firms (Schumpeter, 1942; Cooper, 1964; Acs & Audretsch, 1990; Damanpour, 1992; Cohen & Klepper, 1996; Agarwal & Audretsch, 2001; Cohen, 2010) . Among others, these factors include access to financing, scale economies and fixed cost spreading, or complementarities between R&D and other activities as potential advantages of large firms. Small firms may have advantages in R&D because of less bureaucracy as well as easier communication and coordination.\nSimilar to other potential drivers of innovative performance discussed earlier, these factors may be reflected in the firm type dummies estimated in our regressions. However, these factors are unlikely to explain the observed relationships between individuals' characteristics and innovative performance, or the change in firm type coefficients once individuals' motives are included in the regression.\n--------- Table 7 about here ---------"}, {"section_title": "Relationship with Prior Work", "text": "Before we conclude, it is useful to highlight differences and complementarities with particularly relevant related work. A first important study is Elfenbein et al.'s (2010) examination of the \"small firm effect\", i.e., the phenomenon that small firm employees are more likely to found their own firms in a subsequent period than employees working in large firms. Using older waves of the SESTAT data, Elfenbein et al. explore a range of possible mechanisms, including the possibility that individuals with strong preferences for autonomy are more likely to join small firms and then also find entrepreneurship particularly attractive (\"preference sorting\"). In contrast to Elfenbein et al. who focus exclusively on firm size, our study distinguishes firm size and firm age, developing a more nuanced conceptual and empirical understanding of potential differences in the role of these two firm characteristics. Moreover, the Elfenbein et al. study contributes to the literature on founders by examining employees' transition into subsequent self-employment as the primary outcome of interest, while our study focuses on differences in the characteristics of employees and how they relate to innovative performance during employment.\nFinally, while Elfenbein et al. use an aggregate measure of the preference for self-employment, our study examines differences with respect to preferences for a range of specific job characteristics, showing that such differences vary with respect to both their sign and magnitude. Even though Elfenbein et al. examine different types of preferences and focus on sorting into small firms and entrepreneurship rather than startups, they find evidence of selection effects, consistent with our general conceptual premise.\nOur study also relates to work by Sauermann and Cohen (2010) , who use a narrower sample of respondents to the Survey of Doctorate Recipients to show systematic relationships between individuals' motives and innovative performance in industrial R&D generally. We take this prior evidence as a building block and ask whether motives differ between startups and established firms and may be related to differences in innovative performance across types of firms. Thus, while Sauermann & Cohen focus on establishing the relationships between motives and performance as such, our focus is on differences in motives across firm types and their implications for differences in performance (neither of which are considered in the Sauermann & Cohen paper). Conceptually, this different research question is reflected in our discussion of job characteristics and incentives available in startups versus established firms, and of potential sorting effects such differences would imply. Empirically, we provide unique evidence regarding differences in motives and job characteristics across firm types and examine changes in performance differences across firm types once individual characteristics are taken into account."}, {"section_title": "18", "text": ""}, {"section_title": "Discussion", "text": "Using data on over 10,000 U.S. scientists and engineers, we examine the extent to which individuals' pecuniary and nonpecuniary motives differ between startups and established firms and whether any such differences are associated with differences in innovative performance. Compared to employees in large established firms, startup employees place a lower value on salary and job security, the latter possibly reflecting a more general willingness to bear risk. On the other hand, startup employees have stronger motives related to responsibility and challenge, although these differences are smaller than might be expected. We also find that scientists and engineers in startups have more patent applications than individuals in established firms, and this performance advantage is noticeably reduced once we account for differences in researcher motives. Thus, employee motives may play an important role in distinguishing innovative performance in startups versus established firms. 18 The relationships we observe between motives and performance are largely consistent with those in Sauermann & Cohen (2010) . However, likely due to the use of quite different samples, we find no relationship between income motives and performance, while they find a positive relationship. As noted above, the relationship between pecuniary motives and innovation has been subject to much debate and additional work is needed to establish potential moderators and boundary conditions.\nOur results should be interpreted in light of important limitations. First, we primarily relied on cross-sectional data, limiting our ability to clearly distinguish selection effects and potential socialization during employment in a particular type of organization. However, auxiliary analyses suggest that the role of socialization is relatively small. Whether due to selection or socialization, differences (and similarities) in employee motives in startups versus established firms are substantively interesting, especially given long-standing assumptions that have received little empirical attention. Second, we observed significant relationships between employee motives and innovative performance, but our data do not allow us to conclusively establish causality. Somewhat mitigating endogeneity concerns, the SESTAT data provide a rich set of measures that allowed us to control for many typically unobserved characteristics of individuals and the nature of their work, as well as proxies of firm and industry characteristics. Moreover, robustness checks showed no evidence of a reverse causality running from past performance to motives.\nNotwithstanding these limitations, our study makes several contributions. First, we contribute to the entrepreneurship literature by complementing prior studies on founder motives with novel evidence regarding the motives of startup employees. Consistent with qualitative accounts, we find that intrinsic motives are very important to R&D personnel in startups, yet these motives are also very important for scientists and engineers in established firms. In contrast, a higher tolerance for risks is what most strongly sets apart startup employees from those working in established firms, suggesting interesting similarities between startup founders and those who join them in their entrepreneurial efforts (Van Praag & Cramer, 2001; Shane et al., 2003; Neff, 2012) . More generally, our results highlight the value of future research on startup employees as a distinct group of employees and as important entrepreneurial actors (see also Roach & Sauermann, 2013) . Second, we contribute to the literature on human capital, especially in knowledge-intensive settings. While much of this literature has focused on ability, skills, and experience (Agarwal et al., 2009; Toole & Czarnitzki, 2009; Campbell et al., 2012) , our results suggest the potential value of closer attention to workers' motives as an understudied dimension of human capital.\nFinally, our study contributes to the literature examining differences in innovative activity and performance across different types of firms. We advance research on the role of firm size and age by linking these firm-level attributes to specific organizational characteristics and to employee motives, thus providing conceptual and empirical insights into micro-level correlates of size and age. 19 Despite\nSchumpeter's early conjectures and the appeal of the notion that employee motives may differ across firm types, empirical evidence regarding the direction and magnitude of such differences has been lacking.\nMoreover, our analysis suggests that higher rates of innovation are associated primarily with firm age 19 If certain firms have superior abilities to attract more productive workers, it is an open question how much of the resulting performance advantage should be credited to \"individual\" vs. \"firm\" effects. See Mollick (2012) for a related discussion.\nrather than size; indeed, individuals in small but old firms had the lowest innovative performance. Thus, while much prior work has focused on firm size, future work should consider more explicitly the role of firm age and the interplay between age and size.\nOur discussion points to an important question for future research: What happens as startups mature? While small firms may stay small, young firms (that survive) will invariably age and may change with respect to the job characteristics and incentives they offer (Chen et al., 2012) . If these changes are inconsistent with the motives of early employees, employees may decide to move and it may be the most \"entrepreneurial\" and productive employees who are most likely to leave aging firms to join a new venture (Baron et al., 2001; Sorensen, 2007) . Insights into the dynamics of startup growth might help founders to preserve an entrepreneurial atmosphere and to retain highly productive employees who may have joined the firm exactly because it was small and young (see also Campbell et al., 2012) .\nFor managers, our results also highlight potential challenges established firms may face when seeking to \"acqui-hire\" R&D personnel by buying innovative startups (Selby & Mayer, 2013) . If the resulting integration changes job characteristics and incentives towards those typical of established firms, employees who initially joined the startup because they valued the entrepreneurial environment may soon become disenfranchised and seek to leave. Conversely, our results also suggest potential benefits from creating \"entrepreneurial\" units within large firms that explicitly seek to replicate features of young and small organizations (see O'Reilly & Tushman, 2004) .\nFor policy makers, our results speak to the merits of supporting certain types of firms. They reinforce Haltiwanger et al.'s (2013) observation that it seems to be young firms rather than small firms that provide the largest societal benefits. While Haltiwanger et al. focus on employment growth, we make similar observations regarding the innovative performance of employees. At the same time, it is likely that economic growth is pursued best by a mix of firms with advantages in different aspects of innovation and production (Powell et al., 1996; Gans et al., 2002; Agrawal et al., 2012) . Moreover, to the extent that performance advantages in startups result primarily from superior human capital, it is not clear that increasing the numbers of startups per se will yield the greatest dividends since additional firms may not be able to draw on the same labor supply as the startups in our sample. As such, the most promising policies may relate to science and engineering education. While most educational policies currently focus on increasing skills and substantive knowledge, there may be additional benefits from developing mechanisms that help identify and support individuals with motives that are particularly beneficial for entrepreneurship and innovation. Future research on the nature and potential benefits of such policies seems particularly promising. Table A1 ). Industry dummies are intended to control for differences in technological opportunity and other industry-level conditions affecting R&D productivity. Primary work type Work activity on which respondent spends the most hours during a typical work week, including basic research, applied research, development, design, and computer applications or programming. Funding by DoD/NASA and by NIH/NSF To control for heterogeneity in the nature of research, we include dummies indicating whether the respondent's projects were funded by the Department of Defense / NASA or by the NIH/NSF. The former projects may be less likely to be disclosed in patents due to secrecy concerns. Projects funded by NIH/NSF may be particularly advanced. Interactions with professional community (Prof. meeting)\nRespondents indicated whether they had attended at least one professional meeting in the last year. We use this proxy to control for heterogeneity in respondents' research orientation and in the degree to which employers pursue an \"open science\" strategy, both of which may be related to both motives and innovative performance (Stern, 2004) . Quantity of effort (Hours worked)\nAs a proxy for the quantity of effort, we include the hours worked in a typical work week, as reported by the respondents. While this measure is likely to be noisy and may not capture less conscious cognitive effort (e.g., during \"shower time\"), it should be a reasonable proxy (see also Zenger & Lazzarini, 2004; Sauermann & Cohen, 2010 Extent to which the current work is related to the field of the highest degree, rated on a 3-point scale. Used as control for heterogeneity in relevant human capital."}, {"section_title": "Job tenure", "text": "Years since starting the current job. Job satisfaction (Jobsat) Respondents rated their overall satisfaction with their job using a 4 point scale ranging from 1 (very satisfied) to 4 (very dissatisfied); reverse coded for ease of interpretability. Patent propensity Industry average of share of product innovations that are patented. Taken from Cohen et al. (2000) , "}]