[{"section_title": "", "text": "Pediatric psychologists are often interested in finding patterns in heterogeneous longitudinal data. Latent Variable Mixture Modeling is an emerging statistical approach that models such heterogeneity by classifying individuals into groupings with similar patterns, called latent classes. The purpose of this second article is to offer a nontechnical overview and introduction to longitudinal mixture modeling to facilitate applications of latent variable mixture models (LVMM) within the field of pediatric psychology. In part 1 (Berlin, Williams, & Parra, 2013) we provided an overview of LVMM, highlighted the strengths of this analytic approach, and reviewed strategies for determining the optimal number of observed subgroups.\nStep-by-step examples were provided illustrating two prominent types of cross-sectional mixture modeling: Latent class and latent profile analyses. This companion article builds off the foundational knowledge presented in part 1 and provides stepby-step examples illustrating closely related LVMMs of longitudinal data: A latent class growth analysis (LCGA) and two variants of a growth mixture model (GMM).\nAs described in part 1, LVMMs focus on categorical latent variables representing latent classes. LVMM is a person-centered approach that probabilistically assigns individuals into latent classes based upon similar patterns of observed cross-sectional and/or longitudinal data. LVMM groups individuals into subpopulations by inferring, based on the data, each individual's membership in latent classes. As a byproduct of mixture modeling, every individual in the data set has their own probabilities calculated for their membership in all of the latent classes estimated. Latent classes are based on these probabilities. Individuals are allowed fractional membership in all classes, reflecting the varying degrees of certainty and precision of classification (Asparouhov & Muthén, 2007; Muthén, 2001) .\nIn this article, we illustrate examples of longitudinal LVMM, which includes latent class growth analysis (LCGA) and growth mixture modeling. Given space limitations, longitudinal latent class, models such as hidden markov models, mover-stayer models (Langeheine & van de Pol, 2002) , and latent transition analyses (LTA) will not be covered; however, an introduction to and book length treatments of LTA are available are available for those interested (Collins & Lanza, 2009; Lanza, Flaherty, & Collins, 2003) . We begin by briefly reviewing latent growth curve models (LGCMs), which serve as the foundation for both LCGAs and GMMs. We then present examples of LCGA and GMMs using the four steps recommended by Ram and Grimm (2009) with considerations from Jung and Wickrama (2007) : (a) problem definition, (b) model specification, (c) model estimation, and (d) model selection and interpretation."}, {"section_title": "Latent Growth Curve Modeling", "text": "To distinguish LCGA and GMMs it is helpful to briefly review LGCMs and the parameters of this type of model.\nLGCM is a multivariate application of SEM that examines how individuals change on one (or more) observed outcome variable over time. In LGCM repeated measurement of observed variables are used as indicators of latent variables that represent different aspects of individual's change (see Figure 1 , circles labeled intercept and slope). Most often, there are two latent variables (sometimes called random coefficients). The first is an intercept, which represents the level of the outcome when time is equal to zero and the second is a slope, which represents the rate of change in the outcome over time. In LGCM each participant has his/her own estimated intercept and slope, and these are allowed to vary across individuals. In Figure 1 , this variability across individuals is estimated as the variance of the latent intercept and slope and is represented as a double-headed arrow originating from and pointing to the same variable. If the slope and intercept are believed to relate to one another, their covariance can be modeled to reflect how an individual's start value relates to his/her rate of change. Latent variables also have means, reflecting the average of all individuals' intercepts and slopes. These means are depicted in Figure 1 as the paths leading from the triangle to the intercept and slope. In addition, participants have their own deviations from these means at each time period, called residual/error variance, as well as residuals, and/or random effects, which are depicted graphically with the smaller circles with double-headed arrows (labeled rv1-rv6). Significance tests for all these parameters are available to determine whether these estimates differ from zero and can be used to answer questions such as \"is the amount of change, on average, significantly different than zero?\" or \"is there significantly variability in individuals' rate of change?\"\nThe exact interpretation of the intercept and slope depend on how the researcher fixes or estimates the relations between these latent variables and their indicators. By fixing the observed variable factor loadings (e.g., the values of F1 to F6 in Figure 1 ), different hypothesized relations can be tested about the origin (zero point) and the rate or shape of change. This assumes that individuals were assessed at roughly the same intervals (later we will show an example when there are individually varying times of observations). Typically, the intercept factor loadings are all fixed to one (a \"constant\") in tandem with fixing the first slope loading to zero (e.g., F1 in Figure 1 ) such that the intercept can be interpreted as the individual's estimated start value. Interpretation of the slope depends on how the remaining slope factors are specified. To model linear change, the slope loadings then are fixed to reflect the time since (or until) the zeropoint. In Figure 1 , children's body mass index (BMI) zscores are measured six times over the course of eight years: Fall and spring of kindergarten, and the spring of first, third, fifth, and eighth grades. To interpret the slope as the annual linear rate of change in BMI z-scores, the factor loadings of F1-F6 would be fixed at 0, 0.5, 1.5, 3.5, 5.5, and 8.5, representing the time in years since zero. If the desired metric of time was months, these values could be fixed at 0, 6, 18, 42, and 102. Other intercept values might also be of interest, and can be modeled by altering which slope factor loading is fixed to zero. For example, by fixing the slope loading of the last time point (e.g., F6) to zero (and F1 = −8.5, F2 = −8, F3 = −7, F4 = −5, F5 = −3), the mean intercept is interpreted as the average value of the youth's BMI z-score during the spring of eighth grade, and the mean slope is interpreted as the average annual rate of change in the youth's BMI z-score.\nTwo of the benefits of a SEM approach to modeling change is the flexibility it offers in terms of modeling time and the available tools to evaluate these models. As a structural equation model, Figure 1 represents the researcher's hypothesis about the relation between time and the outcome, and as such, goodness-of-fit statistics and other indices can be used to establish the best way of modeling relationships and/or change over time. Figure 1 hypothesizes that changes in BMI z-scores are linear, but alternative models can be tested by adding additional latent variables, changing/freely estimating the slope factor loadings, and/or imposing various constraints within the model. Alternative models include no-change (an intercept only model), polynomial change with one (quadratic function), two (cubic function), three (quartic) or more curves, piecewise (breaking growth into specific segments) and/or other complex and nonlinear models (Barker, Rancourt, & Jelalian, 2013; Ram & Grimm, 2007) . For example, if researchers believed that the amount of BMI z-score change either accelerates or decelerates with the passage of time, a third latent variable representing the quadratic slope could be added to the growth model. Factor loadings for this quadratic slope would be fixed to correspond to the square of the linear slope's loadings (i.e., 0, 0.25, 2.25, 12.25, 30.25, and 72.25) . We encourage those interested in an overview of SEM specific to pediatric psychology to review Nelson, Aylward, and Steele (2008) .\nTwo additional models warrant brief mention: Piecewise growth and latent basis models. With six or more time points, it is possible to estimate separate patterns of change for different phases of the study period (piecewise model). For example, inspection of the individual raw data and the mean level data may suggest a relatively flat pattern of change over the first three time points followed by a steep increase between the fourth and sixth time points. These models are also useful for clinical trials in which there is a period of improvement and/or symptom reduction followed by a maintenance period that has relatively little change. A benefit to the piecewise model is that it allows the researcher to estimate both trajectories simultaneously. The most flexible modeling of time is the latent basis framework Meredith & Tisak, 1990) . This framework, along with fixing at least two time points, allows researchers to freely estimate the remaining factor loadings to reflect time that may not follow a standard mathematical shape. Often, the first loading is fixed to zero and the last is fixed to one. This allows for interpretation of the estimated factor loading as the relative percent of growth achieved by the last time period. Latent basis models may be the best choice for data that do not seem to fit typical linear, quadratic, or cubic patterns.\nIt is important to note that the number of time points available will influence how change over time can be modeled. With three time points, it is possible to model a linear pattern and a latent basis model; with four time points, linear and quadratic patterns can be modeled as well as a latent basis model; and with five time points, linear, quadratic, and cubic patterns can be modeled as well as a latent basis model. We encourage those interested in learning more or seeking technical details to review the work of Duncan, Duncan, and Strycker (2006) , Preacher, Wichman, MacCallum, & Briggs (2008) , and Bollen and Curran (2005) and we refer readers to Delucia and Pitts (2006) and Singer and Willett (2003) for coverage of the multilevel approach to modeling change. We now turn our attention to modeling longitudinal data using LVMM."}, {"section_title": "Latent Class Growth Analysis and Growth Mixture Models", "text": "Both LCGA and GMMs are closely related to one another and are specific types of LGCMs. A major analytic goal of LCGA and GMM is to understand and predict individual differences (or variability) in parameters reflecting participants' change in outcomes over time. Individuals are classified into latent classes based upon similar patterns of data. The observed distribution of values may be a \"mixture\" of two or more subpopulations whose membership is unknown. As such, the goal of both LCGA and GMM is to probabilistically assign individuals into subpopulations by inferring each individual's membership to latent classes from the growth model data. The conceptual basis for these models is depicted graphically in Figure 1 , in which the arrows from the categorical latent variable \"C\" to the latent means, variances, covariances, and residual variances, signifies that these parameters can vary across latent classes (to decrease clutter in the figure these arrows point to the names of the various parameters, rather than to the graphical depiction of every possible parameter).\nThe primary difference between LCGA and GMM is which values are allowed to vary within and across latent classes. LCGA is a special type of GMM, in which the variance of latent slope and intercept are fixed to zero within class, and allowed to vary only across classes. Because there is no within class variability there is no covariance between the slope and intercept, and there are far fewer parameters to estimate. With these constraints, it assumes that all individual growth trajectories within classes are homogeneous (Nagin, 1999) . This approach may be particularly helpful when working with smaller sample sizes or when more complex models fail due to nonconvergence, out of range estimates, or other statistical problems, or as an initial modeling step prior to specifying a GMM model (Jung & Wickrama, 2007) .\nUnlike LCGA, GMM is a more flexible approach that allows researchers to determine which of the parameters depicted in Figure 1 (latent variables means, variances, covariances, and residuals, etc.) can vary both within and across classes. In the context of a LGCM model, researchers may attempt to account for vari-ability in slopes and intercepts by adding predictors of change and baseline values to the growth model. This approach assumes that the sample is drawn from a single population that can be adequately characterized by a single set of parameters (i.e., those depicted in Figure 1; . In cases where subpopulations are observed, such illness type, sex, race, geographic regions, etc., this is typically handled using multiple population or multiple group approaches to LGCM (Duncan, Duncan & Strycker, 2006; Ch. 5) . When heterogeneity in growth parameters may be due to the mixture of two or more unobserved subpopulations whose membership is unknown a priori, LGCM may not be the best approach. If these unobserved memberships are believed to be distinguished by different growth parameters, than LVMM may be an excellent approach to identify these individuals."}, {"section_title": "Four-Step Framework", "text": "Consistent with recommendations (Ram & Grimm, 2006) , we follow a four step process to estimate LVMMs: Problem definition, model specification, model estimation, model selection and interpretation (see part 1 for an overview). The procedures unique to estimating longitudinal LVMMs are described briefly below. Example syntax is available for all models as an online supplement."}, {"section_title": "Problem Definition", "text": "When conducting LVMMs with longitudinal data, a key step in the problem definition stage is determining the best way of modeling change over time. Researchers must identify a change function (straight line [linear function], one curve [quadratic function], two curves [cubic function], or two or more separate trajectories [piecewise model)] that best represents patterns of change in the data. This single-group model will be used as the base model for the mixture analyses. Theory and prior research should be used to guide selection of the base, single-group model. In addition, inspection of individual-level raw data and mean level patterns over time can provide clues on how best to model change. If several single-group models seem plausible, a separate latent growth curve analysis should be conducted for each pattern of change. The statistical fit can then be used to evaluate each of the models and establish the best way to model change over time. To evaluate the goodness-of-fit of the singlegroup models, excellent models generally have the following values: CFI ≥.95, RMSEA <.05, and SRMR <.05 (Hu & Bentler, 1999) ."}, {"section_title": "Model Specification", "text": "In the model specification stage of estimating longitudinal LVMMs, hypotheses about the number of classes should be generated. Again, theory and prior research should be used to inform this decision. Researchers can also take an exploratory approach and estimate as many classes possible that yield proper solutions. In estimating longitudinal LVMMs, researchers must make initial decisions about whether they will fix the variances for the latent intercepts and latent slopes/change functions to be equal within each class. If so, a LCGM will be estimated. If the researchers want to allow within group variability for the latent intercepts and latent slopes/ change functions for each class, a GMM will be estimated. In conducting a GMM, decisions about whether means and variances for latent variables (e.g., intercept and slope), variances and residual variances for observed variables, and covariances among latent variables will be freely estimated or fixed to be equal across classes (e.g., the parameters in Figure 1 ). All of these decisions can be based on theory, prior research, and/or practical considerations (model convergence, etc.).\nIn this stage of estimating LVMMs, hypotheses about the number of classes are generated. We took an exploratory approach and estimated as many classes possible that yielded proper solutions. In order to provide useful examples we examined three types of LVMM: A LCGA (with the slope and intercept variances fixed to zero), and two GMMs, one with time-points that were either fixed or estimated (i.e., quadratic or latent basis), and one with individually varying times of observation. For these LVMMs, we opted for a model building approach. Specifically, for the initial GMMs that we conducted, we allowed means for the latent variables (e.g., intercept and slope) to vary across classes; then, we conducted analyses in which we allowed the means and variances for latent variables to vary across classes; then, we let covariances among the latent variable to vary across classes; finally, we allowed the variances for the six observed variables to vary across classes."}, {"section_title": "Model Estimation", "text": "In this step, researchers select the estimation method that will be used and evaluate the statistical and conceptual fit of these models. The same strategies for cross-sectional data apply to longitudinal data (see part 1 for details).\nAs noted above, all models were estimated in Mplus version 7.11 (Muthén & Muthén, 1998 -2012 , under missing data theory using all available data and robust (Full Information) maximum likelihood estimation. Again, we decided to run growth mixture analyses for each of the single-group models that provided an acceptable fit to the data (i.e., quadratic, cubic, piecewise quadratic, and latent basis models). We encountered several issues when estimating the quadratic, cubic, and piecewise GMMs. One issue that emerged across each of the models was strong associations between intercepts and change functions and/or strong associations between change functions (e.g., slope and quadratic latent variables) for some classes. Our analyses often yielded messages like the following: \"WARN-"}, {"section_title": "Model Selection and Interpretation", "text": "The final model is chosen based on the various fit statistics and model considerations. The same strategies for cross-sectional data apply to longitudinal data (see part 1 for details); however, a critical step here is examining the output for nonconvergence and/or nonplausible values that might include correlations >1 and/ or residual variances that are negative (which cannot be negative as the computation requires squaring values). LVMMs are known to be \"finicky\" and researchers using these techniques will invariability encounter such problems. Although there are many reasons for these types of errors, they are especially common if you have variables with variances that exceed 1 to 10, a group with a ceiling or floor effect, small sample/latent class sizes, and/or misspecified models. Techniques to remedy there errors have been strongly debated and include checking the tech output, increasing starts/iterations, and providing new start values. If these strategies do not resolve the problem, researchers often fix nonsignificant negative residual variances to a positive value close to zero, use a different estimator (i.e., Bayes) and/ or specify a different model. These \"new\" models may include fixing variances and residual variances to be equal within/across classes or freeing previously fixed parameters. In these cases it is especially important for researchers to have a clear conceptual and statistical rationale for their remedy.\nWe attempted to estimate two through six class solutions for all LVMMs. A five-class model did not converge on a proper solution for the latent basis GMM. Findings for latent basis LCGA, latent basis GMM, and quadratic GMM are presented in Table II and Figures 4-6. For each model (k number of classes), replication of the best Loglikelihood was verified to avoid local maxima. For models with greater than two classes, it was verified that the previous model's loglikelihood was equal the to k-1 loglikelihood for the BLRT tests.\nLatent Basis LCGA Because LCGA are less complex, more clearly identify classes, and are less computationally burdensome, it is helpful to begin the model building process with a LCGA before proceeding with GMMs (Jung & Wickrama, 2007) . For the present example, increasing the number of latent classes resulted in increasingly better (i.e., smaller) AICs, BICs, and SSA-BICs, without any detriment to entropy, which hovered ~.81 (Table II) . The model comparison tests suggested that successively adding more classes almost always resulted in a better model. Since the BIC and BLRT generally perform the best, these results suggest that the six class model should be further explored. An important caveat is that this is probably a poorly specified model, given past research finding substantial within class variability. The assumption of zero variance within classes (as modeled here) is not likely tenable and might account for each successive model (and subsequently more variability) seeming to improve the fit of the models. As such, we only briefly interpret these LCGA findings (and refer interested readers to Nagin, 1999 for more details), as the GMMs described next might be a better statistical representation of our hypothesized models of BMI z-score growth.\nLatent Basis GMM Consistent with the steps for selecting a best fitting model, we first examined the information criteria (ICs) fit statistics. As shown in Table II , IC fit statistics indicated that the four class model was the best fitting solution. We then looked at the entropy values. As shown, entropy was relatively low for all solutions, indicating that there is some inaccuracy in the classification of individuals into their most likely class. Notably, entropy values were within the acceptable range, but still quite marginal. We then examined the likelihood ratio tests.\nFindings indicated that the four class solution provided the best fit to the data. Finally, we considered the substantive meaning of the solutions, and determined that the four class model made the most conceptual sense. Taken together, we selected the four class model as the best fitting solution.\nBased on the growth patterns, the largest class (Class 3, 66.0%) was named \"Elevated Normal Weight Tracking (ENWT). Members of this class began with an average BMI z-score of .47 (significantly different from zero, p <.001), that had total amount of growth across the entire time interval that was on ~.28 (\"slope/shape\" p < .001). The estimated slope loading of a latent basis model reflect the proportion of the total amount of change between first (kindergarten) and last (eighth grade). Based on these factor loadings, ENWT class members had the achieved 0%, 3.5%, 31.6%, 73%, 111%, and 100% of the total z-score growth at Fall-K, and the Springs of K, first, third, fifth, and eighth grades, respectively. The second largest class (Class 2, 18.9%) named, \"Rapid Increase Percentile Crossing\" (RIPC) had an av- part 1, we were interest in potential sociodemographic differences in the latent class. Therefore, a pseudoclass draws based multinomial logistic regression was used and revealed that the 98th/99th Percentile Tracking (Class 4) had significantly more females compared with either Class 2 (p = .04) or Class 3 (p < .01). SES was not significant predictors of latent class membership (p-values ranged from .59 to .99).\nQuadratic GMM with Individually Varying Times of Observation Quadratic GMMs were modeled specifying one through six latent classes. These GMMs freely estimated each latent classes' own latent means, intercepts, variances and covariances, and observed variable residual variances. All parameter estimates and outputs were scrutinized for out of range estimates and error messages, and when necessary additional random starts were requested to replicate the best log-likelihood value. We began by reviewing the IC. Across all ICs, adding additional classes always resulted in an improved fit (decreased values, without ever increasing). Increasing the number of classes resulted in a worsening of the classification rates, as measured by the marginal entropy ranging from .71 to .59. Inspection of \"better\" entropy values can be helpful when the ICs are relatively similar . In this example, a two and four class model resulted in the best (yet still marginal) entropy values. At this point, inspection of the mean class values presented in Figure 6 can be helpful to look for overlapping class plots and/or unexpected trajectories in conjunction with our anticipation of either a three or four class model. One consideration specific to this example are proportions of youth in the most extreme weight trajectory [zscores > 1.04 and 1.64, which would place youth at 85th (overweight) to 95th (obese) percentile respectively]. Based on the NHANES 2000 cohort, we would anticipate the most \"extreme\" weight trajectory to represent 19% to 23% of the sample. Inspection of the three and four class solutions in Figure 6 reveals that both models have one such class; however, the three class model estimates that 69% of nonHispanic black youth are in the i n t r o d u c t i o n t o l at e n t V a r i a B l e m i x t u r e m o d e l i n g ( P a r t 2 ) 13 most obese trajectory, whereas, only 16% of youth are in that similar trajectory in the four class model. In light of this, the better ICs and entropy, we chose the four class solution as our final model. Based on the growth patterns, the largest class (#2, 62.6%) was named \"Elevated Normal Weight Tracking (ENWT). Members of this class began with an average BMI z-score of .34 (significantly different from zero, p < 0.001), that increased (linear slope) on average .09 per year (p < .001) that decelerated with time (quadratic slope −.004, p < .001). Class 4, called >99th Percentile Tracking, had the second highest proportion of members (16%). Their average initial BMI z-score was 1.51 (intercept significantly different from zero, p < .001) with no significant linear (slope = .03, p = .14), or quadratic change (slope = −.002, p = .34). The third Comparing Latent basis LCGA, Latent Basis GMM, and Quadratic GMM When comparing the results of the LVMM we see that LCGA trajectories have similar (parallel) slopes that are primarily distinguished as a matter of scale/severity (until the six class model), whereas both the GMMs have trajectories that are qualitatively different (more predominantly nonlinear) across classes and from the LCGA. This is due in part to the restrictions placed on LCGA, which result in a \"simpler\" model in which fewer parameters are estimated. This approach may be adequate given the research question that is being examined and in the context of smaller sample sizes. Also of note is the differential prediction of class membership across the types of LVMMs. Information of this kind may be helpful on deciding the final model as it may speak to validity. In our example, many sociodemographic predictors of youth's weight status have been identified (Ogden et al., 2012) , and as such this information could help to decide not only the number of classes but also choosing between the variants of LCGMs and GMMs."}, {"section_title": "Example Data", "text": "Participants Data were obtained from the Early Childhood Longitudinal Study, Kindergarten Class of 1998-99 (ECLS-K). The ECLS-K is a nationally representative sample of US children, their parents, teachers and schools. Baseline data were collected in the fall and the spring of children's kindergarten year . Subsequently, data were collected in the fall and spring of first grade (1999) (2000) , the spring of third grade (2002), the spring of fifth grade (2004), and the spring of eighth grade (2007) . The examples presented in this article focus exclusively on nonHispanic black participants given their elevated risk for overweight and obesity (Ogden, Carroll, Kit, & Flegal, 2012) . At baseline, there were 3169 nonHispanic black children (50.2% male) and during the eighth grade assessment there were 951 (50.4% male)."}, {"section_title": "Measures", "text": ""}, {"section_title": "Body Mass Index", "text": "Heights and weights were assessed at all six time points. These data were used to calculate BMI percentile scores that are standardized for the child's age and gender using tables provided by the Centers for Disease Control and Prevention/National Center for Health Statistics (CDC, 2010) . In this study, youth with BMI values ≥85th to <95th percentile were classified as overweight, and youth with BMI values ≥95th percentile were classified as obese, per existing guidelines (CDC, 2010) . In addition, a standardized BMI score (BMI z-score) was calculated for each participant following guidelines established by the CDC. Biologically implausible BMI zscores were coded as missing."}, {"section_title": "Longitudinal Latent Variable Mixture Model Examples Problem Definition", "text": "The first step in estimating a LVMM is identifying a single-group (nonmixture, LGCM) model that best represents change over time. Theory and prior research suggests that three to four BMI patterns will likely exist (Danner & Toland, 2013; Li, Goran, Kaur, Nollen &, Ahluwalia, 2007; Ventura, Loken and Birch 2009) . Inspection of individual-level raw data (Figure 2) indicates that substantial heterogeneity that appears to be nonlinear in nature. The mean values across the six time points also suggest a nonlinear pattern of change. To ensure that we identify the model of change that best represented the six waves of data, we conducted several single-group LGCMs. These included intercept only, linear, quadratic, cubic, piecewise quadratic, and latent basis models.\nPrior to conducting the LGCMs, we had to decide how to code time. For this study, data were collected at the following assessment points: Fall of kindergarten (1998-99), spring of kindergarten (1998-99), spring . We decided to code time using the following: .0, . 05,.15, .35, .55, and .85 . We selected this coding scheme to reflect the average time since the first measurement in the fall of kindergarten and divided each estimate by 100. In our experience, model convergence issues can result for large factor loadings for time, especially at late time points and when higher order change terms are modeled. Given that the exact date of BMI measurement was available for each participant, we also modeled time with individually-varying times of observations. This approach combines the multivariate SEM and multilevel modeling approaches to estimate random slopes and intercepts within a latent variable framework (see the TSCORES approach in Mplus; Muthén & Muthén, 1998 -2012 McLachlan & Peel, 2000) . All models were estimated in Mplus version 7.11 (Muthén & Muthén, 1998 -2012 , under missing data theory using all available data and robust (Full Information) maximum likelihood estimation. This strategy for handling missing data is an appropriate, modern method of modeling with missing data that makes use of all available data points (Little et al., 2013) and adjusts the standard errors and scales chisquare statistics to account for nonnormally distributed data. Alternative modern approaches to handling missing data were considered; however, these approaches were not chosen because they are not available within a mixture modeling framework (i.e., using auxiliary variables to predict missingness in conjunction with Full Information Maximum Likelihood) or would limit the availability of indices to help choose the optimal number of classes (e.g., model comparison likelihood ratio tests discussed later are not currently available with multiple imputation techniques). To evaluate the goodness-of-fit of the single-group models, excellent models generally have the following values: CFI ≥.95, RMSEA <.05, and SRMR <.05. We used (robust) maximum likelihood estimation with adjusted standard errors and chisquare test statistics that are robust to nonnormality. We selected this estimator because of the skewed nature of the BMI z-scores.\nAs noted, we estimated the following models to identify the best single-group model that will serve as the base model for the mixture analyses: Intercept, linear, quadratic, cubic, piecewise quadratic, and latent basis (Table I ). For the intercept only model, one latent factor was defined representing initial (Baseline) levels of BMI z-scores. Factor loadings for the intercepts for the six observed measures of BMI z-scores were fixed to 1. For the linear model, two latent factors were defined: One representing initial (Baseline) levels of BMI z-scores and one representing linear change in BMI z-scores (i.e., slope). Factor loadings for the intercepts for the six observed measures of BMI z-scores were fixed to 1; factor loadings for the slope factor were set to .0, .05, .15, .35, .55, .85). For the quadratic model, an additional latent variable was added to the linear model. It represented a quadratic pattern of change for BMI z-score (factor loadings fixed to .0, . 0025, .0225, .1225, .3025, .7225) . When estimating the quadratic model, we received a message about a negative residual variance for the eighth grade BMI z-score. Since residuals cannot be negative, we addressed this problem by fixing the residual variance for sixth time point to a small number (i.e., .00001). This solution fixed the problem and no additional warnings were generated. For the cubic model, an additional latent variable was added to the quadratic model. It represented a cubic pattern of change (factor loadings fixed to .0, . 000125, .003375, .042875, .166375, .614125) .\nWe also estimated a piecewise growth model. It included a linear slope for Time 1 through Time 3 and a quadratic function for Time 3 through Time 6 (the Factor loadings for the factor representing change were set to 0, *, *, *, *, 1 (asterisks indicate that a particular factor loading was freely estimated). Table I , the intercept only and linear models provided a poor fit to the data. These fit statistics also suggested that freely estimated time (latent basis), and quadratic, cubic, and piecewise models of growth all were acceptable models of nonHispanic black children's BMI z-scores from kindergarten to eighth grade. To further highlight how growth was estimated in these models, Figure 3 compares the means of the estimated BMI zscores with the observed mean values. Visual inspection of these graphs reveals that those models with better fit statistics tend to have a higher proportion of overlapping lines."}, {"section_title": "Based upon review of the fit statistics provided in", "text": "One can see what is tested statistically, namely the discrepancy between the observed and estimated values or how well our modeled data \"fit\" with the actual data. Based on these findings, it was not clear which model would serve as the best base model for the growth mixture analyses. We decided to run the mixture analyses for each of the single-group models that provided an acceptable fit to the data (i.e., quadratic, cubic, piecewise quadratic, and latent basis models)."}, {"section_title": "ING: THE LATENT VARIABLE COVARIANCE MA-TRIX (PSI) IN CLASS 2 IS NOT POSITIVE DEFINITE. THIS COULD INDICATE A NEGATIVE VARIANCE/ RESIDUAL VARIANCE FOR A LATENT VARIABLE, A CORRELATION GREATER OR EQUAL TO ONE BE-TWEEN TWO LATENT VARIABLES, OR A LINEAR DEPENDENCY AMONG MORE THAN TWO LATENT", "text": "VARIABLES.\" Despite considerable efforts (including increased iterations, providing start values, constraining error variances to be greater than zero, etc.), we were not able to identify a reasonable and proper fitting solution for the quadratic, cubic, or piecewise models. However, proper solutions for the latent basis models and quadratic model with individually varying times of observation were obtained and are presented below.\nProper fitting solutions were generated when using the latent basis model as the base model for the GMM and LCGA, and the quadratic model for the GMM with individually varying times of observation. As noted in the model specification section above, we ran several sets of models in which we allowed different means, variances, and covariances to vary across classes. The best solutions were obtained for a model in which the following parameters were freely estimated: (a) means and variances for latent variables representing intercept and change over time, (b) residual variances of six observed variables (BMI z-scores), and (c) covariance between intercept and change function latent variables."}, {"section_title": "Conclusions", "text": "Important research questions in the field of pediatric psychology pertain to better understanding patterns of change over time. For example, How do cognitive late effects in survivors of pediatric brain tumors change over time?, How does medication adherence change following an intervention to improve behavioral functioning in adolescents with inflammatory bowel disease?, and How does family satisfaction with clinical care change following the institution of a quality improvement program aimed at reducing wait time in an outpatient pediatric sickle cell clinic? It is unlikely that all individuals change in the same way, and as such, important subgroups of individuals many demonstrate distinct patterns of change. Identification of these meaningful subgroups and their unique patterns of change has the potential to advance current knowledge with respect to a wide range of applied research questions in pediatric psychology. Longitudinal LVMM is an analytic strategy designed to identify subgroups of individuals based on patterns of change, and thus can be a useful tool for researchers seeking to better understand the impact of health concerns on children and their families, as well as the impact of interventions designed to improve service provision, treatment adherence, and quality of life in children coping with a variety of acute and chronic health-related issues. This article was designed to provide pediatric psychologists with step-by-step instructions for carrying out two types of longitudinal LVMMs: LCGMs and GMMs. We also identified common problems that emerge when using these analytic frameworks and discussed possible solutions.\nAn important issue when considering whether to use LVMM is sample size, as insufficient sample sizes can be associated with convergence issues, improper solutions, and a limited ability identify small but meaningful subgroups. As discussed in part 1, sample size determination is difficult (i.e., it depends on number of parameters, missingness of data, reliability/distribution of variables, and relationship effect sizes) and rules of thumb often lead to over-or under-estimating the requisite sample size (Muthén & Muthén, 2002; Wolf et al., 2013) . Monte Carlo simulations to estimate power and sample size needs (Muthén & Muthén, 2002) are likely to be a helpful approach for pediatric psychologists because they may demonstrate that small samples are sufficient under certain circumstances. Fortunately, several examples of Monte Carlo simulations designed to estimate sample size are currently available (Muthén & Muthén, 1998 -2012 in particular]; 2002).\nIn closing, we highlight valuable resources that are available for helping researchers conduct cross-sectional and longitudinal latent variable mixture modeling. These include online Mplus short courses, the Mplus Web Notes page, and the Mplus examples page-all available at http://www.statmodel.com. Perhaps most notable among available resources is the Mplus Discussion Board. This discussion board provides researchers an opportunity to ask the Mplus developers and their research team questions about conducting analyses using Mplus. An impressive bank of questions and responses related to LVMM is also available for review on this site, and consequently, the Mplus discussion board is often the first place we turn when faced with a chal-lenging LVMM issue. These resources, along with this two part article, can facilitate researchers' use of LVMM to answer important questions in the field of pediatric psychology.\nSupplementary Data is presented following the References."}]