[{"section_title": "", "text": "• Off-farm occupation farms. Small farms whose principal operators report a major occupation other than farming (860,739 farms; 41.9% of U.S. farms). • Farming-occupation farms. Small farms whose principal operators report farming as their major occupation. • Low-sales. GCFI less than $150,000 (506,001 farms; 24.7% of U.S. farms). • Moderate-sales. GCFI between $150,000 and $349,999 (110,524 farms; 5.4% of U.S. farms). Midsize Family Farms (GCFI between $350,000 and $999,999) • Family farms with GCFI between $350, 000 and $999,999 (122,980 farms; 6.0% of U.S. farms). Large-Scale Family Farms (GCFI of $1,000,000 or more) • Large family farms. Farms with GCFI between $1,000,000 and $4,999,999 (53,763 farms; 2.6% of U.S. farms). • Very large family farms. Farms with GCFI of $5,000,000 or more (6,449 farms; 0.3% of U.S. farms)."}, {"section_title": "Nonfamily Farms", "text": "• Any farm where the principal operator and persons related to the principal operator do not own a majority of the business (24,992 farms; 1.2% of U.S. farms). Farms, Production, and Farmland Most U.S. farms are small; small farms operate half of farmland but account for only 23 percent of production. • Ninety percent of farms are small, and these farms accounted for 51 percent of the land operated by farms in 2016. • Large-scale family farms accounted for the largest share of production, at 45 percent. • Family farms of various types together accounted for 98.8 percent of farms and 90 percent of production in 2016. • Nonfamily farms accounted for the remaining farms (1 percent) and production (10 percent). Nineteen percent of nonfamily farms had gross cash farm income (GCFI) of $1,000,000 or more, and they accounted for 88 percent of nonfamily farms' production. Examples of nonfamily farms include partnerships of unrelated partners, closely held nonfamily corporations, farms with a hired operator unrelated to the owners, and (relatively few) publicly held corporations."}, {"section_title": "Small family farms", "text": ""}, {"section_title": "Number of farms", "text": ""}, {"section_title": "Land operated", "text": "Distribution of farms, value of production, and land operated by farm type, 2016 Midsize family farms Large-scale family farms Nonfamily farms"}, {"section_title": "Value of production", "text": "Note: Totals may not add to 100.0 percent, due to rounding.  • Large-scale family farms account for half of hog production and two-thirds of both dairy production and high-value crops like fruits and vegetables. • Midsize and large-scale family farms dominate cotton (83 percent of production) and cash grains/soybeans (74 percent). • Small farms produce 59 percent of U.S. poultry output and 50 percent of hay. • Small and large-scale farms together account for two-thirds of beef production. Small farms generally have cow/calf operations, while large-scale farms are more likely to operate feedlots. "}, {"section_title": "Cash grains and soybeans", "text": "Note: Totals may not add to 100.0 percent, due to rounding. 1 High-value crops include vegetables, fruits/tree nuts, and nursery/greenhouse products. Source: USDA, National Agricultural Statistics Service and Economic Research Service, 2016 Agricultural Resource Management Survey. • Each type of small family farm had between 54 and 77 percent of its farms in the red zone, with an OPM of less than 10 percent, in 2016. Most small farms in the red zone had a negative operating margin, the result of losses from farming."}, {"section_title": "Farm Financial Performance", "text": "• Other small farms were more profitable: 13 to 26 percent of each small farm group had an OPM in the low-risk green zone, with a margin greater than 25 percent. • Nevertheless, an even greater share of midsize (34 percent) and large-scale farms (47 and 40 percent) had an OPM greater than 25 percent. In addition, a majority of midsize and large-scale farms operated outside the red zone."}, {"section_title": "Percent of farms in each group", "text": "\n"}, {"section_title": "Farms by operating profit margin (OPM) and farm type, 2016", "text": "Note: Totals may not add to 100.0 percent, due to rounding. Operating profit margin (OPM) = 100 X (net farm income + interest paid -charges for unpaid labor and management) ÷ gross farm income.  • Most secondary operators on small farms are the spouse of the principal operator. • Multiple-generation enterprises are most common among largescale family farms and nonfamily farms (20-25 percent). • Principal and secondary operators on nonfamily multiple-generation farms are likely to be unrelated managers from different generations. • Generational lifecycles, particularly the presence or absence of younger related operators on family farms, may affect farm expansion and contraction decisions, as well as succession."}, {"section_title": "Multiple-operator and multiple-generation", "text": ""}, {"section_title": "Multiple-operator and multiple-generation farms by farm type, 2016", "text": "Note: Multiple-operator farms have more than one operator. Multiple-generation farms are multiple-operator farms with a difference of at least 20 years between the ages of the youngest and oldest operators. The remaining farms are single-operator farms with only one operator (not shown). • Thirty-six percent of principal farm operators were at least 65 years old in 2016, compared with only 14 percent of self-employed workers in nonagricultural businesses. • Retirement farms had the highest percentage of older operators (68 percent), as might be expected, followed by low-sales farms (38 percent). Only 21 to 26 percent of operators in the remaining typology groups were age 65 or older. • Operators age 55 to 64 made up the same share of farms as older operators, 36 percent, but they accounted for 42 percent of farm production versus 23 percent for older operators. • Older operators' production totals were less if they were retired. About one-third of older operators reported they were retired (12 percent of all U.S farms), and they accounted for only 3 percent of farm production. The remaining older operators (24 percent of U.S. farms) accounted for 20 percent of production. • The advanced age of farm operators is understandable, given that the farm is the home for most farmers and farmers can phase out of farming gradually by renting out or selling parcels of their land. Operators on retirement farms rented out 31 percent of their land in 2016 and enrolled another 14 percent in the USDA Conservation Reserve Program (CRP)."}, {"section_title": "Percent of principal operators at least 65 years old", "text": "Older principal operators by farm type, 2016 Note: The principal operator is the operator most responsible for running the farm. In the case of single-operator farms, the sole operator is a principal operator. Older operators are at least 65 years old. Wealth-as well as income-is important to farm household well-being, and farm household wealth exceeds that of U.S. households in general. • Median operator wealth for each type of farm was much higher than the median for all U.S. households in 2016. • Only 3 percent of farm households had less wealth than the median for all U.S. households, with little variation by type of farm. • "}, {"section_title": "Government Payments and Federal Crop Insurance", "text": "Recipients of Government payments differ by program. • Commodity program payments are targeted at production of specific commodities and reflect acreage in crops historically eligible for support. Seventy-seven percent of these payments went to moderate-sales, midsize, and large family farms in 2016, roughly proportional to their 80-percent share of acres in program crops. • Thirty-two percent of working-land conservation payments went to midsize family farms and another 20 percent went to large family farms. These programs target production, indirectly, by focusing environmental programs on lands in production. • CRP, however, targets environmentally sensitive land; retirement, off-farm occupation, and low-sales farms received 76 percent of these payments in 2016. • Seventy percent of all farms received no farm-related Government payments in 2016."}, {"section_title": "Percent of U.S. payments or acres of program crops", "text": ""}, {"section_title": "Distribution of Government payments by farm type, 2016", "text": "Note: Totals may not add to 100.0 percent, due to rounding. Bars of a given color sum to 100 percent.  • Legislation in 1994 and 2000 increased insurance premium subsidies, which encouraged more farmers to participate by providing them less costly coverage. In addition, attractive new insurance products-like revenue insurance-were introduced. • In recent Farm Acts, the emphasis shifted to a greater reliance on risk management through insurance and less reliance on income support through commodity programs."}, {"section_title": "Percent of total financial support", "text": ""}, {"section_title": "Share of direct financial assistance 1 to farmers from commodity-related programs, conservation programs, and Federal crop insurance subsidies, 1989 to 2016", "text": "Note: Commodity-related payments and conservation payments are reported by calendar year, but crop insurance premium subsidies are reported by crop year. A crop year is the 12-month period starting with the month when the harvest of a specific crop typically begins.  "}, {"section_title": "For further information, please contact:", "text": "Robert A. Hoppe (202) 694-5572 rhoppe@ers.usda.gov Images used in this publication are a derivative of images from GettyImages. Use of commercial and trade names does not imply approval or constitute endorsement by USDA. To ensure the quality of its research reports and satisfy governmentwide standards, ERS requires that all research reports with substantively new material be reviewed by qualified technical research peers. This technical peer review process, coordinated by ERS' Peer Review Coordinating Council, allows experts who possess the technical background, perspective, and expertise to provide an objective and meaningful assessment of the output's substantive content and clarity of communication during the publication's review. In accordance with Federal civil rights law and U.S. Department of Agriculture (USDA) civil rights regulations and policies, the USDA, its Agencies, offices, and employees, and institutions participating in or administering USDA programs are prohibited from discriminating based on race, color, national origin, religion, sex, gender identity (including gender expression), sexual orientation, disability, age, marital status, family/ parental status, income derived from a public assistance program, political beliefs, or reprisal or retaliation for prior civil rights activity, in any program or activity conducted or funded by USDA (not all bases apply to all programs). Remedies and complaint filing deadlines vary by program or incident. Persons with disabilities who require alternative means of communication for program information (e.g., Braille, large print, audiotape, American Sign Language, etc.) should contact the responsible Agency or US-DA's TARGET Center at (202) 720-2600 (voice and TTY) or contact USDA through the Federal Relay Service at (800) 877-8339. Additionally, program information may be made available in languages other than English. To file a program discrimination complaint, complete the USDA Program Discrimination Complaint Form, AD-3027, found online at How to File a Program Discrimination Complaint and at any USDA office or write a letter addressed to USDA and provide in the letter all of the information requested in the form. To request a copy of the complaint form, call (866) 632-9992. Submit your completed form or letter to USDA by: (1) mail: U.S. Department of Agriculture, Office of the Assistant Secretary for Civil Rights, 1400 Independence Avenue, SW, Washington, D.C. 20250-9410; (2) fax: (202) 690-7442; or (3) email: program.intake@usda.gov. USDA is an equal opportunity provider, employer, and lender. The mission of USDA's Economic Research Service is to anticipate trends and emerging issues in agriculture, food, the environment, and rural America and to conduct high-quality, objective economic research to inform and enhance public and private decision making. ERS shapes its research program and products to serve those who routinely make or influence public policy and program decisions."}]