[{"section_title": "Abstract", "text": "This paper attempts to shed more light on the teaching practices of part-time faculty members and their impacts on community college students. Thus, it carries out a comprehensive literature review. The review shows convincing findings. It has been found that part-time faculty members employ traditional teaching practices compared to full-time faculty members. These teaching practices have, to varying degrees, negative effects on community college students. It has also been found that some of the compelling factors that hinder part-time faculty members from utilizing effective teaching practices are institutional and departmental policies and practices. This paper identifies some gaps in the literature and calls for future studies. It delineates a couple of recommendations aiming at improving the teaching practices of part-time faculty as well as their working conditions. It is evident that part-time faculty members constitute the majority of faculty members at two-year institutions and are, to a great extent, responsible for the delivery of instructions to students. It has been anticipated that the percentage of adjuncts teaching at two-year institutions might have increased, especially after the downturn of the U.S economy in 2008. In her study, Twombly (2005) points out that a great number of full-time faculty members working at two-year institutions are expected to retire. The retirement is expected to occur since the publication of Twombly's study to the 2015 or more. The percentage of those retiring ranges from 30% to 40 %. Therefore, while two-year institutions are encountering fiscal constraints as well as other challenges (Frye, 2018; Kezar & Sam, 2010) , it seems that the easy way, in their perspectives, to surmount these constraints is to hire part-time faculty members. Those faculty members are to assume the responsibilities of full-timers either in teaching or in administrative tasks (Benjamin, 2015; Cataldi et al., 2005; Kezar & Sam, 2010) .\nFurther, Wagoner, Metcalfe, and Olaore (2004) highlight the fact that one of the cultures dominated in two-year institutions is the business culture that underscores the cost-efficiency meanwhile neglecting and compromising the"}, {"section_title": "Introduction", "text": "The reliance upon part-time faculty members has been increasing across all types of American two and four-year higher education institutions since the 1960s (Benjamin, 2015; Cataldi, Fahimi, Bradburn, & Zimbler, 2005; Cohen & Brawer, 2003; McNaughtan, Garcí a, & Nehls, 2017; Kezar & Sam, 2010) . Some of these institutions rely heavily on part-time faculty members due to numerous challenges such as, fiscal constraints, public and governmental pressures, and changing nature of student enrollment and demographics (Frye, 2018; Kezar & Sam, 2010) . Specifically, the employment of part-time faculty has been growing at community colleges since their inception (Cohen & Brawer, 2003) . In the fall of 2003, the percentage of part-time faculty members teaching at two-year institutions exceeded 66%; whereas, the percentage of full-time faculty members comprised approximately 33% (Cataldi at el., 2005) . Recently, it is documented that the percentage of part-time faculty teaching at two-year institutions is continuously increasing. According to the US. Department of Education (2016) the figure of part-time faculty teaching at two-year institutions approximately passed 70%. There are several names designated for distinguishing, whether negatively or positively, part-time faculty members from others. As such, part-time faculty members are called \"contingent faculty\", \"adjunct\", \"freeway flyer\", and \"road scholar\" (Christensen, 2008; Eagan, 2007; Kezar & Sam, 2010) . In this paper, all these names will be used interchangeably. quality of education. Agreeing with this finding, Eagan (2007) , after reviewing a considerable number of studies, concludes that community colleges hire part-time faculty in order to keep the operation of their programs, to maintain their tuitions at affordable cost, and to accommodate the shrinking funds appropriated by federal and state governments. Moreover, the hiring of part-time faculty allows community colleges more flexibilities in terms of class scheduling because part-time faculty members are more likely to teach during the weekend and evening time, teach undesirable courses due to the lack of autonomy, and assume more teaching load than their counterparts, full-time faculty members (Benjamin, 2015; for Community College Student Engagement, 2014; Christensen, 2008; Eagan, 2007; Frye, 2018; Kezar & Sam, 2010; Pearlman, 2013) . Further, the flexibility accrued to community colleges when hiring part-time faculty is also demonstrated either in the establishment of new programs or the abolition of old ones. Therefore, it seems that the hiring of part-time faculty is to benefit, to a great extent, the institutions while it may neglect the quality of education provided to the students.\nMost importantly, it has been well-known that the two-year institutions are the most affordable pipeline for a substantial number of students, especially underrepresented students, adult learners, low socioeconomic students, and others who attend these institutions. This is due to the wide held belief that these students will attend small classes while obtaining high quality education. This might, for example, enable such students for obtaining professional certificate, associated degrees, or transferring to four-year institutions (Cohen & Brawer, 2003; Cohen & Kisker, 2011; Thelin, 2019 Thelin, , 2011 . These various types of students cause one to think about the different students' cultures, backgrounds, and learning styles and their corresponding needs and interests, and how they navigate their college career successfully (Kuh, Kinzie, Buckley, Bridges, & Hayek, 2007; Pascarella & Terenzini, 2005) . The most salient question to be asked is how well community colleges respond and take into consideration all of these various aspects, and to what extent such colleges create the right and appropriate conditions for learning environment especially for improving the teaching practices and supports? (Kuh, Kinzie, Schuh, & Whitt, 2011) . This is due to the widely acknowledged observation that the real teaching predominantly takes place at two-year institutions (Twombly, 2005) . Twombly (2005) argues that \"Community colleges not only emphasize teaching, but they also define good teaching as being different from good teaching in 4-year institutions\" (p. 432). As it appears that the primary function of community colleges' faculty, including fulland part-time faculty members, is to deliver high quality education for all types of students.\nAdditionally, it has been documented that faculty members play critical roles in student's personal and academic life. Astin (1993 Astin ( , 2003 states that the faculty's impact upon student is substantial to the extent that the educator (faculty) might facilitate student learning and development and assist her/him to involve and engage in purposefully educational activities in inside and outside the classroom. As such, some teaching practices are highlighted in the literature for their potential for bringing positive and meaningful impacts on student learning and development. Chickering (1987) indicates that there are seven effective educational practices that faculty should undertake in order to assist college students succeed in their college career. These practices are as follows: \"encouraging contacts between students and faculty\", \"developing reciprocity and cooperation among students\", \"using active learning techniques\", \"giving prompt feedback\", \"emphasizing time on task\", \"communicating high expectations\", and \"respecting diverse talents and ways of learning\" (Chickering, 1987) . That is, it is essential to understand to what extent that part-time faculty members engage in the aforementioned effective educational practices and the magnitude of their interactions with students.\nTherefore, due to the significant influence and role that part-time faculty members play in educating community college students and the great percentage of courses taught by them, it is crucial to examine the instructional effectiveness of this type of faculty. It is also important to discern the instructional practices of those faculty members: How they teach, and what pedagogical techniques they utilize to fulfill and to accommodate the various needs and learning styles of community college students. To my knowledge, there is a gap in the literature regarding the instructional practices of part-time faculty at two-year institutions. This paper is an attempt to synthesize a comprehensive picture about the teaching practices of part-time faculty at community colleges. This paper undertakes a literature review. Thus, it reviews a considerable number of studies investigating the instructional practices of contingent faculty at two-year institutions and the impact of these practices on community college students. It begins with the discussion of instructional practices of part-time faculty, and an exploration of the effects of adjunct teaching practices on students. The paper also sheds some light on the institutional policies and practices that enhance or hinder the instructional effectiveness of part-time faculty, highlights direction for future research, and concludes with recommendations for community colleges students, part-time faculty members, full-time faculty members, chairpersons, and administrators."}, {"section_title": "Instructional Practices", "text": "One of the most important skills that a faculty should have acquired, practiced, and developed regularly in her/his classroom is employing diverse types of teaching methods (Biggs & Tang, 2011) . It is found that contingent faculty exercise few instructional pedagogies and lack the ability to incorporate new ones in their classroom (Christensen, 2008; Eagan, 2007; Kezar & Sam, 2010; Lei, 2007; Morthland, 2010; Sandford, Belcher, & Frisbee, 2007; Umbach, 2007) . Lei (2007) concludes that part-time faculty members utilize traditional teaching styles when delivering instructions to students. Those faculty members are more likely to lecture and less likely to foster group collaborations and class discussions, to use teaching laboratory, and to incorporate technology in their instructional practices. These findings have been reported by other scholars who reviewed a great number of studies in order to understand the instructional practices of adjunct faculty. For example, Sandford et al. (2007) states that the most dominant teaching method used by part-time faculty is lecturing. Sandford et al. (2007) add that the implementation of media, such as online discussion, distance learning, and other web-based activities, is hardly found in the part-timers' instructional practices. Most importantly, Sandford et al. (2007) suggest that part-time faculty may underestimate the sciences of pedagogy; therefor they might not accommodate the various needs of their respective students and might employ few teaching styles and methods.\nIt appears that part-time faculty members display, to varying degree, poor instructional practices. One can conspicuously recognize the deficiency of instructional practices of part-time faculty in terms of teaching methodologies. Chickering (1987) underscores that a faculty member is ought to use active learning techniques in order to help students learn and develop. In this case, part-time faculty members appear to employ traditional teaching styles that might not effectively foster student learning and development. That is, pace, need, and learning process of each student are less likely to be accommodated and fulfilled, and part-time faculty members display the shortcoming of appreciating and recognizing students' diverse talent and ways of learning. Most importantly, part-time faculty members are found to lack the ability to promote effective collaboration and communication among students. These practices reversely and adversely reflect the opposite of the good principle proposed by Chickering (1987) and identified in Astin's theory (2003) .\nAdditionally, while contingent faculty members appear to employ limited types of instructional methodologies, they also utilize few techniques in order to evaluate student learning and understanding (Boyer, Butner, & Smith 2007 , Eagan, 2007 Sandford et al. 2007 ). Eagan (2007) states that part-time faculty members are less likely to require their students to write multiple drafts. On the other hand, they are more likely to require their students to write short essay and answer multiple choice and short answer questions either in the midterm or in the final exam, compared to their full-time faculty counterparts. In their study, Sandford et al. (2007) pinpoint that contingent faculty members demonstrate substantial deficiency in terms of student learning assessment. They indicate that part-timers lack the ability to register and assess the entry level of their students, established criteria, and write reliable and standardized quizzes and tests. Corroborating these findings, Morthland (2010) suggests that part-time faculty members need substantial refinement in their evaluation practices. Morthland highlights that part-time faculty members provide little feedback to their respective students and display great deficiency in terms of student learning evaluation. These practices, in fact, are not the identical, optimal, and effective practices underscored by Chickering (1987) when he contends that one of the good practices that a faculty member should utilize is to provide prompt feedback. The feedback should be delivered in various ways and should be given promptly and regularly.\nAs well as the lack of implementing various techniques to assess student learning and development, adjunct faculty are found to have weak interactions with their respective students. They are reported to interact less frequently with their students, inside and outside the classroom (Hutto, 2017; Christensen, 2008; Boyer et al., 2007; Kezar & Sam, 2010; Sandford et al., 2007) . In their study, Sandford et al. (2007) conclude that part-time faculty members display deficiencies in interactions with their students. They have no, or at best, less frequent conversations with their students about the subject-matters being taught as well as other related issues and concerns. Consequently, they miss the opportunity to acquaint closely with their students and get to know them well. Thus, they are less likely to recognize the needs and interests of their students. In this sense, Sandford et al. (2007) underscore that part-timers display shortages in recognizing students' needs and motivations to learning. They add the observation that adjuncts less frequently take into consideration student previous educational experiences.\nIt seems that the aforementioned practices and behaviors displayed by part-time faculty members are completely in opposition to what Astin's involvement theory (2003) and Chickering's effective teaching practices (1987) suggest. They both emphasize the potent role a faculty can play to promote student intellectual, personal, and social development and learning through faculty-student and student-student collaborations and interactions. As reported previously, contingent faculty members have less contact with their students. They also promote no, or at best, little collaboration among their students. Consequently, the students are more likely to miss numerous opportunities for learning about and benefiting from other students' educational, cultural, and social experiences. This is unfortunate, knowing that these various experiences might hold substantial enrichment on students' learning and development."}, {"section_title": "Impacts on Students", "text": "The exposure to part-time faculty is found to have unintended consequences on college students (Hutto, 2017; Jacoby, 2006) . For instance, Jacoby (2006) used surveys administered on 1988, 1993, 1999, and 2004 by the National Center for Education Statistic (NCES) in order to gather data for its Integrated Postsecondary Education Data System (IPEDS). The data were collected from most of the public community colleges. All these colleges were required to submit information pertaining to their student enrollment, graduation rate, faculty number and status (full and part-time), finances, and others. When analyzing the percentage of full and part-time faculty members and the percentage of community college student graduation rate, Jacoby (2006) concludes that the increased employment of part-time faculty has a significant negative effect on student graduation rate. However, Jacoby's study does not explain further the negative relationship between the increased employment of part-time faculty and student graduation rate.\nAdditionally, Jacoby (2006) indicates that exposure to contingent faculty lowers the chance of community college students to transfer to four-year institutions. The limited transferability to four-year institutions is attributed to the students' exposure to part-time faculty. That is, when students enroll in courses taught by part-time faculty members, the likelihood of transferring to four-year institutions is decreased. Further, Jaeger and Eagan (2009) conducted a study in order to garner information regarding the negative impact of employment of part-time faculty on students associate's degrees completion. They conclude that the more exposure to contingent faculty members the less the likelihood that students will obtain their associate's degrees. In another word, when students take more courses with part-time faculty, they are less likely to complete their associate's degrees. Most importantly, first-year students who attend classes taught by adjunct faculty are found to perform poorly and ultimately receive low GPA ). Consequently, students might feel unsupported and might suspect their ability to complete their programs and obtain their associate's degrees.\nAlthough there are a number of studies showing the negative impacts of employment status (part-time status) on various learning outcomes, recent investigation shows otherwise. For example, Yu, Campbell, & Mendoza (2015) analyzed data from the Integrated Postsecondary Education Data System (IPEDS) as well as from the Beginning Postsecondary Students Longitudinal Study (BPS: 04/09), and they employed multilevel logistic regression. The finding indicates that there is no statistical association between employment of contingent faculty at two-your institutions and students degree attainment and certificate completion (Yu et al., 2015) . However, these findings are not in congruence with recent findings. In that, it is found that there is a statistically negative association between the employment of part-time faculty and students' course retention and completion in a Florida community college (Hutto, 2017) . As such, Hutto (2017) states that students who take courses with part-time faculty are less likely to be retained and complete those courses compared to students taking courses with permanent faculty members.\nAll in all, it can be said that students' social, human, economical, and cultural capitals are more likely to be negatively affected. To elaborate, according to the aforementioned impacts and negative instructional practices stemmed from the hiring of part-time faculty, community college students may, to a great extent, loss the potential to improve and enhance their human and economical capital, when they are not able to complete their respective programs, and when they encounter difficulties to transfer to four-year institutions. In addition, community college students who are taught by adjuncts may miss the opportunity to develop reciprocal relationship with their respective part-time faculty members as well as their students due the fact that effective communication, interaction, and socialization are lacking in their learning environments. Consequently, the students, along with their respective faculty, may not be aware of each other social and cultural backgrounds; therefore, the potential to improve one's social and cultural capitals is reduced. In addition, social and cultural mobility might not progress."}, {"section_title": "Working Conditions", "text": "Paradoxically, while contingent faculty members play significant roles in various higher education institutions by being responsible of teaching a substantial number of courses across all the various types of institutions, they encounter numerous obstacles and difficulties in their respective institutions. The causes of these obstacles are attributed to unsupportive and sometimes counterproductive institutional policies and practices. It has been documented that contingent faculty, to varying degrees, are enduring poor working conditions, lacking technical, professional, social, and financial supports from their respective institutions (Bakley & Brodersen, 2018; Christensen, 2008 ; Center for Community College Student Engagement, 2014; Coalition on the Academic Workforce, 2012; Eagan, 2007; Eagan, Jaeger, & Grantham, 2015; Jolley, Cross, & Bryant, 2014; Kezar & Maxey, 2012; Kezar & Sam, 2010; Pearlman, 2013; Thirolf, 2012; Wagoner et al., 2004) . Meanwhile, those faculty members are expected to carry out their teaching loads at high standards of performance comparable to their full-time faculty members who receive sufficient technical, professional, financial, and social supports.\nTo better understand the working conditions of part-time faculty members, it is appropriate to begin with the teaching load that part-time faculty members execute or expected to carry out. Coalition on the Academic Workforce (2012) reports a variation in the teaching load carried out by part-time faculty members as in the fall of 2012. The report reveals that seventy percent of part-time faculty members taught at a single institution. The teaching loads of these faculty members ranged from teaching one course to six courses per semester. On the other hand, twenty-one percent of part-time faculty members are found to be teaching multiple courses at multiple institutions. Furthermore, it is found that almost eighteen percent indicated teaching at two institutions while over four percent reported teaching at three or more institutions (Coalition on the Academic Workforce, 2012).\nThe working patterns, including the variations and large amount of teaching loads and working at multiple institutions, reported by part-time faculty members can be attributed to numerous reasons. For example, it might be due to the financial constraints experienced by those faculty members which cause such faculty members to find avenues (e.g., teaching more courses and teaching in multiple institutions) in order to fulfill their financial obligations. Another example might be the unavailability of teaching sufficient number of courses at a single institution. still another example might be the ambition of those faculty members to demonstrate their teaching capacities in an attempt to obtain full-time position at their respective institutions. Hence, for comprehending this issue, we turn now to the institutional supports, or the lack thereof, provided to this type of faculty members in order to facilitate their performance."}, {"section_title": "Institutional Policies and Practices", "text": "Because contingent faculty is responsible of teaching a great number of courses at the various types of higher education institutions, it is essential to shed more light on the technical supports, or the lack thereof, that these faculty members receive from their respective institutions. The first obstacle part-time faculty encounter begins in the hiring process. An abundant number of studies has documented that contingent faculty members are hired by their respective institutions in the last minute, ranging from one to three weeks before the beginning of the academic semester (Christensen, 2008; Kezar & Maxey, 2012; Kezar & Sam, 2010; Pearlman, 2013) . Therefore, part-time faculty members endure the inflexibility of class scheduling and encounter numerous difficulties like the inflexibility of time to commute smoothly between campuses for those who teach at multiple institutions, and the unavailability of sufficient time for updating their courses and preparing themselves adequately (Baldwin & Wawrzynski, 2011; Christensen, 2008; Jolley, Cross, & Bryant, 2014; Pearlman, 2013; Kezar & Sam, 2010; Umbach, 2007) . Specifically, after reviewing numerous institutional policies and practices, Kezar and Maxey (2012) pinpoint the fact that part-time faculty members are more likely to teach many classes in inconvenient time like in the evening and weekend than their full-time faculty counterparts. Therefore, the assumption of being exploited by the institution can truly be seen in the previously mentioned practices."}, {"section_title": "Technical Supports", "text": "Another obstacle experienced by part-time faculty is the lack of the basic infrastructure tools and materials that are essential to facilitate the performance of those faculty members. A considerable number of studies has found that part-time faculty members, teaching at four and two-year institutions, do not possess computer, email, copier and printer, mailbox, and most importantly, office space, and if they have it, they are more likely to share the space with unreasonable number of other contingent faculty members (Christensen, 2008; Center for Community College Student Engagement, 2014; Jolley, Cross, & Bryant, 2014; Eagan at el., 2015; Kezar & Maxey, 2012; Kezar & Sam, 2010; Pearlman, 2013) . Kezar and Maxey (2012) state that those faculty members have no access to the library at their respective institutions. Most importantly, contingent faculty members lack orientation programs that might be beneficial in terms of introducing those faculty members to their institutions and departments as well as informing them about the institutional and departmental cultures, missions, and objectives. In addition, part-time faculty members are excluded from workshops and professional trainings, have no access to funding resources to attend conferences, and obtain no professional evaluation (Christensen, 2008; Jolley, Cross, & Bryant, 2014; Kezar & Maxey, 2012; Kezar & Sam, 2010; Pearlman, 2013; Center for Community College Student Engagement, 2014) . It is evident that part-time faculty members are not being provided with the necessary equipment and supplies in order to effectively carry out their professional duties (e.g., teaching)."}, {"section_title": "Collegial Supports", "text": "As well as the lack of instructional and technical support, part-time faculty members lack social and collegial support (Bakley & Brodersen, 2018; Jolley, Cross, & Bryant, 2014; Eagan at el., 2015; Kezar & Sam, 2010; Pearlman, 2013; Thirolf & Woods, 2018) . They, in fact, endure hostile environments while working in their respective institutions. The hostility toward part-time faculty is ascribed to several causes. Abundant numbers of studies have found that the academic social stratification is the most dominant concerned expressed by part-time faculty members (Bakley & Brodersen, 2018; Jolley, Cross, & Bryant, 2014; Eagan at el., 2015; Kezar & Sam, 2010; Pearlman, 2013; Thirolf & Woods, 2018) . To elaborate, part-time faculty members are, to varying degrees, considered to be among the lowest in the hierarchy in their respective institution compared to their counterparts, full-time faculty members and administrators.\nAnother concern uttered by contingent faculty is the feeling of being marginalized in both their departments and institutions (Bakley & Brodersen, 2018; Jolley, Cross, & Bryant, 2014; Kezar & Sam, 2010; Thirolf & Woods, 2018) . These studies demonstrate the work of part-time faculty is at best unappreciated, uncounted, unnoticed, and at worst undervalued. It has been documented that part-time faculty are mostly excluded from departmental and institutional meetings and have no input into curriculum decision making (Center for Community College Student Engagement, 2014; Christensen, 2008; Jolley, Cross, & Bryant, 2014; Eagan at el., 2015; Kezar & Maxey, 2012; Kezar & Sam, 2010; Pearlman, 2013; Thirolf & Woods, 2018) . As a result, it is widely acknowledged that dissatisfaction is permanent among part-time faculty members, especially those who prefer full-time position. This is due to the lack of effective academic participation as well as the lack of recognition and appreciation of their work: professionally, socially, and financially (Bakley & Brodersen, 2018; Eagan at el., 2015; Kramer, Gloeckner, & Jacoby, 2014; Maynard & Joseph, 2008; Thirolf & Woods, 2018; Toutkoushian & Bellas, 2003) ."}, {"section_title": "Financial and Health Insurance Supports", "text": "As part-time faculty members suffer from the hostile climates, they endure inequality in terms of compensation and advancement. In regard to the inequality of compensation, Coalition on the Academic Workforce (2012) demonstrates that the median pay per course, reported by the part-time faculty member in the fall 2010, was $2,700. For those with bachelor's degrees the median pay per course was $2,250 while those with master's degrees earned $2,400. The median pay per course for those holding doctorate degrees was $3,200 while the median pay per course for those holding professional or terminal degrees ranged from $2,800 to $2,937. Furthermore, part-time faculty who were teaching at two-year institutions reported an average wage of $2,235 per course; whereas those who were teaching at four-year doctoral and research institutions reported the highest average of $3,400. In fact, the underpaid and overworked reported by contingent faculty have been documented in considerable amount of studies (Center for Community College Student Engagement, 2014; Kramer et al., 2014; Maynard & Joseph, 2008; Pearlman, 2013 Thirolf & Woods, 2018 Toutkoushian & Bellas, 2003) .\nIn regard to the advancement, part-time faculty experience little or no advancement and promotion while the length of their services at their respective institutions may exceed a great number of years, for example, ten or more years. Coalition on the Academic workforce (2012) reveals that part-time faculty members have a minimum increase in their salary. For instance, for those teaching for twelve to fourteen years and those teaching for twenty terms or more at the same institution, the median pay per course was $2,679 and $300, respectively. Strikingly, the findings pinpoint the fact that part-time faculty members are underpaid and experience minimum increase in their salary while serving many years at the same institution compared to their full-time faculty members (e.g., tenure track and tenured faculty members as well as other professionals holding similar credentials) (Center for Community College Student Engagement, 2014; Kramer et al., 2014; Maynard and Joseph, 2008; Pearlman, 2013; Thirolf & Woods, 2018) .\nAs well as the disadvantages in terms of compensation, part-time faculty members have mostly no access to benefits accrued to them from their higher education institutions, such as health insurance, and those who have health insurance are more likely to obtain theirs from employers other than their respective institutions. Abundant studies and reports highlight the fact that numerous adjunct faculty members are excluded from health insurance (Coalition on the Academic Workforce, 2012; Eagan at el., 2015; Kramer et al., 2014; Kezar & Sam, 2010; Pearlman, 2013; Center for Community College Student Engagement, 2014) . In particular, Coalition on the Academic Workforce (2012) demonstrates that twenty-two percent of a total number of respondents reported receiving health insurance from their institutions. However, the total medical cost was not fully covered by the academic employers, and more than three quarters of respondents indicated paying half of the cost and sometimes more than the half. In contrast, the silver lining of the issue is that the report shows that more than forty percent of part-time faculty members have access to retirement benefits through institutions. The retirement benefits were paid by the institutions, shared by the adjunct themselves and the institutions, and were borne by the adjunct themselves, 26.9%, 5.3%, and 9.2%, respectively (Coalition on the Academic Workforce, 2012).\nAll in all, the working pattern of part-time faculty is evidently miserable. They endure numerous obstacles and difficulties caused by their respective departments and institutions. Those faculty members lack the basic technical, professional, social, and financial supports that are essential for them to conduct their tasks in effective and efficient manners. Sadly stated, the assumption that part-time faculty are disadvantaged and exploited by their institutions is attested and proven to be true. After reviewing policies and practices dominant in the social work programs, Pearlman (2013) concludes that social work programs treat unfairly their part-time faculty while these programs are ought to be the advocacy of social justice and fairness. Ironically speaking, while these programs claim to permeate social and work justice in their programs, department, and the institution as a whole, they take advantage of their employees (part-time faculty) and underpay and undervalue them (Pearlman, 2013) .\nApparently, the aforementioned policies and practices are not only more likely to increase the dissatisfaction among part-time faculty members (Bakley & Brodersen, 2018; Eagan at el., 2015; Kramer et al., 2014; Maynard & Joseph, 2008; Toutkoushian & Bellas, 2003) but also affect the performance of these instructors. This, in turn, influences and affects the learning experiences and development of students who are taught by such faculty (Baldwin & Wawrzynski, 2011; Jacoby, 2006; Kezar & Sam, 2010; Umbach, 2007) . It is compelling to strongly contend that the shortcomings of the instructional practices of part-time faculty members should not be entirely attributed to and put on the shoulder of adjunct faculty members. In fact, the undesirable institutional and departmental policies, practices, and behaviors may greatly contribute to the disintegration of part-time faculty members into the college life and may affect negatively faculties' sense of belonging and commitment to the institution as well as to the students. These policies and practices might substantially hinder faculty performance and development. That is, students are the most affected party in this equation as it is discussed previously."}, {"section_title": "Future Direction", "text": "The investigation of instructional practices of part-time faculty is important; thus, more research should be conducted to answer several questions. Firstly, to my knowledge there is no study that has investigated the type of work that part-time faculty hold outside the academia, and how the work assumed outside the academia affects the faculty members' performance and ability to be effective or ineffective instructors. This compels us to ask the following questions: Do the various types of works assumed by part-time faculty outside the academia relate to their teaching practices? To what extent that these differences of nonacademic works affect, negatively or positively, students learning outcomes and growth? Answering these questions may help us determine and suggest the appropriate and the inappropriate professions that can be held or avoided by part-time faculty members beside their works in the academia. This is in order to assist such faculty members to succeed and flourish in their academic works.\nSecondly, disproportionate number of the studies reviewed in this paper were conducted at a single two-year institution. Hence, there is a compelling need to carry out many studies at multiple two-year institutions, so that more data can be gathered in order to deepen and broaden our understanding of part-time faculty members' performance and the related components. Thirdly, there is a lack of studies exploring the different instructional practices between full and part-time faculty at two-year institutions. The lack of such studies prevents us from understanding profoundly the pitfalls of each group. It also hinders us from designing appropriate remedial programs to improve the shortcomings of each group.\nFourthly, there is a lack of studies investigating the different types of instructional practices performed by part-time faculty who represent various departments and disciplines. Therefore, there is a compelling need to explore this area in order to come up with some solutions. At last but not least, there is a need for more studies investigating the employment of part-time faculty, and how it correlates with students' course retention and completion, certificate, program, and degree completion. Thus, there is a great need for studies examining simultaneously the correlation and/or \"effect\" at all levels (course, certificate, program, and degree) within the same studies. This might help us overcome the contradiction findings that might be caused by Simenon's paradox (Wagner, 1982; Simpson, 1951) which pinpoints to the opposite findings within the same data set (lower unit of analysis-course retention and completion-compared to higher level of analysis-degree completion)."}, {"section_title": "Recommendations and Implications", "text": "There are many implications that can be drawn from this paper. These recommendations aim at reducing the negative impacts of the employment of part-time faculty as well as improving their working conditions. The constituencies that may benefit from these implications may include the following: Students, part-time faculty members, full-time faculty members, and chairpersons and administrators. Firstly, students should be aware of each course they take or might take with faculty, including full and part-time faculty members. They should be vigilant when deciding to enroll in courses that might be taught by part-time faculty. Students should also analyze and think about and reflect on their experiences in pervious courses taught by the same faculty members, be they part-time faculty or full-time faculty.\nSecondly, while it has been documented that part-time faculty members employ traditional and limited teaching pedagogies, it is essential for contingent faculty members to educate themselves and broaden their teaching capacities and experiences (Biggs & Tang, 2011) . For example, they might be able to improve their instructional and pedagogical practices by observing other faculty in real classrooms. Part-time faculty might do at least two classroom visits each semester to other faculty members (e.g., full-and part-time faculty members). Part-time faculty members might insist and ask their chairpersons to assign them mentors in order to assist them in navigating their academic works smoothly and effectively.\nThirdly, upon the arrival of part-time faculty members, full-timers should establish professional relationships with part-time faculty members. In doing so, full-time faculty members might assist contingent faculty members to understand the academic, social, and professional cultures and procedures in their departments. They, full-timers, might as well help part-timers in recognizing institutional procedures and cultures. Full-time faculty members can also play substantial role in assisting part-timers to improve their performance and instructional practices via giving prompt feedback and via academic work collaboration. It is important for full-time faculty members, along with chairpersons, to call for the inclusion of part-time faculty members in department meetings and curriculums' decision making. As a result, part-time faculty will be held more accountable and may embrace the idea of being responsible of delivering high quality education.\nFourthly, administrators should modify the compensation system for the benefit of the institutions as well as their respective faculty members. For example, they can provide financial incentive for part-time faculty who display effective educational practices. In addition, the administrators and the chairpersons should appreciate and recognize the effort, time, and work done by part-time faculty members. As a result, part-time faculty members' sense of belonging is anticipated to increase and their commitment to their respective institutions will increase as well. Most importantly, administrators and chairpersons should provide part-time faculty members with essential instructional and technical supports like office space, computers, mailbox, telephones, printer, and other technical devices and supplies (Kezar & Sam, 2010) . As a result, the instructional practices of part-time faculty might be improved and developed. Furthermore, administrators, along with chairpersons, should establish professional and developmental center dedicated primarily to part-time faculty. The center should provide technical and professional supports like regular professional development workshops and conferences offered in various times as well as addressed various topics, so that the performance of part-time faculty might be enhanced and refined."}, {"section_title": "Conclusion", "text": "To sum up, the investigation of the instructional practices of part-time faculty members at two-year institutions reveals crucial findings. It is being documented that contingent faculty members employ traditional teaching methods, lack the ability to evaluate accurately and effectively students' learning, and display less frequent interactions with students. It is also being documented that community college students are considerably affected by these practices in terms of graduation rate, degree completion, transferability, and course retention and completion. However, the negative teaching practices that are attributed to contingent faculty members are, to a great extent, affected and brought about by the institutional and departmental policies and practices. It is, in fact, being documented that part-time faculty members lack the institutional and departmental supports, academically, socially, culturally, technically, professionally, and financially."}]