[{"section_title": "Abstract", "text": "In recent decades, economic damage from tropical cyclones (TCs) around the world has increased dramatically. Scientific literature published to date finds that the increase in losses can be explained entirely by societal changes (such as increasing wealth, structures, population, etc.) in locations prone to tropical cyclone landfalls, rather than by changes in annual storm frequency or intensity. However, no homogenized dataset of global tropical cyclone landfalls has been created that might serve as a consistency check for such economic normalization studies. Using currently available historical TC best-track records, a global database focused on hurricane-force strength landfalls was constructed. The analysis does not indicate significant long-period global or individual basin trends in the frequency or intensity of landfalling TCs of minor or major hurricane strength. The evidence in this study provides strong support for the conclusion that increasing damage around the world during the past several decades can be explained entirely by increasing wealth in locations prone to TC landfalls, which adds confidence to the fidelity of economic normalization analyses."}, {"section_title": "Introduction", "text": "The active North Atlantic tropical cyclone (TC) seasons of 2004 and 2005 coupled with their considerable social and economic impacts of several major hurricane landfalls precipitated a spirited scientific debate on the implications of changing climate conditions on TC behavior (Emanuel 2005a,b; Pielke 2005; Trenberth 2005; Webster et al. 2005) . The current consensus is that an anthropogenic signal in historical TC activity metrics cannot be conclusively identified independent of historically documented variability (Knutson et al. 2010 ).\nHowever, some in the public, media, and the insurance industry continue to point to human-caused climate change as a factor responsible for at least part of the observed increase in TC-related economic losses in recent decades (Gillis 2010; Mills 2005; Munich RE 2010) . This paper specifically focuses on a subset of the historical record of TCs with the most direct relevance to understanding economic losses: landfalling TCs of at least hurricane force. To date, the scientific literature contains no global homogenized dataset of TC landfalls assembled using a consistent methodology. This landfall dataset (printed in the supplementary online material and is permanently available at http://rogerpielkejr. blogspot.com) is important for understanding trends in TC-related economic losses and can aid in the quantitative determination of the relative contribution to losses by societal and climatic factors. Logically, with a trend in annual frequency of landfalls and/or intensity at landfall, one would expect to see a trend in economic losses after normalizing for societal change. However, absent a trend in landfall characteristics, there would be no reason to expect a residual climate-related trend in losses."}, {"section_title": "Data", "text": "A main obstacle in constructing a homogeneous global TC landfall dataset concerns the varying quality of the TC best-track historical records. Indeed, uncertainty in TC location and intensity data is a function of the evolving observation network throughout the past century, ranging from ship traffic, aerial reconnaissance, to satellite remote sensing. For instance, recent research has attempted to quantify potential missing North Atlantic tropical storms in the late nineteenth and early twentieth centuries (Landsea et al. 2010a; Vecchi and Knutson 2011) related to the ongoing Atlantic Hurricane Database Re-Analysis Project [North Atlantic hurricane database (HURDAT); Landsea et al. 2010b) . Also, issues related to the viewing angle of eye temperatures among different satellite platforms have spurred research into reevaluating TC intensity during the past several decades in the northern Indian Ocean Basin (Hoarau et al. 2012) . While objective satellite methodologies have been applied to global TC satellite data (Kossin et al. 2007 ), a meticulous human-based reanalysis of all global TCs during the last several decades remains an unrealized endeavor. Thus, it is important to acknowledge possible bias or errors in TC intensity and track information for each independent ocean basin prior to conducting long-period historical research.\nWe examine landfalls in five global TC-active development regions, including the North Atlantic (NATL), northeastern Pacific (EPAC), western North Pacific (WPAC), northern Indian Ocean (NIO), and the Southern Hemisphere (SH), using the most recent version of the International Best Track Archive for Climate Stewardship (IBTrACS v03r03; Knapp et al. 2010 ). This impressive resource compiles TC intensity and location data. It is important to note that this dataset is not a reanalysis and considerable uncertainties likely remain unresolved in the respective estimates of TC location and intensity.\nWe utilize the U.S. Department of Defense Joint Typhoon Warning Center (JTWC; Chu et al. 2002) best tracks gleaned from the IBTrACS for TC life cycle location and intensity estimates for the WPAC (1950 WPAC ( -2010 , NIO (1970 ), and SH (1970 for the periods chosen in parentheses. While the WPAC basin was observed through aircraft reconnaissance until 1987, routine satellite monitoring (Dvorak 1984) was also critical for intensity estimates, especially for the NIO and SH, and the periods chosen roughly correspond to the beginning of the satellite era. As the JTWC data are not complete and are less reliable prior to the mid-1980s in the SH and NIO, additional life cycle points are filled in from the Neumann (Neumann 1999) and National Center for Atmospheric Research (NCAR) dataset number ds824.1 (Neumann et al. 1993 ) portions of the IBTrACS full dataset. Especially in the NIO prior to 1980, some TCs are simply categorized as a tropical storm or hurricane with maximum sustained winds listed generically at 35 or 65 kt and are therefore likely biased low (NCAR ds824.1 notes on tropical cyclone data available at http://dss.ucar.edu/ datasets/ds824.1/docs/format_ascii.html; Hoarau et al. 2012) .\nThe U.S. National Hurricane Center (NHC) best-track dataset (Jarvinen et al. 1984 ) is used for the NATL and EPAC (1970 EPAC ( -2010 basins. While considerable reliable data are available in the NATL back to at least 1900 (Neumann et al. 1993) , as our focus is on assembling a homogeneous global dataset, we begin with 1944 coinciding with the start of routine aircraft reconnaissance and a focal point of the Atlantic Hurricane Re-Analysis Project (Hagen et al. 2012) . Northeast Pacific Ocean TC data are reliable since about the mid-1960s mainly due to routine satellite monitoring (NCAR ds824.1)."}, {"section_title": "Methods", "text": "Each individual TC life cycle in the best track is individually examined through complimentary computerautomated and manual detection techniques to compile a global homogeneous landfall dataset. We adopt the current NHC (NHC 2010) online glossary definition of a TC landfall as the intersection of the surface center with a coastline. In our final analysis, we do not include a relatively small number of TCs that have grazed coastal land yet still caused hurricane-force winds over land. These near-miss TC landfalls are responsible for only a small fraction of normalized economic losses and do not affect our overall conclusions.\nTo automate landfall detection, a straightforward binary decision process between land and sea requires a very high-resolution geographical resource. Here, we utilize an operational sea surface temperature product [Group for High Resolution Sea Surface Temperature Operational Sea Surface Temperature and Sea Ice Analysis (GHRSST OSTIA); Stark et al. 2007 ] as a land mask with 1 /208 global grid spacing (supplementary online material; JCLI-D-11-00719s1.rar; Figs. 1a,b). Coastlines and islands are very clearly demarcated at this spatial resolution. Since the IBTrACS best-track location points (latitude and longitude) are reported in increments of one-tenth degree, a one-quarter-degreesquare buffer is applied to allow for the expected uncertainty in reported TC locations at the 6-hourly intervals. We do exclude some small islands or chains of islands from our analysis. Land included in the study is found in Table 1 .\nWith each IBTrACS serial number from the softwareidentified landfall candidates, visual verification of landfall location and intensity is performed with an associated online TC graphics repository (available at http://storm5. atms.unca.edu/browse-ibtracs/browseIbtracs.php; for details on the visual verification and descriptive imagery, see the supplemental online material). As storms approach land, they tend to entrain dry air and their outer circulations may interact with mountainous terrain. To account for the effects of land-based weakening in categorizing TC landfall intensity, we also retrieve the 6-hourly observation time step immediately prior to the first on-land observation and use the highest value. If a TC makes multiple landfalls, then it is only counted once and categorized at the highest determined landfall intensity.\nEven with the above caveats, we still rely on the reported best-track locations that represent a contemporary real-time and/or postseason assessment. Furthermore, we discriminate between two groups of hurricane-force TCs at landfall: category 1 and 2 storms on the (NATL based) Saffir-Simpson scale (1-min maximum sustained winds of 64-95 kt) are described as minor hurricanes, and category 3-5 storms (wind exceeding 96 kt) are often referred to as major hurricanes. The exact intensity at the point of landfall is often unknowable because of an acknowledged undersampling of the atmospheric environment, yet we have confidence in the discrimination between minor and major landfalls. The term hurricane is used generically across all global basins to denote a TC with 1-min maximum sustained winds exceeding 64 kt."}, {"section_title": "Results", "text": "Overall, TC occurrence is a basin-dependent function of large-scale climate variability on interannual time scales (Gray 1984) as well as shorter-term fluctuations in atmospheric conditions favorable for the organization of convection (Emanuel 1989) . While considerable research has been conducted on TC climatology in each basin, the annual number of collective global landfalls has not been previously quantified. From the homogeneous dataset, it is apparent that the frequency of global hurricane landfalls is dominated by the WPAC, which is climatologically the most active basin (Maue 2011) , followed by the NATL. The typical steering flow in the EPAC does not favor tracks that would result in coastal landfalls in Mexico. Australia and Madagascar are the most commonly affected large landmasses in the SH. Conversely, the Bay of Bengal in the NIO experiences few landfalls, but the landfalls tend to cause extremely large social impacts (Fig. 1) .\nThe collective global frequency of all global hurricane landfalls and the minor and major subsets shows considerable interannual variability but no significant linear trend (Fig. 2) . Furthermore, when considering each basin individually during the entire time periods analyzed, it is not possible to ascertain a positive or negative trend in minor, major, or overall hurricane landfall frequency in all basins except the SH. In the SH a significant positive trend in major hurricane landfalls was detected; yet, the sample size is still small (Table 2 ). This result is not unexpected considering the known multidecadal signals in TC activity, which cannot be adequately resolved by our comparatively short historical record.\nThus, in the context of climate variability, it is important to recognize that certain shorter time periods during the past half-century may indeed show significant trends (upward and downward) in TC landfall activity on decadal time scales (e.g., Callaghan and Power 2011). The NATL basin has been in an active period since about 1995, which some have attributed to the positive phase of the Atlantic multidecadal oscillation (Goldenberg et al. 2001) . A linear trend analysis shows a significant upward trend in NATL activity (R 2 5 0.13; p 5 0.011) during the past several decades ; consideration of the longer period of 1944-2010 exhibits no secular trend in hurricane landfalls (and even longer periods show no increasing trend; see, e.g., Pielke 2009). Intense typhoon frequency has also been shown in the WPAC to be modulated by multidecadal variability (Chan 2008) on time scales of 16-32 years associated with the Pacific decadal oscillation (PDO) and variability of the El Niñ oSouthern Oscillation (ENSO), and no significant trend is found in hurricane landfalls during the period examined . Global and basin hurricane landfall annual frequencies of storms of major (red) and both major and minor (blue) hurricane intensity at landfall.\nThe conclusion of the NATL 2011 hurricane season sets a new record of days (greater than 2321 days) between major U.S. hurricane landfalls. The most recent major U.S. hurricane landfall was Hurricane Wilma in 2005. For calendar year 2011, according to available NHC and JTWC best-track and preliminary information, a total of 10 hurricane-force TCs made landfall with 3 at major strength (.96 kt), including Yasi (Australia), Nanmadol (Philippines, Taiwan), and Nalgae (Philippines). Elsewhere of note, Irene in the NATL was a weak hurricane when it struck North Carolina and Jova impacted southwestern Mexico in the EPAC. Characterized as a La Niñ a year, 2011 saw considerably fewer TC landfalls than, for instance, 1971, also a strong La Niñ a year with a record 32 global hurricane-frequency landfalls. On a global scale, future research may shed light on the uneven distribution of TC existence and the proportion that make landfall."}, {"section_title": "Conclusions", "text": "From currently available historical TC records, we constructed a long-period global hurricane landfall dataset using a consistent methodology. We have identified considerable interannual variability in the frequency of global hurricane landfalls; but within the resolution of the available data, our evidence does not support the presence of significant long-period global or individual basin linear trends for minor, major, or total hurricanes within the period(s) covered by the available quality data. Therefore, our long-period analysis does not support claims that increasing TC landfall frequency or landfall intensity has contributed to concomitantly increasing economic losses. Because of documented multidecadal variations in TC frequency and intensity on global and basin scales, our findings strongly support the usage of long-period historical landfall datasets for trend analysis (cf. Liebmann et al. 2010) .\nWhile there is continued uncertainty surrounding future changes in climate (Knutson et al. 2010) , current projections of TC frequency or intensity change may not yield an anthropogenic signal in economic loss data for many decades or even centuries (Crompton et al. 2011) . Thus, our quantitative analysis of global hurricane landfalls is consistent with previous research focused on normalized losses associated with hurricanes that have found no trends once data are properly adjusted for societal factors (e.g., Pielke et al. 2008; Crompton and McAneney 2008; Neumayer and Barthel 2011; Barthel and Neumayer 2012; Bouwer 2011; Raghavan and Rajesh 2003) . "}]