[{"section_title": "Abstract", "text": "Objective: Personality affects an individual's ability to cope with the burden of chronic disease. However, the impact of personality on quality of life (QoL) in Parkinson's disease (PD) is not well characterized. The goal of this study is to determine the effect of personality on QoL in PD. Methods: The study included 92 patients with idiopathic PD from Baltimore-Washington area movement disorder neurology clinics. QoL was assessed using the 37-item Parkinson's disease Quality of Life Questionnaire (PDQL) total score, and the Neuroticism-Extraversion-Openness Inventory was used to determine personality traits. Results:\nStep-wise regression models examined the contribution of personality, depression, demographic, and PD variables on PDQL-assessed QoL. Neuroticism, conscientiousness, years of education, and depression explained 42% of the variance in the PDQL total score after adjusting for other disease variables. High neuroticism (β = À0.727, 95% confidence interval (CI) À1.125, À0.328, p < 0.0001) and depression (β = À9.058, 95%CI À17.46, À0.657, p = 0.035) negatively affected the PDQL, while high conscientiousness (β = 0.468, 95%CI 0.078, 0.858, p = 0.019), and years of education (β = 1.441, 95% CI 0.371, 2.510, p = 0.009) were positive factors. Conclusions: Personality can have a positive or negative influence on QoL in PD. PD patients with otherwise similar disease burdens and depressive symptoms may experience different levels of QoL depending on the level of neurotic or conscientious personality traits. Therefore, when interpreting patient responses on the PDQL, it is important to understand whether they reflect aspects of PD, that is, motor impairment and depression, which are amenable to treatment or whether they reflect personality traits."}, {"section_title": "Introduction", "text": "Parkinson's disease (PD) is a progressive neurodegenerative disease diagnosed by the presence of bradykinesia, rigidity, tremor, and postural instability that can negatively impact quality of life (QoL) in those afflicted (Schrag et al., 2000) . Most studies have focused on how QoL is affected by disease characteristics such as the age of onset, the duration of disease, and the severity of motor and non-motor symptoms of PD (Marras et al., 2008; Schrag et al., 2000) . There has been growing recognition that QoL is also affected by the non-motor symptoms of PD such as cognitive impairment, anxiety, depression, and sleep disturbances (Barone et al., 2009) . In some cases, non-motor symptoms may have an even larger negative impact on QoL than the motor symptoms that define the disease (Skorvanek et al., 2015) . However, less has been performed to examine how more enduring factors such as personality may contribute to QoL in PD (DenOudsten et al., 2007; Soh et al., 2011) . Personality has been described using a variety of theoretical models in the literature; a popular model is the five-factor model, which operationalizes personality traits using the dimensions of neuroticism, extroversion, conscientiousness, openness to experience, and agreeableness (Costa et al., 1991) . Personality traits are thought to be largely fixed by early adulthood and represent a stable, characteristic pattern of temperament, attitudes, and behavioral responses unique to the individual. Various instruments, such as the Neuroticism-Extraversion-Openness Five-factor Inventory (NEO-FFI), are used to assess individual differences in these personality dimensions (McCrae and John, 1992) . For example, measures of \"neuroticism\" represent individual differences in the tendency to experience negative emotions such as anxiety, guilt, depressed mood, and anger and to worry in a way that is unhealthy or unreasonable (Costa et al., 1991) . \"Extroversion\" broadly is the degree of engagement with the external world, the tendency to seek stimulation through interaction with others, to have high energy, an assertive manner, and is marked by enthusiasm for interaction. \"Conscientiousness\" is often reflected in self-discipline, dutifulness, and a sense of obligation to conform or perform to a set standard. \"Openness to experience\" in lay terms is most closely akin to curiosity, having a sensitivity to and appreciation of beauty or art and willingness (rather than fear or reservation) to try new things. Finally, \"agreeableness\" is a measure of how much a person values cooperation with others, the degree to which one is willing to compromise, and at least indirectly may reflect the level of trust the individual has in social relationships. The five-factor model and the personality traits it represents try to explain individual differences in the way a person is likely to experience, cope with, and react to a given situation, disease, or life event. Therefore, while PD and other disease states are defined by a relatively fixed set of symptoms shared among those affected, the overall experience and reaction to the disease will be uniquely influenced by an individual's personality.\nPersonality has been studied extensively in PD, and several studies suggest that there may be a \"Parkinson's personality type\" (Bower et al., 2010; Damholdt et al., 2014; Koerts et al., 2013; Poletti and Bonuccelli, 2012) . Previous work suggests that certain profiles of personality traits are characteristic of PD and may be associated with neurotransmitter changes caused by the disease process or medications used to treat the disease (Menza et al., 1993) . Personality traits have been shown to influence perceptions of the overall impact of a disease on function and well-being (Lahey, 2009) . High neuroticism has been associated with an increased risk of depression in PD and non-PD populations (Damhold et al., 2011; Steunenberg et al., 2006) . Neuroticism, even in the absence of depression, has been shown to contribute to a lower perceived QoL in patients with several chronic diseases (Kempen et al., 1997) . Similarly the level of other personality traits like conscientiousness, which when high may positively influence the likelihood of taking medications accurately and reliably, high extroversion may increase the tendency to be social rather than isolative, and a high degree of openness to change and new ideas may impact how patients adjust to chronic disease and influence the level of QoL they report (Kempen et al., 1997) .\nQoL is recognized as an important \"patient-based\" outcome that helps assess the global impact of a disease and the efficacy of therapeutic interventions. There are a number of PD-specific QoL and health status measures that account for the unique motor and non-motor symptoms of PD as well as the overall impact of PD on function and the individual's own perception of physical, emotional, and social well-being (De Boer et al., 1996; Martinez-Martin et al., 2011) . The practice of medicine is moving toward a \"personalized\" treatment model, making assessment of QoL and unique, enduring patient factors such as personality traits potentially useful for determining individualized treatment plans and more precisely interpreting outcomes (Cornetta and Brown, 2013) .\nAlthough personality traits have been shown to contribute to QoL in many chronic diseases, this topic has not been widely investigated in PD. A systematic review of health-related QoL in PD in 2011 did not identify any studies that examined the impact of personality on QoL in PD (Soh et al., 2011) . Because that review was completed, three studies have looked at how personality contributes to QoL in PD (Dubayova et al., 2009a; Dubayova et al., 2009b; Gison et al., 2014) . All used different instruments, looked at different aspects of personality, and used different outcome measures but generally concluded that personality does impact QoL in PD. For instance, one study found that dispositional optimism predicted a satisfactory QoL, another looked at \"type D\" personality and ineffective coping, while the third found that neuroticism and extroversion had opposite effects on QoL in PD (Dubayova et al., 2009a; Dubayova et al., 2009b; Gison et al., 2014) . In the current study of relatively young-onset PD patients, we hypothesize that in addition to motor impairment and depression, high neuroticism will be associated with worse QoL in PD."}, {"section_title": "Methods", "text": "Patient data were obtained from a study of disability in 100 PD patients 65 years or younger. A younger PD population was desired to increase the likelihood of recruiting participants still in the workforce so that occupational disability could also be studied. A Johns Hopkins Medical Institute (JHMI) movement disorder neurologist confirmed the diagnosis of PD using the UK Brain Bank criteria (Hughes et al., 1992) . Participants were excluded if they were actively suicidal, had dementia, or were currently experiencing a severe psychiatric illness. Participants were assessed for demographic and disease-related variables using a semi-structured clinical interview. Participants were recruited from the JHMI movement disorders outpatient clinic, correspondence with community neurologists, local support groups, and community outreach programs. The Johns Hopkins University Institutional Review Board approved the study protocol. The research team obtained written consent from all participants at JHMI prior to participation in the study."}, {"section_title": "Measures", "text": "The main outcome for the study was QoL as assessed by the Parkinson's Disease Quality of Life Questionnaire (PDQL) (De Boer et al., 1996) . The PDQL consists of 37 questions on which participants rate how often in the last 3 months they had trouble with an activity (1 = all of the time, 2 = most of the time, 3 = some of the time, 4 = a little of the time, 5 = never) with higher scores reflecting better QoL. The PDQL has been \"recommended\" for use in PD by the Movement Disorders Society task force (Martinez-Martin et al., 2011) . The PDQL has four subscales: Parkinson symptoms, systemic symptoms, emotional function, and social function. Mean scores for each subscale and a total score were computed.\nParticipants completed the Neuroticism-Extraversion-Openness Five-factor Inventory (NEO-FFI) to assess personality (McCrae and John, 1992) . Ninetytwo out of the 100 participants completed NEO-FFI questionnaires. The NEO-FFI contains 60 statements that are divided into five factors: neuroticism, extraversion, openness, agreeableness, and conscientiousness. Participants rate each statement based on if they strongly disagree, disagree, neutral, agree, or strongly agree (Fahn and Elton, 1987) . Raw scores were computed into gender-corrected T-Scores for each factor. Normative scores for the NEO-FFI for this analysis were based on a validation study conducted in the Baltimore Longitudinal Study of Aging (McCrae R & Costa PT, 1996) . All patients were also assessed with the Unified Parkinson's Disease Rating Scale (UPDRS) part III to assess motor function while in the \"on-medication\" state. The UPDRS part III assesses motor symptom severity on a scale of 0-108, with higher scores indicating greater motor impairment (Fahn et al., 1987) . The Beck Depression Inventory (BDI) was used to assess the severity of depressive symptoms. The BDI is a 21-question self-report inventory of depressive symptoms with a score range of 0-63, a score of 9 or greater indicates the presence of depression with higher scores reflecting increasing severity (Beck et al., 1961) ."}, {"section_title": "Statistical analysis", "text": "Data were analyzed using Stata Statistical Software: Release 13, College Station, TX: StataCorp LP. Patient characteristics of the study population are presented using descriptive statistics [means (SD) or N (%)]. Multiple linear regression analyses were performed first with the PDQL total score and then with each of the PDQL subscores for the Parkinson symptoms, systemic symptoms, emotional function, and social function subscales as the outcome (dependent) variables. Outcomes were tested for normality. For the outcome variable PDQL, eight participants did not complete all of their responses, which along with case-wise deletions decreased sample size for analysis from 100 to 89 for PDQL total, social, emotional subscores, and 91 for the Parkinson and systemic subscores. In addition to the NEO-assessed personality traits, additional independent variables were identified from a systematic review as the most consistently found to predict QoL in PD (Soh et al., 2011) . Of the variables identified in the systematic review, gender, years of education, age at first PD symptom, duration of PD, BDI total score, and the UPDRS part III motor severity subscore were available and analyzed as part of this study. Because of skewed distributions, duration of PD was transformed into tertiles, BDI total into a binary variable for depression present/absent, and UPDRS part III motor severity into quartiles. As none of the final models had more than five variables, the risk of \"overfitting\" was controlled with a ratio of no less than 1:17 for the number of explanatory variables to sample size in any model. Assumptions for normality and homoscedasticity of residuals were checked. Multicollinearity was checked using variance inflation factors, all were less than 1.4 indicating the acceptable range of correlation between predictors in the regression model. Based on the a priori hypothesis stated in the introduction, the neuroticism trait was locked into the model as the first independent variable, and then the model was adjusted using forward stepwise regression (with α = 0.05) for the following variables in order: the remaining NEO personality traits, gender, years of education, age at first PD symptom, duration of PD, BDI total score, and the UPDRS part III motor severity subscore. This approach was repeated four times, once using each of the PDQL subscores as the dependent variable with the same set of predictors above. Table 1 shows the means, standard deviations, and ranges when appropriate for all demographic, clinical, QoL, and personality measures. As is typical for PD, the ratio of male to female participants was approximately 2:1 with 66% of the sample being men and 34% women. Because of targeted recruitment for the selection of PD patients likely to still be working, the average age of the sample, 54.6(7.82) years, is younger than the typical age of onset for PD of 62.5 years in western industrialized nations (Morens et al., 1996) . The majority of the sample was Hoehn and Yahr stage II (n = 83) with only a few being more advanced stage III (n = 6) or less affected stage I (n = 3). The mean score on the BDI was 7.29(6.03) indicating that on average participants scored in the non-depressed range (BDI = 0-9); however, using the suggested cutoff of BDI >9, about one-third (29 out of 100) of participants had at least some degree of depression. Table 2 shows results of the adjusted multiple regression analyses with the PDQL total score and subscales of the PDQL as the dependent variable. In the adjusted model, the main outcome PDQL total score was negatively influenced by high neuroticism and depression as assessed by the BDI, while high conscientiousness and more years of education had a positive effect on the PDQL total score. The magnitude of the BDI's influence was more than three times that of the other three variables combined. Table 2 also shows the adjusted regression for the PDQL subscales. All subscales of the PDQL, except systemic, were also negatively influenced by high neuroticism. The UPDRS part III total had a negative effect on the Parkinson and social subscales, while age of PD onset had a positive influence on these subscales. Years of education predicted higher scores on the Parkinson and systemic subscales. BDI total again had a relatively large negative influence, but only on the social subscale."}, {"section_title": "Results", "text": ""}, {"section_title": "Discussion", "text": "The data are consistent with our hypothesis that high levels of neuroticism are associated with a worse QoL The PDQL item scores range from 1 (all the time) to 5 (never) (17).\nas measured by the PDQL when correcting for relevant clinical variables. Four predictors, years of education, BDI total, NEO-assessed conscientiousness, and neuroticism, accounted for 42% of the variance in PDQL-assessed QoL. Education and higher scores on conscientiousness appeared to be protective, while depression (BDI total >9) and higher scores on neuroticism had a negative impact on QoL. Our finding is consistent with a previous study in which high levels of neuroticism, assessed using the Eysenck Personality Questionnaire, was identified as the second most important factor affecting QoL in PD (Dubayova et al.,2009b ). In our model, depression appeared to be disproportionately the most important factor affecting QoL in PD. High scores on neuroticism had a negative effect on all the PDQL subscales as well, although this was only a trend in the systemic subscale (p = 0.053). Neuroticism has been linked to lower QoL in other chronic diseases and has been shown to increase the risk of depression in PD, potentially worsening QoL both directly and indirectly (Lahey, 2009; Damholdt et al., 2011) . In our study, higher scores on conscientiousness appeared to improve QoL both on the PDQL total score and in the systemic and emotion subscales. The idea that personality traits can have either positive or negative effects on QoL is well established (Chapman et al., 2007; ) . For instance in PD, higher scores on extroversion were associated with better emotional well-being in men (Dubayova et al., 2009b) . Similarly, traits like high conscientiousness might lead to better medication compliance and diligence in complying with medically necessary followup.\nThe pattern of variables that affected QoL on the subscales included factors that have consistently been reported to be important determinants of QoL in recent systematic reviews in PD (Soh, 2011) . On the Parkinson subscale, motor symptom severity as assessed by the UPDRS part III total score had a large negative effect, which is consistent with many studies that show a progressive adverse impact on QoL related to motor impairment in PD (Carod-Artal et al., 2007; Marras, 2008; Soh, 2011) . Older age of onset of PD was also a predictor of QoL in the Parkinson and social subscales but appeared to be associated with higher QoL scores. When PD starts at an earlier age (i.e., before 50 years), patients are more likely to still be working, providing for families, and to have a wider range of activities that will be interrupted by disability and early retirement. Differences such as these between young-onset versus older-onset PD have been found to adversely impact QoL and are consistent with our finding that older age of onset seems to mitigate the impact of these socioeconomic factors on QoL (Schrag, 2000) . Finally, years of education had a positive effect on QoL on the PDQL total score, Parkinson, and systemic subscales. While the influence of education on QoL remains controversial, it is thought that at least part of the positive effect is due to an association with higher socioeconomic status and greater awareness of complex medical issues (Carod-Artal, Vargas, & Martinez-Martin., 2007; Cubo et al., 2002) .\nThere are a number of limitations to the study. Neuroticism and anxiety are often highly correlated, and the current study does not include an anxiety assessment scale. Therefore, we are unable to account for the potential impact of anxiety symptoms on neuroticism as assessed in this study. However, as most personality traits are relatively stable in adulthood and many anxiety disorders are chronic, we expect the effect to be relatively stable and thus still a reasonable assessment of neuroticism at the time of assessment. Most of the non-motor assessments are selfreport measures that were mailed out to participants, which resulted in missing data on these measures after accounting for case-wise deletion from our models. Despite this, the study is still likely to be adequately powered and not overfitted as none of the final models had more than five variables. Another limitation is that the study focused on non-demented PD cases under the age of 65 years with mild to moderate disease stage, the majority were Hoehn and Yahr stage 2 and may not generalize well to older or more advanced PD populations (Skorvanek et al., 2015; Valkovic et al., 2014) ."}, {"section_title": "Conclusion", "text": "In this study, we demonstrated that personality traits as measured by the NEO-FFI are important predictors of PDQL-determined QoL in PD. High scores on neuroticism predicted worse QoL in PD, while high conscientiousness appears to be protective and may be a marker for individuals who successfully cope with the challenges of the disease. When interpreting patient responses to the PDQL, it is important to understand whether they reflect aspects of PD, such as motor impairment or depression, which might be amenable to pharmacological treatment, or whether the responses are a reflection of personality, a more stable individual characteristic of the patient. Based on the findings of this study, individuals identified to have high neuroticism may require additional resources such as support groups, individual counseling, or more frequent clinic visits to assure they will experience a QoL comparable with their less-neurotic peers."}]