[{"section_title": "", "text": "Purpose: Hearing loss is associated with changes in brain volume in regions supporting auditory and cognitive processing. The purpose of this study was to determine whether there is a systematic association between hearing ability and brain volume in cross-sectional data from a large nonclinical cohort of middle-aged adults available from the UK Biobank Resource (http://www.ukbiobank.ac.uk).\nMethod: We performed a set of regression analyses to determine the association between speech reception threshold in noise (SRTn) and global brain volume as well as predefined regions of interest (ROIs) based on T1-weighted structural images, controlling for hearing-related comorbidities and cognition as well as demographic factors.\nIn a 2nd set of analyses, we additionally controlled for hearing aid (HA) use. We predicted statistically significant associations globally and in ROIs including auditory and cognitive processing regions, possibly modulated by HA use.\nResults: Whole-brain gray matter volume was significantly lower for individuals with poorer SRTn. Furthermore, the volume of 9 predicted ROIs including both auditory and cognitive processing regions was lower for individuals with poorer SRTn. The greatest percentage difference (−0.57%) in ROI volume relating to a 1 SD worsening of SRTn was found in the left superior temporal gyrus. HA use did not substantially modulate the pattern of association between brain volume and SRTn."}, {"section_title": "Conclusions:", "text": "In a large middle-aged nonclinical population, poorer hearing ability is associated with lower brain volume globally as well as in cortical and subcortical regions involved in auditory and cognitive processing, but there was no conclusive evidence that this effect is moderated by HA use. This pattern of results supports the notion that poor hearing leads to reduced volume in brain regions recruited during speech understanding under challenging conditions. These findings should be tested in future longitudinal, experimental studies. Supplemental Material: https://doi.org/10.23641/asha. 7949357 D ifferences in sensory input to the brain cause changes in its functional and structural organization (Merabet & Pascual-Leone, 2010) . It is well established that congenital deafness drives cross-modal plasticity in auditory processing regions (Cardin et al., 2013; Finney, Fine, & Dobkins, 2001; Nishimura et al., 1999) , and there is growing evidence that it influences the organization of cognition (Cardin et al., 2018; Ding et al., 2015 Ding et al., , 2016 . Recently, there has been growing interest in neural changes associated with acquired hearing loss (for reviews, see Cardin, 2016; Jayakody, Friedland, Martins, & Sohrabi, 2018) .\nA number of cross-sectional studies have found that acquired hearing loss is associated with smaller volume in the primary auditory cortex (PAC) in Heschl's gyrus (Eckert, Cute, Vaden, Kuchinsky, & Dubno, 2012; Peelle, Troiani, Grossman, & Wingfield, 2011) and supplementary auditory processing areas in the superior temporal gyrus (STG; Husain et al., 2011; Yang et al., 2014) . In the study by Eckert et al. (2012) , T1-weighted anatomical magnetic resonance (MR) images were obtained from 49 adults with a mean age of 70 years. Region of interest (ROI) analysis showed that participants with more high-frequency hearing loss had lower gray matter volume in the Te1.0 subregion of the PAC bilaterally accompanied by a greater volume of cerebrospinal fluid, whereas participants with more lowfrequency hearing loss had lower gray matter volume in the left Te1.2 subregion of the PAC. These associations survived correction for age and gender. The results were interpreted as suggesting that auditory cortex atrophies with hearing loss.\nThe Peelle et al. (2011) study also used T1-weighted anatomical MR images, this time from 25 adults with a mean age of 66 years. ROI analysis showed poorer hearing (higher pure-tone average threshold in the better ear across the frequencies 1, 2, and 4 kHz) and was significantly associated with lower gray matter volume in the right PAC (areas TE1.0 and TE1.1), and there was a similar but nonsignificant trend in the contralateral region. These findings, together with the functional results, were interpreted as evidence of age-related changes in hearing ability causing reduced gray matter in the auditory cortex. Husain et al. (2011) compared gray matter volume obtained from T1-weighted MR images in seven participants with hearing impairment (M age = 51 years) and 11 participants with normal hearing (M age = 48 years). Whole-brain analysis showed that the group with hearing impairment had lower gray matter volume in regions associated with cognitive control including the right anterior cingulate and the medial frontal gyrus bilaterally. ROI analysis showed that the group with hearing impairment had lower gray matter volume in the STG bilaterally than the group with normal hearing. The authors' interpretation was that hearing loss causes gray matter reduction in both auditory and higher cognitive processing regions. Yang et al. (2014) collected T1-weighted MR images from 14 individuals with right-sided unilateral hearing loss and 19 healthy controls, both groups with a mean age of 54 years. The participants with hearing loss compared to the controls had lower gray matter volume in a number of both auditory and cognitive processing regions including the posterior cingulate gyrus bilaterally as well as the precuneus, left superior/middle/inferior temporal gyrus, right parahippocampal gyrus, and lingual gyrus. The authors concluded that even unilateral hearing loss induces changes in brain morphology. Thus, generally, the literature demonstrates that acquired hearing loss is associated with smaller brain volume in both auditory and cognitive processing regions and suggests that hearing loss probably causes neural atrophy in these regions.\nHowever, one study, Boyen, Langers, de Kleine, and van Dijk's (2013) study, showed greater volume in the STG and middle temporal gyrus associated with hearing loss. Like the other cross-sectional studies reviewed here, this study was based on T1-weighted MR images. Specifically, they were collected from 31 participants with hearing impairment and tinnitus (M age = 56 years), 16 participants with hearing impairment but no tinnitus (M age = 63 years), and 24 participants with normal hearing (M age = 58 years). Whole-brain analysis showed that both groups with hearing impairment compared to controls had larger gray matter volume in the STG. The authors' interpretation of this finding was that brain volume increase associated with hearing impairment may be related to the role of the STG in semantic memory. In particular, they suggested that, because individuals with hearing impairment miss part of the speech signal, they may rely more heavily on semantic memory to maintain normal communication.\nThis explanation is in line with findings in the literature showing that cognitive training leads to increases in the volume of brain structures involved in cognitive processing (for a review, see Lövdén, Wenger, Mårtensson, Lindenberger, & Bäckman, 2013) . On the other hand, it directly contradicts the results of Husain et al. (2011) and Yang et al. (2014) that both showed that hearing impairment was associated with, and probably caused, lower volume in the STG. Thus, review of the literature shows hearing impairment is consistently associated with lower brain volume in the PAC and cognitive processing regions outside the STG, whereas there is controversy concerning whether hearing impairment is associated with higher or lower volume of the STG.\nHearing impairment is associated with aging (Roth, Hanebuth, & Probst, 2011) , and aging, like hearing impairment, is associated with functional and structural changes in regions of the brain supporting speech processing. Cross-sectional studies have identified structural differences related to aging including smaller gray matter volume in the STG and Heschl's gyrus in adults with a mean age of 70.5 years compared to those with a mean age of 29 years (Harris, Dubno, Keren, Ahlstrom, & Eckert, 2009) , smaller supratemporal cortex and ventral motor areas bilaterally in adults with a mean age of 68 years compared to those with a mean age of 26 years (Bilodeau-Mercure, Lortie, Sato, Guitton, & Tremblay, 2015) , and cortical thinning bilaterally in planum temporale, planum polare, STG, superior temporal sulcus, Heschl's gyrus, and Heschl's sulcus in adults with a mean age of 72 years compared to those with a mean age of 24 years (Giroud et al., 2018) . Agerelated functional differences include modulation of speech intelligibility effects in regions showing structural differences including STG and Heschl's gyrus (Harris et al., 2009) , sensorimotor cortex and left dorsal anterior insula (BilodeauMercure et al., 2015) , and left pars triangularis and left superior frontal gyrus (Wong, Ettlinger, Sheppard, Gunasekera, & Dhar, 2010) . Furthermore, an association between thicker auditory cortex in the right hemisphere and better auditory performance in the older group in the study by Giroud et al. (2018) , as well as more rightward intrinsic theta power lateralization, underlines the importance of the right auditory cortex for speech processing in older adults.\nThe association between hearing ability and cognition is well established in behavioral studies showing associations between speech recognition in noise and cognitive skills (Akeroyd, 2008; Besser, Koelewijn, Zekveld, Kramer, & Festen, 2013) as well as in experimental studies demonstrating the effect of cognitive load on speech processing under challenging conditions (Hunter & Pisoni, 2018; Obleser, Wöstmann, Hellbernd, Wilsch, & Maess, 2012; Zekveld, Kramer, Rönnberg, & Rudner, 2019 ). This association is described by the ease of language understanding model (Rönnberg, Holmer, & Rudner, 2019; Rönnberg et al., 2013) . Speech processing proceeds relatively effortlessly under optimal conditions (Mattys, Davis, Bradlow, & Scott, 2012) . However, when listening conditions are challenging, for example, in background noise and/or when the listener has a hearing impairment, explicit cognitive functions need to be recruited for successful speech understanding Rudner, Rönnberg, & Lunner, 2011) . Thus, listening under challenging conditions increases cognitive load (Zekveld, Rudner, Kramer, Lyzenga, & Rönnberg, 2014) and is perceived as effortful (Rudner, Lunner, Behrens, Thorén, & Rönnberg, 2012) .\nIn addition to auditory processing regions in the STG and language processing regions in the left inferior frontal gyrus and at the temporoparietal junction, speech understanding in noise engages prefrontal and superior parietal regions (Scott & McGettigan, 2013; Wong et al., 2009) supporting working memory, as well as the hippocampus (Zekveld, Rudner, Johnsrude, Heslenfeld, & Rönnberg, 2012) supporting long-term memory (LTM). Cerebral regions that are functionally involved in speech understanding in noise largely coincide with regions whose volume covaries with hearing ability. Because long-term changes in the functional recruitment of brain regions lead to long-term changes in structure (Merabet & Pascual-Leone, 2010) , it is likely that the long-term functional recruitment of brain regions by speech understanding under challenging conditions also leads to changes in their structure (Peelle & Wingfield, 2016) . These changes could reflect either negative effects due to disuse (cf. Rönnberg et al., 2013) or positive effects consonant with those of brain training (cf. Lövdén et al., 2013) and, in either direction, are likely to be greater for individuals with poorer hearing ability, for whom listening is even more challenging.\nThe most common treatment for hearing impairment is hearing aids (HAs), which amplify weak sounds, making them more audible. It seems reasonable to assume that this may lead to enhanced neural representation of speech and, consequently, preservation of neural integrity in the PAC and other auditory processing regions. Indeed, it has been shown that HA intervention leads to enhanced cortical (Karawani, Jenkins, & Anderson, 2018b) and subcortical (Jenkins, Fodor, Presacco, & Anderson, 2018; Karawani, Jenkins, & Anderson, 2018a) processing of speech. In everyday challenging conditions, HAs are not able to separate target speech from background noise. However, they can improve the speech-to-noise ratio when speech and noise are spatially separated by at least 45°, with the use of directional microphones. This means that HAs can, in some circumstances, ameliorate challenging listening conditions for listeners with hearing impairment. Indeed, there is evidence that HAs may reduce listening effort after a period of familiarization (Giroud, Lemke, Reich, Matthes, & Meyer, 2017; Rudner, Foo, Rönnberg, & Lunner, 2009 ) and improve working memory (Karawani et al., 2018b) . Changes in neural recruitment caused by HA use may, in the long term, result in changes in brain volume.\nUsing data from 126 individuals aged 56-86 years included in a neuroimaging substudy of the Baltimore Longitudinal Study of Aging, Lin et al. (2014) found no effect of hearing loss on brain volume at baseline measurement. However, decline in brain volume over time was greater globally and in the temporal lobes for the group with hearing impairment (n = 51) than the group without. Because of the small number of HA users (n = 13) in the study, Lin et al. were unable to study the effect of HA use.\nIn this study, we investigated the relationship between hearing ability and brain volume in a much larger set of data from a nonclinical cohort of middle-aged adults available from the UK Biobank Resource. The hearing measure in this data set is speech reception threshold in noise (SRTn) indexed by the Digit Triplets Test (DTT; Dawes, Fortnum, et al., 2014; Smits, Kapteyn, & Houtgast, 2004) . DTT scores and pure-tone average hearing thresholds are highly correlated (r = .77; Dillon, Beach, Seymour, Carter, & Golding, 2016) . We predicted that poorer SRTn would be associated with lower brain volume globally and in the PAC and cognitive processing regions outside the STG involved in the processing of speech in noise. We also predicted an association in the STG, although we did not specify its direction owing to contradictory results reported in the literature. We also expected that these predicted associations would be modulated by HA use."}, {"section_title": "Method", "text": "This study is based on cross-sectional data available from the UK Biobank Resource, a prospective study including lifestyle, physical, and cognitive measures for over 500,000 participants who were aged 40-69 years when they were recruited in 2006-2010 (Sudlow et al., 2015) , 100,000 of whom are being called back for MR scanning (Miller et al., 2016) ."}, {"section_title": "Participants", "text": "The participants in this study (N = 8,701, 52.6% female, 47.4% male) included the total number of participants in the UK Biobank for whom T1-weighted structural images and relevant variables were available. This approach means that there are no missing data in any of the analyses. Mean age at time of scanning was 62.3 years (SD = 7.4 years), and mean socioeconomic status was −1.97 (SD = 2.63) on the Townsend Deprivation Index (TDI; Townsend, Phillimore, & Beattie, 1988) . The TDI is based on the participant's postal code according to the national census preceding inclusion in the UK Biobank, and a higher score indicates lower socioeconomic status. According to the UK Data Service (http://www.ukdataservice.ac.uk), the overall population mean is 0 (SD = 3.44). All participants provided informed consent prior to testing, and other ethical procedures are described in Miller et al. (2016) for imaging and Sudlow et al. (2015) for behavioral measures."}, {"section_title": "T1 Data Acquisition", "text": "According to the UK Biobank Brain Imaging Documentation (Smith, Almagro, & Miller, 2017) , the T1 data were collected using a dedicated standard Siemens Skyra 3 T running VD13A SP4, with a standard Siemens 32-channel RF receive head coil. The field of view was automatically determined based on Siemens' autoalign software or failing that, set by the radiographer. The T1 structurals were acquired using straight sagittal orientation and a threedimensional MPRAGE sequence. T1 scanning lasted 5 min and was part of a longer series of scans lasting 35 min. Resolution is 1 × 1 × 1 mm, and field of view is a 208 × 256 × 256 matrix. Standard Siemens on-scanner conversion of complex multicoil data was carried out for the T1 data."}, {"section_title": "T1 Data Processing", "text": "T1 data processing took place as follows (Smith et al., 2017) . The full field of view was cut down to reduce the amount of non-brain tissue, and gradient distortion correction was applied in conjunction with a standard space T1 template. This was achieved using the brain extraction tool (Smith, 2002) and the linear image registration tool developed at the Oxford Centre for Functional MRI of the Brain (Jenkinson, Bannister, Brady, & Smith, 2002; Jenkinson & Smith, 2001) , in conjunction with the 1-mm resolution version of MNI152 \"nonlinear 6th generation\" standard space T1 template (http://www.bic.mni.mcgill.ca/ServicesAtlases/ ICBM152NLin6).\nThe data were then nonlinearly warped to MNI152 space. As Alfaro-Almagro et al. (2018) have pointed out, this is a critical processing step in the pipeline, and because T1 images in the UK Biobank had brighter internal carotid arteries than those in the MNI152 template, a custom reference brain mask was applied to exclude this part of the image when estimating the transformation. A standard space brain mask was then back-transformed into the space of the T1 and applied to the T1 image to generate a brainextracted T1. Next, tissue-type segmentation was applied to generate a fully bias-field corrected version of the brainextracted T1. The external surface of the skull was estimated from the T1 and was used to normalize brain tissue volumes for the head size. A total of 139 regional gray matter volumes were generated by summing the gray matter partial volume estimates within 139 ROIs defined in the MNI152 space using the Harvard-Oxford cortical and subcortical atlases (https://fsl.fmrib.ox.ac.uk/fsl/fslwiki/Atlases) and the Diedrichsen cerebellar atlas (http://www.diedrichsenlab.org/ imaging/propatlas.htm).\nSubcortical structures were modeled using the FMRIB's Integrated Registration and Segmentation Tool (FIRST). For more details, see Smith et al. (2017) . There are 15 such regions, and these are also shown in Supplemental Materials S1 and S2. It should be noted that the hippocampus is defined by both procedures, the difference being that the atlas-based procedure defines gray matter whereas the FIRST does not distinguish tissue type.\nOut of the total of 154 defined regions, we selected a subset of 48 as directly relevant to our predictions (see Supplemental Materials S1 and S2). Of these, 22 are defined as auditory processing regions and 26 as cognitive processing regions. However, it should be noted that several of these regions are large and may encompass a range of functions."}, {"section_title": "SRTn", "text": "The SRTn (Plomp, 1978 ) is a measure of the ability to recognize speech in noise. In this study, SRTn was determined on the basis of performance on the DTT (Dawes, Fortnum, et al., 2014; Smits et al., 2004) . The DTT data were collected in connection with the imaging visit and obtained under headphones using a self-administered program running on a computer with a touch screen. Before testing commenced, the participant was instructed to remove any HAs and to set a comfortable volume. Then, the participant listened to 15 sets of three digits presented in steady state speech-shaped background noise. The task was to enter each triplet into an onscreen keypad after the set of digits had been presented. If the triplet was entered correctly, the next set of digits was presented at a higher noise level; otherwise, the noise was lowered. For more details of the DTT and its development, see Smits et al. (2004) and Dawes, Fortnum, et al. (2014) . In this study, SRTn was defined as the signal-to-noise ratio (SNR; ranging between −12 and +8 dB) at which half of the presented digits could be recognized correctly in the better ear (ears were tested separately). The better ear largely determines auditory function in daily life and indicates occupational hearing loss for insurance purposes (Rönnberg, Hygge, Keidser, & Rudner, 2014) . When the DTT score was only available for one ear, we assumed that it was the better one.\nMean SRTn among the participants in this study was −6 dB, SD = 1.6 dB. A higher SRTn indicates poorer hearing, and normal hearing is considered to be represented by SRTn < −5.5 dB (Dawes, Fortnum, et al., 2014) . Thus, 61% of the participants in this study had an SRTn in the normal range."}, {"section_title": "Cognitive Ability", "text": "The cognitive abilities such as reasoning and memory that are engaged to achieve comprehension during listening under adverse conditions (Peelle & Wingfield, 2016 ) display a natural variation within the population. Furthermore, better speech recognition in noise is related to better cognitive ability, especially for individuals with hearing impairment (Akeroyd, 2008; Besser et al., 2013; Rudner et al., 2011) . Furthermore, hearing impairment is associated with an increased risk of incident dementia, that is, a pathological reduction in cognitive ability (Deal et al., 2017) , which, in turn, is related to reduced brain volume (Henneman et al., 2009 ). Thus, both SRTn and brain volume are likely to be related to cognitive ability, making it important to control for cognitive ability when investigating the association between SRTn and brain volume. The UK Biobank includes data from a test of verbal reasoning (VR), which taps into the cognitive functions that support speech processing under challenging conditions. We have previously shown an association between worse VR score and worse SRTn (Keidser, Rudner, Seeto, Hygge, & Rönnberg, 2016) .\nThe VR data were collected during a separate visit to a regional assessment center using a self-administered program running on a touch screen computer. VR was measured using 13 multiple-choice questions, of which as many as possible were to be answered in 2 min. Examples of questions are as follows: (a) \"Bud is to flower as child is to?\" with the answer to be selected from Grow, Develop, Improve, Adult, and Old; and (b) \"If sixty is more than half of seventy-five, multiply twenty-three by three. If not subtract 15 from eighty-five. Is the answer?\" with the answer to be selected from 68, 69, 70, 71, and 72, and with the additional options of \"Do not know\" and \"Prefer not to answer\" in both cases. These questions tap into semantic LTM and at the same time require logical reasoning. For more details, see Keidser et al. (2016) . The mean VR score of participants in this study was 6.9, SD = 2.1."}, {"section_title": "Vascular and Vision Problems", "text": "Poor hearing is associated with vascular and vision problems. Vascular problems are assumed to lead to poor hearing due to a reduced blood supply to the cochlea, which results in a disruption of the chemical balance of the inner ear that affects the electrical activity of the hair cells. The relation between vascular problems and poor hearing has been demonstrated in several epidemiological studies (e.g., Helzner et al., 2011; Liew et al., 2007; Torre, Cruickshanks, Klein, Klein, & Nondahl, 2005 ) and a neuroimaging study (Eckert et al., 2013) . In this study, 28.5% of participants had vascular problems indicated by self-report of having a diagnosis of at least one (ever) of heart attack, angina, stroke, or high blood pressure.\nOlder adults with poor hearing sometimes have poor vision too (Saunders & Echt, 2007) . For example, Jee et al. (2005) found that, among persons aged 65-99 years being evaluated for aged care services at a geriatric assessment center, west of Sydney, Australia, 22.5% had dual sensory problems. A study based on data from the UK Biobank, and thus tapping into the same population as this study, showed a prevalence of dual sensory impairment of 3% among adults aged 40-69 years (Dawes, Dickinson, et al., 2014) . In this study, with an older sample (M age = 62.3 years, SD = 7.4), 15% of the participants had vision problems indicated by at least one of the following self-reported conditions: diabetes-related eye disease, glaucoma, injury or trauma resulting in loss of vision, cataract, macular degeneration, or other serious eye conditions."}, {"section_title": "HA Use", "text": "HAs are one means of providing better audibility for individuals with poor hearing, and regular use may influence hearing-related brain plasticity (Giroud et al., 2017) . HAs also seem to influence the cognitive load associated with recognition of degraded speech Ng, Rudner, Lunner, & Rönnberg, 2015) , depending on the type of HA setting (Souza, Arehart, & Neher, 2015) and length of use . Data from the UK Biobank showed that prevalence of HA use was 2% among adults aged 40-69 years (Dawes, Fortnum, et al., 2014) .\nIn this study, with a sample drawn several years later from the same population, 6% of the participants reported that they used HAs most of the time. Surprisingly, 204 (41%) of the individuals who reported using HA most of the time produced an SRTn on their better ear within the normal range (SNR < −5.5 dB; Dawes, Fortnum, et al., 2014) . However, of those 204, with the worse ear, 42 met the criterion for poor hearing (SRTn > −3.5-dB SNR; Dawes, Fortnum, et al., 2014) , and a further 96 were in the intermediate range between poor and normal hearing, whereas nine more had SRTn for one ear only. Thus, the majority of HA users did have behavioral hearing difficulties in at least one ear, and some may have had hearing difficulties that were not apparent from the data available or have used HAs to alleviate tinnitus.\nModel Set 2 controlled for HA use, whereas Model Set 1 did not. Apparent differences between the models should be interpreted cautiously as only a small proportion of participants reported using HAs regularly, some of whom had SRTn on the better ear in the normal range. In summary, the analyses provide no conclusive evidence that HA use moderates the effect of SRTn on brain volume.\nHA use increases with age and socioeconomic status (Dawes, Fortnum, et al., 2014) . Both these factors are controlled for in our analyses. However, efficacy of hearing rehabilitation is also affected by, for example, type of HA, how long the HA has been worn relative to when the hearing loss was first detected, and whether HAs are fitted on one side or both; these data were not available from the UK Biobank and should be carefully controlled in future studies.\nHA use was significantly associated with smaller volume in one of the predicted regions, namely, the left thalamus. This region is extensive and multifunctional. It forms part of the subcortical auditory pathway but also plays a key role in cognition (Schmitt et al., 2017) . It has extensive feedforward and feedback connections with cognitive processing regions in the frontal cortex (Lee, 2015; Peelle et al., 2011) and regulates functional connectivity within and between cortical regions . Importantly, we found a significant effect of VR in this region in addition to significant effects of age and gender. Although we found no hearing-related volume reduction in this region in this study, such an association has been demonstrated in animal models (Basta, Tzschentke, & Ernst, 2005) , and Peelle et al. (2011) observed reduced neural activation during language processing relating to hearing loss. One interpretation of our findings is that HA use modulates the cognitive function of the thalamus during comprehension of degraded speech, leading to volume reduction. This should be investigated in further studies."}, {"section_title": "Statistical Analysis", "text": "The data were analyzed using two sets of regression models for the whole brain and each of the 154 predefined brain regions. In Model Sets 1 and 2, the dependent variable was the normalized volume (in mm 3 ) of one of the predefined brain regions, and the independent variables included age, age 2 , gender, TDI, VR, vascular problems, vision problems, and SRTn. In Model Set 1, these were the only independent variables (see Supplemental Materials S1 and S2). In Model Set 2, HA use was also entered as an independent variable (see Supplemental Materials S1 and S2). Two participants for whom HA use data was missing were excluded.\nExamination of intercorrelations among independent variables revealed the expected associations between SRTn and age (r = .26, p < .001) and between SRTn and HA use (r = .18, p < .001) as well as between age and HA use (r = .18, p < .001). There were also associations between age and vascular problems (r = .23, p < .001) and between age and vision problems (r = .25, p < .001). Furthermore, there was an association between vascular problems and gender (r = .13, p < .001) indicating that vascular problems were more prevalent in men than in women. None of the other intercorrelations had a coefficient exceeding .1.\nIn all models, gender, vascular and vision problems, and HA use were entered as dichotomous variables, whereas the remaining variables were continuous. Preliminary analyses conducted on the full set of data included squared terms for all independent variables as linearity was not assumed. The only squared term that significantly improved model fit across many regions was the age-squared term. Thus, the age-squared term was retained in the reported regression models, whereas the squared terms relating to the other variables were excluded to simplify the models.\nThere were 48 regions that we predicted would have an association with SRTn. With a significance level of .05, applying a Bonferroni correction for this set of regions would give a critical p value of .05/48 ≈ .001. However, it is well known that the Bonferroni correction is too conservative when there are a large number of nonindependent tests (e.g., Bland & Altman, 1995) , so its use is likely to , gender, Townsend Deprivation Index (TDI, which is a measure of socioeconomic status), verbal reasoning (VR), vascular problems, and vision problems. The volume decrease in mm 3 and % of mean volume are for 1-SD (1.6-dB) worsening of SRTn. Standardized effect size (SES) is the volume change expressed as a fraction of the standard deviation of the volume. Effects on these regions of the other independent variables are also shown. N = 8,699; UK B = UK Biobank; Vol. = volume; STG = superior temporal gyrus; L = left; R = right; Cx = cortex; ant. = anterior; post. = posterior. result in real effects being missed. For these 48 regions, to ensure that we had some protection against an increased false rejection rate due to multiple comparisons without being too conservative, we chose a critical p value of .01 as a compromise between the nominal value of 0.05 and the Bonferroni value of 0.001. For the other 106 regions, we used a critical p value of .001."}, {"section_title": "Results", "text": "Significant associations between SRTn and global and regional brain volume are shown in Tables 1 (Model Set 1) and 2 (Model Set 2)."}, {"section_title": "Whole Brain", "text": "According to Model Set 1, poorer SRTn was significantly associated with lower whole-brain gray matter volume (but not white matter volume; see Supplemental Materials S1 and S2). In particular, a worsening of SRTn by 1 SD, that is, an increase in SRTn of 1.6 dB, was associated with a predicted decrease of 1.1 cm 3 or 0.14% in whole-brain gray matter volume, if other predictor values are constant. This effect size can be compared to the mean difference of 1.2 cm 3 in annual rate of change in whole-brain volume between individuals with normal and impaired hearing reported by Lin et al. (2014) . However, when HA use was controlled for in Model Set 2, the association no longer reached significance, p = .0114, volume change = −1.0 cm 3 or 0.13%. We predicted an association between SRTn and brain volume in 48 regions. We found a significant association in nine of those regions with Model 1 (see Table 1 ) and in all but one (right insular cortex) of these nine regions in Model 2. All significant associations indicated that poorer SRTn was related to smaller regional brain volume. No significant associations were found in any of the other defined regions with either Model Sets 1 or 2.\nResults of this study showed that poorer SRTn was associated with lower gray (but not white) matter volume globally. Because gray matter consists largely of synaptically dense neuropil whereas white matter consists largely of myelinated axons, this finding suggests that the lower volume is due to fewer synapses rather than fewer axons. The size of the effect was comparable to the reported increment in annual rate of change in whole-brain volume associated with hearing impairment as measured with puretone thresholds (Lin et al., 2014) and apparent despite significant effects of age, gender, socioeconomic status, and vascular disorder. It did not change substantially when HA use was controlled for."}, {"section_title": "Auditory Processing Regions", "text": "In accordance with our prediction, Model Set 1 showed that greater SRTn (i.e., poorer hearing) was associated with smaller gray matter volume in auditory processing regions including the left STG within both anterior and posterior divisions (see Figure 1) as well as the right STG within the posterior division (see Table 1 ). The decrease in STG volume relating to 1-SD worsening of SRTn in the left anterior (10.89 mm ) can be compared to the difference in annual rate of decrease in right STG volume relating to hearing impairment reported by Lin et al. (2014) of 0.10 cm 3 or 100 mm 3 . When HA use was controlled for in Model Set 2, associations between SRTn and gray matter volume in these three regions all remained significant, and in addition, we found that HA use was associated with smaller gray matter volume in the left thalamus ( p = .0084, volume change = −42.41 mm 3 or 1.22% of mean volume 3,476 mm 3 ). Contrary to previous studies, we did not find any significant association between regional brain volume and SRTn in the PAC (Eckert et al., 2012; Peelle et al., 2011) or the subcortical auditory pathway (see Supplemental Materials S1 and S2).\nResults showed that poorer SRTn was associated with smaller gray matter volume in the STG comparable with the annual hearing-related reduction in STG volume reported by Lin et al. (2014) but of a lower order of magnitude in terms of volume difference compared to the effects of age. These results replicate the findings of Husain et al. (2011) and Yang et al. (2014) who showed that hearing impairment is associated with smaller STG volume and extends them to a nonclinical population in which speech perception in noise is linked with STG volume (cf. Giroud et al., 2018; Harris et al., 2009) . Conversely, it provides no support for results reported by Boyen et al. (2013) showing that hearing impairment was related to greater STG volume or for the notion that increased long-term engagement of semantic LTM due to poorer hearing (Boyen et al., 2013) leads to the enlargement of the underlying neural structure. Thus, the association between hearing ability and STG volume in this study suggests that poorer hearing ability in a nonclinical population is associated with smaller gray matter volume in the STG and that this decrement is not compensated by corresponding long-term engagement of semantic LTM. This notion should be tested in a longitudinal study. These findings are also partially in line with Eckert et al. (2012) who reported an association between highfrequency hearing loss and reduced gray matter volume in bilateral temporal lobe regions, predominantly in the left PAC, and Peelle et al. (2011) who reported that hearing loss was related to lower gray matter volume in the STG, albeit predominantly in the right hemisphere. However, while we found associations with SRTn in anterior and posterior portions of the left STG and the posterior portion of the right STG, we found no significant associations in the PAC (Heschl's gyrus). It should be noted here that both Eckert et al. (2012) and Peelle et al. investigated the association between frequency-specific audiometric thresholds and smaller more specific ROIs; neither of which was available to us in this study. Furthermore, they used more targeted methods focusing specifically on the PAC.\nSimilarly, we found no associations with SRTn in the subcortical portion of the auditory pathway. There were, however, significant effects of age on gray matter volume in all these regions and a significant effect of VR in the PAC. The effect of VR in the PAC is particularly interesting as this is the first cortical station along the auditory pathway and not specifically attuned to language and cognition Scott & McGettigan, 2013) . One interpretation of this finding is that individuals with better cognitive abilities make better use of the auditory signal, maintaining PAC volume. Such an interpretation implies that cognitive skills may counteract atrophy of the PAC driven by the degraded auditory input caused by poor hearing. This should be investigated in longitudinal, experimental studies."}, {"section_title": "Cognitive Processing Regions", "text": "We predicted that greater SRTn (poorer hearing) was related to lower brain volume in a number of regions known to be engaged during comprehension of degraded speech. In particular, we predicted lower brain volume in the frontal, superior parietal, and medial temporal regions.\nThe predicted cognitive processing regions included frontal, superior parietal, and medial temporal regions."}, {"section_title": "Frontal Regions", "text": "Lower gray matter volume in the right insular cortex, right middle frontal gyrus, left precentral gyrus, right frontal medial cortex, and left paracingulate gyrus was associated with poorer SRTn in Model Set 1. In Model Set 2 (controlling for HA use), the association between right insular cortex volume and SRTn was no longer significant, whereas the effects of age and gender remained significant.\nResults showed that poorer SRTn was associated with reduced gray matter volume in five frontal regions, namely, the right middle frontal gyrus, left precentral gyrus, right frontal medial cortex, left paracingulate gyrus, and right insular cortex. The middle frontal gyrus, frontal medial cortex, and precentral gyrus are associated with explicit working memory processing, which is engaged during speech processing under challenging conditions . Interestingly, both the paracingulate gyrus and the insular cortex are cingulo-opercular regions involved in performance monitoring that appear to optimize performance during challenging tasks (Eckert, Teubner-Rhodes, & Vaden, 2016) . Thus, decreased volume in these regions may be caused by reduced functional recruitment during comprehension of degraded speech, as a result of not only poor hearing as such but also poorer performance monitoring. In this study, findings of lower gray matter volume in areas of the prefrontal cortex associated with poorer ability to perceive speech in noise are in line with BilodeauMercure et al. (2015) and Wong et al. (2010) .\nWhen HA use was controlled for, the association between SRTn and the volume of the right insular cortex was no longer significant. Because the insular cortex is functionally associated with arousal, the modulation of the association with SRTn may indicate lowering of the high arousal levels associated with poor hearing through HA use (Kramer, Teunissen, & Zekveld, 2016) . This notion should be tested in a longitudinal, experimental study."}, {"section_title": "Superior Parietal Regions", "text": "There were no significant associations between SRTn and the volume of superior parietal regions.\nThe lack of association between SRTn and the volume of superior parietal regions implicated in speech recognition in noise (Scott & McGettigan, 2013; Zekveld et al., 2014) and working memory storage suggests that this is one region of the brain that does not atrophy as a result of poor hearing, despite its functional role in listening under challenging conditions."}, {"section_title": "Medial Temporal Region", "text": "Poorer SRTn was associated with lower regional brain volume in the right hippocampus with both models. There was no significant effect of SRTn in the left hippocampus, but it is worth noting that, here, the effect of vascular disorder was significant along with the effects of age and gender. This region was defined according to both extraction methods; a significant association was found in the right hemisphere region only with the FIRST extraction method, which does not distinguish tissue type. There was no significant association with SRTn in this region in either hemisphere defined according to the atlas-based extraction method that isolates gray matter. However, there were significant effects of age and gender on hippocampus gray matter volume bilaterally and a significant effect of vascular disorder in the left hemisphere. Importantly, there was an effect of VR on the hippocampus gray matter volume bilaterally such that poorer VR was associated with lower volume. Together, these findings suggest that the association with SRTn in the right hippocampus relates to white rather than gray matter. This is in contrast to the other regional associations and the whole-brain association with SRTn. The change in right hippocampal volume of 19.7 mm 3 per standard deviation SRTn with Model 1 can be compared to the difference in the annual rate of decrease in the right hippocampal volume of 0.01 cm 3 (10 mm 3 ) relating to hearing impairment reported by Lin et al. (2014;  see Figure 2 ).\nOther regions included in the medial temporal region are the anterior and posterior divisions of the parahippocampal gyrus. There was no significant association with SRTn in any of these regions, but all of them showed effects of age and gender; the left anterior region showed a significant effect of vascular disorder, whereas the right anterior and left posterior regions showed significant effects of VR.\nThe hippocampus underpins LTM encoding (Rolls, 2010) , and previous work has shown that its size is associated positively with cognitive abilities (Henneman et al., 2009; Maguire et al., 2000) and increases with training (Erickson et al., 2011) but is negatively associated with hearing thresholds (Lin et al., 2014) . Greater activation of the hippocampus is found during speech recognition in noise (Zekveld et al., 2012) . Furthermore, poor hearing is related to poorer episodic LTM despite HA use and to incident dementia (Deal et al., 2017) . The results of this study are well in line with these findings, showing that poorer SRTn is associated with lower regional brain volume in the right hippocampus even when HA use is corrected for. Furthermore, poorer VR was associated with lower gray matter volume in the hippocampus bilaterally and in the right parahippocampal gyrus bilaterally.\nThis pattern of findings supports previous evidence of a crucial role for the hippocampus in recognition of degraded speech. It is also in line with findings of a relation between smaller white matter association tracts, including the superior longitudinal fasciculus and uncinate fasciculus, and poorer hearing (Rigters et al., 2018) . Whereas the superior longitudinal fasciculus is known to be involved in cognitive control, the uncinate fasciculus is connected to the medial temporal region, and its volume has been shown to be positively related to memory performance (Wendelken et al., 2015) .\nWe propose that a bidirectional mechanism is likely to be in force. In one direction, mental agility keeps the episodic LTM encoding mechanism (supported by the hippocampus and other medial temporal structures) in trim, boosting hippocampal volume (Maguire et al., 2000) . In the other direction, poorer hearing leads to less activation of the episodic LTM mechanism during communication and consequent disuse , with reduced hippocampal volume and possibly also smaller association tracts as a consequence."}, {"section_title": "Discussion", "text": "This study is the first, to our knowledge, to show an association between smaller regional brain volume and functional hearing in a nonclinical cohort of middle-aged adults. Building on data from 8,701 participants in the UK Biobank, it shows that lower gray matter volume in both auditory processing regions in the temporal cortex and cognitive processing regions in the frontal cortex, as well as lower hippocampal volume, are associated with poorer ability to recognize speech in noise. This is an extension of previous experimental studies showing an association between brain volume and pure-tone thresholds in clinical populations (Boyen et al., 2013; Husain et al., 2011; Yang et al., 2014) and older adults with hearing loss (Eckert et al., 2012; Peelle et al., 2011) . This study also extends another recent population study (N = 2,562) that showed an association between white matter volume in association tracts and poorer hearing (Rigters et al., 2018) . In the study by Rigters et al. (2018) , a breakdown into older and younger age groups showed that white matter volume was associated with functional hearing (but not pure-tone thresholds) in the older segment of the sample (age range: 70-100 years) but that, in the younger segment of the sample, with an age range (51-69 years) more comparable to the middle-aged participants in this study, the opposite pattern was found, that is, an association between white matter volume and pure-tone thresholds (but not functional hearing). The lack of an association between functional hearing and regional brain volume in middle-aged adults in the study by Rigters et al. may be due to the substantially lower number of participants in the corresponding age group compared to this study."}, {"section_title": "Limitations", "text": "The great advantage of the current study is that it includes data from a large cohort, allowing us to include only participants for whom complete data sets were available. However, it also has a number of related limitations. In particular, the authors of this study had no control over many aspects of the design including the choice of cognitive and audiometric tests or preprocessing of the imaging data. As regards cognitive and audiometric testing, availability of standard tests of specific cognitive functions such as working memory and executive function as well as pure-tone audiometry would have allowed a more theoretically driven analysis of the imaging data. On the other hand, we believe that the VR task provides a good functional measure of everyday cognition in this study whereas the DTT provides a well-established measure of functional hearing ability, lending the results of our study good validity. ROIs were determined automatically based on established atlases in this study and were thus not designed to test hypotheses specific to the study. However, the automaticity of the preprocessing pipeline does ensure good reliability. Unfortunately, data on volume of cerebrospinal fluid within ROIs were not available to confirm the specificity of SRTn effects (cf. Eckert et al., 2012) .\nFurthermore, the information available about hearing rehabilitation was minimal. Participants reported current HA use most of the time, but there was no information on whether they used one or two aids or how long they had been using them. Also, among those who reported HA use, many performed well on the DTT, suggesting that their functional hearing ability was good. This makes it hard to interpret results relating to HA use."}, {"section_title": "Conclusions", "text": "We have extended the previous work by showing in a large nonclinical cohort of middle-aged adults that poorer SRTn-a measure of functional hearing-is related to lower gray matter volume in the whole brain and in predicted functional networks including the STG and frontal regions. SRTn is also related to reduced white matter volume in the hippocampus. This supports the previous work indicating that poor hearing leads to reduced volume in the PAC and suggests that a similar mechanism may apply to other auditory and cognitive regions recruited during speech understanding under challenging conditions. There was no conclusive evidence that HA moderates the effect of poor hearing on brain volume in the population studied. The findings of this study should be evaluated in future longitudinal, experimental studies."}]