[{"section_title": "", "text": ". Map "}, {"section_title": "The Effects of Management Practices on Grassland Birds-McCown's Longspur (Rhynchophanes mccownii)", "text": "By Jill A. Shaffer, 1 Lawrence D. Igl, 1 Douglas H. Johnson, 1 Marriah L. Sondreal, 1 Christopher M. Goldade, 1,2 Paul A. Rabie, 1,3 Travis L. Wooten, 1,4 and Betty R. Euliss 1 1 U.S. Geological Survey. 2 South Dakota Game, Fish and Parks (current). 3 Western Ecosystems Technology, Inc. (current). 4 San Diego Zoo Institute for Conservation Research (current)."}, {"section_title": "Capsule Statement", "text": "The key to McCown's Longspur (Rhynchophanes mccownii) management is providing short, sparsely vegetated native grasslands of adequate size. Mixed-grass prairies can be made suitable for breeding McCown's Longspurs by implementing moderate-to-heavy or season-long grazing. McCown's Longspurs have been reported to use habitats with 5-42 centimeters (cm) average vegetation height, 3-7 cm visual obstruction reading, 15-67 percent grass cover, less than (<) 8 percent forb cover, <7 percent shrub cover, 2-60 percent bare ground, 10-63 percent litter cover, and <5 cm litter depth. The descriptions of key vegetation characteristics are provided in table Y1 (after the \"References\" section). Vernacular and scientific names of plants and animals follow the Integrated Taxonomic Information System (https:// www.itis.gov/)."}, {"section_title": "Breeding Range", "text": "McCown's Longspurs breed from southern Alberta and southern Saskatchewan; south through Montana, eastern and central Wyoming, and north-central Colorado; and east to western Nebraska, western South Dakota, and southwestern North Dakota (National Geographic Society, 2011). The species also breeds in southeastern Alaska, northern British Columbia, and southwestern Yukon Territory. The relative densities of McCown's Longspurs in the United States and southern Canada, based on North American Breeding Bird Survey (BBS) data (Sauer and others, 2014), are shown in figure Y1 (not all geographic places mentioned in report are shown on figure)."}, {"section_title": "Suitable Habitat", "text": "McCown's Longspurs use grasslands with sparse litter (Felske, 1971) and low vegetation cover (DuBois, 1935;Creighton, 1974), conditions that are provided by shortgrass prairies or heavily grazed mixed-grass prairies (Saunders, 1914;Finzel, 1964;Maher, 1973Maher, , 1974Creighton, 1974;Oberholser, 1974;Porter and Ryder, 1974;Stewart, 1975;Prescott and Wagner, 1996;McLachlan, 2007;With, 2010;Lipsey, 2015). In southern Saskatchewan, McCown's Longspurs were found in equal abundance in tame and native pastures (Davis and others, 1997). Cultivated lands also may be utilized, including small-grain stubble fields, minimumand conventional-tilled cropland, and summer fallow fields (Felske, 1971;Stewart, 1975;Martin and Forsyth, 2003;McLachlan, 2007), although, historically, agricultural lands were avoided (DuBois, 1935;Mickey, 1943). In a regionwide study encompassing Colorado and Nebraska, McCown's Longspurs were significantly more abundant in shortgrass prairies than in dryland agricultural fields, and the species was not observed in Conservation Reserve Program grasslands (McLachlan, 2007). McCown's Longspur occurrence is affected by vegetation structure. In south-central Alberta, early-season abundance of nesting McCown's Longspurs in cropland fields was positively correlated with percentage of bare ground and stubble count (total number of cut plant stems) and negatively correlated with vegetation height (Martin and Forsyth, 2003). In mixed-grass prairies in southwestern Saskatchewan, McCown's Longspur occurrence was negatively related to litter and grass coverage (White, 2009). Within those same Saskatchewan mixed-grass prairies, Bleho (2009) evaluated the relationship between McCown's Longspur abundance and vegetation structure at the plot and pasture levels; plots were circular areas of 100-meter (m) radii located within pastures that were grazed season-long (June to October) at moderate grazing intensity (about 43 percent utilization). Two measures of vegetation patchiness (that is, heterogeneity)-standard deviation (SD) and coefficient of variation (CV)-were evaluated. At the plot level, McCown's Longspur abundance was   2014 (Giezentanner, 1970a(Giezentanner, , 1970bFelske, 1971;Creighton, 1974). Blue grama (Bouteloua gracilis) and buffalograss (Bouteloua dactyloides) are dominant plants in nesting areas (DuBois, 1935;Cassel, 1952;Creighton, 1974). McCown's Longspur nests tend to be oriented to the north (With and Webb, 1993), and about one-third to one-half of nests are placed near clumps of grass, shrubs, plains pricklypear (Opuntia polyacantha), or cow dung (DuBois, 1935;Mickey, 1943;Greer, 1988;With and Webb, 1993;With, 1994). However, shrubs and pricklypear near the nest may facilitate depredation by providing protective cover to predators; in north-central Colorado, nests placed beside shrubs were 2-3 times more likely to be depredated than nests associated with other types of vegetation (With, 1994). Nests depredated during incubation had six times more shrub cover within 1 m of the nest than did successful nests. Nests were fully exposed to solar radiation at midday and had 45 percent total exposure per day (With and Webb, 1993). High exposure to solar radiation may ameliorate cold stress associated with an early breeding season. Nests constructed later in the season were more likely to be constructed near vegetative cover than those constructed earlier in the season. In southeastern Wyoming, preferential placement of territories on areas with a high percentage of bare ground was attributed to microclimate effects such as early warming and drying of nest sites (Greer, 1988). Percentage of vegetation cover within 5 cm of the ground was higher in occupied territories than in unoccupied territories (Greer, 1988;Greer and Anderson, 1989). Occupied territories also had fewer piles of cow dung, less lichen, and lower forb coverage than unoccupied areas. Seasonal moisture levels may affect the occurrence of McCown's Longspurs. In an assessment of BBS data for the conterminous United States, O'Connor and others (1999) reported a negative relationship between McCown's Longspur abundance and mean annual precipitation. In the shortgrass steppes of Colorado, Conrey and others (2016) examined the influence of heat, drought, and precipitation on the likelihood of bird species fledging at least one young. McCown's Longspur was included with Horned Lark (Eremophila alpestris) in the guild of species nesting in the shortest vegetation. The authors concluded that the likelihood for a nest surviving to fledge at least one young was reduced under conditions of drought (periods when at least 10 consecutive days had passed with less than or equal to 1 millimeter [mm] total rainfall), high summer temperatures (greater than or equal to 35 degrees Celsius [°C]), and storm events (days with rain events greater than or equal to 10 mm). Scenarios in which summer temperature increased by 3 °C and seasonal precipitation decreased by 2 additional dry days caused nest success to be halved compared to its current average value. Lipsey (2015) suggested that low-productivity grasslands (that is, those with <1,121 kilograms [kg] per hectare [ha] normal year biomass production) may act as refugia in wet years for species, such as for McCown's Longspur, that require sparse vegetation."}, {"section_title": "Area Requirements and Landscape Associations", "text": "Territory size of McCown's Longspurs varies by region. Reported territory sizes were 0.5-1 ha in Saskatchewan (Felske, 1971), 0.6 ha in southeastern Wyoming (Greer, 1988;Greer and Anderson, 1989), and 1-1.5 ha in central Colorado (Wiens, , 1971With, 2010). In southeastern Wyoming, an increase in density of breeding pairs between years did not cause territory size to decrease (Greer, 1988), suggesting that the habitat was not saturated the first year. Pairs often nest near each other (Mickey, 1943;Felske, 1971;Golding and Dreitz, 2017). For McCown's Longspur, no studies have investigated a relationship between patch size and nest success or patch size and rate of brood parasitism by Brown-headed Cowbirds (Molothrus ater). McCown's Longspurs may be affected by the composition of the surrounding landscape. In the dry mixed-grass prairie region and northern fescue grassland region in southeastern Alberta, McCown's Longspur occurrence was negatively related to the percentage of surface water (that is, wetlands, riparian areas, and other watercourses) within a 400-m radius of point-count center (Clements, 2014). "}, {"section_title": "Brood Parasitism by Cowbirds and other Species", "text": "The status of McCown's Longspur as a host of the Brown-headed Cowbird is not well known (Friedmann, 1963;Maher, 1973). Few records of cowbird brood parasitism have been reported for the McCown's Longspur (Shaffer and others, 2019)."}, {"section_title": "Breeding-Season Phenology and Site Fidelity", "text": "The McCown's Longspur breeding season begins about mid-March (Mickey, 1943;Giezentanner and Ryder, 1969;Felske, 1971;Creighton, 1974;Salt and Salt, 1976;Greer, 1988;With, 2010). McCown's Longspurs exhibit low site fidelity (With, 2010). Second broods were reported in Montana, southeastern Wyoming, and north-central Colorado (DuBois, 1935;Strong, 1971;Greer, 1988). Second broods may be initiated as soon as 3 weeks after fledging of the initial brood but may be limited by female energy reserves (Felske, 1971;With, 2010). McCown's Longspurs depart the breeding grounds between October and mid-November (Mickey, 1943;Giezentanner and Ryder, 1969;Felske, 1971;Creighton, 1974;Salt and Salt, 1976;Johnsgard, 1980;Greer, 1988;With, 2010)."}, {"section_title": "Species' Response to Management", "text": "Little is known about the short-or long-term effects of prescribed burning of grassland habitat on McCown's Longspur populations. Some authors have suggested that prairie fire suppression has contributed to the population decline of the species (Krause, 1968;Oberholser, 1974;With, 2010). White (2009) examined the effect of burning and grazing on the abundance of McCown's Longspurs in Saskatchewan mixedgrass prairies; abundance was not influenced by the management treatments. Richardson (2012), who continued the work of White (2009), also reported no consistent influence of burning on the abundance of McCown's Longspurs, perhaps owing to low sample sizes, but determined that McCown's Longspurs were most abundant in grazed plots and showed a preference for heavily disturbed sites over ungrazed-unburned sites (see also Richardson and others, 2014). In a study evaluating patch-burn management (that is, applying prescribed burns in a spatially and temporally variable mosaic and allowing large herbivores to select among burned and unburned patches in the landscape) in shortgrass steppe in Colorado, McCown's Longspur abundance was unaffected by recent (2-, 3-, and 4-year-old) burns, although the authors predicted that the species would increase in response to patch burning (Augustine and Derner, 2015). In areas where grass is too tall or too thick for McCown's Longspurs, grazing can improve habitat by providing shorter, sparser vegetation (Giezentanner, 1970a;Stewart, 1975;Kantrud and Kologiski, 1982;Bock and others, 1993;Bleho, 2009). Heavily grazed areas with aridic boroll soils and moderately grazed areas with aridic ustoll soils appeared to be ideal nesting habitat in portions of Montana, North Dakota, Wyoming, Colorado, and Nebraska (Kantrud and Kologiski, 1982). In Alberta, McCown's Longspurs preferred season-long grazed native pastures and were fairly common in native pastures grazed in early summer (Prescott and others, 1993;Prescott and Wagner, 1996). McCown's Longspurs infrequently occupied spring-grazed (late April to mid-June) pastures of crested wheatgrass (Agropyron cristatum), and they avoided deferredgrazed (grazed after July 15) native pastures. In north-central Alberta, McCown's Longspurs used moderately to heavily grazed grasslands on drier, sandier sites than those used by Chestnut-collared Longspurs (Calcarius ornatus) (Wershler and others, 1991). McCown's Longspurs nesting in Alberta and Saskatchewan favored season-long grazed native pastures over areas managed with complementary grazing (early-season grazing on crested wheatgrass with cattle rotated through several native-grassland paddocks for the remainder of the summer) (Dale and McKeating, 1996). McCown's Longspurs did not breed on idle mixed-grass pastures in Saskatchewan and preferred heavily grazed pastures over lightly or moderately grazed pastures (Felske, 1971). Bleho (2009), Sliwinski (2011), and Richardson (2012) also evaluated McCown's Longspur use of Saskatchewan native pastures. Bleho (2009) reported that McCown's Longspurs were more than seven times more abundant in grazed mixed-grass pastures than in ungrazed pastures. Sliwinski (2011) reported that McCown's Longspurs preferred mixed-grass prairies that were heavily grazed by American bison (Bison bison). In northeastern Montana, McCown's Longspur preferred low-productivity grasslands with poor soils and occurred more frequently in low-productivity grasslands than expected based on habitat area (Lipsey, 2015). Lipsey (2015) indicated that grazing intensity did not measurably affect abundance of McCown's Longspur, which may reflect that this species was seldom observed during the study. In central Montana grasslands dominated by Wyoming big sagebrush (Artemisia tridentata species [spp.] wyomingensis) and intermixed with western wheatgrass (Pascopyrum smithii), needle and thread (Hesperostipa comata), blue grama, and junegrass (Koeleria macrantha), Golding and Dreitz (2017) reported that McCown's Longspurs were more than twice as abundant (33-36 birds per 25 ha compared to 13-14 birds per 25 ha, respectively) in areas with rest-rotation grazing (that is, alternating 2-3-month grazing periods, followed by 15-18 months of rest) than in areas with season-long grazing (that is, continuous grazing during growing season). In Colorado shortgrass prairies, summer-grazed areas were preferred over winter-grazed areas (Giezentanner and Ryder, 1969;Giezentanner, 1970aGiezentanner, , 1970b. Overgrazing may be detrimental to grasslands (Oberholser, 1974), particularly in arid, sparse shortgrass prairies (Ryder, 1980). Use of cultivated lands has included small-grain stubble fields, minimum-and conventional-tilled land, and summer fallow fields (Felske, 1971;Stewart, 1975;Martin and Forsyth, 2003). In Alberta and Saskatchewan, McCown's Longspurs were more abundant in cropland than in Permanent Cover Program grasslands (McMaster and Davis, 1998). In Alberta cropland, productivity scores (an index of reproductive behavior) were very low in winter wheat (Triticum spp.) fields (Martin and Forsyth, 2003). In 1 of 2 years, McCown's Longspurs were more productive in minimum-tilled than in conventional-tilled summer fallow fields. In both years combined, productivity was higher and abandoned territories were fewer in minimum-tilled than in conventional-tilled small-grain fields, whereas abandoned territories were greater in minimum-tilled than in conventional-tilled summer fallow fields (Martin and Forsyth, 2003). In recent years, several studies have evaluated the use of reproductive indices, such as the one used by Martin and Forsyth (2003), as an alternative to nest searching and monitoring of grassland birds and suggested that reproductive indices often lack the ability to predict nest fate or to provide reliable estimates of reproductive performance at the territory or plot level (Rivers and others, 2003;Althoff and others, 2009;Morgan and others, 2010). The results related to productivity reported by Martin and Forsyth (2003) should be evaluated within the context and caveats of the growing body of literature on this topic. Some pesticides may have deleterious effects on McCown's Longspurs. At the Pawnee National Grassland in Colorado, malathion and toxaphene were applied at rates of 0.6 and 1.1 kg per ha, respectively (McEwen and Ells, 1975). Densities of McCown's Longspurs were higher in grasslands treated with malathion or toxaphene than in untreated grasslands; however, nestlings were killed by toxaphene. McCown's Longspur abundance and productivity may be lower near energy-generating infrastructure. In southwestern Saskatchewan, abundance of McCown's Longspurs increased with distance from gas wells, with higher abundances occurring beyond 600 m from wells (Kalyn Bogard, 2011;Kalyn Bogard and Davis, 2014). However, abundance was greater in legal sections (259 ha) with at least one gas well relative to legal sections without wells. In Alberta, Linnen (2008) reported that McCown's Longspur abundance decreased near oil wells and access roads, and the species exhibited an avoidance of areas within 300 m of oil development, although not significantly so. In Wyoming, Mahoney and Chalfoun (2016) evaluated the effect of wind facilities on McCown's Longspur reproductive success. Measures of reproductive success, including clutch size, number of fledglings, size-adjusted nestling mass, and daily nest survival, did not differ between undeveloped reference sites and wind-facility sites. Nest-survival rates were negatively related to turbine density within 1 kilometer of nests, vegetation density at 10-20 cm height, and grassland area within the neighborhood of a nest. Nest survival decreased with increasing vegetation density when considered together with turbine density and the amount of grassland habitat in the neighborhood of the nest. Habitat and distance to infrastructure did not explain clutch size, number of fledglings, or size-adjusted nestling mass (Mahoney and Chalfoun, 2016). Beston and others (2016) developed a prioritization system to identify avian species most likely to experience population declines in the United States from wind facilities based on the species' current conservation status and the species' expected risk from wind turbines. At a score of 4.29, the McCown's Longspur was among 40 species (of 428 species evaluated) with an average priority score of at least a four or above out of nine. Beston and others (2016) estimated that 7.02 percent of the McCown's Longspur breeding population in the United States is exposed to wind facilities."}, {"section_title": "Management Recommendations from the Literature", "text": "Providing grassland areas of adequate size may help to support multiple McCown's Longspur territories, as pairs often nest near each other (Mickey, 1943;Felske, 1971;Greer, 1988;Greer and Anderson, 1989;With, 2010). McCown's Longspur habitat should be protected from agricultural and urban development (Oberholser, 1974;McLachlan, 2007;With, 2010). Areas with little litter and short, sparse vegetation with low coverage of forbs are important for McCown's Longspurs (DuBois, 1935;Felske, 1971;Maher, 1973Maher, , 1974Stewart, 1975;McLachlan, 2007;With, 2010). Prescribed prairie burns have been recommended for areas where fires occurred historically but now have been suppressed (Krause, 1968;Oberholser, 1974;With, 1994;Richardson, 2012). Vegetation that is already sparse and short from grazing, especially in areas of low precipitation, should not be overgrazed (Oberholser, 1974;Ryder, 1980). Grasslands with vegetation that is too tall or dense for nesting by McCown's Longspurs may be grazed to encourage longspur use (Giezentanner, 1970a(Giezentanner, , 1970bFelske, 1971;Stewart, 1975;Kantrud and Kologiski, 1982;Bleho, 2009;Richardson, 2012;Richardson and others, 2014). Based on findings by Kalyn Bogard and Davis (2014) in grazed mixed-grass prairies in which the effects of natural gas well proximity and density on grassland songbird abundance varied strongly among species and between regions, the authors recommended timely cattle rotation, fencing off of The Effects of Management Practices on Grassland Birds-McCown's Longspur (Rhynchophanes mccownii) gas wells, and allowing adequate resting periods for vegetative regrowth as possible management actions to reduce interactive effects of natural gas development, livestock grazing, and concomitant changes in vegetation structure. Kalyn Bogard and Davis (2014) further recommended that clear management objectives be tailored to the habitat requirements of individual species, as actions taken for one species might have a deleterious effect on another species. In sagebrush ecosystems, Golding and Dreitz (2017) indicated that although a single grazing system (such as rest-rotation grazing) can be used to increase the abundance of an individual songbird species such as the McCown's Longspur, a mosaic of numerous grazing systems might better maintain ecological functions and the abundance and distribution of the entire songbird community."}]