[{"section_title": "Abstract", "text": "The study estimates a logit model to identify factors influencing adoption of agritourism by small farmers in North Carolina using a survey. All variables included in the model were dummies and of these having at least a college education has the greatest impact on participating in agritourism, followed by race, public access to the farm for recreation, farms with more than 50 acres of land deemed unsuitable for crop production, and the total amount of land owned. Other factors such as farms near cities, willingness to pay for farm management advice, and before-tax household income also significantly influenced the adoption of this enterprise."}, {"section_title": "INTRODUCTION", "text": "Agritourism has received a lot of attention in recent years both among researchers and also state policy makers. According to the U.S. Travel Association, travel and tourism is a $947 billion industry in the United States that has directly generated more than 8.1 million jobs. Travel and tourism generates $147.9 billion in tax revenue for federal, state, and local governments, with the restaurant industry accounting for the majority of economic activity. An increasing popular and growing opportunity for agricultural producers is agritourism (Agricultural Marketing Resource Center, 2016) . Research has been conducted to identify farm and farm operator characteristics that are associated with the adoption of agritourism, a term which has been used to describe activities ranging from U-pick activities, field rides, cultural or historic exhibits, festivals, paid or customized hunting tours to wildlife observations and holiday-related activities. Bagi and Reeder (2012) hypothesized that if successful, such activities might be beneficial to the agricultural economy and have positive environmental and health-related objectives. They further observed and noted that among those who might benefit, most are low-income, undereducated, and older farmers, as well as small family farms. The purpose of this paper is to determine the extent to which some of these findings Although many do not realize it, agritourism has a long history in the United States. Holland and Wolfe (2000) provide a historical narrative of agritourism in the United States. Agritainment (agritourism and entertainment farming enterprises) dates back to the 1800s, when families would visit their relatives in the country to escape from the city's summer heat. The advent of the automobile in the 1920s and the stresses of the Great Depression of the 1930s and 40\"s generated renewed interest in rural/farm recreation. These demands for rural recreation continued through the 1970s into the 1990s as manifest by the popularity of horseback riding, farm petting zoos, farm vacations, bed and breakfasts, and commercial farm tours during those decades (Holland and Wolfe, 2000) .\nAgritourism has been defined and labeled in various ways in the literature. Philips et al. (2010) provide a typology of definitions of Agritourism. The term agritourism has often been used interchangeably with agrotourism, farm tourism, farm-based tourism, and rural tourism (McGehee and Kim, 2004; Clarke, 1999; Ilbery and Bowler, 1998; Roberts and Hall, 2001 ; Barbieri and Mshenga, 2008) . Agritourism may be defined as \"rural enterprises which incorporate both a working farm environment and a commercial tourism component\" (Weaver and Fennel, 1997; McGehee et al., 2007) . Barbieri and Mshenga (2008) referred to agritourism as \"any practice developed on a working farm with the purpose of attracting visitors.\"\nExamples of agritourism may include farm stays, bed and breakfasts, pick-your-own produce, agricultural festivals, and farm tours for children, or hay rides (Clarke, 1999; McGehee et al., 2007) . Farm/ranch recreation refers to activities conducted on private agricultural lands, which might include fee-hunting and fishing, overnight stays, educational activities, etc. This category of tourism is a subset of a larger industry known as agritourism. Agritourism in turn is a subset of a larger industry called rural tourism that includes resorts, off-site farmers' markets, non-profit agricultural tours, and other leisure and hospitality businesses that attract visitors to the countryside. Rural Tourism differs from agritourism in two ways. First, rural tourism enterprises do not necessarily occur on a farm or ranch, or at an agricultural plant, and secondly, they do not generate supplemental income for the agricultural enterprise. Agritourism and naturetourism enterprises might include outdoor recreation (fishing, hunting, wildlife study, horseback riding), educational experiences (cannery tours, cooking classes, or wine tasting), entertainment (harvest festivals or barn dances), hospitality services (farm stays, guided tours or outfitter services) and on-farm direct sales (u-pick operations or roadside stands).\nFarm enterprise diversification has become a strategy for small farms to remain viable especially in the face of Yeboah et al. 85 high risks facing modern day farming. McGehee et al. (2007) have identified agritourism as a form of enterprise diversification. Ilbery and Bowler (1998) describe seven pathways to agricultural diversification, of which on-farm recreational activities are one survival strategy for farm businesses. Incorporating agritourism as an alternative enterprise has the potential to contribute to agricultural sustainability, broaden farmers' economic base, provide educational opportunities to tourists, and engender a strong communal cohesion (Ilbery and Bowler, 1998) . Beus (2008) describes agritourism as a possible strategy for many U.S. farmers to expand their incomes and stay in business. This practice, referred to as the \"cultivation of tourists on the farm in addition to crops\" is already well established in countries like Switzerland, Italy, New Zealand and other European countries.\nAs pressure increases on farmers to diversify their enterprises in order to remain competitive, agritourism has emerged as one viable alternative. In an exploratory study of agritourism development in Nova Scotia, Colton and Bissix (2005) identified a number of issues and challenges. Chief among the issues and challenges identified by stakeholders as critical to the development of successful agritourism include marketing, product development, government support, education and training, and partnership and communication. There was consensus among stakeholders that farmers going into agritourism need to be able to define the product that they are offering consumers and be able to communicate this to the potential visitors. Also, fostering linkages with other farmers, business community, educational and governmental agencies, as well as, researchers can significantly impact the success of agritourism ventures.\nHowever, successful operation of agritourism depends on certain factors both within and beyond the control of the farmer. Industrialization and globalization provide opportunities as well as challenges and threats to the survival of small farms in this ever-changing agricultural landscape. While agritourism may provide a way to diversify small farms, there are challenges to successful operation of an agritourism farm. Barbieri and Mshenga (2008) investigated the role of owner and firm characteristics on the performance of agritourism farms. They found out that the length of time in operation, number of employees, and farm acreage tended to have a positive impact on agritourism performance as measured by annual gross sales. In other words, larger farms tend to be more successful as agritourism sites. Their hypothesis is that larger farms, as measured by larger acreages and large number of employees, are able to offer a great variety of tourism products and services that ultimately attract more tourists. Other characteristics such as location of the farm, whether it is a working farm, whether the operator has a business or marketing plan, source of start-up capital and the farmer's educational level did not appear to have a significant relationship with the success of agritourism.\nIn a more recent study, Bagi and Reeder (2012) conducted a national survey to investigate the factors affecting U.S. farmers' participation in agritourism. Their results revealed a slew of factors that either promote or hinder the successful operation of an agritourism business. Among the factors that have positive impact are: public access to the farm; proximity to central cities; farms in Rocky Mountains and southern plains, and farms enrolled in conservation programs. Other characteristics that impinge upon farmers' decision to participate in agritourism include age, educational level of the farmer, number of acres of farm, whether the farmer pays for advice, and whether the farm is organized as a partnership or corporation. The data showed that nationally over 84 million acres (representing 10% of farm land) is engaged in agritourism, employing 17 million fulltime-equivalent days of family labor. Figures from the Agricultural Resource Management Survey (USDA-ERS, 2007) showed that the gross income from agritourism operations was in excess of $16,000 per annum, while national total income from agritourism activities was $554 million in 2007. An additional $258 million was generated from direct sale of farm produce to tourists.\nMost of the above cited studies focused on established large farms that are already practicing agritourism. Those that dealt with issues and challenges focused exclusively on existing agritourism operations as opposed to new entrants. There are no studies identifying the challenges that prevent farmers, especially small and sociallydisadvantaged ones from adopting or incorporating agritourism into their farms. A number of relevant questions remain unanswered: For example, what factors constrain the likelihood that small farmers will adopt agritourism on their farms? Are those practicing agritourism doing better economically than those that do not? The present research seeks to provide answers to some of these and other questions that have not been tackled in the literature, particularly as they relate to agritourism development among small and sociallydisadvantaged farmers in North Carolina. However, the question of whether agritourism does enhance farm profitability is not addressed. As noted by Schilling et al. (2014) \"parsing out the effects of agritourism on farm income is challenging for several reasons.\" Reasons cited included the lack of consistent definition for \"agritourism\"; variation in reasons for farmers to develop agritourism enterprises and the strong likelihood of selfselection. While these studies provided a broad overview of the current state of agritourism in North Carolina and elsewhere, they do not provide any demographic information about the farm operators that may be useful for other operators, specifically Small and Socially Disadvantaged Farmers (SSDFs), to use in planning their own agritourism operation. In addition to other objectives, this research helps bridge this gap by analyzing the opportunities for agritourism enhancement among SSDFs and the factors that may influence the decision to add this enterprise to their farm operations. It is hoped that the findings of this research will help provide the foundation for proposing recommendations for addressing the needs of small and socially-disadvantaged farmers in North Carolina who are either involved with agritourism or have interest in adding this enterprise to their farm operations.\nResearch among small farmers in North Carolina indicates that profit maximization was not a priority reason for farming and farmers cite a \"love of farming\" and \"desire to keep the family farm in the family\" as the primary reason for farming (Yeboah et al., 2009) . Given recent economic conditions, small farms that do not operate efficiently can exacerbate loss of farm ownership especially for socially disadvantaged farmers. The concept of \"family farm\" is changing dramatically and small farmers increasingly see themselves as entrepreneurs. Many farms, especially those in eastern North Carolina, will have to continue to change in size and structure to remain viable in the 21 st Century agricultural environment. Farmers must focus much of their energies on diversification as a means to stay competitive and agritourism can provide the diversification and additional income to make the small farm profitable."}, {"section_title": "Empirical analysis", "text": ""}, {"section_title": "Data", "text": "The data for the analysis were obtained as part of a study sponsored by the Evans-Allen Research Program at North Carolina A&T State University. The overall goal of the project was to study small farm agritourism as a tool for community development in North Carolina. The data were collected using a survey administered in the fall of 2014. A total of 895 questionnaires providing detailed information on farm businesses and their operators were sent out yielding a valid response rate of 23.92%. The questionnaire solicited responses to categorical questions resulting in qualitative responses. These were then converted to quantitative factors through the creation of dummy variables."}, {"section_title": "Theoretical model", "text": "According to Bagi and Reeder (2012) , a farmer\"s decision to participate in agritourism can be compared to the choice between new and traditional technology (activity) and that choice models in consumer theory provide guidance for such decision models (Fernandez-Comejo, 1996) . As in previous studies of this kind, the maximum utility a farmer expects to derive from net income from agritourism operation forms the basis in his decision to engage in this enterprise. Following Goodwin et al. (2003) as well as Bagi and Reeder (2012) , the utility maximization equation is provided as given farmer participating or not participating in any new activity or technology is bounded by zero and one. As such a limited dependent variable model such as logit or probit can be used as the framework for the model. Again according to Bagi and Reeder (2012) , if the random error variable i  is independently and identically distributed with a Weibull density function, (similar to the normal density function but with greater kurtosis -thicker tails), then a logit structure is an appropriate choice model (McFadden, 1974 (McFadden, , 1981 Maddala, 1983) . Following Amemiya (1981) , the probability of the th i farmer adopting a new activity or enterprise is given by\nwhere i P is the probability of adoption given the explanatory variable i X In the absence of knowledge about the exact functional form of\ncoefficients. For ease of estimation and interpretation of these coefficients, the logarithm of the ratio of probability of adoption to non-adoption is obtained.\nYeboah et al. 87\nwhere i X  (the stochastic part of the model) is given\nThis transformation is necessitated by the nonlinear relationship between β and i P Equation 4 forms the basis for the empirical model used in estimating the effects of the various factors on the probability of adoption of agritourism by small farmers in North Carolina. The data on farm, farm operators, farm products and services, farmer\"s agritourism operation, and farmer\"s perspective of agritourism industry as a whole were all obtained through the administering of a survey questionnaire in 2014."}, {"section_title": "EMPIRICAL MODEL", "text": "The factors that influence farmer\"s adoption of agritourism have been well studied and according to Bagi and Reeder (2012) are very often grouped into four broad categories: (i) characteristics of the farm\"s land and operation; (ii) the farm household\"s wealth or net worth; (iii) characteristics of the farm operator and (iv) location of the farm. The specific characteristics of these broad categories do vary in their importance in terms of how they influence agritourism. As outlined by Bagi and Reeder (2012) , important farm characteristics include farm size (Evans and Ilbery, 1992; Bernardo et al., 2004; Sonnino, 2004) , number of acres owned (McGehee and Kim, 2004), a farm\"s aesthetics (Hilchey, 1993) a farm\"s attractive characteristics (Rilla, 1999 (Rilla, , 2011 and the farm household\"s wealth or net worth (Sonnino 2004) . Specific factors of operator\"s characteristics include age and education (Barbieri and Mshenga, 2008) , degree of social skill (Hilchey, 1993) , how outgoing the operator\"s personality is (Rilla, 1999) , and the ability to take advantage of a profitable opportunity (Carter, 1998) . Factors related to farm\"s location include the distance of farm from urban centers (Hilchey, 1993; Che, 2007; Che et al., 2005; Veeck et al., 2006; Bernardo et al., 2004) , the farm\"s distance from urban agritourists (OECD, 2009), and regional geographic characteristics such as a region\"s particular form of natural and farm assets, climate, infrastructure, tastes and preferences, cultural values, socioeconomic conditions, and policy considerations (Che, 2007; Sonnino, 2004) . Carter (1998) , Nickerson et al. (2001) and Mace (2005) cite a variety of operator and farm characteristics that influence a decision to adopt innovative activity such as agritourism.\nThe characteristics in the present study are in line with those used in similar studies and are grouped into two broad classes: farm and land characteristics and farm operator characteristics and all the variables used to measure the different characteristics are expressed in categories. Previous studies have established the effects of these factors on the adoption of agritourism (Bagi and Reeder, 2012) . However, in the present study, most of the variables are categorized, and the coefficients are obtained by placing restrictions on the model for the corresponding explanatory variables. Consequently, each coefficient measures the effect of a category on agritourism adoption relative to a referenced category of the variable. This approach is expected to capture variation in these variables.\nThe included farm characteristics are (i) farm organization or As with the adoption of other forms of innovative activity, the ownership structure is expected to influence the decision-making process. Farms that are individually owned and those that are nonincorporated family farms are expected to adopt new innovations such as agritourism much easier than farms under other forms of ownership structures especially incorporated and partnerships. This hypothesis is contrary to what other studies found. For example, Carter (1998) found that diversified farms were more likely to be organized as partnerships and to have more complex forms of ownership than undiversified farms. Thus, a corporate or partnership farm organization could have a positive relationship with participation in agritourism. However, given that the study group is comprised of small and socially disadvantaged farmers, individual ownership and non-incorporated family farms are expected to have a more positive impact on agritourism participation than corporate or partnership farm organization. Adoption decision is expected to be far less complicated than otherwise. The likelihood of agritourism adoption, just like any innovative activity, should increase with land ownership. As the amount of land owned increases as opposed to being leased the farmer\"s ability to bear risk, make decisions and undertake long-term investments should also increase. Farms with high proportion of land that is unsuitable for traditional cropping are more likely to engage in agritourism since these marginal lands can be sources of additional income from agritourism activities. In addition, public access including walking and biking trails, access for hunting, fishing and other forms of recreational activities provide the opportunity to expose these people to agritourism activities hence should increase their adoption. Bagi and Reeder (2012) have indicated that the presence and sale of forest products such as woodland, which in turns supports wildlife, tends to increase a farmer\"s participation in agritourism activity. This hypothesis is maintained in the present study. The wealth of a household has been used as a measure of its ability to take risk and hence borrow money for innovative activities. This variable is included in the model as household income before taxes and is expected to have a positive effect on farmer\"s participation in agritourism activity.\nVariables included in the model that are related to the farm operator\"s characteristics include age, education, access to the internet, gender, race and use of paid farm management advice. Access to internet enhances the farmer\"s ability to receive and manage a variety of information related to the agricultural enterprise such as prices and weather. It also serves as a viable source of marketing a potential agritourism activity. The a priori effect of age on agritourism adoption has been hypothesized to be ambiguous. Older farmers are perceived to have the needed experience and knowledge to handle such a change while younger farmers may have the advantage of health, optimism and openness to new ideas in addition to a longer planning horizon. Education, specifically formal education, training and experience has been hypothesized to increase a person\"s ability to search for relevant information and to interpret, comprehend, critically analyze, modify, and adapt that information for practical economic decision-making (Schultz, 1975; Becker, 1993) . It is therefore theorized that these qualities will enhance a farmer\"s ability to adopt new technology or activity such as agritourism. Additionally, the availability and a farmer\"s willingness to use professional advice is also expected to enhance farmers\" participation in a new activity. It is further argued that greater education, training, and professional advice could also lead some farmers to opt out of agritourism because of unfavorable cost and benefits situations (Bagi and Reeder, 2012) . A study by Carter (1998) found that producers who were involved in diversifying their farms (including those who added recreational activities) were more likely to have received some agricultural and managerial training than producers who did not diversify. Also, the OECD study (2009) of farm diversification cited research showing that education increased a farmer\"s likelihood to engage in value-added production, a similar diversification activity. These arguments point to possible ambiguity in the effect of education on agritourism adoption. This ambiguity is expected to be amplified by the categorized nature of the education variable in the present study.\nSeveral studies indicate that males and females adopt new technologies at different rates and that gender has a significant effect on farmers\" engagement in new activities. A number of studies that focus on the gender of the head of household suggest that male-headed households are more likely to adopt new technologies compared to female-headed households (Doss and Morris, 2001; Kumar, 1994) . Doss (2001) found that women are adopting improved varieties at a lower rate than men in Africa. Other studies (Overfield and Fleming, 2001; Asiedu-Darko, 2014) found no significant relationship between gender and adoption of technologies. Age, on the other hand showed strong negative association with adoption of agricultural technology with older farmers more likely to stick to use of traditional farming methods, whereas younger farmers prefer use of modern methods of farming (Asiedu-Darko, 2014). Age was found to positively influence adoption of sorghum in Burkina Faso (Adesina and Baidu-Forson, Table 1 . A priori directional effects of selected factors on agritourism adoption from previous studies. , 1991) , and chemical control of rice stink bug in Texas (Harper et al., 1990) . In contrast, age has been found to be either negatively correlated with adoption, or not significant in farmer\"s adoption decisions. It can be concluded therefore that the relationship between age and adoption of agricultural technology varies with the type of technology being introduced. Furthermore, some studies have shown a significant interaction between gender and age. For example, Sulo et al. (2012) found that the older the women, the lesser the likelihood of adopting the technology. However, since agritourism is a different kind of activity and cannot be defined necessarily as a new technology, it is quite possible that effect of gender, age and education on agritourism adoption will be quite different from that on agricultural technologies. Wealth and resource base of farmers influence their ability to bear risk and also enhances information flow to assist in decision making. Both of these are crucial ingredients in adopting new activity. It is hypothesized that being Caucasian and being male will each positively influence the participation in agritourism."}, {"section_title": "Factor Expected directional effect", "text": "Similar to other studies, two factors related to a farm\"s location are included in the model. The study uses distance of the farm from a central city in the county rather than the presence of such a city used in other studies and also distance of the farm from the nearest city of at least 10,000 residents. Both are expected to have a positive effect in agritourism participation due to larger number of potential visitors nearby. Table 1 summarizes the a priori directional effects of selected factors on the likelihood of a farmer adopting agritourism from these studies. "}, {"section_title": "Specifications of the estimating model and variables", "text": "where i u is a vector of random errors and i X variables are the explanatory variables. These explanatory variables 1 X through 32 X are described and their means expressed in percentages terms (since they are dummy variables) and coefficients of variation are presented for both agritourism farms and non-agritourism farms in Table 2 . The t-values for testing the significance of difference in means for two types of farms are also presented in Table 2 . Maximum likelihood procedure is used to estimate the logit probability model specified in Equation 5. Included in the output are the coefficients, the likelihood-ratio test statistic (chi-squared) and the measure of the goodness of fit (Cox and Snell R-square, and Nagelkerke R-square)."}, {"section_title": "RESULTS AND DISCUSSION", "text": "The maximum-likelihood estimates, associated standard errors, odds ratios, and test statistics for the goodness-offit measures generated by the model are presented in Table 3 . The chi-squared statistic (for the log-likelihood test) for the estimation that includes all explanatory variables relative to the equation with only the constant term (in which the coefficients of all explanatory variables are restricted to zero) is 91.12 and is significant at a level of less than .01. All coefficients have expected signs relative to the base categories with the exception of \"access to the internet\". In addition, 19 of the 32 coefficients for the explanatory variables are significant at the 10% level or lower. The model produces a Cox and Snell R-square of 0.538 and Nagelkerke R-square of 0.800 with 92.5% of its predictions being correct (Table 3) ."}, {"section_title": "Interpretation of estimated odds ratios", "text": "The coefficient estimates Table 3 are  Table 2 . Means, coefficients of variation, and t-statistics for testing differences in a pair of means of farms by agritourism activity, 2014."}, {"section_title": "Variable", "text": ""}, {"section_title": "Agritourism farms Non-agritourism farms t-value Farm Organization/Ownership", "text": "Individual Ownership a Numbers in parentheses are standard errors. ***, **, and * show that the coefficient is significantly different from zero at the 1, 5 and 10% level, respectively. b Numbers in parentheses are t-values. ***, **, and * show that the coefficient is significantly different from zero at the 1, 5 and 10% level, respectively. c Numbers in parentheses are standard errors. ***, **, and * show that the coefficient is significantly different from zero at the 1, 5 and 10% level, respectively. d Numbers in parentheses are t-values. ***, **, and * show that the coefficient is significantly different from zero at the 1, 5 and 10% level, respectively.\nnatural logarithms   log e of the odds of the farmer offering an agritourism activity. For ease of interpretation and comparison between variables, we transform the coefficients so that they refer to the effect a variable has on the actual odds of participating rather than on the natural logarithm of the odds. This is obtained by calculating the odds ratio for each explanatory variable as: [the odds ratio for k k e X   the odds after k X is increased by one unit] divided by [the odds before a unit increase in k X ] (Long and Freese). Odds ratios are also presented in Table 3 .\nAll explanatory variables in the model are dummy variables and the interpretation of the odds ratios provide useful information comparing each categorical variable with the respective base variable. The odds ratio for the categorical variable of farm being between 5 and 29 miles from a city of at least 10,000 people ( 17 X ) is 186.547 demonstrating that the odds of a farmer located within this distance range is, ceteris paribus, 187 times more likely to engage in agritourism than the odds of a farmer who is more than 29 miles away. The results show over prediction by several of the variables (very high odd ratios) indicative of perfect separation (Introduction to SAS, 2007) as a result of having few observations in some of the categories of these variables. Results obtained for addressing this problem are summarized in Table 4 . Similar to Table 3 , the maximum-likelihood estimates, associated standard errors, odds ratios, and test statistics for the goodness-of-fit measures generated by the model are presented in Table 4 . Again, all coefficients have expected signs relative to the base categories with the exception of \"access to the internet\". However, only 8 of the 32 coefficients for the explanatory variables are significant at the 10% level or lower. The model produces a Cox & Snell R-square of 0.498 and Nagelkerke R-square of 0.742 with 90.7% correct predictions (Table 4) .\nAmong the explanatory variables included in our analysis, education had the greatest effect on odds of a farmer participating in agritourism. Having some college education topped this category followed by college and above and then completing high school compared to farmers with less than high school education. This was followed by the race of the farm operator with white farmers being more likely to engage in agritourism than non-white farmers. Consistent with other studies (Bagi and Reeder, 2012) , public access also had great effect on odds of a farmer participating in agritourism followed by farms with acreage between 10 and 49 acres. Farm sizes at both ends of the distribution (less than 10 acres and over 49 acres are likely to reduce farmer\"s participation in agritourism. A Small Farm, according to USDA census is a farm that is 179 acres or les, or earns $50,000 or less in gross income per year. Thus by this definition, agritourism adoption might be negatively impacted by the size of the farm. On the other hand farms with less than 10 acres or more than 50 acres of land deemed unsuitable for crop production, may encourage the adoption of agritourism.\nWillingness to pay for farm-related advice and a farm organized as a partnership or corporation also increased the odds of agritourism participation, but these effects were not as strong as found by other researchers (Bagi and Reeder, 2012) . Total acreage deemed unsuitable for crop production, farm location relative to central city and population centers, raising forest products for commercial sale, male farm operator and households with income of $10,000 and above before taxes all increase the odds of participation in agritourism."}, {"section_title": "Conclusions", "text": "This study has demonstrated that the probability of a farmer\"s participation in agritourism in North Carolina is significantly affected by a number of variables related to farm characteristics, the farm operator and the location of the farm vis-à-vis relative distances from urban centers. These variables with significant categories compared to the reference category include amount of land owned, the amount of land deemed unsuitable for crop production and public access for recreational uses to some part of the farm. Similarly, farm operator characteristics with significant odds ratios categories include education, gender, household income before taxes, raising forest products for commercial sales, use of farm management advice and the farm\"s organization. In terms of farm location, proximity to central city in the county and population centers do not have categories with strong odd ratios compared to the reference categories.\nTo a large extent these results are consistent with results from other studies and provide useful information for County Extension experts and others at the state and local level in their efforts to promote agritourism. Similar to those of Bagi and Reeder (2012) , these findings are particularly useful for individuals who design policies or programs such as education and training, technical assistance, and advertising and promotion and who aim to target minorities and other socially disadvantaged individuals. Findings about farm location, gender, education level and race and income levels can all be useful in assessing the potential for success program design. For example, limited education, a common characteristic of low-income farmers can point to difficulties for such farmers establishing agritourism and staying in business. However, this can be offset, somewhat, by a willingness to solicit management advice from County Extension agents or other experts. Thus, the complementarity between these two factors may make it possible for a limited-resource, undereducated farmer to overcome and succeed in this activity with proper advice."}]