[{"section_title": "", "text": "This report presents data on recipients of research doctorates awarded by U.S. universities from July 1, 1999 through June 30, 2000. The information is taken from the Survey of Earned Doctorates, an annual census of new doctoral recipients. The 406 universities in the United States that confer research doctorates awarded a total of 41,368 doctorates in the 1999-2000 academic year. This is an increase of 0.8% over the previous year, marking the seventh year that the total number of new research doctorates has exceeded 41,000. The greatest number of research doctorates were awarded in the life sciences, 8,529 Ph.D.s. Other broad areas were the social sciences, education, the physical sciences and mathematics, the humanities, engineering, and business and other professional fields. Women received 43.81 of all doctorates granted in 2000, the highest percentage ever. More than 16% of all doctorates awarded to U.S. citizens in 2000 were earned by members of racial and ethnic minority groups. U.S. citizens received 70.61 of all doctorates earned in 2000. The median time to degree since receipt of the baccalaureate was 10.3 years in 2000, slightly down from 1999. Most doctoral recipients in 2000 received the majority of their financial support for graduate education from program-or institution-based sources such as fellowships or teaching and research assistantships. About one-half of new Ph.D.s reported no educational indebtedness at the completion of the degree; about 711 had definite postgraduate commitments for employment or continued study. Five appendixes contain the survey questionnaire, basic and trend tables, and technical notes. (Contains 12 figures and 41 tables.) (SLD) Reproductions supplied by EDRS are the best that can be made from the original document."}, {"section_title": "Association Profiles", "text": "This product allows scholarly and professional organizations (or other interested data users) to obtain trend data from 1960 to the present on research doctorate recipients in fields of their choosing. The profiles present trend data on research doctorates' demographic characteristics and employment plans for the selected fields, comparing them to national profiles."}, {"section_title": "Institution Profiles and Datasets", "text": "All Graduate Deans who participate in the SED receive a profile of their institution's research doctorates comparing them to all research doctorates in the U.S. and to research doctorates at peer institutions. In addition, Graduate Deans may order, at cost, an electronic file on CD-ROM or diskette reporting data for all of that institution's doctorate recipients recorded in the Survey of Earned Doctorates from 1920 to 2000. A codebook and other aids are provided to facilitate computer processing of the dataset. Custom Tabulations NORC will perform, at cost, tabulations customized to requesters' research specifications. NORC will provide estimates of cost and delivery date for customer approval before performing work. For further information on this service, contact:  Tables, 2000   61   B   Trend Tables, 1990- Table 5 Major field of doctorate recipients for selected years, 1970-2000 Table 6 Doctorate recipients and percent earned by females, by selected subfields, 1990 and 2000 Table 7 Number and percent of doctorate recipients, by sex within broad field for selected years, 1970-2000 Table 8 Number of U.S. citizen doctorate recipients by race/ethnicity within broad field for selected years, 1980-2000 39 Table 9 Major field of U.S. citizen doctorate recipients, by race/ethnicity, 2000 40   Table 13 Top 20 institutions in the number of doctorate recipients who were non-U.S. citizens, 2000 44 Table 14 Top 20 institutions in the percentage of doctorate recipients who were non-U.S. citizens, 2000 44   Table 17 Median number of years from baccalaureate to doctorate award, by demographic group and broad field, 2000 Table 18 Distribution of doctorate recipients, by age at doctorate, 2000 Table 19 Primary sources of financial support for doctorate recipients, by broad field and demographic group, 2000 Table 20 Cumulative debt related to education of doctorate recipients, by broad field, 2000 Table 21 Cumulative debt related to education of doctorate recipients, by demographic group, 2000 Table 22 Postgraduation status of doctorate recipients, by broad field for selected years, 1980-2000 Table 23 Postgraduation status of doctorate recipients, by demographic group for selected years, 1980-2000 Table 24 Postgraduation commitments of doctorate recipients, by type of plans and broad field for selected years, 1980-2000 Table 25 Postgraduation commitments of doctorate recipients, by type of plans and demographic group for selected years, 1980-2000 Table 26 Postdoctoral location of non-U.S. citizen doctorate recipients with postgraduation commitments, by major field and visa status, 2000 Table 27 Postdoctoral location of non-U.S. citizen doctorate recipients with postgraduation commitments, by visa status for selected years, 1980-2000  Table A-1  Number of doctorate recipients, by sex and subfield, 2000   Table A-2  Number of doctorate recipients, by citizenship, race/ethnicity, and subfield, 2000   Table A-3 Statistical profile of doctorate recipients, by major field, 2000    are shown in appendix A, and trend tabulations for the previous ten-year period (1990 to 2000) are presented in appendix B. Appendix C provides technical notes, including response rates, and other information related to tables and figures in the report. Appendix D is the SED questionnaire for the 2000 academic year. Appendix E lists field of study classifications and research degree titles included in the SED."}, {"section_title": "Related Publications", "text": "The methodology of the SED 2000 survey is described in detail in the annual Survey of Earned Doctorates Quality Profile Report: 2000. This report is posted on the National Science Foundation, Division of Science Resources Statistics (SRS) web site (http://www.nsf.gov/sbe/srs/ssed/sedmeth.htm). The NSF also publishes an annual volume of tabulations using the SED data, Science and Engineering Doctorate Awards: 2000 that is available from NSF-SRS in printed form or on the NSF-SRS web site. Copies of the annual Summary Report from previous years are available on both the NSF-SRS web site and the NORC web site (http://www.norc.uchicago.edu/issues/docdata.htm)."}, {"section_title": "I C 2", "text": ""}, {"section_title": "Trends in Doctorate Recipients", "text": "The primary respondents to the Survey of Earned Doctorates are the actual research doctorate recipients3 from all U.S. universities. These individuals are identified each year by the universities and the information is transmitted to the SED data collection contractor (NORC at the University of Chicago has been the contractor since 1997). The lists of new doctorate recipients are carefully checked and edited by the data collection contractor working closely with the universities over the course of the SED eligibility year, and for a period of several months after the end of the eligibility period. The result of this process is a remarkably comprehensive picture of the universe of new doctorate recipients each year. Thus, these data provide a solid basis for charting trends in the numbers and characteristics of this important population."}, {"section_title": "Overall Trends and Rates of Change", "text": "For the twelve-month period ending June 30, 2000, U.S. universities awarded 41,368 research doctorate degrees, compared with 41,060 for the previous year (see table 1). This was a percentage increase from 1999 to 2000 of 0.8 percent. For the last 40 years, the increase in the number of doctorates awarded by U.S. universities has averaged 3.8 percent per year. Between 1961 when the number of annual doctorates awarded exceeded 10,000 for the first time and 1967, the annual growth rate was almost 12 percent, and the number of doctorates awarded virtually doubled (20,403). Only four years later, in 1971, the annual total topped 30,000 (31,867) for the first time. The number of doctorate degrees annually awarded during the decades of the 1970s and 1980s remained fairly stable at about 30,000 degrees awarded each year. In 1986 a second period of growth began that continued through the early 1990s. The total figure did not exceed 40,000 until 1994 (41,034), 23 years after it had reached the 30,000 mark. Over the past few years, the annual rates of increase have become smaller than they were in the first half of the decade of the 1990s, including gains of only 0.3 percent for 1997 and 0.2 for 1998. The total number of doctorates declined in 1999 from the previous year for the first  1 9 5 7 1 9 6 0 1 9 6 3 1 9 6 6 1 9 6 9 1 9 7 2 1 9 7 5 1 9 7 8 1981 1 9 8 4 1 9 8 7 1 9 9 0 1 9 9 3 1 9 9 6 1 9 9 9  1963 1966 1969 1972 75 19 8 1981 1984 1987 1990 1993 1996 99 Year See Pennsylvania (2,101), Florida (1,889), and Ohio (1,795). These eight states accounted for more than half 56.8 percent of all doctorates awarded in 2000. (See figure 3 and table 4.) 5,000  Table 4. Source: NSFINIH/USED/NEH/USDNNASA, Survey of Earned Doctorates"}, {"section_title": "Doctorates by Broad Field", "text": "The SED classifies research doctorate degrees into approximately 290 fields of specialization (these are listed on pages 8 and 9 of the questionnaire included in appendix D). Since fields of specialization are dynamic entities which reflect the evolving programs of researchers and their constituencies, the SED list is reviewed each year to identify emerging fields and periodically revised to accommodate changes in the world of doctoral education. The SED is able to collect information on the specialization fields of virtually all the new doctorates each year; coverage in 2000 was attained for all but 5 of the 41,368 doctorate recipients. life sciences (+7.7 percent) and social sciences (+7.2 percent) were also higher in 2000; education was 3.4 percent lower. (See table 5 and figures 4 and 5.)  Table 5. Source: NSF/NIH/USED/N EH/USDA/NASA, Survey of Earned Doctorates The four broad fields that together constitute \"science and engineering\" (S&E  "}, {"section_title": "Doctorates by Sex", "text": "The aggregate increase in doctorates between 1999 and 2000 0.8 percent reflects a 1.0 percent decline for males and a 1.3 percent increase for females. With respect to the distribution of doctorates by sex across broad fields of study, women constituted 64.9 percent of all education doctorates for 2000, the majority in the social sciences (54.6 percent), and half in the humanities (50.3 percent). By contrast, the representation of females among doctorate recipients in the physical sciences and engineering for 2000 was only 24.2 percent and 15.8 percent, respectively (figure 8). However, even these still-low percentages have shown remarkable change over time: 25 years ago, when females were only 21.9 percent of all doctorate recipients, they constituted just 8.3 percent and 1.7 percent in the physical sciences and engineering, respectively. Similar long-term trends are discernible in other broad fields as well: in the life sciences, from 19.8 percent in 1975 to 46.9 percent in 2000; 25.1 percent to 54.6 percent in the social sciences over that same period; and from 33.  1970,1980,1990,2000 "}, {"section_title": "Doctorates by Race/Ethnicity", "text": "While the total number of doctorates rose between 1999 and 2000 by 0.8 percent, the aggregate number of minority doctorate recipients increased by 2.5 percent for U.S. citizens. Within minority race/ethnic categories, Asians and blacks showed the largest percentage gains, 6.4 percent and 3.9 percent, respectively; the corresponding figure for Hispanics was 0.5 percent. American Indians were the only minority group to register a decrease in the number of doctorates from 1999 to 2000, falling from 217 to 169. By comparison, the number of white doctorate recipients remained almost unchanged. (See appendix table B-2a.) A total of 4,389 doctorates were awarded to members of U.S. racial/ethnic minority groups in 2000. This figure is, as noted above, 2.5 percent higher than one year earlier; it is also 25.1 percent higher than the total five years earlier (1995) and nearly double the number for 1990 (86.0 percent higher). The figures in the first panel of table 8 generally indicate that doctorates awarded to U.S. minority groups increased much more in the 1990's than the 1980's. The twenty-year gains were greater for Asians (207 percent), Hispanics (177 percent), and American Indians (125 percent) than for blacks (61 percent). (See figures 9 and 10 and table 8.)   Table 8. Source: NSF/NIH/USED/NEH/USDA/NASA, Survey of Earned Doctorates Within racial/ethnic groupings, the trends for the broad fields shown in table 8 indicate that the overall pattern for minorities generally holds for the separate minority groups within the seven broad fields. One exception is that the number of Asian doctorate recipients in engineering grew rapidly from 1980 to 1995, but leveled off from 1995 to 2000. The general pattern, however, was one of relatively small increases from 1980 to 1990 followed by large increases from 1990 to 2000. (See table 8.) The balance of male and female doctorate recipients differs between racial/ethnic groups. Among U.S. citizens, of doctorates earned by whites, 48.4 percent were awarded to women; for blacks, various Hispanic groups, and American Indians, women were in the majority, earning between 51.0 percent and 65.7 percent of doctorates received by persons of those races or ethnicities. Among Asian Americans, women were 45.9 percent of the total. (See figure 12 and appendix  With regard to broad field of study, of the doctoral population with known citizenship status, U.S. citizens earned more than 80 percent of the doctorates awarded in the social sciences, humanities, and education (80.8 percent, 81.7 percent, and 89.3 percent, respectively) in 2000. (See table 11.) In absolute numbers, U.S. citizens earned more doctorates in education than in 'Citizenship status (U.S. versus non-U.S.) and country of citizenship are variables with somewhat higher than average non-response in the SED, and the figures presented in this section are therefore less certain than others in the report. The percentage of cases with missing data on these variables has also fluctuated more year to year than other SED variables, and the over-time comparisons are thus also subject to some uncertainty. For example, in 1995 citizenship status was unknown for 2.1 percent of recipients, but this number was 3.8 percent in 1990 and 1.8 percent in 1975. any of the other broad fields; permanent residents had their highest total in the life sciences, and for those in the United States on temporary visas, engineering was the most popular field.  Although similar in general, parental education backgrounds of male and female 2000 doctorate recipients differed with respect to mothers' education. Female doctorate recipients were more likely than their male counterparts to have a mother who attended college or who earned an advanced degree. There is considerable variation in parental education attainment by race/ethnicity, citizenship status, and broad field of study. Compared with other racial/ethnic categories, Asian American doctorate recipients were more likely to come from families in which both the father and mother had advanced degrees; black, Hispanic and American Indian recipients' parents were the least likely to have gone beyond high school. U.S. citizen doctorate recipients were more likely than those with either permanent residency status or holding temporary visas to have parents with advanced degrees (and less likely than these two groups to have parents whose formal education did not extend beyond the high school level). The distributions of parental education by the broad fields in table 15 reflect, in part, the different race/ethnic and citizenship compositions of the fields. Doctorate recipients in the humanities displayed the highest percentages of both fathers (42.2 percent) and mothers (25.3 percent) with advanced degrees. Education doctorate recipients had the lowest percentages of advanced degrees by fathers or mothers, 20.7 percent and 12.0 percent, respectively. These two broad fields are also the least and most represented, respectively, with regard to the fraction of parents whose formal education stopped at high school or before."}, {"section_title": "Time to Degree", "text": "The amount of time needed to complete a doctorate is a key concern not only for those pursuing the degree, but also for the faculties and administrations of the degree-granting institutions, as well as national public agencies and private organizations that support doctoral study. Time to degree is likely to be affected by individual preferences and economic constraints, as well as by the labor markets and cultures of the academic disciplines and institution-specific program characteristics. The SED measures time to degree in three ways: (1) the total time elapsed from completion of the baccalaureate to completion of the doctorate, (2) the total time elapsed while actually registered in graduate school to completion of the doctorate, and (3) the simple age of the doctorate recipients at the time the doctorate is awarded. In this section, the 2000 data and the historical trends for each of these measures is reviewed for the whole population of doctorate recipients and, separately, by broad field and the background variables of sex, race/ethnicity, and citizenship. The median total time span from baccalaureate to doctorate for the 2000 doctorate recipients was 10.3 years (table 16), nearly the same as in 1999. The total time span was shortest in the physical sciences (8.0 years) and longest in education (19.4 years). The latter broad field includes large numbers of individuals who have worked full-time before starting their graduate degree programs, and who even continue to work full-time while earning their doctorates. The historical data in table 16 show that the 2000 median total time to degree was about 6 months shorter than in 1995. The long-term trend has been one of increases in length from 1975 to 1995 (see figure 13 and table 16). The broad fields of engineering, physical sciences, life sciences, social sciences, humanities, and education follow this overall pattern toward shorter times; but median time to degree for the professional/other fields increased from 1995 to 2000. The median duration of being registered in graduate school was 7.4 years for the 2000 doctorates (table 16), nearly identical to the number for 1999. Registered time to degree was shortest in the physical sciences and engineering (6.8 years), and longest in the humanities (8.8 years) (table 16). The trend for time registered is one of small but steady increases over the 25year span from 1975 to 2000 (see figure 13 and table 16) for all seven broad fields, with some flattening in the past five years. The median time to degree indices vary somewhat by sex, citizenship, and race/ethnicity, but these differences are mainly reflections of the broad field differences reviewed above (table   17). Across the whole population of new doctorate recipients, females had longer total and registered times to degree than did males, but the sex differences disappear, or reverse, when males and females are compared within specific broad fields other than humanities and education. Similar patterns hold for comparisons of U.S. and non-U.S. citizens, and of the U.S. The SED asks two questions that, taken together, provide information on the financial sources of support utilized by the new doctorate recipients (for the exact formats and wordings, see the copy of the questionnaire in Appendix D). The first question is a checklist of 13 different potential sources of support, such as fellowships and scholarships, dissertation grants, teaching and research assistantships, and various personal arrangements. The second question asks which of the checked sources was the primary source of support and which was the second most important. For purposes here, respondents are grouped in terms of their primary sources of support. The 13 sources are combined into the seven categories that form the rows in table 19. Three in five 61.1 percent of the 2000 doctorate recipients received the majority of their support for doctoral study from program-or institution-based sources, such as teaching assistantships, research assistantships/traineeships, and fellowships/dissertation grants.1° About one third (32.2 percent) of all 2000 doctorate recipients reported that their own resources (which include funds from loans, one's spouse, savings, and non-academic employment) were the primary sources they used to finance their doctoral studies. Foreign government, employer contributions, and \"other\" sources accounted for the remaining 6.6 percent of the cases. (See   figure 15 and table 19.) 10 The Federal government and other governments can be the original source of these funds. Overall, women were more dependent upon personal resources than were men (40.5 percent versus 25.7 percent). The same was true for U.S. citizens (40.4 percent) compared to foreign citizens on permanent or temporary visas (22.7 percent and 10.2 percent, respectively). However, sources of support vary considerably by field of study. For example, within the physical sciences, a much higher than average percentage of new doctorate recipients reported program-or institution-based programs as primary sources of support (86.0 percent). In engineering, 77.5 percent of the research doctorate recipients in 2000 listed teaching/research assistantships or fellowships as their principal form of support, as did 76.0 percent of those in the life sciences. In contrast, only 58.4 percent of doctorate recipients in the humanities, 52.9 percent of those in the social sciences, and 20.0 percent of those in education reported these categories as the primary sources of financial support for their doctoral program. The gender differences and contrasts between U.S. and non-U.S. citizens reflect these differences among the broad fields. Nonetheless, in all the broad fields of study except engineering and humanities, new women doctorates were more likely to depend on their own resources than new men doctorates (table 19). Similarly, non-U.S. citizens tend to be more concentrated in fields where the majority of doctoral students receive institution-and/or program-based support. Reflecting this concentration, non-U.S. citizens reported lower percentages of reliance on their own resources than did U.S. citizens. The differences were much smaller within the broad fields of study than overall, but U.S. citizens were still more likely to rely on their own resources than non-U.S. citizens (table 19). Differences in the various modes of financial support are also apparent with regard to race/ethnicity. Black doctorate recipients indicated the greatest reliance on their own resources to finance their doctoral program (47.0 percent), followed by American Indians (44.7 percent), whites (40.4 percent), Hispanics (39.6 percent), and Asians (20.7 percent). Within most of the broad fields of study, the race/ethnicity differences in reliance on own resources diminish. Some large race/ethnic differences within fields are found, however, in terms of use of the different types of program-and institution-based supports. In the physical sciences and engineering, Asians and whites were more likely than blacks and Hispanics to rely on teaching and research assistantships and less likely to have fellowships or dissertation grants as their primary source of support. The SED also asks the new doctorate recipients to indicate the amount of money they owe that is directly tied to their undergraduate or graduate education. This is defined as debt related to tuition and fees, living expenses and supplies, and transportation to and from school. The response categories begin with \"none\" and proceed upward in $5,000 increments, with \"$30,001 or more\" at the top. \" A total of 37,513 (91 percent) graduates responded to the question. Almost half (49.3 percent) of the respondents in 2000 reported having no educationrelated debt, and another 22.6 percent reported cumulative debt of $15,000 or less (table 20). However, a distinct bulge at the high end of the debt distribution is also evident, with 15.1 percent of all new doctorate recipients reporting debt over $30,000. Looking at the debt distributions within each of the seven broad fields, graduates in the physical sciences, engineering, education, and the life sciences are most likely to complete the doctorate with no education-related debt (table 20). Social scientists and humanities graduates are more likely to have debt. Debt levels in excess of $30,000 or more are most common among \" See the special section on indebtedness in the Sununary Report 1998 for more detail on debt levels and financial support for doctoral education. The report is available on the NORC web site , (http://www.norc.uchicago.edu/issues/docdata.htm). social scientists (27.2 percent), graduates in the professional/other fields areas (18.5 percent), and the humanities (17.9 percent). The pattern of debt levels for the main demographic groups are shown in table 21. Particularly noteworthy in these tabulations is the much higher incidence of blacks, Hispanics, and American Indians incurring high levels of education-related debt. Three in ten (30.0 percent) of black doctorate recipients, 23.5 percent of American Indians, and 23.2 percent of Hispanics owed more than $30,000; these figures compare to 11.1 percent of Asians and 16.6 percent of whites owing that much. At the other extreme, Asians and whites are much more likely than the other groups to have no education-related debt upon completion of the doctorate. Slight differences are observed in the debt level pattern between the sexes. New female doctorates were more likely to have some debt than their male counterparts (51.9 percent vs."}, {"section_title": "percent)", "text": ". Among new doctorates, U.S. citizens were more likely to incur higher education related debt than graduates with permanent or temporary visas (57.7 percent, vs. 34.9 percent, and 33.3 percent, respectively)."}, {"section_title": "Postgraduate Plans, Employment, and Location", "text": "The SED questionnaire includes a number of questions about the graduates' immediate plans for work or further study.12 The responses provide a useful overview of the numbers planning to enter academic positions, government and industry, and postdoctoral programs of research and further study. Information is also collected on the main types of work activities research, teaching, administration, and professional services to individuals that the graduates anticipate in their new positions. Students with temporary visas were more likely than permanent residents and U.S. citizens to pursue postdoctorate studies (the student visa allows the student to remain in the U.S. for two years of additional training after completing the doctorate). Among U.S. citizens and permanent residents, Asian doctorate recipients were more likely than other race/ethnicity subgroups to plan postdoctorates followed by Hispanic and white recipients, respectively. Black and American Indian doctorate recipients were least likely to report postdoctorates. These differences among citizenship and race/ethnicity subgroups reflect the greater number of postdoctorates in the physical and life sciences, and the greater concentrations of non-U.S. citizens and Asian American students in those fields."}, {"section_title": "Postdoctoral Location of Non-U.S. Citizens", "text": "As the number of international students earning research doctorates in the United States has steadily increased over the past two decades, so has the tendency for those students to remain in the United States following graduation.       Source: NSF/NIH/USED/NEH/USDNNASA, Survey of Earned Doctorates   Source: NSF/NIH/USED/NEH/USDA/NASA, Survey of Earned Doctorates a The ranking excludes institutions with fewer than 10 non-U.S. citizen doctorate recipients. b The percent column is based on the number of non-U.S. citizens as a percentage of the total doctorates awarded by that institution. Source: NSF/NIH/USED/NEH/USDA/NASA, Survey of Earned Doctorates    Source: NSF/NIH/USED/NEH/USDA/NASA, Survey of Earned Doctorates      Source: NSF/NIH/USED/NEH/USDA/NASA, Survey of Earned Doctorates      Tables A-1 and A-2 display data for the most recent year by subfield of doctorate. Field groupings may differ from those in reports published by Federal sponsors of the Survey of Earned Doctorates (SED). The \"general\" field categoriese.g., \"chemistry, general\"include individuals who either received the doctorate in the general subject area or did not indicate a particular specialty field. The \"other\" field categoriese.g., \"chemistry, other\"include individuals whose specified doctoral discipline was not among the specialty fields listed.  Median Time Lapse: \"Total Time\" refers to the total calendar time elapsed between the month/year of baccalaureate and the month/year of doctorate. \"Registered Time\" refers to the actual time in attendance at colleges and universities between receipt of the baccalaureate and the doctorate. Postgraduation Plans: Each year's doctorate recipients provide information on postgraduation employment or study plans in response to items B1 through B9 on the survey form. Since the questionnaire is filled out around the time the doctorate is awarded, a recipient's plans are subject to change. However, comparisons with the longitudinal Survey of Doctorate Recipients (SDR) have shown SED data to be a reasonable indicator of actual employment status in the year following the doctorate, although results vary by sector. (The SDR is a follow-up employment survey of a sample of doctorate recipients in science, engineering, and, until 1995, humanities fields.) In Table A-3 the postgraduation plans of doctorate recipients are grouped as follows: \"Postdoctoral Study Plans\" (fellowship, research internship, traineeship, other), \"Planned Employment after Doctorate\" (educational institution, industry, etc.), and \"Postdoctoral Plans Unknown.\" These categories include recipients who were still negotiating or seeking positions at the time of survey completion, as well as those whose plans were definite. The sum of these lines equals 100 percent for each column, with allowance for rounding: for example, 33.5 percent of all agricultural sciences doctorate recipients had postdoctoral study plans, 59.0 percent planned to be employed, and 7.6 percent did not report their post-graduation plans, totaling 100.1 percent. The additional .1 percent is due to the fact that the exact figure for each type of postdoctoral plans is not exact, but has been rounded (e.g. the actual figure for employment plans is 58.98618 which rounds to 59.0). The postdoctoral study row is further subdivided by type of study or appointment (fellowships, research associateships, traineeships, and other study). The percentages in these subdivisions sum to the percent of respondents in the given column who reported plans for postdoctoral study. The employment row is similarly subdivided by type of employer. The percentages for these rows add to percentage of respondents in the given column who planned employment. The category for educational institutions includes elementary and secondary schools as well as colleges and universities, and the category for government includes military service. The four lines of data beginning with \"Definite Postdoctoral Study\" distinguish between individuals who had definite postgraduation plans at the time of survey completion (item B I: \"Am returning to, or continuing in, predoctoral employment\" or \"Have signed contract or made definite commitment\") and those who were still seeking employment or postdoctoral study (item B I: \"Am negotiating with one or more specific organizations,\" \"Am seeking position but have no specific prospects,\" or \"Other\"). These four lines, when added to the prior line, \"Postdoctoral Plans Unknown,\" total 100 percent with allowance for rounding. The two lines \"Definite Postdoctoral Study\" and \"Seeking Postdoctoral Study\" add to give the percentage for \"Postdoctoral Study Plans\"; the two lines \"Definite Employment\" and \"Seeking Employment\" add to give the percentage for \"Planned Employment After Doctorate.\" Percentages showing the distribution of doctorate recipients by postdoctoral work activity and region of employment are based only on the number of recipients who had definite employment commitments at the time they completed the questionnaire. These percentages exclude recipients who planned postdoctoral study (as described above) and recipients who were still seeking employment at the time they completed the questionnaire. (Note that the rows on specific postdoctoral study and employment plans discussed earlier include individuals whose plans were not definite.) The U.S. regions of employment shown in Table A Tables A-3 and A-5. Field groupings may differ from those in reports published by Federal sponsors of the SED. The racial/ethnic question has undergone several revisions over the years. In 1977 it was modified to correspond to a standard question format recommended by the Federal Interagency Committee on Education and adopted by the Office of Management and Budget (OMB) for use in Federally sponsored surveys; an explanation of the effect of these changes is detailed on page 13 of Summary Report 1977. (Note: Changes in the OMB guidelines prompted the reclassification of persons having origins in the Indian subcontinent from the white category to the Asian category.) In 1980 the item was further revised in two ways: (1) the Hispanic category was subdivided into Puerto Rican, Mexican American, and other Hispanic to provide more detail for users of the racial/ethnic data; and (2) respondents were asked to check only one racial category. (Before 1980, doctorate recipients could check more than one category to indicate their race.) The item was modified again in 1982 to separate the questions on race and ethnicity. Since then respondents have been asked to first indicate whether or not they are Hispanic, and then check one of the four racial group categories (American Indian, Asian, black, or white). In Table A-4, doctorate recipients who reported Hispanic heritage, regardless of racial designation, are included in one of three Hispanic groups: Puerto Rican, Mexican American, or other Hispanic. The remaining survey respondents are then counted in the respective racial groups. (Note: Doctorate recipients who checked the category \"American Indian or Alaskan Native\" are identified as American Indian in this report.) In the section of \"Doctoral Program Support\" a recipient counts in more than one category if support was received from multiple sources. Because a student counts more than once for sources of support, the vertical percentages sum to more than 100 percent. See the explanatory note on Appendix Table A-5 for further detail. (Data on the primary source of support for doctorate recipients are presented in the body of the report.) The other sections in Table A-4 correspond to many of those in Appendix Table A-3. The reader is referred to the explanatory note on Table A-3 for additional information.   TABLE A-5: Table A-5 displays data reported in item All on financial resources used in support of the respondent's doctoral program, by broad field and sex of recipient. Field groupings may differ from those in reports published by Federal sponsors of the SED. A recipient counts in more than one category in Table A-5 if more than one financial resource was reported. Because a student counts once for each of his/her financial resources, the vertical percentages sum to more than 100 percent. (Data on the primary financial resources for doctorate recipients are presented in the body of the report.) Please consult Appendix C: Technical Notes for additional information on changes in the coding of Sources of Support/Financial Resources.    Race   TOTAL ALL FIELDS  41,368  9,648  29,837   169  2,315   1,775  23,651  307   411  561   648   PHYSICAL SCIENCES  6,077   2,161   3,619   17   379   101   2,914  30  40  52  86   MATHEMATICS  1,048  442  568   2  70   14   460   2  8   4   8   Applied Mathematics  238  118  116   1   24   4             In this table, a recipient counts once in each source category from which he or she received support. Since students indicate multiple sources of support, the vertical percentages can sum to more than 100 percent. (Data on the °primary' source of support for doctorate recipients are presented in the Summary Report.) 9 Includes 2-year, 4-year, foreign colleges/universities, medical schools, and elementary/secondary schools. \" Includes only recipients with definite employment plans. Source: NSF/NIH/USED/NEH/USDNNASA, Survey of Earned Doctorates 79. 3 1 APPENDIX TABLE A-5. Doctorate recipients financial resources in support of doctoral programs, by broad field and sex, 2000  Men Women   Unduplicated  Total°N   21,217  16,570  4,226   1,355  4,085  763  4,207  3,736  2,929  3,472  2,569  2,628  2,027  3,750  1,174  866   Loans   N   7,135  6,619  972  346  739   126  1,252  1,082  1,559  2,007   1,291  1, 4,596  1,466  4,463  839  4,524  3,997  3,227  3,879  2,799  2,830  2,250  4,167  1,314  943   Alabama  294   52  12   55   79  67  26  37   16  12   45  69   21   14   Alaska   15   s   7   1   3   o  3   3   1   0   0   1  1   o   o   0   Arizona  438   94   32   81   13   72  57  54  49  50  50  53  80  34   19   Arkansas   75    10  6   7   0   31   16  3   7   9   3  12  18  3                  Source: NSF/NIH/USED/NEH/USDNNASA, Survey of Earned Doctorates J As shown in the table above, 91.9 percent of 2000 U.S. research doctorate recipients completed survey forms. This percentage is what has been referred to as the \"self-report\" rate. The remaining doctorate recipients have either \"skeletal\" records containing only PHDINST, PHDFY, PHDCY, SEX, PHDMONTH, (and in private identifier files, Name) or \"institution provided\" records including the skeletal information above as well as information provided by the institution in \"missing information rosters (MIRs)\" where available. It should be noted that the sex variable was not always available, even for survey respondents. Every effort was made to obtain this information for as many respondents as possible, but for a small percentage, this could not be done with confidence. Thus, you will notice that there are missing data for many of the tabulations involving sex in this year's report. Prior to 1997, whenever sex was missing, the data were assigned to \"male.\" In 1997, it was decided to discontinue this practice. The tabulations involving sex for 1997 through 2000 exclude missing cases except where noted otherwise."}, {"section_title": "98", "text": "Wherever possible this report includes data from all Ph.D. records whether complete or skeletal; thus the reported total number of Ph.D. recipients for 2000 (41,368) includes both respondents and non-respondents. It should also be noted that, in keeping with the practice of earlier data collection cycles, counts for previous years were corrected by the addition of data from surveys received after the close of data collection for a given year. A Comparison of Self-Reported and Institution-Supplied Data So far, self-report rates have been discussed at the institution level. But is there a significant difference between respondents who complete questionnaires and those who are nonrespondents to the survey? One way to check is to compare the profiles of critical item data provided on survey forms with similar data ascertained from institution-supplied data provided for nonrespondents. Table C-2 compares these data on eight critical items. The table presents two types of data: the percentage of missing data for each critical item, by type of response; and the percentage-response breakdown for non-missing data for each critical item.  Table C-2 presents the results of a chi-square test comparing self-reported cases and nonresponding cases where institutions supplied data on critical items. In general, it can be noted that the profile of nonrespondents was significantly different from the profile of respondents in five of the eight critical item variables. Nonrespondents appear to be slightly older than respondents. Nonrespondents are more likely to be non-U.S. citizens, non-white, graduates of non-U.S. bachelors' institutions and pursuing postdoctoral studies or employment outside the U.S. These findings should be considered suggestive only. The larger amount of missing data noted on BAINST, BAYEAR and PDLOC cautions against definitive conclusions."}, {"section_title": "i 1", "text": ""}, {"section_title": "II. Item Response Rates", "text": "The table on the following pages shows the response rates for each item in the Survey of Earned Doctorates for 1990 through 2000. The numbers and percentages shown in the tables and figures in the body of the summary report are based only on the number of research doctorate recipients who responded to the applicable survey items. For cross-tabulations, the response rate for a given tabulation will be no greater than the lowest response rate for the items involved in the tabulation. For additional technical information on the Survey of Earned Doctorates, please contact   a The percentage represents the race/ethnic groups conventionally reported by the Doctorate Data Project; multiple and \"other\" races are excluded. b As of FY 1996, the percentage includes recipients who said they had no primary source of support. The percentages on the first line are based on the total doctoral cohort for a fiscal year. The percentages on the second line (enclosed in parentheses) are based on the number of non-U.S. citizens in that year."}, {"section_title": "aw, 1", "text": "A A %) Appendix handicap. Note: The definition of \"handicapped\" was much more restrictive in 1990 and 1991. Because this field is not applicable to all doctorate recipients, the response rate will always be under 100%. g Because this field is not applicable to all doctorate recipients, the response rate will always be under 100%   k The percentages on the first line are based on the total doctoral cohort for a fiscal year. The percentages on the second line (enclosed in parentheses) are based on the number of recipients who reported plans for postdoctoral study. 1The percentages on the first line are based on the total doctoral cohort for a fiscal year. The percentages on the second line (enclosed in parentheses) are based on the number of recipients who reported plans for postdoctoral employment. To the Doctorate Recipient: Congratulations on earning a doctoral degree! This is an important accomplishment for you. Your accomplishment is also significant for both this nation and others, as the new knowledge generated by research doctorates enhances the quality of life in this country and throughout the world. Because of the importance of persons earning research doctorates, several Federal agencieslisted on the coversponsor this Survey of Earned Doctorates. The basic purpose of this survey is to gather objective data about doctoral graduates. These data are important in improving graduate education both at your home institution and beyond. Often, decisions made by governmental and private agencies to develop new programs, or to support present ones, are based in part on the data developed from this survey. This form is distributed by the Graduate Deans and is filled out by all persons who have completed the requirements for a research doctoral degree. Please print your name on the cover if you have not already done so, and then complete this questionnaire and return it to the Graduate Dean. The confidentiality of the information you provide is carefully protected. On behalf of the sponsoring Federal agencies, I thank you for your participation in this survey."}, {"section_title": "Best wishes, Jeanne E. Griffith Director, Division of Science Resources Studies", "text": ""}, {"section_title": "INSTRUCTIONS", "text": "Thank you for taking the time to complete this important questionnaire. Directions are provided for each question. Because not all questions will apply to everyone, you may be asked to skip certain questions. If you have not already done so, please print your name on the front cover. You may use either a pen or pencil. When answering questions that require marking a box, please use an If you need to change an answer, please make sure that your old answer is either completely erased or clearly crossed out. On pages 8 and 9 (inside the back cover) is a Specialties List for classifying your field(s) of specialization in Questions A2, A10, B5, and B9. Thanks again for your help; we really appreciate it. ' t51111LY. 1r IlfalMe IIISM USVICLIMY, vourasumniugucamly, XIII VIDaturgirs, vamanuitinig and each degree earned (fl any). 1E3e sure to give the years your doctord institution(s) and degree at the end. 0 Mark (X) box if bachelor's degree (or equivalent) was never 0 Mark (X) box if master's degree (or equivalent) was never If you have attended more than vir inctitutinnc of Mahar pdurntinn nlancp anntinup thic lict nn tha hawk pnyar e sure to include your doctoral institution."}, {"section_title": "130", "text": "All. Which of the following were sources of money to cover living and/or educational expenses during your doctoral programs? Mark Secondary source of support 0 Mark () if no secondary source A13. When you receive your doctoral degree, how much money will you owe that is s 'redly related to your undergraduate and/or graduate education (tuition and fees, living expenses and supplies, transportation to and from school)? 0 0 None I 0 $5,000 or less 2 0 $5,001 -$10,000 3 0 $10,001 -$15,000 Other -Speeifr 9. Please use the Specialties List (pages 8-9) to enter the name and number of the field in which you will be working. Name of field Mark (X) box if you would like a summary of the results off this survey (available as funding permits). Results of the Survey of Earned Doctorates can be found on the National Science Foundation's World Wide Web page at http://www.nsff.gov/sbe/srs/stats.hton use use the back cover to make any additional comments you may have about this survey. ink you for completing the questionnaire. Please return it to the GRADUATE DEAN Tor forwarding to Survey of ned Doctorates, National Opinion Research Center at the University of Chicano. 11525 East 55th Street. Chicano. 11E, 6060. Should you need to call us, our toll free number is 1-000-248-8649."}]