[{"section_title": "Abstract", "text": "Abstract. In this paper we propose a novel algorithm for the efficient search of the most similar brains from a large collection of MR imaging data. The key idea is to compactly represent and quantify the differences of cortical surfaces in terms of their intrinsic geometry by comparing the Reeb graphs constructed from their Laplace-Beltrami eigenfunctions. To overcome the topological noise in the Reeb graphs, we develop a progressive pruning and matching algorithm based on the persistence of critical points. Given the Reeb graphs of two cortical surfaces, our method can calculate their distance in less than 10 milliseconds on a PC. In experimental results, we apply our method on a large collection of 1326 brains for searching, clustering, and automated labeling to demonstrate its value for the \"Big Data\" science in human neuroimaging."}, {"section_title": "Introduction", "text": "With the advance of MR imaging techniques and the availability of large scale data from multi-site studies such as the Alzheimer's Disease Neuroimaging Initiative (ADNI) [1] and Human Connectome Project (HCP) [2, 3] , brain imaging is now entering the era of \"Big Data\" research [4] . To fully take advantage of the rich source of imaging data, one key challenge is to efficiently organize these data and provide search tools with real-time performance that can quickly find the most similar brains to a query brain. For example, comparing the brain of a patient with a control group of most similar brains has the potential of allowing us to factor out structural differences and improve the signal to noise ratio in disease diagnosis and the detection of treatment effects in drug trials.\nBesides simple measures such as intra-cranial volume, sophisticated comparisons that can take into account more elastic brain differences usually involve nonlinear warping techniques, which can take at least minutes to compute a pairwise registration. To overcome this difficulty, it is essential to develop rich characterizations of the brain with a small footprint to enable efficient calculation. In this work, we propose a novel method to compare the similarity of cortical surfaces based on their intrinsic geometry. We use the Reeb graphs constructed from the Laplace-Beltrami (LB) eigenfunctions of the cortical surfaces as the compact, yet informative, description of the brain [5, 6] . Due to the presence of noise in the Reeb graph, we develop a progressive pruning and matching process based on the persistence of critical points [7, 8] . With our novel method, a similarity measure of two cortical surfaces can be calculated in less than 10 milliseconds in our MATLAB implementation. In our experiments, we demonstrate the potential of our method for \"Big Data\" problems by applying it to find the most similar brains from a collection of 1326 brains. The similarity measure also allows the clustering of cortical surfaces to reveal brain asymmetry in terms of intrinsic geometry. We also demonstrate the potential of our method in automated cortical labeling via intrinsic mapping between a brain and its nearest neighbor.\nThe rest of the paper is organized as follows. In section 2, we introduce the LB eigenfunctions of cortical surfaces and the construction of their Reeb graphs. The persistent Reeb graph matching process is developed in section 3 to compute the similarity between cortices. Experimental results are presented in section 4. Finally, conclusions and future work are discussed in section 5."}]