[{"section_title": "Introduction", "text": "The \"Severe Acute Respiratory Syndrome coronavirus type 2\" (SARS-CoV-2) is an enveloped, singlestranded, positive-sense RNA beta-coronavirus that was discovered in late December 2019. Since then, it has spread out from Wuhan, Hubei province, People's Republic of China, resulting in a global pandemic: the managing of the clinical syndrome elicited by SARS-CoV-2 infection (coronavirus disease 19 or COVID-19) has rapidly become a main stressor for all healthcare systems around the world (1) (2) (3) .\nTimely and accurate COVID-19 laboratory testing is an essential step in the management of the COVID-19 outbreak (4) (5) (6) (7) (8) . To date, both the \"European Centre for Disease Prevention and Control\" (ECDC) and the \"World Health Organization\" (WHO) have recommended the use of an assay based on the reverse-transcription polymerase chain reaction (RT-qPCR) in respiratory samples as gold standard for the COVID-19 diagnosis (4, 5, 7, 9, 10) . Unfortunately, RT-qPCR is usually performed on nasopharyngeal specimens, whose collection requires the use of swabs that is affected by several practical limitations. First at all, nasopharyngeal swabs are relatively invasive, whose collection requires specialized operators as may elicit cough and bleeding, which may increase the risk of healthcare workers infection (11) . Moreover, RT-qPCR is a time-consuming procedure, needing specialized operators and certified laboratories (10) . Such limitation has elicited interest in alternative methodologies for sample collection, and particularly on the use of oral fluids, and particularly saliva (12) . Saliva can be provided by the patients not requiring specialized personnel for its collection, with a more comfortable procedure (13, 14) . Not coincidentally, the US Food and Drug Administration has recently authorized the emergency repurposed use of a RT-qPCR test for assessing the RNA in saliva samples (15) , and there is an increasing number of reports focusing on the repurposing of available diagnostic kits on conventional nasopharyngeal swabs on saliva/oral fluids.\nEven though a growing body of documents addresses the use of saliva as diagnostic sample, performance characteristics of salivary-based RT-qPCR for SARS-CoV-2 diagnosis remain largely uncertain (12, 16, 17) . As conflicting results have been reported, an updated synthesis of the literature is urgently needed to better inform health policies and guidelines. Therefore, the present systematic review and metaanalysis was undertaken to explore the reliability of RT-qPCR diagnostic tests for SARS-CoV-2 based on salivary specimens."}, {"section_title": "Materials and Methods", "text": "This systematic review and meta-analysis of the literature has been conducted following the \"Preferred Reporting Items for Systematic Reviews and Meta-Analysis\" (PRISMA) guidelines (18) . We searched different scholarly databases (namely, PubMed/MED-LINE and EMBASE) as well as pre-print servers including medrxiv.org for relevant studies from inception up to June 1st, 2020, without applying any backward chronological restrictions. The search strategy was a combination of the following keywords (free text and Medical Subject Heading [MeSH] terms, where appropriate): (saliva OR oral fluid) AND (COVID-19 OR SARS-CoV-2 OR Coronarivus) AND (diagnostic OR diagnostic test OR screening).\nRecords were handled using references management software (Mendeley Desktop Version 1.19.5, Mendeley Ltd, London, UK, 2019), and duplicates were removed. Articles eligible for review were original research publications available online or through interlibrary loan. A language filter was applied, by retaining articles written in Italian, English, German, French or Spanish, the languages spoken by the investigators.\nOnly articles (a) dealing with COVID-19 cases diagnosed by means of conventional RT-qPCR tests on rhinopharyngeal swabs (5); (b) analyzing saliva by means of RT-qCPR; (c) reporting the raw number of true positive/true negative, and false positive/ false negative results were eligible for the full review. Two independent reviewers (M.V. and S.R.) reviewed titles, abstracts, and the full text of articles. Titles were screened for relevance with respect to the subject under study.\nAny articles reporting original results, which met one or more of the inclusion criteria, were retained for the full-text review. The investigators independently read full-text versions of eligible articles. Disagreements were resolved by consensus between the two reviewers; when it was not possible to reach consensus, input from a third investigator (M.R.) was searched and obtained. Further studies were retrieved from reference lists of relevant articles and consultations with experts in the field. Data extracted included:\n(1) Settings and characteristics of the study (i.e. diachronous vs. synchronous regarding the original diagnosis for SARS-CoV-2 positivity; case control vs. case-crossover study);\n(2) Characteristics of reference cases where available;\n(3) Characteristics of reference diagnostic test; (4) Characteristics of the RT-qPCR test employed; (5) Total number of true positive, true negative, false positive, false negative cases.\nWe first performed a descriptive analysis to report the characteristics of the included studies. The accuracy of each study was measured as sensitivity (Se), specificity (Sp), positive and negative likelihood ratio (PLR and NLR), diagnostic odds ratio (DOR), accuracy and Cohen's \"kappa\". Sensitivity can be defined as the proportion of positive cases among people with a given disease, and specificity as the proportion of negative cases among people without that disease.\nThe likelihood ratios express the likelihood that a given test result would be expected in a patient with a certain disorder compared to the likelihood of that same result among subjects without that disorder; PLR was calculated by dividing the pooled Se by 1 -Sp; NLR was calculated by dividing 1 -Se by Sp. The DOR expresses how much greater the odds of having the disorder are for the people with a positive test result than for the people with a negative test result. It is a single measure of diagnostic test performance that combines both likelihood ratios by dividing PLR by NLR. Cohen's kappa coefficient is a statistical measure that is used to quantitatively assess inter-rater reliability (and also intra-rater reliability) for qualitative (i.e., categorical) items. In other words, it measures the agreement between two raters who each classify N items into C mutually exclusive categories. Cohen's kappa values < 0.600 suggest \"weak\" to \"none\" agreement, while values 0.600 to 0.799 suggest a \"moderate\" agreement, 0.800 to 0.900 a \"strong\" agreement, and >0.900 an \"almost perfect\" agreement.\nPooled Se, Sp, PLR, NLR, accuracy, Cohen's kappa and DOR were calculated by combining each study's results, using a random-effects model. For DOR, a correction factor of one half was added to each cell to avoid calculation problems by having a value of zero in the 2 × 2 table.\nPotential heterogeneity for threshold effect (i.e., differences in Se and Sp occurring because of differ-ent cut-offs used in different diagnostic kits) was assessed by reporting accuracy estimates from each study in a summary receiver operating characteristic (sROC) space and subsequent visual inspection of the resulting curves: i.e., a substantial difference in curves suggested a possible heterogeneity for threshold effect, while the overlap of curves was reported as a sign of its absence (19) . I 2 statistics were then calculated to quantify the amount of inconsistency between included studies; it estimates the percentage of total variation across studies that is due to heterogeneity rather than to chance. I 2 values ranging from 0% to 25% were considered to represent low heterogeneity, from 26% to 50% moderate heterogeneity and above 50% substantial heterogeneity, being pooled using a fixed-effects model because of the reduced number of samples eventually included.\nTo investigate publication bias, contour-enhanced funnel plots were initially generated: publication bias was evaluated by testing the null hypothesis that publication bias does not exist by means of the regression test for funnel plot asymmetry. The null hypothesis was rejected if the p-value was less than 0.10.\nAll calculations were performed in R (version 3.6.1; R Core Team, 2017. R: A language and environment for statistical computing. R Foundation for Statistical Computing, Vienna, Austria. URL https:// www.R-project.org/) and RStudio (version 1.2.5019, RStudio PBC, 250 Northern Ave, Boston, MA, USA) software by means of meta (version 4.9-9), mada (version 0.5-9), and nsROC (version 1.1) packages. All packages are open-source add-ons for conducting meta-analyses."}, {"section_title": "Results", "text": "The initial literature search yielded a pool of 261 items. After removing duplicates (n = 20), 232 articles were screened by title and abstract. Two hundred articles were removed after title screening, and 32 were subsequently screened by abstract. Seventeen articles were excluded based on abstract screening and, finally, 15 articles were assessed for eligibility, reviewed by full-text. As one article did not report on RT-qPCR analysis of salivary fluids, it was ultimately excluded.\nFourteen studies were eventually retrieved (14, (20) (21) (22) (23) (24) (25) (26) (27) (28) (29) (30) (31) (32) . One of the studies reported data on two diagnostic kits, with two estimates (20) : as a consequence, the present systematic review and meta-analysis included a total of 15 estimates. The process of studies retrieval and inclusion is pictorially shown in Figure 1 .\nThe main characteristics of the studies included in the present systematic review and meta-analysis are reported in Table 1 . Briefly, six of the included reports were preprints (20, 21, (26) (27) (28) (29) , while 8 studies had received a full peer-review process (14, (22) (23) (24) (25) (30) (31) (32) . Overall, 9 studies had a case-control design as included both COVID-19 positive and negative cases (20, 21, 23, 25, 26, (29) (30) (31) (32) , while 5 studies included only patients having received a previous diagnosis of COVID-19 (14, 22, 24, 27, 28) . As a consequence, while sensitivity of tests was assessed on a total of 15 estimates, specificity included only 10 of them, and DOR as well.\nOverall, we retrieved two estimates from the study of Becker et al. (20) , while all other studies includes a single estimate each (14, (21) (22) (23) (24) (26) (27) (28) (29) (30) (31) (32) . In seven estimates (20, 23, 24, 26, 30, 31) , collection of salivary samples was synchronous with diagnostic nasopharyngeal swabs, while in the remaining samples collection of oral fluids followed initial diagnosis of COVID-19 (i.e. diachronous samples) (14, 21, 22, (27) (28) (29) 32, 33) .\nOverall, our meta-analysis included a total of 1118 samples (376 SARS-CoV-2 positive samples vs. 742 SARS-CoV-2 negative samples): the numerosity of every single estimate ranged from 32 to 200.\nConcerning specificity, as shown in Figure 2 , the value ranged from 71.4 to 100%. The pooled estimate was 97.7% (95%CI 93.8-99.2), without significant differences between synchronous (98.0%, 95%CI 95.5 -99.1) and diachronous studies (97.7%, 95%CI 72.6-99.0). The heterogeneity was substantial (I 2 = 74%, p < 0.01), being moderate (I 2 = 31%, p = 0.02) for synchronous studies and again substantial for diachronous ones (I 2 = 89%, p = 0.019).\nAs shown in Figure 3 , the value of sensitivity ranged from 31.3% to 100%. Pooled sensitivity was 83.4% (95%CI 73.1-90.4), resulting from 85.7% (95%CI 72.6-93.2) for diachronous studies, and 80.3% (95%CI 61.8-91.1) for synchronous studies. Heterogeneity was substantial (I 2 , 79%), for both synchronous (I 2 , 81%) and diachronous studies (I2 = 73%).\nFocusing on case-control studies, Figure 4 , sensitivity ranged from 31.2% and 94.0%, with a pooled sensitivity estimated in 80.4% (95%CI 53.9-90.1), resulting from 83.4% (95%CI 59.9-94.4) for diachronous studies, and 78.1% (95%CI 55.5-91.1) for synchronous studies. Heterogeneity was substantial (I 2 , 79%), for both synchronous (I 2 , 81%) and diachronous studies (I 2 = 69%).\nFocusing on cohort studies ( Figure 5 ), sensitivity ranged from 73.8% to 100%. Pooled sensitivity was 87.1% (95%CI 76.1-93.4), resulting from 87.2% (95%CI 70.3-95.1) for diachronous studies, and 89.1% (95%CI 77.8-95.0) for synchronous ones. Heterogeneity was substantial (I 2 , 60%), particularly both diachronous studies (I 2 = 69%), while it was not calculated for synchronous studies as including a single report.\nVisual inspection of contour-enhanced funnel plots (Figure 6 ), suggested a significant asymmetry for all analyses, with subsequent reporting bias. However, regression analysis confirmed a significant reporting bias only for overall analysis of sensitivity (t = 1.8664, df = 13, p value = 0.0847), while it was dismissed for specificity (t = 1.7571, df = 8, p value = 0.117), as well as sensitivity subanalysis both in case-controls (t = 1.7571, df = 8, p value = 0.117) and cohort studies (t = 2.3882, df = 3, p value = 0.969), the latter possibly affected by the reduced number of estimates included in the analyses (i.e. five studies). The forest plot representing the pooled DOR (i.e. 110.562 95%CI 32.720-373.594) from the case-control studies is shown in Figure 7 .\nAs shown in Table 2 , a cumulative PLR or 20.141 (95%CI 8.207; 49.430) was determined, with a correspondent NLR of 0.203 (95%CI 0.094; 0.436), i.e., while a positive test was associated with a relatively strong evidence of disease, a negative one was associated with a reduced chance of being actually affected by SARS-CoV-2 infection. In effect, Cohen's kappa was estimated in 0.75 (95%CI 0.62; 0.88), suggesting that the agreement between rapid tests based on the assessment of serum antibodies and RT-PCR may be assumed to be moderate.\nIn order to exclude that the differences in overall performance may have been associated with a different threshold level among studies, sROC of two distinctive models were determined, either using the overall DOR by combining each study's diagnostic odds ratio (random-effects model, AUC = 0.867), or a fixed (unweighted) method (AUC = 0.896). The slight difference between the symmetric and asymmetric sROC curves indicates that a null to weak threshold effect is present (Figure 8 )."}, {"section_title": "Discussion", "text": "Saliva is an hypotonic fluid secreted by salivary glands, and contains water, electrolytes, mucus, and (16, 34) . Despite its heterogeneous origin and content, saliva is widely used as a diagnostic tool, substituting other biological fluids (e.g. serum and/or urine). More precisely, saliva has been to proposed as a diagnostic tool for various oral and systemic including some viral infections such as dengue, West Nile Fever, Chikungunya, Ebola, Zika virus, and Yellow Fever (16, 34) . Previous studies on the related SARS-CoV-1 have shown that in primates epithelial cells lining gland ducts may be an early target of viral infection (35) , while the presence of considerable quantities of viral RNA has been unequivocally reported in the saliva of infected patients (36) . As some early reports have similarly shown the presence of SARS-CoV-2 in saliva (11, 12, 14, 17, 23, 24, 37) , suggesting the substantial accuracy of human saliva samples for diagnostic purposes (11, 14, 25) , the use of saliva instead of nasopharyngeal specimens for RT-qPCR analysis appear promising.\nIn effect, our meta-analysis has found a moderate diagnostic agreement between conventional nasopharyngeal-based and salivary based RT-qPCR tests (i.e. Cohen's kappa = 0.750, 95%CI 0.62-0.88), with a specificity of 97.7% (95%CI 93.8-99.2) and a test 1-90.4) , the latter being significantly lower than that previously reported in the still unpublished meta-analysis from Czumbel et al (34) (i.e. 91%, 95%CI 80-99). However, such meta-analysis included only 4 of the studies we reported (14, 22, 23, 25) , while a fifth further study was subsequently retracted (38) . In this regard, it should be stressed that in our study we separately analyzed reports having a COVID-19 diagnosis synchronous or diachronous in respect to salivary specimen collection in order to cope with potential heterogeneities in the viral spreading following the disease's onset. Even though eventual estimates were quite similar both for specificity (i.e. 97.7%, 95%CI 72.6-99.9 vs. 98.0%, 95%CI 95.5-99.1, for diachronous vs. synchronous assessment) and sensitivity (i.e. 83%, 95%CI 59.9-94.4 vs. 78.1%, 95%CI 55.5-91.1, and 87.2%, 95%CI 70.3-95.1 vs. 89.1%, 95%CI 77.8-95.0 for diachronous vs. synchronous assessment, in case control and cohort studies, respectively), with extensive overlapping of confidence intervals, such results were not obvious, for several reasons.\nFirst and foremost, despite their \"gold standard\" status, nasopharyngeal specimens are a far from optimal basis for a reliable RT-qPCR analysis. In a recent study on 205 patients with confirmed COV- ID-19 infection, RT-qPCR positivity peaked to 93% in bronchoalveolar lavage specimens, dropping to 72% in sputum, and 63% in nasal swabs, with only a 32% positivity in pharyngeal swabs (39) . As ACE2 receptor is reputed to be nearly ubiquitous in human body, such differences are reasonably due to an inappropriate timing of sample collection in relation to illness onset, as well as to the proficiency in sampling technique (39) (40) (41) . More precisely, oral fluids seem to have a different conversion time compared to nasal swabs (22) , and similarly the persistence of detectable viral RNA in saliva may exceed that reported in nasopharyngeal mucosal cells, without any clinical significance. An incoherence between nasal nasopharyngeal and salivary specimens could therefore occur as a consequence of the diachronous evolution of the disease in the different tissues, with two possible distinctive \"open windows\" for specimen collection. Such potential limitation was ever more important as the source of SARS-CoV-2 in saliva remains largely unknown, with several possible different sources, i.e. debris of the nasopharyngeal epithelium drained into the oral cavity; viral copies secreted from blood plasma into the mouth via the crevicular fluid, an exudate derived from periodontal tissue; direct infection of oral mucosal endothelial cells, which show overexpression of the viral receptor ACE2; endocytosis of viruses and virus-containing exosomes from the circulation by salivary cells, with following release into the salivary lumen by exocytosis (33) . While the high specificity may be explained as a consequence of the deliberate design of primers, specific for the genome sequence of SARS-CoV-2, the relatively low sensibility may found a possible cause in the unavailability of specifically designed diagnostic kits. In facts, it should be stressed that all the study we included in our meta-analysis were performed repurposing diagnostic kits that were not specifically designed for studying salivary specimens. In effect, at 42) has specifically inquired a diagnostic test that was initially designed in order to assess salivary specimens, but such inquiry was excluded from the final sample as not RT-qPCR based. Moreover, the salivary sample collection is not extensively standardized, particularly in such a setting, and the performance of the laboratory analyses may be largely impaired by several associated factors. Preservations solutions are suspected to be particularly critical in respect of their heterogenous ability to protect viral RNA from degradation (20) , and the possible interference with extraction chemistry and qPCR reaction.\nHowever, the analysis of sROC curves may at least partially rule out that test performance may be impaired by the content of viral RNA in the collected specimens, being the latter a consequence of the natural history of viral infection or of the sampling techniques. In effect, the analogies between reported curves, and the substantial correspondence of the AUCs from fixed and random models (0.896 vs. 0.867), collectively hint towards a possible irrelevance of the actual viral RNA load, i.e., it is reasonable that specimens improperly collected, or collected from patients in the very early or very late phases of the infection (i.e., viral clearance) do not have an increased risk to be improp- Figure 6 . Funnel plots for Sensitivity (a, c, d), and Specificity (d) of studies included in the meta-analysis. Visual inspection suggested a significant asymmetry for all analyses, with subsequent reporting bias. However, regression analysis confirmed a significant reporting bias only for overall analysis of sensitivity (t = 1.8664, df = 13, p value = 0.0847), while it was dismissed for specificity (t = 1.7571, df = 8, p value = 0.117), as well as sensitivity subanalysis both in case-controls (t = 1.7571, df = 8, p value = 0.117) and case-crossover studies (t = 2.3882, df = 3, p value = 0.969), the latter possibly affected by the reduced number of cases included in the analyses erly diagnosed as negative when compared to patients appropriately sampled in the proper \"diagnostic open window\" (4).\nNotwithstanding the relative importance of our results, some significant limitations should be stressed. First and foremost, a significant share of sampled studied were retrieved from a pre-print platform (i.e., medrxiv.org) (20, 21, (26) (27) (28) (29) . Second, our meta-analysis did not take in account the presumptive delay between test performing and the reported onset of the symptoms, as not regularly available from index studies. As a consequence, it is possible that most of commercial kits that did not perform particularly well may have been impaired from the source, being employed in an inappropriate timeframe, underestimating their ac- tual sensitivity in optimal settings (12, 25, 43, 44) . As a consequence, we suggest that our results should be retained cautiously and not as a comparative assessment of commercially available kits. Third, the studies included are generally characterized by low numbers and low sample power. Moreover, the pooled sensitivity analysis included both cohort and case-control studies, the former seemly outperforming the latter: as recently stated by Woloshin et al. (40) , use of either known positive or contrived samples may lead to overestimates of the actual sensitivity of the assessed test, since the sample collection may miss infected material in the daily practice. In other words, the eventual pooled estimate for sensitivity in cohort studies may be an overestimate of the actual diagnostic performances, probably more precisely accounted in synchronous case-control studies (i.e. 78.1%, 95%CI 55.5-91.1).\nIn conclusion, albeit promising, the use of available salivary specimens for RT-qPCR studies on suspected COVID-19 cases is currently questionable for clinical purposes, and cannot substitute the conventional collection of nasopharyngeal samples. However, given the limitations of the present review, such as the small number of studies, the small sample sizes and the high, statistically significant amount of heterogeneity among studies, further high-quality research in the field is warranted."}, {"section_title": "Conflict of interest:", "text": "Each author declares that he or she has no commercial associations (e.g. consultancies, stock ownership, equity interest, patent/licensing arrangement etc.) that might pose a conflict of interest in connection with the submitted article. The facts, conclusions, and opinions stated in the article represent the authors' research, conclusions, and opinions and are believed to be substantiated, accurate, valid, and reliable. However, as this article includes the results of personal researches of the Authors, presenting correspondent, personal conclusions and opinions, parent employers are not forced in any way to endorse or share its content and its potential implications."}]