[{"section_title": "Abstract", "text": "Alzheimer disease (AD) 3 is the most common cause of dementia. In the US, AD is the sixth leading cause of death in Americans aged 65 or older. In the US, AD affects an estimated 5.3 million people and is expected to afflict approximately 35 million people worldwide by 2010 (1 ). The global health economic impact of ADrelated dementia is predicted to overwhelm social services in coming decades as a consequence of demographic aging.\nDefinitive diagnosis of AD at postmortem examination of the brain reveals gross and microscopic evidence of neuronal atrophy and the presence of 2 histological hallmarks: amyloid ␤ (A␤)-containing plaques and neurofibrillary tangles. Antemortem diagnosis is based on the presence and progressive worsening of clinical symptoms. Clinical diagnosis is challenging, because other causes of dementia are often difficult to differentiate from AD. Accordingly, researchers are actively evaluating a variety of clinical-, imaging-, and laboratory-based methods to distinguish AD and non-AD dementia through antemortem detection of AD pathology. These methods include MRI to quantify brain atrophy, fluorodeoxyglucose-positron emission tomography to characterize loss of metabolic function, positron emission tomography and single photon emission computed tomography to define amyloid plaque burden, measurement of cerebrospinal fluid (CSF) concentrations of total tau (t-tau) and tau phosphorylated at threonine181 (P-tau 181 ) to detect neuronal degeneration, and measurement of a 42 amino acid isoform of amyloid ␤ (A␤ 1-42 ) in CSF to detect abnormal trafficking of this peptide present in amyloid plaque. Several studies, including the Alzheimer's Disease Neuroimaging Initiative (ADNI), have provided compelling evidence that CSF t-tau, P-tau 181 , and A␤ 1-42 measurements can identify individuals with clinically and pathologically diagnosed AD. Moreover, these studies suggest that these 3 CSF biomarkers can identify asymptomatic individuals and patients with mild cognitive impairment (MCI) likely to progress to AD (2 ).\nIn a new study involving 750 MCI patients, Mattsson et al. (3 ) demonstrated that biochemical evidence of incipient AD pathology based on measurement of CSF A␤ 1-42 , t-tau, and P-tau 181 does indeed detect incipient AD pathology and predict the risk for progression to AD dementia. The results confirm findings of 11 smaller, mostly single-center investigations. The investigators used a case-control study design and stratified patients according to predefined CSF biomarker concentration cutpoints that optimally distinguished previously and independently compared groups of 529 clinically diagnosed AD patients and 304 healthy controls. CSF concentrations of the 3 analytes were measured by various immunoassay techniques at the time patients entered the study. The majority of MCI patients converting to AD during a minimum follow-up period of 2 years had baseline decreased CSF A␤ 1-42 , and increased t-tau and P-tau 181 concentrations relative to the cutpoints. The investigators acknowledged important limitations in the study including (a) lack of a standardized clinical protocol for diagnosis of MCI, (b) lack of a standardized procedure for CSF collection, (c) use of different immunoassay procedures among participating centers with no external QC and use of transformation procedures to correct for performance differences across laboratories, and (d) use of a short minimum 2-year follow-up period before categorizing MCI individuals as being stable or progressing to AD.\nThe implications of the study by Mattsson et al. are important for at least 3 reasons. First, the results confirm that biochemically based diagnosis of AD is plausible long before the clinical symptoms of AD are fully manifest. Second, use of the 3 CSF biomarkers in the study can be expected to improve the power of future prospective clinical trials of investigational treatments for AD by providing greater diagnostic certainty. Finally, and similarly, early detection of incipient AD pathology might also be expected to improve feasibility of"}, {"section_title": "", "text": "Alzheimer disease (AD) 3 is the most common cause of dementia. In the US, AD is the sixth leading cause of death in Americans aged 65 or older. In the US, AD affects an estimated 5.3 million people and is expected to afflict approximately 35 million people worldwide by 2010 (1 ) . The global health economic impact of ADrelated dementia is predicted to overwhelm social services in coming decades as a consequence of demographic aging.\nDefinitive diagnosis of AD at postmortem examination of the brain reveals gross and microscopic evidence of neuronal atrophy and the presence of 2 histological hallmarks: amyloid ␤ (A␤)-containing plaques and neurofibrillary tangles. Antemortem diagnosis is based on the presence and progressive worsening of clinical symptoms. Clinical diagnosis is challenging, because other causes of dementia are often difficult to differentiate from AD. Accordingly, researchers are actively evaluating a variety of clinical-, imaging-, and laboratory-based methods to distinguish AD and non-AD dementia through antemortem detection of AD pathology. These methods include MRI to quantify brain atrophy, fluorodeoxyglucose-positron emission tomography to characterize loss of metabolic function, positron emission tomography and single photon emission computed tomography to define amyloid plaque burden, measurement of cerebrospinal fluid (CSF) concentrations of total tau (t-tau) and tau phosphorylated at threonine181 (P-tau 181 ) to detect neuronal degeneration, and measurement of a 42 amino acid isoform of amyloid ␤ (A␤ ) in CSF to detect abnormal trafficking of this peptide present in amyloid plaque. Several studies, including the Alzheimer's Disease Neuroimaging Initiative (ADNI), have provided compelling evidence that CSF t-tau, P-tau 181 , and A␤ 1-42 measurements can identify individuals with clinically and pathologically diagnosed AD. Moreover, these studies suggest that these 3 CSF biomarkers can identify asymptomatic individuals and patients with mild cognitive impairment (MCI) likely to progress to AD (2 ) .\nIn a new study involving 750 MCI patients, Mattsson et al. (3 ) demonstrated that biochemical evidence of incipient AD pathology based on measurement of CSF A␤ , t-tau, and P-tau 181 does indeed detect incipient AD pathology and predict the risk for progression to AD dementia. The results confirm findings of 11 smaller, mostly single-center investigations. The investigators used a case-control study design and stratified patients according to predefined CSF biomarker concentration cutpoints that optimally distinguished previously and independently compared groups of 529 clinically diagnosed AD patients and 304 healthy controls. CSF concentrations of the 3 analytes were measured by various immunoassay techniques at the time patients entered the study. The majority of MCI patients converting to AD during a minimum follow-up period of 2 years had baseline decreased CSF A␤ , and increased t-tau and P-tau 181 concentrations relative to the cutpoints. The investigators acknowledged important limitations in the study including (a) lack of a standardized clinical protocol for diagnosis of MCI, (b) lack of a standardized procedure for CSF collection, (c) use of different immunoassay procedures among participating centers with no external QC and use of transformation procedures to correct for performance differences across laboratories, and (d) use of a short minimum 2-year follow-up period before categorizing MCI individuals as being stable or progressing to AD.\nThe implications of the study by Mattsson et al. are important for at least 3 reasons. First, the results confirm that biochemically based diagnosis of AD is plausible long before the clinical symptoms of AD are fully manifest. Second, use of the 3 CSF biomarkers in the study can be expected to improve the power of future prospective clinical trials of investigational treatments for AD by providing greater diagnostic certainty. Finally, and similarly, early detection of incipient AD pathology might also be expected to improve feasibility of secondary or even primary prevention trials of candidate therapies in MCI patients or those individuals who are deemed asymptomatic but are worried nonetheless.\nMattsson et al. provide strong recommendations regarding the need to (a) standardize CSF collection and handling procedures, (b) standardize analytical assays for the 3 biomarkers, and (c) establish external proficiency programs to ensure consistent performance across laboratories and time. We endorse these recommendations.\nAlthough several drugs are approved to treat selected symptomatic deficits of AD, no currently approved drug modifies or prevents progression of the underlying pathology and the relentless clinical decline. Several drugs in development are designed to decrease production or increase clearance of A␤ peptides, which, according to the amyloid hypothesis (4 ), directly or indirectly mediate AD pathology. Regardless of mechanism of action or pharmacodynamic activity, regulatory approval of AD therapies is based on clinical outcomes, specifically, meaningful disruption of cognitive decline and the preservation of activities of daily living essential to functional independence. It is hoped that biomarkers will detect and help characterize the disease-modifying effects of investigational therapeutics. These new biomarkers will not substitute for hard clinical outcomes, but as suggested by Mattsson et al. and others, these biomarkers are expected to improve the design and power of AD treatment and prevention trials. Several CSF biomarkers also are being used in translational assessment of new candidate drugs between preclinical experiments and early clinical trials (5 ) . The availability of therapeutics that slow or even stop AD progression will ultimately drive the demand for diagnostics to detect, differentiate, and stage AD pathology and monitor the response to future treatments.\nWe believe the Mattsson et al. study (3 ) provides sufficient justification for using CSF A␤ 1-42 , t-tau, and P-tau 181 to include or exclude demented or MCI patients in prospective studies of potential diseasemodifying treatments. The technical inconsistencies described by the authors can generally be avoided in clinical trials by standardizing specimen collection and handling and by using a single laboratory with a single analytical platform, consistent analytical reagents, and well-defined analytical procedures. We believe the Mattsson et al. study also provides reasons for increased confidence that CSF A␤ 1-42 , t-tau, and P-tau 181 can realistically be used to detect AD-type pathology in routine clinical practice.\nThe disciplined approaches commonly employed by clinical laboratorians and the highest level of laboratory test performance are critical to assuring successful introduction and application of CSF biomarkers of AD into clinical practice. Of the factors influencing the reliability of CSF A␤ , t-tau, and P-tau 181 measurements and interpretation, the following have proven especially important.\nThe time of day that the lumbar puncture (LP) procedure is performed can affect measurement results. According to the consensus view, it is best practice to perform LPs in the morning following an overnight fast to avoid possible diurnal variability and influence of food intake on biomarker concentrations.\nSpecific LP procedure details are important, including selection of a small-gauge needle. Technique is essential to minimize the risk of meningeal tears and a resulting post-LP headache and the possibility of a blood-contaminated CSF specimen.\nThe use of polypropylene CSF collection tubes and aliquot tubes is recommended to avoid surface interactions and variable loss of A␤ and to a lesser degree t-tau and P-tau 181 , which occur with devices made of polystyrene or glass. Loss of these analytes varies by analyte but tends to increase in a time-and temperature-dependent manner.\nDefined sample preparation and shipping conditions include freezing at Ϫ80°C, which should be done quickly after the LP procedure so the CSF sample is at room temperature for only a short time.\nAnalytical factors that are important include wellcharacterized reference materials for standardization of assays (and to eliminate differences in concentrations, purity, and physical state of commercially obtained reference materials), optimization of analytical performance of commercially available immunoassay platforms (i.e., ELISA and Luminex) and reagents, and the minimization of matrix interactions.\nMethod-specific reference intervals or cutoffs may be necessary. Differences noted above often preclude the postanalytical use of conversion factors to harmonize results, as was done in the Mattsson et al. study. Accordingly, method-specific cutoffs or reference intervals are often required. As with other tests, reference intervals may need to be defined, taking into account potentially important factors such as age, sex, and education.\nIn addition to these issues, access to LP must be increased for these CSF tests to be used more widely. This will require changing the attitude of the public and physicians about the use of \"spinal taps.\" Patients participating in the ADNI and other trials have been far more accepting of LP, even repetitive LP, than anticipated. The physician attitude about the LP procedure has proven to be a primary determinant of patient acceptance. Multiple studies have shown that this procedure can be conducted safely, with only minimal risk for minor complications."}, {"section_title": "Inconsistent reimbursement of physicians performing", "text": "LPs is a problem that must be resolved.\nThe emerging study data from the multicenter ADNI study and multiple other single-center studies provide compelling evidence that well-standardized CSF biomarkers can enhance our ability to identify patients with incipient AD pathology. Furthermore the ADNI data suggest that the combined use of these validated biomarkers together with validated imaging modalities can provide a much improved understanding of AD disease progression. These studies suggest that the combined or sequential use of these promising methods will likely improve risk prediction, disease diagnosis, disease staging, and prognosis assessment (6 ) . The development of genuinely disease-modifying therapies for patients and their families will increase the desire of individuals to know their risk for developing AD or the status of suspected or known disease. The Mattsson et al. study has helped open the door to individualized biomarker-based risk stratification of patients in trials of investigational treatments, and it represents an important step in our consideration of these methodologies for use in routine clinical practice."}]