[{"section_title": "Abstract", "text": "Abstract: Using information for 3,562 thoroughbreds listed in Keeneland's 2011 September yearling sale, hedonic pricing models were estimated using both ordinary least squares regression and a Heckman selection model to test the adverse selection hypothesis that vertically integrated sellers whom breed and race are penalised with bid shading relative to sellers whom only breed, ceteris paribus. Though the null hypothesis of no adverse selection was not rejected in the standard regression model, when taking into account censoring due to sellers withdrawing listed yearlings prior to the auction the null hypothesis was rejected. However, the impact of adverse selection was greatly attenuated by bid shading associated with the reputation effect of sellers, both those whom are vertically integrated and those whom just breed horses, willing to accept final bids less than the stud fee further lessening the winner's curse in the auction. This seller type is new to the literature and as such is a key innovation of this research. The models controlled for other observable characteristics of the yearlings as well as those of the seller and the design of the auction."}, {"section_title": "Introduction", "text": ""}, {"section_title": "Industry overview", "text": "The horse racing industry in the USA is an important sector of the economy. Deloitte Consulting (2005) conducted one of the most comprehensive economic impact studies of it to date. Consistent with the previous studies, they employed an input-output modelling approach and estimated a total economic impact of $102 billion in GDP and 1.4 million jobs. According to the 2007 census of agriculture, there were an estimated 4.0 million horses residing on more than 575,000 farms spatially dispersed across all 50 states (USDA-NASS, 2009) . At an international level, the USA exported $468.4 million worth of live horses in 2009, which was over 15 times more than the value of any other type of exported live animals and nearly six times the value of all other exported live animals combined (USDA-FAS-GATS, 2013)."}, {"section_title": "Contribution of study and research implications", "text": "Unlike many sectors of the sports industry, athletes in the horse industry are typically purchased at auction. Horse breeders are represented on the sell side of the auction and race trainers are represented on the buy side. Trainers further develop the athletes for success on the track. Occasionally, a firm that breeds horses also has a racing operation. This vertically integrated firm has an incentive to keep better horses for its own racing operation and sell the 'lemons' on the market. One would then expect to observe bid shading in the auction for horses sold by vertically integrated firms. This is a classic example of the adverse selection problem in economics (Akerlof, 1970) .\nUsing information for 3,562 Thoroughbreds listed in Keeneland's 2011 September Yearling Sale, hedonic pricing models were estimated using both ordinary least squares regression and a Heckman selection model to test the adverse selection hypothesis that vertically integrated sellers whom breed and race are penalised with bid shading relative to sellers whom only breed, ceteris paribus. Though the null hypothesis of no adverse selection was not rejected in the standard regression model, when taking into account censoring due to sellers withdrawing listed yearlings prior to the auction the null hypothesis was rejected.\nHowever, the impact of adverse selection was greatly attenuated by bid shading associated with the reputation effect of sellers, both those whom are vertically integrated and those whom just breed horses, willing to accept final bids less than the stud fee further lessening the winner's curse in the auction. This seller type is new to the literature and as such is a key innovation of this research. The models controlled for other observable characteristics of the yearlings as well as those of the seller and the design of the auction.\nThis research highlights the sport management and marketing implications for both Thoroughbred sellers and buyers. Given sellers wish to maximise the price received in the auction, vertically integrated purveyors must signal that the horses they sell relative to the ones they retain are indeed high quality. Moreover, purveyors, both vertically integrated and otherwise, need to avoid selling horses at auction that may not be worth as much as the stud fee. Buyers wish to minimise the price paid for horses, hence must take full advantage of the information available on the type of sellers at the auction."}, {"section_title": "Literature review", "text": "Besides two papers investigating the determinants of the price of broodmares (Neibergs, 2001; Maynard and Stoeppel, 2007) , every hedonic pricing model for Thoroughbreds has focused on yearlings (Chezum and Wimmer, 1997; Vickner and Koch, 2001; Robbins and Kennedy, 2001; Wimmer and Chezum, 2006; Parsons and Smith, 2008; Plant and Stowe, 2013) . In nearly every study, the price of the horse was modelled as a function of its attributes (i.e., age, pedigree, colour), seller characteristics (i.e., reputation), and auction design (i.e., duration, size).\nA subset of the yearling Thoroughbred research has addressed the adverse selection hypothesis (Akerlof, 1970) in which sellers whom breed and race are expected to receive a price penalty (i.e., bid shading), ceteris paribus, compared to sellers whom only breed (Chezum and Wimmer, 1997; Vickner and Koch, 2001; Wimmer and Chezum, 2006) . The Vickner and Koch (2001) study failed to reject the null hypothesis of no adverse selection indicating that bid shading was not present in the market. In other words, firms whom breed and race had an economic incentive to sell high quality horses at auction and buyers recognised the quality of those horses. However, Chezum and Wimmer (1997) and Wimmer and Chezum (2006) did find evidence of bid shading in their samples.\nThe present study intends to use the lens of vertical integration to help better view the pricing issues in this important segment of the horse racing industry. To date, the microeconomics of vertical integration has not been used in this context. The models developed herein build upon the models in the literature with respect to horse attributes, seller characteristics, and auction design. However, an important contribution is made by further exploring a seller type not yet explored in the literature; purveyors willing to accept selling prices below the stud fee induce further bid shading whether they are vertically integrated or not."}, {"section_title": "Vertical integration and seller types", "text": ""}, {"section_title": "Microeconomic model of firm behaviour", "text": "While it is quite common that horse breeders are diversified horizontally maintaining other lines of business such as boarding, bloodstock research, consignment sales, and transportation, only a subset of breeders has downstream racing operations. Hence they are deemed vertically integrated for the purposes of this study.\n1 While the economics literature is rich and vast in terms of models of vertical control, the work of Chen (2001) , which builds upon the seminal papers of Salop and Scheffman (1987) and Ordover et al. (1990) , is applied here. Consider the following model for downstream racing firms 1 and 2, where firm 1 is also vertically integrated and, as such, has an upstream breeding operation:\nwhere π 1 is the profit function of firm 1 and π 2 is the profit function of firm 2. Firm 1's profit function has two components; the former, (p 1 -m 1 )q 1 (p 1 , p 2 ), is from the sale of a racehorse while the latter, (w 1 -m 1 )q 2 (p 1 , p 2 ), is from the sale of a yearling to firm 2, a race trainer. 2 Let p 1 be the price of firm 1's racehorse and m 1 be the marginal cost of production or, in this specific application, its stud fee. Let w 1 be the price of firm 1's yearling sold to firm 2. Let q 1 (p 1 , p 2 ) be the demand for firm 1's differentiated racehorse where the usual properties are assumed (i.e., ∂q 1 / ∂p 1 < 0 and, given firm 2 sells an imperfect substitute racehorse at price p 2 , then ∂q 1 / ∂p 1 > 0). Let q 2 (p 1 , p 2 ) be the demand for firm 2's differentiated racehorse where the usual properties are assumed (i.e., ∂q 2 / ∂p 2 < 0 and ∂q 2 / ∂p 1 > 0). While Chen (2001) and , later, Chen and Riordan (2007) , demonstrate the flexibility of this general framework in several detailed equilibrium analyses, it is sufficient for the purposes here to note that it is typically inconsistent with the profit maximisation hypothesis for firm 1 to sell a yearling to firm 2 for a price less than the stud fee (i.e., w 1 < m 1 ). First, when w 1 < m 1 the profit from firm 1's upstream breeding operation is negative ((w 1 -m 1 )q 1 (p 1 , p 2 ) < 0). Second, if w 1 < m 1 , firm 2 has the opportunity to lower its price p 2 while keeping its original profit margin and take sales from firm 1 since, by assumption, ∂q 1 / ∂p 2 > 0. Consequently, the profit from firm 1's racing operation, (p 1 -m 1 )q 1 (p 1 , p 2 ), would decline ceteris paribus. Thus, firm 1, in order to maximise profit, would maintain a reservation price for the yearling greater than or equal to the stud fee m 1 ; that is to say the profit from breeding must be nonnegative (i.e., (w 1 -m 1 )q 1 (p 1 , p 2 ) ≥ 0)."}, {"section_title": "Seller types", "text": "The first seller type, adverse selection, has been debated in the aforementioned literature. When adverse selection is viewed through the lens of vertical integration, it suggests that firm 1 would retain a better yearling for its own downstream racing operation as opposed to selling it to firm 2. In the empirical analysis that follows, the incidence of bid shading for firm 1's yearling sold at auction is tested in the manner consistent with Model 7 in Vickner and Koch (2001) . A second seller type is proposed and tested as well. This measure, which is new to the literature, is constructed to test for the incidence of bid shading as well, though it not only applies to sellers whom breed and race but also to sellers whom just breed. If firm 2 observes over time a seller, say firm 1 or another firm whom just breeds, not setting reservation prices, it would have an incentive to shade its bid below the observable stud fee m. If a firm sells yearlings to downstream racing firms at a prices below respective stud fees, it may create a reputation that would induce further bid shading. Without the latter measure, the incidence of bid shading due to adverse selection would be over-stated in absolute value. Thus, the bid shading due to the reputation effect of accepting below-stud-fee final bids should attenuate the adverse selection hypothesis."}, {"section_title": "Data description", "text": "The use of auctions is an age-old mechanism to determine prices and is quite pervasive throughout the global economy, both at auction houses and with online e-commerce technologies, for a wide range of items including wine, automobiles, mineral leases, art, mobile phone licenses, homes, treasury bills, antiques, and memorabilia (Klemperer, 2000) . 3 This particular sale is regarded as the largest in the world for Thoroughbred yearlings. Although, the original auction design included 4,319 yearlings in the sale catalogue, due to missing data for key explanatory variables in the hedonic analysis, the resulting sample of 3,562 usable observations included 3,047 yearlings which received a final hammer price in the sale ring and 515 were labelled by Keeneland as 'out'. The 515 censored observations were deemed 'out' since they did not enter the sale ring at the auction. Table 1 contains the sample mean and standard deviation for each variable used the subsequent hedonic pricing and Heckman selection models. The Keeneland Association, Inc. and the Blood-Horse Publications were the principal sources of data for this study. While both descriptive statistics are reported for the 3,047 complete observations and 515 censored observations, just the former is discussed. For example, final auction hammer price, the dependent variable in the price equations, averaged $70,619 with a standard deviation of $104,476. Price is transformed with a natural logarithm in the hedonic analysis."}, {"section_title": "Final auction hammer price", "text": ""}, {"section_title": "Sex", "text": "An indicator variable was constructed to be one if the yearling was a colt and zero for the base case of filly. It is expected a priori the parameter estimate for this variable be directly related to price. A male horse has considerably more breeding opportunities compared to a female and hence could result in additional income for the buyer. For the sample of 3,047 complete observations, 52% were colts."}, {"section_title": "Colour", "text": "Three indicator variables were constructed for the colour categories of bay, dark bay/brown, and chestnut. The respective indicator variable equalled one if the colour condition was met and zero otherwise. The base case was grey/roan. It is noted approximately 90% of registered Thoroughbreds are some shade of brown (Keeneland, 2011) . For the sample of 3,047 complete observations 91% were a shade of brown. A priori, it is unclear if premiums or discounts are awarded based on colour in the Keeneland September 2011 Yearling Sale so that result will be discussed in the empirical results. "}, {"section_title": "Age", "text": "Yearling age is measured in days. The mean age was 545 days with a standard deviation of 33 days in the sample of 3,047 complete observations. The breeding cycle for Thoroughbreds is a closely managed process given the manner in which they are aged and the duration of their career in racing. For example, consider Hip #4 in the Keeneland sales catalogue. It was a bay colt with Kentucky-based sire distorted humour and dam Rockcide. Circa mid-February 2009 Rockcide was sired by distorted humour for a stud fee of $150,000. The gestation period for horses is approximately 11 months and this colt was born on January 16, 2010. Exactly 350 days later, on January 1, 2010, this colt was considered one-year old as all Thoroughbreds share the same January 1st birthday. The colt was led through the sale ring 253 days later on September 11, 2011 in the Keeneland September Yearling Sale. He was the fourth horse marketed that day as denoted by his Hip number. The final auction hammer price was $550,000. His racing career would begin in 2012 when he would race as a two-year old. A priori, it is expected that age be directly correlated with price; older and hence more developed yearlings are expected to receive a higher price, ceteris paribus. Age is transformed with a natural logarithm in the hedonic analysis."}, {"section_title": "Stud fee and location", "text": "Also, given the breeding cycle, the 2009 stud fee was used as a proxy of the quality of the sire. The mean stud fee was $37,862 with a standard deviation of $36,440 in the sample of 3,047 complete observations. It is expected a priori that stud fee be directly correlated with price (Shapiro, 1983) . Stud fee is transformed with a natural logarithm in the hedonic analysis. If the stud was located in the state of Kentucky in 2009, then an indicator variable to denote this geography equalled one and zero otherwise. Given the prominence of the Kentucky Thoroughbred breeding industry it is expected a priori the parameter estimate for this variable be positive."}, {"section_title": "Engagements", "text": "Two of the most common engagements listed in the sales catalogue for this auction were the Breeders' Cup and National Thoroughbred Racing Association (NTRA). Respectively these accounted for 87% and 10% of the yearlings listed in the catalogue for the sample of 3,047 complete observations. Two indicator variables were constructed for the respective engagement. The indicator variable equalled one if the condition was met and zero otherwise. Because of the prestige of such racing engagements, it is expected a priori the parameter estimate will be positive for each variable."}, {"section_title": "Reputation", "text": "Indicator variables were also constructed to account for the individual reputation effects for each of the eleven largest consignors. Clearly, Taylor Made and Lane's End were the two largest consignors, with respective means of 11% and 10% of the marketed yearlings in the sample of 3,047 complete observations. Similarly, the eleven largest consignors accounted for approximately one-half of the yearlings marketed. A priori, it is unclear whether an individual consignor's reputation would result in a premium or discount relative to the base case. That is left as an empirical issue."}, {"section_title": "Seller type", "text": "As discussed previously, two measures are used to control for seller type. First, vertically integrated sellers whom breed and race are expected, a priori, to receive a price discount relative to sellers whom only breed. This is the adverse selection hypothesis. Consistent with Model 7 of Vickner and Koch (2001) , an indicator variable was constructed to equal one for vertically integrated sellers and zero otherwise. In the sample of 3,047 complete observations, 22% of the yearlings were sold by vertically integrated firms. The second seller type is unrelated to vertical integration and is new to the literature. Since Keeneland collects data on those yearlings for which the reserve price was not attained (i.e., a code of RNA is designated in the Keeneland database), it is possible to partition the sample of 3,047 complete observations into two groups; those that had a RNA designation and those that did not. If a yearling was designated as RNA in the database, a reserve price was set by the seller and the final auction hammer price was less than that reserve price. If a yearling was not designated as RNA in the database, it is unobservable to the econometrician and the buyer whether or not a reserve price was originally set by the seller. However, since the 2009 stud fee is observable, it is possible to determine which yearlings had a non-RNA final auction hammer price that was less than the 2009 stud fee. The incidence of this phenomenon is next summed by seller to create a count of the number of times a seller was observed to accept a non-RNA price less than 2009 stud fee. This new measure then becomes the basis of a second seller type in the model. A priori, it is expected this count is inversely related to final auction hammer price. In other words, a seller that exhibits this behaviour is more likely to attract bid shading, ceteris paribus. The count is transformed with a natural logarithm in the hedonic analysis. Since some of the counts by seller equalled zero, the value of one was added to each count prior to the transform as is customary.\nThe approach to model final auction hammer prices employed here parallels that of Wimmer and Chezum (2006) yet differs in several important ways. First, Wimmer and Chezum (2006) investigated a 10 percent random sample of all Thoroughbreds born in 1993, whereas the models herein were estimated with all usable observations from the Keeneland 2011 September Yearling Sale. Second, Wimmer and Chezum (2006) narrowed the scope of their investigation to just the adverse selection hypothesis. The models developed in this study not only consider the adverse selection hypothesis but also the effect of sellers, both vertically integrated sellers and sellers whom just breed, willing to accept non-RNA prices below the 2009 stud fee. Moreover, the stud fee, which is an important explanatory variable in every paper in this literature given it is a proxy for pedigree, was not included in Wimmer and Chezum's (2006) models. This represents a major shortcoming and introduces omitted variable bias into their results."}, {"section_title": "Auction design", "text": "With respect to auction design, eleven indicator variables were constructed to control for the various sessions of the auction. Sessions 1 and 2, called the 'select portion of the sale' due to the better bloodlines being marketed, were combined into one indicator variable while the other ten were kept separate (Keeneland, 2011) . The base case was session 13 and represented the last day of the auction. Throughout the theoretical auction design literature it is repeatedly emphasised that a model should be custom-tailored to the auction being studied as findings from generalised models that ignore institutional details are less meaningful (Rothkopf et al., 1990) . That sentiment is especially underscored for empirical studies. It is expected, a priori, the parameter estimates on earlier sessions be greater than those for later sessions. The marketing department at Keeneland Association, Inc. designs an auction to intentionally organise perceived higher quality horses into the earlier days or sessions. This is the standard practice by auctioneers belonging to the Society of International Thoroughbred Auctioneers (SITA, 2011). SITA's International Cataloguing Standards Committee strives to achieve uniform practices across auction houses in designing auctions to aid buyers, sellers, and other market participants. By attempting to rank order by perceived quality by day, the market participants, especially buyers, can better determine in which session to bid. Boasting nearly one-half of a billion dollars from live horse exports in 2009, the US equine industry is decidedly international (USDA-FAS-GATS, 2013). Many buyers travel great distances to inspect and procure horses in person given the magnitude of the investment at stake. Rosen (1974) is typically credited with a formal presentation of the hedonic pricing methodology. He extended the theory of Lancaster (1966) in which consumers were theorised to receive satisfaction from the underlying product attributes rather than the quantity of the product consumed (Taylor, 2003) . The stylised hedonic pricing model of Thoroughbred yearlings, consistent with Rosen (1974) , is given by: (  ,  ,  ) ."}, {"section_title": "Hedonic analysis", "text": ""}, {"section_title": "Price f Yearling Attributes Seller Characteristics Auction Design", "text": "The yearling attributes include gender, colour, age, stud fee, geographic origin, and racing engagements. The seller characteristics include individual consignor reputation effects, vertical integration, and the count of non-RNA prices below the 2009 stud fee. Finally, auction design includes indicator variables for various sessions of the auction. Using the sample of 3,047 complete observations, equation (3) is estimated with ordinary least squares (OLS) and White's (1980) heteroskedasticity-consistent standard errors using the Stata/SE 14.2 software (Cameron and Trivedi, 2009 ) with a log-log functional form. Table 2 catalogues the parameter estimates and robust standard errors for the OLS-based hedonic pricing model. The parameter estimate for colt was found to be positive as expected a priori and statistically significant (p < 0.01). A colt yielded a 23.23% premium over the base case of a filly. Relative to the base case of the grey/roan colour, those yearlings that were some shade of brown sold at a discount, ceteris paribus. In the case of bay and dark bay/brown yearlings, the discount was statistically significant at the 1% level, and for chestnut yearlings the discount was statistically significant at the 10%. Taken collectively, the F-test for the null hypothesis that all three parameter estimates for colour simultaneously equalled zero was, not surprisingly, rejected (p < 0.01); the F-statistic was 5.54. However, the parameter estimate for yearling age was found to be statistically insignificant (p > 0.10). The parameter estimate for stud fee was found to be statistically significant (p < 0.05) and, as expected a priori, positive. This result is consistent with numerous other studies in the literature. The parameter estimate for the geographic location of the sire in 2009 was found to be statistically insignificant (p > 0.10). Only the Breeders' Cup racing engagement was found to be statistically significant (p < 0.01) and, as expected a priori, positive. The F-test for the null hypothesis that both parameter estimates for racing engagement simultaneously equalled zero was rejected (p < 0.01) with an F-statistic of 11.69. Seller behaviour was modelled with the set of eleven individual consignor indicator variables, the vertical integration indicator variable, and the count of non-RNA prices below the 2009 stud fee. The latter two form the principal empirical results of this paper. Seven of the eleven parameter estimates for the consignor indicator variables were statistically significant (five at the 1% level and two at the 10% level), and all but one (i.e., Airdrie Stud) were positive. Taken collectively, with a F-statistic of 5.59, the null hypothesis that all eleven parameter estimates for consignor effects simultaneously equalled zero was rejected (p < 0.01). Regarding the test that vertically integrated sellers whom both breed and race received a price discount relative to sellers whom only breed, the null hypothesis of no adverse selection was not rejected (p > 0.10); the parameter estimate of -0.0731 was statistically no different than zero given its relatively large robust standard error of 0.0649. This finding was consistent with all of the adverse selection test results in Vickner and Koch (2001) and just the OLS model presented in Wimmer and Chezum (2006) , but was inconsistent with the findings in Chezum and Wimmer (1997) . Finally, the parameter estimate on the count of non-RNA prices observed below the 2009 stud fee was negative, as expected a priori, and statistically significant (p < 0.01). Thus, as this count increased, the price received by the seller decreased, ceteris paribus. Hence this seller type attracted bid shading as hypothesised. 2.0276*** 0.0866 ------Notes: Single, double, and triple asterisks (*) denote statistical significance at the 0.10, 0.05, and 0.01 levels, respectively. White's heteroskedasticity-consistent standard errors are in parentheses next to the parameter estimates. The dependent variable in the price equation is ln(Price). Based on the combined full sample of 515 censored and 3,047 complete observations. (33) 4470.07*** Notes: Single, double, and triple asterisks (*) denote statistical significance at the 0.10, 0.05, and 0.01 levels, respectively. White's heteroskedasticity-consistent standard errors are in parentheses next to the parameter estimates. The dependent variable in the price equation is ln(Price). Based on the combined full sample of 515 censored and 3,047 complete observations."}, {"section_title": "OLS model results", "text": "In terms of auction design, the marketing department at Keeneland did an excellent job of sorting yearlings in the sales catalogue by session consistent with SITA's International Cataloguing Standards Committee (SITA, 2011). The parameter estimate for the indicator variable representing the first two sessions was positive, as expected a priori, and statistically significant (p < 0.01). The other ten parameter estimates were also positive and statistically significant (p < 0.01), and generally decreased in value as the auction progressed to the last session. Finally, the intercept of the model was positive and statistically significant (p < 0.01). The overall goodness-of-fit measure for the model was 0.5925. The F-test for the null hypothesis that all 33 slope parameter estimates simultaneously equalled zero was rejected (p < 0.01). The F-statistic was 152.81 with 33 numerator degrees of freedom and 3,013 (i.e., 3,047 -34) denominator degrees of freedom."}, {"section_title": "Heckman selection model results", "text": "Using the full sample, combining the 515 censored observations and the 3,047 complete observations, equation (3) was also estimated with the Heckman (1979) selection modelling methodology. 4 The selection equation was assured to not be identified by functional form alone since the seller type variable introduced in this paper measuring the count of non-RNA prices below the 2009 stud fee was by definition excluded for the 515 censored observations. Moreover, in the preliminary estimations of the Heckman selection model, it was noted that the auction design indicator variables consistently were found to be statistically insignificant (p > 0.10). Hence, as shown in Table 3 , only the indicator variable for combined sessions 1 and 2 was included in the final selection equation. 5 The parameter estimates for the Heckman selection model were obtained using full maximum likelihood estimation with White's (1980) robust standard errors.\nIn the price equation, the parameter estimate for sex of the yearling was found to be statistically significant (p < 0.01), and, as expected a priori, positive. A colt sold for 20.91% more than a filly, ceteris paribus. In the selection equation the parameter estimate was statistically insignificant (p > 0.10). Similar to the findings in the OLS model, the parameter estimates corresponding to the bay and dark bay/brown colours in the price equation were negative and statistically significant (p<0.01). In the selection equation, just the parameter estimate corresponding to the chestnut colour was statistically significant (p < 0.10). Its negative value indicated chestnut-coloured yearlings, ceteris paribus, were less likely to be taken out of the auction. In both the price and selection equations, the parameter estimate for age was found to be statistically insignificant (p > 0.10). In the price equation, the parameter estimate for stud fee was found to be statistically significant (p < 0.05), and, as expected a priori, positive. However, in the selection equation, the parameter estimate for stud fee was not statistically significant (p > 0.10). The parameter estimate for geographic origin of the sire, in both the price and selection equations, was not found to be statistically significant (p > 0.10). The parameter estimate for the Breeders' Cup engagement was found to be positive and statistically significant (p < 0.01 and p < 0.05, respectively) in both the price and selection equations. The price equation result corroborated the result observed in the OLS model. The fact this parameter estimate was positive in the selection equation was the first piece of evidence in support of the adverse selection hypothesis; better quality yearlings eligible for the Breeders' Cup were more likely to be taken out of the auction ceteris paribus. In both the price and selection equations, the parameter estimate for the NTRA engagement was found to be statistically insignificant (p > 0.10).\nAs was observed in the OLS model, individual consignor effects were influential in the price equation of the Heckman selection model; seven of the parameter estimates were statistically significant with five being positive and two negative. In the selection equation, only the parameter for Gainesway was statistically significant (p < 0.05) and negative; yearlings marketed by Gainesway were less likely to be taken out of the auction, ceteris paribus.\nThe null hypothesis of no adverse selection was rejected (p > 0.05) in the price equation; the parameter estimate was negative indicating that vertically integrated sellers received a price discount, ceteris paribus, relative to those sellers whom only breed. This finding was consistent with the results from the Heckman selection model presented in Wimmer and Chezum (2006) and the OLS model in Chezum and Wimmer (1997) . In the selection equation, the parameter estimate was found to be positive and statistically significant (p<0.05); yearlings marketed by vertically integrated sellers were more likely to be taken out of the auction. Again, this result corroborated the adverse selection hypothesis and was consistent with the findings in Wimmer and Chezum (2006) . Finally, the parameter estimate for the count of non-RNA prices observed below the 2009 stud fee was negative in the price equation, as expected a priori, and statistically significant (p < 0.01). The count was inversely related to price, ceteris paribus, indicating bid shading was directed toward this type of seller. By definition, the parameter was not estimable in the selection equation since the 515 censored observations did not receive a price in the auction. In order to quantify the effect of this seller type on the adverse selection hypothesis, its effect was removed from the model by restricting its parameter estimate to zero. The Wald test statistic for this hypothesis test, distributed Chi-squared with one degree of freedom, was 29.25 and statistically significant (p < 0.01). In the absence of this seller type, which is in fact new to the literature, the parameter estimate for vertically integrated sellers was found to be -0.2891 and statistically significant (p < 0.01) in the price equation. In absolute value, this was nearly double the magnitude of the respective parameter estimate reported in Table 3 . Hence, controlling for this seller type served to attenuate the effect of adverse selection. In other words, in the absence of this seller type, the bid shading behaviour attributed to adverse selection was overstated in absolute value. The parameter estimate for vertically integrated sellers remained about the same in the selection equation as originally reported in Table 3 ; it was found to be 0.2065 and statistically significant (p < 0.05) when the parameter estimate for the count of non-RNA prices observed below the 2009 stud fee was restricted to be zero.\nSimilar to the OLS model, the auction design variables performed quite well in the price equation. Those parameter estimates were positive, statistically significant (p < 0.01), and generally decreasing in value as the auction progressed. However, in the selection equation, as mentioned earlier, the auction design variables did not perform well. The parameter estimate for the first two sessions was statistically insignificant (p > 0.10).\nThe intercept in the price equation was found to be statistically significant (p < 0.01) and positive as it was in the OLS model, yet statistically insignificant (p > 0.10) in the selection equation. The inverse Mills ratio (λ) was found to be negative and statistically significant (p < 0.01) indicating that sample selection bias was present in the OLS model in Table 2 . The parameter ρ was also found to be negative and statistically significant (p < 0.01) indicating the price and selection equations were inversely correlated. The Wald test of the independence of the price and selection equations (i.e., ρ = 0) was rejected with a test statistic of 195.81 (p < 0.01). Finally, the Wald test of joint significance of the 33 slope parameters in the price equation was found to be statistically significant (p < 0.01)."}, {"section_title": "Summary, conclusions, and future research", "text": "Hedonic pricing models were estimated using both OLS regression and a Heckman selection model to test the adverse selection hypothesis using information for 3,562 thoroughbreds listed in Keeneland's 2011 September Yearling Sale. The null hypothesis of no adverse selection was not rejected in the OLS regression model. However, after taking into account yearling censoring with the Heckman selection model, the null hypothesis of no adverse selection was rejected. The impact of adverse selection, however, was greatly attenuated by bid shading associated with the reputation effect of sellers, both those whom are vertically integrated and those whom just breed horses, willing to accept final bids less than the observable 2009 stud fee. This seller type is new to the literature and as such is a key innovation of this research. The models controlled for other observable characteristics of the yearlings, individual seller reputation effects, and the structure of the auction.\nThis research highlights the sport management and marketing implications for both Thoroughbred sellers and buyers. Given sellers wish to maximise the price received in the auction, vertically integrated purveyors must signal that the horses they sell relative to the ones they retain are indeed high quality. To help avoid bid shading, vertically integrated sellers could signal to buyers that they have in fact historically brought high quality yearlings to the auction by highlighting the racing success of those sales graduates.\n6 Marketing tools for the breeding operation, such as company Web sites and social media, are easily and quickly updated as new racing results are accumulated for their sales graduates. Moreover, purveyors, both vertically integrated and otherwise, need to avoid selling horses at auction that may not be worth as much as the stud fee. Both would benefit by setting a reservation price equal to the stud fee. Accepting a final hammer price below the observable stud fee invites further bid shading as shown empirically in this study. The reservation price mechanism is hence another marketing tool to help change the reputation of the seller. Buyers wish to minimise the price paid for horses. Hence they must take full advantage of the information available on the type of sellers at the auction. If they observe vertically integrated sellers at the auction trying to sell 'lemons', they must employ a bid shading strategy. Further, if buyers detect a pattern of sellers accepting final auction hammer prices below the observable stud fee, they would again benefit from bid shading and lessen the winner's curse.\nWhile this study introduced a new explanatory variable to the literature and leveraged Heckman selection modelling techniques to address a set of hypotheses in the extant literature, there are many future directions to pursue for both new data and econometric methodologies. It would be of interest to apply this modelling paradigm to other types of Thoroughbred auctions, such as the Ocala Breeders' Sale Company's Selected Sale of Two-Year-Olds in Training or Keeneland's April Two-Year-Olds in Training Sale. Similarly, one could apply this modelling paradigm to quarter horse auctions as they are commonly used in the horse racing industry (Lansford et al., 1998) . With respect to other econometric methodologies, using extended regression models (ERMs) in the justreleased Stata/SE 15 software, it would be possible to treat explanatory variables such as age as endogenous and do so in both the price and selection equations. Moreover, one could also estimate the price and selection equations in Table 3 using a Bayesian implementation of the Heckman selection model."}, {"section_title": "Notes", "text": ""}, {"section_title": "1", "text": "It is recognised that some breeders may not be purely vertically integrated but rather be vertically coordinated in that they participate in racing syndications and do not fully own the underlying racehorse asset, but do own some nonzero share of it. The term vertical integration is used to characterise both situations in this study. In the event the seller set a reservation price, the buyer does not incur the winner's curse unless the final hammer price exceeds that unobservable reservation price. 4\nIn the Heckman selection model, the inverse Mills ratio λ and the parameter ρ were also included as is customary. 5 Those preliminary results are available upon request from the author. 6\nThe term sales graduate refers to a horse that was sold by an upstream breeder."}]