[{"section_title": "", "text": "between studies,(2-4) and this heterogeneity is not due to chance alone (p<0.001).\n(2) One meta-77 analysis of 26 studies estimated an IFR of 0.68% (0.53-0.82%) while cautioning this was likely 78 an \"underestimate\" and another meta-analysis with 61 studies estimated a median IFR of 0.26%, 79 outside the range of the first meta-analysis.(2, 3) 80 Other studies have suggested the variability in infection fatality ratio is more consistent when 81 infections are stratified by age, but is more likely to vary between studies when considering the 82 population above age 65.(4-6) In fact, one paper even estimated that \"differences in age structure 83 of the population and the age-specific prevalence of COVID-19 explain nearly 90% of the 84 geographical variation in population IFR.\"(4) 85 Although vulnerable age groups should be protected as recommended by the U.S. Centers for 86 Second, even within the same hospital systems, there are strong time trends in case fatality rate 90 after adjusting for baseline characteristics/risk (7) even at the national scale (8), which authors 91 attributed to better treatment. Unless baseline risk adjustments were inadequate, there are likely 92 time trends in IFR, which would also help reconcile the disparate estimates noted in the two 93 meta-analyses cited above. 94 Another possibility is severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) virulence 95 could differ across geographic locations because some local strains have higher or lower 96 virulence than others. Previous reports have argued that evolution of attenuated strains is 97 expected for RNA viruses and that \"determination of naturally circulating attenuated CoV-2 variants is an urgent matter.\" (9) Previous publications on evolution of virulence 99 observed that pathogens transmitting with a respiratory route (unlike vector-borne diseases) 100 typically evolve toward lower virulence after emergence because healthier hosts tend to engage 101 in more social contact.(10) 102 Using publicly available data from GISAID (Global Initiative on Sharing Avian Influenza Data), 103 we interrogate the relationship between SARS-CoV-2 variants and associated patient outcomes 104 in the GISAID metadata. We differentiate between severe and mild patient outcomes and utilize 105 a logistic regression model in order to better understand how viral genomic SARS-CoV-2 SARS-CoV-2 genome sequences were obtained from GISAID (Global Initiative on Sharing All 111 Influenza Data) on October 21, 2020 (11, 12), (GISAID Acknowledgments Raw GISAID patient data was parsed from the JSON file using Python (version 3.8.2). Patient 121 outcomes were then aggregated into positive (\"Mild\") outcomes or negative (\"Severe\") 122 outcomes (detailed in Supplemental Figure 1 ). Briefly, \"Mild\" outcomes included: Outpatient, 123 Asymptomatic, Mild, Home/Isolated/Quarantined, and Not Hospitalized. \"Severe\" outcomes 124 included: Hospitalized (including severe, moderate, and stable) and Deceased (Death). Patient 125 outcomes that were unclear or empty were not included in our analyses. 146 We collected a total of 155,958 viral genomes along with clinical metadata. The metadata 147 included numerous entries whereby the severity of the condition could not readily be discerned."}, {"section_title": "148", "text": "For example, \"recovering\", \"recovered and released\", and \"mild symptoms inpatient for 149 observation\" were found in the raw data and were not included. The full downloaded dataset Figure S1 ) by recoding the observational metadata into consistent terminology and creating a \"Severe\" class of \"deceased\", 154 \"hospitalized\", \"ICU\", and \"pneumonia\" (n=2,870); and a \"Mild\" class of \"outpatient\", \"mild\", 155 \"epidemiology study\", \"asymptomatic\", \"screening\", and \"stable in quarantine\" (n=767). 85% of 156 these genomes had at least one variant associated with patient outcome. Viral sequences were 157 obtained from the six major geographical regions in GISAID between January and October 2020 158 (Supplemental Figure S2 )."}, {"section_title": "159", "text": "SARS-CoV-2 variants associated with \"Severe\" / \"Mild\" outcome categories 160 The overwhelming majority of variants in the SARS-CoV-2 genomes assessed were rare, with 161 only 12 common variants with at least a 5% minor allele frequency ( Figure 1C ). Two of these 162 common variants (C26735T and C28311T) were associated with \"Severe\" or \"Mild\" outcomes, 163 as measured by having an odds ratio of greater than 2 or ≤0.5, respectively. We also observed 84 164 of 157 rare variant associations with \"Severe\" or \"Mild\" outcomes. Collectively, 17 variants 165 were associated with \"Severe\" classification with at least an odds ratio of 2, while we found 67 166 associations with \"Mild\" classification (OR≤0.5). The variants associated with outcomes were 167 distributed across the genome, including the strongest \"Severe\" association within the C-terminal 168 end of the spike protein ( Figure 1B ). The majority of variants characterized here were transitions 169 (121, 71%), with 47% of those transitions (79) being C>T (Supplemental Figure S3 ). All This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10. 1101 /2020 we found that the c-statistic for predictions based on age or age and gender are only slightly 176 better than random chance at 0.677 (0.642-0.712) and 0.679 (0.644-0.714), respectively. We 177 hypothesized that viral genomic variants in the virus could also contribute to severity 178 classification. When accounting for the region of collection, we observed an increased c-statistic 179 to 0.817 (0.817-0.818). Previous observations show that regions tend to be dominated by 180 individual viral clades, and we found that adding clade to an age/gender/region model resulted in 181 moderate improvement of accuracy (81% vs. 86%, respectively) with a nearly identical AUC of outcomes. In addition to the improvement in c-statistic, we compared the accuracy of our 188 predictions, which started at 81% for the age-only model and improved to 86% and 88% for each 189 additional step in the model building before finally reaching a maximum at 91% accuracy for the 190 age/gender/region/variant model."}, {"section_title": "191", "text": "Classifications based solely on age or on age and gender resulted in insignificant odds ratios in 192 our models. Both models had the same odds ratio (4.4), confidence interval (2.8-6.0), and p-193 value (0.072). However, the other three models all had significant odds ratios with p-values less 194 than 0.0001. Consistent with the AUC results, the odds ratio was greatest for the full model 195 (age/gender/region/variant) followed by age/gender/region/clade and finally age/gender/region This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101/2020.12.01.20242149 doi: medRxiv preprint patient classified as \"Mild\" developing \"Severe\" symptoms (-LR=0.039) as compared to a 199 moderate reduction in the post-test outcomes for the age-only or age and gender models (-200 LR=0.231 for both models)."}, {"section_title": "202", "text": "Discussion: 203 We demonstrate that including genomic viral variants can substantially improve classification of 204 COVID-19 patient outcomes as compared with models using only age and region. Moreover, in 205 our models, we observe that some individual variants are particularly important with substantial 206 associations with severity, and that collectively these variants are not rare."}, {"section_title": "207", "text": "Associations between viral genomic variants and patient outcomes are not unexpected."}, {"section_title": "208", "text": "Consistent with known patterns in the evolution of virulence in RNA viruses (9, 10, 23), we 209 would expect many common strains have differing association with patient severity by this point 210 in the pandemic by chance alone and even as sampling is more likely to occur with severe 211 outcomes, variants correlated with mild outcomes are still being identified. This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020.\nwith an additional ~1% drop in mouse body weight with each selection (26). Based upon these 221 findings and the large number of passages in the human outbreak, it can be expected that 222 significant evolution affecting virulence could occur in the SARS-CoV-2 genome. wanted to take an agnostic approach to characterize all variants correlated with severity so that 240 they could be further resolved with additional study and additional surveillance (particularly 241 among asymptomatic cases). These studies, in addition to comprehensive prognostic study, could 242 better clarify how unexpected a patient's severity was as compared with additional risk factors. This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101/2020.12.01.20242149 doi: medRxiv preprint For example, one mutation we identified (C13620T) is associated with 5.9 times the odds of This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10. 1101 /2020 We also identified that the C28311T mutation was associated with a lower odds ratio of 0.14."}, {"section_title": "267", "text": "This mutation lies within the probe of the N1 assay in the CDC's PCR assay (43) This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101/2020.12.01.20242149 doi: medRxiv preprint that are more likely to experience severe symptoms or require intensive medical resources (e.g., 290 inpatient hospitalization and ventilation) may be able to help healthcare systems allocate 291 resources to the regions with the most critical needs. Therefore, by providing a molecular risk 292 factor for more severe outcomes, these findings could help prioritize limited treatment supplies 293 to those at greatest risk, particularly as therapeutic interventions for infectious disease often need 294 to be given early in the disease course (e.g., empiric antivirals for influenza)."}, {"section_title": "295", "text": "There are limitations with our analyses. First, the SARS-CoV-2 genomes uploaded to GISAID 296 are not necessarily representative of all circulating genomes, which can introduce a selection or 297 sampling bias into our analyses based on region, patient severity, or other unmeasured factors. In 298 Supplemental Figure S2 we show the sampling patterns over time by our patient severity 299 categorization. We sought to mitigate these limitations by eliminating the categories that had 300 ambiguous severity (e.g., \"live\" or \"recovered\"), and adjusting the associations for known 301 confounders. In addition, we do not seek to make causal claims about any specific viral genomic 302 variant. In aggregate these variants are predictive of outcome and the candidates we identify can 303 be further studied using molecular and other methods."}, {"section_title": "304", "text": "In summary, we have demonstrated that some SARS-CoV-2 genomic variants are strong 305 predictors of COVID-19 disease severity, and these variants appear to be commonly circulating."}, {"section_title": "306", "text": "This study provides a rationale for prioritizing control efforts for cases and populations 307 manifesting with unusually high severity, consistent with symptom-based criteria for testing used 308 by the CDC. Longitudinal monitoring of genomic variants within a novel pathogen such as 309 SARS-CoV-2 will be important for understanding drivers and effects of its evolution and 310 ultimately, its spread or control. This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101/2020.12.01.20242149 doi: medRxiv preprint This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101/2020.12.01.20242149 doi: medRxiv preprint This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101/2020.12.01.20242149 doi: medRxiv preprint This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101 https://doi.org/10. /2020 This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity."}, {"section_title": "Figure Legends", "text": "The copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101 https://doi.org/10. /2020 This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101 https://doi.org/10. /2020 This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101 https://doi.org/10. /2020 This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101/2020.12.01.20242149 doi: medRxiv preprint This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101/2020.12.01.20242149 doi: medRxiv preprint This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ;"}, {"section_title": "482", "text": "for use under a CC0 license. This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101/2020.12.01.20242149 doi: medRxiv preprint This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101/2020.12.01.20242149 doi: medRxiv preprint This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101/2020.12.01.20242149 doi: medRxiv preprint This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101/2020.12.01.20242149 doi: medRxiv preprint This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101/2020.12.01.20242149 doi: medRxiv preprint This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity."}, {"section_title": "Supplemental Figure Legends", "text": "The copyright holder for this preprint this version posted December 3, 2020. This article is a US Government work. It is not subject to copyright under 17 USC 105 and is also made available (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted December 3, 2020. ; https://doi.org/10.1101/2020.12.01.20242149 doi: medRxiv preprint"}]