[{"section_title": "Introduction", "text": "The Chukchi Sea, north of the Bering Strait, represents an important transition zone between waters of the Pacific and Arctic Oceans. It is seasonally ice covered, subject to strong atmospheric forcing, and has distinct topographic features including canyons and shoals that influence the circulation (Fig. 1). In order to understand how Pacific water impacts the interior Arctic, including the ventilation of the halocline, the melting of pack-ice, and the distribution of nutrients, it is crucial to determine the hydrographic processes on the Chukchi shelf and how the water masses evolve, including the role of air-sea-ice interaction. This will help improve our knowledge of the Pacific-Arctic relationship and how this might change in a warming climate. Although northeasterly winds prevail in the Chukchi Sea, the mean flow through Bering Strait is northward due to the sea-level difference between the Pacific and Arctic Oceans (Coachman and Aagaard, K., 1966). Over the decade of the 2000s, the transport has increased from 0.7 Sv to 1.1 Sv due largely to the pressure head across the strait (Woodgate et al., 2012). There are three distinct water masses originating from the Bering Sea that flow northward through Bering Strait: Alaskan Coastal Water, Bering Shelf Water, and Anadyr Water. They are believed to follow topographically steered pathways through the Chukchi Sea en route to the Arctic basin (Woodgate et al., 2005;Weingartner et al., 2005; Fig. 1). Warm and fresh Alaskan Coastal Water (ACW) is advected northward by the Alaskan Coastal Current (ACC) and thus is usually found on the eastern side of the Chukchi shelf. The ACC is a narrow (10-20 km wide), surface-intensified, coastally trapped current that originates from run-off and river discharge into the Gulf of Alaska and Bering Sea; it is present in the region from late-spring until early-autumn. The other two Pacific water masses (nutrient-rich Anadyr Water and colder, fresher Bering Shelf Water) mix to some degree just north of Bering Strait forming a product which in summertime is known as Bering Sea Water (Coachman et.al, 1975) or Bering Summer Water (BSW), identifiable by its high nutrient content. 1 The BSW is believed to split into two branches: one progressing northward through the Central Channel towards Hanna shoal, and the other veering northwestward into Herald Canyon. Ultimately all of the Pacific water on the Chukchi shelf reaches the shelfbreak where, in the absence of strong wind forcing, it turns to the right forming a jet along the edge of the Chukchi Sea (Mathis et al., 2012) and Beaufort Sea (Nikolopoulos et al., 2009). There is also evidence of westward flow of BSW south of Wrangel Island (Woodgate et al., 2005), but such a permanent pathway through Long Strait still lacks verification. In addition to the poleward-flowing branches of Pacific-origin water in the Chukchi Sea, the Siberian Coastal Current (SCC) is a quasi-permanent equatorward-flowing jet (Fig. 1) that is fed by cold and fresh Siberian river discharge (termed Siberian Coastal Water, SCW). Wind strongly influences this current as well, and two different modes of the SCC can be distinguished: a fully developed SCC with a sharp hydrographic front under westerly (downwelling favorable) winds, and a weakened (or absent) current with a less distinct hydrographic front when the winds are easterly (upwelling favorable). When the SCC reaches the vicinity of Bering Strait it is believed to separate from the coast and mix with the ambient shelf water (primarily the BSW), although there have been occasional measurements of SCW in Bering Strait and even south of the strait (Weingartner et al., 1999). during the survey, the variability on the shallow shelf was too large for these samples to be useful for calibrating the conductivity sensors. To assess the accuracy of the CTD salinity measurements, the values measured by the dual conductivity sensors were regressed against each other (first excluding depths shallower than 10m, then excluding depths shallower than 30 m.) An initial regression line was determined, then all values outside the three standard deviation envelope were discarded and the regression was calculated again. The standard deviation of the resulting scatter, which is taken as a rough measure of the salinity accuracy, ranged between .0053 using measurements deeper than 30m and .0088 using measurements deeper than 10 m. Velocity data were collected using a dual lowered acoustic Doppler current profiler (ADCP) system with an upward-and downward-facing KHz RDI Workhorse instrument. The data were processed using the Lamont Doherty Earth Observing system software. Based on the accuracy of the GPS unit used on the ship, the velocities have a formal accuracy of 4 cm/s. However, previous comparisons of LADCP data with finely-tuned shipboard ADCP data suggest that the accuracy was in fact better than this. The barotropic tidal signal was removed from each velocity profile using the 5 km Arctic Ocean Tidal Inverse Model (AOTIM-5) of Padman and Erofeeva (2004). Water sample nutrient data (nitrite, nitrate, ammonium, silicate, phosphate) were collected at 6 to 8 different depths through the water column at each station (Yun et al., 2014). These data were processed onboard using an automated nutrient analyzer (ALPKEM RFA model 300) following Whitledge et al. (1981). Vertical sections of potential temperature and density (referenced to the sea surface), salinity, and nutrients were constructed for each of the 11 transects using a Laplacian-Spline interpolator with a grid spacing of 5-15 km in the horizontal and 5 m in the vertical. Vertical sections of absolute geostrophic velocity were constructed by referencing the thermal wind shear to the lowered ADCP data. In particular, at each grid point along the section the vertically averaged thermal wind velocity was matched to the vertically averaged cross-track ADCP velocity. The patterns in the resulting absolute geostrophic velocity sections were very similar to those in the de-tided vertical sections of lowered ADCP velocity, indicating that the ageostrophic component of the directly measured velocity was small (and that the tidal corrections were accurate)."}, {"section_title": "Mooring Data", "text": "Moorings have been maintained regularly on the eastern (US) side of Bering Strait since (Woodgate et al., 2006). Starting in 2004, as a part of the RUSALCA program, additional moorings were added to the western (Russian) side (Fig. 2b). We use data from the 2008-9 and 2009-10 deployments, when there were three moorings across the western channel and four moorings across the eastern channel (additionally there was a mooring roughly 65 km north of the Diomede islands). The moorings were equipped with a variety of instruments measuring temperature, conductivity, velocity, ice motion and thickness, and bio-optics (Woodgate, 2009). All records were year-round with the exception of some shallow temperature records which ended prematurely due to ice damage. Temperature and conductivity were measured by Sea-Bird 16+ and Sea-Bird 37 sensors, with a time interval ranging from 15-60 minutes. Velocity was measured using a combination of 300 kHz and 600 kHz RDI ADCP instruments. Depth was derived from pressure sensors, or in some cases based on mooring design considerations. The timestamps were corrected for observed instrument clock drift. The Sea-Bird sensors were calibrated pre-and post-deployment, as were the ADCP compasses. For details regarding the processing of the mooring data and the accuracy of the sensors, the reader is referred to http://psc.apl.washington.edu/HLD/Bstrait/bstrait.html."}, {"section_title": "World Ocean Data Base", "text": "To investigate the origins of the various water masses on the Chukchi shelf, historical temperature, salinity and silicate data for the study area from 1920 to 2013 were extracted from World Ocean Database (WOD) of the National Oceanographic Data Center. The database consists mainly of Russian and American data from bottle casts, CTD stations, moored buoys, and expendable temperature probes. All of the data have been systematically integrated, standardized, and quality-controlled (see Johnson et al., 2013)."}, {"section_title": "Atmospheric Reanalysis Fields and Satellite Data", "text": "We use the North American Regional Reanalysis (NARR, Mesinger, 2006) sea level pressure data and 10 m winds to study the atmospheric conditions in the region. The reanalysis fields are defined on a polar stereo grid, hence the resolution is independent of latitude. The spatial resolution of the data is 32 km and the temporal resolution is 6 hours. NARR uses newer data assimilation techniques and more advanced modeling procedures than those employed by the original National Centers for Environmental Prediction (NCEP) global reanalysis product. Sea ice concentration data and sea surface temperature (SST) fields from the blended Advanced Very High Resolution Radiometer (AVHRR) and the Advanced Microwave Scanning Radiometer (AMSR) product are used in the study. The temporal resolution of the AVHRR-AMSR product is once per day, and the spatial resolution is 0.25°. Combining data from microwave and infrared sensors helps avoid data gaps in cloudy regions as well as reduce systematic biases in cloud-free areas due to the different nature of their errors (Reynolds et al., 2007). The accuracy of the sea ice concentration data is estimated to be ±10% (Cavalieri et al., 1991)."}, {"section_title": "Bottom Depth Data", "text": "Our study employs the new Alaska Region Digital Elevation Model (ARDEM) bathymetric data set. This is a recent product with nominal 1-km grid spacing over the domain 45°N-80°N and 130°E-120°W (Danielson et al., 2008). It is believed that this product more accurately represents some of the detailed bathymetric features in the study region than the coarser resolution databases."}, {"section_title": "Numerical model configuration", "text": "An idealized configuration of the MITgcm primitive equation model (Marshall et al. 1997) is used to help interpret the shipboard observations and assess the sensitivity of the water mass distributions to the wind forcing. The model is configured in a 1000 km by 1200 km domain with uniform horizontal grid spacing of 2.5 km (Fig. 3). The model has 12 levels in the vertical with uniform grid spacing of 5 m. There is a large island that represents Alaska and a smaller peninsula that extends from the western boundary representing the west side of the Bering Strait. The model Bering Strait is 100 km wide and lies between the island and the western peninsula. The bottom topography is flat (40 m depth) over most of the domain, with a slope around the island that shoals to 10m over a horizontal scale of 30 km. Herald Canyon is represented by a narrow region of deeper bathymetry that extends north of the strait and deepens from 40 m to 60 m depth (Fig. 3). There is also a region along the northern boundary where the topography descends from 40 m to 60 m, meant to represent the shelfbreak. The Coriolis parameter is 1.2x10 -4 s -1 and taken to be constant. Calculations have also been carried out with a deep basin to the north of y=1200 km, and the resulting circulation and water mass distributions are essentially the same as reported here. Horizontal viscosity is parameterized using a Smagorinsky scheme with a nondimensional coefficient of 2.5 (Smagorinsky, 1963). Vertical viscosity is 10 -4 m 2 s -1 . The lateral boundary conditions are no-slip, and a quadratic bottom drag of 10 -3 is applied. Statically unstable profiles are vertically mixed with an enhanced vertical diffusion coefficient of 1000 m 2 s -1 . A linear equation of state is used with a thermal expansion coefficient of 2x10 -4 o C -1 ."}, {"section_title": "Salinity is constant.", "text": "The model temperature is forced by restoring terms in the region south of the island between x=375 km and 750 km. Over the sloping bottom the temperature is restored towards 13 o C from the surface to the bottom within 20 km of the southern extent of the island, and it is restored towards 3 o C south of that. This temperature difference, together with a thermal expansion coefficient of 0.2 kg/m 3 C, results in a density change between the Bering Strait interior and the coastal current of 2 kg/m 3 , which is typical of the observed density difference during the time period of interest. The meridional velocity is restored towards -0.8 m/s between y=500 km and 1000 km to the east of the island. The model is started from rest with a uniform temperature of 3 o C and run for a period of two years. The resulting velocity field is essentially steady with an anti-cyclonic circulation around the island. The transport streamfunction is shown in Figure 3. The flow is barotropic over the flat bottom, with a surface intensified baroclinic current over the sloping bottom (the model equivalent of the ACC; vertical sections are shown later). The mean transport through the model strait is 1 Sv, which is approximately the observed late-summer transport through Bering Strait. North of the strait there is a northward-flowing jet positioned over the canyon transporting approximately 0.3 Sv. Between this and the ACC is a broad, weaker anti-cyclonic flow over the flat portion of the shelf. The steady state in Figure 3 provides the initial condition for a set of wind perturbation calculations that are carried out in section 4. In these model runs a southward wind stress is applied that is uniform west of x=260 km with a value of τ max , decreasing linearly from τ max to zero between x=260 km and x=900 km, and is zero to the east of x=900 km (there is no meridional variation). The winds are ramped up rapidly to τ max using a hyperbolic tangent function with a decay scale of 1 day, kept constant for approximately 4 days or 9 days (depending on the calculation), then ramped back down to zero with a decay scale of 1 day. For these wind-driven simulations the model is integrated for a period of 70 days starting from the initial state of Figure 3."}, {"section_title": "Observational Results", "text": ""}, {"section_title": "Water mass definitions", "text": "Due to the shallow bathymetry, seasonal presence of ice, large freshwater discharge from rivers, and high sensitivity of the flow to atmospheric conditions, the water mass characteristics in the Chukchi Sea vary on both short and long time scales. Despite this, we were able to define approximate temperature/salinity (T/S) boundaries for the major water masses present in 2009, using previous definitions found in the literature as a guide (adjusted for this particular survey) in addition to the geographical occurrences of the water. To further refine these boundaries it was necessary to use silicate, which is a relatively conservative tracer of Pacific water originating from the Gulf of Anadyr. Overall, our water mass definitions are only slightly altered from those used by Coachman et al. (1975) for the Chukchi Sea and those adopted by Pickart et al. (2010) for the region near Herald Canyon (see Fig. 4). We now discuss each of the water masses in turn, including their vertical and lateral distributions on the Chukchi shelf in late-summer/early-fall 2009. These patterns are placed in broader geographical context by considering the historical data from the WOD, which further elucidates the origins of the water."}, {"section_title": "Vertical distributions of the water masses", "text": "We present four of the shipboard vertical sections occupied in 2009, progressing from Bering Strait to the northwest towards Wrangel Island (the sections are highlighted in Fig 2a): Bering Strait (BS); Chukchi South (CS); Herald Canyon 2 (HC2, in the central part of Herald Canyon); and Long Strait (LS). Only two of the water masses were observed flowing northward through Bering Strait, the ACW and BSW (the BS section was occupied at the end of the cruise, Fig. 11). In general the ACW occupied the upper layer while the BSW resided in the lower layer (Fig. 5). The ACW was warmer, fresher, and markedly lower in silicate. Flow speeds were quite large, in excess of 70 cm/s on the western side of the strait. On the next section to the north (CS, Fig. 6) these two water masses were still present, with the ACW again occupying the upper portion of the water column. However, fresh SCW was present next to the Siberian coast, which was higher in silicate than the ACW (which partly helped to identify this water mass). This is because of terrestrial sources of silicate along the Siberian Coast (Codispoti and Richards, 1968). Notably, the temperature of the SCW was comparable to the ACW, likely due to partial mixing of these two water masses in the vicinity of the strait (typically SCW is colder than both ACW and BSW, Weingartner et al., 1999). The absolute geostrophic velocity shows the surfaceintensified SCC flowing toward Bering Strait, while the other two water masses were flowing to the north, although much more slowly than in the BS section (generally less than 5 cm/s). This is due to the fact that the shelf widens considerably north of Bering Strait (Fig. 2a), and also because of the northeasterly winds before and during the occupation of the CS section ( Fig. 11), which tend to retard the northward flow. At the HC2 section, which spans Herald Canyon, the two summer Pacific water masses ACW and BSW are present, but only occupy the eastern flank of the canyon (Fig. 7). At this northern location the two layers are now thinner (the ACW is only 20 m thick compared to 40 m in Bering Strait), but they are still clearly distinguishable in T/S/silicate space (as they were to the south). They are progressing northward quite swiftly (order 20 cm/s) due to the lateral constriction of the canyon. The most prominent water mass in the canyon, however, is the cold and salty RWW which is elevated in silicate due to its contact with the nutrient-rich bottom sediments. This water mass was flowing fastest through the canyon, with the highest velocities (order 30 cm/s) in the deepest part of the channel. The final water mass present in Herald Canyon is the relatively cold and fresh surface (0 -30 m) MW. This water was also flowing (weakly) northward, which suggests that it originated from ice melt in the region north and west of Wrangel Island, where there was still a small concentration of sea ice during the cruise. This is consistent with the circulation scheme discussed in Pickart et al. (2010) whereby anti-cyclonic flow around the island feeds the head of the Herald Canyon on its western flank. The final section that we highlight is the LS transect. Here the dominant water mass is the SCW which stretches across the entire km width of the strait (Fig. 8). As expected, the SCC is flowing strongly towards Bering Strait adjacent to the coast with flow speeds exceeding 30 cm/s in the upper layer (although near the bottom there is a weak flow reversal). As the SCW progresses from Long Strait to the CS section the amount lessens, extending only km from the coast, and its T/S properties moderate considerably: the temperature increases from 3.5 o C to 4.5 o C and the salinity increases from 25 to 29 ( Fig. 6). Curiously, in the LS section there is a second branch of the SCC also flowing towards Bering Strait adjacent to Wrangel Island, which to our knowledge has not been previously observed (e.g. Weingartner et al., 1999). The other water mass present in Long Strait is the RWW, situated along the bottom. As in the HC2 section this water is cold, salty, and elevated in silicate. The RWW was flowing westward toward the East Siberian Sea on the southern side of the strait, and, for the most part, flowing eastward toward the head of Herald Canyon on the north side of the strait. We address the lateral pathways and transports of the different water masses in section 3.4."}, {"section_title": "Historical distributions and water mass origins", "text": "Using data from the WOD as a guide, we now assess how representative the water mass distributions in September 2009 were compared to their historical presence in the region. It should be noted, however, that there are caveats regarding the WOD data in this region. Firstly, the data coverage compared to other areas in the World Ocean is relatively sparse, especially on the Russian side of the Chukchi shelf. Secondly, some of the water masses being considered here are oftentimes present only over a limited portion of the water column (for example the layer of ACW in the Herald Canyon 2 section is confined to the upper 20-25 m, Fig. 7). This means that some of the older WOD bottle data, with relatively coarse resolution, could miss the occurrence of certain water masses. Thirdly, synoptic variability can bias the interpretation of the historical data. However, as seen in Table 1, the data coverage in our domain spans a large number of years for each of the water masses considered, and, as seen below, clear trends emerged from the data base. Water mass Years ACW 1935, 1937, 1938, 1946, 1947, 1948, 1949, 1950, 1953, 1955, 1956, 1957, 1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1970, 1971, 1972, 1975, 1976, 1977, 1978, 1982, 1983, 1985, 1986, 1987, 1988, 1989, 1992, 1993, 1994, 1995, 1996, 2000, 2001, 2007, 2013BSW 1934, 1937, 1950, 1958, 1960, 1963, 1964, 1968, 1969, 1970, 1973, 1978, 1983, 1984, 1986, 1987, 1988, 1992, 1993, 2003SCW 1946, 1948, 1950, 1952, 1954, 1955, 1956, 1957, 1959, 1961, 1962, 1963, 1964, 1965, 1966, 1970, 1971, 1976, 1986, 1987, 1988, 1989, 1992, 1993, 1995, 2013RWW 1938, 1946, 1947, 1950, 1953, 1954, 1955, 1956, 1957, 1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1976, 1977, 1984, 1985, 1986, 1987, 1988, 1989, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2002, 2003, 2012, 2013 Table 1. Years when the water masses considered in the study were present in the WOD within the domain of interest. We limit our temporal coverage to late-summer (August/September) except for the BSW which is considered for the full year (although no BSW was found outside the months of June-October). This is because it was necessary to use silicate in order to identify the BSW, and the amount of nutrient data is somewhat sparse in the WOD. Using the identified T/S, silicate and depth ranges for 2009 we selected all of the individual water samples from the database that fell into our water masses definitions. As seen in Figure 9a (red circles), the ACW is present primarily along the Alaskan coast, extending from the eastern Bering Sea all the way north past Icy Cape in the Chukchi Sea. This is not surprising due to the fact that the ACC is formed predominantly from coastal run off along the Alaskan coast. Note that there are a few ACW points in the Gulf of Anadyr and along the Siberian coast. These may be real (rare) instances of this water mass, or it could be that our T/S classification scheme is not appropriate for all of the years in the historical data base (even for the 2009 survey our water mass boundaries are somewhat subjective). But the main message in Figure 9a is that ACW is primarily advected northward in the ACC and is rarely found on the western Chukchi shelfin stark contrast to 2009 where we observed this water mass in Herald Canyon. The distribution of the SCW in the WOD (blue circles in Fig. 9a) shows how this water mass is geographically distinct from the ACW. As expected it is found all along the Siberian coast from Long Strait to Bering Strait. Near Bering Strait it spreads onto the shelf, which is consistent with the notion that the SCC retroflects to the north here and mixes with the Pacific waters flowing into the Chukchi Sea via Bering Strait. The WOD suggests that SCW is rarely, if ever, found in the Bering Sea. However, there is evidence that this water mass is advected northward in the Central Channel flow branch (Fig. 1), and that it can also be found in the vicinity of Wrangel Island, as was the case in 2009 (Fig. 8). The presence of the high-silicate BSW in the WOD (green circles in Fig. 9b) shows that it emanates primarily from the Gulf of Anadyr and progresses through the Chirkov Basin into the western side of Bering Strait, consistent with previous studies (e.g. Coachman et al., 1975;Danielson et al., 2014). There is another known pathway for this water to enter the Strait via the south side of St. Lawrence Island (Coachman et al., 1975), which also shows up in Figure 8b. We reiterate that our precise water mass boundaries in Fig. 4 might blur the boundary of two water types that are adjacent to each other in T/S/silicate space, such as BSW and RWW. Consequently it may be that some of the water immediately south of St. Lawrence Island identified as RWW in Figure 9b is in fact BSW. North of the Bering Strait the WOD data suggest that BSW can spread across a wide portion of the Chukchi shelf. The final water mass considered here, the RWW, is detected in large amounts in the northwestern Bering Sea and the northern portion of the Chukchi Sea (yellow circles in Fig. 9b). It is known that WW (near the freezing point) is formed south and west of St. Lawrence Island (e.g. Muench et al., 1988), and then flows northward through Bering Strait until early summer (Woodgate et al., 2012;von Appen and Pickart, 2012). As the summer continues, this water mass is transformed into RWW as it progresses northward across the Chukchi shelf. This is the result of mixing with more swiftly flowing Pacific summer waters that have passed through Bering Strait after June, and also due to solar heating at this time of year (Gong and Pickart, 2015). This implies that in August/September there should be little RWW present in the southern Chukchi Sea, which is the case in Figure 9b. (The small amount of RWW near the southeastern Siberian coast is close in properties to BSW and thus could be misidentified). The substantial presence of RWW in the northern Chukchi Sea at this time of year is not a surprise. This water mass is regularly observed on the northeast part of shelf due to its slow progression around Hanna Shoal (e.g. Weingartner et al., 2013;Gong and Pickart, 2015). It is also observed in Herald Canyon (e.g. Kirillova et al., 2001). The distribution of RWW in Fig. 9b is consistent with the notion that winter water is also formed via polynya activity in the vicinity of Wrangel Island (Pickart et al., 2010), and also perhaps in the East Siberian Sea, and then drains through Herald Canyon to the north. This is not to say, however, that some of the RWW in Herald Canyon in Fig. 9b did not emanate from Bering Strait (e.g. Weingartner et al., 2005). Notably, there is a significant amount of RWW in late-summer in the northwestern Bering Sea in the WOD. This suggests that there is a long residence time of some of this water in the region south of St. Lawrence Island, which is consistent with previous studies (Danielson and Kowalik, 2005)."}, {"section_title": "Lateral pathways and volume transports", "text": "We now present a lateral view of the different water masses observed during the 2009 RUSALCA survey which can be compared to the above geographical distributions seen in the historical data. The four water types are shown in the four panels of Figure 10, where we have overlaid transport vectors per unit width corresponding to the water masses in question. These were computed using the vertical sections of absolute geostrophic velocities and properties (note that the transport arrows in Figure 10 are constrained to be normal to the station pairs). It is well known that the circulation on the Chukchi shelf is highly sensitive to synoptic wind forcing. For example, the flow through Bering Strait can reverse to the south on time scales of a day under the influence of northerly winds (Woodgate et al., 2005), while the flow in Central Channel and Barrow Canyon can do the same (Pickart et al., 2011). Models indicate a similar sensitivity (e.g. Winsor and Chapman, 2004;Spall, 2007). The wind varied significantly during the 2009 cruise, and in Figure 11 we have plotted the value of the 10-m wind at each station during the time of occupation of the station (within the 6-hour resolution of the NARR reanalysis data set). As seen, (2010) who showed that much of the Pacific summer water is diverted eastward away from the canyon to the north of Herald Shoal. Mixing may also play a role here since the ACW comes in contact with ice melt water as it flows northward through the canyon. Note that the transport of ACW was southward on the eastern ends of both the CL and CS transects ( Fig. 10a vectors), which is where the northward-flowing ACC normally resides. This was undoubtedly due to the northerly winds before/during these transects. The model results of Winsor and Chapman (2004) show a similar disappearance of the Pacific water coastal pathway under such winds. Note, however, that the local wind was not strong enough to reverse the transport of ACW through Bering Strait. This could be related to the remote effect of atmospheric forcing in the Bering Sea that influences the flow in Bering Strait via northwardpropagating shelf waves (Danielson et al., 2014). Strikingly, the transport of ACW measured during the RUSALCA survey was stronger on the Russian side of Bering Strait (Fig. 10a). This is in contrast to many previous shipboard sections (e.g. Gong and Pickart, 2015) and mooring data (Woodgate et al., 2012), which indicate that the ACC typically flows on the US side of the strait. It is also at odds with the historical WOD distribution (Fig. 9a) showing a concentration of ACW on the eastern side of the strait. The lateral distribution of BSW in 2009 ( Fig. 10b) was closer to what was expected based on the WOD distribution of this water mass. After entering Bering Strait, the water veered to the northwest directly into Herald Canyon. As with the ACW, the transport of BSW decreased substantially along this pathway, and virtually none of it was present near the mouth of the canyon. BSW was also absent on both boundaries of the southern Chukchi Sea (i.e. the ends of the CL and CS sections), which is not surprising because it is not normally found in the SCC or the ACC. However, there was one notable exception to the norm for the BSW: the transport of this water mass was strongest on the US side of the Bering Strait (Fig. 10b), whereas historically it is strongest on the Russian side ( Fig. 9b). Hence, in late-September 2009, the ACW and BSW had transposed sides of Bering Strait. This is elaborated on below. The occurrence of SCW in the 2009 RUSALCA survey was in some regards straightforward, but in other respects curious. As mentioned earlier, the SCC does not exist every summer, but when it is present it is a well-defined surface-intensified current flowing towards Bering Strait associated with a hydrographic front (Weingartner et al., 1999). The front is formed by the fresh, buoyant SCW adjacent to the coast and the saltier, denser shelf water offshore (e.g. Fig. 6). The lateral map for SCW is consistent with this scenario, with equatorward transport all along the Siberian coast (Fig. 10c). The overall decrease in transport from the LS section to the CS section (with no presence of this water in Bering Strait), is in line with the historical view (Weingartner et al., 1999) and consistent with the WOD distribution of SCW in Fig. 9a. However, the transport of the SCC is typically small, about 0.1 Sv (Weingartner et al., 1999), whereas in our survey we measured values three times greater than this. This is likely due to the downwelling favorable winds during much of the cruise, which would accelerate the current (see also Weingartner et al., 1999). The curious aspect of the SCW in 2009 was its presence around Wrangel Island. As noted above, the LS section showed a jet of SCW flowing eastward on the north side of Long Strait (Fig. 8). The lateral map of Figure 10c indicates that this water mass was also flowing southward on the eastern side of Wrangel Island (i.e. at the western end of the CEN line). This demonstrates that there can be a more circuitous path (with a significantly longer residence time) for SCW to advect from its coastal source in the East Siberian Sea to the Bering Strait, likely due in part to the anti-cyclonic circulation that typically encircles Wrangel Island (Pickart et al., 2010). The presence of RWW in the 2009 RUSALCA survey is consistent with the view given by the historical WOD data for late-summer (compare Figs. 10d and 9b). In particular, RWW was found all around Wrangel Island, while none of it was present in the southern Chukchi Sea. Shipboard data from the 2004 RUSALCA Herald Canyon survey showed markedly less of this water mass than in 2009. However, the 2004 survey was a month earlier in the season and WW was prevalent in the canyon (i.e. before it had moderated to RWW). As explained in Pickart et al. (2010), the WW entered the head of the canyon on its western flank, and, as the water progressed northward, it switched sides of the canyon. Although not evident in the lateral map of Figure    (10d), we observed a similar phenomenon in 2009. Relatively warm RWW (> -0.8 o C) was entering on the western side of the head of the canyon at HC1, and, by the time it reached HC3, it had transposed to the eastern side. Pickart et al. (2010) argued that the source of the winter water feeding the head of the canyon in late-summer was a reservoir of dense water formed by the Wrangel Island polynya the previous winter. Consistent with this notion, the 2009 CEN section reveals RWW flowing towards the canyon (i.e. the same water that switches sides of the canyon farther north). Pickart et al. (2010) also observed some WW flowing to the south up Herald canyon on its western flank in 2004, entering from the mouth. In the survey relatively cold RWW (< -1.2 o C) was found on the western side of the canyon (at HC2 and HC3). While one might presume that this colder water also entered via the mouth, the flow vectors in Figure 10d are not conclusive. In fact, the HC4 section indicates an outflow of RWW on the western side of the canyon mouth. Intriguingly, RWW was measured flowing eastward on the north side of Wrangel Island on the WN section (Fig 10d) at depths shallower than the canyon. This is in line with the polynya origin scenario, put forth by Pickart et al. (2010), whereby the winter water flows anticyclonically around the island before entering the head of the canyon. A final notable aspect of the RWW in 2009 is that an anti-cyclonic eddy containing this water mass was observed in the central portion of section HC4 (i.e. north of the canyon mouth). This is marked as the \"eddy\" in Figure 10d. The vertical section (not shown) reveals the familiar hydrographic structure of a cold-core anti-cyclone, i.e. the type that is commonly observed along the shelfbreak of the Chukchi and Beaufort Seas (e.g. Pickart et al., 2005). The presence of the eddy at this location is significant because it implies that Pacific water can get fluxed directly into the basin from Herald Canyon via turbulent processes, which occur in Barrow Canyon as well (Pickart and Stossmeister, 2008). As mentioned earlier, we also observed AW and MW during the September 2009 survey. These water masses are not included in Figure 10 because their presence was restricted to the northern part of Herald Canyon. In particular, AW was found only at the deepest stations of HC4 underlying the RWW at depths greater than 100m ( Fig. 2a). Curiously, this water was characterized by elevated concentrations of silicate (normally AW is depleted in silicate, which is one of the reasons why this nutrient is a good tracer of Pacific water; Rudels et al., 1991). Since the AW is in contact with the bottom here, and the flow through the canyon can be quite strong at times, it is likely that the silicate was obtained locally near the canyon mouth through mixing with the sediment pore water. MW was found as far south in the canyon as HC2 (see Fig. 7). It was likely mixing with the ACW, BSW, and RWW, which is not represented in Figure 4 (where we have defined distinct boundaries between the different water masses)."}, {"section_title": "Conditions in Bering Strait a) Timeseries of hydrography and flow", "text": "As described above, the conditions in Bering Strait during the occupation of the 2009 RUSALCA BS section were atypical. ACW was found predominantly on the Russian side of the strait, extending throughout the water column at the western-most station (Fig. 5). Furthermore, the ACC at the time was bottom-intensified due to the downward-sloped isopycnals towards the Siberian side of the strait, which is opposite of the normal surface-intensified ACC adjacent to the US coast. At the same time, BSW was most prominent on the eastern side of the strait, which is also not the typical scenario. One wonders if this anomalous configuration in the strait was present only briefly near the time that the section was occupied, or if these conditions occurred more often during the summer. This can be addressed using the mooring data in Bering Strait. As discussed in section 2.4, moorings were deployed on the Russian side of Bering Strait as part of the RUSALCA program, providing information across the entire strait. Here we consider timeseries from two of the moorings in the array: mooring A4 on the US side, and mooring A1 on the Russian side (see Fig. 2b for the locations of the two moorings). As our study uses data from two different deployment periods (the mooring array was turned around in late-August), the depth of the instruments varied slightlyfor example the top bin of the ADCP was centered at 35 m in 2009 versus 38 m in 2008 (see Fig. 5 for the positions of the instruments in the vertical plane). The mooring data are presented for the months of August-September 2009 in Figures 12 and 13, where both plots include the 10-m wind vector timeseries in the vicinity of Bering Strait from the NARR reanalysis data. On the temperature and salinity panels we have delimited the water mass boundary (3 o C and salinity of 32) between the warmer, fresher ACW and the colder, saltier BSW (see Fig. 4). During the month of August the winds in Bering Strait were variable, alternating predominantly between northeasterly and southwesterly ( Fig. 12a). For most of this time period the flow through the eastern side of Bering Strait was northward, advecting ACW into the Chukchi Sea (Fig. 12b and c). However, a marked change occurred in the beginning of September when the wind shifted to the northeast and remained that way for nearly the entire month. As seen, the flow through that side of the strait (at 35 m depth) reversed soon after this initial change in wind, and the water became substantially colder and saltier (changing from 8 o C to 3 o C and 29.5 to 32 in salinity at 41 m), hovering near the boundary between ACW and BSW. However, as the month progressed and the northerly winds increased in strength, the mooring clearly measured BSW on the eastern side of the strait (Fig. 12c). In fact, BSW was present for roughly the last 12 days of September (including the occupation of the BS section at the end of the month). Importantly, the flow through the strait was northward during some of the periods when BSW was present, revealing that this water mass was advected into the Chukchi Sea on the \"wrong\" side of the strait. Unfortunately, the CTD sensor on mooring A1 on the Russian side of the strait was absent for much of August, but when the mooring was serviced in late-August a replacement sensor was re-deployed which returned good data. One sees that the flow through the western side of the strait was predominantly northward during August, while the wind was variable, and, as expected, the water mass transported northward was BSW (there is no reason to think that BSW was not present at the mooring site throughout the month of August). However, coincident with the change that took place on the eastern side of the strait due to the occurrence of northeasterly winds in early September, the conditions on the western side changed just as dramatically. In particular, warm and fresh ACW was measured at the mooring site over a period of roughly five days (Fig. 13c). Then when the winds increased in strength later in the month, ACW appeared again at the site for a prolonged period. During some of this time period the ACW was being transported northward through the strait. Hence, the mooring records indicate that ACW and BSW were not only transposed in Bering Strait during the occupation of the BS section, but also at other times earlier in the month. This transposition of water masses is likely the result of the secondary circulation in the strait due to the persistent northerly winds during the month of September. The Ekman transport in the surface layer would advect ACW towards the Russian side of the strait, where downwelling would occur, bringing the ACW to depth (as observed in Fig. 6) and transporting the BSW towards the US side of the strait in the lower layer. This phenomenon is investigated below using a numerical model (in section 4). As noted, for part of the time when the two water masses were transposed, the flow through Bering Strait was poleward (a total of 8.5 days at mooring A4 and 4.5 days at mooring A1), transporting these water masses onto the Chukchi shelf in a manner not indicative of the norm. This may provide an explanation for the surprising occurrence of ACW in Herald Canyon during the 2009 RUSALCA survey. This is also addressed below using the numerical model."}, {"section_title": "b. Atmospheric forcing", "text": "It is natural to ask if the atmospheric forcing during the time period of the transposition of ACW and BSW in September 2009 was anomalous. To assess this we use the NARR reanalysis fields for the period 2000-2012 (which encompasses the time period of the RUSALCA program). We start by considering the along-strait component of the wind (and windstress) at the NARR data point closest to the center of the strait (which is slightly on the US side) 3 . The along-strait angle is 30 o T (positive is northward). The mean wind for the 12-year period is 2.4 m/s from the north. There is a well-defined seasonal cycle, with stronger winds in the fall/winter and weaker winds in the spring/summer (Fig. 14). From June-August the climatological monthly mean wind speed is indistinguishable from zero, and from October-November it exceeds 4 m/s. Included in 3 Results were comparable when using a spatial average over a region encompassing the strait. To examine the large-scale atmospheric setting leading to the stronger than normal winds in September 2009, we considered the sea level pressure (SLP) and 10-m winds over a domain The conditions during September 2009 were markedly different than the climatological mean (Fig. 15b). The Aleutian low was significantly deeper and centered farther to east; however, the biggest change was in the Russian sector of the domain. In particular, a region of high SLP developed over eastern Russiaknown as the Siberian Highassociated with a strong anti-cyclonic circulation. This is a well known feature (Gong and Ho, 2002;Kim et al., 2005), which is often connected via a ridge of high pressure to the Beaufort High. The strong SLP gradient between the Aleutian low and Siberian high was the cause of the enhanced winds in September 2009. The anomaly fields (Fig. 15c) nicely reveal the eastward shift and deepening of the Aleutian low, which is more reminiscent of the climatological conditions in October associated with a tightened SLP gradient across Bering Strait (Pickart et al., 2009). The fact that high SLP anomaly over Siberia is not very different from the September 2009 mean in this region (compare Figs. 15b and c) indicates that it is rare for the Siberian High to be present during this month. These results show that it was a combination of a change in strength/position of the Aleutian low, together with the development of the Siberian high, which caused the abnormally strong winds during the September 2009 RUSALCA cruise. Taking a closer look at the synoptic fields during that month reveals that a series of low pressure systems transited through the region over this time period, some of which deepened in the Gulf of Alaska (as they are known to do, e.g. Wilson and Overland, 1986). In particular, seven different storms passed through the eastern box marked in Figure 15b. We compared the timeseries of SLP averaged within that box with the analogous timeseries for the western box in Figure 15b (centered over the Siberian High). Not surprisingly, the timeseries of SLP difference between the two boxes is significantly correlated (r = 0.5471 at the 95 % confidence level) with the 10-m wind speed in Bering Strait. Also not surprisingly, the Siberian High SLP varied on a much slower timescale than the Aleutian Low SLP. In contrast to the seven events in the eastern box, the timeseries for the western box was characterized by only two broad peaks: one lasting roughly one week and the other extending for roughly two weeks. Hence, although the magnitude of the winds in Bering Strait was due to both centers of action, the variation over the month was dominated by the Aleutian Low. To shed more light on the reasons behind the transposition of the two summer water masses that occurred in September 2009, we further examined the general characteristics of the wind events in Bering Strait. We defined an event by the criteria that the northerly wind speed exceeds m/s for more than 18 hours without interruption for more than hours. Again, there are clear seasonal trends. Notably, for the months of June-October (i.e. the climatological summer water period), the length of events increases from roughly 2 days to 5 days, while the average magnitude of the wind during the events strengthens from approximately 6 m/s to 8 m/s (the peak winds increase from 7.5 m/s to 12 m/s). Hence, progressing from summer into fall, storms become more intense and last longer. What does this imply about the secondary circulation in Bering Strait? To answer this we considered the time integral of the windstress over a wind event, which takes into account both the duration and magnitude of the storm, , where τ a is the along-strait component of the windstress, and t 1 and t 2 are the start and end times of the events identified above. We note that this quantity is proportional to the cumulative Ekman transport (Huyer et al., 1979) which is Iw/f. The results are plotted in Figure 16 for each month of the year over the 12-year period. The plot shows each event (grey stars), along with the mean (black stars) and median (blue stars) for each month, including the standard deviations (bars). Iw can be taken as a measure of the persistence of the wind-driven secondary circulation in Bering Strait, and hence reflects the tendency for the transposition of water masses to occur. As seen in Figure 16, there is a clear seasonal cycle with considerably larger Iw, and larger variability, from September through December. (The median is consistently smaller than the mean, due to the relatively large number of moderate and/or short storms during the year.) In September there were three events (see Fig. 12a): one short event and two longer ones. The corresponding Iw values are marked in red in Figure 16. The latter two events were both characterized by large Iw, especially the event during the last half of the month, which was one of the largest values during any of the Septembers. This, together with the WOD results presented earlier (showing very little ACW on the western side of Bering Strait, Fig. 9a), suggests that it takes especially strong winds to cause the transposition of water masses that was observed on the RUSALCA cruise. Note, however, that from October through early-December there are a number of Iw values comparable to, or larger than, the anomalous event in September 2009. This implies that water mass transposition in the strait may be a more common phenomenon later in the fall. Unfortunately, shipboard surveys in the Chukchi Sea at that time of year are rare (we are not aware of any measurements in Herald Canyon in October/November), so it is difficult to assess this. Furthermore, during the fall the ACC is greatly diminished or absent, so that ACW is no longer found in Bering Strait. Hence, the consequences of such a transposition may not be as significant for the water masses of the Chukchi shelf at that time of year."}, {"section_title": "Idealized numerical model", "text": "We now use the numerical model introduced in Section 2.6 to explore the circulation and We consider first a wind event with a maximum wind stress of τ max =-0.1 N/m 2 (which corresponds to a northerly wind speed of roughly 8.5 m/s) and a duration of approximately 9 days. The flow and temperature distribution on day 11, at the end of the wind event, are shown in Figure 18. One sees that in the southern two-thirds of the domain the warm water has been advected approximately 100 km offshore of the eastern boundary. This is sufficient to cross the model strait so that the warm water is now banked up against the western boundary of the strait (Fig. 18a and c). The flow in the central part of the channel remains nearly barotropic at approximately 35 cm/s while the total northward transport has been reduced to 0.52 Sv. There are also flow reversals along the eastern boundary and near the surface at the western boundary. although the barotropic flow near the western boundary in the model is much weaker than in the observations. South of the strait at this time the ACW is within a broad region of northward flow. North of the strait, some of the warm water is being advected northward in the branch that flows through the model equivalent of Herald Canyon. In fact, a portion of this warm water has been carried entirely across the northward branch and lies in a region of weakly recirculating flow west of the canyon, staying there for quite a while (the model does not contain Wrangel Island).We note that most of the model ACW that resides in the canyon at this time emanated from the ACC after it had already passed through Bering Strait; i.e., it was not due to the transposition in the strait. On day 30, although the wind has been turned off for 19 days, the effects of the wind event are still seen throughout the region (Fig. 19). The warm water is now being advected northward in the middle of the strait, having originated from the pool of warm water that was previously carried into the interior south of the strait. The ACC is becoming re-established along the southern portion of the eastern boundary, advecting warm water as far north as y=600 km at this time. We note that the temperature is behaving somewhat as a passive tracer that is carried by the barotropic flow. This is most evident north of the strait. There is a plume of warm water extending northward from the strait to y=1050 km, heading into the canyon. (The earlier pulse of warm water in the canyon has already drained from the shelf at this point and is now being advected eastward along the shelf break near x=300 km, y=1150 km.) Importantly, the ACW now entering the canyon did stem from the transposition in Bering Strait and is not simply a short pulse of warm water. At this time the transport through the strait is again 1 Sv and the major currents are being re-established − yet they now advect anomalous water masses compared to the time period prior to the wind event. It takes months for the flow and temperature distribution in the model to return completely to the pre-wind state. This is because the flow speed varies significantly across the domain, from O(50 cm/s) in the strait, to O(10-20 cm/s) in the canyon and along the eastern boundary, to nearly stagnant in the western-most portion of the shelf. The Ekman transport is able to carry the warm water across these flow regimes, but after the wind ceases there is no mechanism to bring the warm water back into the original advective pathways that carry it across the shelf and towards the east. The wind event also disrupts the northward heat transport through the strait, reducing it by approximately 40% while the wind is strong. This heat is not lost, however, and is eventually advected northward through the strait between days 40 and 60. It is evident that the cross-stream displacement of the ACW depends on the Ekman transport. We now explore the sensitivity of this displacement to the strength and duration of the wind event. A series of model calculations were carried out in which the wind stress was varied between -0.0125 N/m 2 and -0.325 N/m 2 , and the duration was either 9 days or 4 days. The location of the ACW was calculated as a weighted zonal integral of temperature anomaly relative to The reference frame is such that Xe = 0 on the eastern boundary, so X ACW is a measure of the offshore distance of the ACW from the coast. The minimum value (most westward distance) of X ACW was found for each calculation and is plotted in Figure 20. The circles are for the latitude of the strait, y = 770 km, and the squares are for a region north of the strait taken to be y = km. The offshore shift of the ACW core is plotted as a function of the Iw for each of the wind events. Not surprisingly, the warm water is advected farther offshore for either stronger, or longer lasting wind events. To leading order, Iw controls the behavior; short strong events are equally as effective as long, weak events. This is not precisely true because there is a weak zonal flow of approximately a few cm/s in the strait (note the orientation of the streamlines in Figure 19a) which offsets this linear interpretation, but this effect is relatively minor. This is the reason that the weak, long events do not advect the warm water in the strait quite as far as the strong, short events. One implication of this is that very weak winds would not result in an offshore shift of the warm coastal water even if they persist for a very long time. In the strait the offshore shift is of course limited by the presence of the western boundary at X ACW = -100km. Complete displacement is achieved for Iw less than about -0.75 to -1.0 N /m 2 days (Fig. 20). For reference, this is approximately 0.1 N/m 2 wind stress applied for 10 days. Note that most of the Ekman transport is carried in the uppermost model level (5 m). If the vertical mixing were sufficiently large to significantly deepen the Ekman layer so that the Ekman transport were distributed over a larger depth range then it would take longer for the transposition to occur. Note that at this time of year the flow through Bering Strait is generally well stratified and thus expected to limit the depth of the Ekman layer. We have marked this range of Iw on Figure 16, which denotes when the full transposition of ACW and BSW should occur. This provides further evidence that the transposition is not a common phenomenon. In particular, only 10% of the observed wind events in the strait over the 12-year period meet/exceed this criterionnone in May, June, and July (and only a few in April and August). To the north on the shelf (y = 1000 km), the warm water is always located farther offshore than it is in the strait. This is because the eastern boundary at y=1000 km lies approximately km to the east of the eastern boundary in the strait and much of the warm water north of the strait was advected there from the strait, not locally from the eastern boundary. The warm water returns to the eastern boundary within the strait approximately 60 days after a wind event, independent of the wind strength because it is restored by the large scale circulation south of the strait. However, the warm water north of the strait remains in the interior far longer because part of it remains in the region of weak flow to the west, plus the advective pathway over the canyon and along the shelfbreak is much longer than the direct route along the coast, and thus takes longer to flush the warm water out of the region. There are surely aspects of the wind-driven response in Bering Strait and the Chukchi shelf that are not captured, or precisely represented, in our simplified model. We note that the model domain does not contain significant variations in the coastline (such as Norton Sound) and, as seen in Figure 15, the northerly winds are not spatially uniform. However, the model does provide a dynamical explanation of the water mass transposition that occurred in September 2009, which is consistent with the shipboard observations and the atmospheric reanalysis fields. Furthermore, it shows how a single strong and/or long-lasting storm can disrupt the normal progression of Pacific summer waters across the Chukchi shelf and can divert ACW from its coastal pathway into Herald Canyon."}, {"section_title": "Summary and Discussion", "text": "We have presented results from a hydrographic/velocity survey of the Chukchi Sea carried out in September 2009. What makes the study unique is that the sampling domain included the western (Russian) side of the shelf, including the region near Wrangel Island where there are few existing measurements (and no high-resolution transects that we are aware of). We focused on the distribution and pathways of four different water masses: Alaskan coastal water (ACW), Bering summer water (BSW), remnant Pacific winter water (RWW), and Siberian coastal water (SCW), and compared what was observed in September 2009 to the historical presence of these water masses as seen in the World Ocean Database (WOD). There were both similarities and differences between our survey and the patterns seen in the WOD. Both ACW and BSW were flowing northward through Bering Strait in September 2009, while SCW was flowing southwards towards the strait adjacent to the coast of Russia in the Siberian Coastal Current. The transport of the Siberian Coastal Current diminished to the south, while the transport of the ACW and BSW decreased in the northern part of the Chukchi Sea. RWW was found extensively in the region around Wrangel Island and Herald Canyon, but not on the southern part of the shelf. All of these things are consistent with the patterns seen in the WOD and with the results of previous studies. There were, however, surprising aspects to our 2009 survey. Most notably, the ACW and BSW were transposed in Bering Strait and ACW was found extensively on the western shelf, which, according to the historical data, is rare. In particular, the ACW was flowing northward on the western side of the strait as a bottom-intensified current, whereas this water mass is typically transported in the surface-intensified Alaskan Coastal Current on the eastern side of the strait. At the same time the BSW was observed within the eastern channel in our survey, as opposed to the normal situation where it flows through the western channel. Furthermore, significant amounts of ACW were present in Herald Canyon flowing to the north. Another notable aspect to the survey was the presence of SCW encircling Wrangel Island, suggesting that at times this water mass can get entrained into the prevailing anti-cyclonic circulation around the island. Using a simple numerical model we provided a likely explanation for the anomalous presence of ACW observed in our survey. The winds in September 2009 were especially strong out of the northeast, and we simulated this with a strong northerly wind event in the model. We found that the resulting secondary circulation in Bering Strait caused the transposition of ACW and BSW. In particular, the surface Ekman flow brought ACW to the western side where it downwelled, and, as compensation, the BSW was fluxed to the eastern side of the strait. The meridional flow was temporarily reversed to the south in the strait, but as the model winds subsided the northward flow was re-established while the water masses were still transposed. This resulted in a substantial amount of ACW being diverted to the western side of the shelf into the model equivalent of Herald Canyon, Notably, the readjustment process in the model is slow, so ACW is able to exit the western shelf as a result of a single strong wind event. The NARR fields revealed that the northeasterly winds in Bering Strait during September 2009 were much stronger than the climatological average due to the combination of a deepened Aleutian Low, which was shifted to the east, and the presence of a strong Siberian High. Using the time integral of the windstress (Iw) as a metricwhich takes into account both the duration and strength of a stormit was found that one of the storms in September 2009 had an especially large value of Iw. Sensitivity tests using the model indicated that there is a threshold for Iw above which the ACW will be shifted to the western side of Bering Strait. The value in September 2009 far exceeded this threshold. Thus, despite the simplified nature of the model, it offers a dynamical explanation for the anomalous state of the Chukchi Sea observed in our survey. There are several ramifications of such a wind-driven transposition of ACW and BSW. Much of the heat and freshwater transported into the Chukchi Sea, and ultimately fluxed into the interior basin, is carried by the Alaskan Coastal Current (Steele et al., 2004;Itoh et al., 2015). The heat is capable of melting a significant amount of pack-ice (Woodgate et al., 2011;Brugler et al., 2014), while the freshwater can contribute to the reservoir of freshwater within the Beaufort gyre (Proshutinsky et al., 2009;Pickart et al., 2013). If ACW is diverted from its normal coastal route within the Alaskan Coastal Current it will (1) reside longer on the Chukchi shelf due to the longer and slower pathways on the central/western shelf (e.g. Pickart et al., submitted), plus the fact that northerly winds retard the flow (Winsor and Chapman, 2004); and (2) exit the Chukchi shelf at a different location and possibly in a different manner. The longer residence time means that the water will tend to cool due to the colder air temperatures and increased storminess in late-September and October, which means the modified ACW is less likely to melt ice in the basin. Furthermore, the ACW will enter a different part of the Canada Basin which will impact the ultimate fate of the water. It is well known that ACW exiting Barrow Canyon forms an eastward-flowing shelfbreak jet (Nikolopoulos et al., 2009), and that the jet is unstable and fluxes the warm water into the Beaufort Sea (von Appen and Pickart, 2012). A similar jet along the edge of the Chukchi shelf seems to result from the outflow from Herald Canyon (Mathis et al., 2009;Linders et al., submitted), and it too appears to flux water offshore via eddies (Pickart and Stossmeister, 2008). It seems likely that water transferred to the basin near Herald Canyon will more readily enter the Beaufort Gyre and the Transpolar Drift. This in turn suggests a more effective route for the fresh ACW to help maintain the freshwater reservoir of the Beaufort Gyre. As shown here, and in many previous studies, BSW is considerably higher in nutrients than the ACW. The typical pathways for BSW thus result in higher productivity on the western shelf, with larger amounts of water column chlorophyll and benthic biomass (Grebmeier et al., 2006). The transposition of water masses in Bering Strait documented here could potentially result in more BSW on the eastern shelf in late-summer / early-fall. There has been a significant decline in sea-ice persistence in the Chukchi Sea over the past several decades, including a later occurrence of freeze up (Frey et al., 2014). On the northeast portion of the shelf the pack-ice is now tending to form in mid-November versus late-September 35 years ago (Frey et al., 2015). This means that more light enters the water column later in the season. Consequently, autumn phytoplankton blooms may start to occur resulting in enhanced biological activity on the eastern shelf. It remains to be seen what the consequences of this are. One interesting thing to note in this regard is that Bowhead whales tend to migrate southward in the fall in greater numbers on the western shelf (Quakenbush et al., 2010). With a more biologically active eastern shelf this could change. One should also keep in mind that, while it takes strong winds to cause the water mass transposition in Bering Strait, the number and intensity of high latitude storms is expected to increase as the climate warms.                               "}]