[{"section_title": "Introduction", "text": "National Weather Service (NWS) hurricane storm surge forecasts are based on guidance from the Sea Lake and Overland Surges from Hurricanes (SLOSH) model (Jelesnianski et al. 1992) developed in the 1980's by the Meteorological Development Laboratory (MDL) and run by the National Hurricane Center (NHC). SLOSH, as the name implies, forecasts hurricane storm surge both at the coastline and overland. To do so it solves a set of finite differencing equations which describe the physical equations of motion. It uses transport equations derived by Platzman (1963) modified with a bottom slip coefficient by Jelesnianski (1967). It uses a constant drag coefficient in the air and a constant eddy stress coefficient in the water. To do this efficiently it uses a structured grid which is coarser in deeper water and finer near the shore. The grid combined with the underlying bathymetry and topography is known as a SLOSH basin. One special characteristic of a SLOSH basin is that it includes subgrid features to model finer scale items, such as rivers and levies, without having to increase the total number of grid cells. NWS uses SLOSH to create climatological, deterministic and probabilistic guidance of storm surge induced by landfalling hurricanes. Climatological storm surge guidance takes the form of two products known as SLOSH Maximum Envelope of Water (MEOW) and Maximum of MEOWs (MOM) (Glahn et al. 2009). A MEOW is the maximum surge from a group of hypothetical storms run through SLOSH, all of which have the same forward speed, forward direction, and delta pressure (change in pressure from ambient to the center of the storm), but differ in landfall location. So a MEOW is an estimate of the potential surge from a hurricane with a specific forward speed, direction and delta pressure. A MOM is similar to a MEOW except all the hypothetical storms of the same delta pressure have been grouped together regardless of forward motion. Deterministic guidance is created by providing the results of running the current NHC forecast through SLOSH. Probabilistic guidance is provided through the probabilistic storm surge (p-surge) product. P-surge is created by combining the current NHC forecast with historic error statistics to create a group of hypothetical storms along with their likelihoods. The results of running the storms through SLOSH are combined based on the likelihood of each storm, thereby creating either the probability of exceeding a threshold, or the height that a certain percentage of storms exceeded and provided to forecasters in real-time. SLOSH has become an integral part of the U.S.'s response to hurricane storm surge. The climatological guidance products form the basis of hurricane evacuation studies, while the deterministic and probabilistic products are critical to the forecasts. Since SLOSH output feeds directly into the forecast process the model needs to be fast. At the same time it needs to be well maintained, and computationally stable."}, {"section_title": "Computational stability on Arakawa B-grids", "text": "In order for SLOSH to provide good guidance it needs to be computationally stable. Unfortunately SLOSH performs its calculations on an Arakawa B-grid ( Figure 1).  Fig. 3)) Mesinger (1973) showed that calculating gravity waves on Arakawa B-grids is vulnerable to spurious grid-splitting instability patterns known as checker-boarding. He showed that when gravity waves are discretized a \"neutral and stationary two-grid-interval wave is permitted as a solution\" (Messinger p 445). So it is possible to have two separate subsets, think black and white squares on a checkerboard, of the grid with no interaction between the subsets (Figure 2). Essentially the grid can allow direct velocity interactions between diagonal cells, with little or no interaction between the horizontally or vertically adjacent cells. As Messinger points out this can be explained by realizing that the Arakawa B-Grid is the superposition of two Arakawa C-Grids ( Figure 2), a black one and white one. SLOSH has historically addressed the lack of interaction between the black and white grids with a standard five-point \"del-plus\" (+) Laplacian filter (computed from values at the center and 4 closest points) on the height field (Equation 1). Specifically the SLOSH five-point filter added one eighth of the del-plus Laplacian to the current height at each time step: Equation 2: Original SLOSH filter use of del-plus Laplacian. The filter \"relinks the two grids and acts to smooth out the ± behavior\" (Killworth p 1347). To reduce computational costs in particularly stable SLOSH basins, this filter is performed every 20 time steps instead of every time step. For unstable basins, the numerical noise has been controlled by smoothing every time step and by reducing the time step. If that fails, the bathymetry / topography are smoothed to reduce potential causes. Furthermore the practice of running the model with at least tropical storm force winds in the SLOSH basin was thought to reduce the chance of checker-boarding occurring. The idea being that the spurious grid-splitting depends on the u, v components on the black and white grids being independent of each other, but the wind forces from a tropical storm would cause them to interact. This is supported by Deleersnigder (1995 p. 677) \"… the checkerboard mode is associated with zero pressure gradient in the numerical algorithm, which is the reason that it can develop and persist\", since the pressure gradient approaches zero as the winds weaken. While these measures have worked in the past, SLOSH basins are regularly updated and replaced with basins that are more refined, detailed and feature-rich. For example the original New Orleans (MSY) basin had 56x79 cells with a resolution at its finest of 2.2 km, while the current basin has 160x188 cells with a resolution of 1.1 km. This is due to improvements in the ways basins are built as well as better computational resources have made it practical to build and run higher resolution basins. Unfortunately the higher resolution grids have made it more challenging to suppress numerical noise. Each increase in resolution results in reductions in the time step for the Courant-Friedrichs-Lewy (CFL) condition, making it impractical to run the basin at even smaller time steps to avoid numerical noise. Higher resolution grids also make it harder to justify smoothing out the bathymetry / topography. Additionally the trend towards basins covering larger areas makes it difficult to keep relatively strong winds throughout the basin. The result is that when the Jacksonville FL (ejx3), Charleston Harbor SC (ch2) and Galveston TX (egl3) SLOSH basins were updated in the spring 2011, there was no way to resolve the checker-boarding short of developing a new filter. Two examples of checker-boarding with the del-plus Laplacian filter smoothing at every time step are given in figures 3a and 3b.  "}, {"section_title": "Nine-point finite difference Laplacian Filter", "text": "Atmospheric models formulated on a B-grid are also vulnerable to checker-boarding. Model developers, such as Messinger (1973), have ameliorated this problem by replacing the 5-point finite difference Laplacian with a 9-point finite difference Laplacian in the height equations (Equation 3, 4). This yields the following filter (Equation 7):     As part of the interior versus exterior algorithm the SLOSH filter needs to identify wet cells. The original filter required that a cell have at least 1 foot of water on it before it was considered wet. Since we couldn't determine a reason for this we experimented with values from 0.5 to 0.0001 feet with a recommended value of 0.0001 feet (aka epsilon). Similarly the filter needs to determine how much water above a barrier's height is required before the barrier can be ignored. The original filter required water to be above the barrier on both sides by at least 1 foot. The reason for a 1 foot threshold was unclear, so we again experimented with values from 0.5 to 0.0001 feet, with a recommended value of 0.0001 feet. The other requirement, that water on both sides be above the barrier, has some merit since water shouldn't flow from the side below the barrier to the side above the barrier. However, for the new filter, we chose to require just one side to be above the barrier in order to ignore the barrier. The thought was to smooth water that spilled over a barrier, but we may revisit this in the future. Having determined interior versus exterior cells Next, we need to apply equation 7 to the situation where some of the points are exterior. Killsworth et al (1991)  After some experimentation with other cases it can be seen that Killsworth's solution implies that the del-plus Laplacian is the sum of the interior adjacent heights minus the center height while the del-cross Laplacian is the sum of specific interior diagonal heights minus the center height. The specific interior diagonals that are not cancelled out are the ones that have two neighboring adjacent interior cells. That is in Figure 4a, the del-cross Laplacian would contain a (C-D) term, but no (A-D) term. The exceptions to this would be the case in Figure 4c and 4d. For the 4c case, after substituting into equation 7 we get: After assuming δ =1, the (A-D)/3 + (F-D)/3 term in the del-plus Laplacian does not cancel the (A-D)/2 + (F-D)/2 term in the del-cross Laplacian. We chose to ignore this to avoid complicating the algorithm and because we weren't certain if this was an oversight on Killsworth's part."}, {"section_title": "Results", "text": "After re-running the storms in figures 3a and 3b we get the following:  The checker-boarding pattern has been removed. Of some concern is that there is more water in Figure 5a than in Figure 3a. After looking at the run, the checker-boarding pattern restricted the flow of water to the north side before the hurricane made landfall. The new run is a reasonable outcome of removing the artificial restriction. However this does raise a concern as to whether the new filter conserves mass. Deleersnijder (1995) work alleviates this concern. Just to be safe, we also implemented a test which finds the difference between the sum of all the heights before and after the filter. The test showed an average of 7.5 feet over all grid cells per time through the filter, or 0.0001 feet per grid cell. This was not deemed to be significant. Having implemented the new filter, we reviewed the original filter for things we'd left out. One item was handling SLOSH basins where one boundary was made equivalent to another, so water could flow across the boundary. The idea is to model islands, such as Puerto Rico, with a grid of concentric circles. Another was an adjustment to weights in a particular direction for specific types of SLOSH grids. Killworth cautioned about cases where Δx is not equal to Δy, so some care will be needed here."}, {"section_title": "Conclusion", "text": "The result of this work is that SLOSH now effectively suppresses numerical grid splitting in a manner consistent with the 9-point Laplacian formulation employed in numerical weather prediction models. This, in turn, means that SLOSH can now be run on high- "}]