[{"section_title": "Abstract", "text": "Large neuroimaging datasets, including information about structural (SC) and functional connectivity (FC), play an increasingly important role in clinical research, where they guide the design of algorithms for automated stratification, diagnosis or prediction. A major obstacle is, however, the problem of missing features (e.g., lack of concurrent DTI SC and resting-state fMRI FC measurements for many of the subjects).\nWe propose here to address the missing connectivity features problem by introducing strategies based on computational whole-brain network modeling. Using the ADNI dataset for proof-of-concept, we demonstrate the feasibility of virtual data completion (i.e., inferring \"virtual FC\" from empirical SC or \"virtual SC\" from empirical FC), by using self-consistent mean-field network simulations and analytic approaches. Furthermore, we use similar procedures to perform dataset augmentation, i.e., complementing the original dataset with a large number of realistic surrogate connectivity matrices. We thus show that algorithms trained on virtual SCs and/or FCs can achieve performance in the unsupervised classification of control subjects and patients comparable to when trained on actual empirical data. Furthermore, the combination of empirical with virtual data allows algorithms to learn better how to extract information relevant for discrimination, resulting ultimately in superior classification performance."}, {"section_title": "Introduction", "text": "Despite decades of massive investment in Alzheimer's disease (AD) research and the daunting literature on the topic, the partial and, sometimes contradictory nature of the reported results (World Alzheimer Report 2018) still prevents a complete understanding of the factors governing the progression of the disease (Braak & Braak, 1991; Braak et al., 2006; Komarova & Thalhauser, 2011; Henstridge et al., 2019) or of the diversity of cognitive deficits observed in different subjects (Iacono et al., 2009; Mungas et al., 2010; Allen et al., 2016) . In this context, datasets that compile rich and diverse genetic, biomolecular, cognitive, and neuroimaging (structural and functional) features for a large number of patients are playing an increasingly important role (Rathore et al., 2017; Iddi et al., 2019) . Example applications include: the early diagnosis and prognosis by using MRI images (Dennis & Thompson, 2014; Chiesa et al., 2017; De Vos et al., 2018) ; the use of machine learning for automated patient classification (Cuingnet et al., 2011; Zhang et al., 2012; Moore et al., 2019) or prediction of the conversion from early stages to fully developed AD (Rombouts et al., 2005; Moradi et al., 2015; Casanova et al., 2018) ; the extraction of decision networks based on the combination of semantic knowledge bases and data mining of the literature (Sanchez et al., 2011; Kodamullil et al., 2015; Iyappan et al., 2016) .\nAmong the factors contributing to the performance of prediction and inference approaches in AD are not only the large size of datasets but also the multiplicity of features jointly available for each patient. Indeed, one can take advantage not only of the complementary information that different features could bring but also capitalize on possible synergies arising from their simultaneous knowledge Zimmermann et al., 2016; Iddi et al., 2019) . Unfortunately, even gold standard publicly available datasets in AD, such as the datasets released by the Alzheimer's Disease Neuroimaging Initiative (ADNI) consortium (Wyman et al., 2013; Beckett et al., 2015; Weiner et al., 2017) , have severe limitations. Indeed, if they include neuroimaging features of different types -structural DTI and functional MRI-these features are simultaneously available for only a substantial minority of the subjects in the dataset (i.e., the feature coverage is not uniform over the dataset). Furthermore, if the number of subjects included is relatively large (hundreds of subjects), it still is too small to qualify as \"big data\" properly.\nHere we propose a new solution aiming at relieving these problems of partially missing features and limited sample size. To do so, we build on the quickly maturating technology of mean-field whole-brain network modeling (see Deco et al., 2011 for review) . Importantly, the use of whole-brain modeling for pragmatic applications is greatly facilitated by the development of dedicated neuroinformatic platforms -such as \"The Virtual Brain\" (TVB; Sanz-Leon et al., 2013 Woodman et al., 2014) -and personalized simulation pipelines (Schirner et al., 2015; Proix et al., 2016) , with translational impact Proix et al., 2017) . Computational modeling provides a natural bridge between structural and functional connectivity, the latter emerging as the manifestation of underlying dynamical states, constrained but not entirely determined by the underlying anatomy (Ghosh et al., 2008; Kirst et al., 2016) . Theoretical work has shown that average functional connectivity properties in the resting-state can be accounted for by the spontaneous collective activity of brain networks informed by empirical structural connectivity (SC) when the system is tuned to operate slightly below a critical point of instability (Deco et al., 2011 (Deco et al., , 2012 . Based on this finding, simulations of a model constructed from empirical DTI connectomes and then tuned to a suitable slightly sub-critical dynamic working point are expected to provide a good rendering of resting-state functional connectivity (FC). It becomes thus possible to complete the missing information in a dataset about BOLD fMRI FC by running a TVB simulation in the right regime embedding the available empirical DTI SC (SC-to-FC completion) . Analogously, mathematical formula (Galán, 2008; Saggio et al., 2016) or algorithmic procedures based on mean-field modeling steps (Gilson et al., 2016; 2018) can be used to address the inverse problem of inferring SC from FC (FC-to-SC completion) . In this work, we provide initial proofs-of-concept of data completion using TVB-technologies, using them to \"fill gaps\" in the ADNI neuroimaging dataset, generating the missing connectivity SC (or FC) connectivity matrices from the available FC (or SC) ones.\nFinally, both types of completion rely on algorithms, including stochastic elements. Therefore, running the FC-to-SC or SC-to-FC completion procedures multiple times yields different realistic surrogate connectomes. In this way, the completion procedure can be used to generate not just one, but as many as desired instances of artificially completed data (e.g. hundreds of virtual FCs associated with each given empirical SC). Schemes to artificially increase the size of a given sample by introducing surrogate copies of the original data, with a wide variety of \"distortions\" which preserve nevertheless the distinctive features of the initial objects are known in machine learning under the name of data augmentation (Yaeger et al., 1997; Taylor & Nitschke, 2018) . In many situations, the generalization capabilities of machine learning algorithms for automated categorization can be enhanced by training them not on the original \"true\" dataset but augmented copies of it. While data augmentation cannot create additional information besides the one already carried by the original data, yet it can make it simpler for machine learning algorithms to detect and extract desired information, a task that would have been more difficult based on the empirical samples alone. We here extend our TVB-based strategies for data completion to connectomic data augmentation. We show then that actual empirical connectomic data can be categorized -e.g., by separating mild cognitive impairment (MCI) or AD patients from control-by machine learning algorithms trained uniquely on virtual data. Remarkably, we find that the use of completed and augmented dataset lead to performances comparable to algorithms trained on the original data themselves.\nTo conclude, we provide systematic \"recipes\" for generating surrogate connectomic data via dataconstrained mean-field models. We show that the information that we can extract from computationally inferred connectivity matrices is largely equivalent to the one carried by the original empirical data. This opens the way to the design and sharing of veritable \"virtual cohorts\" data, ready for easier multi-centric federation and machine-learning applications in clinics."}, {"section_title": "Results", "text": ""}, {"section_title": "ADNI connectomic data have gaps", "text": "In the framework of this study, we chose to focus on one of the first and most popular available datasets in AD research, including a substantial amount of structural and functional connectomic information, i.e. the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu) . ADNI is impressive for the variety of features it aimed at systematically gathering ( Figure 1A) . Importantly, based on the T1, DTI and restingstate (rs) BOLD fMRI images available through the ADNI data-sets, state-of-the-art processing pipelines can be used to extract subject-specific Structural and resting-state Functional Connectomes, compiled into connectivity matrices adapted to the brain parcellation of choice ( Figure 1B , see Materials and Methods for details).\nWe had access to an empirical of 244 overall subjects (119 labeled as \"MCI\", 51 as \"AD\", in addition to 74 control subjects, see Materials and Methods) for which MRI data had been gathered. We could extract an FC matrix for 168 subjects (starting from rsfMRI) and an SC matrix (starting from DTI) for 88 subjects. However, only for a minority of 12 subjects rsBOLD and DTI information were both available. In a majority of cases, either DTI or rsBOLD were missing ( Figure 1C ). This reduced number of \"complete\" subjects constitutes a serious challenge to attempts of automatedly categorize them through machine learning or inference approaches capitalizing on both SC and FC features simultaneously. As a matter of fact, the total numbers of AD-and MCI-labeled subjects in this complete subset decreased respectively to just 2 and 4, against 6 controls. In these conditions, the development of effective data completion strategies would be an important asset toward the development of classifier schemes exploiting FC/SC synergies. Therefore, approaches to \"fill gaps\" (completion) and, possibly, even artificially boosting sample size (augmentation) are veritably needed."}, {"section_title": "Linking SC and resting-state FC via computational modeling", "text": "As previously mentioned, FC and SC are related only indirectly through the rich non-linear dynamics supported by brain networks (Ghosh et al., 2008; Deco et al., 2011; Kirst et al., 2016) . Mean-field modeling of large-scale brain networks has emerged initially as the key tool to predict the emergent dynamic patterns of resting-state FC, from spontaneous dynamics constrained by SC (Ghosh et al., 2008) . It is thus natural to propose the use of model-based solutions to perform data-completion, which, in both the SC-to-FC and FC-to-SC directions, requires to capture the inter-relation between the two as mediated by dynamics.\nLarge-scale mean-field brain network models are specified by: i) a parcellation of cortical and subcortical brain areas; ii) a co-registered input SC matrix in the same parcellation; iii) a forward solutions linking source and sensor space; iv) a neuronal mass model, describing the non-linear dynamics of the regions at each of the nodes of the SC matrix; v) a choice of a few global parameters (e.g. scale of strength of inter-regional connectivity or speed of signal propagation along fiber tracts); vi) an external input given to the different regions, that, in the simplest case, corresponds to simple white noise uncorrelated across each of the different sites and of homogeneous strength. The Virtual Brain enables the complete workflow from brain images to simulation (TVB; Sanz-Leon et al., 2013 . Personalization is accomplished by the subject-specific structural skeletoningredients (i) though (iv)-, which has been demonstrated to be predictive Melozzi et al 2019) . Simulations of the model can be run to generate surrogate BOLD time-series of arbitrary length (see Materials and Methods for details) and the associated simulated resting-state FC, time-averaged (static FC) or even timeresolved (FC dynamics or FCD, Hansen et al., 2015) . The thus obtained simulated FC will depend on the chosen global parameters, setting the dynamic working point of the model. The model dynamics will eventually switch between alternative dynamical regimes when its global control parameters cross specific critical points. Tuning global parameters will thus uniquely determine, in which regime the model operates. Mean-field large scale models constrained by empirical SC tend to generate simulated resting-state FC that best matches empirical observations when the dynamic working point of the model lies in the proximity of a model's critical point (Deco et al., 2011; Deco et al., 2013; Hansen et al., 2015) .\nWe here chose one of the simplest possible whole-brain network model designs, which emphasizes activitybased network organization (as opposed to reorganization due to synchronization) and thus ignores interregional propagation delays. This approach is frequently used in the literature (e.g., Deco et al., 2013; Hansen et al., 2015; Aerts et al., 2018) and has the advantage of avoiding the need for complex delay differential equation integration schemes (see Discussion for more details). Activation-based approaches adopt particularly simple neural mass models such as the reduced Wong-Wang model (Deco et al., 2013) , in which the dynamics of an isolated brain region is approximated by either one of two possible steady states, one \"down state\" at low firing rate and an \"up state\" at high firing rate, a feature initially meant to mimic bi-stability in working memory or decision making (Wong & Wang, 2006) . By varying G the model will switch from a low-coupling regime, in which all regional activations are low to a high-coupling regime, in which all regional activations are high, passing through an intermediate range, in which both regimes can exist in a multistable manner and regions display spatially and temporally heterogeneous activations (a changing mix of high and low firing rates). The best fit between simulated and empirical FC occurs slightly before the critical rate instability, at which modes of activity with low firing rate disappear (Deco et al., 2013) .\nAs alternatives to the just described non-linear mean-field models (MFMs) of resting-state brain dynamics, simpler stochastic linear models (SLMs) have also been considered (Goñi et al., 2014; Messé et al., 2014; Saggio et al., 2016) . In these models, the activity of each region is modeled as a stochastic process (linear, in contrast to the non-linear neural mass dynamics of conventional MFMs), biased by the fluctuations of the other regions weighted by the SC connectome (see Materials and Methods). SLMs have also two different regimes. In the first regime, the activities of all regions converge to a fixed-point of constant mean fluctuating activities, while, in the second, regional activities diverge with exponential growth. Once again, the best fit between the simulated and the empirical resting-state FCs is observed when tuning the model parameters slightly below the critical point (Hansen et al., 2015; Saggio et al., 2016) .\nMFMs and SLMs provide thus two natural ways to generate simulated resting-state FCs, depending on the chosen dynamic regime, starting from a selected SC. Strategies have also been devised to approximately solve the inverse problem of determining which SC matrix should be used as input to a model in order to give rise to a simulated FC matching a specific, pre-determined target matrix. For the SLM, a simple analytic solution to the inverse problem exists (Saggio et al., 2016) . For MFMs, inverse problems have not been studied with the same level of rigor, but algorithms have been introduced that iteratively adjust the weights of the SC matrix currently embedded in the model to improve the fit between simulated and target FCs (Gilson et al., 2016; 2018) . We will show later that these \"effective connectivity\" algorithms have the potential to cope with the actual problem of MFM inversion."}, {"section_title": "Model-driven data completion", "text": "Figure 2 summarizes many of the modeling operations described in the previous section framing them in the specific context of connectomic data completion. MRI data can be used to generate empirical SC matrices SCemp (from DTI) or FCemp (from rs fMRI BOLD). By embedding the empirical matrix SCemp into a non-linear MFM or a linear SLM, it is possible to compute surrogate FC matrices (Figure 2A , upward arrows), denoted, respectively, FCMFM and FCSLM. The MFM and SLM global parameters are suitably tuned (slightly subcritical) then FCMFM and FCSLM will be maximally similar to the empirical FCemp (dynamic working point tuning, represented by dashed grey arrows in Figure 2A ). Starting from the empirical matrix FCemp, one can then infer surrogate SC matrices ( Figure  2A , downward arrows), either by using a linear theory -developed by Saggio et al. (2016) -to compute a surrogate SCSLM; or by exploiting non-linear effective connectivity algorithm -generalized from Gilson et al. (2016; 2018) -to infer a surrogate SCMFM starting from a random initial guess (see later section). When connectomic data are incomplete (only SCemp or only FCemp are available, but not both simultaneously), computational simulation or inference procedures can be used to fill these gaps: by using FCMFM or FCSLM as virtual replacements for a missing FCemp ( Figure 2B ); or by using SCMFM or SCSLM as virtual replacements for a missing SCemp ( Figure 2C ). The quality of the model-generated virtual SCs and FCs can be assessed by comparing them with the actual empirical counterparts for the small subset of subjects for which both SCemp and FCemp are simultaneously available. Optimizing the quality of the virtually completed matrices on the subset of \"SCemp+FCemp\" subjects, also allows extrapolating target criteria for identifying when the model is operating a suitable dynamic working point, that can be evaluated solely based on simulated dynamics when a fitting target matrix is missing and thus fitting quality cannot be explicitly measured (cf. Figures 3 and 4 ). We can thus translate these criteria into precise algorithmic procedures that inform linear or non-linear SC-to-FC and FC-to-SC completion (see Tables 1-4) .\nWe now, provide more details on implementation and performance for each of the four mentioned types of data completion."}, {"section_title": "Linear SC-to-FC completion", "text": "In linear SC-to-FC completion, a simple SLM (see Materials and Methods) is constructed based on the available SCemp and its direct simulations or even, in a much faster manner, analytical formulas deriving from the model's theory are used to generate the associated virtual Pearson correlation matrix FCSLM ( Figure S1 ). In this stochastic linear modeling scheme, once the driving noise strength is arbitrarily chosen and fixed and the input connectome SCemp is specified, there remains a single parameter to adjust, the global scale of long-range connectivity strength G. Figure S1A shows a systematic exploration, performed on subjects from the \"SCemp+FCemp\" subset, of how the completion quality depends on tuning this parameter G. As shown by the main plot in Figure S1A for a representative subject, increasing G the correlation between the empirical FCemp and the simulated FCSLM, derived here from direct SLM simulations, initially grows to peak in proximity of a critical value G*. The correlation then drops dramatically when further increasing G beyond the critical point G*.\nThe exact value of G* depends on the specific personalized SCemp connectome embedded into the SLM and is therefore different for each subject. The small boxplot inset in Figure S1A gives the distribution of the personalized G* over all the subjects in the \"SCemp+FCemp\" subset. However, when performing linear FC completion because BOLD data and FCemp are missing, the exact location of the fitting optimum cannot be determined. To perform linear SC-to-FC completion for the ADNI subjects with missing BOLD we chose to always use a common prescribed value G*ref = 0.83, set to be equal to the median of the personalized G* over the \"SCemp+FCemp\" subset of ADNI subjects.\nOnce a G*ref value and a noise strength are set, the linear completion can be further sped-up by the fact that the covariance matrix FCSLM for these frozen parameters can be analytically evaluated, as discussed in Saggio et al. (2016) . Therefore, one can directly apply the SLM analytical formulas (see Material and Methods) on the available SCemp as input, without the need for performing direct simulations to generate surrogate BOLD first. Figures S1B-C analyze the expected performance of this \"simulation-less\" procedure, as benchmarked by applying it on the \"SCemp+FCemp\" subset. The boxplot in S1B reports a median Pearson correlation between the linear virtual FCSLM and the actual empirical FCemp close to ~0.24. Panel S1C indicates then the percent loss in correlation that has been caused by using the common value G*ref and the analytical formula to evaluate the linear virtual FCSLM rather than direct simulations at the actual personalized optimum G* for each of the \"SCemp+FCemp\" subjects. The median quality loss is approximately 0.5%, indicating that the lack of personalized tuning of the SLM working point is only a minor issue and that is acceptable to speed-up completion by relying on analytical evaluations. Table 1 provides a pseudo-code for the linear SC-to-FC completion procedure (see Materials and Methods for all details). Linear SC-to-FC completions for the DTI-only subjects in the considered ADNI dataset can be downloaded as Supplementary File S1. "}, {"section_title": "Table 1. Pseudo-code for linear SC-to-FC completion", "text": ""}, {"section_title": "Non-linear SC-to-FC completion", "text": "In non-linear SC-to-FC completion, a more complex MFM (see Materials and Methods) is constructed based on the available SCemp and is simulated to generate surrogate BOLD data and the associated Pearson correlation matrix FCMFM (Figure 3 ). Non-linear mechanistic MFM models are more compliant with neurophysiology than the phenomenological SLMs. Furthermore, because of their non-linearities, they are potentially able to capture complex emergent collective dynamics resulting in non-trivial FCD (which SLMs cannot render, cf. Hansen et al., 2015) . However, MFMs have also more parameters and are computationally costlier to simulate than SLMs.\nWe chose here to limit ourselves to MFMs based on a reduced Wong-Wang regional dynamics (see Materials and Methods for model equations), which has previously been used to successfully reproduce rsFC (Deco et al., 2013) and FCD (Hansen et al., 2015) starting from empirical SC, despite its relative simplicity with respect to other possible neural masses implemented in the TVB platform. In addition to the global scale of long-range connectivity strength G, the MFM model dynamics depend also on regional dynamics parameters. In Figure 3 , we froze all local parameters but the NMDA decay time-constant τ, since they affected the dynamic behavior of the model less than the other control parameters and, in particular, did not alter qualitatively the repertoire of accessible dynamical regimes (compare Figure 3A with Figure S2 ). The simulated collective dynamics and the resulting non-linear virtual FCMFM will depend on the choice of the free control parameters G and τ. In Figure 3A , we have explored the dependency of the correlation between FCMFM and the actual empirical FCemp as a function of G and τ achievable over the subjects in the \"SCemp+FCemp\" subset. As evident in figure 3A , this dependence is non-monotonic and the best-fitting qualities are concentrated in a narrow concave stripe across the G/τ plane. Panels 3B and 3C report zoom of Figure 3A into increasingly smaller regions, revealing an extended zone of high fitting quality which some absolute optimum parameters G* and τ* (here G* = ~ 1.5 and τ* = 25).\nRemarkably, this best-fitting quality zone on the G/τ plane is associated as well to other properties that can be evaluated just based on the simulated dynamics (and, therefore even when the actual target FCemp is unknown and missing). We found that the best fit quality systematically occurs in a region where three criteria are jointly met ( Figures 3D-F) .\nFirst, there is a mixture of \"ignited\" regions with large activation and of not yet ignited regions with a weaker firing rate (spatial heterogeneity, Figure 3D ). Conversely, when moving out of the best-fitting zone, the activity becomes more spatially homogeneous, either with all regions stable at low (for G <<< G*) or high (for G >>> G*) firing rates.\nSecond, the time-averaged FCMFM has a complex modular organization between order and disorder, associated to high average clustering coefficient, in contrast with the absence of clustering observed for G <<< G* or G >>> G* (structured FC, Figure 3E ).\nThird, the simulated collective dynamics give rise to meta-stability of FC along time, i.e. to a non-trivially structured FCD, which alternates between \"knots\" of transiently slowed-down FC network reconfiguration and \"leaps\" of accelerated reconfigurations. Such non-triviality of FCD can be detected by the inspection of the socalled FCD matrix (Hansen et al., 2015) , representing the similarity between FC matrices computed at different time-windows (see Materials and Methods). In this FCD matrix analysis, FCD \"knots\" are visualized as blocks with high inter-FC correlations, while FCD \"leaps\" give rise to stripes of low inter-FC correlation. The prominence of the block structure of the FCD matrix can be measured by the FCD clustering coefficient (see Material and Methods), higher when the FCD matrix includes more evident knots. The FCD clustering coefficient is higher in the best fit zone, while it drops moving outside it toward G <<< G* or G >>> G* (structured FCD, Figure 3F ).\nBy scanning the G/τ plane in search of a zone with simultaneous spatial heterogeneity of activations, structured FC and structured FCD, the MFM model parameters can be tuned to bring it in a zone invariantly resulting in relatively higher fitting quality. Figure 3G shows the analysis of the expected performance of this procedure, as benchmarked by applying it on the \"SCemp+FCemp\" subset. We measured a median Pearson correlation between the non-linear virtual FCMFM and the actual empirical FCemp close to ~0.32. Table 2 provides a compact pseudo-code for the non-linear SC-to-FC completion procedure (see Materials and Methods for all details). Non-linear SC-to-FC completions for the DTI-only subjects in the considered ADNI dataset can be downloaded as Supplementary File S2. \nIn general, our simple MFM model has three free parameters at the level of the local neural mass dynamics (τ, , and I0) and one free global parameter G. Since changing the values of and I0 had lesser effects on the collective dynamics of the system (see Figure S2 ), we set their values to ω = 0.9 and I0 = 0.32 respectively and remain then just two free parameters which we allow to vary in the ranges G ∈ [1 3] and τ ∈ [1 100] ms when seeking for an optimal working point of the model. As revealed by the analyses of Figure 3 , the zone in this restricted parameter space associated with the best FC-rendering performance can be identified through the joint inspection of three scores, varying as a function of both G and τ. The first criterion is the spatial heterogeneity of activation (see Table 2 , line 2.5) computed by taking the coefficient of variation of BOLDMFM time-series.\nBy computing the Pearson correlation coefficient of upper-triangular between FCMFM and FCemp for every subject from \"SCemp + FCemp\" subset (see Table 2 , line 2.3), we obtained a best-fitting zone in a narrow concave stripe (see Figure 3A for one subject); (G*, τ*) parameter set, bring the system to this best-fitting zone and values lower than this is ( : , : ) set and higher values are ( p , p ). This non-monotonic behavior of yellow zone in G/τ plane occurs where three criteria are jointly met; the second criterion is the clustering coefficient of timeaverage FCMFM matrices (see Table 2 , line 2.6) and finally, the third criterion is the clustering coefficient of FCDMFM matrices (see Table 2 , line 2.6), where the FCD matrices were computed for an arbitrary window. By knowing the optimal working point of the system where all three criteria are jointly optimum (see Table 2 , line 2), we freeze the algorithm and run the non-linear SC-to-FC data completion for 76 subjects (see Table 2 , lines 3 to 5). Non-linear FCMFM completions for our ADNI dataset can be downloaded as Supporting File S2."}, {"section_title": "Table 2. Pseudo-code for non-linear SC-to-FC completion", "text": ""}, {"section_title": "Linear FC-to-SC completion", "text": "In linear FC-to-SC completion, we use once again the analytic theory derived for the SLM (Saggio et al., 2016) to deterministically compute a surrogate SCSLM as a function of the available FCemp or, more precisely, of the resting-state BOLDemp time-series used to derive FCemp. In this scheme, the linear virtual SCSLM is indeed taken to be directly proportional to the inverse covariance of the BOLD time-series (see Materials and Methods). The proportionality constant would depend on the free parameters chosen for the SLM, serving as a link between FC and SC. Here we set arbitrarily this constant to the unit value. Figure S3 shows the analysis of the expected performance of this procedure, as benchmarked by applying it on the \"SCemp+FCemp\" subset. We measured a median Pearson correlation between the linear virtual SCSLM and the actual empirical SCemp close to ~0.22. Table 3 provides a pseudo-code for the linear FC-to-SC completion procedure (see Materials and Methods for all details). Linear FC-to-SC completions for the BOLD-only subjects in the considered ADNI dataset can be downloaded as Supplementary File S3."}, {"section_title": "Table 3. Pseudo-code for linear FC-to-SC completion", "text": "algorithm linear FC-to-SC completion is external input: empirical FC (FCemp) output: linear virtual SC (SCSLM) fixed parameters: noise level (σ), guess for optimal G (G*ref)\nbegin 1. Evaluate the inverse matrix C -1 from FCemp 2. Build a matrix S proportional to C -1 according to SLM theory and drop its diagonal return SCSLM = S end"}, {"section_title": "Non-linear FC-to-SC completion", "text": "Non-linear FC-to-SC completion consists in the inference of an SCMFM matrix that, used as input to an MFM, produces as output a simulated FC* matrix highly correlated with the available empirical FCemp (Figure 4 ). This non-linear inverse problem is more sophisticated than linear FC-to-SC completion, because, for the MFM a theory providing an explicit formal link between input structural connectome (SC*) and output functional connectome (FC*) is not available, unlike for the SLM. Note indeed that MFMs, at the best-fitting dynamic working point, give rise not just to a single dynamical mode, but to a multiplicity of them (Deco & Jirsa 2012; Hansen et al., 2015; Golos et al., 2015) and that each of them may be associated, in general, to a different statespecific FC (Battaglia et al., 2012; Hansen et al., 2015; Kirst et al., 2016) so that the final static FC* results from averaging over a mixture of different states sampled in stochastic proportions. Therefore, to derive the FC* associated with a given input SC*, it is necessary to run explicit MFM simulations. Gilson et al. (2016; 2018) have introduced iterative optimization procedures aiming at updating a current guess for the input SC* to a model in order to improve the match between the model output FC* and a target FCemp. In this \"effective connectivity\" procedure -named as such by Gilson and coworkers, even if different from effective connectivity measures defined more typically in terms of statistical causality metrics (Valdes-Sosa et al., 2011)-connectome weights are iteratively and selectively adjusted as a function of the difference occurring between the current FC* and the target FCemp. Such optimization leads to infer refined connectomes, that, with respect to empirical DTI SC matrix, may display non-symmetric connections (distinguishing thus between \"feeder\" and \"receiver\" regions as in Gilson et al., 2016) or enhanced inter-hemispheric connections, usually under-estimated by DTI (as in Gilson et al., 2018) . Here we use a similar algorithm to learn a suitable non-linear virtual SCMFM.\nThe initial SC*(0) is taken to be a matrix with fully random entries. An MFM embedding such SC*(0) is built and simulations are run to generate an output FC*(0) which is compared to the target FCemp of the subject for which FC-to-SC completion must be performed. The used SC*(0) is then modified into a different SC*(1) = SC*(0) + l∆FC(0) matrix, by performing a small update step in the direction of the gradient defined by the difference ∆FC(0) = FCemp -FC*(0). A new simulation is then run to produce a new FC(1). The produce is repeated generating new SC(i) = SC(i-1) + l∆FC(i-1) until when the difference between FC(i) and the target FCemp becomes smaller than a specified tolerance, i.e. |∆FC(i)| < ε. The last generation SC(i) is then taken as non-linear virtual surrogate SCMFM (see Materials and Methods for details). Figure 4A provides an illustration of the nonlinear FC-to-SC completion when applied to subjects in the \"SCemp+FCemp\" subset. In the first step, the matrix SC*(0) is random and there is no correlation between the output FC*(0) and FCemp. Advancing through the iterations, SC*(k) develops gradually more complex internal structures and, correspondingly, the correlation between FC*(k) and FCemp increases until when it reaches the desired quality threshold, here set to CCtarget = 0.7. This threshold quality is usually reached after ~1500 iterations. In the \"SCemp+FCemp\" subset we can even take advantage of the availability of the actual SCemp to quantify as well the convergence of SC*(k) toward SCemp. Figure 4A shows that advancing through the iterations, the correlation between SC*(k) and SCemp improves as well. The expected quality of reconstruction, as estimated from results on the \"SCemp+FCemp\" subset is reported in Figure 4B and amounts to an expected correlation between SCMFM and SCemp of ~0.31.\nWe note that non-linear FC-to-SC completion, as for non-linear SC-to-FC completion, is a non-deterministic procedure, meaning that a different SCMFM is generated depending on the starting initial condition SC*(0). However, the different non-linear virtual surrogates lie at distances from the common actual ground truth SCemp which are tightly concentrated around the median correlation. As revealed by Figure 4C , the reported correlations between SCMFM and SCemp were within a narrow interval of ±2.5% of the relative difference from the median distance for all the tested random initial conditions (30 per subject, see Materials and Methods), showing that the expected performance is poorly affected by the initial conditions. This stochastic aspect of the non-linear completion algorithm is going to allow us generating not just one but arbitrarily many completions, starting from each available empirical connectivity matrix (see later section). Table 4 provides a compact pseudo-code for the non-linear FC-to-SC completion procedure (see Materials and Methods for all details). Non-linear FC-to-SC completions for the BOLD-only subjects in the considered ADNI dataset can be downloaded as Supplementary File S4. \nWe implemented a heuristic approach to infer the most likely connectivity matrix (i.e. Effective Connectivity) that maximizes the similarity between empirical and simulated functional connectivity. As an initial point, we considered a random symmetric matrix and removed diagonal as SC*(0) (see Table 4 , line 1) and run the algorithm in Table 2 in order to simulate the FC*(0). Then iteratively we adjusted the SC as a function of the difference between the current FC and empirical FC (see Table 4 , line 2), in other words SC*(1) = SC*(0) + l∆FC(0) where ∆FC(0) = FCemp -FC*(0) and l is the learning rate (see Table 4 , line 3). The iteration will stop when the correlation between FCemp and FC*(k) reaches to the threshold CCtarget = 0.7, and giving the SC*(k) as SCMFM. All the parameter used in this section is identical to the non-linear SC-to-FC completion procedure. Nonlinear SCMFM completions for our ADNI dataset can be downloaded as Supporting File S4."}, {"section_title": "Table 4. Pseudo-code for non-linear FC-to-SC completion", "text": ""}, {"section_title": "Data completion is self-consistent: bi-virtual connectivity matrices", "text": "SLM and MFM have thus the capacity to bridge from SC to FC or from FC to SC. When using these models for data completion, the input matrix is always an empirical matrix (SCemp or FCemp) and the output a surrogate virtual matrix (respectively, FCvirt or SCvirt, where the index \"virt\" refers generally to any completion algorithm, i.e. either using the SLM or the MFM models). However, the algorithms presented in Tables 1-4 can still be applied even when the input connectivity matrix is already a virtual matrix. In this case, the input could be surrogate matrices (SCvirt or FCvirt) from data completion and the output would be bi-virtual (respectively, FCbivirt or SCbivirt), i.e. twice virtual, since, to obtain them starting from an empirical input connectome, two different model-based procedures have to be chained. The final result of passing an original empirical connectome through two chained completion procedures is then a bi-virtual surrogate matrix of the same type (structural or functional) of the initially fed connectome. In other words, SCemp is mapped to an SCbivirt (passing through an intermediate FCvirt step) and FCemp is mapped to an FCbivirt (passing through an intermediate SCvirt step).\nA first reason to evaluate bi-virtual connectivity matrices is to perform a self-consistency check of the data completion procedures. If the completion quality is good, then empirical connectomes and their bi-virtual counterparts should be highly related between them. A second reason would be to generate for each subject a fully virtual pair of connectomes, e.g. an SCvirt (or an FCvirt) paired with an FCbivirt (or an SCbivirt) that could be shared in a public dataset to avoid disclosing the actual private subject-specific empirical data FCemp (or SCemp). Figure S4 shows the correspondence between empirical and bi-virtual SC and FC pairs, both when using chained linear (SLM-based) and nonlinear (MFM-based) completion procedures. We first evaluated the quality of SCbivirt generation over the ADNI-subset of 88 subjects for which an SCemp matrix was available ( Figure S4A ). Considering the linear bi-virtual completion chain SCemp to FCSLM to SCbi-SLM we obtained a median correlation between SCemp and SCbi-SLM of ~0.63. Considering then the non-linear bi-virtual completion chain SCemp to FCMFM to SCbi-MFM we obtained a smaller median correlation between SCemp and SCbi-MFM of ~0.58.\nWe then evaluated the quality of FCbivirt generation over the ADNI-subset of 168 subjects for which an FCemp matrix was available ( Figure S4B ). Considering the linear bi-virtual completion chain FCemp to SCSLM to FCbi-SLM we obtained a rather poor median correlation between FCemp and FCbi-SLM of ~0.12. However, considering finally the non-linear bi-virtual completion chain FCemp to SCMFM to FCbi-MFM the median correlation between FCemp and FCbi-MFM rose to ~0.59.\nThe empirical-to-bi-virtual correlations were always significant and, in all cases but FCbi-SLM well compatible with the empirically observed test-retest variability (Wang et al., 2012; Chen et al., 2015; Termenon et al., 2016) . This non-trivial performance and, particularly, the fact that empirical-to-bi-virtual correlations in Figure S4 are even higher than empirical-to-virtual correlations in Figures 3, 4 or S1, establish the self-consistency of the model-based data completion procedures presented in Tables 1-4.\nNote also that the lack of perfect identity between original seed empirical connectomes and their bi-virtual counterparts prevents the exact regeneration of the actual subject empirical data (see Discussion for the positive implications of this negative result)."}, {"section_title": "Data completion is useful for unsupervised categorization", "text": "The compilation of large datasets, including connectivity data from structural and functional neuroimaging is considered essential for the development of algorithmic patient stratification and predictive approaches. Here, we have described four different types of connectomic data completion and studied their consistency. We now show that such completion procedures are useful for the algorithmic extraction of information.\nFor the sake of relative benchmarking, we study a proof-of-concept classification problem, separating the ADNI subjects into the three subgroups of control, MCI, and AD, based uniquely on empirical and/or virtual connectomic data. The target classification labels in these three groups are already provided within the ADNI dataset and we assume them to be exact (see Materials and Methods for a summary of the used stratification criteria). Possible input features for classification can be the following matrices (for the subject subsets for which they are available): empirical SCemp or FCemp; linear virtual SCSLM or FCSLM; nonlinear virtual SCMFM or FCMFM; and, finally, linear bi-virtual SCbi-SLM or FCbi-SLM; and nonlinear bi-virtual SCbi-MFM or FCbi-MFM. We chose to perform classification using a variant (Seiffert et al., 2010) of the random forest algorithm, which is particularly suitable when the number of input features is large with respect to the available data-points in the training set (Breiman, 2001) , as it is in our case (every connectivity matrix has 4560 potentially independent entries, corresponding to the number of upper-diagonal matrix entries in our parcellation with Q = 96 regions, see Materials and Methods). For illustration, we present here results for the subset of ADNI subjects for which a DTI empirical connectome SCemp is available. We thus discuss the relevance for classification of data completions, focusing thus on nonlinear SC-to-FC data virtual completion algorithms and their companion bi-virtual SC-to-FC-to-SC chains ( Figure 5 ).\nHere (and in the following), the dataset of 88 subjects with available SCemp is randomly split into a training set and a testing set (with maintained relative proportions of subjects of the three Control, MCI and AD categories). The classifier is then trained on the training set and classification performance benchmarked on the testing set, to assess generalization capabilities. Classification performance can vary depending on the specific chosen split. Since we are here interested in quantifying lower bounds to the amount of information that the different types of features can potentially bear, more than assessing an expected performance, we repeated training multiple times to distillate a \"purified subset\" of high-performance classifiers, performing better than average classifiers (see Materials and Methods for details).\nWe considered first the baseline classification performance that we could tendentially achieve training random forest classifiers on the original SCemp features themselves ( Figure 5A , light blue; data completion not used at all). We then quantified tendential classification performance based on: the virtually completed FCMFM ( Figure 5A , dark green; empirical data not used at all); on the pairs made by the actual empirical SCemp and the virtually completed FCMFM (Figure 5A , magenta; exploits synergy between SC and FC, mixing empirical and virtual features); and, finally, on the pairs made by the virtually completed FCMFM and the bi-virtual SCbi-MFM ( Figure 5A , violet; exploits synergy between SC and FC features and empirical data are not used at all, replaced by their bivirtual counterparts). Figure 5B reports Receiver Operator Curve (ROC) analyses of the purified classifier performance for all Different ROC curves are derived for different choices of the target class to predict. In plain words, once the input features for a subject are fed into the classifier, the classifier returns a probability for this subject to belong to the target class. A hard threshold is arbitrarily set, such that a subject is labeled to be of the target type (or not) depending on the output probability being respectively larger (or smaller) than the adopted threshold. When a very high threshold is taken, only a few subjects will be labeled to belong to target class (there may be many \"false negatives\") but there will also be little \"false positives\". On the contrary, when the threshold is low, the number of \"false negatives\" will decrease but the number of \"false positives\" will increase. The ROC curve precisely describes how the fractions of \"true\" (TPR) and \"false positives\" (FPR) evolve by gradually lowering the probability threshold to classify a subject as belonging to target class, interpolating between the lower left corner (TPR = FPR = 0, maximum threshold, no subjects classified as belonging to target class) and the upper right corner (TPR = FPR = 1, minimum threshold, all subjects classified as belonging to target class). A ROC curve following the diagonal on the TPR/FPR plane would correspond to a classification performance level expectable from random guessing. Performance better than chance level is indicated by ROC curves lifting toward the upper left corner (TPR = 1, FPR = 0) or, equivalently, by increased \"Area Under Curve\" (AUC).\nIn Figure 5D , we also report distributions of the tendential classification precision, defined as the fraction of correctly classified subjects, at a fixed low recall level of 10%, defined as the fraction of subjects labeled by the classifier as belonging to the target class (see Materials and Methods) . Once again in plain words, we expect that when the threshold is high, only a small fraction of subjects is going to be labeled as belonging to the target class (low recall). However, we expect most of these subjects to be actual true positives since the classification threshold is conservative. Correspondingly the precision should be higher than for lower threshold when the recall will be higher but the number of false positives as well. Figure 5B shows that for all the considered input features choices, above chance-level performances could be achieved by random forest classifiers after training and ensemble purification. Remarkably, the ROC curves for purified classifiers trained on empirical only features of a single type (SCemp, light blue) or virtual only features of a single type (FCMFM, dark green) were very similar, indicating that a comparable amount for classificationrelevant information can be tendentially extracted from the original ADNI SC empirical data and the virtually completed FC connectomes. As anticipated, the use of SCemp and FCMFM as combined inputs (magenta) boosted tendential classification performance, leading to higher AUC (building on synergy redundancy or a mixture of both, see Discussion). Finally, this superior tendential performance of classifiers with combined SC and FC inputs was maintained when the original SCemp was replaced by its bi-virtual counterparts SCbi-MFM (violet). Figure 5D shows that similar relations hold for the achieved tendential classifier precisions at 10% of recall. Thus, overall, we found that classification based on purely virtual features can be tendentially achieved after ADNI dataset completion and that tendential classification performance (in terms of both AUC and precision) is not expected to be much lower than when actual empirical data are used (see Discussion for the implications of these results)."}, {"section_title": "Data augmentation", "text": "All data completion algorithms involve a stochastic component (apart from the purely deterministic linear FC-to-SC completion of Table 3 ). Therefore, running various times the algorithms will give rise to different virtual and bi-virtual connectomes, associated with the same initial empirical seed connectome. Such a feature allows generating out of a given empirical seed SC (or FC) connectome, not just one surrogate virtual FC (or SC) connectome but an arbitrarily large ensemble of surrogate virtual connectomes, forming the virtual cohort associated to a specific subject (see Materials and Methods). Every virtual cohort maintains a strict relation to its seed empirical subjects. In particular, distances between virtual connectomes sampled within two different virtual cohorts are always closely correlated to the distance between the respective seed connectomes of the two cohorts. Therefore, learning performed on virtual cohorts is expected to generate similar discrimination surfaces as learning on the original subjects, with the added benefits that training items in cohorts are way more numerous than the original empirical data. The use of wider ensemble of surrogate date with statistical distributions of multi-dimensional features equivalent to the original data is a common practice in machine learning, known as data augmentation (Yaeger et al., 1997; Taylor & Nitshcke, 2018) , and very popular e.g. in object recognition (where surrogate training data are produced by clipping or variously transforming copies of the original training images). Data augmentation aims to expand the training dataset beyond the initially available data to boost the learning by a classifier of the target categories (e.g. object identities). Crucial for dataset augmentation applications is that the surrogate data generated are not just identical to the actual data with some added noise but are genuinely new and can serve as actual good guesses for alternative (unobserved) instances of data-points belonging to the same category. Obviously, new information cannot be created, but the extraction of the available information can still be facilitated, leading to a concrete improvement of the generalization performance of the classifiers after data augmentation. Given that inter-relations between virtual cohorts mirror inter-relations between empirical subjects, surrogate connectomes in virtual cohorts could be naturally used to improve connectome-based classification via data augmentation.\nThe close relation between the original data and the respective virtual cohorts is visually evident in Figure  5C , where a distance-respecting non-linear t-SNE projection (Van Der Maaten & Hinton, 2008) has been used to represent in two dimensions the virtual cohorts of surrogate virtual FCMFM's associated to the 88 subjects with available SCemp (every dot corresponds here to the two-dimensional projection of a high-dimensional FCMFM; 100 different virtual FCMFM's have been generated starting from each one of the 88 SCemp connectomes). The connectomes composing the virtual cohorts represented in Figure 5C can be downloaded as Supporting File S5.\nTo prove that virtual cohorts can be used to perform data augmentation and boost connectome-based subject classification, we performed training of random forest classifiers expanding the training set to include not only one pair SCemp / FCMFM per subject but a larger group of pairs selected within the virtual cohort of Figure  5B . For training, SC was always set to SCemp and the FCMFM were chosen randomly among the 100 that were generated for each subject (excluding subjects in the testing set). The AUC curve for SCbi-MFM + FCMFM classification augmented by the use of virtual cohorts of FCMFM 's rather than just one FCMFM instance in training is shown in Figure 5B as a dashed violet line. Comparison with the solid violet line indicates that classification performance was further improved by data augmentation. More specifically, we compare in Figure 5D the classification precision (fraction of truly MCI subjects over the total number of subjects labeled as MCI by the classifier) at 10% recall (threshold selected to guarantee that at least 10% of the actual MCI subjects are classified as MCI subjects) or various classifier designs. The median precision at 10% recall that can be achieved classifying subjects based on actual SCemp connectomes was of ~60.8%. The precision achievable by classifier trained on an equal number of surrogate FCMFM connectomes (one surrogate FCMFM connectome per subject) was slightly but significantly smaller, at ~59.5% (here, and in the following, significance assessed via Kruskal-Wallis group-level comparison, p < 0.05). However, by performing training on a 100-times larger cohort of virtual FCMFM 's, the median performance level achievable with empirical data was not only restored but even significantly outperformed, reaching ~62.5%. This improvement is not a mere consequence of overfitting since we consider genuine generalization performance. In particular, performance is assessed via a cohort-adapted crossvalidation approach, i.e. training data are selected from only an equilibrated subset of cohorts, and performance monitored on validation data from the complementary subset of cohorts. Last but not least, to a larger number of items used for training correspond also a larger number of validation items to classify (cohorts are used both in training and validation, see Materials and Methods). Therefore, the slight but significant precision improvement can be explained only by an enhancement of learning, due to the artificial boost of training dataset size provided by data augmentation.\nThe tendential precision of classification was further improved by the use of combined SC and FC features as input, even when fully virtual pairs (here, SCbi-MFM + FCMFM) are used. In this case (and analogously, when mixed empirical/virtual pairs SCemp + FCMFM are used) the median precision rose indeed significantly to over ~64%. However, in this case, data augmentation by using cohorts rather than a single FCMFM instance per subject did not yield further significant improvements of tendential performance."}, {"section_title": "Discussion", "text": "We have here demonstrated the feasibility of connectomic dataset completion (and even augmentation) using algorithms based on mean-field computational modeling. In particular, we have completed an ADNI gold standard connectomic dataset. We have then shown that the use of virtual connectomic data improves automated subject classification. Furthermore, classification based uniquely on surrogate data can approach the same performance levels as of empirical data. The capacity to extract more clinically-relevant information from empirical data is central for making progress in predictive and personalized neurology. Neurodegenerative diseases are a dramatic burden, linked to massive economic costs for healthcare growing in an aging society, outrun only by the quality of life decrease and intimate feeling of \"mind fading away\" experienced by patients and their friends and family. This is true in particular for Alzheimer's disease (AD), which is one of the most common types of dementia and one of the most widely studied progressive neurodegenerative disorders. Small and incomplete datasets for clinical research are certainly among the factors contributing to slow progress in the development of new diagnostic and therapeutic tools. Our methodological proposal aims precisely at relieving these two problems.\nData completion procedures allowed us to infer Functional Connectivity when only Structural Connectivity was available or Structural Connectivity (SC) when only Functional Connectivity (FC) were available. Such procedures for data completion could easily be implemented within popular neuroinformatic platforms as The Virtual Brain (TVB). TVB provides practical graphical interfaces or fully scriptable code-line environments for \"plug-and-play\" large-scale brain network modeling, signal emulation, and dataset management, including simulating SC and FC with adjustable complexity MFMs or SLMs (Sanz-Leon et al., 2013) . In this way, capitalizing on the software built-in capabilities, even the more elaborated non-linear completion algorithms could become accessible to non-expert users with only a little training.\nThe possibility of having access to both types of connectomic information brought up by model-based data completion is vital because structural and functional connectivity convey complementary information. It has been shown for instance, that analyses of SC-to-FC inter-relations can yield better characterizations and group discriminations than analyses of SC or FC alone in a variety of pathologies or conditions (Zhang et al., 2011; Davis et al., 2012; Zimmermann et al., 2016; Straathof et al., 2019) .\nIndeed, FC networks in the resting-state do not merely mirror SC but are believed to be the by-product of complex dynamics of multi-scale brain circuits (Honey et al., 2007; Deco et al., 2011) . As such, they are constrained but not entirely determined by the underlying anatomy (encoded in the SC matrix) and FC also carries valuable information about the dynamic regime giving rise to the observed resting-state activity fluctuations (Hansen et al., 2015) . In particular, brain networks are thought to operate at a regime close to criticality. For a fixed SC, the resulting FC would be different depending on how close to a critical working point dynamics is tuned (Deco et al., 2013; Hansen et al., 2015) . This information that brain networks are supposed to operate close to a critical boundary is used to generate the surrogate virtual FCMFM, when performing non-linear SC-to-FC completion. Thus, FCMFM carries indirectly extra information about a (putative) dynamic regime that was not conveyed by the original empirical SC (nor by virtual completions with linear SLM-based pipelines). This may be one of the reasons why the classification performance using combined empirical SC and virtual FC is superior to the one based on empirical SC alone, even if the virtual FCMFM's have been derived from the empirical SC. The data completion procedure has \"injected\" useful information in FCMFM, in particular, information about the dynamical regime, in which the brain is expected to be in. This generation of supplementary information is possible due to the mechanistic nature of the virtual brain models, taking advantage of the synergy of dynamic modeling constrained by subject-specific structural data. The performance improvement observed in classification suggests that the closeness-to-criticality hypothesis informing non-linear data completion is a reasonable dynamic network mechanism for the resting state. It also provides further support for the predictive capacity of connectome-based personalized brain network models.\nWhen both empirical SC and FC were available, we could measure the quality of reconstruction achieved by our models. The correlation reached between empirical and reconstructed connectivity matrices is only moderate, however. There are multiple reasons for this limited performance. One evident reason is the simplicity of the neural mass model adopted in our proof-of-concept illustration. The Wong-Wang neural mass model is able only to express two states of lower or higher local activation (Wong & Wang, 2006) . Instead, neuronal populations can display a much more extensive repertoire of possible dynamics, including e.g., coherent oscillations at multiple frequencies, bursting, or chaotic trajectories (Stefanescu & Jirsa, 2008; Spiegler et al., 2011) . Synchronization in a network depends on various factors, including frequency, network topology, and time delays via signal propagation, all of which have been ignored here and in large parts of the literature (Deco et al., 2009; Petkoski & Jirsa, 2019) . It is acknowledged that delay-less approaches serve as a useful approximation . Nevertheless, we are aware that our choice to restrict our analyses on the subset of activation-based mechanisms introduces critical limitations. Indeed, our models, ignoring delaymediated synchronization, are incapable of capturing a range of dynamic oscillatory behaviors, such as multifrequency coupling or multiphase coupling. More sophisticated mean-field virtual brain models than the very simple one here explored could thus reach superior performance (see e.g. Stefanovski et al., 2019 ). Yet, even such a simple model, achieving such a limited reconstruction performance proved to be consistent and useful. First, when concatenating data completion pipelines to give rise to bi-virtual data, we found a robust selfconsistency, i.e. remarkable matching between e.g. the original SC and the bi-virtual SCbi-MFM, generated via the intermediated FCMFM step. Second, classification performance can be improved by using our virtual data (or maintained, by using our virtual instead of empirical data). Another reason for the only moderate quality of reconstruction is our choice of second-order moments, which is covariance and FC, as data feature for performance evaluation. The associated generative model giving rise to a stationary Gaussian probability distribution is a linear network model (Jaynes, 1957; Haken, 1983) . Only a linear model evaluated against a stationary time-series generated by a linear process would provide optimal performance values. As we here discussed several times, resting-state dynamics do not satisfy these properties, and thus, inferior performance is expected.\nTogether, these findings show that even if the reconstruction quality of our model-based completion procedures is modest, a meaningful relationship with the original seed data is still maintained, even after two steps of virtual completion. The use of simple models has the additional advantage of being less computationally expensive to simulate. This is particularly true for SLMs in which no attempt to emulate the non-linearity of neural population dynamics are made but for which the availability of analytical formulas for completion even removes the need for direct simulation. On the other hand, nonlinear MFM simulations can take very long times, which can become an obstacle, especially for nonlinear FC-to-SC completion, where multiple simulations must be run. However, SLM-based procedures cannot be used for data augmentation, because they cannot generate a multiplicity of different surrogate connectomes starting from a shared seed empirical one.\nWe have shown that data augmentation can boost classification performance. Indeed, the redundancy present in stochastic ensembles of virtual connectivity matrices, generated via swarms of MFM simulations with different random initial conditions and noise realizations, can help training. We stress once again that we should not interpret data augmentation as a way to increase the information contained in the dataset: we cannot create information! Such is a consequence of the information theoretic concept of data processing inequality (Cover & Thomas, 2006) . But it is also known that redundant information can improve the performance of decoding and classification (Guyon & Elisseeff, 2003) , which is the key point that we exploit here in model-based connectomic data completion. Computational models such as MFM do not provide mappings between input and output connectomes, but rather between statistical ensembles of connectomes, with both mean and correlated dispersion realistically shaped by trustworthy non-linear dynamics. In other words, differences between alternative connectomes in a generated surrogate virtual cohort are not mere \"noise\", but reflect realistic datacompliant possibilities of variation. The different connectome realizations sample indeed the specific landscapes of possible FCs that may be compatible with a given SCs, degenerate because the allowed dynamics to unfold along with low-dimensional manifolds, rather than being frozen in strict vicinity of a trivial fixed point (Mehrkanoon et al., 2014; Pillai & Jirsa, 2017) . Data augmentation constitutes thus a possible way to generate more massive training sets for machine learning applications, as far as the seed empirical dataset is well representative of the expected population variability. However, by capitalizing exclusively on redundancy, augmentation cannot replace the gathering of more empirical data (Carrillo et al., 2012; Toga et al., 2016) . Unfortunately, federation (or even mining) of data is often impeded by unavoidable juridical concerns linked to strict and diverse regulations (Dulong de Rosnay, 2017; Thorogood et al., 2018) The use of virtual cohorts may relieve this burden. Virtual cohorts maintain their statistical relation to the original data, in a way sufficiently good to be exploitable for classification, but do not precisely match the original data. They maintain an inherent variability, indeed, due to the nature of the SC-to-FC link mediated by complex dynamics. Virtual data carry information operationally equivalent to the one carried by empirical data but not the same information. As such, it is not possible to reconstruct the original subject data from virtualized connectomes, and privacy concerns are considerably reduced if not entirely removed. We thus anticipate a near future in which virtual cohorts, providing vast numbers of virtual and bi-virtual connectivity information, would play an increasing role in massive data-driven explorations of factors predictive of neurodegenerative disease progression."}, {"section_title": "Materials and Methods", "text": ""}, {"section_title": "Data Sample", "text": "Data used in the preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu). The ADNI was launched in 2003 as a public-private partnership, led by Principal Investigator Michael W. Weiner, MD. The primary goal of ADNI has been to test whether serial magnetic resonance imaging (MRI), positron emission tomography (PET), other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of mild cognitive impairment (MCI) and early Alzheimer's disease (AD).\nRaw neuroimaging data from the Alzheimer's Disease Neuroimaging Initiative (ADNI) GO/2 studies (Wyman et al., 2013; Beckett et al., 2015) were downloaded for 244 subjects. These included T1w images for all subjects, as well as DWI and rsfMRI images for separate cohorts of subjects. An additional 12 subjects for which both DWI and rsfMRI were acquired in the same session were identified and their data also downloaded.\nA volumetric 96-ROI parcellation was defined on the MNI template and consisted of 82 cortical ROIs from the Regional Map parcellation (Kötter & Wanke, 2005) and an additional 14 subcortical ROIs spanning the thalamus and basal ganglia. Details on the construction of the 96-ROI parcellation can be found in Bezgin et al (2017) .\nAmong the 244 subjects we downloaded, 74 were control subjects, while the others were patients at different stages of the pathology progression. In this study, we performed a rough coarse-graining of the original ADNI labels indicating the stage or type of pathology. We thus overall labeled 119 patients as \"MCI\" (grouping together the labels 4 patients as \"MCI\", 64 as \"EMCI\" and 41 as \"LMCI\") and 51 patients as \"AD\".\nOverall, T1 and DTI were jointly available for 88 subjects (allowing to reconstruct structural connectivity (SC) matrix), and T1 and fMRI for 178 (allowing to reconstruct functional connectivity (FC)). However, among the 244 subjects we downloaded, only 12 subjects (referred to as the \"SCemp+FCemp\" subset) had a complete set of structural and functional images (T1, DTI, fMRI), hinting at how urgently needed are data completion and augmentation."}, {"section_title": "Data Preprocessing", "text": "Neuroimaging data preprocessing was done using a custom Nipype pipeline implementation (Gorgolewski et al., 2011) . First, raw neuroimaging data were reconstructed into NIFTI format using the dcm2nii software package (https://www.nitrc.org/projects/dcm2nii/). Skull stripping was performed using the Brain Extraction Tool (BET) from the FMRIB Software Library package (FSL v5) for all image modalities prior to all other preprocessing steps. Brain extraction of T1w images using BET was generally suboptimal and was supplemented by optiBET (Lutkenhoff et al., 2014) , an iterative routine that improved brain extractions substantially by applying transformations and back-projections between the native brain mask and MNI template space. Segmentation of the T1w images was performed using FSL's FAT tool with bias field correction to obtain into three distinct tissue classes.\nTo improve the registration of the ROI parcellation to native space, the parcellation was first nonlinearly registered to a publicly-available older adult template (aged 70-74 years, Fillmore et al., 2015) using the Advanced Normalization Tools (ANTS, Avants et al., 2011) software package before subsequent registrations.\nDiffusion-weighted images were preprocessed using FSL's eddy and bedpostx tools. The ROI parcellation was first nonlinearly registered to each subject's T1w structural image and then linearly registered to the DWI image using ANTS.\nrsfMRI data were preprocessed using FSL's FEAT toolbox. Preprocessing included motion correction, highpass filtering, registration, normalization and spatial smoothing (FWHM: 5 mm). Subjects with excessive motion were excluded from our sample. Global white matter and cerebrospinal fluid signals (but not global mean signal) were linearly regressed from the rsfMRI data.\nAll images were visually inspected following brain extraction and registrations to ensure correctness."}, {"section_title": "SC Construction", "text": "Details of tractography methods for reconstructing each subject's structural connectome can be found in Shen et al (2019 a, b) . Briefly, FSL's probtrackx2 was used to perform tractography between all ROIs. The set of white matter voxels adjacent to a grey matter ROI was defined as the seed mask for that particular ROI. Grey matter voxels adjacent to each seed mask were used to define an exclusion mask. For intrahemispheric tracking, an additional exclusion mask of the opposite hemisphere was additionally defined. Tractography parameters were set to a curvature threshold of 0.2, 5000 seeds per voxel, a maximum of 2000 steps and a 0.5 mm step length. The connection weight between each pair of ROIs was computed as the number of streamlines detected between the ROIs, divided by the total number of streamlines sent from the seed mask. This connectivity information was compiled for every subject in a matrix of empirical structural connectivity SCemp."}, {"section_title": "rsfMRI Timeseries and FC Construction", "text": "Empirical rsfMRI time-series for each ROI were computed using a weighted average approach that favored voxels nearer the center of each ROI . Each subject's matrix of empirical functional connectivity FCemp was determined by Pearson correlation of these recorded rsfMRI time-series."}, {"section_title": "SLM models", "text": "The SLM model used in this study is a linear stochastic system of coupled Ornstein-Uhlenbeck processes which is deeply investigated in (Saggio et al., 2016) . For each brain region, neural activity # ( ) is modeled as a linear stochastic model, coupled to the fluctuations of other regions:\nwhere A is the coupling matrix, is a normal Gaussian white noise and the standard deviation of the local drive noise. The coupling matrix A can be written as:\nwhere I is the identity matrix, G is the global coupling parameter and W is a weight matrix set to match SCemp. The negative identity matrix guarantees that the nodes have a stable equilibrium point. If all the eigenvalues of A are negative, which happens for all positive values of G < Gcritic = 1 ( # ) ⁄ (where # are the eigenvalues of W), the system will be in an equilibrium state. After some mathematical steps (Saggio et al., 2016) , the covariance matrix between regional fluctuations can be analytically expressed at this critical point Gcritic as:\n(3) whose normalized entries provide the strength of functional connectivity between different regions. The noise strength can be arbitrarily set at the critical point since it provides only a scaling constant to be reabsorbed into the Pearson correlation normalization. However, the only parameter that needs to be explored is , whose range goes from Gmin = 0, i.e. uncoupled nodes, to slightly before Gcritic = 1 ( # ) ⁄ , or Gmax = Gcritic -. In Figure  S1A , running explicit simulations of SLM models for different values of coupling G and evaluating on the \"FCemp + SCemp\" subset of subjects the match between the simulated and empirical activity correlation matrices, we confirm (cf. e.g. Hansen et al., 2015) that the best match (max of Pearson correlation between the uppertriangular parts of the empirical and virtual FCs) is obtained at a slightly subcritical point for G* = Gcritic -."}, {"section_title": "Linear SC-to-FC and FC-to-SC completion", "text": "Every subject in the \"FCemp + SCemp\" subset has a different value of G*. To infer FCSLM from SCemp for the subjects with missing functional data, we chose to always use a common value G*ref = 0.83, which is the median of G* for all 12 \"FCemp + SCemp\" subjects (the error made in doing this approximation is estimated to be less than 1% in Fig. S1C ). When the connectome FCemp is not known, equations (2) and (3) can directly be used to evaluate the covariance matrix C (setting σ = 1 and G = G*ref). We then estimate the regional fluctuation covariance from these inferences and normalize it into a Pearson correlation matrix to infer FCSLM (See pseudo-code in Table 1 , line 1). Linear FCSLM completions for our ADNI dataset can be downloaded as Supporting File S1.\nTo infer SCSLM from FCemp, we invert the analytical expressions of eqs. (2) and (3) where C is the covariance matrix estimated from empirical BOLD time-series. The linearly completed SCSLM is then set to be identical to W* setting its diagonal to zero to avoid offsets, which would be meaningless given the conventional choice of noise σ which we have made (see Table 3 , line 3). Note that all the free parameters of the SLM model appear uniquely as scaling factors and do not affect the (normalized) correlation of the inferred SCSLM with the SCemp. However, the absolute strengths of inferred structural connections remain arbitrary, with only the relative strengths between different connections being reliable (since unaffected by arbitrary choices of scaling parameters; see pseudo-code in Table 3 ). Linear SCSLM completions for our ADNI dataset can be downloaded as Supporting File S3."}, {"section_title": "MFM models", "text": "For non-linear completion algorithms, we performed simulations of whole-brain mean-field models analogous to Deco et al. (2013) or Hansen et al. (2015) . We used a modified version of the mean-field model designed by Wong and Wang (2006) , to describe the mean neural activity for each brain region, following the reduction performed in (Deco et al., 2013) . The resulting neural mass equations are given by: \nwhere # represents NMDA synaptic input currents and F the NMDA decay time constant; # is collective firing rates; = 0.641 is a kinetic parameter; = 270( . ) :> , = 108 , = 0.154 are parameters values for the input-output function; # are the total synaptic inputs to a regions; W = 0.2609 is an intensity scale for synaptic currents; is the relative strength of recurrent connections within the region; #Z are the entries of the SCemp matrix reweighted by global scale of long-range connectivity strength G as a control parameter; is the noise amplitude, and # is a stochastic Gaussian variable with a zero mean and unit variance. Finally, \\ represents the external input and sets the level of regional excitability. Different sets of parameters yield different neural network dynamics and, therefore, patterns of FCMFM non-stationarity.\nTo emulate BOLD fMRI signals, we then transformed the raw model output activity # through a standard Balloon-Windkessel hemodynamic model. All details of the hemodynamic model are set according to Friston et al. (2003) ."}, {"section_title": "Bi-virtual data completion", "text": "The pipelines for data completion described above can be concatenated, by performing e.g. FC-to-SC completion on a virtually FC or SC-to-FC completion on a virtual SC (rather than actual FCemp or SCemp, respectively). In this way, one can create bi-virtual counterparts SCbi-MFM (FCbi-MFM) or SCbi-SLM (FC bi-SLM) for any of the available empirical SCemp (FCemp) by applying in sequence non-linear MFM-based or linear SLM-based procedures for SCto-FC and then FC-to-SC completion (or, conversely, FC-to SC followed by SC-to-FC completions) . Linear bi-virtual completions for our ADNI dataset can be downloaded as Supporting File S6 (for SCbi-SLM and FCbi-SLM) and nonlinear completions as Supporting File S7 (for SCbi-MFM and FCbi-MFM)."}, {"section_title": "Supervised subject classification", "text": "As previously mentioned, we separated subjects in our ADNI-derived dataset in three subgroups: \"controls\", \"MCI\" and \"AD\". We focus here on the \"one vs all\" task of classifying \"MCI\" subjects against \"controls\" or \"AD\", given that early diagnosis is one of the aims for which our data completion and augmentation approaches could use in perspective. Subjects (the actual ones or their associated virtual counterparts) are thus labeled as \"positive\" when belonging to the MCI subgroup or \"negative\" otherwise. We construct classifiers based on different types of input features. For classification based on empirical data only, we used as input features a vector of the independent entries (upper-triangular part) of the SCemp matrix (light blue color in Figure 5 ). For classification based on single-type virtual data only, we used as input features a vector of the independent entries of the non-linearly completed FCMFM matrix (green color in Figure 5 ). We then performed classification based on combined (empirical) SC and (virtual) FC, by providing as input features the concatenated vectors of the upper triangular parts of SCemp and FCMFM (magenta color in Figure 5 ). Finally, we performed classification based on combined (bi-virtual) SC and (virtual) FC, by providing as input features the concatenated vectors of the upper triangular parts of SCbi-MFM and FCMFM (violet color in Figure 5 ). The same training and performance assessment schemes were used for all types of input features (and could be generalized to other combinations of input features or target positive labels as well).\nWe chose as classifier a boosted ensemble of 50 shallow decision trees, training it using the RUSBoost algorithm (Seiffert et al., 2010) , particularly adapted to data in which \"positive\" and \"negative\" labels are unbalanced. We adopted a 5-fold cross-validation approach and quantified fractions of true and false positives (numbers of true or false positives over total number of actual positives) as well as precision (number of true positives over numbers of items classified as positives, i.e. fraction of the positives correctly classified as such) during generalization (i.e. prediction performed on the folds of data not actually used for training). True positive fraction (or recall), false negative fraction and precision depend all on an arbitrary threshold to be applied to the classifier ensemble output to decide for positivity of not of the input data. In Figure 5B , receiver operator curves (ROC) generated by smoothly growing this threshold between a minimum and a maximum value and plotting how the True and False positive fractions vary for the different threshold values. In Figure 5D , precision was evaluated at the threshold providing the recall value closest to 10%. The entire cross-validated training and performance estimation value was repeated 5000 times. Since, in this context, we are interested in quantifying how far can be pushed lower bounds to the amounts of extractable information from the different type of features (rather than in building actual classifiers for specific applications), out of the 5000 classifier training experiments, we discarded the runs leading to weaker performance and retained only the 500 ones leading to cross-validated performances in the top decile. We thus plot in Figure 5B , the median ROCs over the 500 retained forest training experiments, for every chosen combination of inputs. Analogously, in Figure 5D , we plot distributions of achieved precision at 10%-recall over training runs in this top-decile. Our purified training procedure estimates thus how high is the performance that could be achieved tendentially by classifiers trained in different input feature combinations. We must keep in mind, however, to avoid confusion, that tendential performance estimates in Figures 5B and 5D are by construction superior to the expected medians, whenever pre-selection of top-performing classifiers was not applied. Once again, this is not a problem when being interested, as in the context of this study, in estimating lower bounds to tendentially achievable performances."}, {"section_title": "Virtual cohorts and data augmentation", "text": "In data augmentation, the size of the original dataset (limited by the total number of subjects with available empirical connectomic information of either SC or FC type) is artificially boosted by generating a much larger number of virtual subjects with multiple alternative (but all equally valuable) completions of the missing connectomic data. Concretely, to generate the virtual cohort dataset, we took the 88 subjects in the SCemp only dataset (including 21 AD subjects, 35 MCI, and 32 Control subjects) and run for each of them the non-linear SCto-FC completion algorithm 100 times, using each time a different random seed. The net result was a group of 100 alternative FCMFM instances for each of the subjects, yielding in total a virtual cohort of 8800 FCMFM matrices to be potentially used for classifier training. Such a cohort can be downloaded as Supporting File S5. To generate Figure 5C , showing a dimensionally reduced representation of the relative distances between these 8800 virtual matrices, we used an exact t-SNE projection (Van Der Maaten and Hinton, 2008) of the vectors of uppertriangular parts of the different FCMFM 's toward a two-dimensional space, using a default perplexity value of 30 and no-exaggeration.\nWe then performed data augmentation during classifier training based on this virtual cohort. For classification based on single-type virtual features only (i.e. only FCMFM), we used the entire cohorts of 8800 FCMFM matrices to select from training and testing sub-folds during cross-validation. This means that both the size of training and validation sub-datasets were enlarged. Importantly, however, when sampling sub-folds for 5-fold crossvalidated training, we still excluded from the training set all matrices deriving from a randomly selected fifth of the subjects. In this way the validation subset included not only different matrices than the one used for training but, beyond that, different matrices generated from subjects that did not contribute any matrix to the training set. In this way, we can be sure that improved cross-validated performance estimations do not reflect overfitting but actually improved learning. To perform classification based on combined SCemp and FCMFM , we constructed an augmented dataset by including for each of the subjects 100 virtual pairs of connectomes, combining the same SCemp with each of the possible 100 FCMFM 's. Finally, when combining bi-virtual SC and virtual FCs, we analogously always combined the same SCbi-MFM instance with each of the 100 FCMFM 's available for each subject. In principle, it would have been possible to generate as well a multiplicity of alternatives same SCbi-MFM counterparts, leading to an even more varied augmented dataset, but we were limited by the computational resources needed to build a multiplicity of alternative SCbi-MFM 's for each of the subjects in our ADNI-derived dataset (nonlinear FC-to-SC completion is way harder computationally than SC-to-FC completion). Finally, tendential true and false positive fractions and precisions were evaluated in the same way as for the non-augmented datasets (multiple training runs, followed by purification), i.e. via retaining only the top decile of 5000 independent cross-validated training runs over the augmented datasets."}, {"section_title": "Figure 1. Connectomic information extracted from the ADNI dataset has gaps.", "text": "A) The different dataset releases by the ADNI consortium include a variety of information relative to different biomarkers and imaging modalities. Here, we focus on structural and functional MRI features and, chiefly: T1, DTI (allowing to extract empirical structural connectomes); and resting-state fMRI BOLD time-series (allowing to extract empirical functional connectomes). B) Matrices SCemp and FCemp summarizing connectomic information about, respectively structural connectivity (SC) and functional connectivity (FC) are obtained via elaborated multi-step processing pipelines, using various software including FreeSurfer, FSL, ANTS, and MRtrix3. C) The total number of ADNIderived subjects investigated in this study is 244, in which 74 subjects were control, while 119 subjects labeled as MCI, and 51 subjects as AD. Out of these 244, FCemp could be extracted for 168 subjects, and SCemp for 88. However, SCemp and FCemp were both simultaneously available for just a minority of 12 subjects (referred to as the \"SCemp+FCemp subset\"). The available data is shown in blue and the missing data in grey, the SCemp+FCemp subset is shown in pink."}, {"section_title": "Figure 2. From mean-field modeling to connectomic data completion. A)", "text": "We present here a graphical summary of the various computational simulation and inference strategies used in this study to bridge between different types of connectivity matrices. Mean-field simulation and the associated analytic theory can be used to generate virtual FC, through simulations of resting-state whole-brain models embedding a given input SC connectome (ascending arrows). Algorithmic procedures, that may still include computational simulation steps, can be used to perform the inverse inference of a virtual SC that is compatible with a given input FC (descending arrows). Both simulation and inference can be performed using simpler linear (green arrows) or non-linear (blue arrows) approaches. When the input SC (or FC) connectomes used as input for FC simulation (or SC inverse inference) correspond to empirical connectomes SCemp (or FCemp), derived from ADNI T1 and DTI (fMRI) images, then model simulation (inversion) can be used to complete gaps in the dataset, whenever FCemp (or SCemp) is missing. We refer then to these operations as: B) SC-to-FC completion; and, C) FC-to-SC completion. Both exist in linear and non-linear versions. D) The Virtual Brain neuroinformatic platform (whose logo is shown here) provides a simulation environment particularly suitable to perform operations of connectomic-dataset completion. Simulations of a non-linear model embedding a given input SCemp matrix can be used to generate surrogate FCMFM matrices. A) Systematic exploration (here shown for a representative subject) of the dependency of the correlation between FCemp and FCMFM on the MFM parameters G (inter-regional coupling strength) and τ (synaptic time-constant of within-region excitation) indicates that the best fitting performances are obtained when parameters are concentrated in a narrow concave stripe across the G/τ plane. B) Enlarged zoom of panel A over the range G ∈ [1 3] and τ ∈ [10 30]. C) For a value of τ = 25, representatively chosen here for illustration, we identify a value G* for which the Pearson correlation between FCemp and FCMFM reaches a clear local maximum. Panels A-C thus indicate that it makes sense speaking of a bestfit zone and that reliable nonlinear SC-to-FC completion should be performed using MFM parameters within this zone. Three criteria help us identifying parameter combinations in this best fitting zone when the actual FCemp is unknown. D) First criterion: we define the spatial coefficient of variation of the time-series of simulated BOLD activity TSMFM as the ratio between the variance and the mean across regions of the time-averaged activation of different regions. The best fit zone is associated with a peaking of this spatial coefficient of variation, associated with a maximally heterogeneous mix or low and high activation levels for different regions (see time-series cartoons for three working points below the CV surface). E) Second criterion: in the best fitting zone, the resulting FCMFM is neither randomly organized nor excessively regular (synchronized) but presents a complex clustering structure (see lower cartoons), which can be tracked by a peak in the clustering coefficient of the FCMFM, seen as weighed adjacency matrix. F) Third criterion: in the best fitting zone, resting-state FCMFM display a relatively richer dynamics than in other sectors of the parameter space. This gives rise to an \"FCD matrix\" (correlation between time-resolved FC observed at different times) which is neither random nor too regular but displays a certain degree of clustering (see lower cartoons). The emergence of complex dynamics of FC can be tracked by an increase in the clustering coefficient of the FCD matrix extracted from simulated resting-state dynamics. G) The boxplot shows the distribution of correlations between the actual FCemp and FCMFM estimated within the best fitting zone for all subjects from the \"SCemp + FCemp\" subset. An iterative procedure can be used to perform resting-state simulations of an MFM model starting from a randomly guessed structural connectome SC* and progressively modify this SC* to make it compatible with a known target FCemp. A) Starting from an initial random SC*(0) matrix, there is no correlation between the target FCemp and the generated FC*(0) matrix. However, by adjusting the weights of the used SC* through the algorithm of Table 4 , SC* gradually develops a richer organization, leading to an increase of the correlation between FC* and FCemp (violet dashed line) and, in parallel, of the correlation between SC* and SCemp (violet solid line), as shown here for a representative subject within the \"SCemp+FCemp\" subset. The algorithm stops when the correlation between FC* and the input target FCemp reaches a desired quality threshold (here 0.7 after 2000 iterations) and the SC* at the last iteration is used as virtual surrogate SCMFM. B) The boxplot shows the distribution of correlation between SCemp and SCMFM for all subjects in the \"SCemp + FCemp\" subset. C) The correlation between SCemp and SCMFM can vary using different random initial connectomes SC*(0). Here we show a boxplot of the percent dispersions of the correlation values obtained for different initial conditions around the median correlation value. The fact that these dispersions lie within a narrow interval of ±2.5% indicates that the expected performance is robust against changes of the initial conditions."}, {"section_title": "Figure 5. Machine-learning classification of MCI patients based on empirical and virtual connectomes. A)", "text": "We quantified lower bounds to the best performance that machine-learning classifiers can reach in classifying subjects as being affected by early-stage dementia or not (\"MCI vs all\", i.e. neither labeled \"AD\" nor \"Control\", but \"MCI\"), based purely on connectome matrices of different types or type combinations: actual empirical connectomes (here, SCemp, light blue color); their virtual counterparts (here, FCMFM, non-linearly completed from SCemp, green color); a combination of empirical and virtually-completed connectomes of different types (here, SCemp combined with FCMFM, magenta color); and, a combination of virtual and bi-virtual connectomes of different types (here SCbi-MFM combined with FCMFM, violet color). B) We trained random forest classifiers based on these different combinations of input features, isolated a subset of the top-10% best random-ensemble classifiers we could train and assessed their average MCI detection performance (tendential classification performance, i.e. a lower bound to the best performance we could achieve). We show here median Receiver Operator Curves (ROCs) for MCI detection for different combinations of empirical and input features (generalization performance, via 5-fold cross-validation). High-performance classifiers trained on virtual and bivirtual features can reach areas under curves indistinguishable from high-performance classifiers trained on empirical features. Non-linear data completion (here, complementing SCemp combined with FCMFM) leads to superior performance, especially when combined with data augmentation (dashed ROC curve). C) We generated virtual cohorts of surrogate FC data for data augmentation purpose (i.e. facilitating training, by increasing training dataset size with appropriate surrogates). We generated 100 different FCMFM matrices for each of the 88 subjects with an available SCemp. Shown here is a low-dimensional t-SNE projection of the resulting 8800 virtual FCMFM 's. D) Classifier trained on augmented datasets (i.e. datasets where the training and validation datasets have an artificially enlarged size, by the use of the many alternative variants of virtual FCMFM available for each of the SCemp or SCbi-MFM), achieve superior performance than classifiers trained without FM-based data augmentation. Shown here are boxplots of the precision (at 10% recall) achieved by high-performance classifiers, trained with different input datasets. Median precision for classifiers trained on FCMFM matrices (light green) is smaller than when training on SCemp matrices (light blue), however, the use of data augmentation restores and even improve precision (dark green). Combining SCemp with FCMFM matrices yields a further boost in performance (magenta), but, in this case, data augmentation is not helpful (black). A star denotes significantly different median precisions (Kruskal-Wallis, p < 0.05, Bonferroni corrected). Figure S1 . Linear SC-to-FC data completion. The functional data completion can also be done using the linear model starting from SCemp matrices. A) the systematic exploration (for a representative subject) of the dependency of correlation between FCemp and FCSLM on the SLM parameter G (global scale of long-range connectivity strength) shown by the violet line indicates that the best fitting value G* (dashed line) can be obtained slightly before the critical point of the system Gcritic = 1 ( # ) ⁄ which since the SCemp matrices are normalized to one 1 ( # ) ⁄ = 1 and Gcritic = 1. The green lines display 5 and 95 percentiles of bootstrap resampling. The inset boxplot gives the distribution of G* over all the subjects in the \"SCemp + FCemp\" subset; for the SLM SC-to-FC completion, we used a common value G*ref = 0.83, equal to the median of the boxplot. B) The boxplot reports the distribution of Pearson correlation between FCemp and FCSLM for all subjects from the \"SCemp + FCemp\" subset with a median equal to 0.243. C) In case of using the common value G*ref for all subjects instead of the actual personalized optimum G* for each subject in the \"SCemp + FCemp\" subset, the value of quality loss for each subject is shown in the boxplot with median equal to 0.5%. Figure S2 . The dependency of best MFM fit zone on additional regional dynamics parameters. In the nonlinear data completion, the global parameters of the MFM model are G (inter-regional coupling strength), τ (synaptic time-constant of within-region excitation), (relative strength of recurrent within-region connections) and I (external input) which parameters G and τ were investigated in this paper (see Figure 3 ). Here we showed for different values of and I, the narrow concave stripe of Figure 3 .A as the representative of the best fitting zone is slightly shifted in the G/τ plane, suggesting G and τ are more sensitive parameters and need to be explored rather than and I. Figure S3 . Linear FC-to-SC data completion. Using the linear model, it is equivalently possible to infer the structural SCSLM matrices from FCemp. Since in this approach the free parameters of SLM model appear as scaling factor, they don't affect the correlation of the inferred SCSLM with the SCemp so there is no need for parameter exploration here. The distribution of the correlation values for all the subjects from the \"SCemp + FCemp\" subset is shown in the boxplot with median equal to 0.21. Figure S4 . Bi-virtual connectomes. This figure shows the correspondence between empirical and bi-virtual SC and FC pairs, both when using chained linear (SLM-based) and nonlinear (MFM-based) completion procedures. A) For 88 subjects from the ADNI-subset with only SCemp available, considering the linear bi-virtual completion chain SCemp to FCSLM to SCbi-SLM, we obtained a median correlation between SCemp and SCbi-SLM equal to 0.636 (green boxplot); simultaneously, considering the non-linear bi-virtual completion chain SCemp to FCMFM to SCbi-MFM, we obtained a median correlation between SCemp and SCbi-MFM equal to 0.583 (blue boxplot). B) For 168 subjects from the ADNI-subset with only FCemp available, considering the linear bi-virtual completion chain FCemp to SCSLM to FCbi-SLM, we obtained a median correlation between FCemp and FCbi-SLM equal to 0.122 (green boxplot); simultaneously, considering the non-linear bi-virtual completion chain FCemp to SCMFM to FCbi-MFM, we obtained a median correlation between FCemp and FCbi-MFM equal to 0.597 (blue boxplot)."}]