[{"section_title": "", "text": "students at the most academically selective institutions . Lillard and Gerner (1999) included indicators for the percentage of a high school's class who go to college and whether the high school is in an urban setting, but these contextual measures were treated as control variables and were not featured in the analysis. Attewell (2001) introduced high school context effects into studies of selective college admissions. He argued that admission officers at Ivy League and other elite colleges and universities use an Academic Index (Al) to summarize the scholastic competence and potential of applicants. The Al is made up of three equal parts: a student's SAT I score, average scores on the SAT II or achievement tests, and percentile class rank. Because of the important role that class rank plays, students with very good grades and strong test scores at talent-rich high schools are at a competitive disadvantage relative to their even-moregifted peers. Unless these students are at the top of their class, they are more likely to gain acceptance to selective colleges and universities if they attend a less prestigious high school.\nAttewell ( Academic ability is such a vital component in admission to elite colleges and universities that a student is unlikely to be accepted if admission officers have serious reservations about his or her ability to perform in the classroom. This does not mean that admission deans are searching only for applicants who score 1600 on the SAT test, but it does suggest that there is a scholastic floor below which applicants will not be admitted (Karen 1991) . We therefore expect that, other things being equal, students who display stronger academic credentials will have a higher probability of being accepted.\nHypothesis 2: Without screening on information about individual students' scholastic abilities, applicants from \"better\" high schools stand a greater chance of being admitted.\nSome of the more prestigious high schools go to great lengths to burnish their reputations in the eyes of college admission deans. As Attewell (2001:279-80) noted, \"They do so in the belief that a student's success in gaining entry to a selective college is not simply a matter of the candidate's personal achievements, but also reflects the scholarly reputation and rigor of the high school she or he is graduating from.\" Colleges and universities respond by deploying admission officers to these elite secondary schools, by cultivating relationships with high school college counselors, and by encouraging a feeder system between particular secondary schools and elite colleges Yaqub 2002 ). The close relationships that develop between elite colleges and similarly elite secondary schools were illustrated by Cookson and Persell (1985:181) , who described instances in which college counselors from prestigious preparatory schools are invited to sit in on meetings of college admission committees. College admission offices are engaged, then, in a kind of \"academic profiling\" in which certain high schools are favored over others on the basis of their reputations for producing highly qualified students.\nHypothesis 3: If two students are equivalent in terms of individual academic merit and other social characteristics, the one from the more academically competitive high school has a smaller chance of being admitted to an elite college or university.\nWe hypothesize that institutional gatekeepers are susceptible to the effects of high school context. This hypothesis parallels findings by Davis (1966) and by Marsh and colleagues, cited earlier, that there is a negative effect of school-average achievement levels on occupational choice and academic selfconcept, when individual students' achievement is controlled. But here, following Attewell's (2001) work, we conjecture that frog-pond effects also work at the receiving end, where selective college admission officers must admit a relatively small number of students from a large pool of highly qualified applicants. Testing the frog-pond model of admission outcomes is the most important objective of this article. We hypothesize that with regard to acceptance at an elite college, it is more advantageous to be the strongest student in a less prestigious high school than an average student in an outstanding high school.\nHypothesis 4: The negative effect of schoolaverage achievement levels in Hypothesis 3 will be smaller for more academically talented students.\nAttewell's (2001) simulations imply that the size of the negative effect of high school academic context varies with the ability level of the student. As Attewell noted, \"Students at the top of star schools are not penalized by the class-rank emphasis. But students who are just below the top find that their SAT scores are 'worth' much less ... than if they received the same SAT scores and GPAs while attending a less selective high school\" (p. 277). Marsh and Hau (2003) and Marsh et al. (2001) examined the effect of an interaction between school-average ability and individual students' ability on academic self-concept and concluded that it is small. We expect that an interaction between individual students' achievement levels and school-average achievement levels will be positive.\nHypothesis 5: Information about high schools' academic environment makes a statistically significant contribution to our understanding of elite college admissions, net of other factors.\nSeveral authors have reported that high school contextual effects are typically \"small\" or \"modest\" in relation to the importance of individual students' attributes Eckland 1975, 1977 ; Hauser, Sewell, and Alwin 1976). Theory alone cannot tell us whether to expect that the effects of a secondary school's academic environment will be large or small. But our results would stand in contrast to a large literature if school effects, as perceived by college admission deans, outweighed the importance of applicants' social and academic characteristics. We expect to find that high school academic context is statistically significant when added to models that include individual students' attributes. We also expect that the impact of such institutional variables will be small in relation to students' academic and nonacademic merit."}, {"section_title": "DATA AND METHODS", "text": "We used data from the National Study of College Experience (NSCE), a collaborative study involving 10 academically selective colleges and universities for the purpose of gaining a better understanding of the paths that students follow through higher education. The 10 institutions are a subset of the 34 schools in the College and Beyond database (Bowen and Bok 1998). They contain geographic spread and represent public universities, private research universities, and small liberal arts colleges.' Each school was asked to supply information on all individual students who applied for admission in 1983, 1993, and 1997. This information included personal identifiers, whether the student was accepted, other data from the application form, and supplemental data from the offices of financial aid and the registrar if the applicant subsequently enrolled at that institution. In constructing the data set, we worked backward from elite colleges to applicants. Even though the analysis sample is a highly unrepresentative sample of all high school students who applied to college, the data are appropriate for analyzing the nature of elite college admissions."}, {"section_title": "Information on Students", "text": "For the purposes of this analysis, we used data from fall 1997 for three highly selective private research universities that represent the top tier of American higher education. SAT I scores average almost 1400 for entering freshmen. Data from these institutional records included the applicant's sex, race, citizenship, athletic and legacy status, SAT I scores, secondary school attended, and place of permanent residence. Academic ability is usually considered sufficiently multidimensional that no single measure adequately captures it. Initially, we considered two measures of individual students' academic achievement: the combined score on the SAT I math and verbal tests and the number of Advanced Placement (AP) tests an applicant had taken. These data were obtained from the Educational Testing Service (ETS).\nSAT score is a much-used measure of scholastic ability. Students can also signal their academic aptitude to elite colleges by taking a large number of AP examinations (Attewell 2001) . Students who take AP courses earn higher grades in college, major in more difficult subject areas, drop out of college at lower rates, and are more likely to seek graduate and professional degrees than are students who do not take AP classes (Curry, MacDonald, and Morgan 1999; Santoli 2002 ). Not only is there an advantage in college acceptance from having AP courses on the high school transcript, but it is the number and subject areas of the courses, rather than the grades received on the AP examinations, that matter most to admission deans (Santoli 2002 )."}, {"section_title": "Contextual Variables", "text": "We included two indicators of high school academic environment in our analyses. By using multiple measures, we had greater confidence that we would capture what is most significant about the academic strength of high schools and that our findings would be more robust if both indicators were related to admission outcomes in the same way. The first school-level variable was high school average SAT score. The College Board provid-ed the 1997 SAT I mean score for each secondary school, calculated from the latest scores of college-bound seniors.\nThe second measure of high school academic context was the number of AP tests taken per high school senior (Mathews 1998 ). This ratio is high when a large proportion of students takes AP tests and when the number of tests taken per student is large. Experienced admission officers suggest that elite colleges often rely on the number of AP courses a high school offers as an indicator of the rigor of the curriculum (Toor 2001 ). The numerator of this ratio is based on ETS data on the total number of AP tests that were taken at each high school in the 1996-97 academic year. The denominator is the size of the 12th-grade class in 1996-97. Data on the number of seniors in public schools came from the Common Core of Data, which were obtained from the National Center for Education Statistics (NCES). NCES's Private School Universe Survey contains comparable data for private schools.\nWe used two additional high school contextual variables. One is type of school (public, private, or religious), which is contained in data from the Student Descriptive Questionnaire (SDQ) that we acquired from ETS. A measure of a high school's academic reputation is also important. We asked seasoned admission officers at an Ivy League university to identify what they considered to be the \"top U.S. secondary schools.\" Their recommendations included both large and small private and public schools. We grouped their suggestions into a list of 72 elite secondary schools-ones that would be considered by knowledgeable observers to be among the nation's best.\nDescriptive information on the social and academic characteristics of the 45,549 applicants in our analysis file is presented in Table  1 .2 These three highly selective universities received an average of more than 15,000 applications for fall 1997. Slightly more than half the applicants were male; whites made up the largest applicant pool, followed by Asian students; most applicants were U.S. citizens; and only small proportions were athletes or legacies. The average acceptance rate in 1997 was just over 20 percent, meaning that these three institutions are among the most selective in the United States. Acceptance rates by category are shown in the second column of Table 1 . Among the major racial/ethnic groups, admission rates were the highest for blacks, followed by Hispanics, and the lowest for Asians. Athletes and legacies were accepted at rates that were more than double those for the typical student.\nThe SAT score distribution for these applicants is shown in the second panel of Table 1 . Two percent of the students had combined SAT scores that were below 1000. Most students had test scores that were well above 1300, and SAT scores overall averaged 1344. Because the average combined SAT I score for all SAT takers in 1997 was 1016, one sees how gifted the applicant pool was (College Board 2003). The chances of being admitted rose monotonically with each 100-point increase in SAT scores. But even in the highest SAT category (1500 and above), more than half the applicants were denied admission. Table 1 also shows the number of AP tests that these applicants took. Nearly one third of the sample, and almost 40 percent of the cases in which the number of tests is known, took fewer than three AP tests. Most students who took relatively few AP examinations in all likelihood attended high schools that did not offer many AP classes. Selective colleges and universities look unfavorably on applicants who could have taken AP courses and chose not to (Santoli 2002 ). Nearly 7 percent of the applicants took eight or more AP tests. These students were twice as likely to be admitted to the three universities in 1997 as were those with fewer than three AP tests. Table 2 contains data on the characteristics of the applicants' high schools. Nearly 60 percent of the applications received by the three universities in our study came from students who attended public high schools. Another sixth were from applicants at private, nonreligious institutions. Students who attend private schools have a somewhat better chance of being admitted to an elite university than have applicants from other kinds of secondary schools. Roughly 1 out of every 12 applications came from a candidate at one of the 72 elite secondary schools in our sample. These individuals were admitted at somewhat higher rates than were students at nonelite high schools. Data in the lower half of the table indicate that 14 percent of all the applications to the three universities came from students at schools where no AP examinations were taken, and slightly more (18 percent) came from students whose high schools averaged more than 1.5 AP tests per high school senior. In addition, 12 percent of the applications came from students in high schools whose average SAT score was lower than 1000. Most applicants, however, were from \"better\" schools. When attention is restricted to cases in which the average high school SAT score is known, nearly one quarter of the applications came from schools with an average SAT score of 1200 or higher. The probability of being accepted by an elite university is positively associated with both measures of a high school's academic strength.3"}, {"section_title": "RESULTS", "text": "The results from the empirical analysis are shown in Table 3 . We used logistic regression because the response variable is whether a given application was accepted (= 1) or not (= 0). Regression coefficients are exponentiated to reflect odds ratios. Model 1 includes applicants' demographic and social characteristics. Model 2 adds individual students' academic performance. In Model 3, students' scholastic ability is removed, and two indicators of high school academic reputation are added. Model 4 includes all student and institutional variables.\nWe begin by considering the influence of candidates' demographic and social characteristics. The effects of sex, race, citizenship, athletic ability, and legacy status in Model 1 are similar to those in Model 3. Female, black, Hispanic, recruited athlete, and legacy applicants receive statistically significant admission preferences, whereas Asians and non-U.S. citizens are at a disadvantage relative to those in the reference groups. Preferences are the largest for athletes, followed by those for children of alumni. Many of these effects are stronger in Models 2 and 4, in which measures of students' academic performance are included. Compared to Models 1 and 3, the odds of admission for applicants who are black, Hispanic, or recruited athletes increase by a factor of 2 or more. The preference for athletes outweighs that for any other group. Smaller increases are registered by women and legacies, and the Asian disadvantage increases. Asian applicants are more than 30 percent less likely to be admitted than are white candidates with the same academic accomplishments. The most striking of these changes can be explained by the fact that blacks and Hispanics have, on average, weaker academic credentials than have white applicants, and recruited athletes are less well prepared than are nonathletes. Asian students typically score higher on the SAT test and take more AP tests than do their white counterparts.4 We turn next to an examination of the five hypotheses."}, {"section_title": "Hypothesis 1", "text": "The results to test Hypothesis 1 are presented in Model 4 of Table 3 . Here, we control for students' personal characteristics and for high school academic environment. A student's score on the SAT I examination is positively and significantly related to the probability of admission. So steep is the SAT gradient that the odds of being admitted for a student whose score is in the 1500-1600 range are more than 200 times as high as those for a student whose score is lower than 1000. The number of AP tests displays a similar pattern. Students with one AP test in their portfolio have 31 percent higher odds of being accepted than do students with no AP tests. The admission advantage is statistically significant and cumulative the more AP examinations a student has taken. As expected, both measures of individual students' academic performance have a positive effect on admission outcomes (see Figures 1 and 2 )."}, {"section_title": "Hypothesis 2", "text": "The second hypothesis expects that applicants from high schools with a reputation for academic excellence will have a better chance of admission to an elite college, apart from information about individual students. Private schools are generally perceived by admission deans as more venerable than are public or parochial schools , and the elite72 variable is designed to capture institutional prestige. We used these two measures to test for reputational effects, rather than school-average SAT scores or the number of AP tests per senior. These latter indicators are directly influenced by students' academic performance, which we already know is positively related to admission outcomes. Model 3, which does not control for individual students' academic credentials, provides support for this hypothesis. Students who attend private secondary schools are 26 percent significantly more likely to be admitted than are public school applicants. Candidates from schools with a religious affiliation are somewhat less likely to be accepted than are public school students. The odds of being admitted if one attends an elite secondary school-regardless of the type of school-are 34 percent significantly higher than are the chances of admission for students at nonelite high schools. "}, {"section_title": "Espenshade, Hale, and Chung", "text": "Moreover, with regard to the other measure of high school academic context, an applicant from a high school whose average SAT score is in the 1000-1099 or 1100-1199 range has more than 20 percent significantly lower odds of being accepted than does a student who attends a school whose average SAT score is lower than 1000. In the latter case, the student has a much better chance of rising to the top of his or her class. Attending a high school with a schoolwide SAT score of between 1200 and 1300 is associated with 18 percent significantly lower odds of admission. Beyond a high school average SAT score of 1 300, the odds of admission are not statistically different from what they would be for students from schools with an average score that is lower than 1000. However, more than nine tenths of applications in our sample originated from schools whose average SAT scores were below 1300. The frog-pond model receives clear support over the broad range of school SAT scores in which most of the students in our sample are concentrated (see Figures 3 and 4) .6"}, {"section_title": "Hypothesis 4", "text": "We expect that the negative effect of schoolwide achievement levels on the probability of admission will weaken as students' academic performance improves. We examined these interactions and found that the negative effect of school academic context is indeed less for better students. exhausted for students who take 13.3 AP tests. The data in Table 1 suggest that few students reach such rarified levels. We conclude that there is a negative school AP effect for most students in our sample, but the effect is the weakest for students who take a large number of AP tests."}, {"section_title": "Hypothesis 5", "text": "To "}, {"section_title": "TESTS FOR ROBUSTNESS", "text": "The evidence provides strong support for our principal hypothesis. Admission officers at elite colleges care how students perform academically relative to their peers at the same high school and reward applicants who rank high not only absolutely, but in comparison to their classmates. The purpose of this section is to probe deeper and to reexamine this conclusion from three different angles."}, {"section_title": "Clustered Observations", "text": "A potential methodological concern arises from the fact that our 45,549 applicants were grouped into roughly 8,800 secondary schools. Clustered observations within schools are not statistically independent, and while estimation procedures that ignore clustering yield unbiased coefficient estimates, they also produce standard errors that are too small. Our data appear to be influenced by a mild degree of clustering. Each of more than 40 percent of the high schools in the sample accounted for just a single application, and another 16 percent produced only two applications per school. At the other extreme, one secondary school sent 287 applications to these three elite universities. We reestimated alike with respect to individual and high school average SAT scores and all other characteristics in the baseline model, a negative SAT school effect could lead to the student from the ACT high school having a higher probability of college admission. Admission officers may believe that the ACT high school is somewhat less competitive than the non-ACT high school if its school-average SAT score is based on the performance of a relatively small group of the best students."}, {"section_title": "Model 4 in", "text": "To examine this possibility, we reestimated the baseline model by including a dummy variable (ACTSchool) for applications from secondary schools in ACT states. A total of 6,095 applications, or 13.4 percent of all applications, came from ACT high schools. The results in column 1 in Table 4 show that the estimated school effects are similar to those in the baseline model. As expected, the coefficient on ACTSchool is positive; students from high schools in ACT states have 31 percent higher odds of college admission, but the effect is not significant.\nThe negative SAT school effect in the baseline model of Table 3 is an average effect between high schools in ACT and non-ACT states. Does the influence of school-average SAT score depend on where a high school is located? To answer this question, we added an interaction term to the model in column 1, with the results shown in column 2 of Table 4 . The SAT school effect in non-ACT states is shown by the main effects of high school SAT score. These effects are still negative, albeit somewhat weaker when compared to column 1, especially for average scores in the 1200-1 300 range. The negative effect of high school SAT score is more pronounced in secondary schools in ACT states. Applicants from ACT schools whose school-average SAT scores are in the 1000-1100 range have one third lower odds of admission to elite universities than do students in ACT schools with average SAT scores that are lower than 1000. And compared to the same students, applicants from ACT high schools where the average SAT score is 1100 or higher have just half the chance of admission to an elite college. When school-average SAT scores are lower than 1000, applicants from ACT schools have 97 percent significantly higher odds of admission than have students from non-ACT schools. The ACT school admission advantage diminishes as school-average SAT scores rise. These indirect adjustments to account for high schools in ACT states leave intact our principal conclusion that there is a significantly negative high school SAT effect. This effect appears to be somewhat stronger in ACT states. The negative AP school effect is essentially unchanged between columns 1 and 2."}, {"section_title": "Direct Adjustment", "text": "The College Board The negative effect of school-average SAT score is now much stronger, more persistent across SAT ranges, and more statistically significant than in the baseline case. Attending a high school whose average SAT score is between 1200 and 1300 versus one with an average score below 1000 lowers the odds of admission by 32 percent in columns 3 and 4, compared with 18 percent in the baseline case. High schools with average SAT scores above 1300 are associated with an insignificant 3 percent lower odds of admission in the baseline model, but with 20 percent significantly lower odds using a 2.53 slope adjustment and with 25 percent significantly lower odds with a 3.79 adjustment. The effects of school AP in columns 3 and 4 are negative and significant, although not quite as steep as in the baseline model. To summarize, the results using high school SAT scores that are adjusted for the proportion of graduates who took the SAT test lend added support to our central conclusion that in making decisions, admission officers at elite universities consider how students perform relative to their peers in the same high school.8"}, {"section_title": "High School Class Rank", "text": "We have inferred a student's academic standing among peers at the same high school by comparing the student's SAT score and number of AP tests with the school-average SAT score and number of AP tests. A more customary way of evaluating applicants with respect to classmates is to rely on high school GPA and class rank. In this section, we incorporate these measures into the analysis. We use SDQ data that students supplied when they registered for the SAT. Students were instructed, \"Please indicate your cumulative grade point average for all academic subjects in high school.\" They were also asked, \"What is your most recent high school class rank?\" We have SDQ responses for 75.6 percent of the applicants. In the remaining cases, the students chose not to complete the voluntary SDQ questionnaire, or it was not possible to match their answers to institutional records. The GPA distribution for students with SDQ data is A+ (29.2 percent), A (35.7 percent), and A-(20.9 percent). Just 14.2 percent responded with a lower GPA or refused to answer the question. Among the same group of applicants, 62.3 percent reported being in the top 10 percent of their high school class, another 18.7 percent were in the top 11-20 percent, 8.4 percent gave a lower ranking, and a tenth refused to answer. Table 5 incorporates these new variables. High school GPA is positively and significantly related to elite college admission. In column 1, students with an A+ average have odds of admission that are more than four times as high as students with a B+ average or less. In column 2, controlling for GPA and other indicators of academic merit, an applicant's class rank is positively and significantly related to the probability of admission. Students in the top 10th of their high school class have more than twice the chance of being admitted to an elite university than have otherwise comparable students who rank in the bottom 80 percent. Applicants in the second decile have 40 percent higher odds of admission than have lower ranked candidates. Class rank matters, and it matters in the direction that Attewell's (2001) simulations predict.\nThe effects of GPA are somewhat stronger in Model 3 than in Model 2, and the effects of class rank are about the same. Compared with the baseline model in Table 3 , attending a private or religious school gives a larger boost to admission chances. School-average AP effects are significantly negative, but the relation to admission outcomes is somewhat less steep. Admission outcomes are also significantly negatively related to school-aggregate SAT scores when average scores are below 1200, but the overall relation is marginally shallower than in the baseline.9 Tests that substitute data on class rank and GPA from high school transcripts for their counterparts from the SDQ in Model 3 of Table 5 produce the same pattern of results for GPA, class rank, and the four high school context variables. The fact that the negative school-level SAT and AP effects are preserved when class rank and GPA are included suggests that these high school contextual measures constitute resilient and independent barometers of students' relative class standing when they are juxtaposed with individual students' performance on the SAT and AP tests. At the same time, these results explicitly show the importance of high school class rank over and above other indicators of comparative academic performance.\nThe effect of class rank could depend on high school academic context. In particular, it may matter most for applicants from less academically competitive high schools, where there are relatively few excellent students and academic distinctions among them are clear. We hypothesize that admission officers place less weight on class rank if applicants come from schools where there is a high concentration of talented students and where differences among the top students are small and difficult to discern. To examine this hypothesis, we interacted SDQ class rank with high school type, elite72, school-average number of AP tests, and school-average SAT score and added each group of interaction terms one at a time to Model 3 in Table 5 . Each set of interactions typically is statistically significant at the .001 level, and the class-rank gradient is the steepest for applicants from weaker schools. Admission officers normally give more weight to class rank in public high Attewell (2001) adapted these concepts to college admissions. He hypothesized that institutional gatekeepers are susceptible to context effects and that a given student would have a better chance of being accepted by an elite college or university if he or she attended a high school with a smaller concentration of high-achieving peers. Admission deans care about high school class rank for several reasons. Colleges compete for students with proved scholastic ability, and being ranked at or near the top of one's class is a way of demonstrating this ability. Admission officers also know that their institutions' reputations depend on enrolling a large proportion of high-ranking entering students because the published annual standings of U.S. colleges and universities factor class rank into the formula (Hossler et al. 1999 ). There may also be a \"diversity rationale\" for emphasizing class rank in admission decisions. Its use prevents talented students at a relatively small number of exceptional secondary schools from dominating a college's first-year class (Attewell 2001) .\nUsing data on more than 45,000 applications to three highly selective universities, we found broad support for Attewell's (2001) hypothesis. Whether a student's relative class standing is inferred by comparing individual students' achievement to school-average achievement levels or measured directly, there is a significant negative effect of average-student achievement levels on the likelihood of admission to an elite college. This conclusion is robust to tests for clustered observations and to adjustments to schoolwide SAT scores for the proportion of students who took the SAT. However, class rank does not apply with equal strength everywhere. The negative effects of higher schoolaverage achievements are the weakest for the most outstanding students. In addition, class rank is a less important criterion for students who apply from schools with a high concentration of academically able students because, in these cases, fine distinctions among students in the upper tail of the distribution are difficult to make and interpret. Although Attewell ( We should remark in passing that evidence that being in an elite track in secondary school enhances admission to an elite college begins to establish the \"social arithmetic\" for how high-status tracks are linked across school settings (Kingston and Lewis 1990a:xxv). Finally, in an expanded version of this article, we showed that although some elite universities practice economic affirmative action for students in the lowest SES categories-first-generation college students and those from families whose annual incomes are lower than $30,000-this small advantage on an all-other-things-equal basis is not sufficient to overcome the fact that higher-SES students have been consistently favored over ones from lower-SES backgrounds in simple tabulations of admission rates by social class (Espenshade, Hale, and Chung 2004).\nWe have shown that high school academic context and a student's relative class standing matter to admission deans at elite colleges and universities. To flesh out the remaining features of the black box that connects high school students to particular college destinations, researchers should investigate the relative importance of individual students' attributes versus high school characteristics at other levels of college selectivity. Further work is needed, too, on students and their decisions about where to apply and where to enroll once they are accepted, as well as on whether the characteristics of students' undergraduate institutions affect admission to graduate and professional schools.\nContextual effects may be relevant to institutional gatekeepers outside education. One particularly fruitful area to explore is the job market. In his review of this article, Herbert Marsh suggested that all but the top students in Davis's (1966) original study perhaps had good reason to aim for lower academic-performance careers to the extent that evaluators of job applications use selection criteria that are similar to those of evaluators of applications to colleges and universities. In addition, after examining the job market for new lawyers, Sander (2004) concluded that employers of lawyers in both private law firms and governmental agencies place more weight on grades than on the eliteness of schools unless the lawyers graduated from Yale or Harvard. On the other hand, Kingston and Smart (1990:169) emphasized the generally greater effects of prestige on early career earnings from attending a more elite institution: \"To state these findings in terms of financial advice, we are inclined to say: go to an elite college (and don't worry about your grades unless you want to go to a professional school), but if you can't get into one of these schools, don't worry too much about where else to go because the name of your alma mater won't be important.\" These disparate conclusions suggest the following hypothesis: The relative importance of frogpond effects to institutional gatekeepers may depend on the particular organizational setting, on who is doing the evaluating, and on how essential high intellectual ability is to the mix of skills that are being sought. NOTES 1. In exchange for these schools' participation, we promised to protect the identity of each institution and to safeguard the confidentiality of all information on students.\n2. More accurately, 45,549 represents the number of applications, not the number of applicants. A small number of students applied to more than one of these institutions.\n3. When the variables are expressed in continuous form, the correlation between individual students' SAT scores and the number of AP examinations is 0.46. The correlation between their school-average counterparts is 0.62. Neither is large enough to suggest problems with collinearity.\n4. Among applicants to these three universities, the average SAT I score and average number of AP tests, respectively, were 1208 and 2.1 for blacks, 1245 and 3.1 for Hispanics, 1359 and 3.5 for whites, and 1 371 and 4.3 for Asians. The numbers for athletes were 1294 and 2.5 versus 1346 and 3.7 for nonathletes. Cookson and Persell (1985) called the \"select 16.\" Nearly 3 percent of the applicants in our sample attended one of the select 16 schools, and 26.6 percent of them were accepted by an elite university, compared with 21.8 percent of all other candidates. We created a dummy variable for the select 16 schools and substituted it for elite72 in Model 4. Its regression coefficient implies that students from one of these schools are 4.3 percent less likely to be accepted than are applicants from nonselect 16 schools, but the effect is not statistically significant (p-value of 0.609). Nor does the select 16 variable perform as well when it is substituted for elite72 in Model 3. Students who attend select 16 schools are 9 percent more likely than are other applicants to be admitted, but the effect is not significant (p-value of 0.251)."}, {"section_title": "Baltzell (1958) identified 16 of the most socially prestigious American boarding schools-what", "text": "6. Model 4 was fit separately to data from each institution. All three universities exhibit qualitatively similar behaviors, as one would expect, given the common aims and values of the institutions and the wide variety of students from which to choose. Underrepresented minority students, women, athletes, legacies, and applicants with high academic achievement have an admission advantage. In addition, preference is normally extended to students from private and elite high schools and to candidates whose high school academic environment is such that it permits them to distinguish themselves academically from their classmates. The most important way in which the three universities differ is in the proportion of applicants they accept, and we controlled for it with institutional dummy variables in the main model. In addition, we estimated some variants of Model 4 to test whether the inclusion of information on SAT (or AP) adds anything to the explained variance beyond AP (or SAT) variables. The 12 SAT variables (7 at the student level and 5 at the school level) are jointly significant when they are added to a version of Model 4 that excludes them, whether or not AP variables are included. The 15 AP variables (10 at the student level and 5 at the school level) are jointly significant when they are added to a version of Model 4 that excludes them, whether or not SAT variables are included. All the results are statistically significant at the .0001 level. Therefore, the SAT variables measure something different about individual-student and school-average achievement from their AP counterparts. Put differently, the set of SAT variables adds explanatory power on top of the AP variables, and vice versa. As a consequence, it is preferable to include both constructs in models of the effect of high school academic context. 7. We are grateful to German Rodriguez for suggesting this model. 8. It is not clear why students who attend high schools whose average SAT scores are unknown have such a large admission advantage over other students. One possibility is that the unadjusted school-average SAT scores were inflated (as suggested by the example in the previous paragraph) by an average of 52 points using the 2.53 slope criterion and by 79 points using 3.79. After adjustment, schools whose average scores are unknown and therefore cannot be adjusted appear to be relatively less competitive than before. A negative school SAT effect makes students at these schools now seem more attractive to admission officers. The fact that the boost to odds of admission when school SAT scores are unknown is higher when adjustments to school-average SAT scores are larger (see column 4) is consistent with this interpretation.\n9. In results that are not reported in Table  5, "}]