[{"section_title": "Abstract", "text": "A coding missense mutation (rs3747742) in triggering receptor expressed on myeloid cell-like 2 (TREML2) has been recently proposed as an important protective factor against Alzheimer's disease (AD). However, the link between TREML2 and AD pathology remains unclear. Therefore, we explored the association of TREML2 rs3747742 with cognitive function, neuroimaging biomarkers and cerebrospinal fluid (CSF) biomarkers related to AD, including CSF total-tau (T-tau), phosphor-tau (P-tau), and amyloid-β (Aβ 1−42 ). As for cognitive function, related cognitive scores of Clinical Dementia Rating Sum of Boxes (CDRSB), Alzheimer's Disease Assessment Scale-cognitive section 11 (ADAS-cog 11), Mini-Mental State Examination (MMSE), and Rey AuditoryVerbal Learning Test (RAVLT) were extracted. We used a multiple linear regression model to examine the association of TREML2 rs3747742 with the baseline variables. Furthermore, we also calculated the change rate of above variables influenced by TREML2 rs3747742 via applying a mixed-effects model over a 4-year follow-up. In this analysis, a total of 1,306 individuals from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database were included. Finally, we observed that only in AD patients, but not in normal controls or mild cognitive impairment (MCI) individuals, TREML2 rs3747742 exhibited a strong association with CSF total-tau levels at baseline (β = −22.1210, p = 0.0166) and 4-year follow-up (β = −0.3961, p = 0.0115). Furthermore, no associations were found with CSF Aβ 1−42 levels, P-tau levels, neuroimaging biomarkers and cognitive function neither for baseline variables nor for longitudinal data. Thus, this study indicated that TREML2 mediated the risk of AD through influencing AD-related neurodegeneration (abnormal T-tau levels) but not P-tau levels and Aβ pathology."}, {"section_title": "INTRODUCTION", "text": "Characterized by intracellular tau neurofibrillary tangles and extracellular amyloid-β (Aβ) plaques, Alzheimer's disease (AD) is the most prevalent age-dependent dementia, accompanied by deteriorating cognitive function (Hardy and Selkoe, 2002; Jiang et al., 2012) . AD has been suggested as a multifactorial disorder, and the role of genetics in AD pathology has been accepted widely (Querfurth and LaFerla, 2010; Jiang et al., 2012; Karch et al., 2014) . Moreover, many biomarkers such as cerebrospinal fluid (CSF) Aβ 1−42 and tau proteins have emerged as intermediate phenotype approaches in genetic analyses of risk for us to explore the association between genetic variation and process of AD. In the past few years, many genetic variants associated with late-onset AD, such as APOE, BIN1, PICALM, PLD3, and NME8, have been identified to affect the process of AD pathology via modifying CSF Aβ 1−42 and tau levels (Schjeide et al., 2011; Liu et al., 2014; Wang et al., 2015; Liu et al., 2016; Wang et al., 2016) .\nA missense mutation (rs3747742-C) in TREML2 exhibited the highest linkage disequilibrium (LD) with rs9381040, which is an inter-genic SNP between TREM2 and TREML2 showing association with AD risk in the International Genomics of Alzheimer's Project (Lambert et al., 2013; Benitez et al., 2014) . In the previous studies, TREML2 rs3747742 was identified as a protective factor against AD in Caucasians (Benitez et al., 2014) , which was also verified by Jiang et al. in Han Chinese population (Jiang et al., 2017) . However, little is known about the mechanism by which this genetic mutation modifies the risk of AD. This study is the first one designed to analyze the role of TREML2 rs3747742 in the pathogenesis of AD by examining the relation of rs3747742 with CSF proteins, neuroimaging biomarkers and cognitive function in the Alzheimer's Disease Neuroimaging Initiative (ADNI) database."}, {"section_title": "MATERIALS AND METHODS", "text": ""}, {"section_title": "ADNI Database and Subjects", "text": "Subjects included in our study were obtained from the ADNI database 1 , which was launched in 2003 as a longitudinal study and recruited participants from almost 63 sites across the United States and Canada (Mueller et al., 2005) . Detailed clinical information on the ADNI cohort has been reported previously (Petersen et al., 2010) . Here, we restricted our ADNI cohort to general participants (N = 1,306), cognitively normal (CN) (N = 374), mild cognitive impairment (MCI) (N = 705), and AD subjects (N = 227) who underwent CSF protein examinations, neuroimaging biomarker measurements and cognitive function tests. Informed consent according to the Declaration of Helsinki was signed by all participants or their authorized representatives."}, {"section_title": "Genetic Data", "text": "The Illumina Human 610-Quad Bead Chip (including 620,901 SNP and CNV markers) and Illumina Human Omini Express Bead Chip (including 730,525 SNP and CNV markers) were applied for genotyping of ADNI subjects (Saykin et al., 2010) . Then these genotype data was made available for ADNI website via sample verification and quality control bioinformatics. Here, we obtained the genotype data of TREML2 (rs3747742) (N = 1,306) from the ADNI database. The data for our study were extracted from the ADNI database."}, {"section_title": "CSF Biomarker Data", "text": "Data for CSF biomarkers, including CSF Aβ 1−42 , total tau (Ttau), and phosphor-tau (P-tau), was obtained from the ADNI database. The acquisition and measurement of CSF data have 1 http://adni.loni.usc.edu/ been described previously (Olsson et al., 2005) . These CSF proteins were examined using the xMAP Luminex platform with Innogenetics/Fujirebio AlzBio3 immunoassay kits."}, {"section_title": "Neuroimaging Data", "text": "The neuroimaging data, including MRI volumes of brain structures, and FDG-PET of cerebral metabolic rate for glucose (CMRgl), was from the ADNI database. The methods for acquisition and processing of cerebral image can be found in prior publications (Desikan et al., 2006) . Here, many regions of interest (ROI) analysis, such as brain ventricles, hippocampus, and entorhinal cortex were conducted to calculate their associations with TREML2 genotypes."}, {"section_title": "Neuropsychological Test", "text": "To test the influence of TREML2 rs3747742 on cognitive function, we extracted related cognitive scores of CDRSB, ADAScog 11, MMSE, and RAVLT in this study. Finally, the analyses of these baseline cognitive scores and their longitudinal changed scores over 4 years were conducted."}, {"section_title": "Statistical Methods", "text": "We used Kruskal-Wallis rank sum test to examine the differences in clinical and demographic characteristics of participants included in our analysis. We performed a multiple linear regression model and a mixed-effects model to explore the associations of TREML2 genotypes with baseline and longitudinal variables, respectively. All above analyses were adjusted for age, gender, education, and APOEε4 status. Both outcome variables were normalized to z scores to facilitate the comparison between modalities. Statistical significance was considered to have been achieved when p < 0.05. Data analyses were performed using R version 3.4.1 statistical software."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Demographic Analysis", "text": "The demographic characteristics and clinical data of the participants are summarized in Table 1 . A total of 1,306 subjects (74.07±7.16 years, 572 women) were recruited. Specifically, 374 CN individuals (74.94 ± 5.53 years, 186 women), 705 MCI patients (73.18 ± 7.59 years, 284 women), and 227 AD patients (75.40 ± 7.72 years, 102 women) were included in this study. As expected, the three groups (CN, MCI, and AD subjects) showed significant differences in MMSE scores and CSF protein levels."}, {"section_title": "TREML2 rs3747742 and Baseline Variants", "text": "In our analysis, we examined the association of a missense mutation (rs3747742) in TREML2 with CSF proteins, neuroimaging biomarkers and cognitive function among the total participants as well as three clinically diagnosed groups at baseline. Finally, the results indicated that in total participants and AD patients rs3747742 was associated with the level of CSF T-tau, but not with CSF Aβ 1−42 level, P-tau level, neuroimaging biomarkers and cognitive function ( Table 2 and Supplementary  Table 1 ). In total participants, subjects with CC and TC genotypes had lower T-tau levels (β = −7.7764, p = 0.0143) when adjusted for age, gender, education, and APOEε4 status. In addition, AD patients with C allele (CC, TC) had lower T-tau levels than those with TT genotype (β = −22.1210, p = 0.0166) when adjusted for age, gender, education, and APOEε4 status ( Figure 1A )."}, {"section_title": "TREML2 rs3747742 and Longitudinal Changes", "text": "Furthermore, we also tested the correlations of TREML2 rs3747742 with longitudinal changes of CSF protein levels, neuroimaging biomarkers and cognition over a 4-year followup. We found that total participants (β = −0.1548, p = 0.0096) ( Table 2 ) and AD patients (β = −0.3961, p = 0.0115) with C allele (CC, TC) showed a slower rate of change in CSF T-tau levels than TT allele carriers after controlling for age, gender, education and APOEε4 status ( Figure 1B) , but no associations were found with CSF Aβ 1−42 levels, CSF P-tau levels, neuroimaging biomarkers and cognitive function ( "}, {"section_title": "DISCUSSION", "text": "This study investigates the association of TREML2 rs3747742 with CSF protein levels, neuroimaging biomarkers and cognition in total participants as well as CN, MCI and AD subjects. Our main finding was that the coding missense mutation of TREML2 (rs3747742-C) was closely related to decreased baseline CSF T-tau concentrations and slower rate of longitudinal changes in CSF T-tau levels during the 4 years follow-up in AD patients.\nLocated at TREML2, rs3747742 shows the highest LD (r 2 = 0.73, D = 0.86) with the GWAS SNP rs9381040 (Benitez et al., 2014) , which was confirmed to be the top-significant SNP (p = 6.3 × 10 −7 ) around TREML2 (Lambert et al., 2013) . It was previously reported that both of the above two minor alleles of rs9381040 (β = −0.02, p = 4.11 × 10 −4 ) and rs3747742 (β = −0.02, p = 1.4 × 10 −4 ) were strongly associated with CSF P-tau levels and lower risk of AD (p = 1.21 × 10 −5 , CI = 0.88-0.95; p = 8.66 × 10 −5 , CI = 0.89-0.96) (Benitez et al., 2014) . In the present analysis, we demonstrated rs3747742 was not associated with CSF Aβ 1−42 level, which was consistent with the result of Benitez et al. (2014) . Furthermore, we also detected that rs3747742 was not correlated to CSF P-tau levels but was associated with CSF T-tau levels. This discrepancy may be due to the differences in the grouping of subjects in the two studies. Specifically, the previous analysis was performed in two groups, including the AD group and the control group, but in this study we divided participants into three different clinical subgroups (AD, MCI, and CN groups) (Benitez et al., 2014) . Another reason may be the too small sample size of AD subjects in this study, which caused bias in the results of the study. Therefore, more large-scale studies are warranted to confirm this conclusion. Previous studies have demonstrated that as the functional coding mutation in TREML2 gene, rs3747742 can encode related proteins and exhibit association with the risk of AD (Cruchaga et al., 2013) . TREM2 and TREML2 are structurally similar proteins encoded by the same gene cluster on chromosome 6, which have the opposite effect on the risk of AD. A recent study showed that TREM2 and TREML2 could strictly regulate microglial proliferation, whose dysfunctions may contribute to AD pathogenesis via impairing brain innate immunity (Zheng et al., 2016) . TREML2 is a single-pass type I transmembrane protein containing an extracellular Iglike type V domain and a potential cytoplasmic +xxPxxP SH3-binding motif, which can mediate signal transduction through its cytoplasmic tail (King et al., 2006) . Stimulated by inflammatory factors, TREML2 up-regulates the expression of neutrophils and macrophages associated with immune responses, a process that activates immune-related cells to respond to inflammatory stimuli, thereby amplifying the inflammatory response (Klesney-Tait et al., 2006) . As for the correlation between neuroinflammation and tau protein, numerous studies shown that proinflammatory cytokines (including IL-1, IL-6, and TNF-α) produced by reactive microglia can induce the pathological modification of tau protein (Li et al., 2003; Quintanilla et al., 2004; Gorlovoy et al., 2009) , resulting in neurodegeneration. In addition, it was previously reported that neurodegeneration can influence inflammatory response (Zilka et al., 2009; Stozicka et al., 2010) . Also, neuroinflammation mediated by microglia and astrocytes can cause neuronal damage and even death by affecting intracellular mitochondrial function (Wilkins and Swerdlow, 2016) . In 2018, the ATN classification system for the diagnostic criteria for AD clearly indicated that CSF T-tau is one of the biomarkers for neuronal damage or neurodegeneration [marked as (N)] (Jack et al., 2016) . Furthermore, it also has been speculated that endogenous intracellular tau can be released outside the cells after neurodegeneration (Gomez-Ramos et al., 2006) . Soluble extracellular tau can promote neurotoxicity (GomezRamos et al., 2008 (GomezRamos et al., , 2009 ) and the release of proinflammatory cytokines, such as IL-1, IL-6, and TNF-α (Kovac et al., 2011) . Thus, interactions between tau protein, inflammatory cytokines, and neurodegeneration can lead to the generation of AD pathology. TREML2 will expand the immune-related neuroinflammatory phase to exacerbate this pathological process. Besides, we observed that TREML2 rs3747742 exhibited a strong association with CSF total tau levels at baseline and 4-year follow up only in AD patients, but not in CN or MCI individuals. We thought the distinct outcomes among three groups about the association between rs3747742 and CSF total tau levels may be due to the disease status. Evidence has shown that disease status may affect the association between genetic variation and gene expression (Rhinn et al., 2013) . Therefore, disease status may also affect the association between rs3747742 and CSF total tau levels at baseline and 4-year follow-up. However, the specific mechanism by which TREML2 rs3747742 affects the expression and function of related proteins with various disease status needs further study and interpretation. In summary, our findings showed that TREML2 genetic mutation (rs3747742-C) was associated with CSF T-tau levels in AD patients, suggesting this mutation plays an important role in AD-related neurodegeneration. Neurodegeneration is a common pathway in various neurodegenerative diseases. However, as for other neurodegenerative disease, such as Parkinson's disease (PD), one study discovered that 24 PD susceptibility variants which identified in GWAS previously were not associated with TREML2 (Nalls et al., 2014; Chan et al., 2016) . Thus, more independent researches with large sample size and diverse ethnicity are required to confirm the role of TREML2 in AD pathology. "}, {"section_title": "AUTHOR CONTRIBUTIONS", "text": ""}]