[{"section_title": "Introduction", "text": "The intensification of conflict in many parts of the world has increasingly drawn attention to the role of education in wider peace-building strategies, in potentially strengthening development benefits for communities and equipping young people, particularly those at the margins, with essential skills and knowledge to improve their life circumstances (UNESCO, 2011) . However, literature on education in conflict-affected societies has tended to focus mainly on short-term emergency efforts, basic literacy skills, child protection, psychosocial well-being and school access, as argued by Novelli and Lopes Cardozo (2008) , Smith (2005) , and Zakharia (2013) . Although essential, such responses have failed to acknowledge the realities of schooling processes and to address issues of social inequity. There remains a large theory-practice gap in the literature between the aspirational theorizing of academics, de-contextualized goal-setting of international organizations and the realities teachers face in classrooms (Paulson & Rappleye 2007) . Responses have lacked a longer sustainable developmental and transformative view of education (Davies, 2004; Novelli & Lopes Cardozo, 2008; Smith, 2005) , thus focusing on the symptoms of the conflict, not its roots. Lebanese scholar Zakharia (2011) argues that schooling, particularly in such contexts, must serve as a vehicle to meaningfully address the structural violence that perpetuates social and economic inequity so that educational systems can contribute towards building peaceful, just and inclusive societies. To this end, Novelli and Lopes Cardozo (2008) and Shah and Lopes Cardozo (2014) have highlighted the need to be attentive to the historical, political, economic and cultural contexts in which schooling in conflict-affected societies is embedded. If education is to fulfill the needs and aspirations of young people, then more focus is needed on developing a critical understanding of the interactions between policies, school-level and classroom-level processes as experienced by different stakeholders in particular, students, teachers and principals. In order to begin understanding such interactions, this paper examines factors influencing learning and teaching processes in Lebanese public schools from teachers' perspectives and practices relating to engaging students with learning.\nScholars in Western countries, where student engagement has primarily been studied, assert that it is linked to enhancing school retention (Finn & Zimmer, 2012) , academic achievement (Marks, 2000) and students' overall educational experiences (Yazzie-Mintz, 2010) . However, few scholars, like Zyngier (2008) and Smyth (2006) , argue that engagement embraces broader schooling outcomes, such as active citizenship and personal and community empowerment. In contexts affected by conflict the need for academic, emotional, cognitive and broader civic learning outcomes becomes further amplified.\nAlthough definitions of student engagement are diverse and contested, there is wide consensus that it is multi-dimensional, encompassing students' behaviors, feelings and cognitive involvement in learning, and can be shaped by teachers' actions and the school environment (Appleton et al., 2008; Fredricks et al., 2004) . Some scholars have focused on certain school features in relation to facilitating engagement, such as the benefits of communal schools in which greater personalization, safety, fairness and student participation are essential factors (National Research Council, 2004; Ripski & Gregory, 2009 ). Other researchers studying low-income US urban schools have emphasized teachers' significant role, particularly teacher-student relations that are characterized by supportive instrumental relationships, high academic expectations and caring as a basis for transforming the school culture to one of mutual respect and active engagement (Antrop-Gonzalez & de Jesus, 2006; Hantzopoulos, 2013) . Rejecting deficit discourses that often portray socially disadvantaged students as poor learners, a number of critical scholars have asserted a strong connection between engagement and pedagogical approaches (Antrop-Gonzalez & de Jesus, 2006; McMahon & Zyngier, 2009; Zyngier, 2008) . Consistently, these scholars have found that teaching practices that are responsive to students' lives, learning needs, interests, and that are participatory and empower students to make changes to their own marginalization can result in both social justice and academic achievement. While there is little disagreement that good teaching makes a difference to students' engagement and achievement (UNESCO, 2013) , attributing this solely to what teachers do in classrooms overlooks the powerful influence of the context of schooling. McMahon and Portelli (2004) caution educators against technical or procedural remedies for disengagement in which teachers are given a list of specific procedures, strategies and skills to adopt in order to ensure student engagement. Schools are situated in, and interact with, larger structures and conditions marked by inequity (Mills & Gale, 2011; Tikly & Barrett, 2011) and can be sites of direct and structural violence (Smith & Vaux, 2003; Zakharia, 2013) . However, the engagement literature does not adequately address the sociocultural, political and economic factors impacting educational processes outside Western contexts, especially those in politically unstable settings. In this paper, I explore such influences on teachers' practices to engage their students in Lebanese public schools. I argue that issues of justice and equity in and through public schooling need to be made central to Lebanon's social cohesion agenda and any future educational reform. It is hoped that developing a critical understanding of schooling and classroom-level processes by examining teachers' perspectives and practices, as this paper aims to do, can prompt educators and policy-makers in Lebanon and similar conflict societies to interrogate and revise the educational processes, conditions, values and practices that are undermining contemporary public schooling and thus reinforcing systemic inequity."}, {"section_title": "Lebanese context", "text": "Lebanon is a high-middle-income country; nevertheless, the overall poverty rate stands at around 28 percent, while the extreme poverty rate is estimated at around 8 percent with significant regional disparities, especially in North Lebanon where conditions are worst (World Bank, 2012 ). Lebanon's 18 officially recognized religious or sectarian communities have often been described as a plural democracy and social mosaic. 1 With roots in the 400-year Ottoman rule and consolidated under the French colonial mandate , during independence Lebanon's sectarian-based power-sharing formula became institutionalized, ensuring political and economic privilege along socio-religious lines. A culture of sectarianism permeated Lebanese institutions, resource allocation and daily life, supporting a sectarian system of kinship and widespread nepotism (Khalaf, 2002) . Thus the more favored sectarian communities, particularly Maronite Christian, Sunni and Druze elites, received a disproportionate share of power and resources, which resulted in economic deprivation for the marginalized Shi'a population and underdevelopment of those communities living in the North, South and Bekaa valley outside Beirut and the Metn (Salibi, 2003) . Further reinforcing sectarian cleavages, communities had the freedom to develop and operate their own private schools, where the vast majority of students were enrolled, promoting their own curricula, textbooks and sectarian vision of Lebanon (Inati, 1999) . Children from poor, mostly Muslim, families attended public schools, which lagged behind private schools in providing their students with precious foreign language skills, scientific knowledge and activities (Kobeissy, 1999) . 1 The largest of the 18 sectarian communities include: among the Muslims -Shi'ites, Sunnis and Druze -and among the Christians -Maronites, Catholics and Greek Orthodox. Makdisi (2000:7) defines sectarianism as \"the deployment of religious heritage as a primary marker of political identity.\" In this paper, I use 'sect', 'sectarian' and 'confessionalism' interchangeably. Aggravated by the regional Arab-Israeli conflict and strong influence of external actors aligned with different sectarian communities, internal, long-standing, unresolved grievances and stark inequalities between the sectarian groups exploded into a protracted 15-year civil war (1975-1990) . During the Civil War, public institutions all but crumbled in the absence of a functioning government. Amidst a state of lawlessness and disorder, teachers and administrators were threatened and often physically attacked by armed students and their family members for higher grades and undeserved grade promotion (Zakharia, 2011) . Official examinations for elementary, middle and high-school students were often cancelled during the war or the pass grade was lowered to 25 percent from 50 percent, which allowed students to be academically promoted without the necessary competencies (Boujaoude & Ghaith, 2006) . Many teachers who entered teaching in public schools during the war did so without the necessary qualifications.\nThe Taif Accords ended the war in 1990. It is estimated that between 150,000 and 200,000 people were killed, more than 150,000 were severely wounded, 13,000 were kidnapped and 17,000 disappeared and still remain unaccounted for (Zakharia, 2011 ). An estimated one million people were displaced and hundreds of thousands emigrated, while infrastructure damage amounted to $25 billion (UNDP, 1997). The Accords established the country's Arab and Lebanese identity, preserved the sectarian-based political system under a modified formula and favored privatization while also emphasizing the necessity for balanced economic development (Krayem, 1997) . Significantly, the Accords did not address the structural limitations and inefficiencies of the sectarian political system and related inequalities. Under the shadow of continued Israeli occupation (until 2000) , Syrian political tutelage (until 2005) , a series of assassinations, street battles, a costly war with Israel in 2006, and economic deterioration, the Lebanese postwar governments have struggled to rebuild and revive the social, political and economic system. Sectarian tensions still persist today as manifested through the political gridlock and exacerbated by the Syrian crisis and flow of refugees."}, {"section_title": "Schooling in postwar Lebanon", "text": "Education reform was considered an essential vehicle for Lebanon's fragile social reconstruction in the postwar period (Frayha, 2003) . The Ministry of Education developed a Plan for Educational Reform aimed at: (a) strengthening social cohesion and students' national belonging; (b) providing the new generation with the basic knowledge, skills and expertise necessary for a modern society, and emphasizing Lebanese values, such as liberty, democracy and tolerance; (c) improving public schools (Ministry of Education, 1994) . As an affiliate of the Ministry, the Centre for Educational Research and Development (CERD) was entrusted with developing post-civil-war curricula, educational planning, new textbooks and teacher professional development. A former director of CERD, Frayha (2003) , noted that the new curriculum marked a significant break with the traditional pre-war approach to education and adopted constructivist, student-centered learning principles.\nThe current schooling structure in Lebanon is divided into primary (KG to grade 6), intermediate (grades 7-9) and secondary (grades 10-12). All Lebanese students are required to take and succeed in official examinations in grade 9 (Brevet) and grade 12 (Baccalaureate) in order to be promoted. As part of Lebanon's French colonial legacy, educational instruction is based on a bilingual system in which students are expected to learn Arabic and French or English. In grade 7 students study mathematics and the sciences in either French or English, depending on the school's orientation, while the humanities (civics, history, geography) are taught in Arabic.\nThere are two main types of school: private schools that are either fee-based or subsidized, and public (state) schools. Unlike private schools, public schools are administered by a highly centralized government bureaucracy, which sets the policies, appoints the principals, assigns the teachers, manages the budget and dictates curriculum content and prescribed textbooks. Thus public school principals have very limited authority as they cannot choose their teaching staff, hold teachers accountable to maintain high-quality learning, and shape learning and teaching processes, and effectively respond to their school's needs (Akkary, 2013) . Although almost equal in number (1,365 public and 1442 private), public schools enrolled 29.2 percent of students in 2011 and employed 43.8 percent of teachers, three-quarters of whom are female (CERD, 2012) . At the primary level, 26 percent of students are enrolled in public schools, while enrolment increases to 34 percent in intermediate and 45 percent in secondary schools, indicating an overall strong preference for private education (CERD, 2012). Lebanese student enrolment in public schools continues to decrease due to perceptions of the poorer education quality in these schools. Students who attend public schools tend to come mainly from working-class and low-middle-class families.\n2 The Trends in International Mathematics and Science Study (TIMSS) 2007 assessment (Mullis, Martin & Foy, 2008 ) at the 8 th grade level, showed that students in Lebanese public schools attended schools where a majority of their peers were also disadvantaged, had parents with less formal education, had fewer books in the home, and were less likely to reach the intermediate and high benchmarks in comparison to students in private schools as illustrated below in Table 1 . Also, poorer areas in Lebanon such as the North, Bekaa Valley and South have the highest percentage of student enrolment in public schools. Additionally, there is a slight gender disparity in school enrolment at all levels in favor of girls (CERD, 2012) , which might be due to boys dropping out to earn an income for their families or because they have enrolled in vocational educational training. Although reliable data are missing, the Lebanese Association for Educational Studies (LAES) (2007) estimates that dropping out is 20 percent in primary and middle public schools. High repetition rates and percentage of over-age students are cause for alarm across year groups in public schools (see Table 2 ). Although not disaggregated according to private and public schools, more recent data show that grade repetition is at 25 percent and over-age students is at 32 percent at the middle school level (CERD, 2013). The average student-teacher ratio is lowest in public schools (7:1) in comparison to private schools (12:1) and subsidised private schools (19:1), although these figures mask significant differences within school types (CERD, 2010) 3 . Despite the lower student-teacher ratio at the time of this study, public school students' academic achievement is still lower than their counterparts, indicating that there are other factors affecting the quality of learning and teaching. In 2012, 81 percent of private school students and 60 percent of public school students passed the grade 9 Brevet official examination, which serves as the gatekeeper for students wishing to pursue further education (CERD, 2013) . Similarly, in the Trends in International Mathematics and Science Study (TIMSS) 2011 assessment (Mullis, Martin, Foy & Arora, 2012 ) at the 8 th grade level, students in Lebanese public schools scored 56 points or 12 percent lower than private school students in mathematics and 17 percent or 79 points lower in science.\nHowever, beyond these statistics there is a dearth of empirical research into the micro-realities of public schools, which cater for the most socially disadvantaged Lebanese families. The little research that has been conducted (see Mattar, 2012; Sab 'Ayon, 2013) , has tended to approach public education in a de-contextualized manner without paying attention to the historical, political, social and economic circumstances and societal inequities which have formed and continue to shape the context of schooling. Additionally, postwar educational reforms were not based on any needs assessment and have failed to take into account the perspectives, experiences and practices of the different stakeholders, particularly teachers and students. And yet, in order to develop policies and interventions that are grounded in the needs of teachers and students, it is essential to develop a contextual understanding of what is actually happening in schools, which this research aimed to do."}, {"section_title": "Methodology", "text": "Based on a larger multi-level case study, I initially conducted a broad inquiry into 17 private and public schools in Greater Beirut. Data were drawn from questionnaires with 689 grade 7 and 8 students on their perceptions of their schooling experiences and interviews with school leaders. All principals received a survey report summarizing the school's questionnaire results. Subsequently, in the focal inquiry, over the course of 10 weeks I focused on three public schools, which I shall name Shamsi, Zeitouni and Hawa, 4 so as to gain a deeper contextual understanding of learning and teaching processes in these school settings. These three schools were considered by the Ministry to be more academically successful than other public schools and led by principals committed to making a difference to students' learning. However, it is worth noting that between 40 and 60 percent of grade 7 and 8 students in these focal schools were failing most of their subjects according to administrators.\nI conducted interviews and class observations with 16 middle-school teachers and 22 student focus groups in order to explore multiple perspectives on learning and teaching processes and examine the factors influencing practices within various school settings and the larger education system. Data were collected between January and June 2012.\nIn this paper I report on data from teachers, my observations, policy documents and conversations with other stakeholders. A core sample of 16 teachers -14 female and two male teachers -across three public schools was selected according to their interest in sharing their thinking about their practices and in some cases principals' suggestions about who might be approachable. Selection of teachers was not confined to certain subjects nor to those whom students described as (dis)engaging, but rather I sought, as far as possible, a diverse sample of willing teachers. Of course, I was aware of the sensitivity of my topic and that my chances of entering the classroom and developing good rapport with teachers might be more successful with those who were confident about their practices. However, this was not the case with some teachers who described themselves as unmotivated. Thus taking several steps to build and sustain trust and respect was crucial to optimizing teachers' participation. Core teacher interviews were divided into an introductory and two to four post-lesson interviews (depending on teachers' availability 5 ) that summarized emerging issues and factors teachers perceived as influencing student engagement in their classrooms. Classroom observations served to support the teacher interviews; hence I took notice of the physical environment, the classroom atmosphere, interactions between teachers and students and among students, the content of teachers' lessons and their practices, and students' responses to the teacher's actions, as well as student-initiated activity.\nThrough a dynamic and iterative process of open coding, data reduction and displays (Miles & Huberman, 1994) , themes and categories from interviews and observational notes were generated and core ideas were developed."}, {"section_title": "Conceptual framework", "text": "Key findings which emerged from, and evolved in, teachers' accounts revealed core issues relating to social (in)justice in classrooms, schools and the educational system. These recurring issues stood in stark contrast to the mission of education depicted in formal texts, \"preparing a thinking, productive citizen and educating him in national belonging and social integration in a society where justice, freedom, democracy, and peace prevail,\" (Ministry of Education and Higher Education, 1997: 4) . This discrepancy prompted me to conduct an alternative reading of the data so as to examine teachers' perspectives, experiences and practices within a more contextual understanding of public schooling in postwar Lebanon. In framing my critical interpretation of the findings, I drew on US philosopher Nancy Fraser's tri-partite conceptualization of justice as an analytical lens to examine the main issues that emerged in relation to schooling processes and the broader systemic influences in which they are embedded. Like Tikly and Dachi (2009) , I recognize that Fraser's writing is situated primarily in the North-American context; however, the dearth of debates in the Arab world on educational processes in relation to social justice has led me to draw from international scholars who have raised such issues. Fraser's approach is fundamentally about recognizing and transforming the multi-dimensional manifestations of injustices, which, in the case of my study, characterize current schooling. Such a transformation would necessitate the development of educational processes that prioritize school learning that is inclusive, participatory and empowering, leading students to a lifetime of active engagement in a democratic society. Fraser (2007: 27) defines justice as \"parity of participation\" and theorizes the necessity for \"social arrangements that permit all to participate as peers in social life. Overcoming injustice means dismantling institutionalized obstacles that prevent some people from participating on a par with others, as full partners in social interaction.\" Fraser identifies economic, cultural and political injustices that impede participatory parity:\n1. Economic structures that deny people the material resources they need to interact with others as peers due to mal-distribution or class structure; 2. Institutionalized hierarchies of cultural value that generate status inequality or misrecognition and disrespect; 3. Exclusion from making justice claims and participating in decision-making due to misrepresentation.\nFraser (2007) notes that achieving parity of participation is possible when 'redistribution', 'recognition' and 'representation' are simultaneously addressed. She contends that these three dimensions are distinct and yet inextricably interwoven (see Figure 1 ), and argues that unravelling them is critical to understanding how inequities are generated and sustained through multiple, often interactive, sources. Thus efforts to overcome inequities and enable greater parity of participation require all three spheres to be addressed so that marginalization is not re-inscribed in new ways. Although Fraser's framework has rarely been applied in scholarship on education in conflict-affected societies, except in Aceh (Shah & Lopes Cardozo, 2014) , there are three reasons why I decided to use her conceptual model. Firstly, the three justice domains enable an analysis of the ways in which teachers' experiences, interpretations and actions are located within wider structures. The significance of contextual factors, in particular the wider continuing political conflict entrenched in Lebanon's sectarianism and regional power dynamics, alerted me to the limitations of overplaying school and teacher factors. Secondly, using Fraser's strong analytical lens shed light on how the interplay and interface of voices of different stakeholders intersected to reveal the complexities of student (dis)engagement with schooling. Finally, Fraser's framework enabled me to understand how obstacles to student engagement with school learning may be reframed and how they might be overcome, which can inform which policy priorities are chosen and which measures are taken. Failure to see how the injustices that are generated and reinforced through schooling are interlinked would limit any hope of redressing students' disengagement from learning and hence their unequal life chances."}, {"section_title": "Parity of Participation", "text": ""}, {"section_title": "Discussion of Findings", "text": "In adapting Fraser's model to schooling processes, I have related 'redistribution' to the re-structuring of financial, material and human resources in public schools so as to expand access to education and raise students' academic achievement; 'recognition' to inclusive and relevant educational content and respectful learning environments; and 'representation' to the politically active participation of all stakeholders in debates about education. Dominant subthemes that emerged from the central findings of my research are interpreted together through Fraser's economic, socio-cultural and political domains of (in)justice (Figure 2 ). The organisation of the sub-themes is not fixed but fluid and somewhat arbitrary, in that the issues, concerns and priorities within each dimension interact with each other -sometimes compounding disadvantage in what Fraser (1995:73) terms 'interimbrication' to describe the overlap of dimensions. Thus Fraser's model should not be considered as an ideal of justice but rather a useful lens through which to examine these findings. "}, {"section_title": "From Economic Injustice to Equitable Redistribution", "text": "The postwar Ministry of Education and Higher Education (MEHE) undertook several steps to increase provision of resources to public schools to promote so-called equality of opportunity, which included: rehabilitating a limited number of public schools; developing new textbooks by 1998; requiring teachers to have university degrees in 2002 and organizing professional training workshops for tenured teachers (MEHE, 2010) . However, despite these steps public spending on education has been low, representing an average of 2.6 percent of GDP from 1995-2005 and consistently dropping since then to 1.7 percent of GDP in 2010 (World Bank, 2013) . 6 The overall decrease in government spending on public education suggests the state's abdication of its responsibility to ensure quality provision of public services. While public expenditure surged following the civil war due to the government's commitment to education (9.7 percent of GDP), research has shown that government spending was neither needs-nor equity-based but rather that sect has been the criterion underpinning financial and human resource allocation in education and other areas of development (Salti & Chaaban, 2010) . Public schools have been built without careful planning and many teachers appointed in regions where the corresponding needs do not exist in order to satisfy regional political considerations. This is manifested in the overall lower student-teacher ratio in public schools mentioned previously. Such ratios indicate that a high share of financial resources is spent on personnel in public schools rather than on enhancing the school environment, and learning and teaching and that teacher recruitment is a politicized process. Nationally, 153 public schools contain fewer than 50 students and 12 schools have more teachers than students (CERD, 2010), which reveals the inappropriate allocation of financial resources. This inequitable distribution is also manifested in government subsidies provided for public sector employees to enroll their children in subsidized private schools (Farha, 2012) , which undermines the government's commitment to strengthening public schooling.\nRedistributive concerns relating to the educational system emerged strongly in the accounts of teachers, and in my school observations and conversations with other stakeholders."}, {"section_title": "Inequitable distribution of resources", "text": "According to all three public school principals, the Ministry had not provided funds on time and so there had been overdue costs. Similar to the findings in Mattar's (2012) mixed-methods study on the performance of ten Lebanese public schools, principals in my study informed me that many parents could not pay the registration fees, family fund and/or buy their children books and stationery, 7 which means public primary education is compulsory (until age 12) but not free. Additionally, all three principals informed me that they were lacking teachers in certain subjects and that they even had to accept some teachers who were not qualified to teach the subjects assigned to them. Since 2002, public elementary school teachers have been required by law (MEHE, 2011) to hold a university degree without any necessary educational preparation. Only 45 percent actually do so (CERD, 2009), which means the majority of teachers in public schools are not qualified to teach. Throughout the year CERD, private universities and international organisations organise one or two-day 6 This is quite low in comparison to Cyprus which spent 7.5 percent of GDP and the UK's spending of 6.3 percent of GDP in 2010 (Retrieved December 27 th , 2013 from http://data.worldbank.org/indicator/SE.XPD.TOTL.GD.ZS). According to the World Bank (2008) , the average public expenditure on education as a percentage of GDP for 18 Arab countries stood at 6.4 percent in 2003. This means Lebanon was well below this average. 7 The family fund into which parents are required to pay annually for each child ($47 for primary, $60 for intermediate and $80 for secondary students), is used to cover unexpected expenses, such as damage or unexpected wages (Personal communication with public school principal, June 10th, 2012).\nworkshops for the professional development of tenured teachers. This is not mandatory and thus it is left to teachers and subject to principals' agreement.\nAdditionally, 71 percent of teachers are tenured or permanent, while 29 percent are contracted (MEHE, 2010) . In all three of the public schools in my study, contracted teachers comprised 40-60 percent of the teaching staff. The significant presence of contracted teachers meant that providing extra academic support and supervising extracurricular activities (including field-trips) was very limited in the focal schools. There are vast discrepancies among public school buildings and facilities, ranging from modern to dilapidated buildings and facilities, indicating uneven distribution of resources (MEHE, 2011) . The fact that the Ministry (MEHE, 2011) leases buildings for 43 percent of its schools, which often do not contain basic facilities, has limited its capacity to improve the infrastructure. In my study, most teachers mentioned the lack of academic learning resources in the form of stories, CDs, films, exercise books and dictionaries that were part of the requirements of the curriculum. Science teachers in Zeitouni and Hawa complained either about not having a science laboratory for students to work in or that it was not being properly maintained. However, even though there was a functioning science laboratory in Shamsi and a library in Zeitouni, none of the teachers used these resources for fear of students making too much noise.\nTeachers consistently identified the need for full-time professional counselors to respond to students' emotional needs and extra lessons to help strengthen students' knowledge and skills in the main subjects. Teachers in all three schools acknowledged the help of NGOs and, in Hawa, a nearby university. However, teachers described this external help as inadequate, short-term and inconsistent. Teachers also questioned the effectiveness of the Ministry's intervention to provide extra lessons once a week for grade 9 students in preparation for the Brevet three months before the official examination, which was considered too little, too late as reflected in one teacher's typical comment: 'They are giving extra support only in Brevet; it should be the other way around. They should start from the beginning to build a strong basis so that students do not reach Brevet not knowing anything. ' None of the teachers considered how schools might develop their capacity to meet students' diverse needs and instead highlighted the need for external support to fill the gaps in the school system. It appears that teachers each worked in their compartmentalized worlds, rather than perceiving that external support as a form of potential collaboration between different stakeholders."}, {"section_title": "Teachers' economic impotence and agency", "text": "During interviews, economic injustice pervaded teachers' accounts of their work, well-being and effect on their practices to facilitate students' learning. All eight tenured teachers in my study referred to their status as being a real teacher due to its financial stability, social benefits and professional security, unlike the status of contracted teachers. These teachers typically expressed a sense of pride because they felt they had earned their status either by obtaining the teaching certificate or passing the written competitive competency examination at the Civil Service Council.\n8 However, all tenured teachers complained about their low salaries, which in most cases resulted in a struggle for economic survival. Most explained how this affected their motivation and limited their capacity to do anything extra for their students.\nIf our salary was better, teachers would feel more motivated and able to come on Saturdays to give students extra hours to help them. I can't because I have a family to support and I have to give private lessons seven days a week. (Salaam-tenured)\nOur salary is less than 400$. We are oppressed; we give private lessons for extra money to support our family and so I don't have much energy to prepare for the next day. (Majed-tenured) Teaching is considered underpaid in Lebanon and teachers can receive as little as the $460 monthly minimum wage.\n9 In addition to low salaries, de-professionalization is manifested through the increase in hiring contractual teachers who are excluded from professional learning opportunities. All contracted teachers were highly critical of their overall vulnerable professional status, mainly emphasizing the problem of low salaries, delayed payment 10 , lack of any social benefits or security and impact on their self-esteem. These teachers used terms like 'instability', 'oppression', 'injustice', 'lack of rights' and 'disrespect' to characterize their perceptions of their status. For example, commenting about her unfair treatment by the principal, Dima (contracted) commented, 'I would like the school administration to appreciate my work and recognize my competency to teach the Brevet class.' Other contracted teachers, like tenured teachers, described the economic necessity of teaching in private institutions or tutoring privileged children, in order to receive any income at all."}, {"section_title": "11", "text": "During my school visits, I frequently observed some teachers frantically rushing to and from classes either because they had come from another school where they also taught or because they had to leave immediately for their next class in another school. Even the three contracted teachers who did indicate that they had financial security due to their husbands' supplementary incomes admitted that such security did not extend to their work. Farida (contracted) described bitterly how she experienced her professional status, and her struggle and determination in order to keep her job in the face of dire difficulties: 8 This examination is only offered when there is a demand for tenured teachers in particular subjects. The examination tests teachers' content knowledge of the subject, general knowledge in Arabic, but not teachers' understanding of how students learn, pedagogy or their own capacity to teach. 9 Salaries of newly tenured teachers, regardless of years of experience, are just above the minimum wage of $460 according to teachers' accounts. Teachers' salaries increase incrementally every few years. This means that teachers in the schools I was studying who had been teaching for 30 years informed me that they earn on average $1000, depending also on their qualifications. 10 My interviews and informal discussions with contracted teachers in all three schools revealed that they had been paid a lump sum for the previous six months in October 2011; however, by May 2012 at the time of my research, contracted teachers in public schools had still not been paid since October 2011 and were not even sure when they would be. 11 During my time in schools, I frequently observed some teachers frantically rushing to and from classes either because they had come from another school where they also taught or because they had to leave immediately for their next class in another school.\nWe haven't been paid! There is no stability in our lives. We don't have rights from any aspect! We don't get paid outside of the hours we teach, we don't get a pension, sickness leave, maternity leave. When I gave birth at the beginning of the year, I took 15 days off, tenured teachers get 60. Imagine all the injustice! Fifteen days and I dragged myself to school so that the principal wouldn't replace me.\nComparisons of status and levels of competence between tenured and contracted teachers pervaded most accounts. Teachers who expressed their frustration about their low economic and professional status also shared their despair at the abject absence of political will to address the needs of public school teachers. Echoing this pessimism, Widad (contracted) argued that the government's policies deliberately undermined teachers' well-being, quality of teaching, and the teaching profession overall, regardless of status:\nWe contracted teachers still didn't get paid for this year's work. In October [2011] we got paid for last year's work. What kind of motivation is this? The government itself is destroying education. When you are comfortable, and everything is provided, why wouldn't you give? But when you break your back working and all you get in return is $400 if you are tenured, why would you tire yourself? You wouldn't care if students study or not, but of course if you have a conscience, you wouldn't think this way. There are a lot of shortcomings from the government, and of course nothing will be done about it. A teacher was telling me the other day, 'The last thing I would advise my daughter to do is to become a teacher'; look at that impression! How would students look at teachers? They would think, 'Oh look at those poor teachers.' All of this plays a role.\nIn spite of this economic impotence, teachers exercised their individual agency in various ways to supplement their incomes: teaching in several schools or centers, holding a second job outside education and giving private lessons to students. Teachers also exercised their agency collectively. For the last decade, teachers have organized strikes, though the financial demands of both tenured and contracted teachers have remained unheeded. At the time of carrying out this research, teachers', public sector and general strikes to demand their economic rights gripped the country. During my study in 2012 contracted teachers went on strike for two weeks, while the following year in 2013 tenured teachers went on strike for about month but to no avail. Grave security concerns in Lebanon with the rise in kidnappings, explosions, suicide bombings and street battles as a result of the interface between the Syrian conflict and sectarianism in Lebanon temporarily muted demands for economic justice in the absence of a central government. Since a government-in-transition was formed in March 2014, teachers have threatened an \"intifada 12 over corruption\" if the government does not address their demands. Teachers' concerns about their economic survival have displaced matters relating to learning and teaching. This was poignantly captured by the leader of the teachers' league in a recent public speech when he shared the following observation:\nOne day when it was break-time, I saw a fellow teacher walk across the playground and right outside the gate, he opened the trunk of his car, and people gathered around him. He was selling underwear and undershirts. I'm not making fun of or judging him -a man has to do whatever he needs to do to survive. But when this teacher goes home at night, is he going to be thinking about what are the newest teaching methods he could try out in class? Or what's new in terms of assessment techniques? Or is he going to be thinking about how many clients he has in Beirut that haven't paid him or what models of underwear he's short of? (Personal communication, attendee at public meeting, 05-10-2014)\nThe main reason for the government's inability and even unwillingness to pay teachers (as well as other public sector employees) their due is the lack of sufficient revenues to cover the costs. One of the stumbling blocks has been the exorbitant public debt that reached $64 billion and its debt-to-GDP ratio that stands at 163.1 percent -one of the highest in the world -combined with the deterioration of the economic situation as a result of the Syrian crisis (World Bank, 2013) . Additionally, the unresolved and deepening polarization of political factions, which recently culminated in an eleven-month political vacuum from March 2013 to February 2014 and still to this day the failure of the Parliament to elect a president, has resulted in frequent impasses and hampered the implementation of reforms (Ministry of Finance, 2013). Thus the fact the Parliament is experiencing political gridlock and paralysis, as well as under extreme pressure and lobbying from private sector interests, means it has been unable to enact the necessary legislation approving the government's proposed law and continues to grapple with how to fund the adjusted salary scales with no consensus in sight. The failure to establish and maintain an effective teacher salary scheme is often a major barrier to strengthening the education system in conflict-affected societies (UNESCO, 2011; .\nPoor financial and professional conditions, which are exacerbated by the politically fragile environment of the country also affect who chooses to enter the teaching profession in Lebanon. It is worth highlighting that teachers in my research mentioned stability, money and well-being; however, none of them made reference to how the lack of career promotion incentives influenced their sense of job satisfaction and motivation. Nonetheless, these factors have implications for how to attract and retain the best candidates, given the poor professional status and salaries of teachers.\nFor education policy to address these economic injustices to enable parity of participation (Fraser, 1995 (Fraser, , 2008 ) a politics of redistribution would be necessary with a reallocation of resources and a restructuring of public funds based on socio-economic need. Fraser (1997:23) warns of \"affirmative remedies aimed at correcting inequitable outcomes of social arrangements without disturbing the underlying framework that generates them.\" Thus surface reallocations, such as those adopted by the Lebanese government, have done little to address root causes of structural inequity and tend to mark the economically marginalised as deficient and always needing special treatment, which can fuel stigmatisation -that is, injustices of recognition."}, {"section_title": "From Sociocultural Injustice to Recognition", "text": "While the economic domain of justice is concerned with making education more widely available, Fraser's (2008) cultural domain of justice focuses on how educational differences and diversity are managed and contribute to an (in)equality of respect and dignity. In Fraser's view, misrecognition occurs when unjust institutional practices constitute some as inferior, invisible and socially subordinate. Fraser contends that cultural justice is possible when the status order expresses respect and social esteem for all actors to participate on a par with others.\nScholars (Shah & Lopes Cardozo, 2014; Tikly & Barrett, 2011) across different contexts have argued that the significance of students' historical and cultural differences, as manifested through social class, gender, age, ethnicity, religion, disability and refugee status and also their intersectionality, can neither be underplayed nor denied in educational systems. Within conflict-affected societies, issues of recognition are crucial in mitigating social inequity and the impact of violence (Davies, 2004) but also in engaging students in transformative learning. I extend Fraser's notion of misrecognition to discuss how public schools, school environments, teaching practices, teachers' expectations and quality of textbooks, as illustrated in this research, may undermine students' learning. Thus misrecognition featured strongly in relation to students' social and economic disadvantage."}, {"section_title": "Mis-attribution of students' disadvantage", "text": "When describing their role in facilitating students' learning, teachers consistently drew on learner-centered discourses, using words like 'guides', 'facilitators', 'helping students learn', 'getting students interested', and depicted students' role as being 'active', 'involved' and 'participating'. Teachers' discourses reflected the official policies of the 1997 educational reforms and often contrasted these postwar reforms with the traditional approaches to learning of the past whereby students were passive. However, how they attempted to translate these espoused theories into practice in their classrooms indicated several difficulties, which resulted in teachers developing strategies to cope in a highly constraining environment. The majority of teachers developed restrictive coping strategies: they relied solely on the textbook to fulfill curricular objectives whether or not the task was appropriate for students in underprivileged schools, expected students to be receptive to that task and continued with the curriculum regardless of students' responses. Many teachers emphasized skills, like being independent but without scaffolding them and without focusing on students' skills and knowledge (Bahou, 2014) . My classroom observations and post-lesson interviews revealed teachers' limited integration of what the reform principles meant in practice. Most teachers understood participation and active learning as closed questions and relied on demonstration while students passively listened and were expected to absorb the information. Additionally, 11 teachers across subjects expressed their expectation that students should memorize the content even though they did not personally agree with this practice, but they felt it was the only way to get students to study and pass examinations. Notably, even teachers of civicsthe very subject that was intended to cultivate active citizenship (MEHE, 1997) -also consistently commented that their students had to memorise in order to pass official examinations as illustrated in this teacher's comments:\nI tell students what to underline to facilitate matters for them. Otherwise, it's too much on them, the lesson is two pages long; once lessons start piling up and accumulating, students get lost. They shouldn't memorise, but that's the only way they study; either they memorise word for word, or they don't do anything. In civics, if they don't memorise [for Brevet], they will not get marks higher than 12 or 13 [out of 20].\nConcerns about the expectations of the Brevet as well as perceptions of students' substandard skills resulted in practices that developed students' surface engagement. However, two or three teachers managed to attune themselves pedagogically to their students' learning needs, developing strategies that expanded students' capacities to learn and achieve. For example, Widad wanted students to see themselves as capable and active learners and so designed classroom activities that would enable students to investigate, work together, and discover the concepts. She did this by first recognising their academic gaps and starting from where they were and gradually challenging them:\nI start simple and then gradually make it more difficult. It's better to start with the students' skills and knowledge and build them up. I create this atmosphere that Physics is easy and all of them can do well even when I am challenging them. For example, I am giving them a test and though they are grade 7, the test is actually for grade 5. It doesn't matter, I start with the concept and when they understand, I raise the level of difficulty and the students are with me. The test questions also train them to start developing their ideas and drawing conclusions.\nIn order to support students taking charge of their learning, Widad created conditions to support students shifting to this new role which meant shifting her role from expert to facilitator. Widad used experiential learning, group work and giving students individual attention in order to achieve that. Creating student assistant roles also enabled Widad to develop positive classroom discipline and collaborative group learning. Widad, like the other two pedagogically attuned teachers, did not assume that students already had the necessary skills, but that they were capable of developing them and achieving. These teachers managed to create classroom environments conducive to the substantive engagement of their students, supporting and strengthening students' positive self-perceptions and agency as learners (Bahou, 2014) . In Fraser's (2008) terms, these teachers' sociocultural valuing of students as learners disrupted hegemonic discourses of deficit and disrespect that create injustices of misrecognition of socially disadvantaged children. I would argue that these pedagogically attuned teachers were examples of \"pockets of hope\" (de los Reyes & Gozemba, 2002:1) , who, faced with limiting and oppressive circumstances, recognized and exercised their agency to take small, strategic steps towards transforming the negative learner identities of their students. As such, engaging students in order to meet their diverse learning needs appeared to be teachers' individual choice and initiative rather than central to school processes. However, even these teachers who created pockets of hope often resorted to transmissive teaching. Hence, these teachers, like their colleagues, reported facing severe constraints, including lack of time due to limited support, the timetable and their need to hold several jobs to survive economically. The lack of both supportive organisational structures and school cultures that provide teachers with time to hold meetings and encourage an engaged professional community of practice that advances students' and teachers' learning, indicated an important factor diminishing the potential for teachers to work well together, share resources and critically reflect on practices. This led some teachers to conclude that:\nWe are just individuals, not part of a team…we need to face them [problems] as a school. (May-Shamsi) We need more interactions between teachers. (Dima-Zeitouni) We have to change the way we communicate with each other in public schools. (Vicky-Hawa) Additionally, the vast majority of teachers criticized the quality of government textbooks and argued for their urgent revision. They listed the following problems: obsolete content and methods since they were written in 1997; inadequate preparation for the Brevet examination; lack of appropriate scaffolding for learning due to poor sequencing of skills; dearth of challenging exercises and opportunities for critical thinking; general inappropriateness because material was either too easy or too difficult for their class; poorly distributed themes; and disengaging content. Similar criticisms were identified by other Lebanese scholars (Ghaith, & Shaaban, 1999; Shabaan, 2013) and research institutions (LAES, 2003) . Even though most teachers felt the prescribed textbooks were deficient, they were still considered by teachers to be their reference for learning and teaching. Except for the three teachers who described developing productive strategies, the remaining teachers said they worked with what was provided due to lack of time, access to other resources and/or fear of being penalized by inspectors. These structural constraints, as well as limited professional learning, left teachers coping and as such when faced with difficulties in facilitating students' learning, they blamed students for academic failure.\nThis mismatch between teachers' capacities to foster students' learning and students' actual competencies was informed by most teachers' construction of the learner as deficient because of his/her family background. All 16 teachers in my study emphasized students' negative attitudes, apathy, poor homework habits, and sub-standard academic abilities. The majority of teachers expressed reservations as to whether or not their students were even capable of learning and also labelled students as 'smart', 'not smart', 'weak', 'high' and 'middle'. They attributed these shortcomings mainly to students' poor backgrounds. Twelve teachers repeatedly shared with me that most of their students did not want to learn: Students don't want to learn; most of them just come here to pass their time; two or three [out of 30] of my students care, the rest don't; I mean a few listen but they don't work and most do nothing. (Alia-Shamsi).\nMost of these students hate learning; they don't care to study and are unmotivated. (Samar-Zeitouni)\nThese teachers made reference to terms like 'forcing', 'begging', 'making', 'pressuring' or 'pushing' their students to work with little avail, as typically illustrated by Zarifa (Shamsi), 'It feels like you are pushing students to learn; forcing them to study and you don't see results...in their grades, in their progress.' Teachers interpreted that to mean that students were unmotivated and did not value their education. The majority of teachers highlighted that students did not value school learning because they assumed that it was not valued in their families and social environment. For example, Olga (Hawa) explained, 'We have many kids that come from an institution 13 and they are not living with their parents so they are not cared for. I feel especially the boys just come to fill up their time.' All teachers described parents' involvement in students' school learning as 'uninterested', 'cannot be bothered' and/or ' not caring'. Thirteen teachers drew comparisons between parents of children attending public and private schools, and assumed families in public schools did not care as much as their counterparts because they were uneducated, poor and did not have to pay school tuition.\nIt is possible that teachers overemphasized students' background as an obstacle and the majority expressed their limited sense of agency and responsibility for a number of reasons. Firstly, teachers were largely unaware of students' histories and particular circumstances and how they might be experiencing their school learning. The majority of teachers construed poverty as a household material and cultural deficit that students had to overcome through their own efforts in order to succeed:\nThe bad situation at home convinces him that he won't get a degree and so doesn't care. He is convinced that he doesn't want to learn. He becomes reckless, valuing nothing. He needs to see that this is his future and without a degree there is no economic security and independence. It's up to students to be convinced to change. (Salaam-Zeitouni) I tell them 'You are right studying is not fun, it's not attractive, it's not exciting. I was like you but it's the only thing that will allow you to break free from your miserable living conditions and improve yourself.' (Sabine-Zeitouni)\nHere both teachers highlight students' individual agency and responsibility in exercising different choices from those that they were exposed to in their environment. Secondly, teachers did not recognize the relationship between schooling and structural inequities and how their own practices were embedded in this dynamic. Consequently they focused on the deficiency of students' backgrounds and families to explain underperformance and disengagement, rather than the school features and practices that reproduce social and economic inequity. Students and families were expected to adapt to the requirements of schooling, and when they did not, students were blamed for failure, similar to public schools in Western contexts (Smyth, 2006; Zyngier, 2008) .\nTeachers expressed how they struggled to cope with their students' learning needs and misbehavior, and attributed these difficulties to the absence of parental involvement and responsibility, as illustrated by Jameela (Zeitouni), 'If only parents knew how to raise their children properly, then we wouldn't have these problems.' This perceived negligence led most teachers to suggest the need for more assertive disciplinary action against students who misbehaved and were not academically engaged including violent discipline such as corporal punishment and verbal humiliation. Most teachers justified their stance based on three assumptions about young people in public schools: they were uncontrollable nowadays, hitting applied in other schools had yielded positive academic results, and students were more responsive to physical punishment because as children they were raised this way at home. These teachers even lamented the Ministry's prohibition of violent discipline since 2001. Teachers who did consider violent disciplinary practices to be necessary, though they knew they were prohibited by the Ministry, felt there was no other alternative to ensure students would study and succeed. Students' resistance to complying with school norms expressed through poor grades, misbehaviour and/or apathy towards studying was interpreted by teachers to mean they needed to coerce students rather than re-examine current school routines. This raised questions about why policies, such as banning corporal punishment or applying human rights, as illustrated in the teacher's quotation at the beginning of this paper, were unaccompanied by adequate professional learning to support teachers to make this shift.\nAdditionally, teachers' negative views of public schools in general, derived from their perceptions of students' sub-standard abilities and poor socio-economic backgrounds, which, they felt, reflected the image of public schools. Stigmatizing of public schools was also evidenced by the simple fact that none of the principals, teachers or supervisors in my study enrolled their own children in public schools. This distrust was not just because of the quality of students attending public schools but also reflected a wider lack of political trust in government-run institutions due to rampant corruption and the squandering of public funds (Haddad, 2002) . All 11 parents I interviewed expressed to me the importance of placing their children in private primary schools and then moving them to public schools during the intermediate or even secondary years, depending on what they could afford. Lebanese parents attach more importance to educational quality at primary level than at middle or higher levels, which explains the higher enrolment of students in private primary and intermediate schools. Nahas (2011) argues that primary education acts as a critical threshold of social and economic differentiation because of the opportunities in private schools for early development of strong foreign language and cognitive skills.\nIn summary, the schools' capacity to recognize and value students' diverse needs was very limited. Teachers' restricted practices to engage their students were a result not only of system-level factors, but also teachers' deficit beliefs about students. Lebanese scholar, Akkary (2014) , asserts that the reforms did not penetrate beneath the surface to address educational beliefs and values of stakeholders (practitioners, administrators, policy-makers, parents, students). In Lebanon, educational reforms that aimed to broaden the purposes of education, the learning and teaching process and value diversity, at least in principle, operated in a superficial and mechanical manner, leaving the underlying structure unchanged.\nFor education policy to address these sociocultural injustices to enable students' parity of participation (Fraser, 2008) , a politics of recognition would be necessary, requiring the development of inclusive and relevant learning environments that would engage with the contemporary realities of young people's lives and experiences. Such practices would be central to creating more equitable patterns of respect and esteem in order to reflect sociocultural recognition of socially disadvantaged students. This means fundamental changes in how teachers view difference and ability, and approach learning and teaching in relation to those coming from poor households.\nThe dissonance between reforms and micro-actions in schools is a reflection of the lack of equitable representation of stakeholders in the reform process and mirrors patterns of authoritarian relations in the educational system and society."}, {"section_title": "From Political Injustice to Representation", "text": "Fraser (2008) argues that political obstacles to parity of participation arise when ordinary-political misrepresentation occurs in which political rules and processes within nation states deny certain citizens the chance to participate fully in making their voices heard in public debates and in decision-making. This form of (mis)representation can be understood in relation to education governance and quality, in which issues of active participation, voice, accountability and decision-making are interrogated and embraced at all levels of the education system (Tikly & Barrett, 2011) . Within conflict-affected societies, as Smith (2005) argues, arrangements for representation and participation in consultation, decision-making and governance at all levels of the education system are crucial since the system's capacity to recognize and address inequities and grievances can serve to exacerbate or mitigate violent conflict. Thus participatory representation would necessitate democratizing relations among stakeholders and the creation of spaces where issues could be raised, debated and resolved. This implies adopting an enlarged stance towards the purpose of education in order to encompass engaged classrooms and schools as sites for personal empowerment and collective agency."}, {"section_title": "Authoritarian educational hierarchy in a divided society", "text": "The 1997 postwar educational reforms emphasized a discourse of democracy, participation and human rights in Lebanon (MEHE, 1994) . However, they did not make explicit provision for equitably involving stakeholder bodies, such as teachers' and parents' associations, and the main stakeholder, students, in key decisions in and around schooling (BouJaoude & Ghaith, 2006) . Though some public-sector representatives had been selected to participate in the reforms (Shaaban, 2013) , policies were largely disconnected from the actual problems of practice and priorities of practitioners and students. Policies were not based on any needs assessment or adequate conversations with the main stakeholders as active partners in the identification of problems and strategies for improvement.\nAdditionally, the education system does not contain an embedded mechanism to address emerging needs and for stakeholders to initiate, implement and evaluate educational changes, or even challenge policies of the Education Ministry. For example, there has been no evaluation or revision of the 1997 curriculum by either the Ministry or CERD (Shaaban, 2013) . Thus public schools are largely treated as hierarchical, non-consultative and rigidly bureaucratized institutions for implementing reforms rather than as partners in the reform process.\nAuthoritarian and exclusionary processes that produce and reinforce subjugated schools, teachers and students are characteristic of, but not confined to, Arab education systems (Akkary, 2014; Mazawi, 2010) . Drawing on his ethnography of 10 public schools in Egypt, Naguib (2006: 58) describes the \"elaborate pyramidal, authoritarian hierarchy\" that pervades Arab schools, curtailing the participation and authority of teachers (and administrators) to effect change, and turning them into executers of decisions and regulations issued from above.\n14 Similar concerns have also been raised by US and UK scholars who have argued that authoritarianism produced by government-compliance mechanisms of control over quality based on narrow performance-measurement targets, have also thwarted opportunities for stakeholders to participate actively in informing key schooling decisions (Ball, 2003) . However, unlike in Western countries, Lebanese policy-makers act within a contested terrain that is embedded in a post-colonial conflict society fractured along religious, political and economic lines and within the inadequacies of the country's sectarian powersharing-based governance."}, {"section_title": "Teachers' perceptions of themselves as disempowered", "text": "Student engagement scholars, such as McMahon and Zyngier (2009) , argue that a critical-democratic framework of student engagement in learning, which engenders students' empowerment, and personal and social transformation guided by equity, social justice and inclusion would best serve students who come from socio-economically poor and marginalized communities. The above-mentioned authors also contend that technical and student-centered notions of engagement are limited because they do not challenge the role of education in our current society and the structures that reproduce schooling inequity. Based on stable Western contexts, their framework presupposes a particular kind of teacher and school leader, with a strong awareness of social justice and commitment to challenging forms of oppression that reinforce (dis)engagement in school settings. It also assumes that teachers have opportunities and tools to adopt more critical and transformative forms of engagement. However, Lebanese public schools have limited autonomy to exercise agency and instead operate within policies of sameness that have institutionalized a one-size-fits-all approach characterized by routinization and standardization.\nSchools in Lebanon function as units and teachers as sub-units without recognizing the populations they serve, their resources and the communities in which they are located or having the tools to implement the reforms, leaving little scope for flexibility, innovation and responsiveness to students' needs. Most teachers expressed their frustration and disappointment when reflecting on the gap between the spirit and reality of the reforms, as illustrated in this teacher's comments:\nThe teacher's role is to set up conditions for students to discover knowledge, criticise their own work and explore how problems can be approached in different ways. This was the intended spirit of the reforms but an over-stuffed curriculum, terrible textbooks combined with old-fashioned supervisors who interfere in your class and 30 kids leaves you delivering the information.\nConsequently, the majority of teachers in this study focused their concerns on student behaviour, covering the curriculum objectives and preparing students for examinations. Significantly, teachers appeared to subscribe to a technical educator role. They did not appear to see themselves as being more involved in school life or as initiators or active contributors to reform, as conveyed by Majed's (Zeitouni) typical comments, 'My role is in the classroom and finishing the curriculum. I cannot take responsibility beyond that.' There were very few accounts of teachers recognizing the political nature of education that linked student learning to self-empowerment, social change and \"connecting critical learning to the experiences and histories that students' bring to the classroom\" (Giroux, 2003:6) . Based on an initiative for school-based reform conducted in seven Arab countries, including Lebanon, Akkary (2014:187) argues that top-down approaches have resulted in deeply ingrained norms of \"learned passivity\" in which teachers perceive school change and improvement to be the responsibility of those in formal positions, such as policy-makers. Teachers are not expected to engage in reflection, inquiry and critical thinking to generate curriculum ideas or to have professional dialogue with colleagues (Akkary, 2014) . This is also reflected in the quality of ongoing professional learning where their needs as adult learners have been neglected (Akkary, 2014; Sab'Ayon, 2013) . However, this reluctance is also reinforced by the social, rather than professional, nature of relationships among teachers and between teachers and administrators -making it unlikely that teachers would publicly question practices -and also by the low status and recognition of the teaching profession.\nWhile the economic and sociocultural spheres of justice are associated with top-down changes, the political sphere is concerned with levelling the playing field in which the active involvement of all stakeholders in decision-making processes enables making justice claims (Fraser, 2008) . Although Fraser argues that equitable representation necessitates all being accorded a voice, she acknowledges that this process is not without complexities and tensions. In similar vein, hooks (1994) warns that voice must not be reified, unproblematised and unaffected by the context. Enabling parity of participation depends on every stakeholder being heard and actively involved, developing shared aims for education and amplifying their collective capacities to inform and influence educational policies and processes to better respond to the learning needs and aspirations of all students."}, {"section_title": "Conclusion and implications", "text": "The aim of this paper was to make more visible a contextualised understanding of the factors, conditions and inequities influencing teachers' practices in Lebanese public schools.\nWhat emerges from this critical analysis is that facilitating students' substantive engagement in learning is nested within the wider Lebanese context in which schooling takes place and thus is influenced by multi-layered classroom, school and education system levels, as well as interactive socio-political, economic, sociocultural and historical factors. The findings suggest that postwar educational reforms were limited because the Ministry's attempt to promote the ideals of social cohesion failed to address the underlying structural violence, concealing the socio-economic inequities stemming from sectarianism, and overlooking the daily injustices taking place in classrooms. Lebanese scholar Shuayb (2012) argues that postwar reforms based on a minimalist approach to social cohesion has maintained the status quo through pacifying discourses of national belonging, rendering invisible the existing societal class divisions. Recognising these different inequities, both their historical roots and current manifestations in society and schools, would be an important first step in any future educational policy reforms. Thus social justice needs to penetrate the Lebanese policy landscape in practice. Based on the evidence and discussion above, I outline strategies to transform the economic, sociocultural and political injustices limiting teaching practices in order to support teachers in making engagement central to the learning and empowerment of all students:\n• Redistribution of resources. A number of actions could be undertaken by the government to make structural changes to public expenditure including the reallocation of public spending that currently pays for the private schooling of children of civil servants (including teachers) and of funds subsidizing private schools to public education. Additionally, schools with very low student enrolment (as was the case with three of the public schools in my initial sample of six) could be merged.\nFor example, according to CERD's data in 2010, 153 public schools contain fewer than 50 students and 12 schools have more teachers than students. Resources gained must be equitably distributed between the public schools according to need and particularly to those in areas that are disadvantaged. Significantly, the government must re-examine the current ineffective taxation system, that over-relies on indirect taxation, namely Value Added Tax and taxes on consumption, which represents up 70 percent of the government's revenue and 6 percent of GDP (Chaaban, 2014) in order to pay appropriate salaries to teachers and strengthen social and health welfare services. Finally, revising teachers' professional standards, phasing out the contracted status, making the acquisition of a teaching certificate alongside a university degree a requirement and providing opportunities for teachers to become certified, would all be essential for the re-professionalization of the teaching corps. Similar to findings in other postwar conflict-affected contexts (Shriberg, 2009) , fulfilling Lebanese teachers' basic needs for economic security, respect and well-being is crucial to providing quality public education for all children.\n• Recognition of students' diversity and capacity to engage in learning. The findings suggest that the Ministry could work with school members to develop respectful, inclusive, humanizing and participatory learning practices and environments. Teachers and administrators could be supported to prioritize not just academic work, but also cognitive, emotional, social and civic student engagement. As most teachers are ill-equipped to meet the needs of their students, it is essential to provide effective pre-service and on-going professional learning on and off school sites, based on the challenges teachers and students are facing. The findings suggest the need to revise teachers' professional learning so that it is based on social constructivist learning theories and teachers are encouraged to interrogate their fixed assumptions about learners' abilities due to their background and instead embrace a view that all children are capable of learning and achieving. Developing an understanding of the negative impact of punitive practices such as corporal punishment and verbal aggression and equipping teachers with alternative tools, may support teachers to cultivate more dialogic relationships with students that value them as young people and learners. Teachers' accounts suggest the need to support teachers develop effective strategies to actively engage their students in response to students' needs, interests and aspirations. Learning should be made the explicit focus of teachers' practices through the use of formative assessments. The involvement of highly engaging teachers like some in this study could play an invaluable leading role in strengthening professional learning in their schools. Moreover, the findings assert the need for revising textbooks and in some cases redevelopment by a team of experienced professionals to address inadequacies regarding skill level, sequencing, relevance to contemporary life, opportunities for critical engagement and quality of texts. Rather than relying on one textbook per subject, a range of curricular supportive materials could be provided for each subject to meet the diverse needs of all children. Additionally, schools could engage parents more actively by recognizing, valuing and making space within educational structures for parents' knowledge, skills and life experiences, which could enhance students' engagement with learning and contribute towards transforming public schools.\n• Representation to enable stakeholders to influence and shape decisions. Schools, particularly teachers and administrators, could benefit from the development of a comprehensive system for school-based improvement, which affords more collaboration within and between schools, greater agency and support for schools to develop their capacities to make, implement and assess educational decisions in response to their students' needs and aspirations. This would involve the Ministry, academics, schools including students, teachers, families and even non-governmental organizations working together to transform schools into professional learning communities (Katzenmeyer & Moller, 2009 ), whereby such an active participation in decision-making enables a democratisation of schools (Muijs & Harris, 2003) . This of course would necessitate a deep structural and cultural shift in how educational change has been envisioned so far. Trends in educational reform in Arab countries have been government-mandated strategic plans sponsored by western donor organisations, which have often ignored the priorities and needs of educators and children and have been disconnected from the realities of schools (Mazawi, 2010) . Developing a local knowledge base and culturally grounded innovations necessitate abandoning the top-down and one-size-fits-all model, and instead making inquiry, professional dialogue, shared purpose and resource exchange central tenets in the reform process at the level of classrooms, schools and educational systems (Akkary, 2014) . School-based reform initiatives that have adopted action research to improve school learning have shown promise in Lebanese private schools through partnerships with academics (Akkary, 2014) or schools researching themselves (Zakharia, 2013) . Also, drawing on the example of the INCLUDE-ED project, 'Strategies for Inclusion and Social Cohesion in Europe from Education' may provide possible pathways forward. The researchers in the project engaged in continuous dialogue with teachers, students, families, community members, policymakers and administrators of primary schools within marginalised communities in Spain to understand academic failure and dropping out in the school and develop a vision of educational success the school members wanted to achieve through the use of successful educational actions (INCLUDE-ED consortium, 2009 ). The findings suggest that the use of dialogic and inclusive approaches where all stakeholders were involved combined with the support of researchers played a critical role in transforming the schools and communities with high levels of academic success and engagement (Alexiou & Sorde, 2011; Flecha & Soler, 2013) . A reform approach where structural changes allow and encourage school-based initiatives to strengthen the engagement of students while ensuring the active participation of all stakeholders can become the much-needed building blocks for transforming educational inequalities.\nThe current deteriorating situation in Lebanon, as well as the expansion of regional conflicts, indicate that addressing the underlying structural inequity is unlikely at this time. I recognize that the injustices that have shaped students' disengagement and underachievement have by no means been generated and sustained solely in schools but in fact reflect patterns in the broader society that must also be addressed. However, there is a moral imperative to provide the economic, sociocultural and political support necessary for all children to thrive in their engagement with learning and life. Faced with violence and fragmentation young people need to be equipped with the skills, dispositions and knowledge to live fuller lives and to contribute actively to a democratic society based on peace and justice. Failure to act urgently to ensure the right of children and youth to high-quality public education, which serves even the most marginalized, could lead not only to social exclusion, but also violence that further destabilizes the region. Thus if education is to play a transformative peace-building role (Smith, 2005) , as initially envisaged in Lebanon and other conflict affected societies, rather than reproducing the status quo, public schooling must fulfill a social justice agenda through acts of justice within classrooms, schools and the wider education system as a means and an end in itself."}]