[{"section_title": "", "text": "C oronaviruses (CoVs) can accumulate mutations that allow them to adapt to new hosts and ecological niches (1) . The epidemic and pandemic potential of novel coronaviruses have been highlighted with the emergence and spread of severe acute respiratory syndrome coronavirus (SARS-CoV) in 2003 and Middle East respiratory syndrome coronavirus (MERS-CoV) in 2012 (2) . In early December 2019, following the reports of cases with pneumonia of unknown origin from Wuhan, Hubei, China (3, 4) , a Betacoronavirus named severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) was identified as the responsible pathogen (5, 6) . On March 11, 2020 , the World Health Organization declared the outbreak of coronavirus disease 2019 (COVID-19) caused by SARS-CoV-2 as a pandemic. Since the first Canadian case of COVID-19 was reported in Ontario, Canada, on January 22, 2020, all provinces and territories (except Nunavut) have seen a steep rise in the number of confirmed cases. Despite mild to moderate disease severity and mortality of 1% to 2%, primarily in the elderly and those with comorbidities (7), the lack of global immunity to this novel virus is resulting in large numbers of individuals developing significant respiratory sequelae that are threatening to overwhelm the current health system. SARS-CoV-2 is an emerging pathogen, and in the absence of antivirals, therapeutics, or vaccines, use of sensitive and specific tests for the early detection and isolation of cases is the first critical step in the public health response.\nThe Alberta Precision Laboratories, Public Health Laboratory (ProvLab), based at two sites, namely, Edmonton and Calgary, AB, Canada, serves a provincial population of 4.37 million people spread over an area of approximately 660,000 km 2 , and provides testing support for the Northwest Territories. In addition to providing services such as surveillance, research, education, and training, the ProvLab performs a wide range of specialized tests with a public health impact, including water testing, and supports the acute care microbiology testing at the University of Alberta Hospital. The ProvLab tests approximately 2 million patient samples annually. One of the key mandates of the ProvLab is to respond to threats of emerging pathogens by providing the diagnostic arm for case detection in order to assist public health authorities with contact tracing and outbreak control measures.\nFollowing the SARS outbreak in 2003, the role of public health laboratories in rapidly responding to newly emerging diseases was recognized in Canada (https://www.phac -aspc.gc.ca/publicat/sars-sras/pdf/sars-e.pdf). The formation of the Canadian Public Health Laboratory Network (CPHLN), of which the ProvLab is a member, occurred in the early 2000s, and this established the basis for a well-coordinated network of public health laboratories in Canada. The CPHLN works collaboratively to share protocols and samples, thus facilitating the rapid development and validation of tests across the country for emerging diseases, such as pandemic H1N1, Zika virus, and Ebola virus outbreaks in the past, and for the current response to SARS-CoV-2. Both the CPHLN and National Microbiology Laboratory (the national reference laboratory of Canada) work closely to facilitate the nationwide sharing of samples, as access to positive controls and validation panel samples are a challenge for newly emerging diseases. Similar to our collaboration with other provincial laboratories through the CPHLN, the ProvLab works closely with other clinical laboratories in Alberta within Alberta Precision Laboratories for the sharing of protocols and samples to enhance capacity for efficient testing over a large geographical area. SARS-CoV-2 testing in Alberta was initially implemented at the ProvLab, where personnel with training and expertise in the development, validation, and implementation of molecular diagnostics were available. Once the testing was operationalized, controls were established, and more positive and negative samples were available, efforts to decentralize testing were initiated, although the ProvLab continues to support the bulk of the testing. Based on the equipment and expertise available in the different clinical laboratories, ProvLab provided protocols, controls, and validation materials for the implementation of commercial assays, adaptation of the lab-developed test on commercial platforms, or rapid testing as appropriate.\nWithin Alberta, the delivery of health care is the responsibility of a single health authority (Alberta Health Services). A single laboratory organization (Alberta Precision Laboratories) is a wholly owned subsidiary of the health authority and is responsible for clinical diagnostic testing in the province, including the work done by the ProvLab. While still a work in progress, there is a move to transition to a single clinical information system and laboratory information system within Alberta. The Chief Medical Officer of Health (CMOH) within the Ministry of Health (Alberta Health) is the most senior public health leader for the pandemic response in Alberta. The close working relationships between the CMOH, the Alberta Health Services Medical Officers of Health (MOHs), the single health authority, the single laboratory organization, and the public health laboratory with close ties to the national network of public health laboratories have all been absolutely essential to the ability of ProvLab and its partners to rapidly and effectively respond to COVID-19.\nSince the genome sequence of SARS-CoV-2 was available early in the pandemic, as a rapid response to this global health emergency, two PCR-based molecular assays were developed for diagnostic testing. Both assays targeted the RNA-dependent RNA polymerase (RdRp) gene; one set of primers was designed for the detection of all alpha-, beta-, and gammacoronaviruses, and another set was designed for the specific detection of SARS-CoV-2. They were designed as gel-based assays for rapid deployment with the intent that all amplified products would be sequenced for confirmation. These assays were implemented on January 21, 2020, and used for the detection of SARS-CoV-2 in January and early February 2020, with about 10 samples being tested per week. Real-time reverse transcriptase PCR (rtRT-PCR) assays were simultaneously developed to increase throughput. Two rtRT-PCR assays, one targeting the envelope (E) gene (8) and one targeting the RdRp gene (in-house), were validated and implemented on February 14. With the implementation of these assays, our testing capacity increased to over 1,000 samples a day, and the first positive case in Alberta was detected on March 5. To further increase testing efficiency and throughput, these rtRT-PCR assays were multiplexed, and the detection of MS2 (9) as an internal, extraction, and inhibition control was also incorporated in the test. This assay was implemented on March 16 and allowed for the testing of over 30,000 samples per week. Rapid assay development and multiplexing allowed the ramp up of capacity to address the growing demand for testing in Alberta. In the early stages of the pandemic when positive specimens were not available, initial validation was performed using in vitro-transcribed quantitated RNA. Different negative specimen matrices were spiked with this RNA to mimic positive patient samples. Blind validation panels provided by the National Microbiology Lab and College of American Pathologists were tested on an on-going basis for assay validation. As commercial assays became available, these assays were verified and implemented for patient testing; the commercial assays currently in use in different clinical laboratories across the province include the cobas SARS-CoV-2 test (Roche Diagnostics), Allplex 2019-nCoV assay (Seegene), Simplexa COVID-19 Direct assay (Diasorin Molecular), and Xpert Xpress SARS-CoV-2 Test (Cepheid). The timeline for the evolution of the pandemic and the ProvLab responses is outlined in Fig. 1 . Specimens submitted from January 20 to May 24, 2020, to the Alberta Precision Laboratories for the investigation of COVID-19 are shown in Fig. 2 . A total of 236,077 samples were tested during this time period, and 6,475 (2.74%) samples tested positive. Public health laboratories cannot depend on the availability of validated commercial kits with a quick response time because of regulatory requirements and manufacturing processes. Thus, individuals with the expertise and experience in assay development and validation using highquality standards, such as guidelines provided by the College of American Pathologists, are valuable for rapid test development. ProvLab is working with partners within Alberta and nationally to evaluate commercial serology tests and to implement appro-priate serological testing for SARS-CoV-2. It is clearly recognized that serology is not appropriate for early acute diagnostics, with the focus being on the serologic surveys to determine the extent of the spread of SARS-CoV-2 in the population over time.\nThis pandemic presented unique challenges, including a rapid increase in the numbers of samples that needed to be tested (initially dozens of tests to several thousand per day), variations in test volumes because of alternating expansion/narrowing of testing criteria defined by the public health authorities, and supply chain issues. The connection between development and deployment was key to the rapid response provided by ProvLab. Teams working concurrently, including decision-making authorities, individuals with the skill set to rapidly design, develop, and validate tests, and expert technical staff capable of rapid implementation and scaling up as the demand of testing increased, were the key features of the successful response. Several changes in the workflow and streamlining of testing protocols were made to accommodate the requirements for increased testing and quicker turnaround times in order to provide timely diagnoses. Decisions for new equipment purchases, such as extractors and analyzers, were rapidly made, and equipment was borrowed from other laboratories when possible to ensure that capacity was immediately available for a response. Trained technical staff from within the organization and other laboratories were redeployed to the ProvLab as staffing and laboratory operational hours were increased. At time of writing, redeployment and training of staff continue in an effort to optimize the workforce for current and future workload surges.\nDue to the rapid spread of SARS-CoV-2 and the demand for increasing test volumes, the laboratory's respiratory testing algorithm underwent several changes during this time period, as summarized in Fig. 3 . Prior to the COVID-19 outbreak, specimens from community patients were tested for only influenza A and B, while hospitalized/ emergency room (ER) patients and patients included in outbreaks with a respiratory etiology were tested for all respiratory viruses included on the Respiratory Pathogen Panel (RPP; Luminex, ON, Canada) or only influenza A and B. The viral targets included on the RPP are influenza A and B, respiratory syncytial virus, parainfluenza viruses 1 to 4, seasonal coronaviruses (CoV-229E, CoV-NL63, CoV-OC43, and CoV-HKU1), human metapneumovirus, enterovirus/rhinovirus, and adenovirus. Between January 17 and March 6, the algorithm was updated to include testing of SARS-CoV-2 for patients approved by MOHs and/or at the discretion of the virologist on call with an appropriate exposure history, usually travel related. During March 7 to 13, the need for MOH approval was lifted and community patients were tested for influenza A and B and/or SARS-CoV-2 upon physician request. Hospitalized and ER patients were tested by RPP and for SARS-CoV-2, while respiratory outbreak patients were tested for SARS-CoV-2, with or without RPP, depending on what was requested. From March 13 to the date of writing, all community patients and those presenting at the COVID-19 assessment centers are being tested for SARS-CoV-2 only. All hospitalized and ER patients continue to be tested by the RPP assay and for SARS-CoV-2, and respiratory outbreak patients are tested for either SARS-CoV-2 or by the RPP assay depending on the public health request.\nThe unprecedented pace at which the pandemic evolved presented several technical and supply chain management issues. Some of the challenges encountered were the shortage of collection swabs, transport media, and reagents. To address the shortage of nasopharyngeal flocked swabs and universal transport media, collection kits used for other specimen types were rapidly validated for their utility to collect and transport respiratory samples. ProvLab and Alberta Health Services procurement teams explored the availability of these supplies worldwide to remove bottlenecks and broaden the supply chain. When new suppliers were identified, all of the nontraditional transport media and swabs were investigated for the stability of the SARS-CoV-2 virus at different temperatures, time periods, and viral loads (data not shown). Swabs and media with promising results were deployed in the field for the collection of patient samples. A local company that could manufacture universal transport medium was identified, and protocols for production were developed. The validity of buffers prepared in-house was concurrently investigated for use as transport media. In addition to the investigation of the utility of a variety of swabs for specimen collection, attempts at 3D printing of swabs are ongoing. Securing a local supplier is predicted to alleviate supply chain issues in the coming months. Similarly, shortages in extraction reagents were addressed by exploring options from other manufacturers and adapting them to instrumentation on hand, as well as extensively sourcing alternative reagents from additional local, national, and international manufacturers. Attempts to make reagents in-house with expert advice from academicians at the different relevant facilities are ongoing. Similar efforts are ongoing for the in-house production of amplification reagents.\nBrainstorming and experimentation are ongoing to improve testing efficiency using strategies such as detection directly from a specimen without extraction (10, 11) or by pooling multiple samples and screening out negative pools. Patient samples from pools that test positive can be individually tested. Decentralization of testing using point-of-care assays or rapid testing platforms and diversification of testing protocols by validating high-throughput commercial testing kits and platforms have helped to scale up the capacity and numbers of samples tested in Alberta. A comparison of the interprovincial testing rates based on population has consistently shown that Alberta is able to test at a high rate as a result of all the strategies mentioned above.\nThe ongoing challenge of emerging infectious agents highlights the role of public health laboratories in pandemic preparedness. Several valuable lessons learned include the importance of a close relationship between public health laboratories across the country in developing and validating testing protocols by sharing knowledge and materials, a single health authority and laboratory system, and a close working relationship between the different laboratories within the province. Other key lessons learned have been the importance of maintaining rapid clinical validation capacity, a strong supply chain management team, and proactively establishing multiple supply chains with redundancy for reagents."}]