[{"section_title": "Abstract", "text": "Conclusions: Study results showed that waist circumference 90 cm is an independent risk factor of prostatic hyperplasia in Taiwan. Men with abdominal overweight/obesity (WC 90 cm and BMI > 24 kg/m 2 ) have a twofold risk of developing prostatic hyperplasia."}, {"section_title": "KEYWORDS", "text": "body mass index; obesity; prostate-specific antigen; prostatic hyperplasia; waist circumference Summary Purpose: Benign prostatic hyperplasia is a common disease affecting older males. As obesity becomes an increasing problem worldwide, its role in prostatic hypertrophy has been discussed recently. The purpose of this study is to evaluate the relationship between waist circumferences and prostatic hyperplasia in Taiwan. Methods: There were 539 men enrolled in the study who had health examinations at the Healthcare Center of Chang Gung Memorial Hospital; 53 were excluded because of history of conditions affecting prostatic volume. Their anthropometry was measured and serum prostate-specific antigen (PSA) levels as well as lipid profiles were analyzed. Prostate volume was measured by transrectal ultrasonography performed by experienced urologists. Results: The mean prostate volume was 26.43 mL, whereas mean body mass index (BMI) was 25.27 kg/m 2 and mean waist circumference (WC) was 90.81 cm. By age-adjusted logistic regression, PSA > 4 ng/mL, WC 90 cm, and BMI > 24 kg/m 2 are associated with increased risk of developing prostatic hyperplasia; only WC 90 cm can be validated by multiple logistic regression. Further analysis of obesity patterns showed that abdominal overweight/obesity places patients at increased risk independently rather than high WC or high BMI alone."}, {"section_title": "Introduction", "text": "Benign prostatic hyperplasia (BPH) is a common disease affecting middle-aged and older males that accounted for 4.4 million outpatient visits as a primary diagnosis in the year 2000 in the United States. 1 Approximately 24% of white men 50 to 79 years old were estimated to have BPH. 1 According to the 2008 national statistical data published by Ministry of the Interior 2 and Department of Health, 3 Taiwan's BPH prevalence, defined as clinic visits or hospitalizations with a primary diagnosis of BPH per midyear population, is 14.71% in men 60 to 69 years of age and 26.90% in men 70 to 79 years of age (Table 1) . Prostatic hyperplasia causes both obstructive and irritative symptoms interfering both quality of life and productivity of affected men. The medical costs for BPH treatment were $2.36 billion New Taiwan dollars in the year 2008, accounting for 0.51% of the annual national health insurance budget in Taiwan. 3 These costs did not include the money for the selfpaid instruments used in BPH endoscopic surgeries, which are not supported by the national health insurance system.\nThe pathogenesis of BPH is not well understood. Aging, androgens, estrogens, growth factors, inflammation, and some modifiable risk factors including obesity and diabetes have been reported to play important roles in the etiology of BPH. 4e6 In the Baltimore Longitudinal Study of Aging (BLSA), body mass index (BMI) greater than 35 mg/kg 2 is associated with increased risk of enlarged prostate (40 cc or greater). 7 Giovannucci et al. 8 reported more surgical procedures to treat BPH in males with waist circumference (WC) greater than 109 cm. The third National Health and Nutritional Examination Survey (NHANES-III) suggested WC greater than 102 cm is associated with an increased incidence of lower urinary tract symptoms (LUTS). 9 This evidence indicates a positive correlation between male WC and prostate volume (PV).\nBecause PV predicts BPH-related treatment outcomes, 10 it is important to acknowledge PV in the management of patients with BPH. Transrectal ultrasonography (TRUS) of the prostate, described by Terris et al., 11 is by far the most accurate and reproducible method for measuring PV. We observed the same trend that men with greater WC tend to have an enlarged prostate while performing TRUS at our hospital. This preliminary report examines the relationship between WC and PV in Taiwanese adult men."}, {"section_title": "Methods", "text": ""}, {"section_title": "Patients", "text": "During the period between January and May 2009, 539 men completed advanced health examination including TRUS of the prostate at Healthcare Center of Chang Gung Memorial Hospital. Fifty-three of them were excluded from the study because of a history of prostate surgery (15) , prostate malignancy (9), or taking 5-alpha reductase inhibitors (29), which might affect the size of the prostate. A total of 486 men, age 33 to 93 years, were included in this crosssectional study, which is approved by the institutional review board of the hospital."}, {"section_title": "Measurement", "text": "Body weight and height were measured and recorded at registration, and WCs were measured at the narrowest point between the lowest rib and the uppermost lateral border of the iliac crest. BMI was calculated as body weight in kilograms divided by the square of the patient's height in meters. We use national standards provided by the Bureau of Health Promotion to define BMI greater than 24 kg/m 2 as overweight/obesity and WC larger or equal to 90 cm as above normal. Fasting blood sugar, prostate-specific antigen (PSA), triglyceride, cholesterol, and high-density lipoprotein (HDL) levels were checked before proceeding to TRUS to avoid transducer's influence on the serum PSA level."}, {"section_title": "Transrectal ultrasonography", "text": "Five experienced urologists (KJL, MLH, YC, HCH, and YCH), who did not have the information about the aim of this study, performed TRUS of the prostate gland. A 7 -MHz rectal transducer (VT-TRT5000) was used with an ultrasound scanner (HDI5000, Philips, the Netherlands) with the method described by Terris et al. 11 Diameters on three axes were recorded and the volume of prostate was calculated with the spheroid formula: p/6 (diameter 1) (diameter 2) (diameter 3). Prostatic hyperplasia was defined as a volume exceeding 20 mL, a commonly used parameter of clinical BPH criteria. 12 "}, {"section_title": "Statistical analysis", "text": "Statistical analyses were performed using SAS statistical package (SAS for Windows version 9.2, SAS Institute Inc., Cary, NC, USA.). Odds ratios (ORs) were calculated using binary logistic regression analysis to evaluate the association between these variables and prostatic hyperplasia, which was defined as a PV > 20 mL, after adjusting for age in 10-year intervals. Multiple logistic regression also was used as a multivariate analysis model for prostatic hyperplasia. Statistical significance was defined as p < 0.05; all tests were two-sided."}, {"section_title": "Results", "text": ""}, {"section_title": "Patient characteristics", "text": "The characteristics of these 486 men are listed in Table 2 . The age distribution of these patients was as follows: 18 men (3.7%) in their 30s; 125 (25.7%) in their 40s; 192 (39.5%) in their 50s; 100 (20.6%) in their 60s; and 51(10.5%) older than 70 years. The mean PSA level was 1.52 ng/mL and the mean PV was 26.43 mL, compatible with that of most patients older than 50 years who are prone to having an enlarged prostate. Their mean BMI was 25.27 kg/m 2 ; mean WC, 90.81 cm; and mean cholesterol level, 200.74 mg/dL; all values are slightly above the recommended thresholds (24 kg/m 2 , 90 cm, and 200 mg/dL, respectively)."}, {"section_title": "Association between PV and variables", "text": "We used age-adjusted regression to examine the ORs of each variable to evaluate their risks on BPH, defined as PV exceeding 20 mL ( Table 3 ). The data showed that men with elevated PSA level (OR 5.507, 95% CI 1.187-21.547, p Z 0.028), large WC (OR 1.565, 95% CI 1.031-2.377, p Z 0.036), BMI greater than 24 kg/m 2 (OR 1.877, 95% CI 1.242-2.838, p Z 0.003), and aging (p < 0.001 in each 10year age interval) are associated with higher risk of developing prostate hyperplasia; serum fasting blood sugar, triglyceride, cholesterol, and HDL levels are not related to enlarged prostate. By multivariate analysis of these significant variables, we found that only large WC (OR 1.737, 95% CI 1.007-2.997, p Z 0.047) and age can significantly increase the risk of prostatic hyperplasia independently; on the contrary, high PSA (OR 3.339, 95% CI 0.741-15.04, p Z 0.116) or BMI (OR 1.224, 95% CI 0.703-2.131, p Z 0.475) were not independent risk factor (data not shown)."}, {"section_title": "Association between PV and obesity indices", "text": "To avoid possible false interpretation of obesity by WC or BMI value alone, we divided these men into four groups according to WC and BMI status, including normal WC and BMI (BMI 24 kg/m 2 and WC < 90 cm), high WC alone "}, {"section_title": "Discussion", "text": "The numbers of obese individuals are increasing in both developed and developing countries. This finding may be related to an increase in high-calorie diets and less physical activity. Obesity increases the risk of cardiovascular diseases, type 2 diabetes, hypertension, and dyslipidemia and leads to increased mortality. 13 Average medical costs are also significantly higher in obese individuals than in persons of normal weight. 14 However, obesity is often underdiagnosed, as indicated by an average primary diagnosis prevalence of 0.21% in the National Health Insurance Annual Report (Table 1) , whereas the 2005-2008 Nutrition and Health Survey in Taiwan (NAHSIT) showed 29% of men have a WC 90 cm and 51% of men are overweight/obese (BMI > 24 kg/m 2 ). 15 This explains how obesity is rarely taken into primary consideration in clinics or before hospitalization. In our study, there are 270 men (55.6%) with WC 90 cm and 311 men (64%) with BMI > 24 kg/m 2 ( Table 3 ), values that are above the national average. This finding might reflect these observed men have better socioeconomic status to pay for the examinations; resulting in an increased likelihood of developing obesity.\nThe etiology of BPH is multifactorial, and obesity and its related states have long been associated with BPH. 4e7 Studies have shown that men with larger WC tend to have more BPH surgeries and LUTS than men with normal WC. 8, 9 The BLSA study revealed those with large WC have an increased likelihood of BPH (OR Z 1.17, 95% CI 0.77-3.09, p Z 0.17). 7 The Korean study conducted by Lee et al. 16 showed PV was positively correlated with BMI and WC, and WC was an independent risk factor for BPH (OR 3.37, 95% CI 1.08-10.5, p Z 0.037). The Chinese study found that overweight and obese men have increased age-adjusted risk of BPH. 17 However, other studies of non-Asian individuals demonstrated no association between BPH and anthropometry. 18, 19 By age-adjusted logistic regression, our data showed that men with BMI greater than 24 kg/m 2 , WC 90 cm, and PSA greater than 4 ng/mL are associated with a higher risk of developing prostatic hyperplasia (Table 3) . When we examine these factors by multiple logistic regression to adjust the possible interfering effect between factors, only large WC (OR 1.737, 95% CI 1.007-2.997, p Z 0.047) and age can significantly increase the risk of BPH independently; on the contrary, high PSA (OR 3.339, 95% CI 0.741-15.040, p Z 0.116) or BMI (OR 1.224, 95% CI 0.703-2.131, p Z 0.475) were not independent risk factors (data not shown in table). This suggests interactions between WC and PSA or BMI, and emphasizes the role of large WC in prostate growth.\nThere is no consensus about which anthropometric measure(s) should be used to define obesity, including BMI, WC, or the waist-to-hip ratio. 20 To define obesity with only one measure might not always be correct. A tall and fit man may have a WC 90 cm and a normal BMI. A muscular man may have a BMI < 24 kg/m 2 and WC < 90 cm. We cross BMI and WC status to regroup our population, including normal (BMI 24 kg/m 2 and WC < 90 cm, n Z 147, 30.2%), high WC alone (BMI 24 kg/m 2 and WC 90 cm, n Z 28, 5.8%), high BMI alone (BMI > 24 kg/m 2 and WC < 90 cm, n Z 69, 14.2%), and abdominal overweight/obesity (BMI > 24 kg/m 2 and WC 90 cm, n Z 242, 49.8%). Then we repeat the multiple logistic regression analysis using this new obesity index (Table 4 ). It showed only abdominal overweight/obesity (BMI > 24 kg/m 2 and WC 90 cm) is an independent risk factor of prostatic hyperplasia (OR 2.112, 95% CI 1.284-3.474, p Z 0.003), whereas high serum PSA, high BMI alone, or high WC alone are not. This result echoes that of Lee et al. 16 (BMI 25 kg/m 2 and WC > 90 cm, OR of BPH: 4.88, p Z 0.008) but we use more strict cutoff rules on BMI (> 24 kg/m 2 vs. 25 kg/m 2 ) as different national standards were applied. In the study by Lee et al., 16 the central obesity group only has 30 men (20.5%) in the 146-patient cohort and there was no one in the high-WC-alone group. Our result suggests that when discussing the relationship between obesity and prostate hyperplasia, we should not simply use BMI or WC alone to define obesity. Clinically, in men with high WC and high BMI, the risk of developing prostatic hyperplasia is more than twofold in comparison with men with normal WC and BMI. A reduction of WC and BMI to normal levels is encouraged to avoid overgrowth of the prostate gland.\nBy univariate age-adjusted logistic regression, our data showed that men with PSA higher than 4 ng/mL have a fivefold risk of developing BPH (OR 5.507, 95% CI 1.187-21.547, p Z 0.028). Linear regression also confirmed that serum PSA level is positively related with PV (p < 0.001, R 2 Z 0.197, data not shown). However, when we take PSA, BMI, WC, and age together into the multiple logistic regression analysis, the effect of PSA was reduced (OR 3.339, 95% CI 0.741-15.04) and became nonsignificant (p Z 0.116). This finding is similar to a previously published northern Taiwan clinic-based study, which found that PSA is not related to prostate size, 21 and another southern Taiwan screening study in which it was concluded that neither PSA, BMI, nor testosterone was independently correlated with PV. 22 Abdominal obesity was known to be associated with a number of cardiovascular and hormonal responses, 23 including the increase in renal venous pressure as well as increased renin and aldosterone levels. Gat et al. 24 observed that the connection between obesity and prostatic hyperplasia is not only hormonal. 24 They proposed that an increased hydrostatic pressure impairs prostatic and testicular venous return, leading to increased testicular testosterone level and prostate hydrostatic pressure, and together contribute to the development of BPH. Cohen 25 hypothesized with the chronic venous congestion in obese men, the prostate was exposed to elevated testosterone levels and more inflammatory and oxidative stress, which stimulate both stromal and epithelial cellular activity and lead to prostatic hyperplasia. This is the first study to provide the evidence that WC is positively associated with PV in the Taiwanese population. The study participants, who are men undergoing health examinations, might reflect the true population better than other clinic-based studies (which may include more symptomatic patients). A limitation of this study is the absence of testosterone-related data, which are not provided in the health examination package. Thus, we cannot compare the relationship between serum hormone level and the anthropometric measures and PV. Further studies including hormonal analysis are needed to evaluate the previously mentioned mechanisms.\nIn this preliminary study, we find that only age and WC are independent risk factors of BPH in Taiwanese men. Men with WC 90 cm have 1.737-fold risk of prostatic overgrowth. Further analysis showed that men with BMI > 24 kg/m 2 and WC 90 cm have a twofold risk of developing prostatic hyperplasia."}]