[{"section_title": "INTRODUCTION", "text": "Barrier Islands are among the most dynamic and ephemeral features on the planet and are therefore undergoing constant change because of their interaction with waves, currents, and tides. In North America, barrier islands are located along the Eastern and Gulf Coasts and are frequently exposed to tropical storms and hurricanes. Given the dynamic nature of barrier islands, storms frequently impact and dramatically alter these environments. The islands offer protection, often shielding the mainland they border from damaging storm surge and waves (Sallenger, 2008). However, given that such beachfront property is perhaps the most valuable real estate in the United States (Morton and Miller, 2005) these coastal environments are often inhabited and developed. Storms, therefore, are a continued concern for those living at or near the coast. Given the devastating effect of recent hurricanes (Isabel, 2003;Katrina, 2005;Rita, 2005;Ike, 2008), research that aims to understand coastal response to tropical cyclones has become increasingly relevant (Gutierrez, Williams, and Thieler, 2007). Several studies have concluded that the number and intensity of such storms could increase or change as a result of global warming (Emanuel, 2005;Gutierrez, Williams, and Thieler, 2007;Zhang, Douglas, and Leatherman, 2000). Analyzing and quantifying shoreline change and island recovery in the days, months, and years after a storm yields data that may be applied to other coastal areas threatened by tropical cyclones (Morton, 2008;Zhang, Douglas, and Leatherman, 2002). Recent studies of the Chandeleur Islands, offshore Louisiana, illustrate how increased tropical storm activity, combined with low sediment supply and land subsidence, have caused a geomorphological transition from a continuous barrier island to an inner shelf shoal (Fearnley et al., 2009;Kahn, 1986). The loss of these islands has reduced their sheltering effect on the mainland during storms and reduced nesting habitat for sea birds and turtles (Fearnley et al., 2009). Fearnley and others (2009) attributed the recent increase in migration rate and submergence of these islands to a recent rise in the frequency and intensity of tropical cyclones affecting the region. It is imperative to consider the degree to which changing storm frequency has affected barrier shorelines in areas beyond the Gulf coast of Louisiana. The Virginia Barrier Islands offshore of the Delmarva Peninsula have historically been eroding much faster (up to 10 m/y) than the remainder of the Mid-Atlantic coastline (1.5 m/y of erosion; Dolan et al., 1979). In contrast to many rapidly eroding shorelines, the Virginia barriers are relatively undeveloped; thus, these islands provide an environment in which to observe rapid coastal change in a natural barrier island setting with minimal human impact. The data presented in this paper quantify coastal change resulting from the impact of Tropical Storm Ernesto on southern Cedar Island (Figure 1), an undeveloped transgressive barrier island. Additionally, a longer term (155-y) record of shoreline change was compared with National Oceanic and Atmospheric Administration (NOAA) hurricane track data to examine the link between varying shoreline retreat rates on Cedar Island and the occurrence of tropical cyclones in the region."}, {"section_title": "STUDY AREA", "text": "The Virginia Barrier Island system is located offshore of the Delmarva Peninsula (Figure 1). Many of the islands form part of the Virginia Coast Reserve and therefore remain undeveloped (Rice and Leatherman, 1983). The islands are classified as mixed-energy and tide-dominated islands (Oertel, Allen, and Foyle, 2008). The nearest NOAA tide gauge, located in the mainland town of Wachapreague, Virginia, due west of Cedar Island (37836.4 0 N, 75841.1 0 W), records a spring tidal range of 1.4 m and a mean tide range of~1.2 m (NOAA, 2006a). The tides are semidiurnal (Oertel and Kraft, 1994). The mean annual wave height is 0.55 m (Fenster and Dolan, 1996;Oertel, Allen, and Foyle, 2008). Along the Virginia coast, sediment is transported south by longshore transport processes at a volume of 115,000-460,000 m 3 /y (Oertel and Kraft, 1994). A natural spit located at the southern end of Assateague Island is estimated to trap about 300,000 m 3 /y of sediment (Oertel and Kraft, 1994). As a result, a concave erosional arc developed before 1852 just south of Assateague Island that extends from Wallops Island to the southern end of Cedar Island (Rice and Leatherman, 1983). The presence of this arc indicates that this shoreline is sediment deprived, and the high erosion rates measured along the Virginia coastline confirm this (Dolan et al., 1979;Rice and Leatherman, 1993). Cedar Island (Figure 1) is bounded to the north by Metompkin Inlet and to the south by Wachapreague Inlet and is 12.3 km long. The northern two-thirds of the island has well-developed salt marsh behind it, whereas the southern onethird of the island is backed strictly by lagoon (Gaunt, 1991). An ephemeral inlet located about 3.5 km north of Wachapreague Inlet frequently opens and closes just south of the marshbacked portion of the island. The opening and closing of this inlet is often influenced by storms and occurs on short (yearly to decadal) timescales (Newman and Munsart, 1968). Few houses have been constructed on Cedar Island, but many are currently located in the swash zone or have been destroyed, often during storms. Wooden pilings from former houses stand offshore of the island. In addition to the pilings, marsh peat, which accumulates behind the island, can be found in numerous locations on the beach in front of the island (Wright and Trembanis, 2003). Cedar Island, therefore, is categorized as a transgressive barrier island. The area is affected by tropical cyclones (tropical storms, hurricanes) and extratropical cyclones (nor'easters), all of which can contribute to coastal erosion (Davis and Fox, 1978;Gaunt, 1991). Much of Cedar Island is less than 3 m above sea level, and dunes are rare (Gaunt, 1991); thus, the island is categorized by low relief (Newman and Munsart, 1968). As a result, the island is frequently overtopped by storms and displays extensive washover features, such as low fan deposits (Gaunt, 1991;Newman and Munsart, 1968)."}, {"section_title": "BACKGROUND", "text": "Since 2003, two tropical cyclones have strongly affected the Virginia Eastern Shore area. Hurricane Isabel (formed September 6, dissipated September 20), the strongest hurricane of the 2003 season, made landfall in North Carolina as a category 2 hurricane with winds of 169 km/h on September 18, 2003(Horvis et al., 2004. Waves and storm surge that resulted from Isabel affected both the Chesapeake Bay and Delmarva Peninsula (Brasseur et al., 2005). Water levels recorded near Cedar Island at the Wachapreague, Virginia, tide station were 2.5 m (relative to mean lower low water, MLLW), about 1.25 m above the predicted tidal range (NOAA, 2006a). Three years later, Tropical Storm Ernesto made initial landfall with maximum sustained winds of 75 km/h in the Florida Keys on August 29, 2006. It then traveled over southwestern Florida before heading out over the Atlantic Figure 1. Cedar Island, part of the greater Virginia Barrier Islands. The southern portion of the Cedar Island shoreline (Tropical Storm Ernesto study area) is outlined by a while box on the aerial image (right). The DSAS baseline is also shown on the aerial image, but is truncated. It roughly parallels the mainland shoreline and extends south (off the image) to include the entire island. Ocean, where it strengthened. A secondary landfall as a tropical storm occurred in North Carolina on September 1, 2006, with maximum sustained winds of 115 km/h (NOAA, 2006b). The storm then headed north through North Carolina and Virginia, passing over the Chesapeake Bay. Water levels of 2.25 m (relative to MLLW) were recorded at the Wachapreague tide station before the station was damaged and stopped recording ( Figure 2). This storm surge was about 1 m higher than the predicted tide level. Ernesto did briefly reach category 1 hurricane strength in the Caribbean Sea but quickly weakened to tropical storm strength. Ernesto is therefore referred to as a tropical storm in this paper, given that the two landfalls in the United States were at tropical storm strength. In addition to Tropical Storm Ernesto, two subsequent storms were identified during the July 2006 to June 2007 study period using the Wachapreague tide gauge data. Between October 6-8, 2006, andNovember 22-24, 2006, the records show that water levels reached 1.5 m and 1.25 m above the predicted tide, respectively. Both storms occurred after our post-Ernesto survey in September 2006 but before the February 2007 survey. Between the February 2007 survey and the June 2007 survey, the tide records contained no water level anomalies of similar magnitude, indicating a period of relative quiescence. "}, {"section_title": "METHODS", "text": ""}, {"section_title": "Global Positioning System Shoreline Surveys", "text": ""}, {"section_title": "IKONOS Satellite Imagery", "text": "IKONOS satellite imagery served as an additional pre-Ernesto dataset. The imagery, with a horizontal image resolution of 1 m, was gathered on July 2, 2006, and fully covered Cedar Island. The global-averaged accuracy for IKONOS imagery is 11 m. This error, however, is estimated to be lower in areas of little relief. Given the low relief of Cedar Island, the imagery was not georectified. The shoreline was digitized from this imagery by using the HWL as a reference. The HWL is defined as ''the landward extent of the last high tide'' and is recognized by a color change along the shoreline in aerial and satellite imagery (Crowell, Leatherman, and Buckley, 1991). It is the most visible indicator of shoreline position in the aerial photos and was chosen for consistency for the different survey types (aerial photos, satellite imagery, GPS shoreline surveys)."}, {"section_title": "Aerial Photos", "text": "An aerial orthophoto set collected in February 2007 for the State of Virginia was used to delineate the post-Ernesto recovery shoreline 5 months after Tropical Storm Ernesto. The HWL was used as a reference point. The aerial imagery Figure 2. Predicted, observed, and residual tides before, during, and after the passage of Tropical Storm Ernesto at the NOAA-operated tide station located in Wachapreague, Virginia (Station ID 8631044). The sudden decrease in tide level occurs just before tide gauge failure, presumably as a result of the storm. has a horizontal image resolution of 0.3 m and a reported accuracy of 2.1 m (Blankenship, personal communication)."}, {"section_title": "Data Compilation", "text": "Digitization and compilation of the data were done with the GIS software ArcViewe (Esri). The GPS survey lines were imported directly into ArcView as shapefiles. The aerial and satellite images were imported directly into ArcView. Shorelines were identified by using the HWL and digitized data as shapefiles. A summary of all shoreline data is provided in Table  1; these data and the accompanying uncertainties are presented more thoroughly in Nebel, Trembanis, and Barber (2012)."}, {"section_title": "Digital Shoreline Analysis System", "text": "Cedar Island shoreline data were evaluated using the Digital Shoreline Analysis System (DSAS; Thieler et al., 2005). DSAS is a freely available extension that runs in ArcView and calculates rate of change statistics from shoreline data. Users of DSAS must define a baseline, generally drawn parallel to the studied shorelines, against which shoreline change will be measured. Transects are then cast by DSAS perpendicular to the baseline at evenly spaced intervals defined by the user. These transects intersect the shoreline shapefiles, and shoreline change statistics are calculated from these intersections. For the Tropical Storm Ernesto analysis, the baseline was situated on the modern day mainland shoreline. A transect spacing of 25 m was used, which yielded 104 data points in the study area. The data output by DSAS were used to determine amount of shoreline movement that occurred before and after Tropical Storm Ernesto. By convention, on graphs and in tables, shoreline erosion and accretion is indicated by negative and positive values, respectively."}, {"section_title": "Storms", "text": ""}, {"section_title": "Tropical Storm Ernesto", "text": "The statistics output by DSAS were used to assess the effect that Tropical Storm Ernesto had on southern Cedar Island. As a first step, to assess how the shoreline mapped on the ground by GPS compared with a shoreline traced from satellite imagery, we compared the July 2, 2006, shoreline derived from satellite imagery to the July 24, 2006, shoreline determined by GPS. This analysis assumes no appreciable changes in the shoreline positions between the July 2, 2006, and July 24, 2006, surveys-a reasonable assumption given the fair weather conditions over the short time interval. To assess the shoreline change that resulted from Tropical Storm Ernesto, the September 17, 2006, data were subtracted from both the July 24, 2006, and July 2, 2006, shorelines. Initial storm recovery was calculated by subtracting the February 28, 2007, shoreline data from the September 17, 2006, shoreline data. The longer term beach recovery during the 9 months after the storm was determined by subtracting the July 28, 2007, shoreline data from the September 17, 2006, shoreline data. Finally, the June 20, 2007, shoreline data were subtracted from the July 24, 2006, data to determine whether the shoreline had recovered completely to its pre-Ernesto position."}, {"section_title": "Regional Tropical Cyclone Frequency and Barrier Island Retreat", "text": "We compared the regional occurrence of tropical cyclones with historical (1852-2006) retreat rates observed for Cedar Island, Virginia, to determine the degree to which these storms influenced the measured island retreat rates. For the purpose of identifying tropical cyclones that might have affected the study area, a region of interest (ROI) 400 km wide was drawn around the barrier islands located offshore of the Delmarva Peninsula ( Figure 3). This region was extended south about 60 km past the Virginia-North Carolina border to include tropical storms and hurricanes that made landfall farther to the south, such as Hurricane Isabel in 2003. It was extended north to include the southern end of Assateague Island. This region was extended 200 km east and 200 km west of the Virginia barrier  islands because the water level produced by a storm is highest about 90-130 km to the right of the storm path in the northern hemisphere (Redfield and Miller, 1957). Additionally, measurable surge of a meter can occur hundreds of kilometers away from the storm path (Zhang, Douglas, and Leatherman, 2000). Wang et al. (2006) observed that coastal areas 300 km away from the center of Hurricane Ivan were affected by the storm. For the purpose of this analysis, a tropical cyclone is defined as a tropical depression, tropical storm, or hurricane that is included in the NOAA historical Atlantic Hurricane archive (NWS-National Hurricane Center). The data from the 19th century to the mid-20th century relied on weather station data and ship reports. As a result, the historical Atlantic hurricane archive does not document every tropical cyclone in the Atlantic, particularly before the advent of modern meteorological equipment. The historical Atlantic Hurricane Tracks beginning in 1882 were imported in Google Earth. If any tropical depression, tropical storm, or hurricane fell within the defined region of interest ( Figure 3), it was recorded as having occurred in the area, regardless of its potential effects; the strength of the storm based on wind speed was noted but was not part of the quantitative analysis. The tracklines of both Hurricane Isabel (2003) and Tropical Storm Ernesto (2006), storms known to have affected Cedar Island and the surrounding region, fell within the prescribed ROI. We opted to use this storm trackline approach, rather than using tide gauge data to identify storm surges because the nearest NOAA gauge in Wachapreague, Virginia, only began recording hourly and 6-minute data in 1996. The ROI approach allowed us to compare storms with island responses over the entire length of our historical Cedar Island shoreline dataset spanning the time period AD 1852-2006. A storm frequency index of tropical cyclone occurrence within the ROI was defined as where n is the number of storms, and y is the number of years elapsed. The result is a value given in storms per year. We then compared storm frequency index values for given time periods to end point retreat rates calculated for the same periods along the entire length of Cedar Island (Nebel, Trembanis, and Barber, 2012). To calculate rough error bars for our storminess estimates, 0.1 storms/y (or 1 storm per 10-y period) were added to or subtracted from the numerator of the storm frequency index equation. This calculation yielded an upper value and a lower value, which we used as the uncertainty for the storm frequency index value. This error estimate attempts to account for storms tracks that affected the study area but did not fall in the defined ROI or, conversely, storms passing within the defined ROI that did not affect the area. Despite their potential importance, our analysis did not include extratropical cyclones or nor'easters (Dolan and Davis, 1992). To our knowledge, no long-term storm trackline database for nor'easters comparable to the NOAA historical hurricane archive has been published, despite abundant research on North Atlantic extratropical cyclone activity (Bender, Ramanathan, Tselioudis, 2011;Berry, Jakob, and Reeder, 2011;Teng, Washington, and Meehl, 2008). Unfortunately, because of the larger size, lower wind velocities, and more variable duration of nor'easters relative to hurricanes (Dolan and Davis, 1992), the creation of a nor'easter storm track database was beyond the scope of our study."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Effect of Tropical Storm Ernesto on Southern Cedar Island", "text": "Four data points were left out of the initial analysis because they intersected the September 17, 2006, dataset at an area of mapped overwash. The area of overwash is located significantly landward of the actual shoreline, and the data were therefore removed from the final analysis because they did not represent a true measure of the shoreline. The comparison of the shoreline walked with the GPS (July 24, 2006, referred to as the GPS prestorm shoreline) and the shoreline derived from the IKONOS satellite data (July 2, 2006, referred to as the IKONOS prestorm shoreline) yielded some interesting findings (Figure 4). The greatest discrepancy in these two shorelines occurred at the northern end of south Cedar Island. This area lies just south of the ephemeral inlet (Figure 4). Inlet dynamics, therefore, could be influencing the shoreline that lies to the south. The analysis suggests that the areas closest to the ephemeral inlet accreted sediment between July 2, 2006 and July 24, 2006. However, given the large variability in the IKONOS and GPS measured shoreline at the north end of the study area, transects 369-381 were removed The second, gathered on July 24, 2006, was taken on foot using a high-resolution GPS. A large difference between these two datasets was observed at the northern end of the study area. Measurements that fell within this area were removed from later analyses. The later shoreline (July 24, 2006) was subtracted from the earlier shoreline (July 2, 2006). from the remainder of the analyses. The average (arithmetic mean) difference between the GPS shoreline and the IKONOS shoreline was À0.3 m (erosion). The standard deviation was 2.93 m. The post-Ernesto GPS shoreline acquired on September 17, 2006, was subtracted from both the IKONOS and GPS prestorm shorelines, yielding similar plots ( Figure 5). The average (arithmetic mean), maximum, and minimum recorded erosion for both datasets are presented in Table 2. These two datasets were compared with the F-test, which indicated that these two datasets were statistically similar. Given this information, the remainder of the shoreline data was compared with the prestorm GPS (July 24, 2006) shoreline because the GPS provided better root mean square accuracy (20 cm). The recovery of south Cedar Island after Tropical Storm Ernesto was documented by using an aerial photoset (February 28, 2007) and a GPS survey (June 28, 2007). This study area, for the most part, underwent accretion after the storm ( Figure  6). Erosion was noted in the north-central section of the island in both the February 2007 and the June 2007 datasets. The average erosion, maximum erosion, and maximum accretion values for both the February 2007 and June 2007 datasets are presented in Table 2.  24,2006). The gap to the left of the chart represents the data removed from the IKONOS and pre-Ernesto GPS analysis. The data gap at the center of the graph represents the area of mapped overwash in the post-Ernesto data that was removed from the analysis because it did not represent the true shoreline.  Data from Tropical Storm Ernesto were analyzed to determine how recovery 9 months after the storm on June 28, 2007, compared with the prestorm shoreline recorded on July 24, 2006. These data are presented in Table 2. The northern section of the study area was categorized strictly by erosion, whereas the southern part of the island accreted and eroded. The section directly adjacent to Wachapreague Inlet, however, was dominated by erosion ( Figure 7). The north end of the study area behaved differently from the south end in the months after the storm.  17, 2006, andFebruary 28, 2007, gaining an average 10.5 m of shoreline. Between February 28, 2007, andJuly 28, 2007, this section of shoreline accreted an additional 16.5 m of shoreline. Figure 8 reveals that, for the most part, portions of the island that retreated the most just after the storm accreted the most in the months after the storm (List, Farris, and Sullivan, 2006). These areas are considered to be storm hotspots."}, {"section_title": "End Point Retreat Rates for Individual Time Intervals", "text": "The end point retreat rates for the individual time intervals are presented in Table 3, reproduced from Nebel, Trembanis, and Barber (2012). Between the time periods 1980-1994, 1994-2002, and 2002-2006, the island retreat rate accelerates significantly."}, {"section_title": "Tropical Storm, Hurricane Frequency, and Barrier Island Retreat", "text": "Tropical depressions, tropical storms, and category 1-3 hurricanes all fell within the ROI between 1852 and 2006. No Figure 7. Comparison of the shoreline walked with the GPS on June 28, 2007, with the shoreline walked less than a year before on July 24, 2006. The majority of the study area had not recovered to the prestorm shoreline 9 mo after the storm. The arithmetic mean of this dataset is À18.7 m. The gap to the left of the chart represents the data removed from the IKONOS and pre-Ernesto GPS analysis. The data gap at the center of the graph represents the area of mapped overwash in the post-Ernesto data that was removed from the analysis because it did not represent the true shoreline. The later shoreline (June 28, 2007) was subtracted from the earlier shoreline (July 24, 2006). Figure 8. Shoreline retreat resulting from Ernesto (gray dashed line) and shoreline repair during the months after the storm (black line). Note that where shoreline erosion is greatest, recovery in the months after the storm is also greatest. These erosional hotspots are shaded gray. The gap to the left of the chart represents the data removed from the IKONOS and pre-Ernesto GPS analysis. The data gap at the center of the graph represents the area of mapped overwash in the post-Ernesto data that was removed from the analysis because it did not represent the true shoreline.  Table 3, show a similar trend. Increased average retreat rates correspond to periods of higher storm frequency. The best fit of the storm frequency and retreat rate data was observed when tropical depressions were excluded from the analysis (Figure 9). A cross-plot of storminess values and retreat rate values shows a strong correlation with an R 2 value of 0.97 and a p value of 0.0017 ( Figure 10)."}, {"section_title": "DISCUSSION", "text": ""}, {"section_title": "Erosional Hotspots Resulting from Tropical Storm Ernesto", "text": "The Cedar Island shoreline data documenting the effects of Tropical Storm Ernesto reveal the presence of erosional hotspots where the shoreline erodes or accretes at a higher rate than the surrounding area (Browder and McNinch, 2006). Five storm hotspots were clearly observed in the study area when the post-Ernesto data were plotted with the 5-month recovery dataset (Figure 8). The areas identified as hotspots along south Cedar Island underwent significant erosion as a result of Ernesto. In the months after the storm, these same areas accreted sediment. While hotspots can persist in the same area over many storms, they can vary alongshore (List, Farris, and Sullivan, 2006). Shoreline erosion has been linked to the nature of sediments found just offshore (Browder and McNinch, 2006). McNinch (2004) profiled large, stable shore oblique bar features that persist through energetic wave conditions offshore of North Carolina and Virginia. The location of the shore oblique bars correlated with erosional hotspots found onshore (McNinch, 2004). The features and sediments located offshore of Cedar Island have not been well documented. Davis and Fox (1978) indicated that the Cedar Island shoreface was absent of offshore bars, but this finding might be due to a lack of marine geophysical data in the area. The NOAA National Geophysical Data Center (NGDC) website, which displays offshore geo- Figure 9. Average shoreline retreat rate for the time periods 1852-1909, 1910-1961, 1962-1979, 1980-1993, 1995-2001, and 2002-2006 calculated for the whole length of Cedar Island (black line). The shoreline data are compared regional storm frequency (gray dashed line). Each square/triangle on the plot represents one time period (from left to right: 1852-1909, 1910-1961, 1962-1979, 1980-1993, 1995-2001, and 2002-2006) "}, {"section_title": "Ephemeral Inlet Dynamics", "text": "The most distinctive area of erosion identified in the post-Ernesto shoreline data was located about 400 m to the south of the ephemeral inlet where the shoreline retreated between 40 and 56 m ( Figure 5). This finding indicates that inlet dynamics, in addition to the erosion that resulted from Ernesto, could be influencing the northern end of the study area. The ephemeral inlet closed between September 2006 and February 2007, at which time the southerly longshore current would have been restored. The February 2007 data confirms that recovery of 13 to 30 m did occur 400-900 m south of the (closed) ephemeral inlet ( Figure 6). The June 2007 shoreline, however, shows additional erosion of 8-13 m in this same area ( Figure 6). The closing of the ephemeral inlet should have restored southerly sediment transport, and we therefore would expect shoreline accretion between February 2007 and June 2007, which was not observed. Significant shoreline erosion is further observed 900-1100 m downdrift of the ephemeral inlet. Between July and September 2006, 15-29 m of erosion was observed ( Figure  5) along this stretch of Cedar Island that occurred as a result of Tropical Storm Ernesto. This pattern of erosion continued between September 2006 and February 2007, when this section of shoreline eroded an additional 4-19 m ( Figure 6). Significant additional erosion of 3-18 m occurred along this stretch of shoreline between February and June 2007 ( Figure 6). If the ephemeral inlet had been significantly influencing the northern end of the study area, we would expect the closing of the inlet to stimulate accretion downdrift of the inlet. We observe erosion after inlet closure, which indicates that the inlet is not a significant influence on the downdrift shoreline, possibly because the inlet was in the process of closing in July and September 2006."}, {"section_title": "Shoreline Change Resulting from Tropical Storm Ernesto, South Cedar Island, Virginia", "text": "Storms are capable of producing high rates of shoreline change. The average shoreline retreat on southern Cedar Island resulting from Tropical Storm Ernesto, which impacted the Virginia coast for less than a day, was about 25 m, with maximum erosion of 56 m. The data further show that the entire shoreline in the study area receded as a result of Ernesto ( Figure 5). The highest erosion of about 55 m was recorded at the northern end of the study area. The second highest area of erosion was observed at the southern end of Cedar Island near Wachapreague Inlet. We have no shoreline data from Cedar Island that spans a nor'easter; however, these types of storms are also known to cause significant shoreline erosion. List, Farris, and Sullivan (2006) studied the shoreline retreat rates from eight nor'easter storms that affected the Outer Banks and seven storms that affected Cape Cod. The average amount of erosion resulting from these storms was between À2.0 and À10.2 m. In comparison, the average retreat rate on southern Cedar Island after Tropical Storm Ernesto was about À25 m, a rate more than two times greater that that reported for the Outer Banks and Cape Cod studies. The March 1962 Ash Wednesday Storm, a severe nor'easter that occurred over five tidal cycles and coincided with the perigean spring high tide caused 80-100 m of shoreline retreat along the Delaware coast Leatherman, 2001, 2002). By comparison, however, Tropical Storm Ernesto affected the Virginia coastline for less than a day and 10-56 m of shoreline erosion was observed. We consider the relative coastal impacts of nor'easters and tropical cyclones in more detail in the discussion of the long-term record, below."}, {"section_title": "Shoreline Recovery on South Cedar Island", "text": "The recovery on south Cedar Island 5 and 8 months (February 2007 andJune 2007, respectively) after Tropical Storm Ernesto was captured in the shoreline data ( Figure 6). These data indicate that Cedar Island accreted sediment in the northern and southern part of the study area. The center of south Cedar Island, however, continued to erode after Tropical Storm Ernesto. The area just adjacent to Wachapreague Inlet was also characterized by erosion. When the 5-and 8-month recovery estimates were compared, some interesting trends were observed (Figure 6). At the northern end of the study area, the shoreline lost sediment between February 2007 and July 2007. At the southern end of the study area, the shoreline accreted sediment between February 2007 and July 2007. The June 2007 dataset was compared with the July 2006 dataset to determine whether south Cedar Island had recovered to the prestorm shoreline ( Figure 7). With the exception of the southern end of Cedar Island, the shoreline had not recovered to its prestorm state as of June 2007. Whereas List, Farris, and Sullivan (2006) stated that coastal accretion begins after a storm passes, sometimes in as little as a few tidal cycles, full shoreline recovery often requires much more time. Zhang, Douglas, and Leatherman (2002) observed that shoreline recovery after the Ash Wednesday nor'easter in 1962 took more than a decade. Morton, Paine, and Gibeaut (1994) studied the Galveston, Texas, coast and found that a recovery time of 4-5 years was necessary. Shorelines prone to frequent storms do not always fully recover between storms and will therefore erode over time. Morton et al. (1995, p. 178) concluded that storms affect shorelines if ''storm frequency exceeds beach recovery period for individual storms.'' Southern Cedar Island is low profile and has a poorly developed dune system, as was evident during the field surveys in 2006. The one dune that was observed during the September 2006 survey was scarped. South Cedar, therefore, is easily overtopped by storm surge and therefore is more prone to erosion during storm events. It has been shown that barrier island erosion response to storms will depend on the height of the dunes compared with the height of the storm surge (Houser, Hapke, and Hamilton, 2008;Morton, 2002;Sallenger, 2000;Thieler and Young, 1991). An absence of dunes leads to greater shoreline retreat during storms. If dunes are present on a barrier island, overwash processes tend not to dominate (Houser, Hapke, and Hamilton, 2008)."}, {"section_title": "Tropical Cyclone Frequency and Barrier Island Erosion in Virginia", "text": "The frequency of tropical cyclones affecting the Eastern Shore was quantified in this study to determine whether links could be made to shoreline change. Tropical cyclone frequency decreased between 1852and 1962but increased between 1962. This increase between 1962 and 2006 corresponds to acceleration in shoreline retreat rates on Cedar Island (Nebel, Trembanis, and Barber, 2012). On the basis of this finding, we hypothesize that the frequency of tropical cyclones in our study region is directly related to the rate of barrier island erosion on the Eastern Shore. In addition to storm frequency, we wanted to account for tropical cyclone duration and intensity. We therefore used the Accumulated Cyclone Energy (ACE), a measurement used by NOAA that incorporates quantity, duration, and intensity of tropical cyclones in a given year into a single measurement. The ACE data for the Atlantic Ocean Basin is available online for the years 1851-2010 (Landsea, 2011). These data were averaged for each time period to correspond with our shoreline retreat rates and storm frequency measurements (Figure 9). The North Atlantic ACE values show a notable increase between 1980 and 2006 ( Figure 11), further indicating that, overall, the potential effect of tropical cyclones has risen during this interval as a result of some combination of increased frequency, duration, and intensity of these storms. Riggs and Ames (2007) found a similar link between tropical storm frequency and shoreline change on the Outer Banks of North Carolina. Between 1960, tropical storm and hurricane activity in North Carolina increased. Specifically, between 1940and 1962, hurricane frequency affecting North Carolina was high. A decrease in storm activity was noted in the 1960s and 1970s. The 1980s and 1990s were marked by a period of increased hurricane activity in North Carolina. The ''most active'' period of storms in North Carolina was recorded between 1991 and 2005. A similar trend has been noted that links shoreline erosion and accretion to winter nor'easter storm frequency (Fenster and Dolan, 1993). Between 1943 and the mid-1970s, the winter storm season length increased in the mid-Atlantic region. North Carolina shorelines eroded during this time period. Between 1973 and 1977, however, as the North Atlantic Oscillation (NAO) index switched to more positive values in the late 1970s (Bojariu and Gimeno, 2003;Hurrell, Kushnir, and Visbeck, 2001;Jones, Jónsson, and Wheeler., 1997), the intensity and duration of the winter nor'easter season decreased because of a northward shift in the tracks of extratropical cyclones (Marshall et al., 2001;Thompson, Wallace, and Hegerl, 2000), and North Carolina shorelines accreted during this time period (Fenster and Dolan, 1993)."}, {"section_title": "CONCLUSIONS", "text": "Cedar Island, Virginia, is a transgressive barrier island located offshore of the Delmarva Peninsula. Shoreline data from Cedar Island, derived from National Ocean Service Tsheets, aerial photography, satellite imagery, and GPS surveys, were analyzed using the digital shoreline analysis system. These shoreline data indicate that the erosion of the Cedar Island shoreline is driven by storms over long (decades) and short (months to a year) timescales. Storms, although short in duration, drastically alter shoreline position. On southern Cedar Island, shoreline position moved landward by several tens of meters as a result of Tropical Storm Ernesto (2006). At the end of our survey period in 2006, the shoreline had not recovered to its pre-storm position. GPS shoreline surveys on south Cedar Island in July 2006, September 2006, and June 2007 captured the effect of Tropical Storm Ernesto, which made landfall as a tropical storm in North Carolina on September 1, 2006. The shoreline data indicated that the southern Cedar Island shoreline retreated an average of 25.7 m as a result of the storm, with maximum erosion of 54.8 m and minimum erosion of 11.4 m. The whole of the south Cedar study area, therefore, eroded as a result of Ernesto. Recovery 5 and 9 months after Ernesto was documented using aerial photos and a GPS survey. The northern and southern end of south Cedar accreted up to 30 m. The central section, however, continued eroding, in places as much as 30 m, in the months after the storm. The comparison of the pre-Ernesto shoreline data taken in July 2006 with the shoreline data taken 9 months after the storm revealed that the shoreline had not recovered to its prestorm location. The southern Cedar shoreline eroded on average 18.3 m between July 2006 and June 2007. Only a small section the southern portion of study recovered to the prestorm position. Figure 11. Average accumulated cyclone energy (ACE) values for the Atlantic Ocean by time period. ACE values by year were downloaded from the Atlantic Oceanographic and Meteorological Laboratory (AOML-NOAA, 2011). The ACE is a measurement that takes into account quantity, duration, and intensity of tropical storms and hurricanes in a given year. The averaged data reveal an increase in the quantity and intensity of tropical storms and hurricanes between 1980 and 2006. This trend of this curve is similar to the data shown in Figure 9. Erosional hotspots are evident in the Tropical Storm Ernesto shoreline retreat datasets from south Cedar Island. The most active shoreline hotspot on southern Cedar Island eroded by about 55 m, whereas the shoreline adjacent to it eroded by about 20 m. In the months after the storm, the erosional hotspots on south Cedar Island accreted the most. On Cedar Island, tropical cyclone frequency and shoreline erosion rates appear to be linked. There was an increase in tropical cyclone frequency affecting the Eastern Shore beginning in 1980. The increase in tropical cyclone frequency, from 0.79 storms/y between 1980 and 1994 to 2.0 storms/y between 2002 and 2006, continued until the end of the study period in 2006. Cedar Island retreat rates accelerated beginning in 1980. Between 1980 and 2006, shoreline retreat rates on Cedar Island increased from 6.5 to 13.8 m/y. The causes of shoreline change on barrier islands and in coastal environments are multifaceted and complex. Data analyzed in this study indicate that tropical cyclone frequency is a major driver of shoreline change on Cedar Island, but storm frequency is not the only factor in shoreline change. Future work in the area hopes to categorize sediment found offshore of Cedar Island to determine whether onshore erosion patterns are affected by offshore sediment sources."}]