[{"section_title": "Abstract", "text": "Abstract: USA beef production is characterized by a diversity of climates, environmental conditions, animal phenotypes, management systems, and a multiplicity of nutritional inputs. The USA beef herd consists of more than 80 breeds of cattle and crosses thereof, and the industry is divided into distinct, but ofttimes overlapping sectors, including seedstock pro duction, cowcalf production, stocker/backgrounding, and feedlot. Exception for male dairy calves, production is predominantly pastoralbased, with young stock spending relatively brief portions of their life in feedlots. The beef industry is very technology driven, utilizing reproductive management strategies, genetic improvement technologies, exogenous growth promoting compounds, vaccines, antibiotics, and feed processing strategies, focusing on im provements in efficiency and cost of production. Young steers and heifers are grainbased diets fed for an average of 5 months, mostly in feedlots of 1,000 head capacity or more, and typically are slaughtered at 15 to 28 months of age to produce tender, wellmarbled beef. Per capita beef consumption is nearly 26 kg annually, over half of which is consumed in the form of ground products. Beef exports, which are increasingly important, consist primarily of high value cuts and variety meats, depending on destination. In recent years, adverse clima tic con ditions (i.e., draught), a shrinking agricultural workforce, emergence of foodborne patho gens, concerns over development of antimicrobial resistance, animal welfare/wellbeing, environ mental impact, consumer perceptions of healthfulness of beef, consumer perceptions of food animal production practices, and alternative uses of traditional feed grains have become increasingly important with respect to their impact on both beef production and demand for beef products. Similarly, changing consumer demographics and globalization of beef markets have dictated changes in the types of products demanded by consumers of USA beef, both domestically and abroad. The industry is highly adaptive, however, and responds quickly to evolving economic signals."}, {"section_title": "INTRODUCTION", "text": "Beef production systems in the United States are characterized by a wide range of climates, environmental conditions, animal phenotypes, management practices, and a multiplicity of nutritional inputs. In contrast to international perceptions, USA production systems are, with the notable exception of male dairy calves, predominantly pastoralbased, with young stock typically spending relatively brief portions of their life in confinement facilities for finishing on highconcentrate diets. Beef production at the cowcalf level is widely distributed, and exists in all 50 states, spanning the range from tropical savannah to Arctic tundra, tem perate plains, and mountain pastures. Vast differences in geographies and climatic conditions necessitate the use of a broad spectrum of animal phenotypes that are suited to these en vironments, encompassing both Bos taurus and Bos indicus breeds and crosses thereof. The feedlot phase of production, which normally is between 100 and 300 days duration, is heavily concentrated within the interior of the continental USA, and relies heavily on cereal grains and grain byproducts pro duced within this area as predominant feed resources, and feedlot cattle most commonly are marketed at ages ranging from 15 to 28 months. Production of beef in the U.S. his torically has been very technology driven, utilizing reproductive management strategies, genetic improvement technologies, exogenous growth promoting com pounds, vac cines, antibiotics, and feed processing strategies, all of which focused on improving efficiency and(or) decreasing cost of beef production. In more recent years, adverse climatic con ditions (i.e., draught), a shrinking agricultural workforce, control of foodborne pathogens, concerns over develop ment of antimicrobial resistance, animal welfare, animal wellbeing, environmental impact of confinement feeding op erations, consumer perceptions of healthfulness of beef, consumer perceptions of food animal production practices, and alternative uses for traditional feed grains have become increasingly important with respect to their impact on both beef production and demand for beef products. Similarly, changing consumer demographics and globalization of beef markets have dictated changes in the types of products de manded from producers of U.S. beef. Beef production systems are thus increasingly dynamic in their nature, and poised to exploit new market opportunities by altering production prac tices to meet changing consumer demands."}, {"section_title": "GEOGRAPHICAL DISTRIBUTION OF U.S. COW-CALF OPERATIONS AND FEEDLOTS", "text": "As of January 31, 2018, total USA inventory of beef cows was estimated at 31.7 million head, with cowcalf operations in all 50 states [1] . The beef cow inventory fluctuates considerably from year to year, as shown in Figure 1 , and can be influenced heavily by market conditions and environmental factors, such as persistent draught conditions. In the USA, about 320 million hectares are used for livestock grazing [2] , which is equivalent to 41% of the total land area of the continental USA. Approxi mately 55% of all beef cows are maintained in the Central region of the continental USA [3] , which is characterized by vast native grasslands and expansive production of row crops such as corn, soybeans, wheat, grain sorghum, and other crops. Roughly 20% of the national herd is in the Western region, commonly utilizing expansive land areas that are federally owned and leased to beef producers by government agencies. The Southeastern region, often typified by smaller production units that rely heavily on improved pastures, also is home to approximately 20% of the national herd. The remaining 5% are interspersed throughout the Northeast, Alaska, and Hawaii. Each of these regions makes use of very different systems of beef production, owing to a divergent range of climates and feed resources in each area. For example, western herds fre quently employ federal lands for grazing in the spring and summer, and cattle then are removed from federal lands and overwintered on privatelyowned pastures and/or fed harvested forages until the beginning of the next grazing cycle. By con trast, operations in the Central region frequently make use of a mixture of native grass pastures, crop residues, harvested forages, and protein concentrates to sustain their cow herds.\nFeedlots, unlike cowcalf operations, are far more concen trated geographically, with over 72% of feedlot production occurring in the 5state area [4] of Nebraska (19.8%), Texas (18.9%), Kansas (17.5%), Iowa (9.0%), and Colorado (7.1%). Concentration of feedlots in this area is largely driven by ac cess to cereal grains and grain byproducts that predominate the diets of finishing cattle. Other important regions for cattle feeding have developed throughout the country in response to availability of lowcost feedstuffs, particularly byproduct feeds. For example, the WashingtonIdaho region is a major site for production and processing of potatoes, fruits, and vege tables as foods for humans. Cattle feeding operations have developed in response to availability of large quantities of pro cessed food residues in this region, and represent an important means for disposal of these byproducts, thereby creating ad ditional value to the food chain."}, {"section_title": "CATTLE BREEDS USED FOR BEEF PRODUCTION IN THE UNITED STATES OF AMERICA", "text": "The USA beef herd is very heterogeneous in nature, consist ing of more than 80 breeds and crosses thereof, and reflecting the diversity of environments in which they are produced. According to the most recent report on breed registrations by the National Pedigreed Livestock Council [5] , member breed associations with the greatest number of registrations were Angus, Hereford, Simmental, Red Angus, Charolais, Gelbvieh, Brangus, Limousin, Beefmaster, Shorthorn, and Brahman. While this list gives some sense of the diversity of cattle types in the U.S., most cattle fed for slaughter actually are crossbreds, with 60% or more having some degree of Angus influence. Dairy breeds, most notably Holsteins, also make up a sub stantial portion of USA feedlot cattle, with as many as 3 to 4 million dairy calves being fed in USA feedlots each year."}, {"section_title": "USA SYSTEM FOR BEEF PRODUCTION", "text": "The USA system of beef production is highly segmented, often resulting in several changes of ownership between the time animals are weaned and slaughtered. Seedstock operations primarily produce bulls that are used to service cows in com mercial cowcalf operations. The primary product of cowcalf operations is weaned calves, which are sold to stocker opera tors, backgrounding lots, or feedlots. Figure 2 illustrates the possible paths that animals may take through the beef pro duction chain before being slaughtered. Calves from cowcalf operations generally follow one of two paths. They can be transferred directly to feedlots at or around the time of wean ing, in which case they are referred to as \"calffeds\" that remain in the feedlot for 240 days or more before being harvested. Calffed may make up 40% or more of the fed cattle popula tion in the USA. The largest share of the calf population, usually 60% or more, is first placed into a backgrounding or stocker operation, or a combination thereof, to be grown for a period of time before fattened on highconcentrate diets. These animals are grown mostly using foragebased diets and then transferred to feedlots when they are a year or more of age, and thus are referred to as \"yearlings\". Stocker (grazing) and backgrounding (drylot) systems rely heavily on forages as the predominant component of the diet, supplementing protein, energy, vitamins, and minerals as needed to optimize cattle performance. A relatively small proportion of backgrounded cattle are grown at modest rates of gain using limitfeeding programs in which they are fed highconcentrate diets, similar to a highenergy finishing diet, but in restricted amounts to prevent premature fattening. Male calves from dairies also constitute an important com ponent of the beef cattle market. These calves are gathered from dairies at an early age (normally about three days) and transferred to specialized rearing operations known as calf ranches. Calves typically are confined to individual stalls to prevent intermingling, as they are highly susceptible to disease at this stage of their lives. Calves are fed a combination of milk replacers, grain, and small amounts of forage until weaning at 40 to 80 days of age, and then transferred to group housing within the same operation. These animals commonly are sold to feedlots when they reach a weight of approximately 150 to 200 kg.\nCull beef and dairy animals also contribute to the beef sup ply, and most commonly are shipped from seedstock, cow calf, or dairy operations directly to abattoirs for harvest. A relatively small and variable proportion is sent to feedlots to be fed highenergy diets for 50 to 100 days before being slaugh tered. The number of cull animals that are fattened in feedlots before being slaughtered varies substantially from year to year, and is largely a function of the relationships between feed costs, beef supply, and beef demand.\nMale cattle in the USA are nearly always fed as steers, and abattoirs apply heavy discounts to intact males or males that display advanced secondary sex characteristics. Castration effectively decreases the occurrence of undesirable social be haviors and meat quality characteristics, such as dark, firm, and dry beef. Muscle from steers also contains less connective tissue than that from bulls, and steers deposit more intra muscular fat (marbling) than bulls. Castration can occur at various times between birth and after entry into feedlots, with the vast majority being castrated before or near the age of weaning. A relatively small proportion is castrated after entry into feedlots, though this practice is heavily discouraged and significant discounts are applied to intact feeder cattle due to high morbidity rates in animals that are castrated at an ad vanced age. In terms of methodology, bull calves are most frequently castrated surgically or by banding.\nHeifers fed in feedlots constitute approximately 28% to 30% of beef supply in the USA [4] . Compared to steers, however, most feedlot heifers are fed intact, and while some are ovari ectomized, it is far more common to feed melengestrol acetate (a synthetic form of progesterone) to inhibit estrus behavior.\nMarket conditions at the time of weaning can greatly im pact the age at which cattle are placed into feedlots. Size of the national herd is cyclical in nature, owing to fluctuations in weather (such as extended draught periods), and fluctuating prices. When overall size of the national beef herd is relatively low, fewer animals are available, creating competition between stocker and backgrounding operations and feedlots for supply of cattle. Relationships between prices of grain and forages also can influence age of entry into feedlots. When costs for pasture and harvested forages are low in comparison to grains, producers have incentive to grow cattle before placing them into feedlots. By contrast, when grain prices are low relative to prices for forages, a greater proportion of eligible animals may enter the feedlot directly.\nWeather also plays a very significant role in the age at which cattle are placed into feedlots. Environmental temperatures and precipitation patterns obviously impact both quantity and quality of forages produced, so it stands to reason that adverse climatic conditions can influence duration of the grazing sea son, and as a result the proportion of cattle that are marketed as calves versus as yearlings. For example, several million cattle normally are grazed on small grain pastures in Texas, Okla homa, and Kansas in the fall and winter each year. In the absence of adequate rainfall, poor forage yield may dictate premature termination of the grazing season, in which case cattle are transferred to feedlots to be fed. The same is true for native grass pastures that are grazed in the spring, summer, and fall. Drought conditions can force producers to market cattle early, as they frequently have limited feed reserves. Re gardless of cause, the system of merchandising cattle is very dynamic, responding quickly to market conditions. Prices paid for slaughter cattle in the U.S. are influenced by age, quality grade, yield grade, and weight. The USA quality grading system takes into account age, as determined by bone ossification patterns, color of lean tissue, and the amount of intramuscular fat (marbling). Increased intramuscular fat de position increases grade, and premiums are paid for cattle that have high intramuscular fat content. Yield grade is a measure of fatness that accounts for increases in fat within the subcu taneous, intermuscular, and peritoneal regions of the carcass. Animals that deposit excesses of fat in these areas generally have poor red meat yield, and prices are discounted accord ingly. Weight of carcasses also is an important determinant of value, as carcasses that are less than 250 kg or more than 430 kg are subject to substantial discounts. Given the high corre lation between intramuscular fat and other fat depots, securing high market value requires that cattle be fed long enough to attain sufficient (but not excessive) body fat, produce carcasses ranging in weight from 250 to 430 kg, and do so at fewer than 30 months of age. Consequently, there are limitations with respect to the ability to shift cattle into different production scenarios. For example, cattle that are heavily influenced by Britishbreed ancestry often are smaller framed, and there fore benefit from extended growing programs that allow for skeletal growth and muscle deposition before fattening, thereby ensuring that they achieve desired market weights at appro priate fatness. Initiating the feedlot phase too early in the life of the animals can predispose them to premature fattening, low carcass weights, or both. This is particularly true for heifers, which comprise a substantial portion of the fed cattle popu lation in the USA. Alternatively, largeframed phenotypes that are typical of breeds from continental Europe can pro duce carcasses with excessive weights if grown for extended periods of time before finishing in feedlots. These animals are wellsuited to the calffed feedlot system in which they are placed into feedlots directly after weaning.\nThe segmented nature of the beef industry in the USA is an important distinction from the vertical integration com monly associated with other meat animal production systems such as pork and poultry. While there is a relative absence of vertical integration in the beef supply chain, there are in creasingly attempts for producers representing the various production segments to align vertically with other segments via supply agreements. The value of, or necessity for, vertical alignment is particularly evident with branded beef programs. For example, marketing of some branded beef products is based on the premise of no antibiotic or steroidal hormone use throughout the lifetime of the animal, requiring that purveyors have control over production methods employed through each phase of production in order to ensure compli ance. This frequently is accomplished using supply agreements that reward producers with premiums for producing animals that meet specifications of the branded beef program."}, {"section_title": "USE OF GROWTH PROMOTING TECHNOLOGIES IN U.S. BEEF PRODUCTION SYSTEMS", "text": "Beef producers in the USA historically have been very techno logy driven. Examples of this include strategic supplementation of foragebased diets to fulfill animal requirements for pro tein, energy, vitamins, or minerals. Several key classes of growth promotants also are used widely, either as feed addi tives or as hormoneimpregnated implants that are inserted beneath the skin of the ears.\nSteroidalbased growth implants have been used in the USA for decades, thus making it possible to regain some of the growthpromoting effects of endogenous hormones that are lost as a result of castration. Implants employ estrogenic (estradiol or zeranol) and androgenic (testosterone or trenbo lone acetate) components, or combinations thereof. Steroidal implants stimulate feed intake and protein deposition, and have dramatic impact on cattle performance and efficiency of feed utilization. Their use is very widespread, encompass ing both growing and finishing phases of production. They are most heavily used in confinement operations, including backgrounding operations and feedlots. Notable exceptions are branded beef programs that disqualify their use, such as natural, organic, or nonhormone treated cattle programs aimed at specific valueadded markets.\nSimilarly, antibiotics have been widely used in USA cattle production systems. Ionophore antibiotics, the most common of which are monensin and lasalocid, are used widely for beef production in the USA, both for control of coccidiosis and for improving feed efficiency. Feed additive forms of tetracy clines and macrolide antibiotics have been used extensively in the United States. Starting in January, 2017, the USA Food and Drug Administration imposed new regulations that pro hibit subtherapeutic feeding of medicallyimportant antibiotics [6] , which includes oxtetracyline, chlortetracycline, and the macrolide antibiotic, tylosin. These drugs now are restricted for use only in the treatment or prevention of disease, and must be prescribed by a veterinarian. Changes in the regula tory status of these compounds has spawned an unprecedented interest in alternative production methods and research aimed at reducing or eliminating antibiotics from food animal pro duction systems, particularly for compounds that are deemed medically important for human health. Essential oils, minerals, prebiotics, and probiotics are among the many product cate gories that are now being evaluated as alternatives to traditional antibiotics for promotion of growth and efficiency.\nBeta adrenergic receptor agonists are used extensively in diets of feedlot cattle to stimulate muscle accretion. Beta ag onists are nonsteroidal, and they stimulate muscle accretion by increasing protein synthesis and decreasing protein cata bolism. The beta adrenergic agonist, ractopamine hydrochloride, was approved for use in cattle starting in 2003. Zilpaterol was approved for use in the USA in 2008, and though more po tent than ractopamine, zilpaterol it is now seldom used due to restrictions imposed by major abattoir companies. Ractopa mine is administered to cattle during the final 28 to 42 days before slaughter, and though the exact number of cattle fed ractopamine is not known, it is used by the vast majority of USA feedlots. A recent survey of feedlot nutritionists [7] re vealed that approximately 85% of feedlots represented in the survey use beta agonists.\nSynthetic progestin (melengestrol acetate) is fed to synchro nize estrus in breeding herds, particularly where artificial insemination is used. It is estimated that fewer than 10% of beef females are bred by artificial insemination, so the greatest use of synthetic progestin is in feedlots, where they are included in the diet to suppress estrus in heifers that are fed in confine ment for slaughter. Feeding progestin aids in minimizing physical injuries attributable to sexual behaviors in which ani mals mount one another, and also improves efficiency of feed utilization. Melengestrol acetate is not approved for use in male bovines."}, {"section_title": "THE FEEDLOT SECTOR", "text": "The most recent census of agriculture [3] reported an estimat ed 26,586 feedlots in the USA. Of these, approximately 61% have fewer than 100 cattle. Approximately 77% of cattle were produced in feedlots with capacity greater than 1,000 animals. These feedlots exist throughout the USA, but by far the heavi est concentration of cattle finishing occurs in the Great Plains region, which is mostly characterized by a semiarid, temperate climate that is wellsuited to cattle production. Approximately two thirds of USA feedlot cattle production is concentrated within the states of Nebraska, Kansas, and Texas. Logically, large abattoirs also are concentrated within this region. Crop production in this geography is heavily dependent on ground water from the underlying Ogallala aquifer, which is used extensively for irrigation of corn, wheat, sorghum, and other crops."}, {"section_title": "FEEDLOT FINISHING DIETS", "text": "Energy content of finishing diets, expressed as net energy for gain (NE g ), typically ranges from 1.50 to 1.54 Mcal/kg. Con sequently, diets of feedlot cattle consist primarily of cereal grains and cereal grain byproducts. Corn is by far the predomi nant cereal grain. Wheat, which mostly is regarded as a human food crop, frequently is used to displace a portion of corn in feedlot diets. Its use typically is restricted to certain times of the year when wheat prices are low in comparison to corn, such as immediately following wheat harvest. Wheat and barley are, however, the predominant grains used by feedlots in the Pa cific Northwest. Sorghum is an important cereal crop produced in the semiarid states of Kansas and Texas, and to a lesser extent Oklahoma, Colorado, South Dakota, and Nebraska. Though regarded as being nutritionally inferior to corn, it too is incorporated into feedlot diets when economic conditions favor its use. Feedlots are opportunistic users of a broad range of by product energy feeds. Cereal grain byproducts have become increasingly important as staples of feedlot cattle diets, parti cularly in the interior of the continental USA where corn and sorghum production prevail. The most important of these is distiller's grain, which is a byproduct of fuel ethanol produc tion from cereal grains. Distiller's grains can be fed either as wet or dried coproducts, the form of which is dictated by proximity of feedlots to ethanol production facilities. Growth of the fuel ethanol industry between 2000 and 2007 repre sented an unprecedented period of change for the USA beef industry, during which traditional feedstuffs (i.e. grains) reached historically high prices while distiller' s grains increased dramatically in abundance. This was cause for major shifts in composition of feedlot diets. Wet corn gluten feed (approxi mately 60% dry matter), which is derived as a byproduct from the production of corn sweeteners and starches, also is widely used in the feedlot sector. Distiller's grains, gluten feed, and other byproducts most commonly comprise between 10% and 40% of the diet dry matter for feedlot cattle. Large differentials in pricing between grain and grain byproducts occasionally dictate much greater rates of inclusion, with concentrations of byproducts reaching 70% or more of diet dry matter in some circumstances. Other byproducts are used as well, including cull potatoes or potato processing wastes (predominantly in the Pacific Northwest), fruit and vegetable byproducts, by products from sugar refining, and coproducts derived from milling of wheat and processing of soybeans. Many of these byproduct feeds also contain intermediate to high concen trations of protein, thus making it possible to displace all or a portion of the oilseed meals (soybean, cottonseed, sunflower, canola, and others) traditionally used to satisfy protein re quirements of cattle. Consequently, dietary protein often is fed in excess, which has potentially important environmen tal implications. Byproduct feeds typically contain more phosphorus than the cereal grains that they replace, further contributing to environmental challenges associated with confined animal feeding operations.\nForages normally constitute a relatively small fraction of feedlot diets, and are used primarily to promote digestive health. Alfalfa hay and corn silage are the most commonly used roughages. Increased reliance on byproduct feeds in re cent years has made it economically feasible to use low protein roughages in feedlot diets, including corn stalks, wheat straw, and other lowvalue crop residues. Forage content of finish ing diets typically is in the range of 6% to 12% [7] ."}, {"section_title": "PRODUCTION AND DISPOSITION OF BEEF", "text": "The objective of USA feedlots is to produce beef from young cattle (<30 months of age) with ample tenderness and with relatively high intramuscular fat content. The USA system of beef quality grading rewards feedlots for production of highly marbled beef, but also discourages overfattening of cattle through classification of carcasses into one of five yield grade categories. Animals that yield carcasses in higher yield grade James S. Drouillard (2018) Asian-Australas J Anim Sci 31:1007-1016 categories (4 or 5) generally incur heavy market penalties. Size of carcasses also is important, and abattoir companies gener ally apply heavy price discounts for undersized (<250 kg) or oversized (>430 kg) carcasses.\nThe beef slaughter industry in the USA is heavily concen trated, with only 4 firms accounting for more than 80% of the beef slaughter capacity. Most of the beef they process is distri buted in boxed form, a significant portion of which is exported to other countries. Domestic beef production in 2017 was 11.98 million metric tonnes, approximately 10.6% (1.26 mil lion tonnes) of which was exported [8] , either as variety meets or as highquality beef products. The largest volume export markets for USA beef in 2017 were Japan (24.3%); Mexico (18.8%); South Korea (14.6%); Hong Kong (10.4%), Canada (9.2%); and Taiwan (3.5%). Exports were roughly offset by imports (1.36 million tonnes), with Canada (24.7%), Australia (23.2%); Mexico (19.2%), and New Zealand (18.6%) making up the vast majority of imported beef (and veal) products.\nPer capita beef consumption of beef in the USA in 2017 was 25.8 kg [9] , and consumption is expected to be slightly higher or stable through 2027 [10] . It is estimated that 57% of the beef consumed is in the form of ground products [11] . Imported products, particularly from Australia, are important in fulfilling the increasing demand for ground beef products."}, {"section_title": "FUTURE TRENDS IN THE BEEF INDUSTRY", "text": "Domestic demand for beef products is expected to remain stable. Consequently, export markets are increasingly recog nized as being an important target for increasing demand for USA beef products. OECD/FAO estimates of 1.5% annual increases in demand for meat products through 2026 [10] are cause for optimism among producers. Though it is projected that most of this demand will be fulfilled by increases in pro duction of poultry products, it is likely that all meat sectors will benefit to some degree.\nThere is a growing trend within the USA for large purveyors of meat products to exert influence on livestock producers, encouraging them to implement production practices that are perceived as being in line with consumer interests. Among the major players are abattoir companies, wholesalers, grocery chains, the hotel and restaurant industries, and others. Topics such as sustainability, animal welfare/wellbeing, environmen tal compatibility, traceability, antimicrobial resistance, use of exogenous growth promotants, natural or organic production systems, and other areas are becoming increasingly common, and have emerged as central elements in marketing campaigns adopted by many major food companies. This evolution in thinking challenges conventional food animal production sys tems, and is forcing rapid change in production practices. As a consequence, the focal points of many research programs across the USA have shifted to encompass these topics.\nUSA beef producers have a long history of adapting quickly to changing market signals in an effort to capture added value. Branded beef programs, which constitute a form of vertical integration or alignment, are relatively commonplace. Perhaps the best known of these is the Certified Angus Beef program, which since its inception in 1978 has arguably transformed the USA beef industry as a result of substantial premiums paid to cattle producers for producing beef that fulfills certain quality standards. In excess of 60% of cattle fed in the USA now have some proportion of Angus ancestry, which is testi mony to the success of the program that is now recognized globally as being consistent with quality. Numerous other pro grams have been spawned in the last 40 years, with the US Department of Agriculture (USDA) Agricultural Marketing Service now listing 90 different federal certification programs for beef, 80 of which were conceived in the year 2000 or later. Scores of other noncertified branding programs have ap peared at the consumer level as well, touting features such as omega3 enrichment of beef; antibiotic free; hormonefree; organic feeding programs; grassfed programs, and others that are distinguished by the region of production, specific pro ducers, or other features. All are aimed at enhancing value by advertising appealing attributes for which consumers are willing to pay price premiums. As branding programs become more prevalent, vertical alignment between various sectors of the beef industry also is increasingly common. A form of symbiosis can develop in which large production units or con sortia of producers align themselves with retail outlets, hotels, or large restaurant companies to ensure ongoing demand or to capture market premiums for their products. In turn, the food companies benefit through supply agreements that guar antee availability or pricing of products that are produced to meet certain standards that can encompass beef quality, meat composition (as in the case of omega3 enrichment), envi ronmental compatibility, sustainability, or production practices that exclude antibiotics and(or) growth promotants, and nu merous other marketable concepts.\nTraceability programs have been a topic of much discus sion for the past two decades. This discussion intensified immediately following events in December of 2003 surround ing importation of a cull dairy cow from Canada that was discovered to have been infected with bovine spongiform encephalopathy. Several key export markets subsequently were closed to USA beef, which had devastating financial conse quences for beef producers and abattoir companies in the USA. Producer organizations are, for the most part, however, opposed to development of a federallymandated traceability system, opting instead for a voluntary system of animal iden tification and traceability that is marketdriven.\nIn January of 2017 the USA Food and Drug administration fully enacted revised regulations aimed at decreasing use of medicallyimportant antibiotics in food animal production systems [6] . Central to the new regulations is the necessity for veterinary oversight of antibiotic use. Drugs that previously were available \"over the counter\" now can be used only with the written prescription of a licensed veterinarian. Since the regulations took effect, pharmaceutical companies that pro duce affected drug compounds have cited sharp declines in demand for their products, meat purveyors and retailers have publicly announced timelines for procurement of products produced without antibiotics, and major beef producers have announced strategies that will be (or have been) implemented to decrease antibiotic use. The \"anti\" antibiotic movement is thus well underway, and it has given birth to an era of research pertaining to identification of antibiotic alternatives for use in livestock. Much of our own research at Kansas State Univer sity is devoted to the task of finding alternative strategies for mitigation of digestive disorders or infectious diseases, but without use of antibiotics. Whether as a result of market pressures or regulatory changes, it seems inevitable that beef production systems of the future are apt to employ production practices that preclude use of antibiotics.\nProbiotics are becoming increasingly prevalent in the beef production chain, but especially feedlot systems. It has been estimated that approximately 60% of feedlot cattle receive some form of probiotic [7] . Often these consist of Lactobacillus spe cies, fed alone or in combination with Propionibacterium. Normalization of gastrointestinal tract function and com petitive inhibition of foodborne pathogens, such as E. coli O157:H7 [12] , are the most commonly cited reasons for their use. More recently, Megasphaera elsdenii, a lactateutilizing bacteria, has been introduced into the market. Reported bene fits include avoidance of ruminal acidosis and the ability to transition more quickly to highconcentrate diets [13] , as well as improved cattle performance and decreased incidence of disease in young cattle after arrival in feedlots [14] . Anecdotal evidence from commercial abattoirs has suggested it may also decrease fecal shedding of foodborne pathogens, but this effect has yet to be validated in a controlled research experiment.\nPlants extracts as feed additives constitutes another active area of inquiry, with the notion that these compounds may be useful as substitutes for conventional antimicrobial drugs as a result of their antimicrobial activities. Several plant ex tracts have been studied in depth, including beta acids of hops [15] , menthol [16] , eugenol [17] , cinnamaldehyde [18] , lim onene [19] , and others, and their impact on gut microflora is in some cases well documented. These compounds often emu late the actions of traditional antibiotic drugs, owing in part to similarities in chemical structure. Similarly, heavy metals, including the trace minerals copper and zinc, have been ex ploited for antibioticlike effects [20] , particularly when used in pigs or poultry, but also in cattle. Zinc is the antimicrobial mineral of choice in cattle due to the relative toxicity of copper, and frequently it is fed at supranutritional concentrations to suppress bacteria that cause footrot (infectious pododerma titis), or to aid in combatting respiratory illness. Numerous studies have revealed that it is possible to coselect for resis tance to antimicrobial drugs when bacteria are exposed to plant extracts [21] or high concentrations of heavy metals [22, 23] , even without exposure to the antimicrobial drugs themselves. Given that the basis for excluding antibiotic drugs from the diets of cattle is to avoid development of antimicro bial resistance in gastrointestinal tract bacteria, it would seem that similar caution is warranted in the application of plant extracts or heavy metals as antimicrobials, in spite of the fact that they are not marketed specifically as antibiotics.\nThe USDA does not maintain official statistics on volumes of antibioticfree, nonhormone treated, or organic beef. In 2012 it was estimated that over 4% of retail foods sold in the U.S. were organically produced [24] . Fruits and vegetable led the market in organic sales, while 3% of meat/poultry/fish were estimated to have been produced organically. According to the Organic Trade Association [25] , sales of organic meat and poultry surged by 17% in 2016, and total sales were expected to exceed $1 billion dollars for the first time in 2017. Certifi cation of organically produced meats is administered by the USDA, which maintains official standards for organic pro duction practices. Currently, availability of sufficient quantities of certified organic feedstuffs constitutes a major limitation for growth of this segment of the beef industry. Several brand ing programs certified by the USDA Agricultural Marketing Service specify beef as being \"antibiotic free\" or \"nonhormone treated\". Some of these restrict their definition to a specified production phase, while others reflect production practices employed throughout the lifetime of the animal. There is a sense that demand for this market segment is increasing, but official estimates are not available. Programs for production of cattle without use of hormones, referred to as nonhormone treated cattle, are key to penetrating certain markets, both domestically and internationally. Cost of production generally is higher for any of the specialty programs compared to con ventional production systems, and producers must therefore be rewarded accordingly with price premiums."}, {"section_title": "CONCLUSION", "text": "USA beef supply is the product of a multisegmented indus try that is consolidating into larger and larger production units, and is increasingly characterized by vertical alignment among industry segments, as well as with food wholesalers and re tailers and the hotel and restaurant industries. The industry makes use of a broad spectrum of nutritional inputs and ani mal phenotypes that span a wide range of geographies and climates. The industry is closely tied to natural grazing re sources, as well as cereal grains and cereal grain byproducts.\nIt is highly adaptive, responding rapidly to market signals that reward innovation and alignment with consumer demands. The industry makes extensive use of a wide range of technol ogies related to feed processing, identity preservations, and growth promotion. Complexity of beef markets is increasing due to extensive branding efforts and development of niche markets, and demand for production of beef representing grassfed, nonhormone, nonantibiotic, and organic beef markets is growing steadily. Maintaining and expanding de mand for USA beef likely will necessitate ongoing efforts to develop markets for export, both for variety meats and for highvalue cuts of beef."}, {"section_title": "CONFLICT OF INTEREST", "text": "We certify that there is no conflict of interest with any financial organization regarding the material discussed in the manu script."}]