[{"section_title": "", "text": "knowledge generated by health research could have limited application. Therefore, it is imperative to understand factors related to diverse populations' research participation, willingness to participate, and opportunities to participate as a first step to developing strategies to facilitate their participation in health research. Prior research has shown that rural residents participate in research at lower rates than their urban counterparts. 5 Key issues that may detrimentally affect rural residents' participation in research include cultural sensitivity, geographic challenges (e.g., distance and isolation), misperceptions of research, and lack of opportunities to participate in research. [6][7][8] Furthermore, prior research suggests that participation in health research is disproportionate across races and ethnicities. While racial/ethnic minorities constitute a third of the US population, most published studies show that they remain largely underrepresented in health research. 9 For African Americans and Pacific Islanders, one consistent issue hampering research participation has been distrust and perceived discrimination, owing to a history of research abuse. [9][10][11] Hispanic community members have also cited discrimination, stigma, fear of immigration authorities, and cultural norms as factors undermining research participation. 12 A lack of cultural awareness from researchers and language barriers can also limit research opportunities by creating communication gaps between researchers and potential research participants. 13,14 While rural and minority populations are often cited as being underrepresented in research, population-based studies on health research participation have not been conducted. Furthermore, we do not fully understand the factors associated with their willingness or unwillingness to participate in research. Prior studies on research participation have focused on one study or one population and have been conducted without inclusion of a representative sample of minorities and rural populations. 15 This makes the extrapolation of findings to the general population particularly challenging. The current study investigated associations between key factors (rural/urban, race/ethnicity, age, education, poverty level, employment status, marital status, access to health care, and health status) and i) health research participation, ii) opportunities to participate in health research, and iii) willingness to participate in health research from a representative sample of adults in Arkansas. Furthermore, the study investigated the independent effects of predictors (sociodemographic characteristics, access to health care, and presence of chronic conditions) on: i) health research participation, ii) opportunities to participate in health research, and iii) willingness to participate in health research. This will be the first study of its kind to examine factors related to participation, opportunity, and willingness to participate in health research from a large representative sample in a rural and diverse state."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Data source", "text": "This study used the 2015 Behavioral Risk Factor Surveillance System (BRFSS) conducted in Arkansas as its data source. The BRFSS is a large, representative, state-based telephone survey that involves a random digit-dialing, multistagecluster sample survey designed to collect information on US noninstitutionalized civilian residents regarding their healthrelated behaviors, chronic health conditions, and use of preventive services. 16 In addition to the core component questions, states have the option to add questions that are asked of the respondents in their state. A fuller description of the BRFSS methodology and design can be found elsewhere. 16 This study received an exemption from the University of Arkansas for Medical Sciences Institutional Review Board (IRB #205852)."}, {"section_title": "Sample", "text": "The analytical sample included 5,256 respondents aged 18 years and older living in Arkansas who completed the 2015 BRFSS. Out of the 5,256 respondents who completed the BRFSS, 517 individuals answered \"Yes\" to the question \"Have you ever participated in any kind of health research study?\" 3,849 answered \"No,\" 75 answered \"Don't know/Unsure,\" and 815 were missing cases. Survey skip logic was structured so that the 517 people who responded \"Yes\" skipped the two questions related to opportunity to participate in health research and willingness to participate in health research if given the opportunity (see Figure 1)."}, {"section_title": "Measures", "text": ""}, {"section_title": "Dependent variables", "text": "Three questions were added to the 2015 BRFSS in Arkansas pertaining to past participation in health research, past opportunity to participate in health research, and willingness to participate in health research if provided the opportunity. These variables were captured by the following questions: i) \"Have you ever participated in any kind of health research study?\"; ii) \"Have you ever had the opportunity to participate in health research?\"; and iii) \"Would you take part in a health research study if you had the opportunity?\" Answer options to these questions were \"Yes,\" \"No,\" \"Don't Know/Not sure,\" and \"Refused.\""}, {"section_title": "Independent variables", "text": "Sociodemographic variables included age, sex, race/ ethnicity, marital status, education, employment status, and federal poverty level (FPL) ( Table 1). The percent of FPL income was computed using respondents' self-reported income and report of people living in the household in conjunction with the 2015 federal guidelines for poverty level. Rurality of respondents was captured by their residence status measured as a binary variable based on respondents' zip code and categories from the Rural Urban Continuum Codes. 17 Respondents answered (\"Yes\"/\"No\") regarding whether they had ever been told they had one or more of the following chronic health conditions: i) high blood pressure; ii) heart attack or myocardial infarction; iii) angina or coronary heart disease; iv) asthma; v) skin cancer; vi) other cancer; vii) chronic obstructive pulmonary disease (COPD), emphysema, or chronic bronchitis; viii) arthritis, rheumatoid arthritis, gout, lupus, or fibromyalgia; ix) depressive disorder, including depression, major depression, dysthymia, or minor depression; x) kidney disease; or xi) diabetes. A binary variable was  16 created to capture if respondents had a chronic disease or not. Perceived general health status was self-rated by respondents who reported whether their general health was excellent, very good, good, fair, or poor. The last two items were combined due to small numbers of responses in each category. Four questions were used to define access to care 18 : i) \"Do you have any kind of healthcare coverage, including health insurance, prepaid plans such as HMOs, government plans such as Medicare, or Indian Health Service?\"; ii) \"Do you have one person you think of as your personal doctor or healthcare provider?\"; iii) \"Was there a time in the past 12 months when you needed to see a doctor but could not because of cost?\";  and iv) \"About how long has it been since you last visited a doctor for a routine checkup?\" Statistical analysis SAS v. 9.4 19 (Cary, NC) was used to conduct statistical analyses. To describe the study population, weighted proportions for each dependent and independent variable were computed using PROC SURVEYFREQ to account for the complex sample design of the BRFSS. For unadjusted associations, each of the sociodemographic, rurality/urbanity, access to health care, perceived general health, and chronic conditions variables were cross-tabulated with each of the three dependent variables. To account for the complex sampling design of the survey, the Rao-Scott Chi-Square test 20 (χ 2 R-S )-a modified version of the chi-square test-was used. Multivariable regression models were fitted to confirm associations between the predictors (i.e., sociodemographic characteristics, rurality/urbanity, access to care, perceived general health, general health status, and chronic conditions) and the three outcomes of interest. PROC SURVEYLOGIS-TIC was used to accommodate the complex survey design in these analyses and estimate adjusted associations. \"Ever participated in health research\" and \"Opportunity to participate in health research\" are dichotomous outcomes, thus a multivariable logistic regression was used. Willingness to participate in health research was measured on a nominal scale (\"Yes\"/\"No\"/\"Undecided\"), thus a multinomial logistic regression 21 was conducted with the response \"No\" as the baseline category."}, {"section_title": "RESULTS", "text": "Weighted percentages are presented in Table 1. Most individuals (90.6%) had never participated in health research. Among those who had not participated, 92.0% had not had the opportunity to participate in health research. Almost half (45.5%) would be willing to participate in health research if given the opportunity; 32.4% stated they would not be willing to participate even if given the opportunity; and 22.1% were undecided. Most respondents (76.0%) were non-Hispanic White; 21.3% were 65 years or older; and 51.4% were females. More than half (57.1%) of respondents were married or in cohabitation. Fifty percent of respondents had some college or more, 51.3% were employed, 20.9% lived below the poverty line, and 42.4% lived in rural areas. Most respondents had health insurance coverage (87.7%) and/or a usual source of care (83.5%), and 15.5% reported there was a time in the past year when they could not see a doctor due to cost. Most respondents (68.8%) had a health check-up in the past year; however, for 11.7% it had been more than 5 years since their last check-up. Among respondents, 67.6% had at least one chronic condition. More specifically, 40.3% had hypertension; 29.7% had arthritis; 23.5% reported being depressed; 16.1% had asthma; 12.9% had diabetes; 9.8% had COPD; 6.6% reported skin cancer and 7.0% some other type of cancer; 5.6% had coronary heart disease; 5.4% sustained a heart attack; 3.8% experienced a stroke; and 3.2% had kidney disease."}, {"section_title": "Unadjusted associations", "text": "As shown in Table 2, no significant associations were found between respondents' areas of residence (rural/urban) and past participation, past opportunity, or willingness to participate in health research. Likewise, we did not find any significant associations between respondents' chronic condition status (\"Yes\"/\"No\") and the three outcomes. Only level of education was found to be associated with past participation in health research (χ 2 R-S (2) = 34.59, P < 0.001). Among respondents who had not completed high school/GED, 96.4% had not participated in health research, and 3.6% had participated. Of those who had at least some college education, 86.7% had not participated in health research, and 13.3% had participated. Past opportunity to participate in health research was assessed among those respondents who had not yet participated in health research. There was not a statistically significant relationship between past opportunity to participate in health research and any of the selected independent variables. Willingness to participate in health research was assessed among those respondents who had not yet participated in health research. Race/ethnicity was not found to be significantly associated with past participation and past opportunity to participate in health research; however, a significant association between race/ethnicity and willingness to participate in health research was seen (χ 2 R-S (6) = 22.53, P = 0.001). Among White respondents, 41.7% reported being willing to take part in health research if given the opportunity. Relative to White respondents, greater proportions of Black and Hispanic respondents who had never participated in research were willing to participate in health research (58.9% and 58.2%, respectively). Significant associations were observed between willingness to participate in health research and poverty level (χ 2 The inability to afford health services and willingness to participate in health research were significantly associated (χ 2 R-S (2) = 7.71, P = 0.02). Those who reported a time in the year when they needed to see a doctor but could not because of cost (55.0%), were more likely to be willing to participate in health research."}, {"section_title": "Adjusted associations", "text": "Regression analyses were conducted to examine whether the unadjusted significant associations continued after adjustment of covariates in the models. Table 3 shows the results of multivariable logistic regression models for \"ever participated in health research\" and \"opportunity to participate in health research.\" As found in unadjusted associations, neither rural residence nor chronic condition status were associated with past participation or past opportunity to participate in health research. In adjusted models, significant associations between level of education and past participation held. Compared with respondents with at least some college education, those whose highest level of education was a high school diploma/GED and those with less than a high school education were less likely to have participated in health research (odds ratio (OR) = 0.41; 95% confidence intervals (CI) = 0.27-0.63; and OR = 0.21; CI = 0.10-0.47, respectively). Compared with respondents who were married/living together, those who were divorced/separated or widowed were less likely to have participated in health research (OR = 0.59; CI = 0.38-0.93; and OR = 0.55; CI = 0.34-0.90, respectively). Relative to employed respondents, respondents who were unable to work were almost twice as likely to have participated in research (OR = 1.98; CI = 1.21-3.23). www.cts-journal.com Table 2 Unadjusted associations between past participation, past opportunity, and willingness to participate and sociodemographic characteristics, access to care, and health status   Data Source: Behavioral Risk Factor Surveillance System, 2015. 16 \"-\" Denotes reference category. a Odds ratios are population estimates of selected predictors after sampling design (weights, strata, and stratification) has been accounted for, and are based on imputation with M = 20 imputed data sets. * P < 0.05; ** P < 0.01; *** P < 0.001."}, {"section_title": "Variables", "text": ""}, {"section_title": "www.cts-journal.com", "text": "With respect to opportunity to participate in health research, we found that respondents aged 25-34 and 35-44 were less likely to have had an opportunity relative to respondents aged 65 years or older (OR = 0.18; CI = 0.08-0.50; and OR = 0.46; CI = 0.23-0.95, respectively). Compared with White respondents, Blacks were twice as likely to have had the opportunity to participate (OR = 2.02; CI = 1.16-3.52). Compared with respondents with at least some college education, those whose highest level of education was a high school diploma/GED were less likely to have had the opportunity to participate (OR = 0.55; CI = 0.34-0.89). Relative to respondents without health insurance coverage, respondents with health insurance coverage were less likely to have had the opportunity to participate (OR = 0.37; CI = 0.17-0.82). Table 4 shows the results of the multinomial logistic regression model for willingness to participate in health research. When compared with respondents 65 or older, all age groups (15-64 years) were more likely to respond \"Yes\" than \"No\" when asked if they would participate in health research. Compared with White respondents, non-Hispanic Blacks were more likely to respond \"Yes\" than \"No\" (OR = 1.74; CI = 1.14-2.67). Compared with married/living together respondents, divorced/separated respondents were more likely to respond \"Yes\" than \"No\" (OR = 1.62; CI = 1.10-2.38). Compared with respondents with at least some college education, those who had not completed a high school diploma/GED were less likely to respond either \"Yes\" or  Data Source: Behavioral Risk Factor Surveillance System, 2015. (16) \"-\" Denotes reference category. a Odds ratios are population estimates of selected predictors after sampling design (weights, strata, and stratification) has been accounted for, and are based on imputation with M = 20 imputed data sets. * P < 0.05; ** P < 0.01; *** P < 0.001. \"Undecided\" than \"No\" (OR = 0.51; CI = 0.33-0.80; OR = 0.51; CI = 0.30-0.86). Similarly, relative to respondents with at least some college education, those who had not completed a high school degree/GED and those with a high school diploma/GED were less likely to respond either \"Yes\" or \"Undecided\" than \"No.\""}, {"section_title": "DISCUSSION", "text": "This article used three questions added to the Arkansas BRFSS to examine the relationship between key demographic and health status factors and health research participation, opportunities to participate in health research, and willingness to participate in health research. This is the first study to examine factors related to research participation, opportunity, and willingness in a large representative sample in a relatively rural and diverse state. Therefore, it makes a significant contribution to the current literature on research participation. While only 8.5% of rural respondents had participated in health research, there was not a significant difference in participation rates, willingness to participate, or opportunity to participate for rural/urban. This is not consistent with prior literature that shows rural populations have lower opportunity and participation rates. 5,[22][23][24][25][26] This unexpected finding could be influenced by the extensive community-based participatory research capacity that the states only academic medical center (University of Arkansas for Medical Sciences) had invested in to better engage rural and minority participants. One of the most encouraging findings is that among all respondents, 45.5% would be willing to participate if provided the opportunity and another 22.1% were undecided. Only 32.4% stated that they would not be willing to participate in health research. In fact, racial/ethnic minority participants (Black or Hispanic) were more likely to express their willingness to participate in health research if provided the opportunity than White respondents. There is no difference in participation rates between racial/ethnic minorities, yet among those who have not participated, racial/ethnic minorities report both more opportunity and more willingness. These findings are inconsistent with several nonpopulation-based studies that suggest racial/ethnic minorities are less willing to participate. 9,[27][28][29][30][31][32][33][34][35][36] However, the findings are consistent with a small number of more recent studies that document a willingness to participate among racial and ethnic minorities. [37][38][39] This study adds to the growing body of literature suggesting barriers beyond willingness. [37][38][39] Specifically, the paradoxical findings of this study, which showed no difference in the participation rates of racial/ethnic minorities, yet also showed racial/ethnic minorities report both more opportunity and more willingness, needs further exploration. Furthermore, there was no significant difference in participation rates, willingness to participate, or opportunity to participate among those with and without a chronic condition. This was somewhat surprising, as prior research has shown that those with chronic conditions are more likely to participate. 6,[40][41][42] Another unexpected finding was that those who have insurance were less likely to have had the opportunity to participate, and those who were uninsured reported greater opportunity. Furthermore, those who reported not being able to afford to go to the doctor, and those without a job reported greater willingness to participate. These findings are in contrast to other studies that have suggested persons with limited access to healthcare services and persons who are uninsured are less likely to participate in research. 24,[43][44][45][46][47] These unexpected findings may be due to the high proportion of uninsured patients who are treated by the academic medical center, which is also the primary health research organization in the state. Younger participants (<65 years) reported having participated in research at lower rates and also reported less opportunity to participate in research. However, they expressed a greater willingness to participate. This could be due to the length of their opportunity (i.e., those who are 65 or older have lived longer, and therefore have more years of opportunity). While the finding is not surprising, the increased willingness of younger age groups is encouraging. Consistent with prior literature, as education increased, so did rates of participation, opportunity, and willingness. Not surprisingly, those who had a previous opportunity to participate in health research, but had chosen not to participate, were less likely to be willing to participate in health research."}, {"section_title": "Strengths and limitations", "text": "This study is strengthened by the large representative sample of respondents in Arkansas who took part in the 2015 BRFSS. However, the study does have limitations. The study relied on self-reported responses and, therefore, is subject to response bias. Although the BRFSS data collection does include both land-line and cell phone interviews, it does not include those without access to a phone. However, weighting the survey data to be representative of the state's population should compensate for any potential selection biases in sampling. The majority of the weighted sample-like the majority of Arkansas residents-were Caucasian, insured, and living above poverty levels. Therefore, important insights may be gained via oversampling of rural, minority, and socioeconomically disadvantaged groups in future population-based surveys. Additionally, those who are participating in the BRFSS may be more likely to report willingness to participate in health research than those who refused the BRFSS interview. Despite these limitations, this is the largest study of its kind using a representative sample. The study adds key insights into the factors associated with research participation, opportunity, and willingness to participate."}]