[{"section_title": "Abstract", "text": "Changes in the structure of agriculture have led some to rethink the purpose and nature of farm support programs, yet taxpayers are often left unheard in this debate. This paper determines how people would vote on particular farm policies and identifies the determinants of support/opposition to farm programs. Our results show the majority of people support farm subsidies, but voting outcomes are sensitive to the costs of the policy and the magnitude of the payouts to farmers. We find people act altruistically toward small farmers and that people are averse to inequality. Furthermore, we found the public's attitude toward maintaining a secure food supply is a significant determinant of support for farm programs. Finally, we found that information about farmers' average incomes and average production levels across different farm sizes had little effect on people's willingness to subsidize small or large farmers."}, {"section_title": "Introduction", "text": "Although American consumers are increasingly disconnected from production agriculture, there is a surging interest in food and agricultural production methods. Popular writers increasingly espouse the merits of local and organic foods, and decry \"factory farms\" and \"corporate agriculture\" (e.g., see Pollan 2006) Although such concerns are often vague and detached from the realities of modern food production practices, such writers often appeal to the intrinsic value consumers apparently attach to small family farmers. From the onset, it seems that Americans have been enamored with an agrarian ideal. As Thomas Jefferson put it, \"Agriculture... is our wisest pursuit, because it will in the end contribute most to real wealth, good morals and happiness.\"\nIn the late 1920s, the U.S. government initiated farm policies to support and stabilize farm income through supply controls, deficiency payments, and price floors. Other goals have been introduced over the years (e.g., increasing agricultural exports and promoting the conservation of natural resources), but today's policies still aim to \"save the family farm\" (Doering and Outlaw 2006) . The persistence of farm policies is no doubt partly attributable to the political power of the agricultural lobby, but to have existed so long, it seems that farm policies would also have to enjoy some modicum of public support. Indeed, Ellison, Lusk, and Briggeman (2010) recently found, via in-person interviews in three U.S. cities, that almost 85% of respondents were in favor of the U.S. government subsidizing farmers despite the fact that over 60% of respondents believed farmers earn more income than they do.\nThe general question we ask in this paper is whether and why the public supports or opposes farm supports. To be clear, we do not argue that surveybased measures of people's preferences should be used to set farm policy in so far as they are unlikely to correspond with efficiency maximizing outcomes. Our research is positive rather than normative. People's preferences, no matter how unknowledgeable or ill-informed, undoubtedly have some influence on the political process and on the politician's actions (e.g., see Gardner 1987) . As such, a descriptive account of the prevalence and persistence of farm policy must entail some measure of citizen's desires -measures which are noticeably absent from the literature.\nOne might question whether the public is sufficiently knowledgeable and informed to express a preference for farm policies; however, this line of reasoning misses the point. Incorrect or false beliefs do not imply the absence of preferences. It is the purpose of this paper to provide information on preferences irrespective of our personal beliefs about the merits or demerits of farm policies. To be sure, the public is often uninformed about agriculture and farm policy, but in a democracy, public opinion is an important input in the political and policy making process. That people are often unknowledgeable about agriculture also suggests the need to understand how the public reacts to different information about the structure of agriculture -an issue we study in the present paper.\nToday, a renewed interest in farm policy has emerged, in part, because the structure of agriculture has changed drastically from the time farm policies were first implemented. Farm household incomes were once well below non-farm household incomes; however, in 2007, the mean income and net worth of farm households exceeded their non-farm counterparts by over $15,000 and $500,000, respectively (Harris, et al. 2008) . Moreover, there are fewer farms than there were 50 to 100 years ago, and the remaining farms tend to be much larger in size. The increasing size of farms and the large inequity in the size of payouts going toward large vs. small farms has been a source of concern among opponents of farm subsidies. For example, the Environmental Working Group (2009) reported that in 2009, the top 5% of recipients of agricultural subsidies received 45% of the total payouts. In fact, almost 80% of all farm subsidies go to the top 20% of recipients in 2009. Advocates of farm subsidies argue the inequities are justified by the fact that larger famers tend to account for a disproportionate share of agricultural output, but such arguments have not convinced anti-farm subsidy advocates. There have been increasing calls for farm support programs to be changed by removing support for \"factory farms\" (e.g., Riedl 2007; Grunwald 2007; Environmental Working Group 2008) . Even President Obama has been outspoken about limiting subsidies to \"agribusinesses\" (Pulizzi and Boles 2009) , and congress has implemented measures to limit payments to \"large\" farms. Yet, little is known about public support for farm policies.\nTo our knowledge, only a couple previous studies have analyzed U.S. taxpayer support for farm policies. Variyam and Jordan (1991) and Variyam, Jordan, and Epperson (1990) used people's answers to Likert-scale questions elicited in a mail survey to examine perceptions of and preferences for agricultural policy among a sample of U.S. citizens. They found that people often equate family farms with small farms, and that people are more supportive of family farms than non-family farms. They found women and Democrats were more likely to support farm policies than men and Republicans. In a poll of over 1,800 Americans, Kull et al. (2004) found widespread support for subsidies directed toward small farms; further, they found most people preferred to shift subsidies away from large farms toward small farmers. Their polling results also indicated that people would like to see subsidies paid out when needed (during bad crop years, for example) rather than on an annual basis.\nRather than asking general Likert questions or simple yes/no polling questions about support for general farm policies, in this paper, we use developments in behavioral and experimental economics to provide a framework in which to interpret people's concerns for others -i n o u r c a s e f a r m e r s .\nImplementing this economic structure allows us to utilize other-regarding behavioral models similar to those developed by Charness and Rabin (2002) , Fehr and Schmidt (1999) , Bolton and Ockenfels (2000) , and Engelmann and Strobel (2004) to better understand why the public supports or opposes farm policy and to predict how the public would vote on particular policies involving monetary taxes and payouts to different groups. Using variations on the models proposed by these authors, in conjunction with people's responses to particular survey questions, we can identify the extent to which people's willingness to support farm programs is driven by self interest, altruism, or inequality aversion. To these more formal models, we also add a host of attitudinal variables to further identify motivations for farm support or opposition.\nThe overall purpose of this research is to develop a greater understanding of U.S. citizens' attitudes toward farm support programs. This research uses survey data from a random sample of over 1,100 U.S. citizens to determine: (1) the percentage of the population that supports or opposes direct payments to farmers; (2) whether support or opposition to direct payments depends on the size of farm receiving the payment and/or the type of information provided about farm incomes; and (3) whether factors such as inequality aversion, altruism, or other attitudes explain support for direct payments to farmers.\nIn this paper, we ask people a series of concrete questions related to support for direct payments (as opposed to more general Likert scale and polling questions), and by varying the cost of the policy to the individual and the benefit to the farmer, we can identify the parameters of a model of other-regarding behavior. Given these parameter estimates, we calculate people's willingness to pay for policies entailing particular changes in subsidies toward large and small farmers. Moreover, given the fact that most U.S. citizens have little knowledge of agriculture, we study the extent to which information alters people's willingness to support/oppose farm payments."}, {"section_title": "Conceptual Model", "text": "Many models have been proposed to explain other-regarding behavior. Motivated by the experimental finding that people do not act in a strictly selfish manner, previous studies have proposed various models to depict other-regarding preferences. In perhaps the most widely known of these models, Fehr and Schmidt (1999) argue that in addition to self interest, people are averse to two types of inequality: advantageous inequality in which people derive disutility from being better off than others and disadvantageous inequality in which people derive disutility from being worse off than others. Bolton and Ockenfels (2000) propose a similar model of inequality aversion, but one in which inequality is conceptualized as the extent to which one's payoff differs from the mean payoff. Charness and Rabin (2002) argue that people are concerned about efficiency (i.e., the sum of all payouts) and have maxi-min preference (i.e., people want to maximize the minimum payoff).\nIn this paper, we propose a model based on the insights of Fehr and Schmidt (1999) . In particular, consider the utility, V i , a person derives from a change in a direct payment policy that imposes a monetary cost to individual i, X i , and some monetary benefit to two types of family farms on both extremes of the size spectrum: an average payout to each small, X SF, and very large, X VLF , family farmer.\n1 More formally,\nis the utility derived from such a policy which depends on self interest (β 1 ), altruism toward small and very large family farms, (β SF and β VLF , respectively), and aversion to inequality (β IA ). The parameter β 0 captures all other factors affecting the utility derived from the policy not explained by relative monetary payoffs."}, {"section_title": "2", "text": "We hypothesize people care about their own monetary well-being, and all else equal, prefer to have more money to less (i.e., β 1 > 0 ) . Seco n d , w e hypothesize people are altruistic toward small farmers and are more altruistic toward small farms than very large farms (i.e., β SF > 0 and β SF >β VLF ). Finally, we hypothesize people are averse to inequality (i.e., β IA < 0), which is a key theoretical and empirical finding of Fehr and Schmidt (1999) .\nModeling other-regarding behavior as shown in equation (1) presents some advantages and disadvantages when compared to existing models. Equation (1) is more general than Fehr and Schmidt's (1999) model because it includes the altruism parameters, β SF and β VLF , as well as the parameter β 0 , but is also more restrictive because it assumes no difference in aversion to advantageous and disadvantageous inequality. The model also has the ability to somewhat capture preferences for efficiency (as argued is important by Charness and Rabin (2002) 1 Here, as in Fehr and Schmidt (1999) , the Xs are changes in income and are modeled as payouts either received or paid. In our case, X i is negative because it is a tax paid by the individual to provide the payments X SF and X VLF to small and very large farms. 2 Based on the models of Fehr and Schmidt (1999) , and others, we specify the utility function as being linear in payouts. This choice is made under the presumption that utility is linear in the neighborhood of the income/tax changes considered in our analysis, which are small compared to people's income or wealth. It is important to note, however, that people are likely to experience diminishing marginal utility over large changes in income. We analyzed whether such diminishing returns existed over the tax/subsidy changes considered in our analysis, but found that the quadratic effects were very small relative to the linear effects suggesting that the assumption of linearity is not terribly problematic in this case; however, the results suggest the need to be careful about extrapolating to larger income/tax changes. and Engelmann and Strobel (2004) ) by noting that the utility function includes the sum of all payouts X i , X SF, and X VLF , weighted by the respective selfishness and altruism parameters. We also note that the formulation bears some similarity to the model in Bolton and Ockenfels (2000) because it is posited that people care about their cost/benefit relative to the average payoff of the farmer in a given group. Thus, while the model in equation (1) assumes people are unconcerned about the distribution of payouts within a farm type (or that the distribution of payouts within large and small farmers is unchanged), redistributing income from small to large farmers might be desirable.\nAnother advantage of equation (1) is the ease with which it can be manipulated to show how much tax an individual would be willing to pay to give payments to different farm types. Normalizing the utility from a policy's nonpassage to zero, the maximum additional tax (or maximum willingness-to-pay (WTP)) individual i would be willing to bear such that each small farmer receives X SF and each very larger farmer receives X VLF is:\nA number of insights can be gleaned from equation (2). First, it can be seen that β 0 denotes the utility derived from a policy's passag e that is not explained by magnitude of payouts to small and large farmers; β 0 incorporates other motivations for voting in favor a policy to subsidize farmers such as protecting the food supply or preserving the beauty of natural resources. In addition, the term (β 1 -2 β IA ) reflects the marginal utility of income which translates the change in utility from the policy's passage (the term in brackets) to dollars. Finally, if people are more concerned about small farmers than inequality aversion (i.e., β SF > -β IA ) and holding the payoff to very large farmers at $0, the aforementioned hypotheses imply that people will be willing to pay some positive amount for a policy in which small farmers benefit (i.e., WTP|X VLF =0 > 0).\nIn describing the model given in equation (1), it was implicitly assumed that we were describing the preferences of a single individual with a given information set. However, preferences are likely to be influenced by the information and knowledge one possesses about farms, I, attitudes toward farms and government in general, A, and demographics, D. As such, each of the model parameters, β 0 , β 1 , β SF , β VLF , and β IA is likely to depend on I, A, and D.\nOne example of information which might alter individuals' preferences is information regarding farm household income. It is likely that when people see the term \"small family farm\" they are likely to conjure an image of a lower income household. However, data from the 2007 Agricultural Resource Management Survey (ARMS) shows the average household income for a small family farm is $69,804 -much higher than the average U.S. household income.\nFurthermore, the data reveals that this income is earned primarily from off-farm sources. In fact, the average farm income for small family farmers is negative (USDA 2007) . Because these facts are likely to conflict with some people's initial beliefs, we hypothesize that the provision of such information will dampen support for small farmers (i.e., β SF with income information < β SF without income information). We also expect preferences could be altered when participants are given information about farm production. Given that small family farms only account for 28% of total agricultural output despite representing over 90% of all farms (USDA 2007), we hypothesize that this information may also cause support for small family farms to dwindle. Finally, we expect that a person's preference for farm policy will depend on a host of attitudinal and demographic factors of the type that will be described in more detail in the next section."}, {"section_title": "Methods and Procedures", "text": "The company Knowledge Networks (KN) was hired to administer a web-based survey to their panel of respondents. The KN panel is an online panel constructed to be representative of the U.S. population. It is the only existing online panel that uses probability-based sampling. KN achieves this outcome by randomly recruiting participants using telephone (using both listed and unlisted numbers and using cell phone numbers) and other methods. Panelists are provided with access to the Internet if the household does not have ready availability. Thus, the panel is designed to be a true probability-based sample of the U.S. population comprised of both Internet and non-Internet households, all of which are provided the same equipment for participation in Internet surveys. More information on the panel, recruitment methodology, studies comparing the Knowledge Network panel to other sampling techniques, and a bibliography of published academic papers which have employed the Knowledge Network panel can be found at http://www.knowledgenetworks.com/ganp/.\nIn July 2009, the survey was sent to 1,833 individuals in the KN panel 1,196 of whom completed at least a portion of the questions, implying a response rate of 65%, conditional on recruitment into the panel. The sample size was further reduced to 1,120 people who provided answers to all survey questions we analyze in this article. Characteristics of study participants were similar to those of the U.S. population and can be found in Table 1 . The survey consisted of approximately twenty questions and took participants, on average, about 10 minutes complete. Each respondent was randomly assigned to one of four information treatments. Respondents in Information Treatment 1 (INFO 1) were given the definition of small, large, and very large family farms (based on gross farm sales) according to the Economic Research Service (ERS) classification system as well as the proportion of farms in each size category. For example, in the case of small family farms, we inform respondents that this group has gross farm sales of less than $250,000 and they represent about 90% of all farms. All participants received this information at a minimum. Those in Information Treatment 2 (INFO 2) were given the same information as those in INFO 1, and were also informed of the average annual household income for each type of family farm and the average percent of income from farm sources. For the case of the small family farm, for example, we told respondents that the average annual household income of a small family farm was $69,804 and that the average percent of income from farm sources is 0%. Participants in Information Treatment 3 (INFO 3) were given Average percent of income from farm sources is 79% X X Account for 43% of total agricultural output X X same information as in INFO 1, and were also informed of the percent of total agricultural output each type of farm produced. For example, in the case of the small family farm, we inform participants that small family farms account for 28% of total agricultural output. Finally, people in Information Treatment 4 (INFO 4) received all the information contained in the previous treatments: INFO 1, INFO 2, and INFO 3. Thus, for each type of farm, the respondent was given the ERS definition, proportion of total farms, average annual household income, average percent of income from farm sources, and the percent of total agricultural output. For a complete breakdown of information provided about small, large, and very large family farms, see Table 2 above. Our analysis primarily focuses on three questions (shown below) in which respondents were asked to vote for or against three different policies:\nPolicy 1: S u p p o s e t h e n e x t t i m e y o u w e n t t o v o t e , t h e r e w a s a referendum on the ballot to increase the average annual subsidy paid to each small family farm (those with less than $250,000 in gross farm sales) by << $90, $500, or $1000 depending on survey version >>. If passed, the policy is expected to cost your household << $0, $100, or $200 depending on survey version >>. How would you vote on the referendum if your annual federal taxes would increase by << $0, $100, or $200 depending on survey version >> if the ballot initiative passed?\nPolicy 2: S u p p o s e t h e n e x t t i m e y o u w e n t t o v o t e , t h e r e was a referendum on the ballot to increase the average annual subsidy paid to each very large family farm (those with more than $500,000 in gross farm sales) by << $90, $500, or $1000 depending on survey version >>. If passed, the policy is expected to cost your household << $0, $100, or $200 depending on survey version >>. How would you vote on the referendum if your annual federal taxes would increase by << $0, $100, or $200 depending on survey version>> if the ballot initiative passed?\nPolicy 3: Suppose the next time you went to vote, there was a referendum on the ballot to increase the average annual subsidy paid to each small family farm (those with less than $250,000 in gross farm sales) by << $90, $500, or $1000 depending on survey version >> and reduce the average annual subsidy paid to each very large family farm (those with more than $500,000 in gross farm sales) by << $500, $1000, or $2000 depending on survey version >>. If passed, the policy is expected to cost your household << $0, $100, or $200 depending on survey version >>. How would you vote on the referendum if your annual federal taxes would increase by << $0, $100, or $200 depending on survey version >> if the ballot initiative passed?\nThe questions were phrased as single-bounded dichotomous choice questions using a referendum format, which under certain assumptions provides incentives for people to honestly answer the question (e.g., see Carson and Groves 2007) . Across surveys, the cost to the individual was randomly varied between the values of $0, $100, or $200 and the average benefit to farms was randomly varied between the values of $90, $500, or $1000. The dollar amounts were chosen in an effort to create a situation in which, at the median values, roughly half the people voted in favor and half against the policies, which has the potential to improve the standard error of willingness-to-pay estimates (e.g., see Alberini 1995; Kanninen 1993) .\nWe also chose the values to create one situation in which the cost to the individual was less than the average benefit to the farmer (i.e., when X i =$100 and X SF =$90). Experimental design in situations such as this always involves a bit of art as determination of model efficiency requires knowledge of true preferences, which are obviously not known prior to survey administration. We conducted an initial pre-test with about 60 individuals, and based on these responses, we modified the tax amounts charged to individuals. In the end, our choice of dollar amounts appears to have been appropriate, as across all surveys 52% voted in favor of policy 1, and as will soon be seen, the estimated standard errors of the key parameters are quite small."}, {"section_title": "3", "text": "Although answers to the three questions shown above form the foundation for the analysis conducted in this paper, the survey contained several other questions of interest. In particular, to analyze the determinants of the votes on policies 1-3, we also asked several Likert scale questions, which will be discussed in more detail in the following sub-section, and we also asked some demographic questions. Finally, to provide a more general gauge of people's support for farm policies, we asked a question about whether people favored or opposed the government generally subsidizing farmers, and this question was followed up with a question asking people to check a box to indicate the key reason for their support or opposition."}, {"section_title": "Econometric Model", "text": "The econometric approach relies on random utility theory. Individual i's utility for policy j is:\nwhere V ij is the systematic portion of the utility function defined in equation (1), e i is an individual-specific random error term added to account for the panelnature of the data (i.e., each person answered three policy questions), and ε ij is an overall random error term. 4 Normalizing the utility of the non-passage of a policy to zero, the probability that a person in favor of a policy is the probability that U ij > 0. Assuming the ε ij a r e l o g i s t i c a l l y d i s t r i b u t e d , t h e p r o b a b i l i t y t h a t a n individual's vote is \"yes\" is the probability that V ij + e i > ε ij , which generates the logit model:\n.\nMaximum likelihood estimation is used to identify the parameters that best explain the choice data. In particular, the parameters of the model are identified by maximizing the following likelihood function:\nwhere y ij is equal to 1 if individual i votes affirmatively on policy j. Because the likelihood function in (5) includes the random term e i , it cannot be evaluated directly, and as such we use we use numerical methods (simulated maximum likelihood estimation) to integrate the random effect term out of the likelihood function using the methods discussed in Train (2003) .\nTo determine whether people's responses differed by information treatment, we estimate equation (5) separately for each treatment -allowing all model parameters to vary by treatment. Then a likelihood ratio test is conducted as follows:\nThe test has 15 degrees of freedom -i.e., there are 5 parameters per model as in equation (1) and there are 4 models, 5(4-1) = 15. If the calculated value in equation (6) is greater than the critical χ 2 value with 15 degrees of freedom at the 0.05 significance level, 27.488, then the null hypotheses that the model parameters are unaffected by information is rejected.\nquestions asked respondents to give up money while small farmers received some positive payment. Although this question is entirely plausible given our survey purpose and context, it implies that for all three questions, the term │X i -X SF │ can be written simply as X SF -X i (the same is not true for very large farms because of our third survey question). Thus, given the specific questions asked, equation (1) can be re-written as:\nThis means, one could estimate a type of reduced-form empirical model:\nEven with this approach, however, the structural parameters are easily obtained via the following substitutions: β 1 = π 1 + β IA and β SF = π SF -β IA . Rather than using this reduced form approach, we estimate the structural parameters directly.\nWe also sought to determine whether people's preferences differed by demographic characteristics and/or attitudes. Because the model formulation is one in which only differences in utility across yes/no votes matter, and because demographics/attitudes are constant for an individual, the only way for a demographic variable to affect behavior is to interact with one of the model parameters. Take, for example, a variable such as gender, for which Frohlich et al (1984) and Andreoni and Vesterlund (2001) have found that females prefer more equitable distributions than men. To test such an effect, equation (1) can be modified as follows:\nsuch that each of the parameters related to selfishness, altruism, and inequality aversion now shift by gender. For example, testing δ 4 = 0 will determine whether females' aversion to inequality significantly differs from men's. While gender is a variable many have hypothesized to affect other regarding behavior, it is not the only demographic trait of interest. As such we further augment equation (7) by including variables on income, age, political affiliation, education, ethnicity, geographic location, and farming background by similarly adding interaction terms between each demographic attribute and the policy payout amounts. A previous study by Ellison, Lusk, and Briggeman (2010) found that variations in demographics failed to explain much of the variability taxpayers' support for farm policies, and as such, we sought to determine whether people's voting patterns might also be explained by differences in attitudes. To measure people's attitudes towards various aspects of interest related to farm policy, we relied on Fishbein and Ajzen's (1975) theory of reasoned action, which posits that an attitude toward an action is comprised of the product of an individual's beliefs of outcomes of the action and an evaluation of (or attitudes toward) those beliefs. For example, consider a person's attitude toward government interference in market outcomes. To measure such an attitude, we asked participants to indicate the extent to which they agreed or disagreed (on a 5-point scale, where 1=Strongly Disagree and 5=Strongly Agree) with the following two statements:"}, {"section_title": "The governments' farm policies interfere with market outcomes.", "text": ""}, {"section_title": "It is undesirable for the government to interfere in market outcomes.", "text": "In this example, Statement 1 represents the individual's belief about the extent to which farm policies represent government interference in markets while Statement 2 represents an evaluation of that belief. If an individual answered \"5\" on both questions, the attitude score would be 5*5=25, meaning he/she is strongly opposed to farm policies on the grounds that it interferes with market outcomes.\nAlthough one could have simply measured the attitude itself (i.e., do you agree/disagree that it is undesirable for farm policies to interfere with market outcomes), we felt that more heterogeneity in attitudes would be picked up by asking two separate questions. Moreover, our approach allows us to decompose an attitude into its constituent parts to see, for example, whether one's attitude toward government interference in market outcomes is a result of a belief that farm policies interfere with outcomes or whether people believe interfering in market outcomes is itself undesirable.\nIn total, we asked 12 questions to measure people's attitudes toward six issues we hypothesized to influence people's votes on the three policy questions. In particular, we measured attitudes toward using farm policies as they relate to: 1) preserving a traditional lifestyle of historical significance, 2) maintaining a secure supply of food for U.S. citizens, 3) preserving the beauty of rural landscapes, 4) reducing the unpredictability of farm incomes, 5) interfering with market outcomes, and 6) causing high taxes and government spending.\nSummary statistics for each belief, belief evaluation, and attitude are presented in Table 3 on the following page. People most strongly believe in the unpredictability of farm income (mean of 4.083) and high levels of taxes and government spending (mean of 4.021). When looking at the evaluation of beliefs, however, people feel strongly about maintaining a secure supply of food for U.S. citizens (mean of 4.322) and high levels of taxes and government spending (mean of 4.075). When the beliefs and belief-evaluations are combined, we can see that people have the strongest attitudes toward taxes and government spending as it relates to farm programs and about farm programs providing a secure supply of food.\nTo determine the effect of such attitudes, we modified equation (1) as follows in which the constant term β 0 , which again measures the factors explaining a persons' propensity to vote affirmatively that is not explained by variations in X i , X SF , and X VLF , is allowed to vary with a person's attitudes. By testing γ 1 = γ 2 = γ 3 = γ 4 = γ 5 = γ 6 = 0, we can determine if attitudes significantly affect willingness-tovote in favor of the direct payment policies. By testing the aforementioned hypothesis, it can be determined whether attitudes significantly affect voting outcomes. However, it is also of interest to determine how important attitudes are relative to people's other-regarding preferences, β 1 , β SF , β VLF , and β IA . Because the attitudinal variables are measured in different units than the dollar payouts, one cannot simply compare the relative magnitude of coefficients to determine relative importance. To remedy this, we calculate standardize the coefficients by re-estimating the model and replacing the original variables with their standardized counterparts (note: to standardize a variable, the mean of the variable is subtracted from each observation and this difference is divide by the standard deviation of that variable; the results is a new variable with zero mean and unit standard deviation)."}, {"section_title": "Results", "text": "We begin our discussion of the results by describing how people responded to a general question about support/opposition to farm subsidies. In particular, respondents were asked \"In general, are you in favor of the U.S. government providing financial support (i.e., subsidies) to farmers?\" As shown in Figure 1 on the following page, 66% of participants answered affirmatively. This is quite a bit lower than the almost 85% of subjects approving of farm subsidies reported in Ellison, Lusk, and Briggeman (2010) , which may be a result of the fact that the present result is derived from a nationally-representative sample of citizens, whereas the results in Ellison, Lusk, and Briggeman (2010) were derived from interviews in only three cities. Another possibility is that the present result was measured in the midst of a prolonged economic recession that had yet to hit when Ellison, Lusk, and Briggeman (2010) asked their question in the summer of 2008. Despite the somewhat lower level of support witnessed in this survey, the finding should not overshadow that fact that a large majority of respondents -almost two thirds -voice support for farm financial support.\nFollowing this initial question, respondents were then asked to check one box best representing the reason for their support or opposition to the government providing financial support to farmers (the specific question asked depended on how the preceding question was answered). The most frequent reasons for support were to ensure a secure supply of food for U.S. citizens (49.3% of supporters stated this as the main reason) and because farmers' incomes are too unpredictable due to weather, price risk, etc. (26.4% of all supporters). Of the 33.9% of respondents who were not in favor of farm subsidization, the most common objections were because farms should not be treated differently than any other business (32.7% of all opponents), people preferred less government interference in markets (21.6% of all opponents), and taxes are too high and all government spending should be cut (21.6% of all opponents). Figure 1 provides a full breakdown of reasons for support and opposition."}, {"section_title": "Preferences for Direct Payments to Farmers", "text": "The raw data indicate that 52%, 22%, and 46% of people would vote in favor of Policies 1, 2, and 3, respectively. These results indicate that participants are more likely to support policies which benefit small family farms (Policies 1 and 3) and are less likely to support policies benefitting large family farms (Policy 2), which is similar to the findings of Kull et al. (2004) who found people would like to see more subsidy dollars allocated to small farmers rather than large farmers. To provide a feel for the results and interpretation, results from the logit model, fit to responses from all three policy questions and pooled across information treatments are:\nThese results (pooled coefficients and standard errors provided in Table 4) indicate that as the tax burden (or loss of income) to the individual increases, the individual's utility decreases. That is, for every $1 an individual has to pay in taxes, utility falls 0.0104. The results also indicate that although people are altruistic toward small farmers (0.0016), utility falls as subsidies toward large farms increase (i.e., people want to reduce subsidies to large farms). The results also indicate people are averse to inequality (-0.0008). Based on equation (2), and assuming very large farm subsidies remains unchanged (i.e., X VLF = 0), we can see that the maximum tax people would be willing to pay so that each small farmer would receive, for example, $100 is: [0.5501 + (0.0016-0.0008)*100]/(0.0104 + 2*0.0008) = $52.51."}, {"section_title": "Effect of Information on Preferences", "text": "To determine whether information affected preferences for farm policy, we estimated logit models for each of the information treatments and compared the results to the pooled model. As can be seen in Table 4 on the next page, most of the coefficients across information treatments and in the pooled model are similar in magnitude. The calculated Chi-squared test statistic is 23.802, which is less than the Chi-squared critical value with fifteen degrees of freedom of 27.488, meaning we fail to reject the hypothesis that information has a significant effect on voting outcomes."}, {"section_title": "5", "text": "It appears that those people who are more informed of farm incomes are no more or less likely to support direct payments than the uninformed. Moreover, telling people that small farms account for a relatively small share of total farm output and that they earn most their household income off-farm apparently had no effect on people's willingness to support small farm subsidies. Thus, while many "}, {"section_title": "Logit Model Estimates", "text": "people discount public opinion on farm policies based on an argument like \"people don't know enough about farms,\" the results presented here suggest that informing the public has very little influence on their preferences. Given this finding, we pool the data across information treatments for the remainder of the analysis. Table 5 reports different model specifications. Model 1 should look familiar, as it is the same pooled model reported in Table 4 . Model 2 (which is actually absent from Table 5 but can be found in the predicted correctly (89.4% vs. 87.4%) and a higher pseudo R 2 value than Model 1, and a likelihood ratio test shows there is a significant difference between the two models (χ 2 stat = 8 9 . 2 2 > χ 2 crit w i t h 6 5 d e g r e e s o f f r e e d o m a t t he 0 . 0 5 significance level = 89.18). We contend, however, that the likelihood ratio test results mean at least one of the interaction effects is significantly different than zero, so if there are only a few interaction terms (out of 65 possible) statistically significant, we would not consider Model 2 to be highly superior to Model 1."}, {"section_title": "Effect of Demographics and Attitudes", "text": "Given the relatively poor explanatory power of demographic variables, we sought to determine if attitudes towards government interference, preserving rural beauty, etc. had a significant impact on preferences for farm policy. To address this issue, we utilized equation (8) where a person's utility for a given policy is modeled as a function of other-regarding behaviors as well as the person's attitude toward preserving a traditional lifestyle, ensuring a secure supply of food, preserving rural beauty, etc. This model (Model 3) can be found in Table 5 .\nAs can be seen in Table 5 , each of the attitude variables is significant at the 1% level with the exception of the attitude toward preserving the beauty of rural landscapes. It is somewhat surprising that the percent predicted correctly by Model 3 was only slightly higher than that of Models 1 and 2 (89.5% vs 87.4% and 89.4%); however, a likelihood ratio test strongly rejects the hypothesis (and the P< 0.01 level) that the attitude interactions are all zero (i.e., Model 3 is strongly preferred to Model 1). Results for Model 3 indicate that if an individual has a strong attitude toward supporting farmers to preserve a traditional lifestyle, they are significantly more likely to vote in favor of a direct payment than someone less concerned about preserving a traditional lifestyle. Similarly, a strong attitude against government interference in markets decreases the likelihood of voting in favor of direct payments.\nTo compare the relative magnitude of the effect of attitudes and dollar payouts on voting behavior, we calculated standardized coefficients, which are reported in the last column of Table 5 . Our results show a person's attitude toward the unpredictability of farm income has the most positive effect on utility while one's attitude toward high taxes and government spending has the most negative influence on utility. When looking at the dollar payout coefficients, we can see that the cost to self (or self-interest) parameter has the greatest influence on utility which is consistent with basic economic theory, but altruism and inequality aversion have an influential effect as well. It is important to note, however, that the dollar payouts in the other-regarding behavior model tend to have a greater impact on utility than changes in attitudes. For instance, a one standard deviation increase in the subsidy to a small family farm increases utility by 0.6183, whereas a one standard deviation increase in a person's attitude toward maintaining a secure food supply only increases utility by 0.2276. "}, {"section_title": "Conclusions", "text": "Discussions of farm policy tend to focus on how farmers and other agriculturerelated businesses feel about specific farm support programs and the politics entailed in passing such policies. While it is true that farms and agribusinesses are most directly affected by farm policy, the opinions of those who pay the bill should not be ignored. Public opinion is an important input into the political and policy making process, yet almost nothing is known about public support for farm policies. The purpose of this paper is to develop a greater understanding of taxpayers' preferences for farm policy u s i n g a n e c o n o m i c m o d e l o f o t h e rregarding preferences as a structural framework.\nOur results show that, in general, the majority of people (66%) are in favor of the government providing financial support to farmers. Most proponents want to ensure a secure supply of food as well as protect farmers from the unpredictable nature of farming itself (weather, price risk, etc.). Opponents, on the other hand, object to government subsidization mainly because they believe farms should be treated like any other business and because of the belief that government should not meddle in market outcomes.\nLooking specifically at people's votes on direct payments to farmers, we found that people would rather see funding go to small family farms rather than very large family farms, a result also found by Kull et al. (2004) . Indeed, our parameter estimates suggest most respondents would be in favor of reducing payments to very large farmers either by reducing taxpayer's burden or by redistributing farm payments away from very large farms and directing it toward small farms. Importantly, this result was found even in cases where respondents were fully informed that large farms account for the majority of the farm output.\nOne interesting result is that information had no significant effect on respondents' preferences for farm policy. Even when participants were told the average household income of a small family farm was completely derived from off-farm sources, people still opted to support policies which benefitted small family farms over very large family farms. Because information on relative incomes and productivity did not significantly affect willingness to support direct payments, this suggests there are other factors driving voting behavior; a result consistent with our finding that attitudes toward issues such as preserving traditional lifestyles and protecting against riskiness are significant determinants of preferences for farm payments. Previous research has also considered how demographic factors drive preferences (Variyam, Jordan, and Epperson 1990; Variyam and Jordan 1991) , but our results demonstrate attitudes can explain more variation in preferences for farm policy compared to demographic characteristics.\nFinally, we found citizens exhibit other-regarding preferences in relation to farm policy. Although people care about their own well-being, they also act altruistically toward small family farms (but not toward very large family farms), and people exhibit aversion to inequality. The other-regarding preference models we estimated, while inspired by existing models in the economic literature, have some key differences that seem to explain well our pattern of voting behavior as our models were able to correctly predict almost 90% of people's votes. While this paper provides new insights into taxpayer preferences for farm policies, there remains much to learn. Farm programs are only one component of the USDA budget, and it may be useful to determine the importance of farm programs in relation to other budget components (such as food assistance, natural resource conservation, rural development, etc.), and to determine how information about current budget allocations influences people's choices. Lobbyists, policy makers, and government officials are continually interested in public opinion, and we hope the results presented here will help enhance understanding of the public's support of farm programs. Restricted LLF was obtained from model which only contained intercept term."}, {"section_title": "24", "text": "The B.E. Journal of Economic Analysis & Policy, Vol. 10 [2010] , Iss. 1 (Topics), Art. 96 "}]