[{"section_title": "Abstract", "text": "We test the predictions from Becker's (1957) seminal work on employer prejudice and find that relative black wages (a) vary negatively with the prejudice of the \"marginal\" white in a state, (b) vary negatively with the prejudice in the lower tail of the prejudice distribution but are unaffected by the prejudice of the most prejudiced persons in a state, and (c) vary negatively with the fraction of a state that is black. Our estimates suggest that one-quarter of the racial wage gap is due to prejudice, with nontrivial consequences for black lifetime earnings."}, {"section_title": "I. Introduction", "text": "seminal The Economics of Discrimination launched the formal analysis of labor market discrimination among economists. Becker's analysis focused on the relationship between racial prejudice among whites and discrimination against racial minorities in a competitive model. In contrast to much of the contemporaneous literature, Becker formalized the definition of racial preferences, depicting them as an aversion to cross-racial interaction. In a series of models, he analyzed the effect of the possession of such preferences among customers, coworkers, and employers on black relative wages. Since the publication of Becker's work, discrimination has been one of the most intensely studied topics in economics; theorists have posited different explanations for racial wage gaps, including many that do not depend on racial animus, and there have been hundreds of empirical studies devoted to measuring and attempting to explain wage differences.\n1 Yet, curiously, in the massive and growing discrimination literature, there is no paper of which we are aware that tests the sharp yet subtle predictions of Becker's original prejudice model about the relationship between racial wage gaps and prejudice.\n2 In this paper, we attempt to address this omission.\nIn the short-run version of Becker's employer discrimination model, racial prejudice causes some employers to regard black workers as more expensive than they truly are. Market pressures cause blacks to be hired by the least prejudiced employers in the market and to sort away from those with the highest levels of prejudice. In equilibrium, Becker shows that black relative wages are determined by the most prejudiced employer with whom they come into contact-the marginal discriminator. Racial wage gaps, in Becker's formulation, are determined by the prejudice of this marginal person, and not by the average level of prejudice among all employers. More generally, given the sorting mechanism described above and since blacks constitute a relatively small share of the labor force in almost every labor market, wage gaps will generally be determined by variation in the level of prejudice of those in the lower tail of the prejudice distribution; how prejudiced the most prejudiced employers are should not matter at all for wages in Becker's framework. Finally, since the ease with which blacks are sorted to less prejudiced firms varies inversely with the number of blacks in the market, with the level of prejudice held constant, equilibrium wages for blacks should vary negatively with the number of blacks in the market.\nDespite its sharp predictions, one possible reason that Becker's model's predictions about the connection between prejudice and wages have not been empirically tested is Arrow's (1972) famous criticism. Arrow argues that since prejudiced employers sacrifice profits by discriminating, such employers are ultimately driven from the market in 1 Some key explanations for discrimination that do not depend on racial prejudice include imperfect information in statistical discrimination models (Phelps 1972; Aigner and Cain 1977; Altonji and Pierret 2001) and racial difference in productivity (O'Neill 1990; Neal and Johnson 1996) . 2 Although there has been very little work in economics studying racial prejudice directly, two exceptions are Cutler, Glaeser, and Vigdor (1999) and Card, Mas, and Rothstein (2008) . Both of these papers study the relationship between prejudice and residential racial segregation but do not examine the wage relationships that are our focus.\nthe long run in a competitive setting. Indeed, Arrow memorably remarked that the employer discrimination model \"predicts the absence of the phenomenon it was designed to explain\" (192) . However, casual empiricism suggests that prejudicial feelings of the most odious sort were a feature of the American landscape for many scores of years, and logic dictates that these views have had something to do with racial discrimination against minorities. Moreover, Arrow himself and many subsequent authors have shown that the connection between prejudice and wages posited by Becker can survive in the long run if the market is not perfectly competitive, if there are important nonconvexities, or if there are informational problems. In other work (Charles and Guryan 2007) , we show that the relationship between racial distaste and wage gaps can even survive perfect competition, as long as prejudicial tastes are portable across labor market roles, that is, that prejudiced employers remain prejudiced when they shut down a firm and become prejudiced workers.\nSupporting the view that prejudice may matter for wage determination, consider figure 1, in which we relate the black-white wage gap in each of the nine census divisions to the mean response among whites in those divisions to two questions from the General Social Survey (GSS) about racial prejudice. The figure shows that blacks have much lower relative wages in places in which a higher fraction of whites report opposing interracial marriage or whites would not vote for a black president. These figures do not confirm that a mechanism like that outlined by Becker links prejudice and wages, but they are suggestive of such a relationship. 3 Our empirical work is motivated by two related questions. First, to what extent is the relationship between racial wage gaps consistent with the predictions of the Becker prejudice model? Second, how large a role does racial prejudice play in generating observed wage gaps? In our analysis we use the rich information on racial sentiments available in multiple waves of data from the GSS. We summarize this information on racial prejudice, describing its levels among different subgroups of whites and its evolution over time. In a series of analyses, we relate prejudice among whites in a state to the observed racial wage gap, using wage data from the Current Population Survey (CPS). The data provide overwhelming support for each of the predictions of Becker's model. 3 Further potential evidence about the possible importance of racial prejudice may be found in a widely known recent study by Bertrand and Mullainathan (2004) , who find that resumes with black-sounding names sent to potential employers received fewer callbacks than other resumes. Although statistical discrimination might account for these results as suggested by later results on naming conventions studied by Fryer and Levitt (2004) , the fact that so many personal traits of likely interest to employers are explicitly controlled for on the false resumes leaves open the possibility that some other force, such as racial prejudice, might be at work. First, we find that racial wage gaps are much more closely related to the level of prejudice of the \"marginal\" person in the distribution than they are to average levels of prejudice. We further show that it is only prejudice in the left tail of the prejudice distribution that seems to matter for wage gaps; wages do not vary at all with the prejudice of the most prejudiced persons in a state. Importantly, the foregoing results are from regressions that control for the racial makeup of states. Finally, we show that the fraction of a workforce that is black, with prejudice in the state held constant, is strongly negatively related to racial wage gaps, just as the prejudice model predicts.\nThese results are robust to a variety of robustness tests and extensions. On the whole, our results are broadly suggestive of an important role for racial prejudice among whites in explaining differential labor market outcomes by race. In a series of calculations, we show that about onequarter of the unconditional wage gap may be attributable to racial prejudice. We also show that the associated lifetime earnings costs borne by blacks in places in which the marginal white is more prejudiced are not small: the discounted cost of living in such areas is between $34,000 and $115,000, depending on the intensity of the prejudice of the marginal white in their states.\nThe remainder of the paper proceeds as follows. Section II briefly reviews Becker's employer racial distaste model. Section III summarizes the data used in the paper. Section IV presents the paper's main empirical results. In Section V we discuss the main alternative interpretation of our results-that prejudice is correlated with unmeasured racial skill differences-and present the results of our attempts to deal with this problem by directly controlling for skill quality differences and through the use of instrumental variables. Section VI presents conclusions."}, {"section_title": "II. Theoretical Overview: Becker's Employer Discrimination Model", "text": "Predictions from Becker's (1957) seminal work on employer prejudice are the foundation of the empirical analysis we conduct in this paper. In this section, we briefly review the key results from his basic model. We then discuss criticisms and extensions of the basic model that have appeared in the literature.\nThroughout his analysis, Becker assumes a perfectly competitive environment, with production that is constant returns to scale. To focus attention on demand-side considerations, white (a) and black (b) workers are assumed to be perfect substitutes in production. Employers are assumed to be white and are differentially racially prejudiced. Becker represents prejudice as a distaste for, or aversion to, cross-racial contact. Thus, an employer's utility, , depends both on his profit and on the V i number of blacks he employs, with each black worker he hires bringing him disutility of . Employer utility is therefore\nwhere is the employer's profit; and \nCondition (2) says that if an employer hires a particular type of labor at all, he does so up to the point at which its marginal product equals its marginal cost, as assessed by the employer. For white labor this marginal cost is the wage ; for black labor it is the wage of blacks plus w a the employer 's prejudice, or . This result captures the essence\nof Becker's insight: prejudice causes an employer to behave as if black workers' monetary wages are higher than they actually are. Since the two types of labor are perfect substitutes, (2) implies that an employer hires only white workers if his prejudice is such that and\nhires only black workers otherwise. These hiring rules mean that market pressures tend to sort prejudiced persons away from the object of their prejudice: for any given level of wages, blacks are hired by the least prejudiced employers in the market, and whites are hired by the most prejudiced. Equilibrium in the short run requires that the markets for white and black workers clear, at equilibrium wages and . Assuming a sufw* w* a b ficiently smooth distribution of prejudice, some employer will be just indifferent between hiring black and white workers. The prejudice of this \"marginal discriminator,\" , is in fact equal to the equilibrium d* i racial wage gap, since his being indifferent about the race of workers he hires at equilibrium wages implies\nEmployers more prejudiced than the marginal discriminator hire only whites; those less prejudiced than hire only blacks, and the markets d* i for both black and white workers clear in equilibrium.\nBecker's simple, competitive framework yields a number of sharp yet subtle predictions about prejudice and equilibrium racial wage gaps. The first is that the equilibrium racial wage gap is not determined by the average level of prejudice among all employers. The foregoing shows that black wages are determined by the prejudice of the most prejudiced employer with whom blacks interact in equilibrium. Since blacks are, in utility terms, cheapest to the least prejudiced employers, they are hired first by these employers. The most prejudiced employer who hires blacks-the marginal discriminator-has, in general, less prejudice than the mean prejudice among all employers in the market. Indeed, as seen in figure 2, the equilibrium wage gap might be zero if there are many prejudiced employers in the market, as long as the supply of blacks and Fig. 2. -Relationship between racial tastes and the relative wages and relative supply of blacks and whites. The figure shows how the equilibrium ratio of black to white wages responds to three sets of market conditions. When the relative supply of black workers is small relative to the number of unprejudiced employers, as is the case when supply is as depicted by , the marginal discriminator is unprejudiced and there is no racial wage S 1 gap in equilibrium. When the distribution of racial preferences among employers is held constant, a shift out in the relative supply of black workers (from to ) requires that S S 1 2 more prejudiced employers hire blacks, and the ratio of black to white wages falls from one to R. When the relative supply of black workers is held constant, an increase in prejudice among employers likely to be the marginal discriminator (which causes the relative demand curve to rotate from ABD to ), further reduces the equilibrium ratio ABD of black to white wages to . R the distribution of prejudice among employers are such that blacks can all be hired by totally unprejudiced employers. The foregoing suggests that if racial wage gaps were empirically related to the average and the marginal level of prejudice among employers, Becker's model predicts that only with the latter measure should there be a systematic relationship. The effort to test this proposition empirically is complicated by the fact that, even if the complete distribution of prejudice among employers were known, it is impossible to know ex ante which employer is the marginal one. Becker's original discussion does suggest one simple measure for the prejudice of the marginal employer that should hold under particular conditions. Specifically, if firms are of equal size and if p is the percentage of blacks in the workforce, the marginal employer's prejudice will be the pth percentile of the employer prejudice distribution. Of course, this measure of the marginal employer is an approximation and applies only under very specific conditions. Furthermore, this measure necessarily conflates the two things that determine the marginal employer: the number of blacks in the workforce and the distribution of prejudice among employers. Empirically, it might be attractive to separately assess the impact of each of these components of the marginal employer on the equilibrium wage difference.\nBecker's model yields sharp predictions about how wage gaps should be separately related to these two variables. The effect of an increase in the number of blacks on equilibrium wages, all else equal, is clear. When the distribution of employer prejudice is held constant, an increase in the number of black workers means that blacks will, in equilibrium, have to be sorted to ever more prejudiced employers, so that the marginal employer is ever more prejudiced. This is illustrated in figure 2 by a shift of the relative supply curve from to , reducing S S 1 2 relative wages from one to R. The equilibrium wage gap should thus be increasing in the number of blacks in the market, with employer prejudice held constant. The effect of a ceteris paribus increase in employer prejudice is more subtle and depends on where in the distribution of prejudice that increase comes from. Since market pressures sort blacks to the least prejudiced employers first, holding constant the number of blacks and increasing the prejudice of the most prejudiced employers in the market should not affect who the marginal employer is and thus should not affect the equilibrium wage gap. However, an increase in the prejudice of the least prejudiced employers while holding the number of black workers constant may make the marginal employer more prejudiced and thus increase the equilibrium wage gap. Such an increase in prejudice among those likely to be the marginal employer is illustrated in figure 2 by the rotation of the relative demand curve from ABD to , thereby reducing relative wages from R to . An increase in ABD R prejudice among the most prejudiced would cause the relative demand curve to rotate beginning beyond the point at which it intersects supply. In general, higher levels of prejudice in the right tail (higher percentiles) of the employer prejudice distribution should not affect equilibrium wages, whereas because of the sorting of blacks toward less prejudiced employers predicted by the model, relative black wages should fall as prejudice increases in the lower percentiles of the employer prejudice distribution.\nJointly, these predictions-(a) that the marginal employer matters more than the average prejudice for relative wage differences; (b) that the number (or fraction) of blacks in the workforce is negatively related to racial wage gaps, with prejudice held constant; (c) that prejudice in the right tail of the employer prejudice distribution should not matter for racial differences whereas higher prejudice in the left tail of the prejudice distribution should affect racial wage gaps; and (d) that the mechanism that generates these patterns is the tendency of the market to segregate blacks from the most prejudiced whites-are the key results forthcoming from Becker's basic employer prejudice discrimination model. Strangely, to our knowledge there have been no previous empirical tests of these predictions in the literature. We test for each of these predictions, with some modifications to be made clear below, in the empirical work to follow.\nBefore we turn to our empirical analysis, it should be noted that, despite the profound impact of Becker's model on the literature, sharp criticisms of the model have appeared over the years. Beginning with Becker himself, but most famously articulated by Arrow (1972 Arrow ( , 1973 , many authors have suggested that the equilibrium and predictions discussed above cannot hold in the long run under conditions of perfect competition. The usual argument is that in the short-run equilibrium discussed above, the firms less prejudiced than the marginal discriminator earn higher profits than their more prejudiced counterparts that choose to employ more expensive white labor. Since capital can move freely in the long run under perfect competition, unprejudiced firms will expand at the expense of their more prejudiced counterparts. Competition thus seems to ensure that prejudiced firms are driven out of the market in the long run. Racial wage gaps deriving from employer prejudice disappear in the long run, and the predictions about an empirical relationship between wage differences and prejudice discussed above do not hold.\nThe notion that employer prejudice is \"driven out of the market\" in the long run remains a staple of most textbook treatments of the employer prejudice model. 4 Yet recent work has shown that prejudicial tastes can lead to persistent racial wage gaps if there is some form of imperfect information (Black 1995) , imperfect competition, or adjustment costs (Lang, Manove, and Dickens 2005) .\n5 Goldberg (1982) models racial sentiment slightly differently than Becker, representing it not as a distaste for blacks but instead as nepotism, or favoritism toward whites. He shows that racial wage gaps, attributable to that type of prejudice, can survive in the long run. Elsewhere we have argued that prej-udice represented as in Becker's original formulation can survive in the long run in a perfectly competitive environment as long as the implicit, unrealistic assumption in most models that prejudice is not portable across roles (such as \"employer\" and \"coworker\") that agents play in the labor market is relaxed. 6 In all recent extensions showing how prejudice can survive long-run competition, the mechanisms originally discussed by Becker-the tendency of market pressures to sort blacks away from the most prejudiced persons, and the fact that the ease with which the market can do this varies inversely with the number of blacks in the market-remain the key determinants of prejudice-related wage gaps. They are thus the focus of our empirical analysis."}, {"section_title": "III. Data Summary", "text": "In this section we describe the data on racial prejudice used in the empirical analysis to test the predictions of the prejudice model. We summarize racial prejudice across different regions in the United States and across different population subgroups and the evolution of racial prejudice over the past 30 years"}, {"section_title": "Overview of Prejudice Data", "text": "The General Social Survey is our source of data on racial prejudice. We use data from multiple waves of the GSS to build a proxy for prejudice. In many survey years, this nationally representative data set elicited responses from survey questions about matters that are clearly strongly related to racially prejudiced sentiments. \"Prejudice\" is a nebulous construct, and the various questions posed in the survey over the years touch on the different dimensions along which racist sentiments might be manifest. In fact, over the approximately 30 years of GSS data used in the paper, respondents answered some 26 different questions relating to some aspect of racial feeling. A different subset of the full questions was asked each year, with no particular question asked in each year of the survey and with much variation in the total number of times a given question appears.\nOne concern with the GSS questions is that whereas all the questions touch on something having to do with racial feeling, some of them probably also reflect some other type of preference. The types of questions for which this concern is strongest are questions having to do with government policy. For example, in many years respondents were asked whether they believed that \"the government was obligated to help blacks.\" Persons with no feelings of racial animus whatever might still respond in the negative to this question because of their views about the appropriate role of government. Given the paper's aim, it is imperative that we focus on responses that have to do exclusively with racial sentiment. We therefore do not use any of the five questions touching on government policy and race in our analysis. For reasons discussed below, in part of the analysis we need to focus on a consistent set of prejudice questions from one year to the next.\n7 When necessary, we therefore focus on four questions that jointly appear most frequently in the survey.\nAppendix table A1 lists the GSS variable abbreviation and a summary for each of the full set of 26 racial prejudice questions asked in the survey. Most questions are in boldface. Those not in bold are the government policy questions we always exclude, and the questions marked with an asterisk are the set of four race questions asked consistently across the survey. Throughout, we use responses from whites aged 18 and older, and we recode responses so that higher values correspond to more prejudiced answers."}, {"section_title": "8", "text": "Much of our analysis involves comparing levels of prejudice across individuals and across geographic areas. To render these comparisons feasible, it is obviously necessary that we somehow combine the disparate prejudice responses into a unidimensional prejudice index. We do this by first creating an individual-level index for each GSS respondent and then by aggregating this individual-level index in various ways at the state and census division levels. The individual-level prejudice index is based on an average of responses to different GSS prejudice questions. To ensure that the response to each question is measured on the same scale and weighted equally in the index, we normalize the mean and standard deviation of each of the GSS prejudice questions. Then, for each GSS respondent, we compute the average of his or her normalized response to each question. Formally, let denote respondent i's response in year t to the park d it ticular prejudice question k. For each dimension of prejudice k and for each individual i we create a normalized individual response in year t given by\nit k\nwhere is the first year in which the prejudice question k was asked t* k in the GSS. The normalized measure thus subtracts off from individual responses to each question the mean of the responses to that question in 1977 and divides by the standard deviation of answers measured in the first year the question was asked. We normalize by the standard deviation in the first year the question was asked rather than, say, the overall standard deviation because we want to avoid a mechanical relationship between trends in responses and the weight the question receives in the overall aggregate. We choose 1977 as the normalization year because it was the year in which the largest number of prejudice questions were asked. Two prejudice questions (HELPBLK and RACOPEN in the table) were not asked in 1977 but were asked in both prior and subsequent years. A linearly interpolated mean is subtracted for these variables instead of the 1977 mean.\nThese normalized responses, which are all measured on the same scale, are then aggregated into a one-dimensional aggregate prejudice index for individual i in year t by taking their average in the year, or\nwhere is the number of prejudice questions asked in year t. K t To test the predictions of the prejudice model across different geographic regions, we use several measures of the prejudice among whites in a community. We compute aggregate measures of prejudice from , which is the residual from a regression of on a full set of year\ndummies. The first measure of aggregate prejudice in a communitydenoted \"average\" prejudice-is simply the mean across all years of for whites in a particular geographic area. Another set of measures D it captures prejudice at different percentile points in the overall prejudice distribution in a state. We use the 10th, 50th, and 90th percentiles of the distribution of within a state. Finally, we create an approximatioñ D it to the prejudice of the \"marginal\" white discriminator in the distribution. As noted in the theory overview, under specific conditions, the marginal is well approximated by the pth percentile of the distribution of prejudice, where p is the fraction of the workforce that is black."}, {"section_title": "9", "text": "Notice that since we use year-residualized individual prejudice tõ D it compute all the community-level prejudice indices, the downward secular trend in individual-level prejudice that we document below does not lead us to disproportionately weight recent observations when calculating indices that measure prejudice in the left tail of the distribution (i.e., the 10th percentile or the marginal)."}, {"section_title": "10", "text": ""}, {"section_title": "Summarizing Patterns and Trends in Prejudice in the GSS", "text": "Before turning to the regressions that are our main focus, we present some initial results about prejudice to provide the reader a sense of the data. Table 1 presents a series of regressions showing how key demographic traits are related to an individual's level of prejudice in the GSS. The table shows results for four outcomes: the individual aggregate prejudice index and unnormalized average responses to three of the specific prejudice questions from which the unidimensional aggregate index is constructed. The regressions are estimated on a pooled GSS sample across all years, and each regression controls for fixed year and state fixed effects. The standard errors presented in the table are clustered at the level of the state.\nThe regression for the aggregate prejudice index shows that prejudice exhibits a sharp age gradient, in that older whites are significantly more likely to report prejudiced sentiments.\n11 To give a sense of the magnitude of the estimate, a decade-older white in the sample is on average about 13 percent of an individual-level standard deviation (which is about 0.7) more prejudiced. The regression also shows that higher-educated persons and females are significantly less prejudiced. Four years of education are associated with a reduction in prejudice of about a third of 9 For the percentile measures (including the marginal), we use an aggregate index , D it which is constructed from the four consistent questions asked in the GSS. We do not use the full 26 questions when creating these percentile measures because the aggregate measure in that case is an average over responses to different numbers of questions in different years. The variance of the aggregate index based on the full 26 questions will tend mechanically to be higher in years in which a smaller number of questions happened to be asked. Statistics based on the tails of the distribution would disproportionately measure prejudice in those years in which a relatively small number of questions were asked.\nAll the results presented below are virtually unchanged if the average is computed using only the four questions that are consistently asked together throughout the GSS. 10 The results are virtually unaffected if aggregate prejudice measures are computed on the basis of rather than . Some of the point estimates are larger in specifications\nthat use as the base distribution, but a one-standard-deviation change in each case D it implies virtually the same effect.\n11 The regressions control for year effects, but the usual problem restrains us from making conclusions about whether the age gradient is driven by true age effects or cohort effects. a standard deviation, and females are around 5 percent of a standard deviation less prejudiced than males. When all the variables are jointly controlled for, women and the more highly educated are both found to be significantly less prejudiced, and the strong age gradient remains significant. These results for the specific prejudice measures are generally very similar to those for the aggregate index, with the notable exception that white women appear slightly more prejudiced than white men with respect to their opposition to interracial marriage. .60\n.68\n.73\nNote.-The top panel reports sample means for each of the nine census divisions. The possible answers to the questions in cols. 1 and 2 are 1 (yes) or 0 (no), whereas there are four possible answers to the question about residential segregation in col. 3: 1 (disagree strongly), 2 (disagree slightly), 3 (agree slightly), and 4 (agree strongly). The bottom panel reports coefficients and standard errors (in parentheses) for bivariate OLS regressions of the black-white wage gap in the census division on the measure of prejudice reported in the respective column.\nhighly correlated. 13 By each of the measures, racial prejudice is most severe in the southeastern portion of the country and least severe in New England and in the West. Prejudice is greatest in the East South Central division (AL, KY, MS, and TN) and next greatest in the South Atlantic (DE, DC, FL, GA, MD, NC, SC, VA, and WV) and West South Central (AR, LA, OK, and TX) divisions. Prejudice is least severe in New England (CT, ME, MA, NH, RI, and VT) and in the Pacific (AK, CA, HI, OR, and WA) and Mountain (AZ, CO, ID, MT, NV, NM, UT, and WY) divisions.\n14 Columns 4 and 5 of the table show the means for the aggregate prejudice index-first over the entire sample of whites in a region and then over a group of \"high-skilled\" (college graduate) whites, who might be more likely to be employers than the average person. Not surprisingly, the table reveals the same pattern of prejudice across regions as the separate prejudice questions. This is true for both the sample of all whites and the sample of the highly skilled, although the means show that, in any division, the highly skilled are less racially prejudiced than their less educated counterparts. 15 The difference in average prejudice across the various divisions is substantial. For example, between the East South Central and New England census divisions, the difference is on the order of 0.8 of an individual-level standard deviation. To put this difference in perspective, the median East South Central respondent has the same aggregate prejudice as the 81st percentile respondent from New England. The median-prejudiced New England respondent would be at the 26th percentile of the East South Central prejudice distribution. A graphical description of the cumulative distribution of prejudice across the various divisions is presented in Appendix figure A1 . Column 6 of the table shows the fraction of the workforce that is black in each census division. On the whole, the numbers indicate that blacks live disproportionately in regions of the country in which racial prejudice is most severe, on average. This pattern may indicate that prejudice is 13 To conserve space we obviously cannot show the same numbers for all the prejudice questions. It is reassuring that the basic patterns shown in tables 1 and 2 are found for other measures as well.\n14 It is possible that differences in answers to the GSS questions may not reflect differences in racial prejudice at all. Instead, racial feelings might be the same everywhere, but there are regional differences in people's willingness to be candid about their underlying racial sentiments. In our view, this argument brings up the question of why people in different places feel differentially obliged to hide their underlying racial sentiment. One could regard this willingness to be candid about racially insensitive feelings as itself indicative of the thing we have called prejudice. More important, notice that if there were no content to people's claims about their racial feelings, the GSS racial prejudice measures would basically be noise and there should be no systematic relationship between stated prejudice and wage differences, as our various analyses find. 15 The values for the univariate average prejudice measure are generally negative. The reason is that this measure is based on normalized measures described above, and all measures of prejudice have been declining since 1977.\ncaused in part by cross-racial contact and by competition for economic resources.\nUsing the individual prejudice measures, we earlier showed graphically that black wages are relatively lower where prejudice is higher. The regression results presented in the last two rows repeat this finding and also show that racial wage gaps are larger where whites are more prejudiced according to the aggregate prejudice index. 16 At best, these patterns are merely suggestive about the causal connection between prejudice and wages suggested by Becker's model. Also suggestive is the fact that, although the correlation is weaker, the fraction of a workforce that is black is also correlated with the level of the black-white wage gap. The analysis below tests more carefully whether the patterns of prejudice and wage gaps fit the subtle patterns suggested by the theory. In that work, we address such issues as the fact that prejudice indices might be correlated with unobserved regional differences in productivity between black and white workers.\nBefore turning to the main analysis, we show how prejudice has varied over the time period we study. Figure 3 shows trends in responses to the nine most commonly asked GSS prejudice questions (excluding, as noted earlier, those having to do with government policy), averaged across the entire sample of whites. As described above, each question is normalized so that the mean response in 1977 is zero, and the standard deviation in the first year it was asked is one. The average response among whites to each question has declined steadily over the past 30 years. The figure reveals a general downward trend in each reported measure of racial prejudice, although there is substantial variation in the magnitudes of these declines. Declines are very small for an objection to sending one's children to school with blacks and quite large for responses about whether blacks should \"push where they are not wanted.\" Figure 4 shows trends over time in the unidimensional aggregate prejudice measure, plotted separately for each census division. Two key things should be noted about the figure. First, the decline in measured prejudice has been widespread. Between 1977 and 1996, measured prejudice declined in each of the nine census divisions. Second, the relative ranking of average levels of prejudice across regions has been constant over time. New England and the Pacific and Mountain divisions were the least prejudiced regions throughout the period under study, whereas the East South Central and South Atlantic divisions were consistently the most prejudiced, according to our index. There also appears to have 16 Because our aggregation method treats all prejudice responses equally, the measures used in the paper do not make ad hoc judgments about which specific prejudice questions better reflect true underlying racial prejudice. In effect, our use of equal weights takes a \"hands-off\" approach to the available data. been some convergence across census divisions in the level of measured prejudice between the early 1970s and the mid-1990s, though the amount of convergence is sensitive to the choice of endpoint. On the whole, these time-series patterns suggest that the data permit us to speak confidently only about differences in prejudice across regions rather than differences over time in the relative declines in prejudice across spatial areas. "}, {"section_title": "IV. Base Empirical Results", "text": "To estimate the relationship between relative black wages and regionlevel measures of prejudice, we merge the prejudice indices described above with CPS data. We combine the May monthly supplement from 1977 and 1978 with the Merged Outgoing Rotation Group (MORG) files from 1979 to 2002. 17 The sample includes full-time black and white males aged 16-64. In the analysis, we take states to be separate labor markets and make the implicit assumption that black workers cannot costlessly move to equilibrate racial wage gaps. Our basic specification could be estimated in two alternative ways. One option would be to estimate an OLS regression of log wages on education, a quadratic in potential experience, race-specific year dummies, a black dummy, the 17 See, e.g., Autor, Katz, and Kearney (2005) or Lemieux (2006) for a discussion of the merits of the May and MORG files for measuring wages. We follow Autor et al.'s sample restrictions, dropping those with real hourly wages below the real value of the 1982 minimum wage or with nominal wages above top-code levels. Top-coded responses are replaced with 1.5 times the top-code value. All values in the paper are given in year 2000 dollars. We thank David Autor for sharing his programs with us.\nThe analysis below requires state-level wage gaps. State is not consistently reported in the May CPS until 1977. For the earlier analysis at the census division level, we also use data from the 1973-76 May CPS.\naverage prejudice for the state, and the interaction between the particular prejudice measure and a black indicator variable. The coefficients of interest would be the estimated effect on the interaction terms. In the case of the average, for example, an estimated negative coefficient would indicate how much lower black wages are relative to those of whites in states with higher average prejudice. The drawback of this method is that because the various prejudice indices vary only at the level of the state, this procedure might underestimate standard errors, even if the regressions were clustered at the level of the state.\nAn alternative method, which deals with this potential standard error concern, is executed in two steps. First, we estimate the residual blackwhite wage gap in each state. Specifically, we estimate by OLS the log wage regression described above but leave out the prejudice index and include a separate black dummy variable for each state. The estimated effects on each of these black dummy variables become the dependent variable in the second step, which is weighted by the precision with which we estimate the state wage gap in the first step. In this secondstep regression, one or more of the labor market prejudice indices are the independent variables of interest. The second-step regression has approximately 45 observations and therefore produces conservative standard error estimates.\n18 Table 3 presents the main results. The regressions in the table assess whether the adjusted racial wage gaps across states vary with alternative measures of prejudice and with the racial makeup of those states in a manner predicted by the Becker prejudice model reviewed earlier. The table and most that follow report point estimates and standard errors for the average, median, 10th, and 90th percentiles of the white prejudice distribution; the fraction of the workforce that is black; and the approximation to the \"marginal\" level of prejudice described earlier and given by the pth percentile of the prejudice distribution, where p is the percentage of the state workforce that is black.\nColumn 1 shows the pairwise relationship between the black-white wage gap and the average prejudice among whites in a state. These statelevel results show a weaker relationship between wage gaps and average prejudice than the earlier results shown at the census division level. The point estimate is negative, suggesting that black wages are relatively lower in states with higher average prejudice, but the relationship is not statistically significant. In contrast, the pairwise relationship between the black-white wage gap and the prejudice of an approximation of the \"marginal\" white in the labor market, shown in column 2, is striking. As the Becker model predicts, the regression shows that states in which Note.-The table reports coefficients (standard errors) from OLS regressions of residual state-level black-white wage gaps on various measures of prejudice among all whites (the mean of the black-white wage gap across states is Ϫ0.123, and the standard deviation is .044). Residual black-white wage gaps are estimated using 1977-2002 May/MORG CPS data and control for education, a quadratic in experience, race-specific year effects, and state effects. Data from 1973-76 are dropped because the CPS reports states in groups in those years. States are dropped if they are not sampled in the GSS in the years necessary to measure the marginal index of prejudice. The \"marginal\" is the pth percentile of the prejudice distribution of the relevant population of whites, where p is the fraction of the population that is black. See the text for details. the marginal white is more prejudiced have substantially larger racial wage gaps. The standard deviation of \"marginal\" prejudice across states is 0.139. The estimated effect therefore implies that a one-standarddeviation increase in prejudice is associated with relative black wages that are 0.028 log points lower-about 23 percent of the mean residual wage gap across states. The result is estimated precisely enough to reject a zero correlation at conventional significance levels.\nBecker's model suggests more than that these variables should independently be systematically related to wage gaps. If prejudice matters as the model predicts, then measured wage gaps should be related to the marginal and not the average when the two measures are included jointly in a regression. Column 3 of the table reports the results of this specification. The results show that, when the average level of prejudice is held constant, the estimated effect of marginal prejudice among whites is negative, strongly statistically significant, and larger in absolute value than the pairwise estimate in column 2. That the correlation of the wage gap with the marginal is stronger than with the average is precisely as Becker's prejudice model predicts. The sorting of blacks away from the most prejudiced white employers implies that the wage gap is determined on the margin by the racial tastes of individuals in the lower portion of the prejudice distribution.\nVariation in the marginal level of prejudice among whites across states comes from two sources: differences in the number of blacks across the states and differences in the distribution of prejudice across states. As discussed earlier, the prejudice model implies that the fraction black should have an independent negative effect on relative black wages. If the model is correct, with the level of prejudice held constant, the larger the number of blacks in a region, the more likely it is that blacks are sorted to ever more prejudiced employers. Thus, whereas the results in column 3 show that wage gaps load onto the average and not the marginal, a better assessment of how the model's predictions fit the data is forthcoming from the regression in column 4, in which we relate racial wage gaps simultaneously to the average, the marginal, and the fraction black of the workforce in the state.\nThe results show that the fraction of blacks in the state's workforce is strongly negatively related to the wage gap, as predicted. At the same time, we find that when the number of blacks is controlled for, the point estimate for the marginal is about 60 percent as large but remains very strongly statistically significant and has the sign predicted by theory. That the estimated effect for the marginal is smaller than the estimates in columns 2 and 3 is as expected since, as noted in the discussion of figure 2, variation in the marginal is driven partly by the number of blacks in the state. The fact that we continue to find a strongly statistically significant negative effect of the marginal after directly controlling for percent black suggests that variation in prejudice in the part of the distribution near the pth percentile of the state's prejudice distribution is negatively related to wages. Finally, the regression shows that the estimate of the effect of average prejudice is positive and not statistically significant."}, {"section_title": "19", "text": "One criticism of our interpretation-that the estimate of the marginal conditional on fraction black reflects the effect of variation in prejudicial tastes-is that the measure of the marginal might pick up direct nonlinear effects of fraction black. If so, controlling for fraction black linearly will not remove all the variation of the marginal that is attributable to state racial makeup. To assess the importance of this issue, we estimate the effect of the marginal controlling for fraction black nonlinearly. These various estimates are shown in Appendix table A3. Column 1 presents the base specification, which includes average and marginal prejudice, along with linear fraction black. Columns 2-4 include increasingly higher-order polynomial terms in fraction black. The marginal is significant in each case, about 9 percent smaller in magnitude and fairly consistent as we allow fraction black to go from quadratic to quartic. Column 5 shows results from a less parametric specification in which we control for a set of dummy variables for different categories of fraction black. Again, the estimated effect of the marginal is statistically significant and is almost identical in magnitude to the base specification with a linear fraction black control. These results suggest that the marginal is not picking up nonlinear direct effects of fraction black.\nRather, it appears that the variation in the marginal after controlling for percent black represents variation in prejudice.\nTaken together, the results in columns 1-4 of table 3 are strongly consistent with the predictions of Becker's prejudice model. However, these results do not constitute the sharpest possible associational tests of the model's prediction. For one thing, our measure of the marginal is an approximation to what the true marginal likely is in a state. Moreover, as discussed in the theory overview, Becker's model yields sharp predictions about how wage gaps should be affected by prejudice in a particular part of the prejudice distribution but not by prejudice at other points.\nIn column 5 we relate state-level wage gaps to the level of prejudice at the 10th, 50th, and 90th percentiles of the overall prejudice distribution. The results are striking. We find a large, significant, negative effect of prejudice at the 10th percentile. The estimated effects imply that the median and 90th percentiles of the prejudice distribution have no effect on relative black wages. The results in column 6 of the table are even more striking. When we control for the fraction of the state workforce that is black in addition to the three percentile points in the prejudice distribution, the effect of the 10th percentile prejudice is still negative and strongly statistically significant. Prejudice at the median and 90th percentiles is again estimated to have no effect on state-level racial wage gaps. The larger standard errors for the 10th percentile effect derive directly from the fact that there is significantly less variation in the 10th percentile of prejudice than at the 50th or 90th percentile. It is noteworthy that, although most of the cross-sectional variation in levels of prejudice across areas comes from differences in the prejudice of the most prejudiced whites, it is variation in prejudice of less prejudiced whites in an area that is related to the area's racial wage gaps. 20 20 The relative differences in variation across different percentiles of the prejudice distribution can be seen in App. fig. A1 . This figure understates, however, the absolute amount of state-level variation at each of the percentiles because it shows the cumulative distribution function at the census division level.\nFinally, in this regression the fraction of the state workforce that is black has a strongly negative and statistically significant effect."}, {"section_title": "21", "text": "These results are strongly consistent with the predictions of the prejudice model. It is worth emphasizing that they say much more than that \"black wages are lower in places where whites are more prejudiced.\" The fact that in a regression in which they are jointly controlled for, prejudice among the least prejudiced whites in an area matters for relative black wages whereas that of the most prejudiced whites has no effect at all, combined with the fact that the fraction of the state workforce that is black varies in a negative and statistically significant way with relative black wages, suggests that only a mechanism of the sort first outlined by Becker can reconcile these facts. 22 Indeed, the higher variance found in prejudice at the right tail and illustrated in Appendix figure A1 might have led one to speculate that right tail prejudice would be found to matter more empirically. That it does not makes the results all the more striking."}, {"section_title": "23", "text": "On the whole, the estimates suggest that taste-based prejudice plays an important role in generating observed racial wage gaps. Consider a change in the 10th percentile of prejudice of the magnitude of the interquartile range across states-something that corresponds in our data to moving from California to Kentucky. The interquartile range of the 10th percentile white prejudice is 0.064. The point estimate in column 6 of table 3 implies that, with fraction black in the workforce held constant, this variation in prejudice is associated with a 1.9-percentagepoint decline in black wages relative to white wages. The interquartile 21 As discussed above, we argue that it is the distribution of prejudice among whites that determines relative black wages and not prejudice among persons who, at a point in time, happen to be playing the role of labor market employer. Nonetheless, we estimate a version of table 3 but with prejudice measured among the set of people who are likely to be employers-those with high skill. When the various measures are constructed from the sample of whites with at least some college training, we find results very similar to those shown in table 3. The results are presented in App. table A2. 22 In the wage context, only prejudice in the left tail matters because racial interactions are mediated by a price mechanism operating in a market context. We would not expect a similar prediction in situations in which the racial outcomes are determined not by a market but rather by some other mechanism, such as a vote. In fact, as one example, we find that the log public welfare spending per black in a state (measured in 1978, 1987, or 1996) is significantly negatively related to the 90th percentile of prejudice in the state but not to the median or 10th percentile. To the extent that policies that benefit blacks relative to whites are determined by the median level of prejudice or prejudice in the right tail, it is more likely that the patterns we see in the wage regressions are driven by variation in prejudice rather than by unobserved omitted factors. 23 We have experimented with including other percentile points of the prejudice distribution, such as the 25th and 75th percentiles. Although not shown, these regressions show the same thing as the results in col. 5 of table 3: only prejudice in the left tail of the prejudice distribution (such as the 10th or 25th percentile) varies in a negative and statistically significant way with relative black wages. Prejudice in the right tail consistently has no effect on the racial wage gap. range of percent black across states is 11 percentage points; a change of this magnitude is like moving from Wisconsin to Tennessee in our data. The point estimate in column 6 therefore implies an additional 3.3-percentage-point decline in black relative wages. These two estimates imply that the mechanism by which prejudice affects racial wage gaps according to Becker's model accounts for a 5.2-percentage-point reduction in average relative hourly wages for black workers. This change is about 25 percent of the unconditional black-white wage gap during the 30 years we study. While our results point to an important role for prejudice, they also suggest that other factors, such as unobserved skill differences, school quality differences, and statistical or other forms of discrimination, collectively likely explain around three-quarters of unconditional wage gaps.\nThough prejudice explains only a significant minority of the blackwhite wage gap, the related costs borne by blacks relative to whites are economically large. Consider an 18-year-old black male choosing between two states in which the marginal white is differentially prejudiced. Our estimates imply that if he lives in Florida rather than in Massachusetts-the states that represent, respectively, the 75th and 25th percentiles of the marginal prejudice distribution-the net present value of his earning will be about $34,000 smaller. If he lives in Mississippi rather than in Wisconsin-the states that represent, respectively, the 90th and 10th percentiles of the marginal prejudice distribution-his discounted earnings are about $115,000 smaller."}, {"section_title": "24", "text": "In the next section, we address the two concerns that might lead us to question the conclusion that the patterns in table 3 reflect what could be termed the causal effect of prejudice and racial composition on racial wage gaps."}, {"section_title": "V. Extensions: Accounting for Endogenous Preferences and Racial Composition", "text": "On the whole, the results presented in table 3 are strongly supportive of all the predictions of the prejudice model of wage discrimination. But can a causal interpretation be given to these results? The obvious specific concern here is that regions with more severe measured prejudice or higher numbers of blacks also have other unobserved characteristics that negatively affect black wages more than white wages.\nThough the regressions we have discussed thus far control for a rich set of fixed effects and the most obvious suspects, such as differences in education levels, there are always other possibilities. One example is that some determinant of labor market outcomes, such as unobserved school quality (not quantity), could be correlated with prejudice levels."}, {"section_title": "25", "text": "In fact, this reduced school quality could be a direct result of prejudice, as the important historical example of segregated schools illustrates. A second possibility is that unobserved racial skill differences, as might be measured by the black-white test score gap, could be correlated with prejudice. The patterns we have documented could result from unobserved skill differences of this sort even if there were no direct effect of prejudice on wages in the labor market. The other type of potential endogeneity concern in table 3 is the fact that the fraction of a workforce that is black may be related to some unobserved determinant of wages. Potentially magnifying both of these concerns is that in the regressions we have presented thus far, much of the variation in the data comes from comparisons between the southern states and the rest of the country. Anything peculiar about labor market institutions or skill levels in the South relative to the rest of the country could thus possibly explain our results. Of course the ideal way to address any potential concern about the endogeneity of prejudice and of the fraction of a state workforce that is black would be to find valid instruments for these variables. In the case of the various percentile measures of the prejudice distribution, we do not have and cannot conceive of an instrument that could, for example, generate plausibly exogenous variation in the 10th percentile of the prejudice distribution but not in the 90th, or vice versa. To deal with any potential endogeneity of these measures, we therefore adopt the approach of collecting information on the factors for which there is the greatest concern that prejudice is correlated at the state levelmeasures of skill quality in the state.\nTables 4 and 5 present the results from directly controlling for racial skill differences. In table 4 we reestimate the base results in table 3 but add controls for the state-level racial difference in mean National Assessment of Educational Progress-Long Term Trend (NAEP-LTT) math and reading scores. 26 These measures of racial skill differences have the 25 Notice that it would not cause a bias if school quality were relatively lower for both blacks and whites since we include state effects, unless the effect of school quality on wages differed by race. 26 The NAEP-LTT is a standardized test administered to U.S. students and is designed to measure trends and cross-sectional patterns in educational performance. It is sometimes referred to as \"the Nation's Report Card.\" Since 1971, students of age 9, 13, and 17 have been randomly selected and tested in mathematics and reading. Each subject is tested approximately every 4 years. The content tested by the NAEP-LTT has remained unchanged so that comparisons over time can be made. We use a restricted-use version of Note.-The table reports coefficients (standard errors) from specifications similar to those in table 3, adding controls for racial difference in standardized test scores. The test score control is the difference in average z-score from the NAEP-LTT math (1978-2004) and reading (1971-2004) tests. The mean of the black-white wage gap across states is Ϫ0.123, and the standard deviation is .044. expected sign, and the wage gap appears to be more significantly related to gaps in reading than in math skills. Somewhat surprisingly, though, we find that adding these controls for the full set of states in the sample leaves the main qualitative results virtually unchanged. We continue to find that the measure of the marginal level of prejudice is more closely related to the racial wage gaps than the average, that the lower parts of the prejudice distribution matter whereas the right tail matters little if at all, and that the fraction of the state workforce that is black is always strongly negatively related to relative black wages.\nIn table 5, we use another indicator of latent skill differences by race. In their paper on relative school quality, Card and Krueger (1992) collect information on the student/teacher ratios for various cohorts of students in 18 southern states. We use these reported ratios for the cohort born between 1940 and 1949 as a measure of possible racial skill the NAEP-LTT that has state identifiers and individual data. For each student, we transform math and reading scores into a z-score (mean zero, standard deviation of one) and then compute state-level differences in average z-scores by race, computed over the full sample of years (1971-2004 for reading, 1978-2004 for mathematics). The NAEP-LTT was also administered in mathematics in 1973, but we do not have state identifiers for those data. Note.-Panel A of the table restricts the sample to the 17 southern states plus Missouri, the set of states for which Card and Krueger (1992) collected school quality measures. Panel B also restricts to the same 18 states and adds a control for the white-black pupil/teacher ratio in the state as reported in Card and Krueger's study. The mean of the black-white wage gap across states is Ϫ0.123, and the standard deviation is .044."}, {"section_title": "differences.", "text": "27 Importantly, the analyses reported in this table are restricted to southern states. There are two panels in the table. In panel A, we simply reestimate the set of regressions shown previously, but only on the sample of southern states. Notice that the basic patterns found in the full sample are found within this specific set of states as well. Wage gaps are more closely related to marginal than average prejudice; 27 Card and Krueger (1992) report black and white pupils per teacher for each of four cohorts. The results are substantively the same if the relative pupils per teacher for 1910-19, 1920-29, or 1930-39 are instead used as controls. Note.-The table reports coefficients (standard errors) from two-stage least squares regressions of residual state-level black-white wage gaps on various measures of prejudice among all whites. Fraction black in the state estimated in the 1920 Census is used as an instrument for the contemporaneous fraction black, and an alternative marginal based on the fraction black in 1920 is used as an instrument for the contemporaneous marginal. The mean of the black-white wage gap across states is Ϫ0.123, and the standard deviation is .044. the marginal is significantly negatively related to relative black wages, even conditional on average prejudice and fraction black; and wage gaps are significantly related to the 10th percentile of the prejudice distribution but not to the median or the 90th percentile, conditional on fraction black. Panel B repeats the analysis above but adds the CardKrueger measure of black-white relative school quality to each regression. The strong similarity between these results and those presented earlier is quite striking. The results indicate that our results do not appear to be driven by unobserved differences between the South and the rest of the country. They also show that when we control for a widely regarded measure of school quality (and thus skill) differences within the South, key results remain basically qualitatively unchanged.\nWe turn next to the possible endogeneity of the fraction black variable in the various regressions. Table 6 presents instrumental variables estimates in which we instrument for the fraction black during the time period we study with the fraction black in the state workforce in 1920. For columns 2, 3, and 4, the results are for regressions in which we instrument the marginal using an alternative measure of the marginal based on the fraction black in the state workforce in 1920 and the distribution of prejudice from the GSS sample period.\n28 These historical population shares are obviously correlated with the number of blacks currently living in a state. In effect, the instrumental variables strategy isolates and uses only that variation in the current racial makeup of a state attributable to the historical accident of where blacks were located 8 decades ago. To the extent that this historical racial makeup of states is independent of current determinants of wages, the estimates are purged of the endogeneity concerns from recent migration. The table shows that this measure for the marginal yields results that are strikingly similar to the baseline results. We stress that we cannot reject the possibility that a state's historical racial makeup is correlated in some way with factors that determine wages nearly a century later, but the results raise confidence that the results we are estimating really reflect the effect of the marginal discriminator being drawn from a higher point in the distribution of prejudice rather than some correlation between unmeasured productivity and current racial composition. The results in column 6 are probably even more convincing. In these regressions we include the different percentile measures and simply instrument for the fraction black. Again, the results are qualitatively almost identical to the main results presented earlier.\nIn summary, we believe that these results taken together strongly support the results presented in the previous section and suggest that the relationship we document between relative wages and both the prejudice in a state and the fraction of the state workforce that is black derives causally from the mechanisms described in Becker's prejudice model."}, {"section_title": "Examining the Role of Workplace Segregation", "text": "Before concluding, we present one final set of results assessing the relationship between workforce racial segregation and racial wage gaps. In the review of the model, we stressed that a key point of Becker's reasoning is that the degree to which racial wage gaps are observed in equilibrium will depend on the extent to which the market can be segregated by race. The only data that we could find about the extent to which whites interacted with blacks at work-the dimension of segregation most relevant for thinking about the effect of contact discrimination-come from the 2000 wave of the National Education Longitudinal Study of 1988 (NELS). NELS respondents were asked what fraction of their coworkers were of the same race as they. 29 The NELS population is relatively young in 2000, but this information about workplace segregation will be closely related to what is true of whites overall 29 Specifically, people were asked, \"What percentage of the people in your present/most recent workplace are of the same race as you?\" 7 shows that, consistent with the theoretical discussion, the racial wage gap is significantly larger the more integrated whites are with blacks at work. In the absence of the mechanism we emphasize, one might have guessed that labor markets in which blacks and whites are well integrated are likely places in which blacks and whites are more generally treated equally. In columns 2 and 3, we add, in turn, controls for the average and marginal prejudice in the state. In the specification that controls for average prejudice, racial integration at work remains strongly statistically significant. It is very striking that column 3 shows that the estimated effect of the segregation measure falls by about half and is statistically insignificant when only the marginal is included in the regression. That there is no such comparable reduction when only average prejudice is added to the regression suggests that, as we have argued throughout, who the marginal discriminator turns out to be is determined to a large degree by how much segregation is possible in the labor market. In columns 5 and 6, we include the various percentiles of the prejudice distribution and find that black relative wages are significantly negatively related to the degree of work-place integration conditional on the full distribution of prejudicial tastes and the fraction black in the workforce in the state. The fact that the effect of workplace integration falls more when the marginal is controlled for than when the percentiles of the prejudice distribution and percent black are included argues further that a mechanism linking wages and prejudice, operating through the market's ability to separate races at work, determines the racial wage gap, as we have argued throughout."}, {"section_title": "VI. Conclusion", "text": "Our primary goal in this paper has been to empirically test the sharp but subtle predictions about the relationship between community-level prejudice and racial wage gaps implied in Becker's seminal model of employer discrimination. To our knowledge, no previous paper in the large literature on discrimination has attempted to do this.\nWe motivate our analysis by first reviewing the short-run version of Becker's classic model, from which the predictions that are central to our analysis come. We then discuss criticisms by Arrow and others, arguing that those predictions cannot hold in the long run under standard competitive assumptions. We point out that this interpretation has become the standard discussion in most textbook discussions of employer prejudice, despite the fact that recent work by various authors, including previous work of ours, has shown that prejudice can indeed survive in the labor market in the long run.\nUsing rich data on prejudice from multiple years of data from the General Social Survey, we summarize both the cross-sectional variation and trends over time in racial prejudice among whites. We document significant variation in prejudice across different regions of the country. We also show that while reported prejudice has declined significantly everywhere over the past 30 years, the magnitude of that decline has been fairly consistent across regions, though there is some evidence of convergence.\nIn our main empirical analysis, we test for, and confirm, a series of key predictions from the standard Becker model. First, we show that racial wage gaps are much more closely related to the level of prejudice of the \"marginal\" person in the distribution than they are to average levels of prejudice. Even more striking, we show that it is only prejudice in the left tail of the prejudice distribution that seems to matter for wage gaps; wages do not vary at all with the prejudice of the most prejudiced persons in a state. This is precisely as the Becker model predicts. Finally, we show that the fraction of a workforce that is black is strongly negatively related to racial wage gaps-again, just as the prejudice model predicts. We conduct a variety of robustness tests, in-cluding instrumental variables estimates and regressions in which we control directly for skill differences across regions that might be an alternative explanation for our results. Our key results are robust to all these extensions.\nIn our view, the paper's various results point to an important role for racial prejudice in wage determination for minorities. Clearly, much more work, both on the theoretical front and with respect to empirical analysis, needs to be done in order for us to have a better sense of the ways in which prejudice operates and the effect it has on wages. For example, we have analyzed a particularly simple form of racial animus: an aversion to cross-racial contact. In this we follow Becker, who assumes that this is the form that racial prejudice takes. However, racial animus can take other forms that might be relevant for wage determination. Explicit theoretical analysis of alternative formulations of prejudice is an obvious next step for future work. In addition, an important area for future work would be to assess how racial prejudice, perhaps through its effect on wages, affects other important outcomes such as migration or occupational choice.\nOur various results suggest that racial prejudice among whites accounts for as much as one-fourth of the gap in wages between blacks and whites. This is a significant share and is associated with a present discounted loss in annual earnings for blacks of between $34,000 and $115,000, depending on the intensity of the prejudice of the marginal white in their states. However, the fact that three-quarters of the racial wage gap appears not to be the result of prejudice suggests that the other mechanisms posited in the literature such as statistical discrimination and human capital differences indeed matter very importantly for racial wage determination. Note.-The table lists each of the 26 questions from the GSS used to measure prejudice. The four questions marked with an asterisk were asked in the 1972, 1977, 1985, 1988, 1989, 1990, 1991, 1993, 1994, and 1996 waves of the GSS. We use these four questions to construct the prejudice indices that vary within region over time, as well as the indices of the marginal discriminator's prejudice and the various percentile measures of prejudice. In all but one case, the variable name is the same as the one listed in the GSS codebook. RACPEERS is based on three variables (RACFEW, RACHAF, and RACMOST), which ask \"Would you yourself have any objection to sending your children to a school where [a few/half/most] of the children are blacks?\" Some of the descriptions are the verbatim questions asked in the survey, and others are paraphrased to save space. Questions were asked in various years of the GSS. Note.-The table reports coefficients (standard errors) from specifications similar to those in table 3, but where the prejudice indices are computed using only high-skilled whites (i.e., those with at least a college education). The mean of the black-white wage gap across states is Ϫ0.123, and the standard deviation is .044. Note.-The table reports OLS regressions that test whether the index of marginal prejudice is robust to nonlinear controls for fraction black. Column 1 reports the base specification that is also shown in col. 4 of table 3. Columns 2-4 add polynomials in fraction black of increasingly higher order. Column 5 replaces the linear fraction black control with a set of mutually exclusive dummies based on categories of fraction black. The mean of the black-white wage gap across states is Ϫ0.123, and the standard deviation is .044. "}]