[{"section_title": "Abstract", "text": "WHAT'S KNOWN ON THIS SUBJECT: Many studies have shown an association between the amount of television-viewing and obesity; evidence is accumulating to link insufficient sleep to obesity, and some studies have shown an inverse association between frequency of family meals and obesity.\nPreschool-aged children exposed to 3 household routines of regularly eating dinner as a family, obtaining adequate nighttime sleep, and having limited screenviewing time had an ϳ40% lower prevalence of obesity than children exposed to none of these routines. abstract OBJECTIVE: To determine the association between the prevalence of obesity in preschool-aged children and exposure to 3 household routines: regularly eating the evening meal as a family, obtaining adequate sleep, and limiting screen-viewing time. METHODS: We conducted a cross-sectional analysis of a nationally representative sample of ϳ8550 four-year-old US children who were assessed in 2005 in the Early Childhood Longitudinal Study, Birth Cohort. Height and weight were measured. We assessed the association of childhood obesity (BMI Ն 95th percentile) with 3 household routines: regularly eating the evening meal as a family (Ͼ5 nights per week); obtaining adequate nighttime sleep on weekdays (Ն10.5 hours per night); and having limited screen-viewing (television, video, digital video disk) time on weekdays (Յ2 hours/day). Analyses were adjusted for the child's race/ethnicity, maternal obesity, maternal education, household income, and living in a single-parent household. RESULTS: Eighteen percent of children were obese, 14.5% were exposed to all 3 routines, and 12.4% were exposed to none of the routines. The prevalence of obesity was 14.3% (95% confidence interval [CI]: 11.3%-17.2%) among children exposed to all 3 routines and 24.5% (95% CI: 20.1%-28.9%) among those exposed to none of the routines. After adjusting for covariates, the odds of obesity associated with exposure to all 3, any 2, or only 1 routine (compared with none) were 0.63 (95% CI: 0.46 -0.87), 0.64 (95% CI: 0.47-0.85), and 0.84 (95% CI: 0.63-1.12), respectively. CONCLUSIONS: US preschool-aged children exposed to the 3 household routines of regularly eating the evening meal as a family, obtaining adequate nighttime sleep, and having limited screen-viewing time had an ϳ40% lower prevalence of obesity than those exposed to none of these routines. These household routines may be promising targets for obesity-prevention efforts in early childhood. Pediatrics 2010;125: 420-428"}, {"section_title": "", "text": "Despite interest in halting the childhood obesity epidemic through prevention efforts begun early in life, 1,2 little is known about what approaches in early childhood are both acceptable to families and effective. 3, 4 An increasing number of young children are in child care settings, 5 but preschool-aged children still spend the majority of their waking hours under the care of their parents, 6 who have a large influence over many of the environmental factors that affect a child's risk of obesity. 7 Although parents have great potential to prevent childhood obesity, engaging them in this effort is challenging. Mothers may not perceive that their overweight preschool-aged children are overweight [8] [9] [10] and often feel that clinical counseling about children's weight criticizes their parenting abilities. 11, 12 Furthermore, during the preschool years, parents are often less concerned about their children's physical health than about their development. 13 As a consequence, many parents may be more interested in learning how they can help their children succeed in school and get along with others than about how to help their children maintain a healthy weight. Given this clinical context and the lack of experimental evidence to support specific obesityprevention strategies in early childhood, a potential approach is to encourage parents to adopt household routines that satisfy the following criteria: the routines (1) may offer protection against the development of childhood obesity, (2) may offer nonweight-related benefits, such as promoting children's social, emotional, and/or cognitive development, and (3) are unlikely to cause harm. 14 Three of the most studied household routines that meet these criteria are regularly eating family meals, obtaining adequate sleep, and limiting screen-viewing time. Interventions to reduce television-viewing time in preschool-aged children have been implemented successfully, 15, 16 and such interventions have been demonstrated to have beneficial effects on children's BMI; [16] [17] [18] observational studies have shown that higher BMI in children is associated with insufficient sleep [19] [20] [21] [22] [23] [24] and a lower frequency of family meals. 25, 26 In addition to their potential to prevent obesity, each of these routines has been associated with nonweight-related benefits to children's well-being. [27] [28] [29] However, we are aware of no studies that have examined the association between the combination of these routines and obesity in preschool-aged children.\nBy using data collected in 2005 on a nationally representative sample of US 4-year-old children, we examined the prevalence and cross-sectional association between obesity and a combination of 3 household routines: regularly eating the evening meal (dinner) as a family; obtaining an adequate amount of nighttime sleep; and limiting screenviewing time (television/video/DVD)."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Sample and Study Design", "text": "We analyzed data from the Early Childhood Longitudinal Study, Birth Cohort (ECLS-B), a study conducted by the National Center for Education Statistics (NCES) to examine the learning environments, health, and development of young US children. 30 The NCES ethics review board approved the data collection, for which parents provided written, informed consent. The Ohio State University is licensed with the NCES for analysis of ECLS-B restricted-use data. NCES guidelines require reporting unweighted sample sizes by rounding to the nearest 50; therefore, all reported sample sizes are approximations.\nThe ECLS-B was designed to contain a nationally representative sample of children born in the United States in 2001. The design was described in detail elsewhere 31 and is summarized briefly here. The sample was developed by using a clustered list-frame design with birth certificate data from the National Center for Health Statistics. Children were excluded if they were born to mothers younger than 15 years of age or if they died or were adopted before 9 months of age. From a sample of 14 000 births, the final study cohort of 10 700 children was formed when the children were 9 months of age. The cohort was assessed in the home when children were 9 months, 2 years, and 4 years old (preschool wave of data collection). The assessments consisted of a computer-assisted personal interview with the child's mother (or, in ϳ5% of the cases, the father or other guardian) and direct measurements and observations of children. 30 During preschool data collection, 8750 children were assessed. Our analysis excluded 200 of these children for whom height and/or weight data were missing, leaving a final analytic sample of 8550. To address the differences in survey response rates according to sociodemographic characteristics, nonresponse weights were calculated by the NCES. 30, 32 We report on the cross-sectional association between childhood obesity and the presence of 3 household routines (eating dinner regularly as a family, obtaining adequate nighttime sleep, and limiting screen-viewing time) based on the data collected in 2005 when the children were ϳ4 years old."}, {"section_title": "Obesity", "text": "Children's height and weight were measured in the home by using a standardized protocol for which interviewers were trained and certified. With children dressed in light clothing and without shoes, height was measured with a portable stadiometer, and weight was measured with a digital scale (both instruments from Seca [Hanover, MD]). Measurements were taken twice, and the average value of each pair of measurements was used in the analysis. 30 BMI (kg/m 2 ) was calculated and converted into percentiles for age and gender on the basis of the 2000 US growth reference. 33 All children whose BMI was Ն95th percentile were defined as obese. 1, 2 "}, {"section_title": "Household Routines", "text": "The 3 routines were selected because each could potentially help children achieve or maintain a healthy weight while providing other benefits for their well-being. 14 Mothers reported the number of days at least some of the family ate the evening meal together in a typical week. According to definitions used by others 27, 34, 35 and the response distribution for this question, we categorized children as having the routine of eating dinner regularly as a family if they did so 6 or 7 times per week.\nMothers reported the typical time that the child went to sleep and woke up on weekdays. From this information, we calculated the child's weekday nighttime sleep duration. The 50th and 75th percentiles in our data were 10.5 and 11 hours, respectively. According to this distribution and the literature examining associations between sleep duration and obesity, [20] [21] [22] [23] [24] we categorized children as having the routine of adequate nighttime sleep if they had 10.5 hours or more of nighttime sleep.\nMothers were asked \"On a typical weekday, that is, Monday through Friday, about how many hours of television does [child] watch at home per day?\" For this question, mothers were instructed not to include the time spent watching videos or DVDs, which was assessed in a separate, but similarly worded, question. We combined data from both questions to compute weekday hours of screen-viewing time, and we categorized children as having the routine of limited screen-viewing time if they watched 2 hours or less per day. 36, 37 For households that reported that they did not own a television or did not watch television (Ͻ3%), we categorized them as having the routine of limited screen-viewing time as long as they did not report watching Ͼ2 hours per day of videos and/or DVDs."}, {"section_title": "Covariates", "text": "At the 9-month interview, mothers were asked to designate the child's race and ethnicity by using the same categories as those used in the US Census. 38 From these data, we established 4 mutually exclusive racial/ethnic groups 39 : non-Hispanic white, non-Hispanic black, Hispanic, and other.\nAt each wave of data collection, mothers' weights were measured with the same protocol used for the children. Mothers self-reported their height during the 9-month assessment. We calculated maternal BMI using the measured weight at the preschool wave or, if it was missing (700 mothers), the measured weight at the previous wave. Mothers with a BMI of Ն30 kg/m 2 were categorized as obese. 40 At the preschool interview, mothers reported their educational attainment, household size, and household income. Children were designated as living in a single-parent household if they were living with only their biological mother or biological father. Household income was reported in designated categories, with ϳ40% of households reporting their income to the nearest thousand dollars. 30 If household income was reported, it was calculated as the exact income; if it was not reported, it was calculated as the midpoint of the income category reported. On the basis of household income and household size relative to the income at the 2005 US poverty threshold, 30 we placed children into 1 of 5 income-topoverty ratio categories: Ͻ0.50, 0.50 to 0.99, 1.00 to 1.85, 1.86 to 3.00, and Ͼ3.00."}, {"section_title": "Data Analysis", "text": "We applied the survey sample weights, which included adjustments for nonresponse and planned oversampling, making the reported results representative of US children born in 2001. Standard errors (SEs) and 95% confidence intervals (CIs) were estimated by using the survey procedures in SAS (version 9.1; SAS Institute, Inc, Cary, NC) that accounted for the complex sample design. 41 We estimated the percentage of children exposed to each of the 3 household routines and also created a variable to indicate the number of routines to which a child was exposed (0 -3). We compared the prevalence of obesity in children exposed and not exposed to each of the 3 household routines and exposed to different numbers of routines (0 -3). Statistical significance for these comparisons was based on an ␣ level of .05 using Rao-Scott likelihood ratio 2 tests. 41 We used logistic regression models to estimate the odds of obesity associated with exposure to each routine, presenting unadjusted odds ratios (ORs) and ORs that were adjusted for the other 2 routines and for the covariates. We also used logistic regression models to estimate the odds of obesity associated with exposure to all 3, 2, or only 1 of these household routines relative to exposure to none of the routines.\nFinally, we examined whether the association between childhood obesity and the number of household routines differed according to (1) maternal obesity status, (2) racial/ethnic group, (3) maternal education level, (4) household income, or (5) single-parent status. We conducted stratified analyses by developing separate logistic regression models for different strata of these 5 covariates (eg, mother obese, mother not obese). In each model, the number of routines (the primary predictor variable) was included as a continuous variable, and preschooler obesity was the dependent variable. By using the models adjusted for the other covariates, we calculated the predicted prevalence of preschool obesity in households with none of the routines and in households with all 3 of the routines."}, {"section_title": "RESULTS", "text": "The prevalence of obesity among the children was 18.4%. More than half (56.6%) had a family dinner 6 or 7 evenings per week, 57.5% were reported to sleep at least 10.5 hours per weeknight, and 40.4% had their screenviewing time limited to 2 hours each weekday. Children were assessed at a mean age of 52.3 (SE: 0.07) months, and mothers had a mean age of 31.9 (SE: 0.15) years. Fifty-one percent of children were male, 54.0% were non-Hispanic white, 44.1% had a mother with a high school education or less, and 21.6% lived in a single-parent household ( Table 1 ).\nThe prevalence of obesity and the prevalence of exposure to all 3 routines were significantly associated with racial/ethnic group, maternal obesity, maternal education, household incometo-poverty ratio, and being in a singleparent household ( Table 2) .\nEach of the household routines was associated with a significantly lower prevalence of obesity ( Table 3 ). The odds of obesity were between 23% and 25% lower when children were exposed to a given routine (Table 3) . Adjusting for the other 2 routines did not appreciably change these estimates, suggesting the independent association of each routine with obesity. Additional adjustment for sociodemo-graphic covariates did not change the estimate of the association between obesity and regularly eating a family dinner, but it attenuated the estimates for adequate nighttime sleep and limited screenviewing time (Table 3) .\nApproximately 1 in 7 children (14.5%) had all 3 household routines, and 1 in 8 (12.4%) had none of the routines ( Table 4 ). Having a greater number of household routines was related to a lower prevalence of child obesity (Table 4). Among children exposed to all 3 household routines, the prevalence of obesity was 14.3% (95% CI: 11.3%-17.2%) compared with 24.5% (95% CI: 20.1%-28.9%) among those children exposed to none of the household routines. After adjustment for covariates, the OR of obesity was 0.63 (95% CI: 0.46 -0.87) for those exposed to all 3 routines compared with those exposed to none, and it was 0.64 (95% CI: 0.47-0.85) for those exposed to any 2 routines compared with none (Table 4 ).\nWhen the number of household routines was modeled as a continuous variable, having a greater number of routines was significantly (P Ͻ .0001) associated with a lower prevalence of preschool obesity (Table 5 ). After adjustment for covariates, each additional routine was associated with a 17% (95% CI: 9%-24%) reduction in the odds of obesity, and the predicted prevalence of obesity in children exposed to 3 routines was 13.2% compared with 24.0% in those children exposed to none of the routines.\nWhen we examined the association between the number of routines and obesity across strata of the 5 covariates, each additional routine was associated with reduced odds of obesity of between 10% and 24% in multivariateadjusted models ( Table 5 ). Although in some subgroups this reduction in odds was not statistically significant, these stratified analyses did not suggest that the association between the number of routines and obesity differed meaningfully across levels of any given covariate. In addition, there were no statistically significant interactions in regression models that formally tested for an interaction between the number of routines and a given covariate (data not shown)."}, {"section_title": "DISCUSSION", "text": "Our analyses of a large, nationally representative sample of preschool-aged children assessed in 2005 indicated that there was a lower prevalence of obesity among children who regularly ate the evening meal with their family, obtained adequate sleep, and had limited screen-viewing time. Compared with children exposed to none of these routines, the prevalence of obesity was ϳ40% lower in those exposed to all 3 routines, even after adjusting for maternal obesity and other sociodemographic characteristics.\nThe number of routines to which the child was exposed (0 -3) was inversely associated with the prevalence of obesity. The prevalence of exposure to these household routines varied according to factors such as the child's race/ethnicity, household income, and maternal obesity, but the association between these routines and a lower prevalence of obesity was not limited to those groups of children at low risk for obesity. For example, the association between the number of household routines and obesity was as strong or stronger among children with obese mothers as among children of nonobese mothers; it was as strong among those living in households with incomes below the poverty threshold as among those living above that threshold.\nEach of the household routines that we studied has been examined separately for its relationship to childhood obesity. 16, [20] [21] [22] [23] [24] [25] [26] We have extended the findings of these studies by examining how a combination of these routines are associated with obesity in a recent US cohort of preschool-aged children. However, because the study design was cross-sectional and observational, we cannot conclude that there is a causal link between the adoption of these household routines and lower risk of obesity. We did not account for differences in children's diets or physical activity levels. The prevalence of the 3 household routines was assessed by parent report. These estimates may have been too high because of the tendency of parents to give socially desirable responses; we are unable to determine how such misclassification might affect our conclusions about the association between these routines and obesity. To facilitate the clinical interpretation of our findings, we defined children as being exposed to a particular routine on the basis of cut points for the number of evening meals, hours of sleep, and hours of screen-viewing time. However, more research is required to establish a consensus on where to set these cut points and to determine the feasibility and effectiveness of changing these routines. Finally, we cannot exclude the possibility of nonresponse bias, even when using sample weights adjusted for nonresponse; however, our primary findings were consistent across sociodemographic strata (Table 5 ).\nVariation in the quality and context of household routines, which we could not assess with the data available in the ECLS-B, could potentially alter any beneficial impact of these routines for children. For example, we could not determine which or how many family members were present for the evening meal, 42 the food served, 43 whether the television was on during the meal, 44 or the content of the verbal and nonverbal interaction. 42, 45 Similarly, we could not examine the content or advertising in the child's screen-viewing time, 46, 47 whether there was coviewing with a parent, or any dialogue between the child and parent about the content viewed. 48 Finally, we did not have data about the content or consistency of bedtime routines, 49 the quality of the child's sleep, 50 or whether, in some cases, shorter sleep duration was the result of obesity-related breathing difficulties. 51, 52 Screen-viewing time and sleep duration were not assessed for weekend days. In addition, computer time was excluded, and screen-viewing while in child care was not estimated separately.\nFuture research, including intervention studies, can address some of these noted limitations to our study. For example, it is not clear whether it is these 3 routines themselves, other parenting strategies associated with these routines, or other correlated factors that protect against obesity. It is possible that these 3 routines are most effective when combined with an approach to parenting that is charac-terized by warmth and responsiveness along with maintaining clear, consistent, and developmentally appropriate expectations for the child's behavior. 53, 54 Given the various socioeconomic constraints faced by families, it will also be important to determine how best to help parents establish and maintain these household routines. One approach might be to first understand the goals that parents have for their children and then to frame these routines as a way to help their children achieve those goals.\nAlthough we cannot make causal inferences from our data, the household routines we studied may be promising behavioral targets for counseling, given their association with obesity and their potential benefits beyond obesity prevention. [27] [28] [29] 55 The associations we found with obesity were similar across the routines and are consistent with research on the biopsychosocial mechanisms by which these behaviors might prevent obesity. 27, 56, 57 "}, {"section_title": "CONCLUSIONS", "text": "Adopting these 3 routines may not be without potential harms for some children, such as those children who might experience negative social interactions at mealtime 58 or who are limited in their viewing of cognitively enriching content on screens. [59] [60] [61] However, given the balance of benefits and harms and the scope of the childhood obesity epidemic, it may be prudent to support parents in the adoption of these routines, while concurrently assessing their effectiveness in future studies. With care to avoid harm in particular families, an approach to obesity prevention that emphasizes these household routines might be acceptable to both parents and child health professionals, in part, by achieving goals for child well-being that go beyond maintaining a healthy weight."}]