[{"section_title": "", "text": "how early patterns of subsidy use may influence later patterns of reliance on publicly-funded early care and education. That is, subsidy receipt during the toddler and preschool years may directly promote reliance on higher-quality care, but subsidies in toddlerhood might also indirectly promote high quality care: they may encourage families to use the other forms of publicly-funded care that become available at preschool age -Head Start and public pre-ktwo programs that have recognized benefits for child school readiness (Gormley, Phillips, & Gayer, 2008;Weiland & Yoshikawa, 2013;Winsler et al., 2008;Zhai, Brooks-Gunn, & Waldfogel, 2011). We might expect subsidy use during the toddler years to influence parents' subsequent care choices if subsidy use at child age 2 expands parents' knowledge about child care options for preschoolers. Parents may hear favorable reviews of Head Start or public pre-k, or they may learn about the application procedures and receive information and assistance from subsidy caseworkers (Adams, Snyder, & Sandfort, 2002), or from their child's teacher, their center's administrators, or other parents of the children in their child's classroom (Small, 2009). In addition, their own past experience with the subsidy system may better equip them to navigate the application process for these programs, and exposure to subsidies may reduce any stigma parents perceive to be associated with using other income-based programs such as Head Start or pre-k, which in most states is restricted to low-income families (Barnett, Carolan, Fitzgerald, & Squires, 2012). Subsidy use at age 2 could also influence later care choices by exposing families to higherquality care arrangements than they would experience otherwise. For one, 2-year-old children who receive subsidies are far more likely to attend center-rather than home-based arrangements , and center-based care is generally higher in quality than home-based care (Coley, Li-Grining, & Chase-Lansdale, 2006;Rigby, Ryan, & Brooks-Gunn, 2007). Further, among 2-year-old children in home-based care, subsidy use is associated with higher quality Ryan et al., 2011). Higher-quality home-based care may be licensed or regulated, or part of a family child care network that connects the care provider with technical assistance and professional development opportunities (Rigby et al., 2007). If there is an association between age 2 subsidy use and later reliance on other publiclyfunded options, this link may be stronger for children in center-than in home-based care at age 2. To the extent that subsidies at age 2 allow parents to develop a preference for higherquality care, then children in subsidized homes or centers at age 2 may be apt to select Head Start and public pre-k in the preschool year, given that they are the highest quality publiclyfunded care options available at that age . On the other hand, if age 2 subsidy recipients are more likely than age 2 subsidy non-recipients to select Head Start or public pre-k in preschool because they receive more information about publicly-funded preschool options, this information may be more plentiful in center-than in home-based arrangements due to the greater number of staff and other parents. The present study tests whether age 2 subsidy receipt predicts the use of other publiclyfunded care during the preschool year, and whether that association depends on type (centerversus home-based) of care. A central concern of our analysis is that consistent socioeconomic disadvantage could explain both subsidy receipt at age 2 and selection into one of the other means-tested, publicly-funded programs like Head Start or public pre-k in the preschool year. Also, an association between use of subsidies at age 2 and other publicly-funded care in preschool may be attributable not to voluntary choice but to mothers who have lost employment and hence become ineligible for subsidies between time points. An association between subsidy use at age 2 and other publicly-funded care in the preschool year might also be attributable to familiarity with or willingness to take up public benefits at both time-points. Finally, mothers can only use other publicly-funded care in preschool if public pre-k or Head Start slots are available in their communities. In other words, there may be reasons (eligibility status, proclivity for public benefits, care availability) why subsidy users at age 2 remained on or went off subsidies in preschool that have little to do with parental choice. To address the possibility that continued economic disadvantage explains both subsidy receipt at age 2 and selection into means-tested programs at preschool, limit our sample to subsidy-eligible families at age 2 and include a measure of preschool-wave household income in our multivariate models. We also estimate supplementary models on a sample of families who were eligible for a subsidy at age 2 and had incomes at or below the poverty line at preschool (the eligibility cut-off for Head Start and, in many states, public pre-k). Limiting the sample to poor families at the preschool wave reduces the likelihood that the overrepresentation of poor families among subsidy recipients accounts for any observed link between earlier subsidy receipt and later take-up of another income-tested publicly-funded program. To address the possibility that families who were eligible for subsidies at age 2 became ineligible by preschool and were thus compelled to seek another arrangement besides subsidies at preschool, we experiment with limiting our sample to families who were subsidy-eligible at both the 2-year and preschool waves. Finally, to address the possibility that differential availability of public pre-k or Head Start slots drives any link between subsidy use at age 2 and publicly-funded care use at preschool, we control for maternal perception of local care availability."}, {"section_title": "METHOD", "text": ""}, {"section_title": "Data and Sample", "text": "Data are drawn from the Early Childhood Longitudinal Study -Birth Cohort (ECLS-B), a nationally representative study of children born in 2001. More than 14,000 birth certificates were sampled from 96 counties or county-clusters; of those, approximately 10,700 children participated in the baseline wave of data collection. Parents were interviewed and children were assessed in 2001 when they were 9 months old; in 2003 when they were 2 years old; in 2005-2006 when were in preschool; and in 2006-2007 when they were in kindergarten. The current study uses data from the first three waves, for which response rates were 74%, 93%, and 91%, respectively. NCES-constructed weights were applied in all analyses to account for the complex sampling design and survey non-response; once applied, these weights adjust the sample to be representative of all children born in the U.S. in 2001. We use NCES base weight W3R0, which applies to children whose parents participated in all interviews up to and including the preschool wave At the 2-year and preschool waves, child care providers (and center directors) where interviewed by phone about characteristics of the care and children served. The provider interview and director questionnaire were conducted with the child's primary care provider, defined as the care arrangement in which the child spent the greatest amount of time per week. Response rates for the child care provider interview were approximately 70% and 87% at the 2-year and preschool waves, respectively. Analyses focus on families who were deemed subsidy-eligible at the 2-year wave, because ineligible non-recipients of subsidies are likely to make different child care choices than subsidy recipients in ways that relate to both measured and unmeasured differences in income and employment, the criteria that determine subsidy eligibility. Data from the parent and child care provider interviews were used to identify families who were likely to be subsidy-eligible at the 2-year wave (see Ryan et al., 2011 for a complete discussion of this approach). Missing data on covariates were multiply imputed using the imputation for chained equations (ICE) procedure in Stata Version 11, and estimates were combined across imputed data sets using the MIM command. Thus the final analytic sample included the approximately 2,100 subsidy-eligible at 2-years children with valid values on the independent and dependent variables. Additionally, all regression models were run with the subpop command in Stata so that standard errors would account for cases excluded from the analytic sample because they were not subsidy-eligible at the 2-year wave."}, {"section_title": "Measures", "text": "Subsidy receipt at age 2-Children were classified as subsidy recipients or nonrecipients at age 2. Subsidy non-recipients comprised two separate groups: children in unsubsidized non-parental care, and children in exclusive parental care. In regression models, dummy variables indicated subsidy receipt and exclusive parental care; unsubsidized non-parental care was the reference group. Our measure of subsidy receipt was constructed from parent and child care provider or director information, collected during the 2-year wave. Families who indicated that the child's primary non-parental care arrangement occurred in a center were coded as receiving a subsidy if (1) the parent reported receiving assistance paying for child care from a government or social welfare agency, or (2) the parent reported using center-based care, and that care was free. Parents who indicated that their child's primary non-parental care arrangement was home-based were coded as receiving a subsidy if (1) the parent reported receiving assistance paying for care from a government of social welfare agency, or (2) the parent reported that there was no charge for the care and the provider reported that he or she was licensed or part of a family child care network, provided care in the provider's home, and cared for 3 or more unrelated children. Children in non-parental care whose families did not meet these conditions were coded as being in unsubsidized non-parental care. Child care setting at age 2-Children who received non-parental care at age 2 were classified as being enrolled in either a center-or home-based setting using data from the child care provider and parent report. For cases in which the parent and child care provider disagreed, child care provider report was used; for cases missing child care provider report (30% of sample cases), parent report was used. Perceived availability of care in preschool-During the preschool-wave parent interview, respondents were asked whether they felt they had good options for child care. Mothers who responded affirmatively were coded \"1\" on the measure. Program type in the preschool year-We drew on parent report and (when available) center director or child care provider report of program type, for which Head Start and public pre-k were two possible response options. To identify subsidy recipients, we selected parents who reported that \"a social service or welfare agency\" helped pay for the child's primary care arrangement. Parents who stated that the primary arrangement was free centerbased care (that was not Head Start or public pre-k) were also coded as subsidy recipients. Parents who stated that the primary arrangement was free home-based care were categorized as subsidy recipients if the provider also reported that he/she was licensed or part of a family child care network, supplied care in the provider's home, and cared for 3 or more unrelated children. This last condition was used to differentiate free, informally-provided home-based care (e.g. that provided by a grandparent) from subsidized home-based care where the subsidy covers the entire cost (for more discussion of the coding of subsidy receipt and nonreceipt at the preschool wave, see Johnson et al., 2013.) Children in subsidy-eligible families not meeting the above conditions were coded as subsidy non-recipients, and were classified by their type of primary care into one of three mutually exclusive groups: other publicly-funded care (i.e., Head Start and public pre-k), unsubsidized care, or parental care. Children were considered to be in unsubsidized care if they did not receive any publicly-funded form of care (subsidies, Head Start, or public prek). They either paid out-of-pocket or used care outside the market (i.e., the provider does not charge or, for some other reason, the recipient does not pay). Children who received no nonparental care were considered recipients of parental care only. In regression models, dummies were entered for subsidy receipt, other publicly-funded care (Head Start, pre-k), and parental care. Unsubsidized care served as the reference group. Covariates-All covariates were drawn (except where noted) from the 9-month wave to ensure that covariates and subsidy receipt were not simultaneously determined. Covariates included standard demographic characteristics, as well as an indicator for child special needs status, and a prior measure of child cognitive skill (from the 2-year wave). To reduce the likelihood that income differences between families at the preschool wave explained their selection of child care arrangement, given that some of the options were means-tested, we also controlled for household income-to-needs ratio at the preschool wave. The full list of covariates used as controls appears in the Table 2 note. Table 1 displays a simple cross-tabulation of subsidy status at age 2 and child care arrangement in the preschool year. Not surprisingly, children who received subsidies at age 2 were more likely to receive subsidies in the preschool year (23%) than were children in unsubsidized or parental care at age 2 (12% and 11%, respectively). However, age 2 subsidy recipients were also more likely to receive other publicly-funded care in preschool (36%) than were the other two groups, who were equally likely to attend other publicly-funded care (29% and 30%, respectively). Children who used unsubsidized care at age 2 were most likely to use unsubsidized care in the preschool year, while children in parental care at age 2 were the group most likely to be in parental care in the preschool year."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Bivariate Analyses", "text": ""}, {"section_title": "Predicting Care Arrangement in Preschool from Subsidy Receipt at Age 2", "text": "To examine whether receipt of a subsidy when children were 2 years old was associated with their child care arrangement in the preschool year, we estimated a series of multinomial logistic regression models (Table 2). Each model predicted membership in one of the four preschool child care arrangements -subsidized care, other publicly-funded care, or parental care, with unsubsidized care as the reference -from the three-level age 2 subsidy status variable: subsidized care and parental care, with unsubsidized care as the reference. To reduce selection bias due to unmeasured child and family characteristics associated with subsidy receipt and selection into child care setting, all models included the full set of covariates (see Table 2 note). Three separate models were run. Model 1 simply tested whether subsidy status at age 2 was associated with child care arrangement in the preschool year, without accounting for the fact that subsidies can be used to purchase care in a center-or home-based setting, or that children in unsubsidized care could have attended a center or home. Therefore, Model 2 added an interaction term that multiplied subsidy receipt at age 2 by an indicator for whether the child attended center-based care at age 2, testing whether the association between age 2 subsidy receipt and preschool child care arrangement differed for children in center-versus home-based care at age 2. Given the inclusion of the interaction term in Model 2, the subsidized care at age 2 variable denoted the use of a subsidy in home-based care relative to unsubsidized home-based care. The coefficient on center-based care at age 2 compared unsubsidized children in center-based care to unsubsidized children in home-based care. Finally, in recognition that parents' child care decisions in the preschool year were constrained by the alternatives they perceived to be available, Model 3 added an indicator for whether the mother reported having good options for care. Across all models, estimates are displayed as relative risk ratios (RRRs), which represent the ratio of the probability of choosing the given preschool-year care arrangement over unsubsidized care in preschool, for the given age 2 subsidy group relative to unsubsidized care at age 2. Model 1 of Table 2 shows that children who received subsidies at age 2 were nearly three times as likely to experience subsidized care versus unsubsidized care in the preschool year, compared to subsidy-eligible children who attended unsubsidized care at age 2. Age 2 subsidy recipients were also almost twice as likely to use other publicly-funded care versus unsubsidized care in the preschool year, compared to children in unsubsidized care at age 2. Non-recipients in parental care at age 2 were also more likely than children who attended unsubsidized care at age 2 to use other publicly-funded care versus unsubsidized care in the preschool year. However, they were also much more likely to continue in parental care in the preschool year. Turning to Model 2, the main effect of subsidized care at age 2 (which now represents subsidized home-based care) continued to be significantly predictive of subsidized care use relative to unsubsidized care in the preschool year. Likewise, children who received parental care versus unsubsidized care at age 2 continued to be more likely to use parental care than unsubsidized care in the preschool year. The interaction of subsidy use at age 2 by use of center-based care at age 2 predicted both other publicly-funded care and parental care at preschool: subsidy recipients who used their subsidies in centers at age 2 were more likely than children in unsubsidized home-based care at age 2 to use other publicly-funded care and parental care rather than unsubsidized care in the preschool year. To facilitate interpretation of this interaction, we computed predicted probabilities for preschoolers attending other publicly-funded care (Figure 1). Among children who attended center-based care at age 2, the use of a subsidy increased the probability of attending other publiclyfunded care in the preschool year from .24 to .38. In contrast, among children who attended home-based care at age 2, the use of a subsidy did not change the probability that they would attend other publicly-funded care in the preschool. To account for the possibility that preschool child care selection was influenced by the perceived availability of alternative options for preschool-year care, in Model 3 we added a control for whether the mother reported having good options for care in the preschool year. As with Model 2, in Model 3 children who received subsidized home-based care (the coefficient on subsidized care at age 2) compared to those in unsubsidized home-based care at age 2 (the omitted group) were more likely to use subsidized care versus unsubsidized care in the preschool year regardless of perceived child care options. Likewise, children who received parental care at age 2 were still more likely to receive parental care rather than unsubsidized care in the preschool year. With respect to the interaction term, children in subsidized center-based care at age 2 were still more likely than those in unsubsidized home-based care to use other publicly-funded care rather than unsubsidized care in the preschool year, suggesting perceived child care options did not account for that link. However, accounting for whether the parent had good options for care in the preschool year eliminated the significance of the interaction term in predicting parental care in the preschool year and reduced its magnitude by 44% (RRR = 3.84 in Model 2 vs. 2.15 in Model 3). This suggests that when parents perceived that there were good preschool care options, subsidy use in a center, compared to unsubsidized home-based care, no longer predicted selection of parental care over unsubsidized care in preschool. Additionally, whether the mother had good options for care was itself predictive of selection into preschool arrangements: mothers who reported having good options for care were more likely to use subsidized and other publicly-funded care and were less likely to use parental care in the preschool year, although these latter two associations were only marginally significant."}, {"section_title": "Supplementary Analyses", "text": "To test whether income eligibility in the preschool year accounted for families' selection into subsidized care or other publicly-funded care, we re-estimated the multinomial logistic regression models presented in Table 3 on two alternative samples: a sample limited to families who were eligible for subsidies at age 2 and at the preschool wave (n = 1,600; Appendix A); and a sample limited to families who were eligible for subsidies at age 2 and whose incomes placed them at or below the federal poverty level at the preschool wave (n = 1,150; Appendix B). Specifically, we reasoned that because eligibility for subsidies is based on income and employment, perhaps some subsidy recipients at age 2 moved into other publicly-funded care by preschool because they no longer met eligibility requirements for subsidies but did for Head Start or public pre-k. Likewise, it could be that previously income-(and employment-) eligible families who used subsidies at age 2 experienced an increase in income, and therefore selected unsubsidized or parental care in the preschool year because they were no longer income-eligible for subsidized or other publicly-funded care. Models re-estimated on these alternate samples yielded results that were nearly identical in the sign, size, and significance of the RRRs."}, {"section_title": "DISCUSSION", "text": "Subsidy receipt before and during the preschool years has been found to elevate the quality of care children experience relative to those in unsubsidized arrangements Ryan et al., 2011), but not compared to children in other publicly-funded care such as Head Start or public pre-k , programs which provide the highest-quality care to low-income families (Hillemeier et al., 2012) and which were, unlike subsidies, explicitly designed to promote school readiness. The present study investigated the previously untested possibility that early subsidy receipt -that is, before preschool -may increase reliance on these higher-quality, publicly-funded arrangements during preschool. Our results support this hypothesis. Although families who received subsidies at age 2 were more likely than those who used unsubsidized care and parental care to use subsidies at preschool, they were also more likely than the other two groups to select publicly-funded arrangements at preschool, when those options became available. Thus subsidy receipt in toddlerhood may benefit low-income children by facilitating entrance into these higher-quality publicly-funded arrangements during preschool. However, this finding was limited to children who used their subsidies in centers at age 2. We hypothesized that the link between age 2 subsidy receipt and the use of other publiclyfunded care would be stronger for children in centers than in home-based care at age 2. We proposed that subsidy users at age 2 may receive information about alternative care options for preschoolers, including Head Start and public pre-k, and that this information is more abundant or available in centers than in homes. In both centers and homes, child care providers and other parents could inform families about the availability, advantages, or application processes for Head Start and public pre-k, but there are more child care staff and more other parents at centers than in homes, and, importantly, there are administrative staff only at centers. Compared to home-based care providers, administrators of center care for toddlers may be more familiar with Head Start and public pre-k and the application process because they also administer center-based programs; center care administrators may also hold Head Start and public pre-k in higher esteem. These administrators may even directly link families with Head Start and public pre-k through referrals or assistance with application paperwork. Although we cannot be certain that increased access to information is responsible for some or all of the link between age 2 subsidy use and later reliance on other publicly-funded care, the finding that the link is evident only among center users suggests that this mechanism may be at play. We also hypothesized that, because subsidy use at ages 2 and 3 has been found to expose children to higher-quality care either by promoting center-based care use or by facilitating entrance to higher-quality home-based care, it might encourage low-income parents of preschoolers to select the higher-quality Head Start and public pre-k alternatives when they become available. If this were the case, then subsidized families in both center-and homebased care at age 2 should be more likely to make use of Head Start or public pre-k. We find that only those who used their earlier subsidies in centers were more likely to use other publicly-funded options in the preschool year, suggesting that early subsidies do not encourage later use of publicly-funded care via enhanced parental preference for higherquality care. Thus increased access to information about publicly-funded alternatives appears to be the most likely explanation for the greater use of Head Start and public pre-k among subsidy recipients at age 2. Further research is needed both to substantiate this supposition, and to investigate other explanatory pathways we have not identified. The present study also found that families using subsidized centers for their toddlers were more likely to use other publicly-funded care and parental care at preschool than those in unsubsidized care, which could be due to the absence of Head Start or public pre-k programs in their community. Indeed, the tendency for families in subsidized centers to move into parental care at preschool was substantially explained by mothers' perceptions that good child care options were not locally available. Thus, it is plausible that families using subsidized centers for their toddlers tend to use higher-quality, other publicly-funded care for preschool when options perceived as \"good\" are available, but choose to keep children at home, rather than send them to lower-quality unsubsidized or subsidized centers, when \"good\" options are not available. It will be important for future research to replicate this pattern with more precise, less subjective measures of child care availability. It is significant that mothers' perceptions of child care availability did not account for the link between subsidized center care and movement into other publicly-funded care. If Head Start or public pre-k programs were more prevalent in communities with a large supply of subsidized centers, the link between subsidies and other public care could reflect local child care markets rather than an effect of the subsidy program. Indeed, mothers' perception of child care options positively predicted the use of Head Start or public pre-k. However, that association did not account for the link between age 2 subsidy to other publicly-funded preschool care. This finding suggests that attending subsidized centers may provide parents with unique knowledge about and encouragement to use other publicly-funded care options in their communities. Of course, it is possible that the characteristics that motivate parents to select into the subsidy program for their toddlers are the same characteristics that motivate them to select other publicly-funded care during preschool, and that this selection bias accounts for the subsidy to other publicly-funded care link. We minimized this threat first by controlling for a rich set of potentially confounding maternal and child characteristics, nearly all of which significantly distinguished subsidy-recipients from non-recipients at age 2 (descriptive results not shown, but available upon request). Second, we ran supplementary models restricted to families eligible for subsidies at both time points and families with incomes below the poverty level at preschool. The consistency between these results and those from our main models reassure us that neither instability in subsidy eligibility nor the overrepresentation of poor families in the subsidized center care group drove our findings. Notwithstanding this reassurance, we acknowledge that unobserved characteristics could still have biased the association between subsidy use at age 2 and reliance on other publiclyfunded care. Indeed, a central limitation of the current study is its use of observational data and dependence on the untestable assumption that all characteristics associated with subsidy receipt at age 2 and selection of preschool-age care arrangement were observed and included in our models. Despite these limitations, our study offers insight into the strengths of the current subsidy program and possible ways to enhance its effectiveness in the future. Our findings suggest that child care subsidies might be useful for children before preschool, when no other publicly-funded options are widely available. For younger children, subsidies facilitate the use of higher quality care contemporaneously , while also facilitating reliance on higher-quality programs in preschool. Lessons from future research investigating why subsidized center-based users are more likely than their counterparts in home-based care to turn to other publicly-funded care could inform subsidy administration with home-based care users. One question of interest is whether the parents of toddlers who use their subsidies in home-based care receive more information about other publicly-funded care if their provider belongs to a family child care network, which can provide education and administrative support to its members. Results from the current study also imply that families may prefer -or simply have no alternative but -to care for children at home when they perceive that no other, possibly higher-quality options for preschoolers are available. Our findings thus reinforce the need to expand the availability of these programs in lowincome communities, and perhaps to do so in a way that targets communities with particularly low availability. Predicted probability of child attending other publicly-funded care in preschool by subsidy receipt status at age 2, among subsidy-eligible families at age 2 Note. Subsidy status and parental care are mutually exclusive categories, and thus there is no predicted probability generated for the cross-classification of those groups. Predicted probabilities were generated from Table 2, Model 2.  Ns rounded to nearest 50 per NCES requirements. N = 1,150. All models controlled for: maternal race, maternal education, maternal relationship status, maternal English proficiency, mother's age at focal child's birth, number of children in the household, urbanicity, maternal employment status, household income at preschool, whether the family experienced food insecurity, whether the child had a diagnosed special need at age 2, child gender, and child cognitive ability at age 2."}]