[{"section_title": "Introduction", "text": "The assessment of climate impacts on natural geophysical hazards such as storms and floods are an area of significant interest due to the amount of damage it has caused to coastal areas. Tropical cyclones are the cause of millions of dollars in property damage yearly, so adequate risk assessment of these events is of significant interest to governments, industries, and communities in the area of vulnerability. In the state of Texas, tropical cyclones are responsible for the highest number of deaths of any natural hazard, claiming the lives of 6507 individuals between the years 1851 and 2020. Additionally, they have caused the most property damage of approximately $954.4 billion [1]. Historically, the South Texas region has been very susceptible to these types of natural disasters. In 1967, hurricane Beulah caused 58 deaths as well as $217 million in damages, which is equivalent to $1.59 billion in 2017 currency [2]. Additionally, in 2008 hurricane Dolly caused $1.3 billion in property damages in the United States [3]. Because South Texas is a coastal area with relatively low elevation and narrow stream channels, propagation of storm flood damage is prominent. Further, the Lower Laguna Madre is in this area, and it is essential to preserve this hypersaline lagoon due to the ecological impacts it has on the region [4]. Increasing the reliability of infrastructure systems, whether it be economic, political, and social, depends on the careful determination of surge vulnerability [5]. These natural hazards bring about tides, storm surge, and rain that ultimately are the cause of the damage. Storm surge, which is the abnormal rise in seawater, is one of the most prominent components to flood propagation in South Texas. Flood protection measures should be considered since the developments of this region are not sufficiently designed for extreme surge events [5]. The reason for this is because of how severe these storms are and the insufficient data available to predict the potential damage of these disturbances adequately. Because they do not occur periodically in this region as opposed to rainfall, there is no previous data available about earlier models that have measured hurricane effects, such as storm surge. Developing a coastal storm surge inundation model has the potential to allow emergency responders of the region to improve the resilience of the area. There have been numerous studies that have shown an effort to address natural hazard mitigation through appropriate and accurate storm surge model development. The National Storm Surge Hazard Map developed by the National Hurricane Center (NHC) displays worst-case storm surge flooding scenarios using the National Weather Service (NWS) hydrodynamic storm surge model. This NWS model uses Sea, Lake, and Overland Surges from Hurricanes (SLOSH) to create hypothetical storms using varying conditions to visually map out the inundation across 27 basins in the United States [6]. When a hypothetical Category 4 hurricane like that of Harvey (2017) is implemented into a grid that entails the Texas Coast, an estimated peak surge of 3.84 meters was generated in Calhoun County, Texas, which agrees with actual measurements [7]. The SLOSH model can assist in the validation of the developed South Texas hydrodynamic model by comparing surge heights of the historical and hypothetical hurricane scenarios. A comprehensive storm surge database, SURGEDAT, provides historical storm surge observations for the entire globe [8]. As an example, the SURGEDAT database provides the historical storm surge measurements for hurricanes that have made direct landfalls on the South Texas coast, such as the Dolly (2008) 1.22-meter surge and the Emily (2005) 1.52-meter surge. These measurements are useful to this study because we can use these values to compare and validate the developed model. An Advanced Circulation (ADCIRC) model specific to the Gulf of Mexico region implements hindcast studies, which are dependent on specific model input parameters, such as surface roughness coefficients [9]. Additionally, an ADCIRC model was developed for the Houston, Texas area for adequate sea barrier implementations, and values such as the surface roughness were also modified and observed for better accuracy of the model [5]. Although the TxBLEND water circulation model developed by the Texas Water Development Board (TWDB) is not a model designed for storm surge functions, it is a serviceable model to this study since it provides practical information for essential parameters like surface roughness values for the Texas coasts [10]. All these imperative analysis efforts are needed to provide essential data and communicate it to the public effectively. The appropriate selection of parameters will result in the accurate representation of computations from these models and maps. The objective of this paper is to select the best possible input variables that can provide the most accurate representation of extreme water levels during any hurricane event in the South Texas region. Coastal modeling is essential to promote conservation and adequate emergency management and planning [9]. Therefore, the primary focus of this project is to assure model accuracy being developed to achieve this data. A hydrodynamic model was adopted for the area of the South Texas coast, specifically focusing on areas near the Lower Laguna Madre. Figure 1 entails the Gulf of Mexico in its entirety, with a focus on the Lower Laguna Madre area. All modeling requires a level of engineering judgment, primarily when focusing on the accuracy and model improvements. For this hydrodynamic model, the crucial parameters to focus on for proper calibration and model development is the tidal constituents and surface roughness coefficients. This paper entails the model improvement methodologies and the judgment that was made based on previous literature that has dedicated their time to similar projects. The goal is to improve the current hydrodynamic model developed for the South Texas region by determining the best tidal harmonic constituent combination and the surface roughness of the model domain. These parameters are tested by executing the hydrodynamic model with four historical hurricanes that have made landfall in the South Texas area. The four historical hurricanes include Bret (1999), Dolly (2008), Emily (2005), and Alex (2010). The computational data that is retrieved from the hydrodynamic model execution and then compared to the water surface elevation data provided by the National Oceanic and Atmospheric Administration (NOAA) buoy stations. Statistical analysis, such as linear regression, root mean squared error method, scatter index, and percent increase is used to analyze the accuracy of each computational result. An accurate model would ultimately increase the usefulness to the communities in the nearby locations, for they are using a model that is reliable and accountable for their emergency management planning."}, {"section_title": "Materials and methods", "text": "The Surface Water Modeling System (SMS) software is used for the pre-processing and postprocessing of the finite element mesh development of respective areas [11]. The ADCIRC model is a finite element program that executes the hydrodynamic scenarios, such as symmetrical and asymmetrical wind events. Because ADCIRC is conventionally used to simulate wind-driven ocean circulation, tides, and storm surge along the United States coasts, it is a perfect tool for this project [5]. The required ADCIRC files are assigned through the SMS Geographic User Interphase (GUI) program to assist in the generation of the correct inputs for the hydrodynamic model. Mainly, bathymetric data, node strings, wind forcing data, control variables, and finite element mesh generation toolbox are what ADCIRC needs to execute successfully. The bathymetric data and node strings are the boundary conditions implemented for mesh generation, while the wind forcing data and control variables are the input parameters needed for appropriate simulation of the hydrodynamic model. "}, {"section_title": "Model domain and geometric data", "text": "The model domain includes the Gulf of Mexico and Laguna Madre. The enclosed finite element mesh is for the model to distinguish between water and land, as seen in Figure 2. The boundary created by the nodes distinguishes what land is, and the mesh is what classifies the ocean. The accepted model domain covers the areas that contain bathymetric information. Bathymetry is obtained from the NOAA databases. In this study, two bathymetric datasets are modified and merged to fulfill the required data needed for the domain coverage. For the Gulf of Mexico bathymetry, the dataset used had to be manipulated for the model to read the elevations accurately. Specifically, conversion from mesh grid data to scatter data had to be conducted within the SMS software. For the Laguna Madre bathymetry, a 1/3 arc-second raster dataset is obtained. The information was manipulated in such a way so that the SMS software can read the data provided by the raster file and convert it to scatter data [12]. The range of mesh sizes are dependent on the importance of data accuracy, and this is due to a variety of reasons. Because the model is going to cover such a large domain, it is essential to minimize as much computational time as possible while still obtaining accurate results. If the model contains most of the small-ranged mesh, then the computational time is exponentially more considerable. Additionally, the smaller mesh is most useful in areas of interest, such as coastal zones, since it is proven that there is less interpolation required along with those areas throughout the tidal execution process. Therefore, when creating the node strings that serve as boundary conditions to the model domain, detailed modeling of nodes were distributed among the Laguna Madre area, and more relaxed nodes were distributed in open ocean conditions. Moreover, there was an interest in several channels in South Texas, such as the Arroyo Colorado and the Brownsville Ship Channel, which is why they are integrated into the domain. The geometry is triangulated through the nodes that were developed from the bathymetric raster data, so it contains appropriate interpolated elevation values as well as coordinates respective to the area. The entire grid has 64,271 nodes in the model. The triangular mesh aspect ratio, which is the element width divided by the element length, is 0.04."}, {"section_title": "Tidal constituents", "text": "Tidal constituents are composites of multiple partial tides at any given location. They are formed by the gravitational attraction between the earth, moon, and sun. Additionally, they contain tidal and space-dependent information that is unique to each constituent [13]. It is essential to implement tidal constituents into the hydrodynamic model used for this study, for without them, the model would be unrealistic and cause stability issues. The tidal constituents used are provided by the US Army Corps of Engineers database [13]. Specifically, the information obtained for the Gulf of Mexico database covers all waters 60 degrees west of the Greenwich Meridian and east of the North American continent. The version of the database used for the model improvement practices was the East Coast 2001 (EC2001). The published tidal constituent data that is provided by this dataset is the seasonal sea surface expansions that occur in the oceans, and they are classified as the Sea Solar annual and the Sea Solar semiannual. All 37 constituents in this database provided are barotropic [14]. These phases are relative to the Greenwich Meridian. The specific tidal constituents that are used throughout this study in a variety of combinations include M 2 , S 2 , K 2 , N 2 , O 1 , K 1 , Q 1 , and P 1 . The subscript \"1\" indicates that it is a diurnal constituent, and the subscript \"2\" means it is semidiurnal. Diurnal constituents' cycle once a day while semidiurnal cycles twice daily. Several tidal constituent combinations were implemented into the hydrodynamic model to identify which scenario worked best for the South Texas coast area since there has never been a model developed that is specific to this area prior to this study. The best tidal constituent combination that was selected can be implemented to achieve the goal of this paper.  Wind forcing data is one of the essential parameters for this study because intense storms that generate a large amount of wind also generate a large amount of storm surge, and that is what this hydrodynamic model is attempting to compute. The wind forcing data obtained and used throughout the project is the \"Best Track\" hurricane data files provided by the NOAA database [15]. This wind velocity data is derived from one of many meteorological models that produce spatially and temporally dynamic wind fields and is of good use to this hydrodynamic analysis [16]. There is a total of four historical hurricane events that are used for this study, and the essential parameters needed from them can be found in Table 1 below. These hurricanes were selected due to the impacts they caused along the South Texas area, as well as their close landfall proximity to the Laguna Madre. Due to their close range to the specific area of study, they would be most prominent in propagating a significant amount of surge. Additionally, their durations and the landfall directions vary, which would then reproduce different results. This is essential for model improvement measures since the model needs to be able to execute accurately with any type of hurricane condition given to it. Further, it is crucial to recognize that storm surge propagation can vary depending on hurricane size and intensity. The Saffir-Simpson scale that is currently used to indicate whether a hurricane would cause significant damage to an area is based on wind speed alone and this information is not enough [17]. The purpose of implementing historical hurricane data into the hydrodynamic model is to compare observed water surface elevations during the time of these events with the computational results. Only then can we verify that the model is producing consistent outcomes. ADCIRC reads several parameters from this wind forcing data, and that includes the intensity and the size of the hurricane. The intensity consists of translation speeds, maximum sustained winds, and minimum central pressure, while the size consists of radii of maximum winds and the radii of last closed isobar. As previously mentioned, the developed finite element model contains a vast domain and thus takes an extended amount of time to compute the results. The computational resources that were used throughout this study are of the High Computing System (HPC) provided by the University of Texas Rio Grande Valley (UTRGV) [18]. It was utilized to process data faster and more conventional. This HPC used 12 cores of computational power to execute each model. This study dramatically benefits from these high CPU core counts since it makes it possible for the hydrodynamic model simulation to be concurrently computed with other instances with different parameters. More significant computing resources allow for the creation of more complex models and scenarios, thereby improving the overall quality of the hydrodynamic model."}, {"section_title": "ADCIRC model control", "text": "The model parameter and periodic boundary condition file must be adjusted before executing the hydrodynamic model. This file contains most of the parameters required to run the finite element mesh model successfully [19]. For the model to execute the most accurate results possible, it is vital for it to have a cold start time. The model uses this time as a means of warming up before executing the model. The longer the cold start time, the more accurate the model is, but due to the limited amount of wind forcing data time steps, the most reasonable cold start time for most simulations was of one day. The finite-amplitude terms, such as the wetting and drying function, were not used in this study due to the instabilities it causes during the model execution process. It is essential that the tidal constituent combinations selected for the execution match with the start time of the execution to prevent any phase shifting of results and inaccuracies of the model. A nodal attribute file was used in several scenarios in this study primarily to replace the surface roughness parameter from the model parameter and periodic boundary file. When the nodal attribute file is used, it takes precedence of the computational file. Notably, during execution, the manning's n value specified in the nodal attribute files are converted to an equivalent quadratic friction coefficient before bottom stress is calculated. These nodal properties are constant, but spatial variables must be provided, and in this case, it is by the TxBLEND salinity transport model [10]. For this study, the water surface elevation function is turned off since the finite-amplitude terms are turned off. As previously mentioned, this study verifies the accuracy of the hydrodynamic model by comparing it to already existing water surface elevation data. It is a method commonly used when calibrating storm surge models [20,21]. This information is extracted from a buoy station that has historical water surface elevation data provided by the NOAA buoy station PTIT, 8779770, located in Port Isabel, Texas [22]. This NOAA station was established in 1944 and had since then been recording a variety of parameters. The exact buoy station coordinates are 26°3'40\" N and 97°12'56\" W, and it is marked in the hydrodynamic model with a hollow circle in Figure 1 above. The only parameters that are extracted from the database for the use of this study are the water surface elevation, and it is used with the Mean High Water (MHW) elevation datum. This datum is used primarily due to it being the average of all high-water heights observed in that buoy station location and is, therefore, the most useful for this study."}, {"section_title": "Surface roughness", "text": "Manning's roughness coefficient is another parameter that is carefully considered when wanting to improve an ocean model. It is essential to parameterize this information since it is a critical element of the application of storm surge models. This is because surface roughness can significantly impact the effects of inundation caused by tides and surges. Because of the scarcity of ocean data, however, these factor estimations require a level of engineering judgment. The ADCIRC program assigns a default coefficient value of 0.0025 across the whole finite element grid using the model control (fort.15) since it is the most commonly used deep ocean coefficient [23]. The Gulf of Mexico's average depth is 1615 meters, so the seafloor roughness is negligible in that area of the domain [24]. Although 0.0025 is a reasonable surface roughness value for the Gulf of Mexico region of the model, this is a significantly low number for coastal regions. Additionally, there is a variation of surface roughness along the coasts in general, so an appropriate range to depth needs to be considered. Therefore, the nodal attribute file is implemented into the model, to adequately assign manning's n friction coefficients with accordance to depths. The TxBLEND water circulation salinity transport model was used as a reference when assigning roughness coefficients [10]. The open ocean contains the most considerable value of 0.067, while it decreases with accordance to water elevations [9]. Table 2 below depicts the conditions used to automate the factors onto the finite element grid nodes using the nodal attribute file (fort.13) surface roughness assignment. For any value that ranges between zero to one meter, the coefficient that is implemented onto the node is 0.067. This value is used for the entirety of the Laguna Madre since the elevation depths are an average of one meter. [4] Any node reading an elevation of 20 meters or higher receives a default coefficient of 0.02. Further, a contour map is provided below in Figure 4 to visualize the relationship between the roughness factors and the coastline. It also depicts the numerical values that are inside the Laguna Madre bay area. The red shading in Figure 4 expresses a higher roughness coefficient while the blue is a lower number. Adequate manning roughness factors were implemented into the channels within the finite element domain, like the Laguna Madre, the Brownsville Ship Channel, and the Arroyo Colorado. Theoretically, surface roughness tends to be higher in these areas due to their low elevation and biological factors that increase the friction, such as seagrass."}, {"section_title": "Parameter selections", "text": "Because there is uncertainty with every model developed, improvement efforts are required to achieve the most sophisticated data possible. For hydrodynamic modeling, specifically, parameters like tidal harmonic constituent selection and manning's n values are essential to establish. The ideology behind this model improvement involves a series of steps. The first is to identify an excellent tidal constituent combination and then integrate the appropriate manning's n friction coefficient values. The conglomerate simulation result of both will adequately evaluate which tidal constituent combinations and surface roughness values are best suited for the South Texas hydrodynamic model. The first scenario consisted of using one single tidal constituent, M 2, and the bottom stress toolbox provided by the model parameter and periodic boundary condition file (fort.15). This tidal constituent was selected due to many articles' conclusions about M 2 being an extremely accurate tidal constituent in the deep ocean [9]. Additionally, this M 2 tidal constituent covers the Gulf of Mexico in its entirety. The surface roughness was assigned using the default ADCIRC Model Control constant quadratic function, with the variable of 0.0025. The second scenario consisted of using four tidal constituent combinations, K 1, O 1 , P 1 , and Q 1 , and kept the default ADCIRC Model control constant quadratic function. This is from recommendations made by previous model developers that have worked in the South Texas area and used those parameters for their hydrodynamic model [25]. The third scenario consists of seven tidal constituent combinations, K 1 , O 1 , P 1 , Q 1 , M 2 , S 2 , N 2 , as well as the implementation of the nodal attribute file that assigns manning's n coefficients across the grid to their elevation. These tidal combinations were selected because, according to many pieces of literature regarding ADCIRC modeling applications, there are eight primary constituents specified, and this study uses seven of the eight [14]. Further, the nodal attribute file was created to identify whether the manning's n values provided by the TxBLEND numerical model would prove useful. Figure 5 below depicts the developed scenario's computational results being compared to the actual observed water surface elevation data from NOAA. The computational results and the NOAA data depict the water surface elevation, or storm surge, produced by each of the storms in units of meters. The legend in the figures provides the color specification for each respective computational result.  Figure 5, respectively. Additionally, the default ADCIRC surface roughness value used is referred to as the \"Constant Roughness\" parameter. These results re-confirm the theory that tidal constituents have a pivotal impact on the model stability, for Scenario 1, which only had one tidal constituent, was the most unstable. Scenario 1 proves that global tidal constituents, like M 2 , are stable in the deep ocean but lack resolution for coastal areas. The multiple tidal constituents allow for a higher resolution harmonic analysis [14]. Figure 6 below also visually indicates the wind stress that contributes to the storm surge propagation along the Lower Laguna Madre."}, {"section_title": "Results and discussions", "text": "Hydrodynamic models must be computationally reasonable, which is why observing the wind stress vector data and the water surface elevation data is an integral part of the model development and improvement process. If results show instability, then the numerical values also depict variable data. Figure 6. Hurricane Dolly, 2008, wind stress variation with a two-hour interval. Since Hurricanes are symmetrical, the results of the vectors must clearly define the relationship of these phenomena. The eye is the calmest part of the storm, which would then mean that the wind stress is not as intense in that location. Figure 6 indicates the Hurricane Dolly wind stress that the hydrodynamic model computed. The results shown are from a Scenario 3 model set up, which consists of using seven tidal constituents and adequate manning's n extracted from the nodal attribute files. The wind stress is a significant contributor to storm surge propagation. Specifically, the gusts tend to push water in the circular motion of the symmetrical cyclone. Hurricane Dolly's landfall makes a direct impact on the Laguna Madre, as shown in Figure 6c. From this theory, the surge Hurricane Dolly propagates is pushing the water from the island side to the mainland in a distributed fashion. Figure 7 below depicts the water surface levels from each hurricane tested. The locations vulnerable to storm surge alter depending on the landfall location and direction the storm is moving, which Figure 7 above explains. Generally, the effects of storm surge are prominent in all scenarios regardless of symmetrical tropical cyclone intensity, landfall, and direction. These maps are depicting peak surges along the area, with the red contour being the severely impacted locations. As seen in these figures, the storm translation speeds contribute significantly to how the storm surges propagate. As the hurricane is making its transition from ocean to landfall, its circular wind speeds push surface water towards the land as well. The red contour indicates higher levels of inundation caused by these wind behaviors. Hurricane Bret pushes the water towards the barrier island side due to its landfall location being further up north, as the storm track depicts in Figure 2. Hurricane Alex, on the other hand, pushes the water to the Bahia Grande side due to its landfall location being further down south. Hurricane Dolly makes landfall in the middle of the Laguna Madre, which is why the water inundation across the mainland is uniformly distributed.  Figure 8 indicates the regression analysis that was implemented to identify which scenario worked best with this South Texas hydrodynamic model. This investigation was done by dividing the computational results by the observation data provided by NOAA and comparing the results among each other. The blue solid points are of scenario that did not contain a nodal attribute file, while the red hollow points include one that assigned a specific roughness value to each node present in the model domain. The graphs with the coefficient A depict the relationship of hurricane Bret (1999) with one, four, and seven tidal constituent combinations, which are labeled as A1, A2, and A3, respectively. The B coefficient represents the relationship of hurricane Emily (2005), the C coefficient for Hurricane Dolly (2008), and the D coefficient for Alex (2010). From the visual representation above, the third scenario consisting of the seven tidal constituent combinations depicted the best results. Additionally, the nodal attribute file deemed more accurate than the constant roughness parameter implementation for all scenarios. A statistical index was performed to quantify the accuracy of the hydrodynamic model produced through the three scenarios. The normalized root mean square error (NRMSE) of each execution was calculated to compare these scenarios and identify the most accurate one, as seen in Table 3 below. The formula used for the calculation of NRMSE is shown below: In Eq 1, X c stands for the observed value, X m stands for the experimental value, and N is for the number of times steps each computation entails. The scatter index of the hurricane events was also identified using the following formula: where S i is the observed value, O i is the experimental value, and N is the number of time steps of each of the computational results. Essentially, it is the NRMSE divided by the mean observation. The percent improvement at the peak surges for each of the hurricane scenarios is also computed to gauge the accuracy of the model, and that is calculated using the following percent error formula: The reason for this percent improvement calculation being focused primarily on peak surge is because the goal of this study is to improve the storm surge model, accurate storm surge height predictions must be generated. All the statistical analyses can be seen in Tables 3 and 4 below. The value in front of the T stands for the number of tidal constituents that were used for that computation. The variables after are describing what surface roughness analysis was used. The NA stands for Nodal Attribute, which means that the nodes were assigned a specific surface roughness dependent on water elevation, while the CR stands for constant roughness, meaning there was only one manning's roughness coefficient value of 0.0025 applied to the entire grid. The best consistent computational result includes the seven tidal constituent combinations of K 1 , O 1 , P 1 , Q 1 , M 2 , S 2 , N 2, and the nodal attribute file implemented to assign manning's n coefficients to each node within the finite element grid. Seven of the eight primary tidal constituents provided by the EC2001 were implemented into the model for execution, and it significantly increased the accuracy in the results of the storm surge hydrographs. Comparing the peak surges between the recorded NOAA buoy data and the best computational result using the percentage error method, Hurricane Dolly 2008 computation had a 0.89% error margin. The modeled significant storm surges closely match the measured peak heights the buoy station recordings. There is only one buoy station along this area that has historical water surface elevation levels, so the error that may be caused by missing physics of measurement cannot be avoided. The 7T+NA scenario, which included the seven tidal constituents and nodal attribute files, was pronounced the most accurate. Just as the tidal constituents were essential for the performance of the model, so was the nodal attribute file. A model improves in quality if nodes are specified with the value much closest to their environmental value, rather than having a generic surface roughness for the entire model. Overall, the magnitude of the water surface elevations from all scenarios matches those of the recorded NOAA buoy station. Also, all statistical analysis that was used to quantify the validation of the model computational result agreed with the best scenarios of the seven tidal constituent combinations and integration of nodal attribute file."}, {"section_title": "Conclusion", "text": "The parameter selections that generated the most accurate results thus far are the implementation of the seven primary tidal constituents and the integration of the nodal attribute file that assigns manning's n coefficients concerning bathymetric elevation. Improvements in the model are a very time demanding process. Additional executions must be implemented to achieve a more reliable and accurate hydrodynamic model for local applications. The model constructed for this project entails both the Gulf of Mexico and the Laguna Madre, along with other vital channels and tributaries. Due to the global tidal bases like M 2 lacking the resolution needed for the coastal regions, more than one tidal constituent must be added onto the model for more accurate performance. Also, because of the limited number and combinations of appropriate tidal constituents, the seven principle constituents stated to be most useful are to be implemented from here on out. Further, hurricane surge and hurricane rainfall are not mutually exclusive events and, therefore, should be studied comprehensively, which is something that is in place for future research. It is essential for models such as these to adequately indicate which areas are vulnerable in order to take the appropriate action in mitigation plans. Consequently, it is imperative that there are accurate estimations of extreme water levels, and those efforts are being made for this hydrodynamic model to provide the best possible result to the South Texas region. The calibration process provided in this paper can help other development of models that will focus on local areas of South Texas, like the Laguna Madre. Implementing the seven tidal harmonic constituents of K 1 , O 1 , P 1 , Q 1 , N 2 , M 2, and S 2 , as well as the surface roughness values provided by the integrated nodal attribute file, will significantly improve hydrodynamic models whose area of interest is the South Texas region. Additionally, this model has the potential to allow emergency responders of the area to identify the most feasible application for storm surge barriers, develop a deeper understanding of the coastal infrastructure impacts and ultimately improve the resilience of the area against more influential geophysical events in the future."}]