[{"section_title": "Abstract", "text": "Abstract-Learning functional connectivity (FC) network from resting-state function magnetic resonance imaging (RSfMRI) data via sparse representation (SR) or weighted SR (WSR) has been proved to be promising for the diagnosis of Alzheimer's disease and its prodromal stage, mild cognitive impairment (MCI). However, traditional SR/WSR based approaches learn the representation of each brain region independently, without fully taking into account the possible relationship between brain regions. To remedy this limitation, we propose a novel FC modeling approach by considering two types of possible relationship between different brain regions which are incorporated into SR/WSR approaches in the form of regularization. In this way, the representations of all brain regions can be jointly learned. Furthermore, an efficient alternating optimization algorithm is also developed to solve the resulting model. Experimental results show that our proposed method not only outperforms SR and WSR in the diagnosis of MCI subjects, but also leads to the brain FC network with better modularity structure."}, {"section_title": "INTRODUCTION", "text": "Alzheimer's disease (AD) is the most prevalent form of dementia in elderly people over 70 years of age. It accounts for about 50% to 80% of age-related dementia [1] . Mild cognitive impairment (MCI), as an intermediate stage of brain cognitive decline between AD and normal aging, shows mild symptoms of cognitive impairment. MCI does not significantly impact daily functioning, but it is associated with increased risk of developing to AD. For example, individuals with MCI can progress to clinical AD at an annual conversion rate of 10-15%, compared with normal controls (NC) who develop to AD at much lower annual conversion rate of approximately 1-2% [2] . Therefore, early diagnosis of MCI is important for reducing the risk of developing AD by appropriate pharmacological treatments and behavioral interventions. However, diagnosing MCI from the undergoing normal aging is difficult, because of its mild symptoms of cognitive impairment.\nResting-state functional magnetic resonance imaging (RS-fMRI) [3] can measure the blood-oxygenation-leveldependent (BOLD) signals of the brain when a subject is not performing any explicit task. RS-fMRI technique provides an efficient and noninvasive way for the investigation of neurological disorders at a whole-brain level. It holds great promise and has been successfully applied to the early diagnosis of AD/MCI before development of clinical symptoms.\nLearning brain functional connectivity (FC) network [4] from BOLD signals is a prevalent approach to infer brain functional organization. FC measures the temporal correlation of BOLD signals in structurally separated brain regions [5] . In most studies, FC network is characterized by graph, in which a node corresponds to a brain region and an edge connects a pair of brain regions. Previous studies have suggested altered FC network in MCI subjects [6] and such alterations occur many years before clinically detectable with cognitive tests [7, 8] . Pearson's correlation is probably the most widely used approach to capture the pairwise correlation between brain regions. This method is intuitive and computationally efficient because of its simplicity. However, it ignores the impact of other brain regions, thus insufficient to provide adequate and complete information on the interactions among multiple brain regions [9] [10] [11] . Moreover, the resulted FC network is often quite dense, containing possible spurious or insignificant connections.\nTo overcome the drawbacks of Pearson's correlation, some other FC modeling methods have been developed, such as partial correlation, high-order correlation [10, 12, 13, 28, 29] , and another widely-accepted method such as sparse representation (SR). It is generally believed that a brain region interacts directly with only a few other brain regions [14] . Therefore, learning FC network from BOLD signals via SR has attracted increasing attention [15, 9, 14, 16] . In particular, l 1-norm regularization based SR [15, 16] is a typical approach to construct sparse FC network. Based on the BOLD signals of each brain region, SR represents one brain region using as few other brain regions as possible via linear combination. However, other brain regions are typically treated equally, without considering their strength of correlation with the target brain region. Intuitively, a brain region that highly correlates with the target brain region tends to have larger SR weight. To incorporate such information, weighted SR (WSR) was proposed [15] To this end, we propose a novel \"pairwise-similarity guided sparse representation (PSGSR)\" method for learning brain FC network from RS-fMRI data. The motivation comes from the following hypotheses. First, for the two brain regions with similar pattern of BOLD fluctuations, their representations over the other brain regions should be also similar. Second, the representations of any other brain region over the two brain regions with similar BOLD fluctuations should be also similar. Based on these intuitions, we propose two novel regularization terms and incorporate them into the framework of WSR. To solve the PSGSR model, we develop an efficient iterative algorithm by combing bound optimization and alternating optimization techniques. After constructing the brain FC network for each subject, a machine learning framework consisting of feature extraction, selection, and pattern classification is used to distinguish MCI from NC subjects."}, {"section_title": "II. METHODOLOGY", "text": ""}, {"section_title": "A. Sparse and weighted sparse representation", "text": "Suppose the whole brain is parcellated into brain regions (or regions-of-interest, ROIs) based on a specific brain atlas. Let the regional mean BOLD signal of the ROI be denoted by a column vector , where is the total number of time points. In the SR-based approach, is supposed to be approximated by a linear combination of BOLD signals of other ROIs. Mathematically, we have (1) where the weight reflects the contribution of in representing , and is the approximation error. The weight can be calculated by (2) where denotes the -th column, is the l1-norm, is a balance parameter used to control the degree of sparsity. In (2), each is treated equally in the representation of . On the other hand, the weighted SR (WSR) [15] is proposed recently as given below:\nwhere denotes element-wise multiplication, , is the Pearson's correlation between ROIs and , is a positive parameter used to control the contribution of the different values of . From (3), we can observe that, if ROI is highly correlated with ROI , will have a small value such that the resulting tends to be large. For other ROIs, we also have similar formulation as (3). Therefore, the whole-brain weighted sparse FC network can be obtained by solving the following optimization problem: (4) where , , , denotes the l1-norm of , and indicates the diagonal elements of ."}, {"section_title": "B. Pairwise-similarity guided sparse representation", "text": "In both SR (2) and WSR (3), the inherent relationship between the representations of different ROIs is largely ignored. To address this limitation, we propose to learn the representations of all ROIs jointly by introducing an ROI relationship induced penalty into the WSR model. An illustration of our method is shown in Figure 1 .\nFirst \nwhere , and is called Laplacian matrix in spectral graph theory [17] ( is a diagonal matrix whose entries are the row sums of ). As a result, if the BOLD signals associated with ROIs and have similar fluctuation patterns, we will obtain a larger weight , which further makes their representations and more similar.\nFrom another view angle, suppose that the BOLD signals associated with ROI is linearly represented by the BOLD signals associated with other ROIs (including and ). If and have similar fluctuation patterns, we expect that the resulting representation coefficients and also likely to be similar. Therefore, from a symmetrical perspective, as (5), we also define the following constraint: (6) where denotes the -th row of . By integrating (4), (5) and (6) together, we finally obtain the following pairwise-similarity guided sparse representation (PSGSR) model for FC network construction: (7) where , are the parameters that control the importance of the respective constraint terms. Obviously, PSGSR degenerates to WSR when . After calculating for each subject using (7), we follow [15] and take the average of and its transposed one, e.g., , in order to obtain a symmetric FC network. "}, {"section_title": "C. Optimization algorithm", "text": "In order to solve the problem (7), we further develop an effective iterative algorithm by combing two optimization strategies, i.e., bound and alternating optimizations [18] .\nLet us define\nFirst, for any variable , we have (9) where is an arbitrary nonzero value. The equality holds when . Then, we have (10) where , denotes a constant, and is a diagonal matrix with element as follows (11) Then, let us define (12) Thus, we have ,\nIt means that is a tight upper bound of original objective function (8) . Therefore, following the principle of bound optimization, we can optimize , instead of , so as to get the next approximate solution. Specifically, we have the following problem: (14) To solve (14), we further develop an effective alternating optimization algorithm where the column of is alternatively optimized while fixing the other. For example, in order to optimize , we can rewrite (14) as (15) where the terms irrelevant to have been eliminated. In order to handle the constraint , we remove the -th element from and , and denote the resulting vectors as and . Similarly, let , , denote the original matrices with the -th row and column removed. Then, (15) can be simplified as the following unconstrained problem (16) To find the optimal solution for (16), we set the derivative with respect to equal to zero, which leads to the closed-form solution as follows: (17) where is an identity matrix with appropriate dimension."}, {"section_title": "D. Feature extraction, selection and classification", "text": "After FC network has been constructed for each subject, local clustering coefficients for weighted graph (WLCC) [19] are used as features of all brain regions in the network. WLCC is computed for each node in a weighted graph to quantify the probability that the neighbors of this node are also connected to each other. Thus, each subject with ( in this work) ROIs is represented by a feature vector with elements. Many features might be redundant or irrelevant to classification. In order to alleviate overfitting and construct effective classification model with better generalization, reducing the number of features is a crucial issue. In this study, sparse regression LASSO [20] is used to select a small subset of features which are important for classification. After selecting a few number of features for each subject, a support vector machine (SVM) model with linear kernel [21, 22] is constructed for classification."}, {"section_title": "III. EXPERIMENTS AND RESULTS", "text": "Next, we evaluate the effectiveness of the proposed method in the application of MCI classification. Some closely related FC network construction methods, such as Pearson's correlation (PEC), SR, and WSR are also included for comparison. The proposed learning framework was implemented on MATLAB 2012b environment. Leave-one-out cross-validation (LOOCV) is applied to evaluate the generalization of different methods because of its popularity. Another nested LOOCV on the training samples is applied to select optimal hyperparameters in each method."}, {"section_title": "A. Data", "text": "The publicly available neuroimaging data from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database are used. In this work, 97 age-and gendermatched subjects (49 MCI and 48 NC) are selected from the database. These subjects were scanned using 3.0T Philips scanner. To preprocess the acquired fMRI data, SPM8 software (http://www.fil.ion.ucl.uk/spm/software/spm8) was utilized. In particular, for magnetization equilibrium, the first three RS-fMRI volumes of each subject were discarded before preprocessing, leaving 137 volumes. To correct head motion, rigid body transformation was used where the subjects with head motion larger than 2 mm or 2 degrees were discarded. The fMRI images were normalized to the Montreal Neurological Institute (MNI) template. The images were spatially smoothed using an isotropic 8-mm full-width-at-half-maximum (FWHM) Gaussian kernel. We did not conduct scrubbing to the data with frame-wise displacement larger than 0.5, as it would introduce additional artifacts. The subjects who had less than 4.5 min RS-fMRI data were excluded from further analysis. The images were parcellated into 90 ROIs, defined based on the automated anatomical labeling (AAL) atlas. Mean RSfMRI time series of each ROI was calculated and band-pass filtered (0.015 f 0.15Hz). Head motion parameters (Friston24 model), together with the mean BOLD signals of white matter and cerebrospinal fluid, were regressed out from the regional mean BOLD signals."}, {"section_title": "B. Algorithm convergence", "text": "The optimization algorithm proposed to solve (7) is essentially iterative. Thus, we investigate how it converges. Figure 2 shows the convergence curve for the two randomly selected subjects. The y-axis denotes the value of the loss function, and x-axis denotes the iteration number. We can observe that the proposed method converges very fast. In most cases, the algorithm converges in less than 30 iterations. "}, {"section_title": "C. Classification performance", "text": "To comprehensively measure the performance of the different methods, we use the following indices: accuracy (ACC), area under ROC curve (AUC), sensitivity (SEN), and specificity (SPE). As we can see from Table 1 , SR achieves better performance than PEC. This may be because SR is able to measure complex interaction relationship among multiple brain regions and at the same time removes many spurious and redundant connections. Furthermore, we can see that WSR outperforms the original SR because the former focuses more on the brain regions with strong Pearson's correlation while the latter equally treats all brain regions during SR. After further introducing prior knowledge about brain regions, the proposed PSGSR further improved the performance of MCI classification. The result confirms that learning the representations of all brain regions jointly can effectively make use of the inherent high-level relationship among the brain regions. Figure 3 illustrates the FC networks constructed by PEC, SR, WSR, and the proposed PSGSR for a randomly selected subject. As can be seen, PEC leads to a dense network which contains too many potentially spurious or insignificant connections. In contrast, the other three methods all can generate sparse networks. Nevertheless, the result of SR is difficult to interpret because it lacks notable structure. WSR is slightly better than SR because WSR incorporates Pearson's correlation as prior. Among all the methods, PSGSR can generate a FC network with both sparsity and better modularity structure. "}, {"section_title": "D. FC networks", "text": ""}, {"section_title": "E. Discriminative ROIs", "text": "Note that the proposed approach is evaluated by nested LOOCV. In different folds of LOOCV, we have different training and testing subjects and the hyperparameters optimized could be different as well. In this study, LASSObased feature selection was used to select a small number of features that are crucial for diagnosis. Only the features with sufficient discriminative ability were frequently selected. Therefore, those frequently selected features during the LOOCV are regarded as important for MCI diagnosis. Following this criterion, the most discriminative ROIs are shown in Figure 4 . In summary, these ROIs are generally believed to be related to AD. For example, parahippocampal gyrus is an important biomarker in distinguishing AD patients from NC because the volume of the parahippocampal gyrus is significantly reduced in AD [23] . Sofie et al. [24] proposed that FC of the occipital cortex is likely to be affected in early-onset AD patients, which indicates an increased vulnerability of this brain region. Latha et al. [25] found that gray matter volume in the right supramarginal gyrus was reduced in AD patients, thus leading to poor memory performance and visual recognition deficits. In [26] , the authors found that the volume of thalamus was significantly reduced in the patients diagnosed with AD and this degenerative process may contribute to cognitive decline in AD. Some studies [27] found significant brain volume reduction in the caudate in AD patients, compared to NC subjects."}, {"section_title": "IV. CONCLUSION", "text": "In this paper, we have presented a novel sparse representation based FC modeling approach for MCI diagnosis. This work is motivated by the fact that previous SR/WSR-based approaches represent each brain region independently without considering their inherent interactions. Therefore, we propose that the brain regions with similar BOLD signals should have similar representations and play a mutually similar role in the representations of other brain regions. Based on this assumption, we step forward and propose a pairwisesimilarity guided sparse representation for brain FC network modeling, and develop a machine learning framework for MCI diagnosis. The results show that our approach not only enhances the modularity structure of the brain FC network, but also leads to better diagnosis performance. "}]