[{"section_title": "Abstract", "text": "Lehallier B, Essioux L, Gayan J, et al; Alzheimer's Disease Neuroimaging Initiative. Combined plasma and cerebrospinal fluid signature for the prediction of midterm progression from mild cognitive impairment to Alzheimer disease. the next visits. MCI reverters to \"Normal\" and MCI progressors to \"dementia due to other etiology\" than AD were excluded from the analysis."}, {"section_title": "eMethods. Data Preprocessing and Selection of Patient Variables 1. Preprocessing of data", "text": "Data used in the preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu). The ADNI was launched in 2003 as a public-private partnership, led by Principal Investigator Michael W. Weiner, MD. The primary goal of ADNI has been to test whether serial magnetic resonance imaging (MRI), positron emission tomography (PET), other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of mild cognitive impairment (MCI) and early Alzheimer's disease (AD). Determination of sensitive and specific markers of very early AD progression is intended to aid researchers and clinicians to develop new treatments and monitor their effectiveness, as well as lessen the time and cost of clinical trials. ADNI is the result of efforts of many co-investigators from a broad range of academic institutions and private corporations, and subjects have been recruited from over 50 sites across the U.S. and Canada. The initial goal of ADNI was to recruit 800 subjects but ADNI has been followed by ADNI-GO and ADNI-2. To date these three protocols have recruited over 1500 adults, ages 55 to 90, to participate in the research, consisting of cognitively normal older individuals, people with early or late MCI, and people with early AD. The follow-up duration of each group is specified in the protocols for ADNI-1, ADNI-2 and ADNI-GO. Subjects originally recruited for ADNI-1 and ADNI-GO had the option to be followed in ADNI-2. For up-to-date information, see www.adni-info.org.\nIn a subset of the ADNI cohort (n=566, of which 396 with MCI) plasma proteins were measured using a 190 analytes multiplex immunoassay panel and 311 CSF samples (149 from MCI) were analyzed with a different 159 analytes version of the panel (eTable3). Raw CSF and plasma data were pre-processed separately, as follows:\n(1) analytes with more than 10% values lower than the limit of quantification were removed from the analysis; (2) non-numeric values were imputed and replaced with half of the least detectable dose; (3) values more than 5 standard deviations from the mean were considered outliers and assigned to the value of the nearest non-outlier point; (4) samples with more than 25% of imputed values were removed; and (5) log10 transformation was performed if distribution within each diagnostic group was not normal (Shapiro test, P≤0.05). After preprocessing and filtering, 134 plasma factors and 74 CSF factors were available for the analysis (eTable3).\nCSF measurements for individuals with abnormal CSF red or white blood cells counts (RBC, WBC respectively) were removed from the analysis. High levels of RBC may be a sign of bleeding into the spinal fluid or the result of a traumatic lumbar puncture and increased WBC may be a sign of meningitis, acute infection or another disease and could be a confounding factor. Thresholds of RBC>500 or WBC>5 were used.\nDifferent laboratories had previously analyzed the ADNI MRI images resulting in several preprocessed dataset. We used volumetric MRI measurements generated by the UCSD team. Lateralized volumes of 7 brain regions (table 1) were available for 734 subjects in addition to brain size and estimated intracranial volume (EICV). We averaged the lateralized volumes of each brain region and normalized it by the EICV.\nGender was coded as a semi quantitative variable for correlation analyses and all data were normalized using Z-scoring to eliminate the unequal units."}, {"section_title": "Subjects and variables used for prediction of progression from MCI to AD using combinations of specific individual patient variables", "text": "We limited our analysis to subjects and variables with sufficient amount of available data and focused on 94 subjects and 224 variables (Table 1, eTable3) out of 249 variables used in the correlation analysis. To focus on progression from MCI to AD, we used only MCI subjects related to AD according to ADNI criteria. Subjects indicated as \"MCI-Other\" in the ADNI database were excluded except those diagnosed as \"MCI-Other\" at the baseline visit but consistently diagnosed as \"MCI due to Alzheimer's Disease\" during"}, {"section_title": "Selection and combination of specific individual patient variables for the prediction of progression from MCI to AD", "text": "To identify variables associated with progression from MCI to AD within 1-6 years, we used elastic net 1,2 in an iterative resampling of training-and-test based variable selection and modeling approach.\nElastic net is a regularized regression method that linearly combines the ℓ1 and ℓ2 penalties. It offers sparse solutions but also has the advantage of performing well with highly correlated variables. For each classification problem we considered, the dataset was divided into training (2/3 of the data) and test subsets (1/3 of the data) by stratified sampling. Subsequently, elastic net was applied on the training subset to select variables which best discriminate between MCI stable and MCI progressors. Alpha is for the elastic net mixing variable: range α ∈ [0,1]; α=0 specifies a pure ℓ2 penalty (ridge regression); α=1 specifies a pure ℓ1 penalty (LASSO). Alpha=0.8 was chosen to ensure sufficient ℓ1 penalty in order to make stringent variable selection (close to a LASSO penalty). For each model, we used the \"lamda.min\" as the shrinkage variable estimated after 10-fold cross-validation (CV) of the learning dataset. Quality of each model was estimated on the test dataset using the classification accuracy rate, sensitivity, and specificity.\nTo minimize the error of variable estimates due to samples selected in the training dataset used for model estimates, 1000-fold resampling of the learning and test datasets were performed. For each of the resampled dataset, the shrinkage variable was estimated after 10-fold CV and classification accuracy rate, sensitivity, and specificity were averaged across the 1000 resampled datasets 3 . Stability of each model was estimated using the standard deviation of the classification accuracy rate across resampled datasets. A small standard deviation across permutations (close to 0) demonstrates a high stability of the model. Elastic net allowed the selection of important variables to predict progression from MCI to AD but models slightly varied in terms of variables included across resampled datasets. To select the \"top variables\", variables were ranked according to their number of appearance across permutations in the elastic net models 4, 5 . To refine these predictive models to a simpler final model and to further minimize the number of variables in the model to reach optimal classification accuracy rates, sensitivity, and specificity, we then used a forward classification strategy. A ridge regression model (α=0, \"lamda.min\" as the shrinkage variable estimated after 10-fold CV) was built using the learning dataset with the top 2 variables selected by elastic net and final quality of this model was estimated on the test dataset. Again, 1000-fold resampling of the learning and test datasets was performed to estimate model quality. This process was then repeated iteratively using the top 3, top 4 […] up to top 20 variables.\nFinally, to validate the best predictive models, we compared their results with those obtained by chance. To keep the data structure, we permutated the phenotypes (MCI progressors to AD or not) of the subjects and applied the same modeling and variable selection strategy. As an additional control, we also applied the same strategy to randomly generated data (224 dummy variables) following either a normal or uniform distribution (eTable 6 Numbers in the table correspond to how many times a variable was selected across 1000 permutations. "}, {"section_title": "eTable 6. Comparison of the Best Model of Progression to AD Within 3 Years With Randomly Generated Data", "text": ""}]