[{"section_title": "", "text": "Intended for educators and researchers in the field of early childhood education working with children from immigrant families, this article first briefly addresses the relationship between home literacy environment and English language learners' literacy development in both their heritage language and English. Second, through surveying the literature, I identify three different areas in which a home literacy environment influences English language learners' literacy development: (a) through language attitudes and parental beliefs; (b) through identity formation; and (c) through literacy behaviour of immigrant parents. Some helpful strategies learned from the literature are provided for educators to use with newcomer families in support of children's literacy development.\nLiteracy development is essential to a child's school performance and future success. Yet, literacy is not a single, monolithic, and autonomous construct (Street, 2000) . Here, literacy is defined as a social practice that is socially constructed in educational and cultural contexts, including skills in dealing with printed and nonprint-based texts and in critical thinking (Kahn & Kellner, 2005) . This definition is in contrast to a singular, autonomous notion of literacy in which literacy development emphasizes decoding a text and studies involve the analysis of literacy rates, comprehension levels, ages, and reading and writing skills (Kahn & Kellner, 2005) . Multiple literacies consider literacy to be a social practice (Street, 2000) , where context and meaning in groups of different cultural, linguistic, and socioeconomic backgrounds need consideration. Just as cultural and linguistic backgrounds in families vary, literacy practices vary between and within cultures.\nIn addition, rapid development in technology has changed how we look at literacy; the idea of multiliteracies shifts our thinking about literacy from privileging the printed text to acknowledging various ways that literacy is practiced in a society (Cope & Kalantzis, 2009) . With the increasing use of technology, literacy is no longer restricted to an ability to deal with printed texts, but has expanded to include electronic and multimedia modes. Nonetheless, as Cope and Kalantzis (2009) argue, \"whichever way we look, written language is not going away. It is just becoming more closely intertwined with the other modes\" (p. 182).\nIn this paper, an English language learner (ELL) will refer to preschool and early elementary grade children whose first language is not English and who are learning English as a second language in a North American setting (Shi, 2011) . Learners of English as a second language may include children from Africa, Bangladesh, Hispanic regions, China, Laos, and many others (Shi, 2012) . Although different terms appear in the literature to describe such learners, English language learner is increasingly utilized because it highlights the learning process instead of a deficiency in nonnative English-speaking students (Gere, 2008) .\nBecause literacy is a socially constructed practice, children who are learning English and whose parents speak another language and come from a culture different from that of the mainstream culture will inevitably be influenced by literacy practices at home. Therefore, I have prepared a representative (not comprehensive) review of published research in the past decade that is focused on preschool to early elementary grade children and addresses the relationship between a home literacy environment (HLE) and ELL literacy development. I will:\n1. define the concepts of HLE and home literacy practices and briefly review relevant research regarding the relationship between home literacy practices, heritage language maintenance, and the acquisition of English as a second language. 2. identify three areas in which a HLE influences ELL literacy development: (a) language attitudes and parental beliefs; (b) identity formation; and (c) literacy behaviour of immigrant parents. 3. identify strategies that educators can use to work with newcomer families in support of their children's literacy development.\nA child's literacy development involves home, school, and community support. In this paper, I focus the discussion on the literacy environment at home (Burgess, Hecht, & Lonigan, 2002; Sénéchal & LeFevre, 2002; Teale, 1986) . A HLE consists of a variety of attitudes, resources, and practices in the home that influence children's literacy practices and development (Burgess, Hecht, & Lonigan, 2002) . In the literature, researchers define the HLE in a variety of ways. Teale (1986) , for example, categorize the HLE as a physical and social environment, defining it as (a) the physical environment where print exists; and (b) the social environment where children, siblings, and parents interact with print. However, this construct emphasizes the role of print in literacy development. Cope and Kalantzis (2009) suggest that it is important to consider multiliteracies, with \"linguistic, visual, audio, gestural and spatial modes of meaning becoming increasingly integrated in everyday media and cultural practices\" (p. 166). Alternatively, Burgess, Hecht, and Lonigan (2002) define the HLE as either passive or active. In a passive environment, parents indirectly model behaviours such as parental leisure reading, parental literacy beliefs, the number of books at home, and public library visits. In an active environment, parents engage children in literacy activities, such as shared reading activities. Similarly, Sénéchal and LeFevre (2002) define home literacy activities as informal or formal. Informal experiences focus on information in a storybook, such as the meaning of a story, while formal literacy experiences centre on print, such as talking about the letters or providing the names and sounds of specific letters. However, the definitions proposed by Burgess, Hecht, and Lonigan (2002) and by Sénéchal and LeFevre (2002) are from studies with English native speakers rather than English language learners. In addition, these definitions ignore the concept of multiliteracies.\nOf these different definitions, I have adopted that of Teale (1986) ; however, I extend the idea of a physical literacy environment to include multiliteracy elements, such as the multimodal texts in Pokemon and Yugio characters presented in television, film, and game cards (Pahl, 2003) . Here, I focus on linguistic, visual, and audio elements of literacy behaviour without considering gestural and spatial modes of meaning in literacy activities. I maintain that a HLE consists of a number of activities that children observe at home and activities in which parents participate actively. A HLE also includes parental beliefs regarding literacy, the parental education level, the family socioeconomic status, the number of books at home, and daily life activities in the social domains (Auerbach, 1989; Teale, 1986; van Steensel, 2006) .\nWith the understanding that literacy practices are socially constructed, children's literacy experiences in daily life will inevitably influence their literacy development. Many different terms are used interchangeably in the literature (Street, 2000) to refer to literacy experiences, such as literacy events, literacy activities, literacy patterns, literacy strategies, and literacy situations. I use the term literacy practices to denote children's multiple literacy experiences in home settings. The idea of literacy practice refers to a broad \"cultural conception of particular ways of thinking about and doing reading and writing in cultural contexts\" (Street, 2000, p. 22) and offers the potential to understand observable behaviour within different cultural contexts. That is, the concept of a literacy practice is broader than that of literacy events as the latter is used primarily in a descriptive way without offering any possibility of understanding how meaning in literacy is constructed (Street, 2000) .\nTo attain an understanding of how a HLE influences ELL literacy development, current research has taken two approaches. One line of research examines the effect of the HLE on heritage language maintenance. A heritage language is a language other than English that is associated with an individual's ethnic or cultural background (Chinen & Tucker, 2005) . In terms of order of acquisition, this is the first language for an individual; however, an individual may not completely acquire this language because of a transfer to the dominant language, such as English, in a host country (Valdés, 2000) . The role of heritage language maintenance in promoting second language development is well documented in the literature; heritage language maintenance is directly associated with English proficiency and academic achievement (Suarez, 2007; Yeung, Marsh, & Suliman, 2000) . Bilingualism is not a disadvantage for children who are acquiring literacy in a second language (Dickinson, McCabe, Clark-Chiarelli, & Wolf, 2004) . Cummins (1981 Cummins ( , 1983 proposes a common underlying proficiency model to explain this effect, where literacy-related skills are transferable across languages. Cummins (1981) argues that, given adequate exposure to a second language, concepts developed in the first language can be transferred. However, it may be noted that ELLs have diverse backgrounds in terms of heritage language proficiency. Some learners might develop their first language literacy in formal educational settings while others start and develop the language at home.\nResearchers have identified a number of practices of a HLE that positively influence heritage language maintenance Farruggio, 2010; Lao, 2004; Wu, 2005) . These practices may include, but are not limited to, sending a child to a heritage language school, speaking a heritage language at home (Liao & Larke, 2008) , emphasizing the value of learning the language (Chinen & Tucker, 2005; Lynch, 2003) A second line of research uses a variety of methods and designs (e.g., ethnography and case study) to examine how home literacy practices influence ELL literacy development in second language acquisition (Garcia, 2008; Li, 2006a; 2006b; Menard-Warwick, 2005; Perry, Kay, & Brown, 2008; Reese & Gallimore, 2000; Zhang, 2007) . Given the complex and heterogeneous population of ELLs, qualitative researchers in the last decade have employed interviews, observations, focus groups, and documents in the study of the HLE (Shi, 2012) . These studies include analyses of how the HLE affects the literacy behaviour of Chinese children (Liu & Vadeboncoeur, 2010) , how immigrant parental beliefs affect literacy acquisition (Garcia, 2008) , and how Chinese immigrant family human and social capital affect literacy (Li, 2006a) . These studies examine the HLE of learners from many different ethnic backgrounds and demonstrate that a HLE shapes the development of English language literacy (Shi, 2012) .\nIn summary, current research helps us to understand the scope and complexity of the HLE of immigrant families from diverse socioeconomic and ethnic backgrounds. However, there is a lack of consideration in the literature of how HLE influences ELL children's literacy development in specific areas. It is important to connect both heritage language maintenance and learning English as a second language to ELL literacy development because these two areas may embody distinct HLEs in literacy development. Therefore, a review of the literature in both areas is of paramount importance."}, {"section_title": "The Influence of the Home Literacy Environment on Literacy Development", "text": "Here, I review the literature in the past decade and propose that three areas of a HLE influence ELL children's literacy development: (a) language attitudes and parental beliefs; (b) identity formation; (c) literacy behaviour of immigrant parents. I will examine the relevant research in each area."}, {"section_title": "Language Attitudes and Parental Beliefs", "text": "The literature regarding the HLE states that language attitudes and parental beliefs influence children's literacy development. For instance, Li (2006c) argues that parents' attitudes toward their status as a minority group and toward their heritage language predict the language choices of their children. The attitude that parents take toward a language is described as positive or negative feeling (Richards, Platt, & Platt, 1992) . In addition to positive or negative feelings, parents may have instrumental or integrative attitudes toward learning a language (Gardner & Lambert, 1972) . Those with instrumental language attitudes have utilitarian goals and focus on achieving personal success and status in society, while those with an integrative language attitude are characterized by a desire to be identified with a language-speaking group. The positive or negative, instrumental or integrative language attitudes that parents have toward a heritage language directly affect their home language behaviour, which, in turn, inevitably affects the extent to which the home language is maintained. As Fishman (1996) argues, culture is expressed through language, and a language loss indicates that a way of valuing is lost. He argues the importance of involving family life to maintain a heritage language instead of relying solely on the school system.\nA wealth of research now links parental language attitudes to heritage language maintenance Douglas, 2005; Farruggio, 2010; Finch, 2009; Isurin & Ivanova-Sullivan, 2008; Lao, 2004) . Immigrants with integrative attitudes from different ethnic, cultural, and linguistic groups often encourage their children to maintain a heritage language by emphasizing the value of learning the language and encouraging pride in the language and culture (Chinen & Tucker, 2005; Lynch, 2003) . In this way, parents demonstrate an integrative language attitude by strongly supporting the preservation of a heritage language and cultural roots for their children (Farruggio, 2010 (Farruggio, 2010) . Most parents held integrative language attitudes and referred to Spanish as \"our language\" (Farruggio, 2010, p. 15 Even if parents hold positive language attitudes toward heritage language learning, they may behave passively and have low expectations of their children (Liao & Larke, 2008) . Over time, parents make diminishing effort and investment in their children's language maintenance (Lee, 2002; Shin, 2005) . As well, negative parental language attitudes will inevitably negatively influence children's heritage language maintenance. Some parents think it is difficult for their children to acquire reading and writing skills in a heritage language due to lack of input and resources in the mainstream society (Liao & Larke, 2008 Similarly, in an earlier study, Li (2001) concluded that parents' language beliefs were related to their cultural background. Immigrant parents come to Canada with their own understanding and cultural beliefs about literacy. For example, Chinese parents are more likely to hold a strong impact parental belief toward children's literacy development. As one participant in the Li (2001) study mentioned, \"Chinese culture and education is good for children, and we are used to it, so we should parent our child in a Chinese way\" (p. 485). She was particularly dissatisfied with weaker intellectual challenges in Canadian schools: \"For me, I think that elementary and secondary school education in China is better than that of Canada. You know, children go to school to learn something\" (p. 485). To fix their perception of shortcomings, they intervene directly through teaching or tutoring at home (Li, 2001 ). In addition, Chinese immigrant parents are influenced by a Confucian ideology that emphasizes the authority of text, classics, and schools. Li (2000 Li ( , 2006 maintains that literacy practices in immigrant families coming from a more traditional Chinese school model, which emphasizes rote learning, homework, standardized material, and a transmission approach to learning, provide the basis of a home literacy support environment for their children (Li, 2000 (Li, , 2006b ).\nIn summary, language attitudes and parental beliefs inevitably influence how parents view a heritage language and their role in children's literacy development, which will inevitably influence their literacy behaviour. However, it should be noted that even when parents hold a positive language attitude toward heritage language, they have concerns in supporting their children's heritage language maintenance."}, {"section_title": "Identity Formation", "text": "It is important to recognize that identities and literacy practices are linked and interrelated (Compton-Lilly, 2006) . Identities are formed within relationships with others and are constantly subject to the influences of other people and institutions (Kendrick, 2005) . As McCarthey and Moje explain (2002), \"identities are always situated in relationships\" (p. 231). I utilize Norton's (1997) notion of identity, which presents the relationship between self and the world around self. Identity is defined as \"how people understand their relationship to the world, how that relationship is constructed across space and time, and how people understand their possibilities for the future\" (p. 410). Norton's notion of identity includes both the relationship between oneself and the world and the relationship between oneself and the future. She maintains that identity is a process of continual emerging and becoming, a process that identifies what a person becomes and achieves.\nMaintaining a heritage language is a way of constructing a learner's cultural identity and, hence, his or her relationship to the world . Archer, Francis, and Mau (2010) draw on a qualitative study conducted in six Chinese heritage schools to investigate the relationship between heritage language maintenance and identity formation. This study found that parents valued heritage language schools as a means of encouraging and helping children to feel (or be) \"more Chinese\" (p. 411). The loss of Chinese language was equated with loss of identity or identity crisis. Similarly, with Spanish heritage language learners, Farruggio (2010) maintains that parents want their children to remember that they are \"Hispanos\" or \"Mexicanos.\" Spanish loss was viewed as a loss of Latino identity (Farruggio, 2010) . In analyzing Korean heritage learners, Lee and Kim (2008) found that the motivation to learn Korean was tied to identity, family, and ethnic community. Students who identified with their ethnic background generally assessed their language proficiency as higher than students who identified less (Finch, 2009 ).\nTo learn a heritage language means not merely to inherit one's language and maintain one's cultural identity, but also to transform the heritage language and recreate one's identity (He, 2006) . A learner's previous linguistic experience inevitably influences and recreates his or her identity (He, 2006) . However, this does not mean that educators should accept learners' pregiven identities as fixed (Menard-Warwick, 2005) . As learners construct and reconstruct identities, they take on new practices (Menard-Warwick, 2005) . As McCarthey and Moje (2002) maintain, \"it seems that we are trying to work through how identities are coherent, yet hybrid and stabilizing, yet dynamic\" (p. 232).\nEnglish language learners bring with them an identity that affects their language and literacy development. A learner may carry multiple identities and multiple discourses (McCarthey & Moje, 2002) . MenardWarwick (2005) theorizes about identity in second language acquisition and literacy studies through a review of the studies in the field. She concludes that \"learning a language or taking on new literacies in a particular social context has consequences for the identities of its users\" (p. 254). When language and literacy development activities are matched with how a learner sees him-or herself and his or her relationship with the world, learning is enhanced (Menard-Warwick, 2005) .\nLiteracy and literacy practices are means for performing particular identities. Monzo (2010) has raised interesting questions about language learning and identity through home literacy practices. Through an ethnographic study, eight Latino families were examined with over 200 home visits, with two hours of home observation and one classroom observation per week. In addition, interviews were conducted with grade five elementary children, their older siblings, their parents, their classroom teachers, community members, and other teachers. Monzo (2010) found that parents engaged in cultural practices that supported the development of children's academic identities. In addition, through active participation as translators and decision makers at home through two languages, children developed confidence, which is closely associated with academic performance. Smith (1988) referred to the need for children to identify themselves as a member of literacy club. He explained that members of the literacy club are people who read and write, even the beginners, and the fact that one is not very competent yet is no reason for exclusion or ridicule. A newcomer is the same kind of person as the proficient club member, except that he or she hasn't yet had as much experience. It is the same in all normal sports and recreation clubs. (p. 11) When children identify themselves as a member of a literacy club, they see themselves as the same kind of people as the more proficient club members, who are already able to read and write and participate in literacy activities. This will result in children viewing their literacy development as a positive relationship with the world.\nIn summary, English language learners may carry multiple identities. Therefore, their learning and literacy practices will be inevitably influenced by a learner's identities. If literacy practices are congruent with a learner's sense of gender roles, societal positions, cultural backgrounds, ethnic histories, and class backgrounds, the learning process can be enhanced (Menard-Warwick, 2005) . Otherwise, resistance to learning may occur (Menard-Warwick, 2005) ."}, {"section_title": "Literacy Behaviour of Immigrant Parents", "text": "Literacy behaviour is a very broad concept, and it occurs in both passive and active HLEs (Burgess, Hecht, & Lonigan, 2002) . Literacy behaviour includes (a) literacy events such as decoding, phonics behaviour, comprehension, inference, and critical reading skills; (b) aesthetic appreciation behaviour; (c) reading flexibility skills; and (d) study skills (Bormuth, 1973 (Bormuth, -1974 . Literacy behaviour may include parental reading for pleasure, shared reading with children, exposing children to print, and other activities. Literacy behaviour can be recreational or functional and may include both parents and children together or parents and children individually. In this paper, I expand the idea of literacy behaviour beyond reading and writing to include all interactions happening in the home where either parent models literacy behaviours, or parents interact with children, or children independently carry out activities that will contribute to their literacy development. In this instance, literacy behaviour could include cultural activities such as parents and children watching a Chinese movie together (Zhang, 2009 ).\nBy engaging children in literacy behaviour, parents promote literacy engagement.\nLiteracy engagement incorporates notions of time on task (reading and writing extensively), affect (enthusiasm and enjoyment of literacy), depth of cognitive processing (strategies to deepen comprehension), and active pursuit of literacy activities (amount and diversity of literacy practices in and out of school; Guthrie, 2004 ). Children's active participation in literacy practices, expression of positive attitudes toward literacy practices, employment of strategies for comprehension, and active pursuit of literacy activities are demonstrations of literacy engagement (Guthrie, 2004) . Cummins (2011) argues that to engage children in literacy activities, it is essential that home and schools provide engaging books and other printed materials in children's home language or English.\nLiteracy behaviour in immigrant families may occur in both a heritage language and English. Parental support in heritage language learning is very important. The more a child is exposed to a heritage language, the greater the chances that the child will become proficient in it (Arriagada, 2005) . Parents are committed to providing a variety of literacy activities at home if they support their children to maintain a home language. For example, parents may speak the language at home and insist that children respond similarly (Liao & Larke, 2008) ; they may help with literacy activities and promote positive attitudes toward language study (PaciniKetchabaw, Bernhard, & Freire, 2001 ); and they may provide opportunities to use the heritage language in a variety of social and cultural contexts (Shin, 2005) . Using data from the National Education Longitudinal Study, Arriagada (2005) conducted research with 2,736 first-, second-, and third-generation Latino children to examine why some Latino children maintain knowledge of their native language. The results demonstrate that language and family context strongly influence Spanish usage and proficiency for Latino children, regardless of generational status.\nParents develop many strategies to compensate for the growing presence of English in the home. Lao (2004) conducted research with 45 Latino families with school-aged children. Parental strategies emphasized the use of only Spanish at home, visits to relatives in their country of origin, and interacting with friends who spoke Spanish. Through observations of literacy activities at home, Kenner et al. (2004) examined six-year-olds learning to write in Chinese, Arabic, or Spanish. Parents taught children how to use a bilingual dictionary, read them children's books or stories in a heritage language, and read and listened to the Qur'an in Arabic.\nSimilar results were found with Chinese learners. Zhang and Koda (2011) conducted a survey to examine the relationship between the HLE and word knowledge with 36 grade three ChineseEnglish bilingual children. The HLE was examined through (a) parents reading to the children in Chinese or helping with Chinese school homework, and (b) the child's independent reading in Chinese. Overall, parents seemed to use primarily Chinese to talk to their children, while children often used English or both Chinese and English to talk to their parents. There was a significant positive correlation between parental language use, school-work related practices, and learners' Chinese vocabulary breadth. Xiao (2008) compared the HLE of Chinese heritage language learners at three proficiency levels. Participants recalled the availability of Chinese resources, shared literacy activities with parents, and independent literacy activities when they were a child. Xiao (2008) suggested differences in the HLE between the three groups of learners with different proficiency levels. However, it should be noted that the way Xiao defined Chinese proficiency is based on instructional years. It does not necessarily reflect the heritage language proficiency. In addition, this study relies on adult retrospection of childhood experience. A direct look at children who are learning a heritage language would better suit a study of how home literacy experience influences literacy acquisition.\nIn a phenomenological study of three immigrant children's individual networks of linguistic contact, Zhang (2009) concludes that it is important for parents to provide literacy opportunities for children to develop heritage language. One participant in the study was in an early elementary grade; his parents took the role of language teacher and spent 30 minutes to one hour per day tutoring him. In addition, they introduced TV programs as part of the heritage language learning and catered to the child's interests in certain popular TV programs, such as classic Chinese cartoon videos. For example, while the child watched TV, his parents explained or discussed the program. Moreover, the mother read simple rhythms and poems to the child every day until he committed them to memory (Zhang, 2009) . Each day, the children copied one poem several times to remember the characters. His mother explained the meaning of each new character and paraphrased each poem for him. These examples indicate how parents transfer their beliefs to their daily home literacy activities and create a learning environment for children through interacting with them.\nChumak-Horbatsch (2008) examined language views and home language practices of sixteen immigrant parents with children in a Toronto English-language childcare centre. She administered questionnaires separately to mothers and fathers in eight immigrant families. The questionnaire included questions concerning (a) demographics; (b) language attitudes, beliefs, and proficiency; (c) home language practices; (d) child's language proficiency; (e) bilingualism; and (f) language-related concerns. The results indicated that immigrant mothers were more committed to their children's first language development than were fathers. In addition, negative effects of early second language exposure on children's first language competence were reported. These parents used a number of strategies at home to support children's heritage language maintenance: using only the first language at home; reading first language books to their children; and direct first language teaching. However, even though the parents promoted home language use, they worried that even if their children developed and retained an understanding of the home language, they would probably never acquire literacy skills in the home language, which resulted in anxiety and uncertainty about the continued use of the home language. In summary, immigrant parents promote children's literacy engagement by providing a variety of literacy activities at home in both heritage language and English."}, {"section_title": "Recognizing Home Literacy Environment Strategies to Support Literacy", "text": "I briefly review the literature in both heritage language and English acquisition and identify how a HLE influences ELL literacy development. ChumakHorbatsch (2004) argues that the starting point to support learners should be an understanding of the \"centrality and importance of their home contexts\" (p. 21). Language acquisition depends on a number of factors, including a child's literacy in his or her native language, previous schooling experience, and family support, etc. A number of strategies can support literacy development; those suggested here for educators and researchers who work with immigrant families are derived from the literature reviewed.\n(1) Even if parents hold positive language attitudes toward heritage language learning, they may behave passively and have low expectations (Liao & Larke, 2008) and, over time, may make diminishing efforts and investment in their children's language maintenance (Lee, 2002) . Therefore, educators may consider reassuring immigrant parents regarding the possibilities of children's heritage language maintenance. This will provide parents with confidence and they may become more willing to make contributions and investments.\n(2) Parents still receive \"subtle messages\" (Pacini-Ketchabaw, Bernhard, & Freire, 2001, p. 16) (Wu, 2005) . Therefore, educators could assure immigrant parents that young children can handle two languages (ChumakHorbatsch, 2004 ). In addition, it is important to inform parents that the human brain has the capacity to learn multiple languages and that the highest receptivity for language is in early infancy and childhood (Chumak-Horbatsch, 2004 ).\n(4) Some parents tend to perceive shortcomings of school, such as a lack of intellectual challenges (Li, 2001 ). This could be due to a lack of knowledge about what occurs in school and the purpose of certain activities at school. Therefore, it is important to establish communication between school and home. For example, a weekly diary could be transferred between parents and teachers so that both will have an indepth understanding of learning at school and at home.\n(5) Students who identify with their ethnic background generally assess their language proficiency as higher than students who identify less (Finch, 2009) . As one participant mentioned, his favourite social studies teacher often praised him for his bilingual skills and had him write Mandarin characters on the blackboard to show to his classmates (Zhang, 2009) . Educators could seek opportunities to connect students' ways of being with literacy learning into school literacy activities. In addition, it is important to support each child to recognize the ways literacy can contribute to his or her personal way of being in the world. Literacy and identity are connected, and these connections are critical to literacy engagement and learning. Respecting the language and the culture that children bring to school enables each child to feel accepted (Chumak-Horbatsch, 2004 ).\n(6) As Lee (2004) argues, \"the challenge in many classrooms has been how to apprentice students into disciplinary identities that do not diminish existing identities that students bring both individually and as members of different cultural communities\" (p. 130). A number of studies show that when this challenge is not met, resistance, rather than learning, is likely to result (Menard-Warwick, 2005) . Therefore, educators could encourage children to develop identity through, for example, supporting children's active participation in literacy practices and literacy engagement. By taking on new practices, children establish confidence and construct and reconstruct identities.\n(7) Cummins (2011) argues that to engage children in literacy activities, one priority is to provide engaging books and other printed materials in either the children's home language or English at home and in school. Therefore, Cummins (2011) suggests that schools could send such materials to students' homes. These materials could include multiliteracy resources, such as recorded stories. By providing resources for immigrant parents in both the heritage and second languages, one of the challenges that immigrant parents face-lack of resources-could be mediated.\n(8) Chumak-Horbatsch's (2008) study suggests that parents welcome specific heritage language maintenance strategies from childcare teachers. Therefore, early childhood educators could support immigrant families by communicating with parents how to support their children's heritage language maintenance in specific ways."}, {"section_title": "Conclusion", "text": "Research to date on the relationship between the HLE and ELL literacy development has shown relevancy between different areas of the HLE and literacy development. In summary, a HLE influences ELL literacy development through parents' positive or negative language attitudes toward heritage language maintenance and their beliefs regarding children's literacy development. In addition, the understanding that learning is enhanced when a learner's identity matches literacy practices provides an opportunity for educators to use available resources to nurture learners' positive identity. Finally, immigrant parents' literacy behaviour will influence children's literacy engagement. I have provided some strategies for educators and researchers to work with newcomer families in support of their children's literacy development. My goal in this paper has been to examine the relationship between home literacy practices and ELL literacy acquisition on both heritage language maintenance and second language acquisition, and provide educators and researchers with strategies so that they could work together with immigrant families to support English language learners' literacy development."}]