[{"section_title": "Abstract", "text": "After being assessed, many students entering community colleges are referred to one or more levels of developmental education. While the need to assist students with weak academic skills is well known, little research has examined student progression through multiple levels of developmental education and into entry-level college courses. The purpose of this paper is to analyze the patterns and determinants of student progression through sequences of developmental education starting from initial referral. We rely primarily on a micro-level longitudinal dataset that includes detailed information about student progression through developmental education. This dataset was collected as part of the national community college initiative Achieving the Dream: Community Colleges Count. The dataset has many advantages, but it is not nationally representative; therefore, we check our results against a national datasetthe National Education Longitudinal Study of 1988.\nOur results indicate that fewer than one half of the students who are referred to remediation actually complete the entire sequence to which they are referred. About 30 percent of students referred to developmental education do not enroll in any remedial course, and only about 60 percent of referred students actually enroll in the remedial course to which they were referred. The results also show that more students exit their developmental sequences because they did not enroll in the first or a subsequent course than because they failed or withdrew from a course in which they were enrolled. We also show that men, older students, African American"}, {"section_title": "Introduction", "text": "Developmental education is designed to provide students who enter college with weak academic skills the opportunity to strengthen those skills enough to prepare them for collegelevel coursework. 1 The concept is simple enough-students who arrive unprepared for college are provided instruction to bring them up to an adequate level. But in practice, developmental education is complex and confusing. To begin with, experts do not agree on the meaning of being \"college ready.\" Policies and regulations governing assessment, placement, pedagogy, staffing, completion, and eligibility for enrollment in college-level credit-bearing courses vary from state to state, college to college, and program to program. The developmental education process is confusing enough simply to describe, yet from the point of view of the student, especially the student with particularly weak academic skills who has not had much previous success in school, it must appear as a bewildering set of unanticipated obstacles involving several assessments, classes in more than one subject area, and sequences of courses that may require two, three, or more semesters of study before a student (often a high school graduate) is judged prepared for college-level work.\nThe policy deliberation and especially the research about developmental education give scant attention to this confusion and complexity. Discussions typically assume that the state of being \"college ready\" is well-defined, and they elide the distinction between students who need remediation and those who actually enroll in developmental courses. What is more, developmental education is often discussed without acknowledgement of the extensive diversity of services that bear that label. Any comprehensive understanding of developmental education and any successful strategy to improve its effectiveness cannot be built on such a simplistic view.\nIn this paper, we broaden the discussion of developmental education by moving beyond consideration of the developmental course and focusing attention instead on the developmental sequence. In most colleges, students are, upon initial enrollment, assigned to different levels of developmental education on the basis of performance on placement tests. 2 Students with greater academic deficiencies are often referred to a sequence of two or more courses designed to prepare students in a step-by-step fashion for the first college-level course. For example, those with the greatest need for developmental math may be expected to enroll in and pass precollegiate math or arithmetic, basic algebra, and intermediate algebra, in order to prepare them for college-level algebra. We define the \"sequence\" as a process that begins with initial assessment and referral to remediation and ends with completion of the highest-level developmental course-the course that in principle completes the student's preparation for college-level studies. Although a majority of students do proceed (or fail to proceed) through their sequences in order, some students skip steps and others enroll in lower level courses than the ones to which they were referred, so the actual pattern of student participation is even more complicated than the structure of courses suggests. (We will discuss this in more detail later.) At times we extend the notion of \"sequence\" into the first-level college course in the relevant subject area, since in the end the short-term purpose of remediation is to prepare the student to be successful in that first college-level course.\nWe examine the relationship between referral to developmental education and actual enrollment, and we track students as they progress or fail to progress through their referred sequences of remedial courses, analyzing the points at which they exit those sequences. We also analyze the demographic and institutional characteristics that are related to the completion of sequences and exits at different points along them.\nWe carry out this analysis using data collected as part of the Achieving the Dream:\nCommunity Colleges Count initiative, a multi-state, multi-institution initiative designed to improve outcomes for community college students. The sample includes over 250,000 students from 57 colleges in seven states. The sample is not representative of all community college students, so we check our results against an analysis using the National Education Longitudinal Study of 1988 (henceforth, NELS:88) . 3 Results of that analysis are consistent with results derived from the Achieving the Dream database.\n2 In fall 2000, 92 percent of public two-year colleges utilized placement tests in the selection process for remediation (Parsad, Lewis, & Greene, 2003) . 3 A nationally representative sample of eighth-graders was first surveyed in the spring of 1988. A sample of these respondents was then resurveyed in four follow-ups in 1990, 1992, 1994, and 2000 . On the questionnaire, students self-reported on a range of topics including: school, work, and home experiences; educational resources and support; the role in education of their parents and peers; neighborhood characteristics; educational and occupational An exploration of the distinction between the course and the sequence reveals some startling conclusions. While the majority of individual course enrollments do result in a course completion, between 33 and 46 percent of students, depending on the subject area, referred to developmental education actually complete their entire developmental sequence. And between 60 and 70 percent of students who fail to complete the sequence to which they were referred do so even while having passed all of the developmental courses in which they enrolled.\nThe remainder of this paper is organized in the following manner: In section 2 we provide some general background on the characteristics and outcomes of remediation; in section 3 we describe the Achieving the Dream and the NELS:88 databases; section 4 presents the results of the analyses on student placement and progression in developmental education; section 5 shows the results of multivariate analyses of the student and college characteristics that are related to an individual's likelihood of progressing through developmental education; section 6 summarizes the results and presents conclusions and recommendations."}, {"section_title": "Developmental Education Basics", "text": "More than one half of community college students enroll in at least one developmental education course during their tenure in college. In the National Postsecondary Student Aid Study of 2003-04 (NPSAS:04), 43 percent of first-and second-year students enrolled in public twoyear colleges took at least one remedial course during that year (Horn & Nevill, 2006) .\nLongitudinal data that allow a measure for the incidence of developmental education over multiple years of enrollment show even higher levels of enrollment. Attewell, Lavin, Domina, and Levey (2006) found that in the NELS:88 sample, 58 percent of community college students took at least one remedial course, 44 percent took between one and three remedial courses, and 14 percent took more than three such courses. In the Achieving the Dream database, which will be described in detail below, about 59 percent of the sample enrolled in at least one developmental course. aspirations; and other student perceptions. For the three in-school waves of data collection (when most were eighthgraders, sophomores, or seniors), achievement tests in reading, social studies, mathematics, and science were administered in addition to the student questionnaire (National Center for Education Statistics, 2003) .\nDevelopmental programs absorb sizable public resources. More than ten years ago, Breneman and Haarlow (1998) estimated that remediation cost more than one billion dollars a year. A more recent study calculated the annual cost of remediation at $1.9 to $2.3 billion dollars at community colleges and another $500 million at four-year colleges (Strong American Schools, 2008 Regents, 2006) .\nThe costs of remediation to the taxpayer are substantial, but the financial, psychological, and opportunity costs borne by the students themselves may be even more significant. While they are enrolled in remediation, students accumulate debt, spend time and money, and bear the opportunity cost of lost earnings. In some states, they deplete their eligibility for financial aid.\nMoreover, many students referred to developmental classes, most of whom are high school graduates, are surprised and discouraged when they learn that they must delay their college education and in effect return to high school. A recent survey of remedial students found that a majority believed that they were prepared for college (Strong American Schools, 2008) . This can cause students to become frustrated and to give up and leave college (Rosenbaum, 2001; Deil-Amen & Rosenbaum, 2002) . Many students referred to remediation try to avoid it by using loopholes and exceptions that can be found in many regulations and guidelines (Perin & Charron, 2006) .\nAlthough remediation has high costs, clearly some provision must be made for students who enter college unprepared. Proponents argue that it can be an effective tool to improve access to higher education, particularly for underprivileged populations (McCabe, 2006) , while others argue that the costs of remediation, for both society and student, outweigh the benefits. The controversy about remediation has prompted some research on the effectiveness of remedial programs in preparing students for college-level courses, but, given the size and significance of the developmental education function, that research is surprisingly sparse. Some descriptive studies have compared different approaches to remediation (Boylan, 2002) . But only a handful of studies have compared the success of students who enroll in developmental courses to the success of similar students who enroll directly in college courses. Bettinger and Long (2005) used different remediation assignment cutoff scores among community colleges in Ohio to compare similar students who were and were not referred to developmental education to measure the effect of the remedial instruction. They used the distance from the student's home to the college as an instrument. Their sample was restricted to students who had taken the SAT or ACT.\nThey found that students placed in math remediation were 15 percent more likely to transfer to a four-year college and took ten more credit hours than similar students not placed in remediation.\nThey found no positive effect for reading developmental placement. Calcagno and Long (2008) and Martorell and McFarlin (2007) analyzed the effects of remediation on subsequent outcomes in Florida and Texas, respectively, where statewide remedial assignment cutoff scores allowed regression discontinuity analyses. These studies find no positive effect of remediation on college credit accumulation, completion, or degree attainment. Calcagno and Long found a small positive effect on year-to-year persistence in Florida, but Martorell and McFarlin found no effect on any outcome variable. The Florida and Texas studies in particular provide reliable but discouraging results; nevertheless, these results are only relevant to students scoring near the remediation assignment cutoff scores. In terms of the concept of a sequence, these are the students referred to developmental classes only one level below college-level. 4\nWhat accounts for these discouraging results? Certainly one fundamental problem is that most students referred to remediation, even those referred to only one level below college-level, do not complete their sequences. In the rest of this paper, we analyze the patterns and determinants of that problem."}, {"section_title": "Achieving the Dream Initiative: Data Description", "text": "Achieving the Dream: Community Colleges Count is a multiyear, national initiative designed to improve outcomes for community college students. As of early 2009, 19 funders and over 80 colleges in 15 states participated in the initiative. One of its most important goals is helping participating colleges and state agencies to build \"a culture of evidence\"-to gather, analyze, and make better use of data to foster fundamental change in the education practices and operations of community colleges for the purpose of improving student outcomes. The Achieving the Dream initiative collects longitudinal records for all first-time credential-seeking students in specified cohorts at all of the colleges participating in the initiative, including data on cohorts starting two years before the college entered the initiative. These cohorts will be tracked for the life of the initiative (at least six years for participating colleges) and possibly beyond. The dataset includes student demographics, enrollment information, the number of credits accumulated, and the receipt of any degrees or certificates. It also includes detailed information on referral to developmental education; enrollment and completion of remedial courses in reading, writing, and mathematics; and enrollment and completion of \"gatekeeper\" courses-the to compare Achieving the Dream colleges with national and state public two-year institutions.\nThe first column represents national public two-year colleges, the second column represents public two-year colleges in Achieving the Dream states, and the third represents the colleges included in the sample. Compared to the national and state samples, Achieving the Dream colleges serve substantially higher proportions of African American and Hispanic students.\nAchieving the Dream colleges also enroll a larger number of students per college, and they make noticeably smaller instructional expenditures per full-time equivalent enrollment (FTE). They are also more likely to be located in urban areas. Thus the Achieving the Dream sample more closely represents an urban, low-income, and minority student population than do community colleges in the country as a whole. The sample therefore characterizes an important sub-group of community colleges, but when possible we check our results against the national NELS:88 sample. The Achieving the Dream database we used for this study was derived from 256,672\nfirst-time credential-seeking students who began their enrollment in fall 2003 to fall 2004 in 57 colleges that provided detailed information on developmental education. We followed their enrollments in remediation through the summers of 2006 and 2007-three academic years. For simplicity, we focused on two common developmental education subjects: math and reading.\nThe database contains information on student gender, race/ethnicity, age at entry, full-or parttime enrollment, major, all remedial courses taken, and the grades earned in those courses. One unique aspect of this dataset, particularly important for our purposes, is that it includes a variable indicating whether students were referred to developmental education and, for those who were referred, the level to which they were referred. 8"}, {"section_title": "Student Progression Through Developmental Education", "text": ""}, {"section_title": "Student placement in developmental education", "text": "Most Achieving the Dream colleges use a placement test and/or academic records to place beginning students into developmental education. Based on their performance on the test/records, many individuals are referred to a sequence of developmental courses. The\nAchieving the Dream database classifies all beginning students into four groups for each type of developmental education: students referred to 1) no developmental education, 2) developmental education one level below the entry-level college course (henceforth we will refer to this as Level I), 3) two levels below (henceforth Level II), and 4) three or more levels below (henceforth Level III). Some students are thus expected to finish three or more developmental courses before enrolling in college-level classes. Fifty-nine percent of students were referred to developmental math: 24 percent to Level I, 16 percent to Level II, and 19 percent to Level III. Far fewer students-only 33 percent-were referred to reading remediation: 23 percent, 7 percent, and 3 percent into the respective three levels. 9\nDifferent colleges provide different numbers of levels of developmental education. In fall 2000, public two-year colleges reported to offer, on average, 3.6 remedial courses in math while offering 2.7 courses in reading. Among the 53 Achieving the Dream colleges in the sample that provided information on remedial math offerings, 35 offer three or more levels of remedial math, 9 offer two levels, and 9 offer one level. Among the 51 such colleges that provided information on remedial reading offerings, 20 offer three or more levels of remedial reading, 20 offer two levels, and 11 offer one level (see Table 2 ). 8 Participating institutions were given the following instructions on how to determine whether a student should be considered referred to remedial math or reading: \"Student was referred for remedial needs in mathematics [reading] . Remedial courses are instructional courses designed for students deficient in the general competencies necessary for a regular postsecondary curriculum and educational setting. The student can be referred through a counselor, a developmental office, etc.\" Institutions with multiple levels of remedial education were asked to report the level to which the student was initially referred. 9 A sequence of developmental reading courses might include pre-college reading, textbook mastery, and college textbook material. "}, {"section_title": "Student progression through developmental education", "text": "In colleges with multiple levels of developmental education, in principle, only those who passed the course into which they were originally referred can pursue a higher-level developmental course. In reality, many students enroll in higher and even lower level courses than those to which they are referred or skip courses in the sequence. Some referred students skip remediation entirely and enroll directly in the first college level course in the relevant subject area.\nOverall, 46 percent of students referred to reading remediation and 33 percent of those referred to math remediation completed their sequence of developmental education. Students who passed the highest level developmental course in their referred sequence are defined as sequence completers (see Table 3 ). Not surprisingly, developmental education completion rates are negatively related to the number of levels to which a student is referred. Of those students in our Achieving the Dream sample who were referred to Level I remediation (Table 3) , 45 percent and 50 percent completed developmental math and reading, respectively. 10 The corresponding figures are 17 percent and 29 percent for those referred to Level III. Many of the students who failed to complete their remediation sequence did so because they never even enrolled in a developmental course to begin with. Just under one third of all students referred to remediation in this sample did not enroll in any developmental course in the relevant subject area within three years.\nOf those students who did enroll in a remediation course, many-29 percent of all students referred to math and 16 percent of those referred to reading-exited their sequences after failing or withdrawing from one of their courses. But a substantial number-11 percent for math and 8 percent for reading-exited their sequence never having failed a course. That is, they successfully completed one or more developmental courses and failed to show up for the next course in their sequence. Thus if one combines the number of students who never enrolled with those who exited between courses, more students did not complete their sequence because they did not enroll in the first or a subsequent course than because they failed a course. For example, for reading, 30 percent never enrolled, and 8 percent left between courses, while only 16 percent failed or withdrew from a course.\nThe goal of developmental education is to prepare students for college-level courses.\nHow did sequence completers fare in those college-level courses? In the Achieving the Dream dataset, the first college-level courses are referred to as gatekeeper courses (see footnote 5 for a definition). Data displayed in Table 4 indicate that between 50 and 55 percent of sequence completers also completed a gatekeeper course. But to complete the gatekeeper course, students must first enroll and then pass the course. About two thirds of the sequence completers enroll and three quarters of those who enroll pass, so once again, as was the case with developmental education completion, failure to enroll is a greater barrier than course failure or withdrawal. The high pass rate is encouraging, but developmental education completers are already a selected group of students who have successfully navigated their often complicated sequences.\nWhen considered from the beginning of the sequence, only 20 percent of students referred to math remediation and 37 percent of those referred to reading complete a gatekeeper course in the relevant subject area within three years.\nAs we have seen, many of those referred to developmental education fail to complete a college course because they never even enroll in their first remedial course: between one quarter and one third of referred students never enroll in developmental education (see Table 3 ). Table 5 presents data on what happened to those students. These students do not necessarily leave college. In some colleges or states, remediation is not mandatory and in most colleges, students can take courses in subjects for which the remedial course to which they were referred is not a prerequisite. 11 It may be that students, perhaps with the collaboration of some faculty or counselors, simply do not comply with the regulations (Perin & Charron, 2006) . Many students ignored the advice (or instructions) of the placement and referral system and skipped their developmental sequence, enrolling directly in a gatekeeper course in the subject area for which they were presumably in need of remediation (see Table 5 ). Among those students who never enrolled in remediation, about 17 percent of students referred to math remediation and 45 percent of those referred to reading remediation enrolled directly in a gatekeeper course. These students passed their gatekeeper courses at a slightly lower rate than those students who enrolled in a gatekeeper course after they completed their sequences. But many students who comply with their placement never reach a gatekeeper course. Perhaps a more revealing analysis would compare the probability of completing a gatekeeper course for referred students who enter that college-level course directly to that probability for those who 11 In most colleges, students are required to take the sequence of courses to which they are referred before they are eligible for college-level courses, but in some states and colleges, remediation is voluntary. In 75 percent of public two-year colleges, students are in principle required to take remedial courses to which they are referred while in the remaining 25 percent students are only recommended by colleges to take those courses (Parsad, Lewis, & Greene, 2003) .\nfollow the recommendations of the counseling system and enroll in the course to which they are referred. About 72 percent of those who went directly to the college-level course passed that course, while only about 27 percent of those who complied with their referral completed the college-level course.\nIt appears that the students in this sample who ignored the advice of their counselors and proceeded directly to college-level courses made wise decisions. One interpretation is that the developmental education obstacle course creates barriers to student progress that outweigh the benefits of the additional learning that might accrue to those who enroll in remediation. This is at least consistent with the research cited earlier that suggested that remedial services do little to increase the chances that a student will be successful in their first college-level course. An alternative explanation is that these students have a better understanding of their skills than the counselors, armed with widely used assessments.\nFor other students, especially for those referred to math remediation, non-enrollment had a more negative effect. Of those students referred to math remediation who never enrolled, only 61 percent enrolled in another course and 42 percent never earned a college credit in three years after their first term.\nAny multiple-step sequence of courses presents many possibilities for pathways through that sequence. Students can skip courses, move backwards, and of course they can pass or fail and they can move on or fail to move on to subsequent courses. For example, taking the 43 thousand students in our sample who were referred to Level III math remediation, we counted 75 different pathways used by at least one student through (or more likely not through) the developmental maze."}, {"section_title": "National Education Longitudinal Study of 1988", "text": "In the remainder of this section, we provide a comparison to the Achieving the Dream data by using a national micro-level dataset taken from NELS:88. One of the key advantages that NELS provides is the inclusion of more extensive information than the Achieving the Dream proportion of minority students were chosen to participate in Achieving the Dream. But it also reflects general changes in the demographic characteristics of community college students. In the past decade, there has been a significant increase in the proportion of minority populations attending community colleges: from 10 percent in 1990 to 14 percent in 2003 for African Americans, and from 8 percent to 14 percent for Hispanics over the same period (Snyder, Tan, & Hoffman, 2006) . The table also shows that the NELS students are on average four years younger at college entry than the Achieving the Dream students. In contrast to NELS, the Achieving the Dream sample includes older students who entered college perhaps many years after high school. 1 The sample consists of individuals who were enrolled in community college soon after high school and whose college transcripts are provided by their institutions. The sample does not include older students. 12 In 1988, 24,599 eighth graders were selected for the NELS sample that was followed up four times (in 1990, 1992, 1994, and 2000) . In the end, 12,144 individuals survived the base-year and four follow-up surveys. Attewell, Lavin, Domina, and Levey (2006) provide a detailed description of the NELS data for their analysis on developmental education. 13 Given the fact that transcript data were retrieved from a restricted-use source, all sample size numbers are rounded to the nearest ten throughout the paper in accordance with the NCES policy regarding confidentiality. Transcripts are limited to a three-year period of observation in an effort to be consistent with the Achieving the Dream sample. 14 Even the NELS sample does not represent the entire community college student population at that time because of individuals who delayed postsecondary education after high school.\nCollege transcript records taken from PETS contain information on student enrollment and performance in developmental education courses. From these course-by-course and term-byterm records, we were able to identify a set of developmental math courses 15 that students ever enrolled in: 1) pre-collegiate math or arithmetic, 2) basic algebra, and 3) intermediate algebra. 16 Table 7 presents NELS students' first-time math course enrollment, whether developmental or college-level. 17 Among the 3,410 NELS students, 25, 16, and 12 percent enrolled for their first math course in pre-collegiate math, basic algebra, and intermediate algebra, respectively. Almost 26 percent enrolled in a college-level course. The remaining 20 percent did not enroll in any math course during their college career. [31%] Notes: To be consistent with the Achieving the Dream sample, only student transcripts that captured three years or less of a student's academic performance were used. For the purposes of assignment, a student's 12 th grade math scores were used for imputation. 1 In this paper we consider intermediate algebra to be a developmental course. 2 Ten observations were dropped from the original sample of 3,410 due to missing data. NELS does not indicate whether a student was referred to developmental education. In order to compare the present analysis to our analysis of the Achieving the Dream data, we estimated the need for developmental education among NELS students using 12 th grade standardized math test scores. Our estimation procedure is described in Appendix A. Table 8 describes the NELS students' progression through developmental education in math. We first observe that few students whom we estimate to be in need of remediation actually completed their full sequences. For example, only 10 percent of those with test scores indicating 15 The NELS transcripts only identify one reading/English course as remedial, so we were not able to use NELS to analyze progression through a sequence of developmental reading courses. 16 NCES considers intermediate algebra a pre-college course even though in a small number of cases, students are granted additive credits for the course (Snyder, Tan, & Hoffman, 2006) . In this paper, we consider intermediate algebra to be a developmental course. 17 The length of time for transcript observation for each student is three years from the start of postsecondary education. that they needed pre-collegiate math enrolled in and passed all three courses in the sequence:\npre-collegiate math, basic algebra, and intermediate algebra. The corresponding figures are only 24 percent for individuals in need of basic algebra and 65 for those in need of intermediate algebra. When aggregating the data across the course levels, we see that only one third of developmental students completed all of their necessary courses in math. This is very close to the same percentage as the corresponding Achieving the Dream students (33 percent). Among those completers, two out of three are reported to have enrolled in and passed at least one college-level math course. As was the case with the Achieving the Dream developmental education completers, the percent of NELS completers who passed a college-level course is similar across the three levels of developmental need: 51, 58, and 59 percent for those with a demonstrated need for precollegiate math, basic algebra, and intermediate algebra, respectively. Approximately 28 percent of all developmental education completers (regardless of first enrollment) did not even attempt to take any college-level math courses. As was the case with the Achieving the Dream students, many developmental students in the NELS sample did not finish the first course in their sequence. More than a third of individuals estimated to be in need of pre-collegiate math failed to pass that course. The equivalent numbers are 41 percent for students in need of basic algebra and 35 percent for those in need of intermediate algebra. More than half of those non-completers never enrolled in the first course of their sequence throughout all of their tracked college years. This is very similar to analogous results from the Achieving the Dream data: 56 percent of the students who did not complete their developmental math sequence failed to do so because they did not enroll, often in the very first course to which they were referred, not because they tried and failed or dropped out of a course. Even for those who finished the first course in their sequence, many never enrolled in the next level. For example, of those with the greatest developmental need, 63 percent enrolled in and passed pre-collegiate math, but almost half of those who passed did not show up for the next course in the sequence, basic algebra. Two out of three of those developmental students who did not complete their full sequence of math courses never actually failed one of those courses.\nIn summary, the NELS data confirm the basic story that emerges from the Achieving the Dream analysis: 1) only a minority of students who need developmental education complete their full sequence of developmental courses; 2) many never pass their first developmental course in their sequence, and 3) a majority of those students who do not complete their full sequence of courses fail to do so because they do not enroll in their initial course or a subsequent course, not because they fail or drop out of any of the courses they attempt."}, {"section_title": "The Determinants of Developmental Progression: Multivariate Analysis", "text": "In this section, we use the concept of a developmental sequence to analyze the determinants of educational outcomes for remedial students. Our analysis so far has shown that many students drop out of their developmental education sequences. But there is considerable variation in these outcomes among students who are referred to the same remedial level. Can we identify student or institutional characteristics that are related to a higher likelihood of reaching intermediate points in the sequence, of completing the sequence, and of moving successfully into college-level courses?\nIn the following analysis we supplement the individual-level data from Achieving the Dream with institution-level data from the Achieving the Dream and the IPEDS databases to conduct a multivariate analysis that allows us to differentiate the relationships between individual and institutional factors and student progress through developmental education."}, {"section_title": "Empirical model", "text": "To simplify our analysis, we focus on the step-by-step character of the remedial sequence.\nDevelopmental students are expected to enroll in and pass single or multiple developmental courses depending upon their placement. For those who are referred to the lowest level (three or more levels below college-level) of developmental education, their achieved outcome can be categorized into one of the following four types: 1) Y = 0, those who did not pass the third-level course (three or more levels below college-level); 2) Y = 1, those who passed the third-level course but did not progress any further; 3) Y = 2, those who passed the second-level course, but not the first-level; and 4) Y = 3, those who completed the entire sequence. The last three outcomes (Y = 1, 2, 3) are observed for those referred to two levels below while the last two (Y = 2, 3) are observed for those referred to one level below.\nCompared to a binary definition of developmental education completion, the concept of a sequence allows us to treat non-completers differently depending on where they stop. For example, among individuals referred to three levels below college-level, those who finished the first course but not the next-level course (Y = 1) are presumed to be more successful in developmental education than those who did not even finish the first course (Y = 0).\nConsequently, we use an ordered logit regression. In this approach the ordinal variable is conceived of as the discrete realizations of an underlying continuous random variable, Y * , indicating the degree to which the student completed developmental education. The unobservable Y * can be expressed as a linear function of covariates X: Y * = β ' X + ε. The observed categorical variable, Y, is derived from unknown cut-off points (α 0 , α 1 , . . . , α j ) in the distribution of Y * : Y = j if α j-1 ≤ Y * < α j . Let the probability of Y = j be Prob(Y = j). Then, the proportional odds model is:\nwhere Prob(Y ≤ j) denotes the probability of having at most j th level of developmental completion and Prob(Y > j) denotes the probability of having above the level j. The parameter β represents the relationship between the covariate and the dependent variable. In this model, the association is assumed not to be the same for every category j. The regression coefficient β l for a particular explanatory variable is the logarithm of the odds ratio for the dependent variable, holding others constant. To simplify the interpretation of the results, we transformed the raw coefficients into odds ratios."}, {"section_title": "Empirical specifications", "text": "We hypothesized that success in developmental education depends on student demographics, college characteristics, and state-specific effects. Student demographics include gender, race/ethnicity, age at entry, cohort year, intensity of first-term enrollment, major studied, developmental need in other subjects, and socioeconomic background. Gender, race/ethnicity, age, and cohort differences are commonly identified as determinants of postsecondary outcomes (Choy, 2002; Pascarella & Terenzini, 2005) . Working while enrolled and attending part time are also associated with a lower probability of retention and graduation. Students who major in academic areas including liberal arts are expected to succeed in developmental education at a higher rate than those studying in vocational areas. As a measure of pre-college ability, we added a dummy variable indicating whether the student was in need of remediation in other subjects.\nWe also used college-level variables from IPEDS to account for the influence of institutional characteristics on a student's likelihood of progressing through developmental education. College characteristics include school location, size, proportion of full-time students and minority students, tuition, average amount of federal aid received per FTE enrollment, instructional expenditure per FTE enrollment, and certificate orientation. College location, size, and student body demographics are commonly entered as covariates in the literature on student success in college (Bailey, Calcagno, Jenkins, Leinbach, & Kienzl, 2006) . For example, students at large and urban colleges serving mainly minorities and economically disadvantaged populations are found to persist and/or graduate at lower rates than their counterparts. We included tuition as a cost of college attendance that is presumed to have a negative relationship with course completion. As a proxy for students' financial need, we entered the amount of financial aid received by students in the college per FTE enrollment. College resources devoted to instruction are expected to help students succeed in developmental education. In addition, certificate-oriented colleges may not stress developmental education as much as degree-oriented colleges. To control for certificate orientation, we included a dummy indicating whether the college awarded more certificates than associate degrees. Finally, we introduced into the analysis state-specific fixed effects to control for differences in state policy or funding systems that might influence outcomes for developmental students. Table 9 presents summary statistics of the Achieving the Dream college sample by level of developmental education to which they were referred. Regardless of the subject, female, young, Black, and Hispanic students tended to need more levels of developmental education."}, {"section_title": "Results", "text": "Full-timers were determined to have less need for developmental education than part-timers.\nIndividuals studying in vocational areas tended to have more need for remediation than those studying in non-vocational areas. It is not surprising that students with a demonstrated developmental need for a particular subject tended to be referred to developmental education in the other subject. Finally, developmental students with greater need were more likely to enroll in colleges that were urban, large, certificate-oriented, and serving high proportions of minority students, particularly Hispanic and economically disadvantaged populations. Table 10 shows the results from the ordered logit regression for each group of students referred to a particular level of remediation. We first observe that there are substantial individual-specific differences in developmental progression. Female students tended to have significantly higher odds of progressing through developmental math education than their male counterparts. The results indicate that the odds of females passing to a higher level of developmental education were 1.53-1.56 times (depending on the level) as large as the odds for males, holding other factors constant. The corresponding figures for developmental reading range from 1.52 to 1.77.\nOlder students tended to have lower odds of passing to a higher developmental level than their younger counterparts. It is noteworthy that the odds of African American students passing to a higher level of developmental math were 0.67-0.91 times the odds of their White peers. The equivalent numbers vary from 0.86 to 1.11 for developmental reading. In contrast, there is no indication that Hispanic students had lower odds of developmental progression than their White peers. We also observe that both the intensity of first-term enrollment (whether the student attends full-time or part-time) and the type of major are related to the odds of developmental progression. The odds of passing to a higher level of developmental math were 1.50-1.68 times as large when individuals studied on a full-time basis. These numbers are very similar to those for reading. The results also indicate that the odds of passing to a higher level in developmental math were lower (0.61-0.77) when studying in vocational areas. Individuals with a demonstrated developmental need for reading seem to have had lower odds of progressing through developmental math. In sum, men, Black students, and those attending part time or studying in a vocational area had lower odds of progressing through their developmental sequences. Black students had particularly low odds when they were referred to developmental math at two or three or more levels below college-level. The gender effect is strong throughout the entire sequence for both math and reading, but the negative effect of age applies mostly to reading. The table also shows that institution-level variables-in particular, college size, student composition, and certificate orientation-are important for developmental progression even after adjusting for individual demographics. The results indicate that the odds of passing to a higher level of math remediation were 0.71-0.77 times as large when students attended small colleges.\nThe corresponding figures range from 0.43 to 0.78 for reading. There seem to be similar associations among students at mid-size and large colleges. We also observe that student composition has some influence on the odds of progressing through developmental education.\nIndividuals at institutions serving high proportions of Black and economically disadvantaged students (measured by receipt of federal aid) generally have lower odds of passing to a higher level of remediation than their peers at colleges serving low proportions of these populations.\nTuition level seems to matter as well, particularly for individuals referred to the lowest levels of developmental education. Lastly, the results indicate that the odds of passing to a higher level of developmental education were lower when students enrolled in certificate-oriented colleges."}, {"section_title": "Robustness of the results and limitations of the analysis", "text": "Potential analytic problems may derive from the fact that our analysis depends on crude measures of individuals and institutions available in the Achieving the Dream and IPEDS databases. For example, we did not include any measures of individual-level socioeconomic background that are presumed to be important determinants of developmental progression.\nFortunately, the Achieving the Dream database includes students' residential ZIP codes according to which we can derive socioeconomic measures from outside sources. Specifically, we exploited the 2000 Census to obtain two ZIP code-level measures of socioeconomic background: neighbors' income and educational attainment. But more than 20 percent of the Achieving the Dream sample had no or incomplete ZIP code information. These observations were therefore dropped from the sample for this analysis. Nonetheless, the results from the ordered logit regressions with the two socioeconomic measures are very similar to those presented in Table 10 . As expected, neighborhood income and educational attainment were positively related to the odds of developmental progression.\nAnother possible problem is related to the assumption that the associations between the independent variables and the dependent variable are constant across the transitions through developmental levels. This assumption is required for the use of the ordered logit model. A particular covariate may have different relations with developmental progression depending on the transition, category j. In order to address this issue, we ran a set of generalized ordered logit regressions, the so-called generalized threshold model (Maddala, 1983) , where the odds ratios are allowed to vary across the ordinal categories. We observed some differences in the odds ratios for several variables across the categories; nevertheless, the results for each category are qualitatively similar to those presented in Table 10 .\nA final specific concern is that the ordered logit model does not take full advantage of the sequential nature of developmental progression. A student's progression toward a higher level of remediation is predicated on the student's success in the previous level. We used a sequential response model (Maddala, 1983; Amemiya, 1985) that estimates probabilities of passing different transitions. At each transition, individuals determine whether to drop out or continue developmental education. Basically, the sequential model is analogous to a discrete time hazard rate model in duration analysis that estimates the probability of exit at a particular time conditional on survival. For simplicity, we assumed that the probability of passing a given transition is conditionally independent of passing previous transitions; in other words, all transitions are considered a conditionally independent series of binary processes. The results from the sequential logit regressions suggest that there are some differences in the estimated odds ratios across the transitions, but they are also qualitatively similar to those presented in Table 10 .\nLastly, we point out that our multivariate analysis is exploratory, not definitive. It shows the relationships between the covariates and the developmental outcome. It is difficult to make causal inferences from the results due to multiple sample selections at transitions. There may be unobserved individual-specific heterogeneity that is correlated with student success in the previous and current transitions."}, {"section_title": "Conclusion", "text": "In this paper we have focused attention on the sequence of developmental courses. What does the concept of a sequence help us learn?\nFirst of all, a focus on the sequence makes immediately clear the daunting task confronting many of the nearly two thirds of all community college students who are referred to developmental education in at least one area. Students arriving with weak academic skills can face semesters of work before they can in effect start college-at least in relevant areas. This developmental \"obstacle course\" presents students with many opportunities to step out of their sequences, and students in large numbers take those opportunities. Fewer than one half of students complete their sequences, and only 20 percent of those referred to math and 40 percent of those referred to reading complete a gatekeeper course within three years of initial enrollment.\nShould we be concerned about these low completion rates? Given the circumstances, what is the optimal developmental education completion rate? Research does suggest that there is economic value in college education even if it does not end in a degree (Kane & Rouse, 1995; Grubb, 1993) . Students who complete one or two developmental courses have probably learned valuable skills even though they have not learned enough to be eligible for college-level work.\nEven very early exit may not necessarily indicate a problem. Manski (1989) argued that initial college attendance can be seen as an experiment in which students gather information about their aptitude and taste for college. Many students have little concrete knowledge about college before they start. During the early months of college, students learn whether they like college and how much work and effort they will have to exert in order to be successful. They can evaluate that against the likely benefits of persisting and perhaps completing college. Certainly the costs in time and money of a college education will be higher for students who must start in developmental courses. Thus their early exit may suggest that they had gathered enough information about the barriers that they faced to decide that the cost would be too high.\nWithout more information on these students and their motivations, it is difficult to make a judgment about this. Whether the low completion rates are in some sense optimal for individuals, we should remember that many of these students who exit the developmental sequence are high school graduates. Most high school graduates who enroll in remediation believe that they are prepared for college, so it seems reasonable that if high schools fail to carry out that preparation, some services ought to be available to do what the high schools should have done. Another problem with the optimal withdrawal argument is that withdrawals are still closely related to race and income. It is problematic from a social point of view to argue that the optimal withdrawal rate is higher for African American and low-income students than it is for middle-class White students. Finally, if there is a national goal to increase college success and graduation rates, that increase is going to have to come from among these types of students. The goal of educators therefore must be to try to lower the cost in time and resources to the student of successfully navigating the developmental sequence. If that can be done, then any cost benefit calculation would create incentives for a higher completion rate.\nIn addition to evidence on the overall completion rates, this paper has presented information about the nature of the sequences and the places where students tend to exit the sequence. Analysis of developmental sequences makes clear that many students who exit their sequence do so even though they have never failed or withdrawn from a developmental course.\nThis pattern extends into the first college-level course: among developmental completers in the sample, those who enrolled in a gatekeeper course had a good chance of passing it, but about 30 percent did not enroll in such a course within the three-year period of the study.\nThis paper has also revealed the confusion and disarray that underlies the apparent orderliness of the developmental sequence. In theory, the system consists of an ordered set of courses into which students are placed with the assistance of assessments used by hundreds of thousands of students. But barely a majority of students actually follow their referral recommendations. For some students, deviation from the referral appears to be a wise decision, but others ignore the recommendations and disappear from the college altogether. And those who do enroll in remedial courses take a bewildering variety of pathways as they try to make progress toward college-level courses.\nGiven the confusion and ineffectiveness of the developmental system, one possible objective would be to reduce the length of time before a student can start college courses-to accelerate the remediation process. A system that used more accurate assessment that identifies the specific needs of students and focuses instruction on addressing those particular needs would be one way to minimize the time a student spends in remediation. It may be possible to provide that supplemental instruction, through tutoring for example, while the student is enrolled in an introductory college-level course. We have seen that students who choose to skip remediation do reasonably well. It might make sense to provide appropriate support so that more students could follow that path.\nWe have emphasized that more students fail to complete developmental sequences because they never enroll in their first or a subsequent course than because they drop out of or fail to pass a course in which they are enrolled. This insight suggests a wide variety of possible approaches. Perhaps colleges should combine two or three levels of instruction into one longer, more intensive, accelerated, course. At the very least, concerted efforts should be made to encourage students who complete one course in their sequence to go on to the next. This might involve abandoning the semester schedule to prevent gaps between courses, or registering and scheduling students for the next course in a sequence while they are still in the previous course.\nAs it stands now, developmental education sequences must appear confusing, intimidating, and boring to many students entering community colleges. And so far, developmental education has at best shown limited success. But if the nation is to increase its college-educated workforce, it will have to do so by strengthening the skills of the millions of students in community college developmental programs. That progress can only be made if we understand, simplify, and improve the complex developmental sequences that confront so many students."}, {"section_title": "Appendix A: Imputation of Need for Developmental Education for NELS Students", "text": "The NELS data do not include a variable indicating whether a student is assigned to or needs remediation. We used an imputation technique (Royston, 2004) to predict whether a student would be in need of developmental instruction in math based on their 12th grade test scores. We first treated individuals with no math enrollment as if they had missing values for their first-time math courses. We then created a categorical variable that takes a value of 0 for students in no need of developmental math, 1 for those in need of intermediate algebra, 2 for those in need of basic algebra, and 3 for those in need of pre-collegiate math or arithmetic. A univariate technique based solely on the individuals' 12 th grade math test scores was then employed to estimate the course into which they would have been placed had they taken a math course. For a given missing value of the categorical variable, the imputed value was selected to minimize the mean absolute difference in the logit of the predicted value probability between the non-missing observation and the target-missing observation. Given the ordinal nature of the variable, an ordered logit regression was used in the imputation. In order to carry out this analysis, we assumed that students who actually enrolled in developmental and college-level math courses were referred to those courses. We then used the relationship between the 12 th grade math score and enrollment in the different math courses to predict, for the 20 percent who did not enroll in any math course, which course they would have been referred to given their 12 th grade test score. As a result of imputation, the proportions of students in need of pre-collegiate math, basic algebra, and intermediate algebra increase from 25, 16, and 12 percent to 32, 21, and 15 percent, respectively. In other words, 69 percent of community college students in the NELS sample are predicted to have been referred to developmental education in math while only 54 percent actually enrolled. For the Achieving the Dream college students, 59 percent were referred to math developmental education while only 42 percent enrolled."}]