[{"section_title": "INTRODUCTION:", "text": "The novel seventh strain of Coronaviridae associated with sever human to human transmission tentatively named 2019-nCoV that was officially declared a public health emergency of international concern by the World Health Organization (WHO) on January 31, 2020 [1] . Later on, the Coronavirus Study Group of the International Committee on Taxonomy of Viruses announced the name SARS-CoV-2 \"Severe Acute Respiratory Syndrome Corona Virus 2\" on 11\nFebruary 2020. Moreover, on the same day, the World Health Organization declared it a pandemic disease caused by the virus was \"COVID-19\" [2, 3] . The number of people infected with Coronavirus 19 will soon touch the five million mark in 209 countries including Pakistan.\nThe first two cases of COVID-19 have been reported in Karachi and Islamabad by the Ministry of Health [4] . Although, COVID-19 is most prevalent in Pakistan as compare to other South East Asian countries [5] . To date, 27 th May, 2,940,406 active cases, 357,894 (6.16%) deceased and 2,514,950 (43.26%) recovered has been reported worldwide [6] .\nThe SARS-CoV-2 is the 3 rd most highly virulent strain of coronavirus that causes severe respiratory disease followed by SARS-CoV (severe acute respiratory syndrome Coronavirus) and MERS-CoV (Middle East respiratory syndrome coronavirus) with highest fatality rate [7, 8] while other members of this family 229E, OC43, NL63, HKU1 primarily involve in mild selflimiting disease such as \"common cold\" in the human population [9] .\nThe first SARS-CoV-2 genome was sequenced and submitted to the NCVBI GenBank (NC-045512) on 12 January 2020 that consists of 29,903bp with close resemblance of SARS-CoV.\nCoronavirus recognized as highly evolving viruses, consists of non-segmented, positive-sense single-stranded RNA, with a high frequency of mutation and genomic recombination, [10, 11] .\nThe virus genome is arranged in the order of 5'UTR (untranslated region), ORF1ab (open reading frame), 3'UTR, and nonstructural ORFs. ORF1ab encodes replicase polyprotein pp1a and pp1b, proteolytic cleavage of these two viral polyproteins produced 16nsp (nonstructural proteins) -Club shaped structural glycoprotein spikes(S) that gives the virus crown-like appearance-Envelope protein(E) -Membrane protein(M) -Nucleocapsid protein (N) [12] .\nThe study on the hotspot of differences in the genome of SARS-CoV-2 is very important for investigating the etiology, epidemiology, prevention, and treatment of coronavirus infection. We aim to develop the SARS-CoV-2 mutation Browser v-1.3 that retrieved the full-length viral genome sequence data from National Center for Biotechnology Information (NCBI), Global Initiative on Sharing All Influenza Data (GISAID) and NGDC databases from all over the world to find the mutation or polymorphism in SARS-CoV-2 viral genome. This mutation browser will help the scientists and researchers to investigate the variation in the whole genome of SARS-CoV-2. Based on these findings, biomedical companies are also trying to develop rapid molecular diagnostic kits, vaccines, and therapeutic drugs for SARS-CoV-2 patients. Numbers of isolates with a certain number of mutations are also displayed in the browser and are given in Table 1 The evolution rate of coronavirus could be 10 -4 substitute per bp per year as a typical RNA virus therefore; the mutation could be occurring during each replication cycle [9] . However, in the present bio-information browser, 5688 SARS-CoV-2 viral sequences from ninety-one regions were examined and a total of 39920 mutations were found. Importantly, the database showed position and type of mutation, consequence, and consequence type in the SARS-CoV-2 genome. Therefore, to avoid false-negative results, data from this database will be helpful to design the PCR primers and probes with maximum specificity and sensitivity for the diagnosis of COVID-19. A potential limitation of this mutation browser is that since all SARS-CoV-2 genome sequences used in this study were retrieved from different databases and the accuracy of these genome sequences could not be verified although these partial or complete sequences have been published worldwide."}, {"section_title": "Results", "text": "In conclusion, the COVID-19 mutation browser is a worthful addition to the currently available coronavirus resources that will allow the researchers to access data expeditiously and intuitively on SARS-CoV-2 mutation. We expect the SARS-CoV-2 mutation browser will assist the process of study design and be a key resource for the COVID-19 community."}, {"section_title": "Materials and Methods:", "text": "Study Design:"}, {"section_title": "Data Collection and Multiple Sequence Alignment:", "text": "A total of 12,743 high coverage complete genomes of SARS CoV-2 isolates from 77 countries (105 regions) were retrieved from GISAID.org [16] . Complete detail about the origin of each sequence is given in Supplementary Table 1 . The reference genome sequence of the virus was also retrieved from NCBI-GenBank (GenBank: MN908947.3) [17, 18] . All of these viral genome sequences were aligned with reference sequence in different sets by using Clustal Omega Server provided by EMBL-EBI [19, 20] ."}, {"section_title": "Processing of Aligned Sequences", "text": "The aligned sequences were processed by an in-house python script to extract mutations and filter sequences. Based on a filter over the number of differences, only high-quality sequences with a max of 20 differences were selected for the database. Our python script could only call all the variants except deletions at terminal regions of aligned sequences and where nucleotide changes to \"N\" (Unknown nucleotide). This script was also programmed to select and curate mutations only from those sequences having the utmost 20 mutations and no addition greater than two base pairs."}, {"section_title": "Annotation of Nucleotide Mutations:", "text": "All the nucleotide variations were also annotated for their translational consequences along with consequence types. For achieving this milestone, an in-house built database was generated having the annotations of each known consequence permutation and then a python script was written to annotate each mutation and curate its consequence and consequence type."}, {"section_title": "Development of Mutation Browser", "text": "The SARS-CoV-2 Mutation Browser v.1.3 has been generated the viral genome sequences data with different types of mutations. Two viral genome sequences of Pakistani isolates retrieved from NCBI were also processed through the same procedure and are provided separately on the browser. This browser is coded using modern programming languages including HTML5, JavaScript, JQuery, PHP, and equipped with MySQL server for rapid retrieval of information.\nThis browser is designed to provide the user with visualizations of region-wise differences, Gene wise differences, Hotspot of differences in Genome, Consensus sequence, and all differences of a sample from reference genomes and their consequence along with summarized information represented in tabulated format. This portal is also coded to show some basic stats of isolates regarding several mutations and genomic positions concerning the number of mutations with the integration of Google Charts."}, {"section_title": "Primer Infopeida:", "text": "All the primers reported for SARS-CoV-2 diagnostics and research purposes were manually curated from literature and websites. All these primers were aligned to the reference sequence using the NCBI BLAST tool to select fully reference mapping primers and curate them with their regions according to the reference sequence. Mutations Database and Primers Database were then integrated into another \"Primer Infopedia\" tool that is also a part of SARS-CoV-2 Mutation\nBrowser v.1.3."}]