[{"section_title": "Abstract", "text": "Introduction: Distinctions between rural and urban environments produce different frequencies of traumatic exposures and psychiatric disorders. We examine the prevalence of psychiatric disorders and frequency of trauma exposures by position on the rural-urban continuum."}, {"section_title": "Introduction", "text": "Psychiatric disorders are extremely common in the United States. Every year, approximately one in four Americans (26.2%) suffers from a diagnosable mental illness [1] . About half (46.4%) of the U.S. population experiences a psychiatric disorder diagnosable by the Diagnostic and Statistical Manual, 4 th edition (DSM-IV), the standard tool for assessing psychiatric disorders, at some point in their lives [1] . The overall cost of mental illness to the U.S. economy is staggering, with a 2008 report estimating costs over $300 billion, comprised of both the direct costs of mental health care, as well as indirect costs including loss of income from unemployment [2] .\nWhile mental health issues represent a significant problem, causes of mental illnesses are complex. However, both genetic liability and environmental factors have been shown to play a crucial role in mental health outcomes [3] . Exposure to trauma is one such environmental factor that is associated with the development of psychiatric illness [4] . Fifty-one percent of women and 60% of men experience at least one traumatic event in their lives [5] . Although not all trauma-exposed individuals develop a psychiatric disorder [6] , trauma history is implicated in the etiology of posttraumatic stress disorder (PTSD) [4] , major depression [4, [7] [8] , and substance use disorders [9] .\nBecause the development of mental illnesses is impacted by environmental factors, it is important to consider whether different environments -such as position on the rural-urban continuumproduce different frequencies of risk factors associated with mental health outcomes. Position on the rural-urban continuum is associated with numerous sociodemographic factors which have been shown to affect the frequency of mental illnesses. For example, residents of rural communities have lower incomes and educational status compared to non-rural individuals and are more likely to be uninsured [10] [11] . These differing population characteristics likely play a role in the increased frequency of mental illness such as depression which is sometimes noted among rural residents [12] . Socidemographic disparities affecting rural residents, and the resultant impact on mental health, are particularly important to consider in light of the fact that rural residing individuals face substantial service deficits related to healthcare, especially mental healthcare. Approximately 20% of non-metropolitian counties lack adequate mental health services compared to 5% of metropolitan counties [13] .\nOne previously unexplored, but possibly important factor that may contribute to rural-urban mental health disparities is differences in the frequency of trauma exposures across the rural-urban continuum. Some rural healthcare providers have suggested that rural patients are exposed to fewer traumas compared to non-rural patients [14] , suggesting that distinctions between rural and urban environments may produce different frequencies of traumatic exposures. However, little prior work has explicitly examined whether trauma exposures truly differ across the rural-urban continuum.\nAlthough some prior studies have examined rural-urban disparities in mental health, most prior studies have not used a nationally representative dataset [15] [16] [17] [18] [19] . Given that many of these studies were not completed using national data or focused on specific populations, there is variation among the results. One study using a North Carolina population reported major depressive disorders as being twice as frequent in urban areas [17] , with another study focusing on Mexican-Americans in California also reporting a higher prevalence of any psychiatric disorder in urban areas [15] . In contrast, a study evaluating cancer survivors found more symptoms of anxiety and depression among rural populations [16] , and a study done in the Midwest found substance use disorders more prevalent among rural residents [18] . Another study found the prevalence of psychiatric disorders in rural primary care offices to be as high as those in urban offices [19] . At least one prior study examined frequency of depression comparing rural and urban residents in a national sample and found the unadjusted prevalence of depression to be slightly higher among rural residents [12] , but this difference disappeared once covariates were adjusted. Other U.S. studies found the prevalence to be equivalent across various geographic indicators such as region and rurality [20, 21] .\nInternationally, a meta-analysis of urban-rural differences showed a higher prevalence of any disorder, mood disorders and anxiety disorders in urban areas compared to rural areas. However, this study included many international sites and the articles comprising the meta-analysis were heterogeneous [22] . A more recent, nationally representative study performed using a novel indicator of rurality found that, among adults, risk for major depression and serious mental illness was slightly elevated in intermediate categories of rurality -i.e., small metro and semirural areas -compared to large metropolitan areas and fully rural areas [23] . Thus, the data examining mental health across the rural-urban continuum has not conclusively shown a rural-urban disparity, and may not even reflect a linear relationship.\nTo remediate these knowledge deficits, we used the National Comorbidity Survey Replication (NCS-R) to examine the frequency of lifetime psychiatric disorders and trauma exposures across the urban-rural continuum. The primary objective of this study was to examine the association between position on the rural-urban continuum and both trauma exposures and lifetime psychiatric disorders, and to determine whether these variables differ by degree of rurality."}, {"section_title": "Materials and Methods", "text": ""}, {"section_title": "Study population and data collection", "text": "The NCS-R is a nationally representative community household survey that measured the correlates and prevalence of psychiatric disorders in the United States. The NCS-R is representative of the U.S. population based on a variety of census indicators. The population under study included people at least 18 years of age, who were interviewed in-person between February 2001 and April 2003 [24] . Data from the NCS-R includes assessments of several psychiatric disorders, such as PTSD, depression and anxiety as well as self-reports of abuse and other traumas [24] ."}, {"section_title": "Ethics statement", "text": "Prior to subject involvement in the NCS-R, the human subject participant committees from both the Harvard Medical School and the University of Michigan provided ethical review [21] . Interviewers explained the study and obtained verbal informed consent prior to beginning each interview. Recruitment and consent were approved by the Human Subjects Committees of Harvard Medical School, Boston, Massachusetts, and the University of Michigan. The Pennsylvania State University College of Medicine Institutional Review Board (IRB) reviewed and approved this secondary analysis.\nThe NCS-R assessed a wide range of DSM-IV psychiatric disorders through structured interviews administered in two different parts [24] . The first part of the interview included core diagnostic assessments completed by all the participants (n = 9,282). The Part II interview focused on participants with potential for psychiatric disorders (n = 5,692) [24] . The assessment of lifetime PTSD, trauma exposure, and other relevant health conditions were all included in Part II. The overall response rate was 70.9% for the primary interview and 80.4% among predesignated secondary participants [24] . A detailed description of the interview schedule, survey population, fieldwork, organization and procedures, weighting and sample design used in the NCS-R has been previously published [24] . As noted above, the goal of the current analysis is an assessment of frequencies of specific mental health diagnoses and trauma exposures. Data for these exposures and diagnoses were only included in the Part II questionnaire. Thus, only participants who answered Part II of the NCS-R are included in these analyses, with appropriate sample weighting applied."}, {"section_title": "Measures", "text": "Rural-urban continuum. The primary unit of analysis in this study is the study participant's geographic placement on the rural-urban continuum. Rurality/urbanicity was designated based on county of residence using the Department of Agriculture's 2003 rural-urban continuum codes (RUCCs). The 2003 rural-urban continuum is a categorization scheme that differentiates metropolitan from nonmetropolitan counties by population size, degree of urbanization and functional proximity (adjacency) to metropolitan areas [25] . Using this classification, county codes range from 1 (most urban) to 9 (most rural). Federal Information Processing Standard (FIPS) county identifiers were used to match the participant's county of residence to RUCC. In the NCS-R data, no individuals from the Part II data were included from counties with RUCCs 8-9.\nOutcome: Traumatic event exposure history. Participants were asked about their history of over 27 specific traumas and could also report any other additional traumas that were not pre-specified. The trauma variables were further divided into five major trauma categories, based upon a scheme previously developed by Nickerson et al. [26] : War-related, Accident-related, Disaster-related, Interpersonal and Other traumas. War-related trauma was defined as having combat experience, peacekeeping, being an unarmed civilian in war, being a civilian in ongoing terror, or being a refugee. Accident-related trauma was defined as being exposed to a toxic chemical, being involved in a lifethreatening motor-vehicle accident (MVA), or being in another life-threatening accident. Disaster-related trauma was defined as experiencing a major natural disaster or experiencing a man-made disaster. Interpersonal trauma was defined as being kidnapped or held captive, being badly beaten by parents, being badly beaten by a partner, being badly beaten by someone else, being mugged, held up or threatened with a weapon, being raped, being sexually assaulted, being stalked, or witnessing serious physical fights at home as a child, seeing someone badly injured/killed or unexpectedly seeing a dead body. Other trauma was defined as experiencing a life-threatening illness, having someone very close die unexpectedly, having a child with a life-threatening illness or injury, having someone close experience an extremely traumatic event, or seeing atrocities or carnage.\nOutcome: Lifetime psychiatric disorders. Psychiatric disorders were assessed using the World Mental Health Survey Initiative version of the World Health Organization Composite International Diagnostic Interview (WMH-CIDI), which is a structured diagnostic interview from which DSM-IV diagnoses are derived [24] . The DSM-IV diagnoses considered in this study include the following: (1) posttraumatic stress disorder (PTSD), (2) Any anxiety disorder (panic disorder, generalized anxiety disorder, agoraphobia without panic disorder, specific phobia, social phobia, PTSD, separation anxiety disorder). (3) Major Depressive Disorder, (4) Any mood disorder (major depressive disorder, dysthymia, bipolar disorder I, bipolar disorder II), (5) Any impulsecontrol disorder (oppositional defiant disorder, conduct disorder, attention-deficit/hyperactivity disorder and intermittent explosive disorder), (6) Alcohol use disorders (alcohol abuse with or without dependence), (7) Drug use disorders (drug abuse with or without dependence), (8) Any substance use disorder (nicotine dependence, alcohol and drug abuse and dependence), (9) Any disorder (which includes any mood, anxiety, impulse control or substance use disorder previously mentioned).\nSociodemographic variables. The interview was comprised of an extensive demographic section, which assessed gender, age, race-ethnicity, household income, education, current employment, marital status, number of children and insurance coverage. Insurance coverage was further divided into none, private (health insurance obtained through employer/union, health insurance plan purchased from insurance company, health insurance not otherwise mentioned) or public (military health insurance, Medicare, government assistant program for people in need, state health insurance, and Indian health service)."}, {"section_title": "Statistical analysis", "text": "All statistical tests utilized appropriate weights to account for the complex sampling design of the NCS-R. Analyses were conducted via SAS Software version 9.3 (SAS Institute, Cary, NC). We first developed a three-level rurality variable, dividing RUCCs into categories based on existing USDA categorization [25] : metropolitan-urban counties (RUCC 1-3), nonmetropolitan counties with populations of 20,000+ (RUCC 4-5), and nonmetropolitan counties with populations less than 19,999 (RUCC 6-7). Weighted Chi-square tests were used to assess bivariate associations between county-level rural-urban continuum indicators and key demographic descriptors, mental health diagnoses and trauma exposures using the three-level rurality variable. We then assessed for multicollinearity among the candidate control variables (demographic factors) by examining variable inflation factor (VIF) statistics. Since no significant multicollinearity was found, all candidate control variables were then introduced into multivariable analyses.\nTo examine whether the associations between mental health conditions and trauma exposures differed by degree of rurality, a weighted multivariable logistic regression was used to determine the association of the 7-level ordinal rural-urban continuum variable with the various types of lifetime trauma exposure, controlling for all prespecified demographic factors. Separate models were developed for each identified mental health diagnosis. Likewise, this approach was used to examine the association of rural-urban continuum with mental disorders. Adjusted odds ratios were used to quantify the magnitude and direction of the associations for all logistic regression analyses.\nTo examine for threshold effects and to consider the possibility that a nonlinear relationship existed between position on the ruralurban continuum and both mental health diagnoses and trauma exposures, we performed post-hoc analyses in which we repeated the multivariable regressions, re-examining our data using both a three-level rurality variable (metropolitan/suburban/rural) and a two-level rurality variable (metropolitan versus all others.)\nResults Table 1 shows the results of weighted bivariate analysis by three level rural-urban county category. About 75% of participants resided in major metropolitan counties (RUCC 1-3), 12.2% were from nonmetropolitan counties with an urban population of greater than 20,000 (RUCC 4-5), and 12.8% were from nonmetropolitan counties with an urban population of less than 20,000 (RUCC 6-7). Most self-identified as white (72.7%), were currently employed 64.8%), married (56%) and had private insurance coverage (73%). Participants from households with incomes less than ,$19,999 (25.4% of the rural population vs. 20.7% of the metropolitan population, p = 0.007) and with lower educational attainment (10.6% of the rural population with college degree or more vs. 24.8% of the metropolitan population, p,.001) were more likely to reside in non-metropolitan counties. In our unadjusted analyses applying appropriate sample weights (Table 1) , we found that both lifetime mental illnesses and trauma exposures were common, with a prevalence of.50% among all categories of rurality. The most common mental health disorder reported was any anxiety disorder (38.5%) followed by any substance use disorder (19.5%). Drug use disorders were more common for participants residing in metropolitan areas (8.7%) when compared to nonmetropolitan areas (5.1% for suburban, 6.1% for rural, p = 0.018). War-related trauma was more common for individuals from metropolitan areas (10.5%, versus 6.0% for suburban and 7.0% for rural, p = 0.021) and other types of trauma were more common for individuals from rural areas (64.1%, versus 52.3% for suburban and 57.9% for rural, p = 0.025). Table 2 shows the results of weighted ordinal logistic regressions examining trauma exposures across the 7-level ordinal rural-urban continuum variable. A one-unit increase in rurality as indicated by a one-level increase in county RUCC was associated with a 14% decreased odds for war-related trauma (adjusted Odds Ratio (aOR) = 0.86, 95% Confidence Interval (CI): 0.78-0.95). The remaining trauma exposure categories were not significantly associated with position on the urban-rural continuum. Table 3 shows the results of weighted adjusted analyses examining odds of mental health diagnoses across the 7-level rural-urban continuum variable. Aside from drug use disorders, a one-category increase in county rurality (as indicated by a 1-unit increase in the RUCC) was not associated with risk for overall lifetime psychiatric disorder. The odds of drug use disorder decreased with increasing rurality (aOR 0.89, 95% CI: 0.83-0.95).\nOther notable secondary findings with respect to our trauma exposure variables include the fact that individuals aged 60+ were three times more likely to have experienced war-related trauma compared to individuals less than 29 years of age (aOR = 3.35, 95% CI: 2.01-5.61). Females were overall less likely to experience most traumas compared to males, and individuals who were never married had decreased odds for most traumas compared to those who were married or cohabitating.\nOther notable secondary findings with respect to our mental health disorders include that females had a more than two-folds greater odds of a lifetime history of PTSD compared to males (aOR = 2.88, 95% CI: 2.35-3.53) but were less likely to experience alcohol use disorders (aOR = 0.31, 95% CI: 0.27-0.36), drug use disorders (aOR = 0.38, 95% CI: 0.31-0.46) and any impulse control disorders (OR = 0.64, 95% CI: 0.54-0.75) compared to males (Table 3) . Compared to whites, those who self-identified as Hispanic (aOR = 0.52, 95% CI: 0.37-0.73), or non-Hispanic Black (aOR = 0.60, 95% CI: 0.47-0.76) were less likely to experience overall lifetime psychiatric disorders. Individuals who were divorced, separated or widowed were at a greater risk for most psychiatric disorders including PTSD, major depressive disorder, any mood disorder, alcohol use disorders, drug use disorders, and any substance use disorder compared to those who were married or cohabitating.\nOf note, the results of our post-hoc analyses to examine whether threshold or nonlinear effects might account for our findings yielded similar results to the primary analyses presented above. When we substituted a 3-level rurality indicator (rural/suburban/ major metropolitan) for the 7-level rurality variable, adjusting for other factors, we found similar results: compared to major metropolitan counties, suburban counties were less likely to report war-related trauma (aOR 0.55 95%CI: 0.32-0.95); while the findings for rural counties trended in the same direction but were not significant (aOR 0.65, 95%CI: 0.39-1.09). When we examined a threshold effect using a 2-level rurality indicator comparing major metropolitan counties to all other counties, we found that compared to major metropolitan counties, residents of all other counties were less likely to report war-related trauma (aOR 0.60, 95% CI: 0.41-0.89).\nSimilarly, we found little difference when we examined for threshold and nonlinear effects among psychiatric disorders. Using a using a 3-level rurality indicator, we found that residents of suburban counties trended towards lower drug use disorders (aOR 0.54, 95%CI: 0.29-1.01) and residents of rural counties had significantly lower drug use disorders (aOR 0.64, 95% CI: 0.52-0.79), compared to residents of major metropolitan areas. Using a 2-level rurality indicator, we found that compared to residents of major metropolitan areas, residents of all other areas were less likely to report drug use disorders (aOR: 0.59, 95% CI: 0.42-0.83). Similar to the results reported in Table 3 , the remaining findings were not significant. Discussion Examining a wide range of trauma exposures, the only urbanrural difference noted was that risk for war-related trauma decreased with rurality. This may be partially due to U.S. epidemiology, in which less than one third of the veteran population resides in rural areas [27] . In addition, the category of war-related trauma also includes non-military trauma such as those experienced by refugees. A growing number of refugees world-wide are seeking protection in urban areas [28] , and thus urban-residing refugees of foreign wars may also partially account for this finding.\nThe remaining trauma exposure categories were not significantly associated with position on the urban-rural continuum. Our finding that trauma exposures are relatively constant across the rural-urban continuum is unique in the literature and particularly important in light of data suggesting that trauma is under recognized in healthcare settings [29] . This finding is also notable as some rural primary care physicians (PCP) perceive trauma exposure to be an uncommon occurrence in their communities [14] , because it suggests that rural patients may have even an even proportionally higher risk of their trauma histories going unrecognized by their healthcare providers compared to nonrural patients.\nIn our study, residents of metropolitan areas were more likely to report drug use disorders compared to residents of rural areas. This data is consistent with a report from the National Household Survey on Drug Abuse (NHSDA), which showed that individuals who lived in metropolitan areas are more likely to have used an illicit drug compared to nonmetropolitan residents [30] . Overall, other than a decreased prevalence of drug use disorder with increasing rurality, our study did not find any significant difference regarding lifetime psychiatric disorders based on position on the rural-urban continuum. This finding adds to the body of knowledge showing that rural residing persons are just as likely to have mental health diagnoses when compared to their urban counterparts [20, 21] . Moreover, we have shown this across a larger number of psychiatric disorders compared to what has been previously reported [12, [20] [21] and in a national dataset unlike most previous studies [15] [16] [17] [18] [19] .\nOur findings are also interesting in light of recent national data from Breslau et al. [23] showing slightly elevated risk for major depression and serious mental illnesses in categories of intermediate rurality. It should be noted that Breslau, et al. used a novel indicator of rurality for their study, and the granularity this allowed in urban-rural classification may have accounted for the differences between our findings and that of Breslau and colleagues. Our post-hoc examinations of threshold and nonlinear effects did not produce substantially different findings compared to the primary analyses shown in Tables 2 and 3 . However, future research should examine in more detail the possibility of a nonlinear association between rurality and mental health outcomes.\nRural communities suffer from a shortage of mental healthcare resources [31] . Mental health service providers tend to concentrate in urban areas and few rural areas are sufficiently served [32] . Additionally, residents of rural communities may have problems accessing mental health services, due to numerous factors including long distances to travel for mental healthcare, limited public transportation in rural areas and lack of mental health outreach [33] . Considering that the frequencies of lifetime psychiatric disorders are equivalent among rural and urban communities, our data strongly suggest a relative mental health service deficit for rural residents, which is likely to be exacerbated by underrecognition of trauma exposure in rural areas.\nWe also had several secondary findings worth examining. For example, although females in our sample were overall less likely to experience most of the traumas measured, females were more likely to report a lifetime history PTSD. This likely reflects two factors. First, there is a gender disparity in types of trauma to which individuals are exposed. The traumas measured in this study may reflect traumas that disproportionately affect men. For example, the traumas examined may not have included the full range of childhood traumas that have been shown to affect adult functioning, such as in the Adverse Childhood Experiences (ACE) Study [34] . Additionally, all domains of intimate partner violence, which disproportionately affects women, including emotional abuse [35] were not measured. If these traumas were examined, our findings may have been different with respect to gender and trauma frequency. Second, women who survive trauma are more susceptible to the development of PTSD than men who survive trauma [36] . Thus, even with the lower frequency of trauma exposures, the increased frequency of PTSD among women may be due to greater susceptibility to the development of PTSD among women.\nOur findings with respect to race and ethnicity mirror those of other studies in the National Institute of Mental Health Collaborate Psychiatric Epidemiology Surveys (CPES), [37] which includes the NSC-R. In these studies, racial and ethnic minorities have been generally found to have lower rates of lifetime mental disorders compared to white, non-Hispanic participants [38] . We also found slightly reduced frequencies of accident-related trauma among Hispanic and non-Hispanic Black individuals compared to whites. This finding is intriguing and bears further investigation. However, available data suggest that when accidental injury occurs, as in the case of motor vehicle crashes, Blacks may be more likely to experience a fatality [39] . Our study also showed that markers of higher socioeconomic status (SES), such as higher educational attainment and greater education, are generally protective against substance use disorders. This is supported by the literature which shows that higher SES is generally protective against both initiation of substance use and also promotes cessation of substance use [40] ."}, {"section_title": "Strengths and limitations", "text": "One of the main strengths of this study was the use of a nationally representative survey to assess both the prevalence of lifetime psychiatric disorders and to examine trauma exposure frequencies across the rural-urban continuum. In particular, the exploration of trauma exposure across the rural-urban continuum is, to our knowledge, novel in the literature.\nOur study has several limitations to consider. We were unable to assess data from RUCC 8-9, the most rural counties, as individuals from these counties were not included in the NSC-R Part II survey sampling frame. Moreover, although the list of traumas examined was extensive, it was by no means exhaustive, which may have accounted for some of our findings with respect to gender.\nFinally, we examined lifetime trauma exposures and mental health diagnoses and related them to position on the urban-rural continuum at the time of the study. Although this methodology is appropriate for informing allocation of healthcare services across the rural-urban continuum, it does not provide epidemiologic information regarding the residence of the subject at the time of the trauma exposure or mental health diagnosis. It is possible that some subjects migrated between rural and urban contexts between the time of their trauma exposure or development of a mental health diagnosis and the time of data collection. Future research should assess for the role of migration across the urban-rural continuum to better understand where trauma exposures first occurred and where mental health diagnoses were first identified. This may be particularly relevant for those for whom trauma exposures and mental health diagnoses occurred during childhood. Further study could examine recent mental health diagnoses in addition to lifetime diagnoses, to better inform public health officials regarding current need for mental health services across the rural-urban continuum."}, {"section_title": "Conclusions", "text": "Across the rural-urban continuum, the frequencies of most lifetime psychiatric disorders and trauma exposures are similar. The only notable differences were that war-related traumas and drug use disorders were more prevalent in metropolitan areas. Given that rural communities suffer from a shortage of mental healthcare resources with a similar frequency of psychiatric disorders and traumatic exposures, our data suggests a substantial service deficit exists to adequately address the mental health needs of rural-residing individuals, and reinforces calls for improving access to mental health care in rural communities [41] . Given the high prevalence of both mental health disorders and trauma exposures across the rural-urban continuum, policies should promote education of both rural and nonrural healthcare providers to improve care of patients with mental illnesses and to provide trauma-informed care [42] ."}, {"section_title": "Ethical approvals", "text": "Prior to subject involvement in the NCS-R, the human subject participant committees from both the Harvard Medical School and the University of Michigan provided ethical review for the parent study. The current report is a secondary analysis of NCS-R data. The Pennsylvania State University College of Medicine Institutional Review Board (IRB) reviewed and approved this secondary analysis."}]