[{"section_title": "", "text": "*: These authors contributed equally to this work. 53  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71  72  73  74  75  76  77  78  79 insights into the consistency of infection fatality patterns across countries ( Figure 1A ). We use our 120 model to produce ensemble IFR estimates by age and sex in a single harmonized framework as 121 well as estimates of the proportion of the population infected in each country. Further, we use these 122 estimates to reconstruct the expected number of deaths in older individuals (≥65 years), which we 123 compare to reported deaths in each setting, highlighting heterogeneity in the burden of mortality 124 amongst elderly individuals across countries."}, {"section_title": "126", "text": "Age-specific mortality patterns 127 Using population age structures and age-specific death data, we compare the number of deaths by 128 age within each country, using the number of deaths in 60-65 year olds as the reference. We find 129 a very consistent pattern in the relative risk of death by age for individuals <65 years old across 130 countries and continents, with a strong log-linear relationship between age and risk of death for 131 individuals 30-65 years old ( Figure 1B , Supplementary Methods S1). The observed relative risk 132 of death in older individuals appears substantially more heterogeneous across locations. Given the 133 potential for important variability in mortality associated with nursing home outbreaks across 134 countries, we first investigate mortality patterns specifically in the general population, using age-135 specific deaths ≥65 from England, where granularity of the data allows us to remove deaths in 136 nursing home populations. We find that the log-linear relationship between age and risk of death 137 continues into older age groups ( Figure 1B) . To assess the generalizability of data from England 138 to other countries, we use these estimates to reconstruct the number of non-nursing home deaths 139 reported in 13 other countries and find the predictions were consistent with the observed number 140 of deaths in these countries ( Figure 1C , Supplementary Methods S2)."}, {"section_title": "142", "text": "In order to translate relative risks of death by age to underlying IFR, we combine age-specific 143 death data with 15 seroprevalence surveys, representing 12 of the 45 countries (2 different studies 144 were each available for Belgium, Denmark and Netherlands, Supplementary Table S1). We use 145 daily time-series of reported deaths to reconstruct the timing of infections and subsequent 146 seroconversions. To limit biases that can be introduced by outbreaks in nursing home settings and 147 the variable reporting practices of fatalities amongst individuals ≥65, we fit our model 148 investigating the relationship between seroconversion and mortality exclusively to death data from 149 those <65 years old. To infer IFRs in age groups ≥65 years, we use our estimates of the relative 150 risk of death derived from England data only, without considering reported deaths from individual 151 countries in these age groups. As our baseline model, we use an ensemble model where we include 152 the results from all national-level seroprevalence studies together within a single framework. In 153 addition, we consider separate models where we use the results of each serostudy individually to 154 estimate IFRs in all locations, allowing us to investigate the consistency of estimates provided by 155 different studies. As older individuals have fewer social contacts 11 and are more likely to be 156 isolated through shielding programmes we assume a baseline relative infection attack rate of 0.7 <0.001% (95%CrI: 0-0.001) in those aged 5-9 years (ranging from 0-0.001% across individual 160 national-level serostudies) to 7.27% (95%CrI: 6.91-7.66%) in those aged 80+ (ranging from 2.66- 161 16.78% across individual national-level serostudies) (Figure 2A) . A mean increase in IFR of 162 0.52% with each 5-year increase in age (95%CrI: 0.49-0.55%) was estimated for ages ≥10 years. 163 We estimate that the risk of death given infection for men is significantly higher than that of 164 women ( Figure 2A) Figure 2D )."}, {"section_title": "197", "text": "Our ensemble model reproduces the reported seroprevalence values for the majority of studies 198 including the dynamics of reported seroprevalence over time ( Figure 3B ). Of the 45 countries 199 . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted August 26, 2020. By contrast, for many European countries we observe a higher incidence of deaths in older 222 individuals than expected ( Figure 4A ). This is consistent with the large proportion of reported 223 COVID-19 deaths attributable to outbreaks in nursing homes, highlighting the enormous burden 224 experienced by these communities in many higher-income countries. Using France as a reference 225 population, we use the age and sex distribution of nursing home residents to derive a population-226 weighted IFR of 5.45% (95%CrI: 5.18-5.74%) among French nursing home residents, assuming 227 equal frailty of individuals in nursing homes and the general population of the same age and gender 228 ( Figure 4B ). Using this estimate of the IFR would suggest that 29.05% of the nursing home 229 population had been infected by 30th May 2020 (95%CrI: 27.60-30.58%), a 6.14 fold higher CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint homes, increases the IFR from 0.60% for the general population (95%CrI: 0.57-0.63%) to 0.88% and Ecuador, consistent with our finding that these two countries have fewer reported deaths than 257 expected ( Figure S1 ). . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity."}, {"section_title": "(which was not certified by peer review)", "text": "The copyright holder for this preprint this version posted August 26, 2020. CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint estimates biased? (2020). 316  317  318  319  320  321  322  323  324  325  326  327  328  329  330  331  332  333  334 . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. Age-and sex-specific COVID-19 fatality data 417 We collated national-level age-stratified COVID-19 death counts from official government and 418 department of health webpages and reports for 45 countries. Where available, the stratification by 419 both age and sex were used. Sub-national age-stratified death counts were additionally collated for 420 regions where seroprevalence surveys had been conducted. For countries/regions where 421 information on age was missing for a subset of deaths, we assumed the age-distribution of the 422 missing subset to be the same as that of the deaths with available age data. Information on age was \nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint exclusively to the reported number of deaths for age groups <65 years for each country (i.e. 454 including all age-groups where the upper bound is <65 years). IFRs for age groups ≥65 were 455 derived from age-specific death data reported by the Office for National Statistics (ONS) in 456 England 17 , which allows us to exclude deaths among nursing home residents (Supplementary 457 Methods S2). As an external validation, we apply these IFRs to reported death data for a subset of \nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint All code and data necessary to reproduce this analysis are available at 491 https://github.com/meganodris/International-COVID-IFR . is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. To explore the risk of reported COVID-19 death by age in each country age-specific relative risks 3 (RR) of death were calculated as shown in equation 1, where , and , are the country and 4 age-specific number of deaths and population size, respectively. The age-group 55-59 was chosen 5 as the preferential reference group as it is less likely to be influenced by deaths associated with 6 outbreaks in nursing home settings. As the reported age-groups varied by country, the age group 7 with an upper bound of 59 was chosen as the reference group where possible. Where this was not 8 an available age-group, the age-group with an upper bound of 64 was selected as the reference. Here, , is the number of age and sex-specific non-nursing home COVID-19 deaths, , is the 20 age and sex-specific population size, is the cumulative probability of infection and is the age-21 specific relative infection attack rate. The age-and sex-specific number of non-nursing home 22 COVID-19 deaths were calculated by assuming that all COVID-19 deaths that occurred in nursing 23 homes were aged 65+ and that the age-sex-distribution of these deaths follows the same age-sex-24 distribution as all COVID-19 deaths ≥65 years. We applied this adjustment to an additional 13 25 countries where the proportion of COVID-19 deaths attributable to nursing homes had been 26 reported, assuming the cumulative proportions to be constant in time (Table S2 ). In the case of 27 France, deaths that occurred in nursing homes are reported separately to those that occurred in 28 hospital. As minimal proportions of reported hospitalised deaths are expected to be attributable to 29 . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint nursing home residents, we treat the reported hospitalised deaths in France as non-nursing home 30 deaths. To assess the generalizability of IFRs ≥65 derived from this data, we apply them to the 13 31 additional countries and find that they can reconstruct the number of non-nursing home deaths 32 relatively well in these countries ( Figure 1C ). \nThe copyright holder for this preprint this version posted August 26, 2020. . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted August 26, 2020. . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint Table S4 . Ensemble model age-and sex-specific infection fatality ratio estimates. Median and 134 95% credible intervals (CrI), for males, females and the mean of male and female estimates. . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint 149 Figure S8 . Age-specific seroprevalence data from 4 serostudies 9,13,15,18 , plotted at the age-group 150 mid-points. . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted August 26, 2020. . https://doi.org/10.1101/2020.08.24.20180851 doi: medRxiv preprint"}, {"section_title": "427", "text": "Seroprevalence studies 428 We used data from 18 SARS-CoV-2 seroprevalence surveys from 15 countries/regions where the 429 results were representative of the general population and where age-stratified death data were also 430 available, shown in Figure 1A and Supplementary Table S1. In the ensemble model we consider Table S1 )."}, {"section_title": "435 436", "text": "Model 437 We combined age-and sex-specific COVID-19 death data from 45 countries with data from 15 438 seroprevalence surveys, to jointly infer the age-and sex-specific IFRs and country-specific 439 cumulative probabilities of infection. Age-and sex-specific IFRs were estimated in 5-year age-440 groups, with individuals aged 80+ considered as a single age group. Let , , be the population The expected number of deaths estimated by 5-year age-groups were summed to match the 452 corresponding age-groups of observed deaths when reported in coarser age-groups. We fit 453 . CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity."}, {"section_title": "490", "text": ". CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity."}, {"section_title": "80", "text": ". CC-BY-NC-ND 4.0 International license It is made available under a is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity."}]