[{"section_title": "Abstract", "text": "Background: Long-term maintenance of cognitive function is an important goal of treatment for Alzheimer's disease (AD), but evidence about the long-term efficacy of cholinesterase inhibitors is sparse. To evaluate the long-term efficacy and safety of galantamine for AD in routine clinical practice, we conducted a 72-week post-marketing surveillance study. The effect of galantamine on cognitive function was estimated in comparison with a simulated disease trajectory.\nPatients with mild-to-moderate AD received flexible dosing of galantamine (16-24 mg/day) during this study. Cognitive function was assessed by the mini mental state examination (MMSE) and the clinical status was determined by the Clinical Global Impression-Improvement (CGI-I). Changes of the MMSE score without treatment were estimated in each patient using Mendiondo's model. Generalized linear mixed model analysis was performed to compare the simulated MMSE scores with the actual scores. Results: Of the 661 patients who were enrolled, 642 were evaluable for safety and 554 were assessed for efficacy. The discontinuation rate was 46.73%. Cognitive decline indicated by the mean change of actual MMSE scores was significantly smaller than the simulated decline. Individual analysis demonstrated that .70% of patients had better actual MMSE scores than their simulated scores. Significant improvement of CGI-I was also observed during the observation period. Adverse events occurred in 28.5% of patients and were serious in 8.41%. The reported events generally corresponded with the safety profile of galantamine in previous studies. Conclusion: These findings support the long-term efficacy of galantamine for maintaining cognitive function and the clinical state in AD patients. Treatment with galantamine was generally safe. Importantly, this study revealed that galantamine improved cognitive function above the predicted level in .70% of the patients."}, {"section_title": "Neuropsychiatric Disease and Treatment Dovepress", "text": "submit your manuscript | www.dovepress.com "}, {"section_title": "Dovepress", "text": ""}, {"section_title": "1115", "text": ""}, {"section_title": "O r i g i N a l r e s e a r c h open access to scientific and medical research", "text": ""}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD) is the most common type of dementia, affecting over 25 million people worldwide. 1 At present, there are no treatments that can stop or reverse the progression of AD, and current medications such as cholinesterase inhibitors (ChEIs) are only considered to be symptomatic therapy.\nSeveral meta-analyses have consistently documented modest effects of ChEIs on cognitive function. 2, 3 However, these meta-analyses have mainly assessed placebocontrolled randomized trials that demonstrated relatively short-term effects on "}, {"section_title": "1116", "text": "Nakagawa et al cognitive function, neuropsychiatric symptoms, and global clinical assessments. Because ethical constraints prohibit long-term placebo-controlled studies of ChEIs in AD, placebo-controlled trials of these drugs have generally not run for longer than 1 year. On the other hand, AD is a slowly progressive disease and patients can be expected to survive for an average of 8-10 years at the time of diagnosis, 4 which means that long-term efficacy is clinically important. Based on our literature search, only two relatively long-term studies (2 years) have been conducted to assess the efficacy of ChEIs (donepezil and galantamine) in AD, 5, 6 which means there is little evidence regarding the long-term efficacy of these drugs. Due to this lack of robust evidence, the American Geriatric Society has stated that the risk and benefits of longterm ChEI therapy are not well established. 7 Long-term open-label observational studies performed in the routine clinical setting can provide supplementary information to that demonstrated by placebo-controlled trials, particularly with regard to long-term efficacy. Because open-label observational studies lack a placebo arm, detailed understanding of the natural disease trajectory in patients with AD is important for analysis of the data. Several authors have proposed mathematical models for describing cognitive decline in untreated patients with AD. [8] [9] [10] All these models suggest that there is a significant quadratic correlation between baseline cognitive function and the annual rate of cognitive decline in untreated AD cohorts. [8] [9] [10] Using such models, several studies have been conducted to assess the long-term efficacy of ChEIs for AD in comparison with the simulated untreated trajectory of cognitive decline and to establish models for prediction of expected changes in ChEI-treated patients. 11, 12 However, these studies involved prediction of group mean values rather than individual patient outcomes. Therefore, the long-term benefits of ChEI treatment for individual AD patients have not been clarified. Because of the modest effect of ChEIs on cognitive function in AD and considerable variability of the disease trajectory, it is difficult to judge whether ChEI therapy is beneficial on a patient-by-patient basis. To do so would require a reliable individual patient-based predictive model for cognitive outcomes in untreated AD. Such a model could support clinical decisions, such as switching to another ChEI because the current medication was predicted to lack efficacy.\nWe conducted a 72-week post-marketing surveillance study in the routine clinical setting to evaluate the efficacy and safety of galantamine therapy for AD based on the mini mental state examination (MMSE) and the Clinical Global Impression Improvement scale (CGI-I). 13 This study was designed to investigate the following points: "}, {"section_title": "1117", "text": "long-term effect of galantamine on cognition A similar procedure is generally followed in Japan for this type of naturalistic registry study."}, {"section_title": "Outcome assessment", "text": "Cognitive function was assessed by using the MMSE 14 and the global severity and/or change of the clinical condition was assessed by the CGI-I scale. The MMSE and CGI-I scores were determined at baseline and after 4, 12, 24, 36, 48, 60, and 72 weeks of treatment with galantamine. Adverse events (AEs) and data on patients who discontinued treatment were also recorded during the study period.\nAn electronic data capture system was used, allowing the majority of the data to be transcribed from source documents into the electronic case report forms by the attending physicians and transmitted securely to the sponsor."}, {"section_title": "Models of the natural cognitive decline", "text": "The natural course of cognitive decline without treatment was simulated by calculating changes of the MMSE score using a previously reported model. 9 The original model and 95% confidence limits reported by Mendiondo et al was:\nAnnual change of the MMSE score = 1/(ax 2 + bx + c),\nBecause of the significant impact of age in this model, it was weighted according to the duration of cognitive decline for two age clusters as follows. The confidence interval (CI) of the model was adjusted by Bonferroni's correction because of the significantly low probability that all of these three coefficients would take 95% confidence limits. Thus, the final model used in this study was as follows. Estimated 95% CI for 6 months and 1 year determined by these equations with different baseline MMSE values are shown in Table 1 . Based on this table, the number of patients was determined who had MMSE scores higher than the predicted upper limit of the CI (better than untreated), "}, {"section_title": "1118", "text": "Nakagawa et al within the CI range, or below the predicted lower limit of the CI (worse than untreated) after 1 year and after 1.5 years of galantamine treatment."}, {"section_title": "statistical analysis", "text": "The discontinuation rate was estimated by the Kaplan-Meier method, and comparison of the discontinuation rate between patients on monotherapy versus those on combined therapy was performed with the log-rank test. Comparison between simulated and actual changes of MMSE scores was performed with a generalized linear mixed model (GLMM). The actual baseline MMSE scores were used to calculate the predicted scores for each patient. To manage missing values, analysis was based on the observed cases (OC) at each scheduled visit and on data obtained by the last observation estimated forward (LOEF) method, which replaces missing values based on observed previous value and Mendiondo's model. Interactions of time with the type of data (predicted untreated outcome, actual OC, or actual LOEF) were modeled on GLMM. When significant differences were detected, post-hoc comparisons were performed with the Tukey-Kramer test.\nA two-sided P,0.05 was considered to be statistically significant. Statistical analyses were conducted using R Statistical Software, version 3.1.0 (Foundation for Statistical Computing, Vienna, Austria) and SAS software, version 9.3 (SAS Institute Inc., Cary, NC, USA). GLMM was performed with the GLIMMIX procedure of SAS and other analyses were performed using R."}, {"section_title": "Results", "text": ""}, {"section_title": "Baseline demographic and clinical characteristics", "text": "A total of 661 patients were enrolled in this study, of whom 642 were evaluable for safety and 554 for efficacy (Figure 1 ). Seventy subjects were removed from the efficacy dataset because of lack of sufficient baseline information. The baseline demographic and clinical characteristics are summarized in Table 2 . In the safety analysis set, the mean ± standard deviation (SD) age was 79.10±7.20 years, the mean disease duration was 0.73 years, and 4.98% of the patients were hospitalized at study entry. Among the subjects, 22.90% were using other anti-dementia drugs before study entry. According to the functional assessment of staging scale, most patients had mild (39.10%) or moderate (47.66%) AD at study entry, while the mean MMSE score was 18.95±5.04. The mean daily dose of galantamine was 15.01±4.76 mg and "}, {"section_title": "Discontinuation rate", "text": "Discontinuation during the observation period is summarized in Figure 2 . The discontinuation rate was ~20% at 12 weeks, 40% at 48 weeks, and 46.73% after 72 weeks (Figure 2) . Patients discontinued the study because of safety problems (31.08%), transfer to another hospital (24.32%), loss of contact (19.93%), personal choice (11.15%), and other reasons (13.51%). Post-hoc comparison between memantine users and non-users demonstrated a significantly lower discontinuation rate among memantine users than non-users (log-rank test, P=0.0051; Figure 2 )."}, {"section_title": "long-term effect of galantamine on cognitive function", "text": "Changes of the MMSE score during the observation period are shown in Figure 3 . The mean change from baseline to 72 weeks was 0.71 according to OC analysis, 1.21 according to LOEF analysis, and 3.35 for the predicted outcome Table 3 displays the patients whose MMSE scores were above, within, or below the predicted CI. After 1 year, OC analysis showed that 75.65% of patients had an MMSE score significantly above the predicted value without treatment, as did 71.43% of patients at 1.5 years. According to LOEF analysis, 57.79% of patients had an MMSE score significantly above the predicted value after 1 year and 55.75% at 1.5 years. The time course of the observation period in CGI-I is shown in Figure 4 . At 1.5 years, 2.24% of patients were rated as \"very much improved\", 10.45% were \"much improved\", 32.46% were \"minimally improved\", 33.21% were \"no change\", 14.93% were \"minimally worse\", 5.22% were \"much worse\", and 1.12% were \"very much worse\".\nsafety At least one AE occurred in 28.50% of the patients. Table 4 shows AEs that occurred in .1% of the patients. The most frequently reported AEs were nausea (5.30%), decreased appetite (3.43%), vomiting (2.49%), insomnia (1.40%), agitation (1.09%), dizziness (1.09%), and headache (1.09%). At least one serious AE (SAE) occurred in 8.41% of the patients. Frequently reported SAEs occurring in at least two patients and the number of deaths are also listed in Table 4 . The most common SAE was delusions (0.62%). Twelve deaths (1.87%) were reported during the study, with the causes being bronchial pneumonia (n=1, 0.16%), acute bronchitis (n=1, 0.16%), stomach cancer (n=1, 0.16%), aspiration pneumonitis (n=1, 0.16%), myocardial infarction/pneumonia (n=1, 0.16%), complete heart block (n=1, 0.16%), renal insufficiency (n=1, 0.16%), sepsis (n=1, 0.16%), drowning (n=1, 0.16%), and unknown (n=3, 0.47%)."}, {"section_title": "Discussion", "text": "The present study was designed to assess the long-term efficacy of galantamine in patients with mild-to-moderate AD in comparison with the natural disease trajectory predicted using a mathematical model, as well as investigating the safety and tolerability of galantamine therapy for AD in the real-world clinical setting. We found that the mean MMSE score improved over 24 weeks and was stable up to 1 year. Furthermore, there was a long-term beneficial effect on cognitive function measured by the MMSE compared with the predicted outcome without treatment. When efficacy was assessed on a patient-by-patient basis, about 71% of the patients showed significantly better cognitive function at 72 weeks compared with the predicted outcome. In agreement with the changes of the MMSE score, assessment of the CGI-I score also showed that galantamine treatment was effective for maintaining the clinical state (better or unchanged) in almost 80% of the patients at 72 weeks. Taken together, these findings suggest ∆ Figure 3 Mean actual changes of MMse scores and simulated changes during the observation period. Notes: Bars represent the standard error. glMM analysis with post-hoc testing: a) differences between actual Oc and predicted scores, b) differences between actual, LOEF, and predicted scores. Asterisks denote significant differences: *P,0.05, **P,0.01, ***P,0.001. Abbreviations: GLMM, generalized linear mixed model; LOEF, last observation estimated forward; MMSE, mini mental state examination; OC, observed case. "}, {"section_title": "1121", "text": "long-term effect of galantamine on cognition that galantamine therapy could be beneficial for 70%-80% of AD patients. Since about 10% of the patients received memantine in addition to galantamine, we also analyzed the data after excluding memantine users, but we found that the changes of the MMSE score were essentially the same (data not shown). On the other hand, the dropout rate was significantly higher among non-users than among memantine users. The indication for memantine therapy is moderateto-severe AD in Japan and the mean baseline MMSE score of memantine users was significantly lower than that of non-users (mean ± SD: 16.79±5.41 for memantine users vs 19.13±4.97 for memantine non-users, t-(427) =2.43, P=0.02). The lower dropout rate of memantine users in the present study is inconsistent with the results of a previous study that suggested baseline disease severity and age were associated with dropout from AD trials. 15 However, we have no adequate explanations for such a discrepancy at present. Safety evaluation revealed that all of the reported AEs were known events, such as gastrointestinal symptoms. Serious cardiovascular AEs were observed in 0.78% of the patients. There were no unpredictable or rare AEs, including Pisa syndrome. Accordingly, both efficacy and safety data supported the validity of long-term galantamine therapy for mild-to-moderate AD.\nThis study not only demonstrated a long-term beneficial effect of galantamine therapy for AD at the group level, but also revealed that galantamine maintained cognitive function of individual patients in the routine clinical setting. Published consensus recommendations and clinical practice guidelines advocate an individualized approach to AD, but there is a need for more evidence that long-term therapy is worthwhile. 16, 17 As shown in Table 1 , our present findings could be useful for assisting physicians and the relatives of patients when deciding treatment options. A previous study established a patient-level AD model and simulation method by applying beta regression to the Alzheimer's disease assessment scale cognitive subscale (ADAS-cog). 18 While this beta regression model employing ADAS-cog could be suitable for clinical trials of disease-modifying drugs, it is complicated and ADAS-cog is not usually employed in the routine clinical setting. On the other hand, simulating changes of the MMSE score by using Mendiondo's model is simple and can be easily applied to individual patients in routine practice.\nSimilar to the present results, two previous placebocontrolled studies have demonstrated long-term beneficial effects of ChEI therapy. 6, 19 On the other hand, the Alzheimer's Disease Neuroimaging Initiative (ADNI) and the Australian Imaging, Biomarkers and Lifestyle study obtained opposing results, with greater cognitive decline amongst AD patients taking ChEIs compared with those not using ChEIs. 20 Unlike the aforementioned two randomized controlled trials (RCTs) showing a favorable effect of ChEIs, the ADNI study was not a randomized trial, so treatment selection bias should be taken "}, {"section_title": "1122", "text": "Nakagawa et al into consideration when interpreting its results (ie, physicians might have selectively prescribed ChEIs for patients with more progressive AD). We consider that long-term ChEI therapy is generally beneficial for AD patients. As mentioned above, the present study demonstrated similar efficacy to that found in a previous 2-year placebocontrolled RCT of galantamine, 6 but there were some discrepancies between our results and previous findings. Although similar patient factors were considered to be associated with cognitive decline (baseline MMSE and age), the previous study demonstrated a more rapid decrease of MMSE scores in patients receiving galantamine treatment compared with our results. It is possible that survival bias contributed to the favorable effect of galantamine in the present study. Observational studies have an inherent risk of survival bias due to dropout and high dropout rates are a problem in all long-term studies of AD. In this study, the completion rate was actually higher than in the previous study; however, it should be taken into consideration as different criteria for the termination: previous study has been terminated due to a Data Safety Monitoring Board-recommended early study termination. According to Wallin et al, the reported 1-year completion rate ranges widely from 26% to 89%. 12 The completion rate was 53% at 1.5 years in the present study, which is average for this type of study. When changes of the MMSE score were assessed by OC analysis, the MMSE score was evaluated at 72 weeks in only 38.2% of the patients; so, there is a potential risk of survival bias. Since the last observation carried forward method seems to be inappropriate for analysis of MMSE decline in patients with a progressive disease like AD, we predicted MMSE decline based on Mendiondo's model and applied the results to dropouts as a supplementary analysis. The results of our group level LOEF analysis were essentially the same as those of OC analysis. On the other hand, there were an increased number of patients within the disease trajectory due to the relatively high discontinuation rate. However, .50% of patients still showed significantly better cognitive function compared with the predicted outcome. While we cannot completely exclude survival bias, we believe that our data indicate a long-term beneficial effect of galantamine treatment on cognitive function. Indeed, a previous long-term randomized head-to-head comparison of galantamine with donepezil and an observational study with a relatively high completion rate demonstrated similar MMSE changes to those in our study, with stabilization of MMSE scores after 1 year of treatment. 12, 21 Another important difference between the present findings and those of the previous 2-year study of galantamine therapy 6 is that the decline of MMSE scores predicted by Mendiondo's model was more rapid than that observed in the placebo group of the previous study. Because the factors associated with Mendiondo's model (age and baseline MMSE score) were similar in both studies, this discrepancy should need to be explained. One possible explanation is the placebo effect in patients allocated to the placebo arm in the previous study. Since Mendiondo investigated the natural history of AD in an observational study without pharmacological intervention for dementia, the placebo effect on MMSE changes should have been negligible in their data. On the other hand, MMSE changes of participants in the previous placebo-controlled RCT would probably be modulated by the placebo effect and this might have contributed to the discrepancy with our present findings. Another possibility is that Mendiondo's mathematical model overestimates cognitive decline in untreated patients due to general advances in medicine since the 1980s, when the data set for the mathematical model was acquired. For example, an association between vascular risk factors, such as hypertension, diabetes, and cardiovascular disease, and the pathogenesis and/or progression of AD received attention only since around 2000. 22 In elderly people, vascular risk factors are currently managed better than in the 1980s. This could affect the disease trajectory of AD and lead to overestimation of cognitive decline in untreated patients due to changes in the healthcare environment. Indeed, a previous pooled analysis of studies on donepezil conducted between 1990 and 1999 revealed that patients allocated to placebo therapy showed slower cognitive decline in more recent trials compared with older trials, despite having more comorbidities. 23 Furthermore, our previous network metaanalysis of ChEI therapy revealed an increasing placebo effect on cognitive function over time across various drugs of this class. 24 These results suggest that there may have been possible overestimation of the speed of cognitive decline based on Mendiondo's model in the present study. However, other studies conducted in the 2000s have revealed similar or more rapid decline of MMSE scores than the present data. 5, 25 For example, a study of the natural history of AD over 3 years reported by Holmes and Lovestone demonstrated annual decline of the MMSE score by 3.4 points (SD 3.5: median =3.0) in patients with mild-to-moderate disease. 25 This reported rate of decline is larger than the decline simulated by Mendiondo's model in this study, but Holmes and Lovestone investigated a relatively small sample. 25 Further research is needed to establish a contemporary disease trajectory model of AD for evaluating the efficacy of ChEI therapy and better management of AD patients.\nSome limitations of the present study should be mentioned. First, the diagnosis of AD was done based on "}, {"section_title": "1123", "text": "long-term effect of galantamine on cognition physician's clinical judgment rather than the strict diagnostic criteria. One would be concerned about the diagnostic accuracy of this study; however, the purpose of the study is to show effectiveness of galantamine in the real world. In this context, diagnosis based on physician's clinical judgment seems to be suitable for the purpose of this study. Second, several important patient characteristics associated with AD progression and risk were not investigated, including apolipoprotein E (ApoE) alleles and education level. While the influence of the ε4 allele on the risk of AD and its age of onset is generally consistent in most studies, there have been widely varying reports with regard to whether different ApoE alleles influence the rate of cognitive decline following the onset of dementia. 26 Mendiondo's model does not require information on ApoE alleles and we do not consider the lack of allele data to be a critical flaw. A lower education level is also considered to be a risk factor for developing AD and rapid progression. 9, 27 However, Wattmo et al reported an opposite effect of education level on the long-term outcome of AD, with a high education level being a risk factor for faster cognitive decline. 28 Thus, the relationship between education and disease progression remains to be clarified. Furthermore, the influence of education level on Mendiondo's model is smaller than that of age, so lack of education level data in this study should not be a critical flaw."}, {"section_title": "Conclusion", "text": "This 1.5-year observational study revealed long-term efficacy of galantamine for maintaining cognitive function in AD patients based on changes of the MMSE score, and also showed that galantamine therapy was generally safe and well tolerated. Importantly, individual analysis demonstrated that galantamine was beneficial for .70% of AD patients."}, {"section_title": "Neuropsychiatric Disease and Treatment", "text": ""}, {"section_title": "Publish your work in this journal", "text": "Submit your manuscript here: http://www.dovepress.com/neuropsychiatric-disease-and-treatment-journal Neuropsychiatric Disease and Treatment is an international, peerreviewed journal of clinical therapeutics and pharmacology focusing on concise rapid reporting of clinical or pre-clinical studies on a range of neuropsychiatric and neurological disorders. This journal is indexed on PubMed Central, the 'PsycINFO' database and CAS, and is the official journal of The International Neuropsychiatric Association (INA). The manuscript management system is completely online and includes a very quick and fair peer-review system, which is all easy to use. Visit http://www.dovepress.com/testimonials.php to read real quotes from published authors. "}]