[{"section_title": "Abstract", "text": "After 10 years of No Child Left Behind standards-focused education, mathematics scores have improved only marginally for elementary-aged students. Students who developed a solid conceptual mathematics foundation at the elementary level succeeded later in higher-level mathematics courses; thus, educators have sought ways to increase mathematics achievement, especially among elementary school students. Educators have utilized advances in technology with gamebased learning applications and wireless Internet access to create exciting interactive learning opportunities for students that may translate into student achievement. The purpose of this quantitative, quasi-experimental study was to examine the effects of iPad use as a 1-to-1 (1:1) computing device on 5th-grade students' mathematics achievement in two rural Virginia elementary schools. A nonequivalent groups pretest and posttest design was used with 104 fifth-grade students. For one academic quarter of nine weeks, the experimental group used iPads as 1:1 computing devices daily during mathematics class while the control group members did not. A pretest was administered before the iPad intervention and a posttest was administered after the iPad intervention. The change from pretest to posttest was not significantly different between the two groups as measured by a one-way repeated measures analysis of variance. Recommendations for future study include increasing the intervention duration, using additional participants, collecting qualitative data, and providing students with continuous 24-hour, seven-day-a-week iPad access."}, {"section_title": "Introduction", "text": "In 2002, the No Child Left Behind (NCLB) act was instituted to foster improvements in academic achievement for all students. Even with federal support from NCLB, U.S. elementary students' mathematics achievement has continued at rates below average (National Assessment of Educational Progress [NAEP], 2000 [NAEP], , 2003 [NAEP], , 2005 [NAEP], , 2007 [NAEP], , 2009 ; Program for International Student Assessment [PISA], 2000 [PISA], , 2003 [PISA], , 2006 [PISA], , 2009 ; Trends in International Mathematics and Science Study [TIMSS], 2003 [TIMSS], , 2007 . According to experts at the NAEP (2003, 2005, 2007, 2009) , less than half of students nationally had a solid understanding of mathematics conMaterial published as part of this publication, either on-line or in print, is copyrighted by the Informing Science Institute. Permission to make digital or paper copy of part or all of these works for personal or classroom use is granted without fee provided that the copies are not made or distributed for profit or commercial advantage AND that copies 1) bear this notice in full and 2) give the full citation on the first page. It is permissible to abstract these works so long as credit is given. To copy in all other cases or to republish or to post on a server or to redistribute to lists requires specific permission and payment of a fee. Contact Publisher@InformingScience.org to request redistribution permission.\ntent. An intentional focus on mathematics in the elementary years would be necessary to ensure students' foundational mathematics understanding and to increase students' mathematics achievement (Ozel, Yetkiner & Capraro, 2008; Sarama & Clements, 2009) .\nResearchers have encouraged the integration of technology in the mathematics classroom (Amin, 2010; Banister, 2010; Moreau, 2010; Ross, Morrison, & Lowther, 2010) . Officials in many school districts have invested in student technology because research has indicated that technology could be used to promote students' learning, engagement, and mathematics achievement (Bell, 2007; Castelluccio, 2010; Cuban, 2001; DeCastro-Ambrosetti & Cho, 2002; Stevens, 2011; Suki, Suki, Eshaq, & Choo, 2010; Todd, 2010; Traxler, 2010) . The iPad is one of the most recent technology devices introduced into classrooms. The iPad has specialized applications in which multiple senses (e.g., auditory, visual, and tactile) are incorporated; the use of multiple sensory inputs has been shown to reinforce student learning and to achieve a variety of mathematics objectives (Castelluccio, 2010; Hill, 2011; Murphy, 2011; Price, 2011; Stevens, 2011) . Interactive game-based learning and wireless Internet access with the iPad could become tools with which educators revamp the current learning environment (Hill, 2011) . Scholarly research on the effects of iPad use on education has been limited in general and nonexistent for mathematics achievement since the device became available in 2010, specifically within the elementary setting (Hlodan, 2010) . The thorough investigation of the effects of iPads on fifth-grade mathematics achievement could not only fill a gap in the existing literature but also be used to inform elementary mathematics teachers.\nThe purpose of the current quantitative, quasi-experimental study was to examine the impact of the iPad's use as a 1:1 computing device on fifth-grade students' mathematics achievement in two rural Virginia elementary schools. Both schools were located within Samuel Douglas County (pseudonym used) school district, located in the western region of Virginia. As based on a power analysis, a group of 48 fifth-grade student participants from one elementary school and 56 fifthgrade student participants from a second elementary school of similar demographic characteristics completed the same Scott Foresman-Addison Wesley (SFAW) fifth-grade mathematics Virginia standards of learning (SOL) aligned assessment pretest. For one academic quarter, the participating teacher and fifth-grade mathematics students in the experimental group used the iPads as 1:1 computing devices for at least one mathematics activity daily during math class. These iPad activities included, but were not limited to, playing game-based learning applications, reviewing presentations, accessing online video tutorials, or using interactive manipulatives. The participating teacher and students in the control group did not use iPads as 1:1 computing devices daily during the mathematics class. Non-iPad activities included, but were not limited to, playing collaborative learning games, completing worksheets and projects, or using physical manipulatives. After the academic quarter, all participating fifth-grade students completed the same SFAW fifth-grade mathematics Virginia SOL aligned assessment posttest. The iPad intervention effects were measured according to the mean difference between the two groups from the pretest to the posttest.\nLimited research exists regarding the potential use of the iPad in the elementary mathematics classroom (Hlodan, 2010) . Data were provided regarding what relationship, if any, existed between student mathematics achievement and iPad use in classrooms. School administrators and other academic directors could use the results to make informed decisions about purchasing technology and using iPads for mathematics instruction."}, {"section_title": "Theoretical Framework", "text": "The theoretical foundation for the study was the experimental theory developed by the American philosopher, John Dewey. Dewey (1922) wanted to gain a better understanding of how and why students learned. He concluded that learners gained knowledge through their individual experi-ences. Dewey stated that \"to 'learn by experience' is to make a backward and forward connection between what we do to things and what we enjoy or suffer from things in consequence\" (p. 164). In these active-passive movements, students acquired knowledge through fruitful experiences (Dewey, 1922 (Dewey, , 1938 (Dewey, /1998 .\nUnlike other theorists of his time, Dewey (1922) focused his progressive approach on student needs. Dewey believed in creating student-centered learning experiences that were not only valuable and relevant but also flexible for students' needs (Pieratt, 2010; Tzuo, 2007) . With foundations in continuity and interaction, student-centered learning could be used to encourage students toward more active and participatory roles in their learning (Heise & Himes, 2010; Marlowe & Page, 2005; Pieratt, 2010; Tzuo, 2007) . Despite the theory's age, Dewey's student-centered theory has remained evident in current schools as a means of innovation and change (Ornstein & Levine, 2003; Pieratt, 2010; Vartuli & Rohs, 2007 ).\nDewey's educational theories and philosophies have been debated since their origin in early 19th century (Westbook, 1993) . The strongest opponents of Dewey's progressive theory were educational traditionalists or essentialists, who believed knowledge should be given directly to students in a formal, systematic fashion (Ornstein & Levine, 2003) . Essentialists claimed two problem areas in applying Dewey's progressive theory: that academic achievement, student learning, and economic productivity were diminished; and that universal truths and values were questioned (Ornstein & Levine, 2003; Westbook, 1993) .\nDewey responded to his opponents by criticizing traditional education, in which a stringent curriculum was imposed on children in methods similar to those used with the NCLB act (Pieratt, 2010) . In Dewey's (1922) explanation of traditional education, a pupil became \"one who is engaged not in having fruitful experience but in absorbing knowledge directly\" (p. 164). Dewey opposed Locke's blank slate essentialist philosophy and advocated for schools and teachers to engage students in meaningful learning experiences. After all, Dewey (1922) asserted:\nThe pupil has a body, and brings it to school along with his mind. And the body is, of necessity, a wellspring of energy; it has to do something. But its activities, not being utilized in occupation with things which yield significant results, have to be frowned upon. (p. 164) Dewey's (1922) conclusions that learners gained knowledge through their individual experiences have continued to be suspect as modern essentialists have called for a \"back to basics\" movement. Progressivists have advocated, as Dewey did, that curriculum and learning should be focused on students' experiences (Tanner & Tanner, 2007, p. 101) . According to a student-centered, experiential, theoretical framework, the academic achievement of students could be influenced through experiences with iPads. When applied to the present study, experimental theory was the foundation for the hypothesis that the independent variable of classroom iPad experiences would influence the dependent variable of students' posttest performance, as based on Dewey's (1922) idea that students learned through experience.\nThe research question for the present study was developed to examine the effects of the iPad's use as a 1:1 computing device on fifth-grade students' mathematics achievement in two rural Virginia elementary schools. A nonequivalent groups design was used, in which the scores from the fifth-grade mathematics SFAW Virginia SOL aligned pretest and posttest assessment demonstrated the impact of iPad use, if any, on fifth-grade students' mathematics achievement. The emphasis on mathematics achievement has been discussed extensively in scholarly literature. A deeper understanding of the impact, if any, of mobile learning devices like iPads on elementary mathematics achievement is necessary to fill the gap in literature and provide valuable information about 21st-century learning to teachers, administrators, and school districts. One research question was explored in the quantitative, quasi-experimental study:\nQ1. What, if any, difference exists in mathematics achievement among fifth-grade students in a small, rural Virginia school district as measured by the fifth-grade mathematics SFAW Virginia SOL aligned assessment for students in the group in which iPads were used in a 1:1 setting for mathematical instruction as compared to students in the group in which iPads were not used?"}, {"section_title": "Literature Review", "text": "Many students in the 21st century operate portable music players, handheld gaming systems, and cell phones. The use of mobile technology has become almost second nature to many students, but these devices are not readily available in schools (O'Brien & Scharber, 2010; Shuler, 2009) .\nResearchers have encouraged the use of technology in the classroom since the early 20th century (Amin, 2010; Ross et al., 2010) . In the 1940s, overhead projectors were considered the superior audio-visual media device (Amin, 2010) . Later, televisions and video home system tapes were used to provide high quality instructional material (Nugent, 2005) . More recently, teachers have used a variety of handheld technologies such as iPods, laptops, and smart phones to increase engagement and student learning (Ash, 2011; Banister, 2010; Donovan, Green, & Hartley, 2010; Franklin, 2011; Granberg & Witte, 2005; Hill, 2011; Li & Pow, 2011) .\nAcademic leaders have invested billions of dollars in educational technologies to improve teaching and learning (Bebell, O'Dwyer, Russell, & Hoffmann, 2010; Cuban, 2001) . Technology has become apparent in many K-12 classrooms, yet very few researchers have focused on the effect of technology in the elementary mathematics setting. Technology could be vital to creating authentic learning opportunities (Allsopp, Kyger, & Lovin, 2007) . Numerous academic studies have shown the significant positive correlation between technology, student learning, and mathematics achievement (Alagic, 2003; Berk, 2010; Hamilton, 2007; Hubbard, 2000; Mendicino & Heffernan, 2007; National Council of Teachers of Mathematics, 2008; Park, 2008; Rosen & Beck-Hill, 2012) . Hamilton (2007) found that the incorporation of technology was correlated with improved student mathematics achievement. Rosen and Beck-Hill (2012) reported educational technology could assist in closing the achievement gap and incorporate higher order thinking skills.\nSince 2010, tablet computers like the iPad have been both the most recent and the most popular handheld game-based learning devices (Buckley, 2010; Castelluccio, 2010; Hill, 2011; Murphy, 2011; Price, 2011; Stevens, 2011) . The iPad is a 0.34-inch thick, 1.33-pound, multitouch-screen tablet computer advertised as a device that could revolutionize learning (Buckley, 2010; Hill, 2011) . Technology-focused students enter classrooms daily nationwide; therefore, the market for the iPad in education could be expansive (Stevens, 2011) .\nThe iPad is a high demand commodity in schools for a variety of reasons. First, the iPad has a user-friendly processing system so individuals of all ages could use the device easily (Buckley, 2010; Price, 2011; Wang, 2010) . Second, the lightweight handheld mobile device could be transported as a replacement for heavy textbooks (Buckley, 2010; Stevens, 2011) . Third, the iPad is capable of high-speed, wireless Internet connections for web-based searching (Murray & Olcese, 2011; Price, 2011) . Aside from having Internet access, students have enjoyed the many gamebased applications, or apps, offered on their mobile devices. Teachers have started using iPad educational game-based applications, multitouch screen, and multisensory capabilities to engage, introduce, practice, and reinforce learning concepts (Castelluccio, 2010; Hill, 2011; Murphy, 2011; Murray & Olcese, 2011; Price, 2011; Stevens, 2011) .\nVisionary mobile learning devices, such as the iPad, are expected to have a valuable role in 21st century learning if teachers and students could properly utilize the device's potential (Banister, 2010; Bauleke & Herrmann, 2010) . Technology, like game-based applications, might \"anchor mathematics instruction in [a] meaningful context that enhance[s] learning outcomes\" (Allsopp et al., 2007, p. 203) .\nResearchers Murray and Olcese (2011) began investigating the game-based applications on iPads as educational technology tools. The purpose of their study was to identify if iPads were helpful for both students and educators to \"do things in educational settings that they could not otherwise do\" without the device (p. 43). Overall, within the context of the K-12 classroom, Murray and Olcese reported few examples of iPad apps that supported \"truly innovative teaching and learning in the sense that they represent resources that extend what educators and students could otherwise do\" (p. 46). However, the researchers reported that the majority of learning applications were out of touch with today's modern learning theories, leaving students without the skills they will need to compete in the 21st century learning environment.\nTwo other recent studies incorporated the use of game-based learning applications using a tablet. In a five-week experimental study, Li and Pow (2011) found the use of 1:1 tablet personal computers (PCs) had an \"immense impact on learning if students are empowered to use technology as their cognitive companion\" in a diverse Hong Kong primary school (p. 319). The results of Li and Pow's study showed enhanced motivation to learn, stronger development of cognitive skills, and improved learning strategies. In 2010-2011, Houghton Mifflin Harcourt and Amelia Earhart Middle School in California partnered for a pilot study using the hMh Fuse app for Algebra I. During the study, students had full access to iPads and could take the iPads home and customize them. The yearlong 1:1 learning intervention-based study found students to be \"more motivated, more attentive in class, and more engaged with Algebra content relative to students using textbooks. This change in student behavior also resulted in markedly improved student test scores at the end of the school year\" (Houghton Mifflin Harcourt, 2012, p. 3). The results indicated a 19% increase on the California Achievement Test for students who passed proficient or passed advance in the experimental group. Both studies offer a promising sign for the potential use of technology and game-based learning to positively impact mathematics achievement (Ash, 2011; Houghton Mifflin Harcourt, 2012; Wright, 2012) .\nGame-based learning has gained popularity as an effective and innovative instructional strategy among 21st century mathematics teachers (Lavin-Mera, Torrente, Moreno-Ger, Vallejo-Pinto, & Fernández-Manjón, 2009; Mansour & El-Said, 2009 ). Mansour and El-Said (2009) explained that the use of game-based learning as an educational tool was still in its infancy. When teaching mathematics, Griffin (2007) suggested that teachers might connect examples to the real world through interactive games. Elementary students typically enjoyed academic games and were excited and interested about math while playing them (Griffin, 2007) .\nUtilizing gaming in the mathematics classroom has benefits. Mathematics games can be used to increase engagement, motivation, and student learning (Clark & Ernst, 2009; Huizenga, Admiral, Akkerman, & Dam, 2009 ). Students using games had multiple opportunities for real-world content application followed by positive encouragement or corrective feedback (Allsopp et al., 2007) . According to Jackson (2009) , teachers can learn about cooperative learning and problem solving from video games. Like any lesson plan based on educational objectives, most games are objective driven, in which students had a venue for fun, interactive tools to learn educational concepts (Hoffmann, 2009 ).\nIncorporating games could help teachers plan for an objective-filled, problem-based mathematics lesson (Van de Walle, Karp, & Bay-Williams, 2010) . Mathematics concept knowledge is foundational for mathematics instruction. Allsopp et al. (2007) suggested that teachers teach for student understanding; teachers often had been focused on obtaining the final answer instead of ensuring students conceptually understood how to solve the entire question. Game-based learning apps could be used to facilitate students' problem solving abilities and conceptual understanding of mathematics. Equally as important as playing the mathematics game was active discussion of the activity and mathematical strategies and processes with students ( Van de Walle et al., 2010) .\nThe incorporation of technology must be appropriate and strategic to be effective (National Council for Teachers of Mathematics, 2008) . Most free educational games on mobile learning devices like laptops and iPads involve simple recall questions, whereas Hoffmann (2009) believed games should be designed as challenges to students' thinking and problem-solving skills. Recall questions were useful to a degree, but the optimal power of game-based learning in a mathematics game would \"require resolve, concentration, the use of a variety of strategies, imagination, and creativity\" (Hoffmann, 2009, p. 122) .\nThe National Council of Teachers of Mathematics (2000) experts encouraged teachers to select instructional mathematics activities to enhance student learning. The iPad had a variety of instructional mathematical game applications and virtual manipulative applications for maximized learning with minimal preparation (Griffin, 2007) . Students might benefit from additional exposure to mathematics through game-based learning using iPad applications (Griffin, 2007) . The convenience of handheld mobile learning devices might be of benefit in the use of game-based learning (Lavín-Mera et al., 2009) . Students with digital gaming experience-with applications similar to those on the iPad-have learned from their experiences playing digital games (Van de Walle et al., 2010) ."}, {"section_title": "Summary", "text": "Despite the academic accountability mandated in NCLB, American students continue to struggle in mathematics (NAEP, 2000 (NAEP, , 2003 (NAEP, , 2005 (NAEP, , 2007 (NAEP, , 2009 PISA, 2000 PISA, , 2003 PISA, , 2006 PISA, , 2009 TIMSS, 2003 TIMSS, , 2007 . As mathematics teachers have been working to improve student learning, incorporating powerful handheld 1:1 technologies with game-based learning applications like the iPad might be used to \"guide students to exploration, discovery, practice, appreciation, and wonder,\" which may lead to increased achievement (Goddard, 2002, p. 26) . Roughly two decades ago, Kulik and Kulik (1991) predicted \"a day when computers will serve all children as personal tutors: a Socrates or Plato for every child of the 21st century\" (p. 75). The iPad might be one tool with which Kulik and Kulik's prediction becomes a reality. As iPads with game-based learning apps become more prevalent in the classroom, researchers, teachers, and administrators need to understand the effects of iPad use on students' understanding of elementary mathematics (Enriquez, 2010 ). The present quantitative, quasi-experimental study is at the forefront of cuttingedge educational developments as no elementary mathematics school 1:1 initiatives have been documented; thus, tablet usage in the elementary school environment has not been researched. As tablets and game-based learning is being encouraged in the classroom, elementary school teachers desire to know the impact of devices like the iPad on mathematics achievement."}, {"section_title": "Methodology", "text": ""}, {"section_title": "Participants", "text": "The study occurred in two elementary schools in Virginia within a few hours' driving distance from several large cities. The participating agricultural county has a population of approximately 75,134 residents (U.S. Census Bureau, 2011). The county school district officials were well known for academic success in meeting state and federal standards. Officials were given the 2009 Board of Excellence award. All schools within the district were accredited fully by the state's department of education. Teachers in the participating school district were considered tech savvy, because more than 160 teachers have received a National Education Technology Standard for Teachers Certification (i.e., NETS*T).\nThe two teachers who participated in the study had equivalent levels of professional experience, evaluation practices, and instructional practices. Both teachers had attained at least a bachelor's degree and a professional, endorsed Pre-K through 6th-grade teaching certification in the state of Virginia. The participating teachers received exceptional administrative evaluations and had completed at least five years of teaching experience. In addition, both teachers taught three fifthgrade mathematics courses for approximately 60 minutes five times per week.\nThe participating fifth-grade mathematics students included two separate but approximately equal-in-number groups based on school enrollment within Samuel Douglas County. All fifthgrade mathematics sections at Grace Hannah elementary school (pseudonym used) were combined to create the experimental group. In total, 56 fifth-grade mathematics students participated from Grace Hannah elementary school comprised of 23 females and 33 males. All fifth-grade mathematics sections at Lucas Robert elementary school (pseudonym used) were combined to create the control group for a total of 48 fifth-grade mathematics student participants. The Lucas Robert participants had 26 female students and 22 male students. Participating students enrolled in the participating elementary schools in the fifth-grade were, on average, 10 or 11 years of age."}, {"section_title": "Procedures", "text": "In the study, the impact of iPad use on fifth-grade students' mathematics achievement over the course of one academic quarter was investigated. Data were collected using the SFAW Virginia SOL aligned assessment. The fifth-grade mathematics SFAW Virginia SOL aligned assessment is part of the fifth-grade curriculum and is sensitive to measuring change in mathematics scores over time. The multiple-choice textbook series assessments, like the fifth-grade mathematics SFAW Virginia SOL aligned assessment, have been used often in studies assessing achievement over time (Agodini, Harris, Atkins-Burnett, Heaviside, Novak, & Murphy, 2009; Lewis, 2011; Resendez & Azin, 2006; Resendez, Azin, & Strobel, 2009; Viadero, 2009 ) and were \"considerably more reliable\" than other assessment instruments when used to measure achievement (Walberg, 2011, p. 24). The fifth-grade mathematics SFAW Virginia SOL aligned assessment pretest and posttest is a 50-question multiple-choice cumulative test specifically designed to resemble the Virginia SOL mathematics assessment. The assessment was scored on a numerical scale from 0 to 50, with a maximum possible score of 50. The number of questions correct was the measure of mathematics achievement of participating students in both groups. The fifth-grade mathematics SFAW Virginia SOL aligned assessment was the optimal pretest and posttest assessment for the current study.\nBefore the study, both participating teachers covered mathematical content from the Virginia fifth-grade 2009 SOLs using the SFAW fifth-grade textbook series. The participating teachers focused their instruction within the six mathematical strands: (a) number and number sense; (b) computation and estimation; (c) measurement, (d) geometry, probability and statistics; and (e) patterns, functions, and algebra, using the district's fifth-grade mathematics benchmarks as a pacing guide. Both participating teachers followed the district's fifth-grade mathematics benchmarks for the previous academic quarters and covered instructional content before the intervention. These concepts include (a) place value; (b) adding, subtracting, and multiplying whole numbers and decimals; (c) dividing with one-digit and two-digit divisors; (d) data, graphs, and probability, and (e) geometry. Students completed the fifth-grade mathematics SFAW Virginia SOL aligned assessment pretest before the iPad intervention, which was the baseline data. One of the district's instructional technology resource teachers trained the participating teachers in iPad use. After the iPad training, iPads were distributed to the experimental group.\nDuring the present study, both teachers obtained instructional content and mathematics objectives directly from the Virginia SOL fifth-grade mathematics 2009 curriculum framework. Both participating teachers covered mathematical content from the Virginia fifth-grade 2009 standards of learning using the SFAW fifth-grade textbook series during this experiment. Teachers focused instruction within the six mathematical strands using the district's benchmarks as a pacing guide. Both participating teachers followed the district's fifth-grade mathematics benchmarks covering the remaining instructional content from the fifth-grade mathematics 2009 curriculum including (a) fraction concepts, (b) fraction operations, (c) measurement, (d) integers, and (e) equations.\nThe participating teachers' lesson plans were collected for the duration of the study. The researcher compared the lesson plans to the instructional methods used throughout the study. The lesson plans were used to gain additional insight into what actually occurred instructionally the classroom. Participating teachers were asked to complete the Lesson Plan Accuracy Rubric (LPAR) daily (see Appendix). The LPAR was distributed to several experienced colleagues to check the instrument for validity. This instrument served as a diary to record any deviations from the submitted lessons plans. External events that were not under the teacher's control might have interfered with the implementing of a lesson such as fire drill or assemblies. To accurately document the delivery of the intervention and control conditions, the participating teachers completed the LPAR daily. The participating teacher recorded information about iPad usage, lesson plan implementation, external events or circumstances, and additional related notes. The LPAR was totaled at the end of each week to determine the overall accuracy of the lesson plan implementation.\nThe posttest occurred after the iPad intervention. Participating students' posttest scores on the fifth-grade mathematics SFAW Virginia SOL aligned assessment were used to measure mathematics achievement. According to Bebell et al. (2010) , \"well developed aligned assessments likely resulted in more reliable scores and provide increased validity for inferences about the impacts of technology\" (p. 44)."}, {"section_title": "Results", "text": "The data were screened through a variety of tests. In Table 1 the descriptive statistics were processed for outliers and skewness to ensure no discrepancies existed in the data, which might influence the results. The descriptive statistics in Table 1 indicate 104 participating students with 48 students in the control group without iPad usage and 56 students in the experimental group with iPad usage. All 104 students participated in the SFAW pretest and posttest assessment.\nA one-way repeated measures ANOVA was appropriate for the study because the design involved a treatment factor and a time factor. The treatment (iPad and non iPad) represented the between-subjects factor, and the time (pretest and posttest) represented the within-subjects factor. Figure 1 shows a bar graph of the pretest and posttest results of the experimental and control groups.\nThe control group completed the pretest with a mean pretest score of 55.58%. At the end of the academic quarter, the control group had a mean posttest score of 62.25%. This is a positive difference of 6.67%. The results indicate a significant change over time from the beginning of the academic quarter to the end of the academic quarter. The experimental group completed the pretest with a mean pretest score of 61.05%, which is significantly higher than the control group. The experimental group had a mean posttest of 67.79%. This is a positive difference of 6.74%.\nComparing the growth of the control group and the experimental group, a difference of 0.07% was identified. Based on the results as shown in Figure 1 , not enough evidence existed to reject the null hypothesis in which it was assumed that no difference in mathematics achievement would exist between the experimental and control groups as measured by the fifth-grade mathematics SFAW Virginia SOL aligned assessment. "}, {"section_title": "Discussion", "text": "The theoretical foundation for the study was Dewey's (1922) experimental theory that learners gained knowledge through their individual experiences. Dewey (1938 Dewey ( /1998 ) advocated for schools and teachers to engage students in meaningful learning experiences. Learners might become bored with the mundane tasks performed in the traditional education setting; thus, studentcentered experiences such as those available with iPad game-based applications could be used to pique their interest (Vatuli & Rohs, 2007) . According to a student-centered experiential theoretical framework, the academic achievement of students could be influenced through experience with iPads.\nBased on the design of the study and the reported data, experiences with iPads were not meaningful enough to significantly influence students' mathematics achievement. This finding indicates that instruction with the supplemental use of the iPad was not an effective intervention for fifthgrade students' mathematics achievement according to the manner in which the current investigation was conducted. These findings are aligned with existing studies in which 1:1 mobile learning devices, like the iPad, were not shown as influential on student achievement.\nThe following three studies 1:1 initiatives found no relationship with student achievement. Members of the Texas Center for Educational Research (2009) examined the long-term effect of 1:1 laptops on student learning using 21 middle schools in the experimental group with a 1:1 laptop initiative and 21 middle schools in the control group without a 1:1 laptop initiative. Over a period of three years, the results showed no statistical significance in mathematics achievement on state standardized testing for the majority of the population. In addition, Hu (2007) reported findings of numerous school districts in New York, Massachusetts, California, Virginia, Florida, and Texas whose administrators have found no overall difference in students' academic achievement when using a 1:1 laptop initiative. According to Holcomb (2009) , schools nationwide are abandoning 1:1 mobile device initiatives due to lack of results and astronomical upkeep costs.\nOne of the most desired results of a 1:1 mobile initiative is the increase of standardized achievement test scores (Rockman, 2004 ); yet, a disconnect may exist between standardized assessments like the SFAW Virginia SOL aligned assessment and the benefits of using 1:1 mobile devices (Holcomb, 2009; Rockman, 2004) . Rockman (2004) , who had evaluated more than 50 school district's technology implementation studies, found only \"isolated examples of test score increases but they are slippery: neither consistent nor necessarily tied to the use of computers\" (p. 37). Although the use of 1:1 mobile devices showed promise to assist students in 21st-century learning skills, Holcomb (2009) stated that in using a 1:1 initiative, \"it is important to recognize the existing standardized assessment may be ill equipped to measure 21st century learning\" (p. 54). It is possible the SFAW Virginia SOL aligned assessment was ill equipped for measurement of students' 21st-century learning.\nThe data suggests the iPad intervention did not have a statistically significant impact on students' mathematics achievement. The study duration could be an explanation for the insignificant impact. Of all of the technology intervention achievement-based studies referenced throughout the present study, 50% of interventions occurred for less than one academic semester; thus, the current study duration was aligned with existing research. In implementing a 1:1 initiative, school leaders must maintain realistic expectations that the intervention results might not be immediate (Holcomb, 2009) . Educators must learn how to effectively use new classroom technology such that Silvernail and Gritter (2004) claimed up to eight years might be required for an identifiable implementation effect.\nDue to state testing and available materials, the current research study could only occur within one academic quarter. During this experiment, 45 weekdays passed, but only 40 days were feasible to complete the study due to snow days, teacher workdays, school assemblies, state testing, and field trips. Students in the experimental group used the iPads daily for the academic quarter. The participating teacher recorded the accuracy with which the lesson plans were followed on the LPAR.\nBased on the LPAR, the experimental group's lesson plans were accurately implemented and all students used the iPads 85% of the study's possible 40 days. On 10% of the study's days in which the majority of the lesson plan was implemented, not all students used the iPads during the mathematics lesson. For 5% of the study's possible days, students did not use the iPad during the mathematics lesson. The LPAR sheds light on the additional days students did not have the opportunity to use the iPad in mathematics class, lowering the total days to 32 days or an intermit-tent 6.5 weeks. Students in the experimental group had concentrated access to the iPads only during mathematics class. Lowther, Ross, and Morrison (2003) found that 1:1 initiative studies in which students were allowed continuous 24 hour-per-day, seven-days-per-week access were more effective than concentrated studies. Students in the current study were not able to take the iPads to other classes, lunch, recess, or home, which may be another cause of the lack of statistically significant findings."}, {"section_title": "Practical Implications and Limitations", "text": "It is necessary to identify the study's limitations before reporting the results because the limitations may greatly affect the overall results. A quasi-experimental, nonequivalent groups design was used with awareness of effects on results and limitations from internal and external validity threats (Cozby, 2009; Johnson & Christensen, 2012; Trochim & Donnelly, 2007) . To strengthen the validity and credibility of the study, the two participating schools were randomly selected as the control group or the experimental group. Identical pretest and posttest assessments were administered several months apart to reduce testing internal validity. The experiment was conducted within two elementary schools in the same town. The selected schools had similar demographics in size, population, race/ethnicity, and socioeconomic status to reduce the history internal validity threat.\nBecause children were the primary participants in the study, the highest ethical standards were upheld to protect their identity. The Northcentral University Institutional Review Board approved the study before any data collection. In addition, the approval of the district's superintendent, district's director of math and technology, school administrators, parents, and students were obtained. Additional ethical precautions were taken because children were the primary participants. First, parents provided written consent to allow their student to participate in the study. Next, written assent was collected from participating students. All student participants were assigned a number to maintain participants' right to anonymity. The researcher was an employee of the participating school district. Although the researcher did not hold an authoritarian position within the district, precautions were taken to ensure all participants were informed that the study was voluntary.\nLimited research exists regarding the potential use of the iPad in the elementary mathematics classroom (Hlodan, 2010) . Data were provided regarding the relationship between student mathematics achievement and iPad use in classrooms. Furthermore, mixed results are evident in the academic literature concerning the impact of mobile learning technology on academic achievement. School administrators and other academic directors can use the results of this study to make informed decisions about purchasing technology and using iPads for mathematics instruction. The current research gap was a limit to understanding of the potential nature of a 21st-century mobile learning tool on students' achievement.\nA variety of limitations may have affected the overall findings of the study. First, the control and experimental groups were found not equivalent at the outset with respect to mathematics achievement based on the pretest results. In small samples like the current study, a statistical adjustment cannot entirely remove the influence of initial differences among the groups on the dependent variable. For example, the control group, which had lower mean pretest scores, might have benefited more from the intervention than the experimental group, who had a higher mean pretest score. The second limitation was the two participating teachers, who may have unintentionally affected the data. With only two groups of students, it was impossible to determine whether the math teacher for the control group was a more effective math teacher leading to the lack of significant findings.\nA final limitation is the fact that the data were not normally distributed based on the results from the histograms. Meeting the normality assumption for an ANOVA is especially important when the sample size for each group is relatively small like in this study. The sample size for each group in the present study was less than 100, which may have been too small to determine a valid interpretation of the results. The kurtosis values and skewness values are measures for the normality assumption for an ANOVA. When using an ANOVA the kurtosis and skewness values should be close to zero. Based on the descriptive statistics in Table 1 , the specific values farthest from zero include the skewness value of -1.47 for the control group pretest, the kurtosis value of -1.25 for the control group pretest, and the experimental group kurtosis value of -1.07. In this study, these kurtosis and skewness values are only relatively close to zero, which indicates the non-normality of the data. These skewness and kurtosis values are potential limitations for the study and may have affected the study's results. The non-normality of the data means the normality assumption for the ANOVA was not met therefore posing a major threat to the valid interpretation of the results of the study. One implication for the small sample size and violation of the normality assumption is the statistical power of the study has been compromised, which may have had an impact on the significance of the results.\nIn this case, student scores were organized within classes and, therefore, were not strictly independent. The assumption of independence of errors defined as the errors associated with observations that are independent, including both observations of within the same group or between groups (Salkind, 2010) . The independence assumption was not met due to the nature of the clustered data and the fact that pretest and posttest scores are related. In the present study, participating students were grouped within their classes as determined by their schools. The grouping of students as a control and experimental group was not strictly independent; thus, a methodological limitation existed, which could have had an impact on the study's findings. Additional limitations include the study's duration, the participant sample size, the available resources, and physical location, all of which may have had influence on the results. The study was completed over a nine-week period; the results may have been altered if the experimental iPad implementation was longer or shorter. A second and similar limitation could occur if the number of participants was greater or less."}, {"section_title": "Conclusion", "text": "The rich data provided by this study's assessment leads to several practical recommendations to assist students, teachers, administrators, and parents. Despite the current economy, mobile learning and 1:1 learning is a goal in many school districts. The verdict on 1:1 devices is mixed. Many researchers suggested the usage of mobile learning devices such as iPads was effective in academic success, but especially had use in teaching mathematics (Alagic, 2003; Berk, 2010; Hamilton, 2007; Hubbard, 2000; Mendicino & Heffernan, 2007; Park, 2008; Rosen & Beck-Hill, 2012) . Many other studies had inconsistent and stagnant results, not to mention millions of dollars in technology maintenance (Holcomb, 2009; Hu, 2007; Rockman, 2004 , Silvernail & Gritter, 2004 Texas Center for Educational Research, 2009 ). Recommendations of longer study duration, incorporating different mathematics applications, using students from various elementary grades, and the addition of qualitative data collection such as satisfaction and confidence as dependent variables are suggested for further research studies on 1:1 mobile learning device interventions may show positive impact. The current study's results do not dismiss the usage of iPads in the classroom, but rather encourages educators, principals, and school officials to further investigate the uses of the device in the classroom."}]