[{"section_title": "Abstract", "text": "BACKGROUND: Prostate cancer (PCa) outcomes are impacted by socioeconomic and biologic factors. Ethnicity plays a role in the former, but little is known about the responsiveness of metastatic PCa to androgen-deprivation therapy (ADT) among races. METHODS: The Surveillance, Epidemiology, and End Results (SEER) registry was used to identify men who were diagnosed with distant, de novo, metastatic PCa from 2004 to 2012. Patterns of presentation, overall survival (OS), and PCa-specific mortality (PCSM) were determined for each race. E3805 clinical trial data also were retrospectively reviewed to assess outcomes of ADT and ADT plus docetaxel by race. RESULTS: Of all PCa diagnoses in SEER, distant, de novo, metastatic disease was diagnosed in 4.2% of nonHispanic whites, 5.8% of Hispanic whites, 5.7% of blacks, 5.5% of Asians/Pacific Islanders, and 8.8% of American Indians/Alaska Natives (P <.001; chi-square test). The median OS differed by race, with superior OS observed among Asian men (30 months) than among men of other races (range, 24-25 months; P <.001). Asians also had a superior median PCSM (54 months) compared with the other races (range, 35-40 months; P <.001). In E3805, chemohormonal therapy was associated with a median OS of 58.1 months (95% confidence interval, 48.8-72.9 months) and 57.6 months (95% confidence interval, 27.7-57.6 months) in non-Hispanic whites and blacks, respectively. Few Asians participated in the E3805 trial. CONCLUSIONS: Asian men have superior median OS and PCSM for distant, de novo, metastatic PCa than men of other race. Non-Hispanic whites and blacks who receive treatment with ADT or chemohormonal therapy have comparable outcomes. Cancer 2017;123:1536-44."}, {"section_title": "INTRODUCTION", "text": "There will be an estimated 180,890 prostate cancer (PCa) diagnoses and 26,120 deaths in the United States in 2016. 1, 2 Lethal PCa is caused by metastatic disease, which may occur by relapse after curative-intent local therapy or as de novo, metastatic PCa. An estimated 4% of metastatic PCa will be de novo at diagnosis, and it is postulated that these men may have worse outcomes compared with those who relapse. [1] [2] [3] [4] It is noteworthy that outcomes in this population have consistently been poor; in 1 study, no improvement in survival was observed among men who presented with de novo disease between 1988 and 2009, and their median overall survival (OS) was 30 months. 3 It is recognized that black men with PCa have worse outcomes compared with men of other races. The age-adjusted number of deaths per 100,000 was 49.8 in black men compared with 20.7 in non-Hispanic white men from 2007 to 2011 5 ; this has been attributed in part to more advanced disease at diagnosis as well socioeconomic factors. However, whether this holds true in men diagnosed with de novo metastatic disease has not been studied extensively, and it is unknown whether a survival difference between races persists. In the metastatic setting, androgen-deprivation therapy (ADT) is standard, and outcomes are more likely driven by biologic factors.\nRegarding death from PCa, a meta-analysis indicated that blacks had a worse OS and cancer-specific survival (CSS) than whites. 6 Although the difference in OS was eliminated when controlling for known confounders, a difference in CSS remained. 6 However, there was no difference in outcome between whites and blacks when the analysis was specifically restricted to men who had de novo metastatic disease. 6 This finding was recently corroborated, with no difference in OS or CSS observed between whites and blacks who presented with de novo PCa in the prostate-specific antigen (PSA) era. 3 It is worth noting that, in that study, Asian men had a significantly better outcome than men of other races. 3 It was also observed in the Southwest Oncology Group studies during the PSA era that black race did not impact outcomes among men with metastatic PCa who received ADT, whereas previous studies reported poorer outcomes for blacks. 7 Outcomes by race for metastatic, castration-resistant PCa have been assessed. 8, 9 Clinical trials suggest that blacks have a shorter time to PSA progression than whites but no difference in OS. 8 A larger study of pooled clinical trial data confirmed no difference in OS between blacks and whites. 9 Recently, the E3805 trial (Chemohormonal Androgen Ablation Randomized Trial [CHAARTED]) demonstrated a 13.6-month improvement in median OS with early chemohormonal therapy (CHT) with ADT plus docetaxel versus ADT alone in men with metastatic, hormone-sensitive PCa. 10 In addition, the men in that study who had high-volume disease (the presence of visceral metastases or 4 bone metastases with 1 beyond the vertebra or pelvis) appeared to derive the greatest benefit. 10 It is unknown whether race predicted response to CHT.\nCurrently, there is a paucity of data regarding patterns of presentation and survival by race among men with de novo metastatic PCa. Moreover, it is unknown whether different races derive the same benefit from CHT for high-volume, metastatic, hormone-sensitive PCa. We hypothesized that survival differences exist between races among men who present with de novo metastatic PCa. Thus, we performed descriptive statistics to detail survival data for patients of different races with distant, de novo, metastatic PCa from a large, population-based patient database. In addition, we explored whether survival differences existed between races in the E3805 clinical trial."}, {"section_title": "MATERIALS AND METHODS", "text": ""}, {"section_title": "Surveillance, Epidemiology, and End Results Registry", "text": "The National Cancer Institute Surveillance, Epidemiology, and End Results (SEER) 18 Survival data for men diagnosed with distant, de novo, metastatic PCa were obtained from SEER. Patients were selected using the following criteria: actively followed, malignant behavior, known age, and included in the research database. Patients who did not have survival data were excluded. OS was observed from the time of diagnosis until death, in months, with a cutoff of December 2012. For PCa-specific mortality (PCSM), a cause of death was defined as dead because of cancer using the SEER cause-specific death classification."}, {"section_title": "E3805 Clinical Trial", "text": "The primary objective of E3805 (CHAARTED; clinicaltrials.gov NCT00309985) was to evaluate whether early CHT in men with metastatic, hormone-sensitive PCa improved OS over ADT alone. This study enrolled patients with metastatic hormone-sensitive PCa who were either treatment-naive or within 120 days of starting ADT for metastatic disease. Patients were randomized to receive either ADT alone or CHT with ADT plus docetaxel dosed at 75 mg per square meter of body-surface area every 3 weeks for 6 cycles. Patients were stratified by several factors, including volume of metastases (high vs low) and age. From July 2006 to December 2012, in total, 790 patients were enrolled and randomized.\nThe total numbers and percentages of men of different races (non-Hispanic white, Hispanic white, black, Asian, and Native American) by disease volume and history of prior local therapy were extracted and descriptively presented. Those without a history of prior local therapy were presumed to have presented with de novo, metastatic disease; whereas those who had received prior local therapy were presumed to have relapsed. The total number of deaths and median OS were calculated for each race in each treatment arm in an intention-to-treat analysis. OS was calculated from the date of randomization until death.\nProportions of non-Hispanic whites were compared pairwise with Hispanic whites, blacks, Asians, and American Indians using the chi-square test. Survival was calculated using the Kaplan-Meier method, and 95% confidence intervals (CI) with the log-rank test were used to assess for differences in survival by race. Univariable analysis of PCSM was conducted using Fine and Gray competing risks regression, with point estimates obtained by fitting a null model (no covariates) to each race. Multivariable analysis using competing risks regression without or with adjustment for patient demographic variables (marital status, county income, county education level, patient age, metropolitan vs nonmetropolitan county) was then performed to test for differences in PCSM between each race compared with non-Hispanic whites. Continuous variables were dichotomized around the median of each covariate, with county type of residence defined according to the US Department of Agriculture Rural-Urban Continuum codes. Analyses were conducted using the SEER*Stat (SEER Program, National Cancer Institute, Bethesda, MD) and Stata MP 14.0 (SEER; Stata Corporation, College Station, Tex) and SAS version 9.4 (E3805; SAS Institute, Inc, Cary, NC) statistical software packages. Statistical significance was defined as a 2-sided P value < .05."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "SEER Registry Data", "text": "From 2004 to 2012, in total, 450,076 men were diagnosed with low-intermediate-risk localized PCa (92%), 8961 were diagnosed with high-risk localized PCa (1.8%); 8104 were diagnosed with locoregional stage IV PCa (1.7%), and 22,322 were diagnosed with distant metastatic PCa (4.6%). By race, the majority of diagnoses were among non-Hispanic whites across all stages, with 316,808 diagnoses of low-intermediate-risk localized PCa (70.4%), 6459 diagnoses of high-risk localized PCa (72.1%), 5692 diagnoses of locoregional stage IV PCa (70.2%), and 14,528 diagnoses of distant metastatic PCa (65.1%). Within each race, a higher proportion of "}, {"section_title": "Original Article", "text": "Hispanic whites and nonwhites were diagnosed with distant metastatic disease (5.7%) than non-Hispanic whites (4.2%) (P < .001) ( Table 1 ). The proportions of men of each race who presented with distant, de novo, metastatic PCa by year of diagnosis are presented in Supporting Table 1 and Supporting Figure 1 (see online supporting information). The proportions of men diagnosed with distant, de novo disease was higher in 2012 than in 2004 among non-Hispanic whites (P < .001), Hispanic whites (P 5 .001), blacks (P 5 .027), and Asians (P 5 .010), but not among American Indians (P 5 .791) or men of unknown race (P 5 .242). Next, survival data for men diagnosed with distant, de novo, metastatic PCa were obtained. Twenty-nine of 22,322 patients were excluded because they lacked survival data. The median OS among 22,293 evaluable men was 25 months, and the 1-year, 3-year, and 5-year OS rates were 71.5%, 36.7%, and 22.4%, respectively. By race, the median OS was 24 months in non-Hispanic whites, 25 months in Hispanic whites, 24 months in blacks, 30 months in Asians, and 23 months in American Indians. Specifically, Hispanic whites and Asians had better 5-year OS than non-Hispanic whites (P < .001), whereas there was no statistical difference in survival between non-Hispanic whites and blacks (P 5 .057) or American Indians (P 5 .398). OS by race is detailed in Table 2 .\nRegarding PCSM, 241 men were excluded from the analysis because they lacked survival data or had an unknown cause of death. In the remaining 22,052 evaluable men with distant, de novo, metastatic PCa, the median time to death from PCa was 40 months. The 1-year, 3-year, and 5-year PCSM rates were 21.1%, 47.8%, and 58.5%, respectively. The median PCSM was 38 months in non-Hispanic whites, 40 months in Hispanic whites, 40 months in blacks, 54 months in Asians, and 35 months in American Indians. Consistent with OS data, Asians had the greatest time to death from PCa among the races (Tables 3 and 4 ). Although Hispanic whites had better PCSM than non-Hispanic whites on univariable analysis (hazard ratio [HR] 0.93; 95% CI, 0.87-1.00; P 5 .045), this difference lost statistical significance in multivariable analysis (Table 4) . Asians, however, retained a near 20% decreased risk of death from PCa compared with nonHispanic whites independent of sociodemographic factors (Table 4) . It is noteworthy that, when year of diagnosis was included in the model, later year of diagnosis was predictive of a reduced risk of PCSM (HR, 0.97; 95% CI, 0.96-0.98; P < .001), and there was no interaction between race and year of diagnosis (P > .3 in all analyses; model not shown)."}, {"section_title": "E3805 Clinical Trial Data", "text": "From 2006 to 2012, in total, 790 men were enrolled in E3805, and race and ethnicity were known in 719 patients. Of these, 201 men had received prior local therapy (28%) compared with 517 who had not received prior therapy and were presumed to have presented with de novo, metastatic disease (72%). Non-Hispanic whites made up the vast majority of participants regardless of stage at diagnosis (82.8%); 174 had previously received local therapy, and 420 presumably had de novo metastatic disease at diagnosis. Similar to the SEER data, proportionally more Hispanic whites and blacks with de novo, metastatic PCa were enrolled than non-Hispanic whites; however, the difference was not statistically significant (P 5 .07). It is worth noting that higher percentages of Hispanic white, black, Asian, and American Indian men had high-volume metastatic disease than non-Hispanic white men (P 5 .004) ( Table 5) . Survival by race for men in the ADT-alone arm and the ADT plus docetaxel arm is illustrated in Figure 1A ,B. The median OS of those randomized to ADT alone was 45.2 months (95% CI, 34.5-49.5 months) for nonHispanic whites (with 62% protocol-defined, high-volume disease), 34.1 months (95% CI, 22.5 months to not available) for blacks (with 72% high-volume disease), and not reached for Hispanic whites, Asians, or American Indians. In the ADT plus docetaxel arm, non-Hispanic Original Article"}, {"section_title": "1540", "text": "Cancer whites and blacks had comparable outcomes, with a median OS of 58.1 months (95% CI, 48.8-72.9 months) among non-Hispanic white men and 57.6 months (95% CI, 27.7-57.6 months) among black men (P 5 .44). Total numbers of evaluable patients and deaths, by race and within each arm, are provided in Table 6 . PCSM data from the E3805 clinical trial, by treatment arm, are provided in Table 7 . The PCSM rate in the ADT-alone arm for the total population was 6%, 39.5%, and 59.7% at 1 year, 3 years, and 5 years, respectively; and the rate in the ADT plus docetaxel arm was 4.1%, 25.1%, and 48.7%, respectively. Small numbers of nonwhite participants and limited numbers of events as of last followup preclude further comparison at this time."}, {"section_title": "DISCUSSION", "text": "The large, population-based database used in this study supports the concept that, in the PSA era, the OS and PCSM rates among black men diagnosed with distant, de novo, metastatic PCa do not differ from those among non-Hispanic white men. Moreover, this was observed despite a greater proportion of blacks having presented with distant metastatic disease. We observed that Asian men had superior survival compared with men of other races when accounting for socioeconomic factors. These data are potentially discordant with those from the E3805 clinical trial, in which blacks experienced a numerically inferior survival with ADT alone compared with nonHispanic whites. However, this may be because of the greater proportion of blacks with high-volume disease and the smaller numbers of blacks, which would preclude a reliable statistical comparison between the 2 races at this time. It is important to note that there was no apparent difference in outcome between non-Hispanic whites and blacks who received CHT, highlighting the generalized benefit of this approach."}, {"section_title": "PCa Presentation", "text": "Patterns of PCa presentation by stage have previously been evaluated. One series reported that equivalent numbers of whites and blacks presented with metastatic disease in an equal-access medical center from 1991 to 1997. We note that those data were collected during the time that PSA screening became widespread. More recently, Ryan et al observed a reduction in the proportion of men presenting with metastatic disease in a large PCa registry. 14 Although black race and lower socioeconomic status were associated with an increased likelihood of metastasis at presentation on univariable analysis, these findings were not confirmed on multivariable analysis, and biologic factors (higher serum PSA and Gleason grade) were the only associated variables. Moreover, the proportions of whites and blacks presenting with metastatic PCa in their series remained consistent over time. 14 The proportions of men diagnosed with distant, de novo, metastatic PCa in SEER are consistent with these prior results, with 4.2% of non-Hispanic whites and 5.7% of blacks presenting with metastatic disease. It is noteworthy that our SEER results do suggest a slight increase in the proportion of men presenting with distant, de novo, metastatic PCa over time-a pattern that predates the 2012 US Preventive Services Task Force recommendation against routine PSA screening. It remains to be determined whether this translates into an increased rate per 100,000 of de novo, metastatic disease in the modern era."}, {"section_title": "13", "text": ""}, {"section_title": "PCa Survival", "text": "Regarding survival, a study examining SEER-Medicare data from men aged >65 years indicated that blacks had a higher risk of death from earlier stage (but not metastatic) PCa than whites. 15 By stage, Muralidhar et al demonstrated that the 5-year PCSM rate was 41.1% for patients who presented with distant disease. 16 We note with interest that those authors observed a greater increase in conditional survival over time among whites compared with nonwhites who had locoregional but not distant metastatic disease. 16 Their study highlights the finding that longterm survivors of metastatic PCa can have a continued reduction in their risk of PCSM with time, potentially because of more biologically indolent disease."}, {"section_title": "PCa and Race", "text": "By race, Tangen et al demonstrated that the median OS in men with metastatic PCa has improved from 30 to 33 months in the pre-PSA era to 49 months in the PSA era based on data from 3 large, randomized, controlled trials. 7 It is noteworthy that their study indicated a dramatic improvement in survival for blacks between the eras (median OS, 27 months pre-PSA vs 48 months after PSA implementation), and survival among blacks was equivalent to that among whites (49 months) in the PSA era. 7 In addition, prospective registry data from an underserved, inner-city hospital indicated a 5-year CSS rate of 65.6% among 129 men with de novo, metastatic disease; and 97.7% of the men in that study were black. 17 Although these data are consistent with those from E3805, they are in disagreement with our findings from SEER, which indicate a median OS of 24 months in non-Hispanic whites and blacks (25 months in the entire population) and a 5-year PCSM rate of 58.5% for the entire population (59.1% non-Hispanic whites, 58.8% blacks). It is possible that the poorer survival observed in the SEER data reflects real-world outcomes as opposed to clinical trial conditions or small hospital registry series. Moreover, our data from SEER reflect only patients diagnosed with distant, de novo, metastatic PCa and not those who experienced a relapse; it is speculated that distant, de novo disease represents a more aggressive variant with worse outcomes, and clinical trials often include a heterogeneous population of patients with metastatic disease at first diagnosis and those that relapsed after receiving therapy for localized disease."}, {"section_title": "PCa in Asians", "text": "Our study revealed that OS was greater and PCSM was superior in Asians compared with OS and PCSM in the other races in the SEER data. An important consideration is whether outcomes among Asian-Americans are similar or different from those among residents of Asia. We note that the 5-year survival rate among Japanese men diagnosed with distant, de novo, metastatic PCa ranges from 39.6% to 61.8%. [18] [19] [20] Furthermore, studies in Chinese and Taiwanese men with metastatic PCa reported 5-year OS rates from 40% to 41.4%. [21] [22] [23] These results are similar to the outcomes reported for Asians in the SEER registry, with a 5-year OS rate of 29.9% and a PCSM rate of 51.6% among Asians in the United States. Differences between study methodology, access to health care, and environmental factors may account for the observed variability between these series.\nThe superior survival of Asians in the SEER results from our study suggests a possible biologic difference between the races with respect to the risk of relapse after therapy for localized disease and responsiveness to therapy given potentially similar environmental exposures in this American population. Indeed, 1 small, retrospective study from Hawaii indicated that Japanese men had improved outcomes after hormone therapy compared with white men at the same institution, and race emerged as a significant prognostic variable on multivariable analysis. 24 A presumption is that differences between races are caused by factors at a genomic level. Indeed, in 1 study that evaluated mutational differences in the androgen receptor (AR) gene between blacks and whites, the investigators observed a higher rate of both germline and somatic mutations in the AR gene among blacks compared with whites and suggested that race may account for differences in disease presentation and natural history. 25 Thus, it is plausible that genomic differences may contribute to the better survival in Asians observed in this study. That said, cultural differences between races can impact environmental exposures, with differences in diet and other lifestyle factors possibly affecting survival."}, {"section_title": "Limitations", "text": "Our work has limitations and should be interpreted in the context of its design. Race classification in SEER is derived from medical records and death certificates, and misclassification bias is a concern. Moreover, numbers for Asians and American Indians were small in both SEER and E3805; therefore, conclusions drawn from outcomes in these populations should be viewed with caution. Similarly, relatively fewer Hispanic whites and blacks were enrolled in E3805, restricting the statistical comparison of survival between the races. Finally, survival data in SEER were calculated from the date of diagnosis until death, whereas those in E3805 were from the time of randomization until death, and it is possible that this may account for some of the difference in outcome observed between the 2 cohorts. However, because the median time from the start of ADT to randomization in E3805 was 1.2 months (with 87% of patients starting ADT before randomization), 10 we estimate that effect of this difference is minimal."}, {"section_title": "Conclusions", "text": "In conclusion, using a population-based registry, we have demonstrated that the survival of black men diagnosed with distant, de novo, metastatic prostate cancer is similar to that of non-Hispanic white men, Asian men lived longer than men of other races, and further work is necessary to elucidate the cause of this phenomenon. These findings remain to be reproduced in the clinical trial setting of E3805, in which, currently, too few events have occurred for blacks who received ADT alone and there are too few Asian participants to make survival comparisons by race for men who received ADT alone. However, it is important to note that CHT did confer a comparable survival advantage to blacks compared with non-Hispanic whites, and no differential effect on survival by race was observed. Therefore, clinicians may have confidence in the potential benefit of CHT for the treatment of black men with metastatic, hormone-sensitive PCa and, after discussing the risks and benefits, may consider offering such treatment to appropriate patients."}, {"section_title": "FUNDING SUPPORT", "text": ""}]