[{"section_title": "", "text": "advertising of juices and noncarbonated beverages decreased 17 percent. These beverage categories represented 26 percent of all expenditures made in 2009 to advertise products to youth. Indeed, an examination of advertising expenditures for 1999 through 2010 (see Figure 1) reveals that advertising of all types of nonalcoholic beverages in broadcast, print, outdoor media, and the internet has been declining since 2005. In particular, we see a substantial decrease in advertising of carbonated soft drinks (CSDs) (regular and low-calorie). However, advertising of fruit and vegetable juices, fruit and iced-tea drinks, and sport and isotonic drinks has generally remained lat or increased slightly. During roughly the same period (2005)(2006)(2007)(2008)(2009)(2010), U.S. consumers' purchases of CSDs and juices declined, a reversal of the trend in CSD consumption patterns seen prior to 2005. Between 1970and 2003, per capita intake of CSDs grew 91 percent and intake of fruit juices rose 52 percent (Economic Research"}, {"section_title": "Figure 1. Real Monthly Advertising Expenditures on Selected Nonalcoholic Beverages, 1999-2010", "text": "Notes: Nominal values de lated with the producer price index for radio and television broadcasting (Bureau of Labor Statistics 2013). Source: Authors' calculations based on Ad$pender (Kantar Media) advertising expenditure data. 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009  Service 2012). Consequently, the percentage of total calories consumed from beverages among U.S. consumers increased from 14.2 percent in 1977 to 21.0 percent in 2002, and a large portion of the increase was attributable to increased consumption of regular CSDs, fruit drinks, and juices (Duffey and Popkin 2007). As shown in Figure 2, average monthly household purchases of CSDs, fruit and vegetable juices, and milk declined between 1999 and 2010 while purchases of bottled water and fruit and iced-tea drinks increased. In addition, purchases of new products-soy, rice, and almond drinks-increased. More recently, the amount of CSD consumed has decreased to levels reported in 1996 (Beverage Digest 2013). While there appears to be a correlation between expenditures on advertising and consumer purchases of nonalcoholic beverages, other variables such as price, income, and demographic characteristics of the population can also affect purchasing behavior. Hence, it is important to include such factors in an analysis of the effects of advertising on demand for nonalcoholic beverages. The handful of studies that have investigated the role of relative prices and  1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009  incomes on demand for nonalcoholic beverages did not address the potential effects of advertising. To our knowledge, only Zheng, Kinnucan, and Kaiser (2010), Zheng and Kaiser (2008), and Kinnucan et al. (2001) have estimated the effect of advertising on demand for nonalcoholic beverages using a demand-system approach that included both price and income effects for the U.S. population. We extend the analysis of those studies by (i) evaluating the effects of advertising for the most recent period, one in which consumption of CSDs and fruit juices decreased, (ii) including a number of beverages that were introduced into the market recently to get a complete picture of crossprice and cross-advertising effects, (iii) accounting for the effect of habit formation in nonalcoholic-beverage purchase patterns, (iv) incorporating demographic variables that have not been previously analyzed, and (v) using an advertising and purchase data set that provides monthly observations so that the data interval more closely represents consumer purchase intervals and may thus generate more precise measures of advertising effects (Clarke 1976). We estimate a linear-approximate almost ideal demand system (AIDS) that includes variables for (i) expenditures for advertising on television, print, radio, outdoor, and internet media outlets; (ii) habit persistence; and (iii) household characteristics through translation. We construct monthly Fisher ideal price indexes, average household budget shares, and advertising expenditure stocks for the U.S. beverage market for 1999 through 2010 and model demand for ten nonalcoholic beverages: plain and lavored milk; dairy drinks; soy, rice, and almond drinks; coffee and tea; fruit and vegetable juices; fruit and iced-tea drinks; regular CSDs; low-calorie CSDs; isotonic and energy drinks; and bottled water. We use the resulting estimated elasticities of demand in conjunction with actual changes in price, advertising expenditure, demographic composition, and total expenditure to decompose observed purchasing patterns in two periods into price, advertising, demographic, and expenditure effects. Our results show that, between 1999 and 2008, changes in the demographic composition of the U.S. population played a much greater role in observed purchase patterns for newer beverage products such as bottled water, isotonic and energy drinks, and soy, rice, and almond drinks while changes in price and advertising expenditure largely explain declines in demand for milk, regular CSDs, and coffee and tea. However, between 2008 and 2010, the general decline in consumption of all nonalcoholic beverages was driven largely by income-led decreases in expenditures."}, {"section_title": "Background and Motivation", "text": "In the literature on nutrition and public health, some studies have examined the effects of exposure to advertising on consumption of nonalcoholic beverages and found evidence that consumers of CSDs are in luenced by advertisements. Koordeman et al. (2010) conducted an experiment involving young women and looked speci ically at the effect of soda advertising on soda consumption. They found that only exposure to commercial advertisements for soda affected soda consumption; young women who viewed ads for bottled water did not consume more soda. Thus, a cue to drink any beverage did not have the same effect on soda consumption as a cue to drink a soda. Using the U.S. Department of Education's Early Childhood Longitudinal Study Kindergarten Cohort (ECLS-K) and media data provided by Nielsen Company, Andreyeva, Kelly, and Harris (2011) estimated the effect of advertising of regular and diet CSDs, fast-food restaurants, and ready-to-eat cereals on consumption of CSDs, consumption of fast food, and body weight. They found strong evidence that advertising of soda and fast food had complementary effects on consumption-exposure to commercials for sodas (fast food) increased consumption not only of soda (fast food) but also, though to a lesser extent, of fast food (soda). They also found that fast-food advertising had a signi icant effect on body weight for overweight and obese (body mass index (BMI) at the 85th percentile) children. However, neither Koordeman et al. (2010) nor Andreyeva, Kelly, and Harris controlled for effects of price on consumption and only looked at a particular population subgroup. Lesser, Zimmerman, and Cohen (2013) studied the effect of the prevalence of billboard soda advertising on obesity by census tract in and around Los Angeles, California, and New Orleans, Louisiana. They found that low-income and predominantly minority census tracts were most likely to have outdoor soda advertising but that census tract characteristics did not affect the percent of total outdoor advertising devoted to food. A 10 percent increase in the number of soda billboards led to a 6 percent increase in the number of sodas consumed and a 5 percent increase in the odds of an individual being obese (having a BMI of 30 or more). In the economics literature, a number of studies have examined the effect of price on consumption and body weight but have not controlled for the effect of advertising on beverage demand. Using Nielsen Homescan data, Smith, Lin, and Lee (2010), Zhen et al. (2011), and Dharmasena and Capps (2012) estimated demand systems for nonalcoholic beverages using various functional forms and time periods. These studies found that demand for CSDs, fruit drinks, and juices is price-elastic-demand for those beverages, calories consumed from such products, and, consequently, consumers' body weight all would be potentially responsive to taxes on caloric beverages. The studies also found that regular and diet CSDs are gross complements within households, which suggests that a tax on regular soft drinks would decrease consumption of both regular and diet CSDs. Two recent studies aggregated the Nielsen Homescan data into monthly time series. Smith, Lin, and Lee (2010) used data for 1998 through 2007 in a static AIDS while Dharmasena and Capps (2012) used data for 1998 through 2003 in a quadratic AIDS. Motivated by evidence that sugar has addictive or habit-forming attributes, Zhen et al. (2011) estimated a demand system using a habit-formation model for pseudo-panels and found evidence of strong intertemporal dependence and habit formation in beverage purchases. To our knowledge, only three studies have estimated the effect of both advertising and price on demand for nonalcoholic beverages. Zheng, Kinnucan, and Kaiser (2010) and Zheng and Kaiser (2008) found a positive effect from advertising on demand for milk, CSDs, and coffee and tea using per capita aggregate time-series data for 1974 through 2005 and a linear approximation of the AIDS. Zheng and Kaiser (2008) also found a signi icant and positive cross-advertising effect from soda advertising on consumption of bottled water and a negative cross-advertising effect from milk on coffee and tea. Using similar data for 1974 through 1994 and the Rotterdam model, Kinnucan et al. (2001) found a positive effect from advertising on demand for juice but a negative effect on demand for CSDs."}, {"section_title": "Advertising in a Conditional Demand System", "text": "We use a linear-approximate AIDS (LA-AIDS) (Deaton and Muellbauer 1980a) to model demand for N nonalcoholic beverages such that the budget share for the ith good is (1) and ln P* is Stone's price index, which is de ined by (2) ln In equations 1 and 2, p j denotes the price of good j and M is the per-household expenditure on beverages. Based on evidence from Zhen et al. (2011) and from the literature on nutrition of the habit-forming nature of sugar, which is a primary ingredient in many nonalcoholic beverages (Avena, Rada, and Hoebel 2008), we incorporate the dynamic effects of consumption by introducing lagged quantities in each share equation. Incorporating lagged quantities also allows us to avoid potential autocorrelation problems that arise from model speci ications that ignore the dynamic effects of past consumption on current consumption (Blanciforti, Green, and King 1986, Deaton and Muellbauer 1980b, Kesavan et al. 1993. 1 In addition to introducing habit persistence into each share equation, we include other factors that could have shifted demand for nonalcoholic beverages. Using translation (Pollak and Wales 1981), we introduce the effects of N advertising expenditures (AS 1 , . . . , AS N ), N lagged quantities (q 1t-1 , . . . , q Nt-1 ), L demographic characteristics (D 1 , . . . , D L ), and K seasonal indicators (S 1 , . . . , S K ) into equations 1 and 2 using augmented share equation intercepts: (3) where the coef icients on the lagged quantities, κ ij , are interpreted as the degree of habit persistence or partial adjustment for demand for a beverage. We chose to incorporate advertising, habit persistence, and the other demand shifters in this manner because it preserves the adding-up conditions, shifts the demand curves in an intuitively appealing way, and does not increase the number of parameters excessively. The following restrictions on the parameters allow the LA-AIDS model with translation to conform to demand theory, including adding up, homogeneity, and symmetry. (4) Adding up: Homogeneity: Symmetry: Factors that In luence Demand for Beverages 37 Okrent and MacEwan For the LA-AIDS given by equations 1-3 and the restrictions in equation 4, the short-run conditional Marshallian elasticities of demand (Alston, Foster, and Green 1994) are 5 where δ ij is Kroneker's delta. Conditional short-run elasticities of demand are static measures that do not take habit formation into account. The longrun values of the elasticities are obtained by setting q it = q it-1 = q i for all i and solving the system de ined by equations 1-3 (Pollak 1970). Following Larivière, Larue, and Chalfant 2000, we calculate the long-run conditional Marshallian expenditure, price, advertising, and demographic elasticities of demand as follows. (9) Long-run Marshallian expenditure elasticity: , The superscript LR denotes long-run elasticities of demand, κ ii represents partial adjustment parameters, and the short-run elasticities of demand with respect to expenditures are represented by η iM for nonalcoholic beverages, η ip j for prices, η iAS j for advertising, and η iD j for demographic characteristics as de ined in equations 5-8. We evaluate logarithmic transformations of the prices, lagged quantities, and the budget shares at the mean of the data."}, {"section_title": "Data", "text": "We estimate price indexes, budget shares, and per-household average quantities for each beverage category using Nielsen Homescan and Nielsen Fresh Foods panels for 1999 through 2010 purchased by the U.S. Department of Agriculture (USDA) Economic Research Service. For Homescan, Nielsen reports price and expenditure data on UPC-coded purchases of 40,000 to 60,000 households per year in the United States. 2 The Fresh Foods panel is a subset of the Homescan data consisting of approximately 8,000 households in which heads of households use a code book to report non-UPC-coded perishable items. Nielsen recruits and continuously maintains its panel using population and demographic targets to balance the raw sample. Nielsen then uses demographic data from each household for calculation of post-strati ication sample weights, which are used to project the sample to be representative of the overall U.S. population. 3 The Nielsen data set covers 52 markets that are similar to the metropolitan statistical areas used in the U.S. Census plus 9 additional areas (Muth, Siegel, and Zhen 2007). We aggregated the data on price, quantity, and budget share into monthly observations. The demographic variables used in our analysis are averages of household-level demographic characteristics for the United States weighted by the Nielsen post-strati ication sample weights. We included variables for average household size, age and level of education of heads of households, and the percent of the population that was married, was white non-Hispanic, and fell below the poverty line. 4 Table 1 reports the mean, minimum, maximum, and standard deviation of household quantities, budget shares, and demographic characteristics based on the Nielsen data. Average household expenditures for a beverage category are calculated as total expenditures each month for a category divided by the total number of households. On average, most nonalcoholic beverage expenditures are on milk (23 percent of the nonalcoholic beverage budget), regular CSDs (18 percent), fruit and iced-tea drinks (14 percent), and low-calorie CSDs and fruit and vegetable juices (13 percent). We constructed price indexes for each beverage category and month. First, we identi ied and deleted outlier prices using the interquartile range for each beverage category, year, and month (about 2 percent of the observations). We also eliminated zero prices that were not associated with coupon usage. We then calculated simple average prices and summed quantities for each brand of beverage purchased within a beverage category by household, year, and month. Using the Nielsen post-strati ication sample weights, we estimated the quantity and average price for each brand purchased in a time period and used those values to estimate chained Fisher ideal price indexes. We constructed advertising expenditures and appended those variables to the price, quantity, and demographic data. Kantar Media produces a database called Ad$pender that contains nominal expenditures on advertising for Continued on following page eighteen media outlets, including print, radio, television, internet, and outdoor advertising, for thousands of products. We aggregated the Ad$pender data to a monthly time series. Expenditures to advertise multiple products that were in different beverage categories or were a combination of beverage and nonbeverage products (e.g., cross promotions and sponsorships) in a period were split evenly between the products in that period. For example, iced tea and orange juice were frequently advertised together. An advertising expenditure for this combination was split evenly between the fruit drink/ iced-tea category and the fruit juice category. The category with the greatest expenditure on advertising was regular CSDs; double the amount was spent to advertise regular CSDs than was spent on the second largest category, fruit and vegetable juice, followed closely by energy and isotonic drinks."}, {"section_title": "Empirical Implementation and Results", "text": "To estimate the LA-AIDS outlined in equations 1-3 subject to the restrictions in equation 4, we augment the model in several ways. First, a number of empirical studies of advertising support the hypothesis that advertising has lagged effects (e.g., Brester and Schroeder 1995). Hence, we constructed variables for stocks of advertising by month using contemporaneous and lagged advertising expenditures. We characterized the relationship between beverage-categoryspeci ic monthly advertising stocks, AS it , as a function of (i) overall lag length, L; (ii) a set of lag weights from a gamma probability density distribution, W l ; (iii) beverage-category-speci ic advertising expenditures, A it ; and (iv) parameters that determine the shape and scale of the gamma distribution, k = 0.5 and ψ = 1: . This particular structure puts the most weight on current advertising expenditures with the weight of the lagged advertising expenditures geometrically decaying as they get farther from the current period. To obtain a real measure, we de lated the advertising-stock variables with the Bureau of Labor Statistics' (2013) producer price index for radio and television broadcasting. Many of the maximum values for the advertising-stock variables occur during the summer, indicating a seasonal element to advertising of nonalcoholic beverages. We thus incorporate monthly dummy variables in the share equations to control for seasonality. December is excluded to avoid perfect collinearity with the intercept. Because budget shares are used to construct the Stone's price index in equation 2, the index may be endogenous. To avoid such endogeneity, we use lagged budget shares instead of current budget shares (Eales and Unnevehr 1988). Finally, we estimate N -1 equations to avoid singularity of the variancecovariance matrix using iterated seemingly unrelated regressions (SUREG in Stata 12 MP). As a result, our parameter estimates are invariant with respect to the equation chosen for deletion (Barten 1969). In our analysis, we drop the equation for bottled water. We recover the parameters for the equation using the adding-up conditions and impose homogeneity and symmetry constraints in the estimation (equation 4). Standard errors on the elasticities of demand are calculated using the delta method (NLCOM in Stata 12 MP). Table 2 shows the results of tests for autocorrelation using a Harvey LaGrange multiplier test (Shehata 2011) for each equation and for the overall system. The p-values on the test statistics indicate that we cannot reject the null hypothesis of no autocorrelation in individual equations or for the system overall. As another check, we corrected for irst-order autocorrelation by assuming that the irst-order autocorrelation coef icient is the same across all equations (ρ) so that both our estimations and the hypothesis tests are invariant with respect to the omitted equation (Berndt and Savin 1975): We estimated equation 15 using feasible, nonlinear generalized least squares (NLSUR in Stata 12 MP). The p-value on ρ indicates that ρ is not statistically different from zero at a 5 percent level, and we conclude that autocorrelation is not a problem in the dynamic LA-AIDS. We considered whether the habit persistence, seasonal adjustment, demographic characteristic, and advertising stock variables could be deleted from the system using Wald tests. The null hypothesis that the habit-persistence parameters are jointly zero is rejected in all of the equations except the ones for milk, isotonic and energy drinks, fruit and vegetable juice, fruit and iced tea drinks, and soy, rice, and almond drinks. However, the joint restrictions for the system are rejected (i.e., κ ij = 0, ∀i, j). We also ind no evidence that advertising affects demand in the isotonic and energy drink and soy, rice, and almond drink equations, but a test of the null hypothesis that the advertising parameters are jointly zero is rejected for the system (i.e., a ij = 0, ∀i,j). The null hypothesis that the monthly seasonal dummies are zero is rejected in all equations and for the overall system (i.e., s ij = 0, ∀i, j = 1, . . . , 11). The demographic characteristics are found to be jointly statistically different from zero in all of the equations except the one for isotonic and energy drinks but the null hypothesis is not rejected for the overall system (i.e., d ij = 0, ∀i, j = household size, age of household head, education of household head, percentage married, percentage below poverty line, percentage white non-Hispanic). The single-equation R-squares range from 0.85 to 0.99, indicating a relatively good it of the model to the data. For brevity, we report only the results for estimations of the long-run conditional elasticities of demand since we use those later in the analysis to decompose growth over the period into price, expenditure, advertising, and demographic effects. All of the own-price elasticities of demand are negative, a result that is consistent with the law of demand, and are statistically signi icant. In terms of price and total expenditures (Table 3), demand for energy and isotonic drinks is the most price-elastic (-2.84), followed by demand for soy, almond, and rice drinks (-2.14) and by bottled water (-1.91). Indeed, most of the beverages are price-elastic with the exception of milk (-0.26), coffee and tea (-0.47), and fruit and vegetable juices (-0.81). In addition, many of the beverages have statistically signi icant, gross complementary and substitution relationships. In particular, coffee and tea is a gross complement to milk and to soy, almond, and rice drinks; regular CSDs are a gross substitute for isotonic and energy drinks, fruit and iced-tea drinks, and bottled water. Bottled water is also a gross substitute for low-calorie CSDs. We did not ind a statistically signi icant relationship between low-calorie CSDs and regular CSDs. Most of the beverages are elastic with respect to group expenditure and are normal goods. Milk is the most inelastic with respect to group expenditure (0.76), followed by dairy drinks (0.78) and fruit and vegetable juices (0.89). Our price elasticities of demand are somewhat more elastic than ones produced by other studies that incorporated price, advertising, and expenditure variables in the analyses Kaiser 2008, Kinnucan et al. 2001). However, our price effects align well with price elasticities in studies that used Nielsen Homescan data. Zhen et al. (2011), which estimated demand for ten beverages, found that demand for all of the products was price-elastic except demand for sport and energy drinks for low-income households and demand for low-fat milk for high-income households. Dharmasena and Capps (2012) found that demand for low-fat milk, fruit drinks, and bottled water was priceinelastic, demand for high-fat milk and tea was close to unitary-elastic, and demand for isotonics, regular and diet CSDs, fruit juices, and coffee was priceelastic. Table 4 presents elasticities of demand with respect to advertising stocks. While many of the own-advertising elasticities of demand are statistically signi icant, they are much smaller in magnitude than the price elasticities of demand. We ind statistically signi icant positive own-advertising effects for milk (0.01), coffee and tea (0.02), fruit and iced-tea drinks (0.01), regular CSDs (0.02), and bottled water (0.05). Advertising seems to have a positive effect on isotonic and energy drinks, dairy drinks, and low-calorie CSDs, but the effects are not statistically different from zero. Interestingly, advertising appears to have a negative and statistically insigni icant effect on soy, rice, and almond drinks. Negative own-advertising elasticities, although counterintuitive, are prevalent in the economics literature (e.g., Zheng and Kaiser 2008, Green, Carman, and McManus 1991, Kinnucan et al. 2001, Duffy 2003, Rickertsen, Chalfant, and Steen 1995, Piggott et al. 1996. Baye, Jansen, and Lee (1992) found that four of the six own-advertising effects in their study were negative and argued that individual irms ind it in their own interest to advertise even though, in the aggregate, such advertising does not positively affect demand for the commodity. In addition, Forker and Ward (1993) argued that there may be a minimal response to advertising over some range of low advertising expenditures. That may be the case for energy and isotonic and soy, almond, and rice drinks, which received limited advertising during the sample period and are imprecisely measured. In addition to own-advertising effects, we found several spillover effects from advertising. Many of the statistically signi icant cross-advertising effects are negative, which indicates that an increase in advertising expenditure for a beverage would decrease demand for other beverages. For example, demand for milk is negatively affected by advertising of soy, rice, and almond drinks-a 1 percent increase in advertising expenditure on those drinks decreases demand for milk by 0.01 percent. Demand for bottled water is negatively affected by advertising of milk, coffee and tea, and CSDs. The negative cross-over effects are intuitive; if advertising is effective at increasing demand for a beverage, households will replace other beverages that are not being advertised rather than expand the budget for beverages. We ind statistically signi icant evidence of positive spillover effects for demand for (i) coffee and tea beverages with respect to advertising of milk and low-calorie CSDs, (ii) fruit and vegetable juice with respect to advertising of bottled water, (iii) fruit and iced-tea drinks with respect to advertising of soy, rice, and almond drinks and fruit and vegetable juice, (iv) regular and lowcalorie CSDs with respect to advertising of isotonic and energy drinks, and (v) low-calorie CSDs with respect to advertising of regular CSDs. One explanation for the spillover between CSDs and isotonic and energy drinks and between regular CSDs and low-calorie CSDs may be that many of the energy, isotonic, regular CSD, and low-calorie CSD brands belong to soft drink companies; advertising for a brand may increase demand for all beverages of that brand (Zheng and Kaiser 2008). Our own-advertising estimates are relatively consistent with the results of previous studies in terms of magnitude although our cross-advertising relationships are somewhat different. Zheng and Kaiser (2008) found a positive, statistically signi icant own-advertising effect on demand for milk (0.02), CSDs (0.06), and coffee and tea (0.14). We did not ind such a large effect for coffee and tea or for CSDs (the elasticities in our estimates were 0.02 for both beverage categories). Our estimates of demand for beverages with respect to demographic variables (see Table 5), which are measured somewhat imprecisely, are largely statistically insigni icant, primarily because there is little variation in the demographic variables over the sample period. The magnitudes of the elasticities for the demographic variables that are statistically signi icant are much larger than the elasticities of demand found for price, expenditure, and advertising. For example, a 1 percent increase in average household size, education of heads of households, and married population increases demand for regular CSDs 1-8 percent whereas a 1 percent increase in the poverty rate and average age of heads of households decreases demand for CSDs 0.5-3.0 percent. Conversely, age of the heads of households and poverty positively affect demand for bottled water, and education and the percentage of the population that is married negatively affect demand for bottled water. Not unexpectedly, the age of household heads negatively affects demand for milk and dairy drinks, a result similar to that of Zheng and Kaiser (2008), who found that the presence of children in a household increases demand for milk. Even though the magnitudes of the advertising elasticities of demand are smaller than those for price, expenditure, and demographic characteristics, it does not necessarily follow that most of the changes in demand for nonalcoholic beverages between 1999 and 2010 are attributable only to prices and expenditures. We decompose the growth in demand for nonalcoholic beverages for two periods-the years prior to the 2008 recession and the years during and after the recession-into price, expenditure, demographic, and advertising effects using the following reduced-form model of demand, Q n : . η np k and η nM are price and expenditure elasticities of demand, and η nAS k and η nD k are elasticities of demand with respect to advertising and demographics. We convert the proportional changes in Q, p, M, AS, and D into percentage changes. We report the results of decomposition of the growth in Q n for all n = 1, . . . , 10 into net price, advertising, and expenditure effects (in percentages) in Table 6. The net price (advertising) effect is the sum of the own-and cross-price (advertising) effects on demand for each product. Notes: Elasticities are evaluated at the mean of the data. Standard errors are shown in parentheses. ***, **, and * denote signi icance at a 1 percent, 5 percent, and 10 percent level respectively. During the pre-recessionary period (1999 to 2007), purchases of milk, coffee and tea, fruit and vegetable juice, regular CSDs, and isotonic and energy drinks decreased 8-35 percent. For milk and for coffee and tea, the decline in demand was largely driven by net price and net advertising effects; changes in price (advertising) led to a 27 percent (6 percent) decline in purchases of milk and a 20 percent (24 percent) decline in purchases of coffee and tea. The decrease in purchases of regular CSDs was largely driven by net price and net demographic effects. The net advertising effect actually abated the decline by 2 percent. Conversely, demand increased over the period for soy, rice, and almond drinks (457 percent), dairy drinks (37 percent), and bottled water (140 percent), fueled primarily by changes in expenditures and demographic characteristics. Unlike the negative net effect of advertising on demand for dairy and soy, rice, and almond drinks, advertising increased demand for bottled water by 40 percent, a result that reinforces the positive effect of expenditures and demographics on demand for bottled water. Overall, net demographic effects had the most in luence on demand for newer beverage products (bottled water, isotonic and energy drinks, and soy, rice, and almond drinks) while prices and advertising most in luenced demand for milk, regular CSDs, and coffee and tea. We ind that income-led changes in expenditures on nonalcoholic beverages during and after the recession had a larger effect on demand than changes in prices for many of the beverages. Beverage expenditures declined 8 percent between 2008 and 2010, which led to decreases in demand of 5-13 percent. Actual household purchases for all but two beverage categories fell 2-16 percent; the exceptions were soy, rice, and almond drinks and fruit and icedtea drinks, which showed an increase in demand of around 16 percent and 4 percent respectively. For milk, dairy, fruit and vegetable juice, fruit and icedtea drinks, regular CSDs, and bottled water, the net price effects actually led to positive growth in demand. Also, changes in advertising expenditures during and after the recession increased demand for fruit and vegetable juices, fruit and iced-tea drinks, coffee and tea, regular CSDs, and isotonic and energy drinks, abating declining demand for these goods. As in the pre-recessionary period, changes in the demographic composition of the population primarily fueled growth in purchases of soy, rice, and almond drinks."}, {"section_title": "Conclusion", "text": "Our results for 1999 through 2010 provide additional support for prior studies in the literature on public health and nutrition as we ind some evidence that advertising affects demand for nonalcoholic beverages. In particular, we ind that net changes in advertising expenditures prior to the 2008 recession reinforced the negative effect of price on demand for milk and coffee and tea but also reinforced the positive effect of price on demand for bottled water. In addition, net changes in advertising expenditures led by net changes in prices (expenditure) slowed declines (increases) in purchases of regular (low-calorie) CSDs. Lastly, the changes in demand for products that were relatively new to the market (isotonic and sport drinks; soy, rice, and almond drinks; and bottled water) were largely driven by changes in demographic characteristics. We ind that advertising and prices played much smaller roles during and after the recession and that demand for beverages between 2008 and 2010 can be explained primarily by income-led declines in expenditures on nonalcoholic beverages overall. The magnitudes of our estimated advertising elasticities of demand are generally consistent with estimates from other studies that used conditional demand systems for beverages to measure the effect of advertising Kaiser 2008, Kinnucan et al. 2001). In addition, while we used higherfrequency data to construct a data interval that was more in line with the purchase interval (potentially allowing for more precise measures of advertising effects (Clarke 1976)), there were no marked differences between our advertising elasticities of demand and those in the literature. The magnitudes of the price and expenditure elasticities in our estimates differed somewhat from those of prior studies and may re lect differences in the data sets. Our data covered the most recent time period, provided a greater frequency of observation (monthly versus annual), and included recently introduced beverages and a greater degree of disaggregation. Still, our estimates are quite comparable to price and expenditure elasticities of demand reported in the literature from studies that used similar data but did not include advertising. A weakness of this analysis is that it does not include advertising in nontraditional outlets that may affect demand for nonalcoholic beverages. Our data did not include expenditures on product placement, movie and video promotions, athletic sponsorships, or celebrity fees. For example, the FTC (2012) reported that total youth-targeted expenditures on nontraditional forms of advertising, including food-company-sponsored websites, advertising on third-party children's websites, marketing via mobile devices, and social media, increased $45.9 million between 2006 and 2009, a rise of 50.7 percent when adjusted for in lation. These new media outlets comprised 6.9 percent of all advertising expenditures and totaled $122.5 million in 2009. While the FTC (2012) noted a 25 percent decline in traditional marketing of CSDs to children and teens since the inception of the Children's Food and Beverage Advertising Initiative, the self-regulatory program in which member companies pledged to promote healthier dietary choices in the advertising they directed at young people, our estimates suggest that the documented reduction in marketing generates a decline of less than 1 percent in purchases of CSDs (0.5% = 0.02  25%) when we hold all other beverage advertising expenditures constant. When coupled with advertising dollars being increasingly directed to nontraditional marketing outlets, such self-regulatory programs have likely had little effect on demand among children and teens for nonalcoholic beverages."}]