[{"section_title": "Introduction", "text": "Middle years' teachers in primary schools are increasingly required to teach the full range of learning areas at a depth requiring considerable subject-specific content and pedagogical knowledge (Appleton, 2003; Green, 1988; Shaddock & Freebody, 2005; Unsworth, 1999) . Science teaching, in the latter years of primary schooling, is particularly demanding for non-specialist teachers (Appleton, 2003; Childs & McNicholl, 2007; Harlen & Holroyd, 1997; Tytler, 2009) . The wellbeing of teachers required to teach science in the primary years is of concern, as there are frequent reports of feelings of inadequacy and incompetence in relation to being 'science literate' and 'good' science teachers, and in providing sufficient and valuable science learning opportunities for their learners (Appleton, 2003; Gencer & Cakiroglu, 2007; Riggs & Enochs, 1990; Southerland, Sowell, & Enderle, 2011; Tosun, 2000) . Studies have repeatedly revealed low levels of primary school teacher self-efficacy beliefs (self-confidence in their capacity to perform to the required standard) about themselves as teachers of science, and these studies are frequently related to low percentages of time dedicated to science teaching (Appleton, 2003; Gencer & Cakiroglu, 2007; Hackling, Peers, & Prain, 2007; Riggs & Enochs, 1990; Tosun, 2000) . Government and education jurisdiction responses to low levels of science teaching usually focus on how to increase teachers' subject content knowledge, or on providing 'ready-made' curriculum for teaching, sometimes supported by professional learning programs for teachers (Appleton, 2003; Hackling, et al., 2007) . The 'Primary Connections' program, a federal government and Australian Academy of Science initiative for teachers in Australian primary schools is an example of this kind of response. The 'problem' of the status and quality of primary school science teaching is rarely viewed from a teacher wellbeing perspective, through considering ways, for example, to help teachers feel better about themselves as teachers and, especially, as teachers of science, so that more science teaching time occurs, and better science learning outcomes are achieved by students.\nThe recent introduction of a new Australian Curriculum, with its requirements for consistent national achievement standards, has brought increased pressures for middle years' teachers in the primary school, particularly in South Australia (and Western Australia and, currently, Queensland) , where Year 7 remains in the primary sector and science is generally taught by non-specialist teachers. Schools and teachers are expressing concern at the demands on them to deliver a consistent and appropriate science program. This paper describes one primary school's response to these increasing demands. A suite of projects addressing science literacy, content and pedagogical demands was undertaken as part of an Australian Research Council project: New literacy demands in the middle years: learning from design experiments. This is an Australian Research Council (ARC) Linkage Project (No. LP0990692) between the Queensland University of Technology and the University of South Australia, The University of Sydney, The Department of Education and Children's Services (DECS)(SA) and the Australian Education Union (AEU) SA Branch. Chief investigators are Barbara Comber, Peter Freebody and Helen Nixon. Partner investigator is Victoria Carrington (the University of East Anglia, UK). Research Fellow is Anne-Marie Morgan (University of South Australia).\nIt is investigating new literacy demands in the middle years of schooling and teachers' wellbeing in relation to these demands. One of the projects aimed to address teachers' feelings of wellbeing in relation to themselves as science teachers, with the intention of then identifying ways to improve teacher wellbeing and confidence for these teachers. A simple survey instrument, informed by the particular school context and the literature on teachers' beliefs of self-efficacy as science teachers, was developed by the Assistant Principal in collaboration with members of the university research team working with the teachers. Teachers in the school and the local hub group were surveyed using the instrument. The results of the survey and the other projects were considered in light of providing targeted professional learning to enhance teachers' feelings of competence as science teachers and to improve or maintain their feelings of wellbeing. Strategies to share their understandings and challenges with online and actual communities of teachers were subsequently developed. The results of this study have implications for both pre-service and in-service teachers faced with similar demands and challenges to their professional and personal wellbeing in the context of the introduction of the new curriculum. Strategies to prepare teachers to cope with these demands can be developed through use of the survey tool and consideration of concerns highlighted by teachers in this study.\nTo contextualise the discussion of the project, and to provide insights into the environment in which the teachers and school are operating, the paper begins with some background to Australian students' science performance as shown in standardised testing and a brief discussion of the literature on primary school science teacher preparation, self-efficacy beliefs and wellbeing. This discussion is followed by an exploration of the project conducted at the school, including a description of the survey process and results of the survey, and the subsequent strategies and actions developed by the school to enhance science teacher wellbeing. Finally, a brief discussion considers how these ideas might be transferred to both teacher education and in-service teaching contexts, to enhance teacher wellbeing in relation to science teaching in the primary school, aimed at ensuring sustainable futures for schools."}, {"section_title": "Contextual issues Science literacy", "text": "Science 'literacy', as used in educational policy documents, generally refers to the philosophical orientation to understand science, or the 'abilities and habits-of-mind required to construct understandings of science, to apply these big ideas to realistic problems and issues involving science, technology, society and the environment, and to inform and persuade other people to take action based on these science ideas' (Yore, Bisanz, & Hand, 2003, p. 690) . The Organisation of Economic Cooperation and Development (OECD) (O. f. e. c. a. d. (OECD), 2003, p. 60) defines 'scientific literacy' similarly, as 'the capacity to use scientific knowledge, to identify questions (investigate) and to draw evidence-based conclusions in order to understand and help make decisions about the natural world and the changes made to it through human activity'. Educators working to identify and address the literacy requirements of specific subjects or 'disciplines', however, identify 'science literacies' differently, attending instead to the kinds of genres, modes and forms used in scientific writing, and how learners can work effectively in and with these literacies to create scientific texts, and how teachers can effectively teach these skills to learners (Alvermann, 2002; Korner, McInnes, & Rose, 2007; Shanahan, Shanahan, & Misischa, 2011; Yore, et al., 2003; Young, 2005) . Both these views of 'science literacy' (that of the general disposition towards science understandings and the more specific view of understanding scientific literary forms) are important in considering the teaching and learning of science, and the wellbeing of teachers required to teach science, as they place emphases on different requirements and perceptions about the capacity and performance of students and teachers, and impact on judgement about teachers' work."}, {"section_title": "Australian Students' Science Performance in Empirical Testing", "text": "Despite claims for poor standards of science 'literacy' and science understanding of Australian students by governments and especially popular media (Appleton, 2003; Hackling, et al., 2007) , Australian students perform consistently well on well-regarded international measures of student performance including the Organisation of Economic Cooperation and Development (OECD)'s Program for International Student Assessment (PISA) science tests and the Trends in International Mathematics and Science Study (TIMSS) (\"TIMSS 2007 (\"TIMSS results,\" 2011 . While it is not being argued here that empirical, generic testing regimens are the sole or even most important measure of learning and learner achievements and satisfaction, it is worth reviewing recent results of these international testing programs, and comparing them to data collected within Australia by the Ministerial Council for Education, Employment, Training and Youth Affairs (MCEETYA) on levels of proficiency in science for middle years learners (Ministerial Council on Education, 2005) . Reviewing these results makes it possible to consider Australia's relative position and to initiate pause for shifting thought about the popular, alarmist impression of poor outcomes and science illiteracy in Australian youth, to considering ways in which teachers might feel better about themselves as science teachers, so as to create more positive environment for science learning in Australian primary schools.\nIn 2009, Australia (with a score of 527), ranked 10 th (of 65 'nations') in the PISA science testing national rankings, behind Shanghai (575), Finland (554), Hong Kong (549), Singapore (542), Japan (539), Korea (538), New Zealand (532), Canada (529) and Estonia (528); ahead of the Netherlands (522), Taipei (520), Germany (520) and Lichtenstein (520); with the United Kingdom (514), the United States (502), Norway (500), Denmark (499), and France (498) further down the list, which concluded with Kyrgystan (330) (O. o. E. C. a. D. (OECD), 2010) . From these rankings, in international terms, and in relation to nations with similar socioeconomic and cultural contexts, Australia can be seen to be performing well. When one also considers that the whole of 'China' as a nation is not considered in the data, whereas the whole of Australia is, it is apparent that these results can only be considered as a guide to performance, and that Australia is not in the dire condition the media sometimes makes it out to be.\nThe result is similar with the TIMSS tests. Australia (with a score of 515) ranked 13 th (of 49 nations) in the 2007 tests for Year 8 compared to top performing nation Singapore (567), and lowest performing nation Ghana (303) (\"TIMSS 2007 (\"TIMSS results,\" 2011 . Although this ranking was a decline from previous placings, as Australia moved out of the top 10 nations for the first time since the tests began in 1995, it is nonetheless considered a relatively high ranking, and certainly not indicative of wholesale science illiteracy in Australia; indicating instead, perhaps, the rise of education levels in booming Asian states, many of which focus on achievement in such tests as primary measures of learning success (Thomson, Wernert, Underwood, & Nicholas, 2007) . So why, with this relatively high level of performance, do negative perceptions about both students' performance and teachers' abilities to teach science persist, and what does this mean for teachers' feelings about capacity, competence, wellbeing and, ultimately, sustainability of the teaching workforce? Partially this question can be answered by comparing these international test results with those collected by MCCEETYA and ACARA, in Australia. In its 2003 national assessment of scientific literacy, MCEETYA reported that 59% of students attained or exceeded the designated 'proficiency standard' for Year 6 (Ministerial Council on Education, 2005). In 2006 and 2009, with revised standards, the results were 54% and 52%, with the difference between these two years not considered statistically significant, and the proficiency achievement therefore reported as 'unchanged' over this time (Australian Curriculum, 2010) . Hackling, Peers and Prain (2007) described the original test's outcome as a 'concerning' result, along with the fact that other nations (some of Australia's principal trading partners) were improving rankings in PISA and TIMSS testing. Perhaps more significant is that media discussion of these results spread alarm through the community, as this percentage of proficiency was reported as being woefully low (Hackling, et al., 2007) . Year 4 Science teacher knowledge, attitudes and self-efficacy beliefs While education departments, governments and the media can be seen to be responsible in part for disseminating a view that Australian students are performing poorly in science, teachers themselves (no doubt responding to these messages) contribute to the public perception about science teacher (in)effectiveness, and perpetuate feelings of inadequacy privately and collectively. Primary school teachers frequently report feelings of uncertainty and ill-ease about themselves as teachers of science (e.g. Appleton, 2003; Palmer, 2006) . A significant literature, including government reports, has repeatedly confirmed the widespread existence of these negative feelings, in Australia and elsewhere (see Appleton 2003 , for example, for elaboration of these studies and reports). These indications of low level 'selfefficacy' beliefs are confirmed, interestingly, by questions in TIMSS. As part of its data gathering about maths and science teaching, the TIMSS test asks teachers about their preparedness to teach science. In the 2007 test, only 46% of Australian teachers at Year 4 level described themselves as 'very well prepared' to teach the science topics for TIMMS, compared to an average of 54% across all participating nations. For Year 8, however (where science is usually taught by specialist science teachers) 73% of Australian science teachers felt 'very well prepared', compared to the average 71% across all nations (Thomson, et al., 2007) . The gap for primary teachers between Australia and other nations in primary teacher preparedness, and also the overall value, with fewer than half of Australian primary teachers feeling prepared to teach these science topics, is of concern. The concern lies not only with overall results (which are not indicative of poor teaching), but with teachers' confidence and wellbeing in relation to this issue, and also with how teachers' concerns translate into time dedicated to science teaching. Appleton (2002 Appleton ( , 2003 argued that the negative self-perception of primary school science teachers was due to their lack of science knowledge and science education (from their own schooling and life experience), as well as the lack of dedicated science education teaching training and science pedagogical content knowledge training, such that primary school teachers have had little opportunity to see themselves as teachers of science, and less opportunity to develop confidence in their ability to teach science. Southerland, Sowell and Enderle (2011) describe science teachers' 'pedagogical discontentment'-the degree to which their teaching practice doesn't match their teaching goals-identifying teachers' perceived science content knowledge as one of the most significant factors for discontent, with marked psychological effect on their willingness to engage with science teaching. Tosun (2000) noted that teachers' attitudes and beliefs were important aspects in considering why teachers felt unprepared to teach science, and that these affective responses needed attention in addition to providing more content knowledge to primary school teachers of science. Harlen and Holroyd (1997) also have argued that teacher confidence has a significant impact on what is taught in science and needs addressing aside from the issue of content knowledge. Childs and McNicholl (2007) argue that the workplace (schools) must play a role in assisting teachers to teach outside their area of specialty or comfort, including science teaching. Draper and Adair (2010) and Shanahan, Shanahan and Misischa (2011) (and others) argue for a focus on discipline literacy needs to aid teacher self-confidence in teaching science. Not surprisingly, where there are low levels of self-efficacy beliefs about the teaching of science, there are low levels of time dedicated to science teaching in primary schools. A number of studies have shown this effect, with some indicating that science receives very low levels of attention in Australian primary schools, averaging just 2.7% of teaching time (Angus et al 2004; Hackling, Peers & Prain 2007) . Concern for both these issues-poor teacher self-efficacy and sufficient 'time on task' for science learning in primary classroomsand their relationship, have prompted Australian governments to consider ways to improve teachers' content knowledge and to develop programs for use in primary schools that teachers will feel more comfortable with teaching, and hence increase the proportion of curriculum time dedicated to science teaching and learning (Energising Science and Mathematics Education in Victoria, 2009; Hackling, et al., 2007) . Little attention, however, has been dedicated to considering the issue from a wellbeing perspective, uncovering reasons why teachers avoid science, how this affects them, and what they might do about addressing the low level of teaching time in a way that will improve teacher self-confidence and satisfaction with spin-off benefits in science teaching time.\nA number of studies have set out to measure and describe science teacher beliefs and feelings about self-efficacy which can inform a discussion on wellbeing. Riggs and Enochs (1990) "}, {"section_title": "developed a 25 item instrument (the Science teaching efficacy belief instrument", "text": "[STEBI] scale) to identify the beliefs of primary (elementary) school teachers of science, to add to the literature on attitudes and behaviours in relation to teaching science. Their scale incorporated two sub-scales: the personal science teaching efficacy belief scale and the science teaching outcome expectancy scale, and included statements about science teaching which respondents rated using a five-point likert scale. Items included statements such as 'I am continually finding better ways to teach science', 'Even when I try hard I don't teach science as well as I do most subjects', 'I understand science concepts well enough to be effective in teaching elementary science', and 'I find it difficult to explain to students why science experiments work' (Riggs & Enochs, 1990) . These authors believed their scale would provide a valuable tool in assisting in-service teachers to clarify their beliefs and to develop ways to alter behaviours to improve their science teaching commitment and behaviour; and for pre-service teachers to identify learning needs and goals through belief self-analysis.\nThe value of exploring and improving self-efficacy beliefs in science teachers has been explored in further research, with findings that indicate that increasing science content alone in pre-service courses does little to improve self-efficacy beliefs, but that focus on how to teach science, and ways to teach the specific subject content, including addressing literacy demands of science, providing what Appleton (2003) describes as 'pedagogical content knowledge' has had more success (Palmer, 2006) . Palmer (2006) , concerned with the 'durability' of improvements in self-efficacy, studied a group of pre-service teachers and their self-efficacy beliefs before and immediately after a science methods course, and then again nine months later. He found that increased self-efficacy beliefs after the course were maintained after the delay in the follow-up testing, concluding that students benefitted from engaging with self-efficacy testing as well as a dedicated pedagogical content science methods course, and that improved self-efficacy for teachers as a result of these processes had a good likelihood of translating into confidence in teaching science and hence improved teacher wellbeing and sustaining the teaching workforce.\nThese contextual issues-Australian students' science performance and consideration of wellbeing issues for primary school teachers of science informed the thinking behind and preparation of the project discussed here. The teacher-researcher was cognisant of these issues, and was deeply concerned about primary school teacher wellbeing and primary teachers' capacity and confidence to teach science. Her project is described below."}, {"section_title": "The Project: \"Me as a Science Teacher\": An Inquiry Project into Primary School Science Teacher Wellbeing The School", "text": "The school is located in a high socioeconomic status area of an Australian capital city, in an inner suburb. It has around 250 students and 20 full time teachers. My School (ACARA, no date) results are well above average, and compare well with similar schools that include several nearby primary schools and some well-regarded independent schools. There is a high level of parental involvement in (and expectation of) the school, and a culture of teacher research and support for teachers to engage in innovative change practices. Teachers in the school work with other teachers in the local area as a hub group for sharing professional practice ideas and professional learning opportunities.\nThe survey described below was developed by the Assistant Principal and the author of this paper, in a research project context in which the project research team offered support to in-school teacher-researchers. The survey was administered by the Assistant Principal, who was also a part-time classroom teacher for a middle years' class (Years 5-6) at the time of conducting the survey. Two other teachers at the school were also involved in the project. Both of these teachers focused on improvement of literacy skills in science teaching, one on the technical language of science, and one on writing genres of science. The teachers worked together in planning and implementing their projects, collectively aimed at improving science literacy understanding and teaching and learning and improving teacher wellbeing in relation to science teaching and learning in the school."}, {"section_title": "Research Focus Background", "text": "Teachers at the school had previously been involved in a range of teacher research projects, some with the same group of university researchers working on this project (e.g. see Milward, Bormann, & Gibbs, 2007) . Teachers at the school recently participated in a study (Buxton, 2010) which reported baseline attitudes of students and teachers on primary mathematics and science teaching and learning in the school and in the region. The survey showed that students infrequently watched or designed experiments in science lessons, but conducted experiments in most science lessons, in Years 3-5, but not in Years 6-7. Biology was taught more than other areas of science. Student satisfaction in participation in science lessons was good, but 69% of students agreed either a little or a lot with the statement 'I would like to do more science in school', and 27% agreed a little or a lot with the statement 'science is boring'. 84% of students agreed a little or a lot with the statement 'I think science is important in most people's lives'. These data, used to inform the development of the science teacher wellbeing survey reported here and the other science literacy projects, suggested that students were keen to do more science, and that teachers needed support or improved confidence to introduce the full range of science topics to students, more time on science, and, in the middle years (notably Years 6 and 7), to include more experimentation in classes."}, {"section_title": "Project Aims and Focus Questions", "text": "Stated aims of the suite of projects were:\n• To improve science literacies for middle years students; and • To confirm that: teachers' pedagogical practice, as well as the wellbeing of teachers and students, is critical to achievement of science literacies for students in the middle years.\nQuestions the group developed to explore were: • What are the literacy demands facing students in science?;\n• What are the factors that lead to success and failure in meeting these demands?;\n• Does mentoring and/or being part of a professional learning community improve teacher wellbeing and can it be measured? If so. Why? How?; and • Are changes we make sustainable? Though the group of teacher researchers considered their guiding questions as a set, the last two were the particular focus of the project described here, addressing teacher wellbeing and developing sustainable practices for science teaching. The teacher researcher focusing on this area developed the following research question:\n• How is middle years' students' achievement in science literacy improved when teachers feel supported by an active and generous learning community? Her aim in addressing this question was to focus on teachers' feelings of wellbeing and efficacy, and their perceptions of student achievement in science. She believed that the most important element in assisting with wellbeing would be establishing and maintaining a 'generous learning community'. Support mechanisms might include the existing science focus group for middle years' teachers in the school, participation in the local schools' science hub group, using resources and personnel from the education department to assist in professional learning and guiding introduction of the new curriculum, continued work with university researchers for mentoring and research project co-development, and greater use of the Primary Connections program, the science curriculum developed by the Australian Academy of Science and being promoted throughout schools in the state. She was keen to explore the benefits of participation in a chat site for middle years' science teachers, as a forum to share ideas and gain confidence through discussing science content and pedagogies, and through developing a shared knowledge base within a community of teachers as learners. Her longer term goals were to determine which supports work best for primary school teachers of science and to gauge the benefits of continuing to work with a community of learners."}, {"section_title": "Data Sources", "text": "Setting out to see the 'familiar' with 'new eyes', as she described it, and from a range of perspectives, the teacher decided to work with the following data sources as the first step in pursuing her longer term goals relating to evaluation of a learning community:\n• a survey of teacher wellbeing and competence in relation to science teaching;\n• the school's documents and archives, such as the previous research and reports described above; and • post-project interviews with the teachers involved."}, {"section_title": "The survey", "text": "The four middle years' teachers in the school and a further four in the local hub group were surveyed. Though the sample size was very small, it represented the target population of the study, as the survey was focused on collecting data of and for the community of interest (Denscombe, 2007) . It is therefore highly relevant for this setting, to provide a picture of the wellbeing and conditions for science teaching in this school and its local district, as an example of targeted small scale research (Denscombe, 2007) . The teacher researcher described the aim of the survey in relation to wider project aims in the following way, stating:\nSurrounding these experiments is a wider consideration of the wellbeing and satisfaction levels of teachers, [elicited] The survey was composed of two sections: 'Me as a science teacher' and 'Personal satisfaction' (see Appendix 1 for the full survey tool). As can be seen by the delineation of the two parts, she aimed to use the tool to focus firstly on teachers' perceptions of themselves as science teachers, and secondly on their level of satisfaction as teachers working in the 'science' classroom. She intended that the data she collected would provide her with information about:\n• Integrated curriculum perspectives and opinions;\n• The various arrangements for science provision in primary and middle schools;\n• Professional Development opportunities offered across sites;\n• The use of ICTs in teaching science; and • The literacy demands of science.\nThe following section discusses the results of the survey, in relation to these aims and intended outcomes, and how the teacher researcher interpreted these results. Her interpretation of results, and discussion of what she found, were provided to the author of this paper in interviews conducted throughout and following the project, and from a conference presentation of her findings to South Australian middle years' teachers."}, {"section_title": "What was found and how was the information interpreted? Part A: Me as a science teacher", "text": "The teachers surveyed were asked to rate their feelings about themselves as science teachers across a range of dimensions, using a five point scale (1= low to 5=high) for each dimension. Mean scores for each dimension showed the teachers rated their interest in science and their up-to-date content knowledge as moderate, their confidence in teaching science as low to moderate and their pedagogical repertoire for teaching science (pedagogical content knowledge, or how to teach science) as low (with one teacher as moderate). Shown graphically (even given the small sample), there is a decline from interest level (which is still only moderate) to pedagogical repertoire or the specific tools to teach science, which is low, in line with the research of Appleton (2002 Appleton ( , 2003 and Palmer (2006) , who identify pedagogical content knowledge as the area of greatest need in improving primary school science teaching. It is not surprising that c science are low, also, given the repertoire-without the content knowledge and pedagogies, it is understandably difficult to feel confident. All teachers surveyed said that they coordinator, who was often responsible for dedicated science teaching as well. The role of the coordinator was seen to be to and organise professional learning, community and to model science teaching practice. a 'specialisation', requiring a specifically all the teachers in the sample approved of the science curriculum by the specialist teacher science teaching. She wondered confidence in relation to teaching science the specialist teacher to take responsibility for A question asked if teachers thought that science curriculum. Despite being content with science teachers believed science should be integrated, and could not be a 'stand alone' subject. The teachers commented:"}, {"section_title": "My program is integrated across the curriculum, not stand alone All science planning is integrated Nothing is stand alone; High degree of integration and relevance to the world around our students Stand alone...hah", "text": "So, on the one hand, the teacher researcher support for specialist teacher science teaching, and on the other that it should be 'integrated' across the curriculum by classroom teachers. contradictory.\nQuestions in the survey that sought information on the t revealed levels consistent with national indications of low percentages (Hackling, et al., 2007) , with 6 teachers indicating they taught less than 2 hours/week (there were two 'no responses' to this question, however 1-3 (there was one 'no response resources, these are low numbers, and indicate that often the one 'specialist' lesson per week is all the dedicated science learning time that occurs, although one respondent indicated that "}, {"section_title": "Australian Journal of Teacher Education", "text": "It is not surprising that confidence levels (self-efficacy beliefs) to teach the relatively low ratings for content knowledge without the content knowledge and pedagogies, it is understandably difficult to said that they worked in a context where there was a science responsible for dedicated science teaching as well. The role of the coordinator was seen to be to provide science information to the staff, to organise professional learning, to raise the profile of science in the school and its community and to model science teaching practice. The participating teachers saw science as a 'specialisation', requiring a specifically-skilled teacher. The teacher researcher noted that approved of the programming and teaching of specialist teacher, which reduced their requirement to engage with She wondered whether this meant there was an issue with confidence in relation to teaching science, or whether it was simply more convenient to allow the specialist teacher to take responsibility for much of the science curriculum question asked if teachers thought that science should be 'integrated' in the primary curriculum. Despite being content with science often being taught by a specialist, all the teachers believed science should be integrated, and could not be a 'stand alone' subject. The is integrated across the curriculum, not stand alone; All science planning is integrated; High degree of integration and relevance to the world around our students the teacher researcher was finding that there was a high degree of support for specialist teacher science teaching, and on the other that it should be 'integrated' across the curriculum by classroom teachers. She noted that the teachers did not see this as tions in the survey that sought information on the time spent teaching science revealed levels consistent with national indications of low percentages of teaching time , with 6 teachers indicating they taught less than 2 hours/week (there to this question, however), and the number of lessons rang no response'). In schools with specialist science teachers , these are low numbers, and indicate that often the one 'specialist' lesson per week ience learning time that occurs, although one respondent indicated that The participating teachers saw science as earcher noted that of much of the , which reduced their requirement to engage with with lack of self-, or whether it was simply more convenient to allow curriculum. should be 'integrated' in the primary being taught by a specialist, all the teachers believed science should be integrated, and could not be a 'stand alone' subject. The High degree of integration and relevance to the world around our students; and was finding that there was a high degree of support for specialist teacher science teaching, and on the other that it should be 'integrated' She noted that the teachers did not see this as ime spent teaching science of teaching time , with 6 teachers indicating they taught less than 2 hours/week (there ), and the number of lessons ranging from science teachers and adequate , these are low numbers, and indicate that often the one 'specialist' lesson per week ience learning time that occurs, although one respondent indicated that\nIn the second section of the survey, questions were expressed as statements about teaching science (similar to the Riggs and Enochs (1990) science efficacy belief instrument), which the respondents rated on a 4-point Likert scale (strongly disagree, disagree, agree, Numbers of responses for each of these ratings are indicated in the charts below (note that some teachers did not rate each statement). The teachers generally look forward to teaching science, wanted to see their students enjoying science and felt rewarded when they did so, were think science effects them, would like to more knowledgable as science teachers and generally got a buzz out of science and its discovery aspect. learning that is happening in their classes was related to feelings of modesty and lack of confidence in their science teaching whether having systems in place for sharing science lea attitude.\nIt is interesting that the most highly rated items engagement with science, getting a buzz out of seeing them discover things in science, and being excited about teaching the science of a current event generally look forward to teaching science, wanted to see their students enjoying science and felt rewarded when they did so, were thinking about how teaching ffects them, would like to more knowledgable as science teachers and generally got a buzz out of science and its discovery aspect. They would prefer not to share the science t is happening in their classes with others. The teacher-researcher was related to feelings of modesty and lack of confidence in their science teaching place for sharing science learning and outomes that the most highly rated items were teachers enjoying their students with science, getting a buzz out of seeing them discover things in science, and being excited about teaching the science of a current event. These rankings indicate that generally look forward to teaching science, wanted to see their students ing about how teaching ffects them, would like to more knowledgable as science teachers and generally got would prefer not to share the science researcher wondered if this was related to feelings of modesty and lack of confidence in their science teaching, and ing and outomes would change this enjoying their students' with science, getting a buzz out of seeing them discover things in science, and . These rankings indicate that the Agree teachers really are concerned about what happens for the students in their classes, and that they value engaged science learning for their students, which has spin-off benefits for their own wellbeing. The graphs for 'dreading' a science lesson and 'looking forward' to one are identical, with responses spread evenly across strongly disagree, disagree and agree. When considering how these responses translate to positive feelings about teaching science (strongly disagree and disagree for the 'dread' question, and strongly agree and agree for the 'look forward' question), the balance tips slightly negatively, which means that fears about science teaching are evident, and might be a focus to address in considering professional learning and teacher support.\nMore teachers indicated that they were not interested in reading about science (four) than were interested (two), even though half the sample said they either belonged to a science teachers' professional association or read about science for pleasure. This response would need to be considered in light of professional learning for science, in terms of how much reading teachers would be likely to do.\nThere is a need to make it possible for teachers to achieve success in teaching science, to enhance their self confidence and sense of wellbeing, as indicated by their desire tofeel good after teaching a science lesson.\nThe teacher-researcher felt that there were more positives than negatives from the satisfaction section of the survey, as she illustrated in the graphic below:\n-ve +ve Two final questions in the survey asked teachers to add up to three statements of their own that described how they felt about teaching science, and to rate these, commenting on overall levels of satisfaction. Of the eight suggestions, two are focused on teacher skills and the need for improvement of these to improve teacher self-confidence; two relate to 'resource' issues-the science room and preparation time-as being inadequate and needing improvement; two address the positive outcomes for students of learning science and the spin-off benefits of these for teachers; one addresses an attitude to science learning (science is for nerds-rated strongly disagree), suggesting that this teacher felt the need to identify that science was not only for the 'nerdy' kids, but for all students; and the last one suggesting that science teaching and learning is more appropriately located in secondary school-which may be a way of abrogating responsibility for teaching science, or be the presentation of a realistic view of what actually happens in the world of this teacher. These teachers are concerned, therefore, both with opportunities for valuable science learning for their students and their own selfefficacy as teachers of science, as important co-contributing factors to improvement of science learning outcomes.\nThe There is evidence in these responses of teachers' raised consciousness about themselves as science teachers, and about thinking about science teaching and its particular needs, as a subject with its particular literacy demands, as something they are responsible for teaching, and as effecting their wellbeing. Two of the responses note 'recent' or 'reviewed' thinking about science teaching, which allows for identification of their targeted needs, to lead to better science literacy and learning outcomes, and better engagement and confidence of the teachers. Involvement in this process of considering themselves as science teachers and rating their wellbeing has also been beneficial in identifying that self-efficacy and wellbeing are important considerations in maintaining the 'durability' of teachers' wellbeing, in line with findings of Palmer (2006 Post project interviews and responding to the findings After the survey was conducted, and the other school projects on science literacies were completed in the school, the teacher researcher conducted post-project interviews with the participating teachers. The other projects in the suite of research activities had revealed increased teacher satisfaction when explicit scientific language and scientific genres had been taught -in the sense of developing disciplinary literacy requirements for 'science literacy', rather than a more generalised view of improving science literacy (see earlier discussion), and was concerned to uncover some of the teachers' thinking about their involvement in the project overall and how targeted interventions could assist with improved feelings of wellbeing. In the interviews, she asked the other teachers about their participation in the wider project, and whether it had changed their perceptions of themselves as science teachers, their satisfaction levels as teachers of science and their understanding of science literacies. She noted that the teachers all reported improved levels of satisfaction, which they attributed to collaborative involvement in the project and thinking about what and how they teach science, how they engage with the specific literacies of science and explicitly plan to teach these, and how they engaged in gathering and sharing evidence of change in both their students' performance and how they think about themselves as teachers of science. All reported on the value of being involved in what she termed 'active and generous' learning communities, where they were part of learning teams within schools and the local district, and were able to enjoy and learn from dialogues with colleagues. They also all claimed that they could either already see, or could see the potential for improved student learning outcomes as a result of this collaboration and the reflexive praxis it generated. The teachers who were in the local hub group, but not in the school where the larger science literacies project was being conducted, were keen to take up teaching interventions and inquiry suggestions of those who had been involved in the school project, especially in relation to introducing science literacies such as explicitly teaching of scientific technical language and the genres of science, and through recognising the impact on their own wellbeing of better engagement in teaching science.\nThe teacher researcher felt that the positive outcomes for all the teachers involved, and the benefits that had arisen from being part of a focused learning community, warranted dissemination of this model to other teachers and teaching contexts, and further development within the existing communities."}, {"section_title": "Content knowledge", "text": ""}, {"section_title": "Confidence", "text": "Pedagogical repertoire science questions come up in class discussions throughout the week, and are given attention as they arise. It is possible, therefore, that more incidental time is spent on science than has been reported, but this is unlikely to adequately cover the demands of the science curriculum for the middle years, as expressed in the Australian curriculum, for example; and nor is it being 'named' as science, so that learners understand it as a specific discipline with its own knowledge, methods and learning requirements. In response to the question about dedicated discussion of science at school, respondents stated that science is included in staff meeting agendas up to twice a term, and all respondents indicated that they would like more opportunities to discuss science. This desire for more discussion opportunities is important in considering the literacy demands of science teaching and ways to support teachers to understand and become more familiar with these literacy practices. The surveyed teachers nominated preferred ways to engage with science teaching discussion as dedicated professional learning (6 instances), in small group discussions (4 instances) and through joining online discussion forums (4 instances). No teacher selected 'through professional organisations' (such as the science teacher association).\nTeacher preferences point to the need for more opportunities to engage with each other in dedicated science teaching professional learning (for science teaching discussion), to improve their science literacy and content skills, and to build confidence to teach science. Teachers' identification with a range of specific literacy demands of science, including understanding that the literacy demands of science differed from other subjects including English, and that dedicated skills and genres of writing for science (procedures, reports, explanations, graphs and tables, for example) indicated that more attention and more focused professional learning was needed, so that teachers could confidently teach them to their students.\nIn relation to the use of information and communication technologies (ICTs) with science, all but one teacher said they integrated ICTs into their teaching, and identified that they used online science teaching resources, IWB/smart board presentations, live online research and video clips for demonstrations. However, all believed that ICTs could be improved or increased in science lessons. The biggest obstacles identified to this occurring were the blocking of sites by the education department (even for teacher access), lack of specialist training on specific sites and resources, limited access to computers for all (and these were not always working), low download limits and slow internet speeds. Though these are common complaints across schools for all curriculum areas, the case for improved access to ICTs for science was identified by the teacher researchers as being imperative, and therefore the need urgent, so as not to deter teachers from teaching science and to facilitate productive science learning outcomes for students. Additional comments from the teacher respondents, in the final question on the first part of the questionnaire about themselves as science teachers, included the following:\nI The comments confirmed the teacher researcher's view that there were low levels of confidence and self-efficacy in relation to teaching science in this group of teachers, interestingly expressed as a sense of 'inauthenticity' and falling into 'old' (and perceived as negative) habits. She interpreted the comments as indicating an urgent need to address these feelings of inadequacy, and to explore ways to provide teachers with opportunities to address their particular areas of need, in collaboration with other teachers."}, {"section_title": "Part B: Personal satisfaction", "text": "In the second section of the survey, q teaching science (similar to the Riggs and Enochs which the respondents rated on a strongly agree). Numbers of responses for each of these ratings are indicated in the charts below (note that some teachers did not "}, {"section_title": "Number of responses", "text": ""}, {"section_title": "Actions", "text": "Four ways to continue the work on improving middle school science teacher wellbeing were suggested by the teacher researcher, from discussion with the group of teachers involved and review of the survey results and interviews. Her suggestions were:\n• The Teacher researcher saw this last suggestion as the new and different approach for the group, and a positive way to be able to counter negative perceptions about science teaching, better equip teachers in both science content and pedagogical content knowledge (without onerous reading and time commitments), and to engage with and share science activities that 'work' (Appleton, 2002 (Appleton, , 2003 ."}, {"section_title": "Wider implications of the teacher researcher's project and findings", "text": "The survey used in the project is a tool that could be more widely used in individual schools or hubs. It has the potential to raise awareness of primary school teachers' feelings about themselves as teachers of science, and to indicate that there is widespread evidence of notions of ineffectiveness, with consequent wellbeing issues (Appleton, 2002; Palmer, 2006) . It might also allow for gaining an understanding of the feelings and particular issues for teachers in the school, so that these might begin to be addressed in school planning, especially in the way support is offered to teachers, and how they might connect with each other.\nFor pre-service teachers, in science 'method' programs, the survey has the potential to draw attention to the issue of self-efficacy, so that awareness can lead to attending to gaps, and to providing the kinds of pedagogical content knowledge and science literacy skills that will be useful for these teachers, as outlined by Palmer (2006) , in his study of pre-and newly in-service teachers.\nThe 'generous and supportive learning community' that the teacher in this project was keen to promote is not a new idea, but can be seen in this project to indicate how teachers working collaboratively with each other and with supportive academic researchers feel more satisfied with themselves as teachers through the capacity to share their work and thinking, using others as sounding boards, for affirmation, for contribution of ideas and for development and refinement of programs. The collaborative process can be used a model for other schools and pre-service programs, so that varied ways are offered to teachers and preservice teachers to attend to issues of wellbeing and self-confidence, leading to improved learning outcomes for students and sustainability of the primary school teaching workforce.\nWhile the study described here is small, and the data have a number of gaps in responses, it nonetheless points to a way of thinking about the ongoing wellbeing and sustainability of primary teachers facing new demands in teaching across the curriculum, and new literacy demands in the curriculum areas; and can be an adjunct to other programs and ideas in improving science teaching and teachers' feelings of wellbeing about themselves, in the context of the introduction of the new curriculum, and other changing circumstances in schools. Changes to practice must necessarily take account of the contexts of teachers' work, what they do and think and what ongoing collaborative research of this kind reveals (Appleton, 2006) . The learning that occurred for all participants, in a research context of shared discussions, planning and reflection on practice, considered within the overarching concern for teacher wellbeing, has allowed for honest and personal responses, described here so that others might see collaborative work of this kind as a way forward in navigating the challenging demands of teachers' work."}]