[{"section_title": "Introduction", "text": "[2] The Mixed Layer (ML) is one of the most recurrent features of the ocean and its variability strongly influences the upper ocean physics [Pickard and Emery, 1990]. It is also where major biological and chemical processes occur, which have a strong influence on the Earth's climate [Falkowski et al., 1998]. Various attempts to produce a global scale estimation of the Mixed Layer Depth (MLD) have been repeatedly [Kara et al., 2003;Levitus, 1982;Monterey and Levitus, 1997], underlining some difficulties in establishing an objective and global criterion for defining the MLD adequately. [3] Recently, de Boyer Montegut et al. [2004] (hereinafter referred to as dBM04) described the global MLD variability with a previously unmatched richness of details, by means of a new 2°resolution MLD climatology based on individual profile estimates. The MLD was obtained with a criterion based on temperature only, allowing exploitation of the large amount of available temperature profiles (10 times more then the salinity profiles) and hence, producing climatological monthly gridded maps without large gaps due to the lack of salinity data. [4] Although the Mediterranean is one of the most studied oceans of the world [Williams, 1998], a climatological basin scale study of the MLD is lacking. Indeed, the basin requires particular attention due to its peculiarities. The circulation is characterized by the presence of sub-basin gyres, intense mesoscale activity and a strong seasonal variability related to highly variable atmospheric forcing strongly affected by orographic constraints [Malanotte-Rizzoli et al., 1997;Millot, 1999]. The main effect is high variability at relatively small scales in the upper layers, which calls for an accurate and specific utilization of the available data."}, {"section_title": "Data and Method", "text": "[5] The primary source of data for this study was the MEDAR/MEDATLAS project [Fichaut et al., 2002], which comprises also data from the World Ocean Database 2001 [Conkright et al., 2002]. Additional profiles were obtained from the Mediterranean Forecasting System Toward Environmental Prediction [Pinardi et al., 2003] data bases, and from seven cruises conducted by the authors. Finally, 252,961 profiles were collected, including data from 1940 to 2004, and comprising mechanical bathythermograph, expandable bathythermograph and conductivity-temperature-depth data (39.8%, 45,7% and 14,5% of the total respectively). Following dBM04, MLD was calculated from each single profile using a DT = 0.2°C criterion. In addition, a density criterion with a threshold value Ds q corresponding to a fixed DT = 0.2°C, was also used [Levitus, 1982, see also dBM04, equation in section 4.3] to compute MLD from salinitytemperature profiles. Duplicates were eliminated and the quality control described by dBM04 was applied, allowing 237,681 and 32,604 estimates of the MLD in the Mediterranean for each criterion. [6] The MLD estimates derived from the temperature criterion were then binned in boxes of 0.5°latitude by 0.5°longitude. For each box and for each climatological month, the median was calculated when 3 or more values were present. With respect to dBM04, the number of MLD estimations left no significant gaps in the MLD field, thus avoiding the need for interpolation of the maps on missing data. A smoothing, based on a nearest neighborhood algorithm on a 1.5°Â 1.5°box) was applied to eliminate some low-level noise."}, {"section_title": "The Mediterranean MLD Variability", "text": "[7] Figure 1 presents the monthly climatology of the Mediterranean MLD obtained from the analysis of individual in situ profiles using a DT criterion. Remarkable features are as follows: [8] 1. The Mediterranean MLD seasonal variability is characterized by a basin scale deepening from November to February -March and an abrupt restratification in April, which is maintained throughout the summer and early autumn. The station DYFAMED (Ligurian Sea) offers the possibility to verify the MLD seasonal variability in at least one particular location [Marty et al., 2002]. At DYFAMED, the maximum deepening of the ML and the beginning of the vertical mixing in the surface layer occur respectively in January -February and in November. Therefore, the seasonal cycle obtained from the presented climatology results in very good agreement with the DYFAMED observations. [9] 2. The Eastern Mediterranean (EMED) displays MLD values generally higher than the Western basin (WMED), with the important exception of the Gulf of Lions region. This is mainly due to the permanent or quasi permanent features observed in the oriental basin [Malanotte-Rizzoli et al., 1997]. A local maximum in the Rhodes gyre area ($28°E 35°N) is visible only in January [Napolitano et al., 2000]  is observed in March to the south of Cyprus ($33°E 33°N), where an eddy was recurrently observed and presumed to be permanent [Kress and Herut, 2001]. Similarly, in the Ionian Sea, southeast of the Italian peninsula, a 100 -150 meter patch in the MLD is observed in the February map, in agreement with the results of Hopkins [1978] describing a permanent cyclone in this region and a deepening of the MLD. [10] 3. The maximum values of the MLD are observed in February and in February -March for the Gulf of Lions ($5°E 42°N) and the Southern Adriatic Sea ($18°E 42°N), respectively, which are regions of Deep Water Formation (DWF) through deep convection processes [Artegiani et al., 1997;Mertens and Schott, 1998]. The identification of these regions represents a successful test for the methodology although the climatological MLD may underestimate the actual values, which are known to be occasionally deeper. [11] Maps of the percent median deviation (a dev defined jMLD i À MLD median j, see dBM04) were calculated on a monthly basis to evaluate the spreading of the MLD estimations in each mesh box (Figure 4 1 ). The a dev values are generally below 40% for most of the basin and most of the year, without evident regional patterns. However in winter and partially in spring (April), the a dev values increase strongly throughout the whole basin, reaching the maximum values in the Gulf of Lions area ($300%). DWF regions are the most variable, because of the irregular intensity and occurrence of the DWF process. High values of a dev are also found along the most relevant frontal regions of the basin (i.e. in the Ionian Sea along the 35°N parallel and in the North WMED along the 38°N parallel between the Balearic Islands and Sardinia). In these areas, the mesoscale activity associated with the fronts, as well as the variability of the fronts themselves, produce strongly variable MLD intra box estimations, which result in high a dev values."}, {"section_title": "Comparison With Density-Based Estimates:", "text": "The Role of Salinity [12] In many regions, the base of the mixed layer is defined by vertical temperature and salinity gradients occurring at the same depth. In these conditions, thermocline, halocline and picnocline coincide, resulting in a similar estimation of the MLD, regardless of the selected criterion (temperature or density). However, under particular conditions, temperature and salinity variations may be decoupled, producing differences in the MLD values obtained via the diverse criteria. It is important then to investigate the different effect of salinity and of temperature on the mixed layer depth evaluation. When both salinity and temperature measurements are available for the same profile, the two MLD criteria are then applied and the difference between the estimates (MLD T -MLD s ) is averaged on a seasonal basis and on each 1 degree grid point. The differences were significant only in winter (January, February, March, Figure 2, the other seasons are not shown). Despite the large areas without any information (due to the lack of density profiles), it is possible to sketch out some comments. The temperature based MLD is deeper than the density based MLD mainly in the WMED and in the proximity of the Sicily Strait, whereas in the EMED the two estimates show no relevant differences. The characteristics of the water masses in the two sub basins can explain the observed discrepancies. [13] In the Mediterranean, the surface circulation is strongly affected by water of Atlantic origin, which flows eastward driven by the thermohaline circulation [Robinson and Golnaraghi, 1995]. Along the pathway, mixing occurs, caused by the strong air-sea interactions or by straits constraint. On the temperature and salinity fields respectively, the diverse effects of mixing and of the subsequent restratification could result in a decoupling of the two variables, which in turn may lead to a difference in the MLD estimates. In the WMED, the presence of strong horizontal gradients in salinity produces important varia-tions in density, with a consequent shoaling of the MLD. Since the WMED surface waters are strongly vertically thermally homogeneous, the temperature based MLD estimation often results in deeper estimations than the density based criteria. Such an effect is not present in the EMED, where salinity and temperature act together on density variation, resulting in similar MLD values, regardless of the chosen criterion. Remarkably, the whole Aegean Sea is characterized by density-compensated profiles, an oceanic feature that importance has only recently been acknowledged [Kara et al., 2003]. Analysis of individual profiles revealed that temperature and salinity gradients have compensating effects on density, resulting in a density ratio surprisingly close to 1 (see dBM04, Figure 10a, and text therein for a discussion). Figure 3 shows some profiles illustrating these cases. In the first example (Figure 3 (left)), the strong vertical homogeneity of the temperature profile, which is a characteristic of the North WMED area, prevents a correct identification of the ''true'' ML with the temperature based criteria. In addition, a low surface stratification around 0.1°C is also present in the profile, which may be due to diurnal variability (the hour of the measurements was 16 pm) and is therefore not taken into account in the definition of our seasonal varying mixed layer depth. The ''real'' ML is determined by a salinity gradient closer to the surface by about 40 meters, which is well captured by the density based criteria. In the central panel, an example of a ''double'' ML is displayed, probably derived by an intrusion or a subduction of a different water mass below the actual ML. Once again, the temperature criterion is not able to identify the first ML, the difference in temperature being too small there with respect to the selected DT. Finally, in the right panel, an Aegean Sea profile is depicted, illustrating the compensation mechanism (described in dBM04), which induces a wrong estimate in the density based approach in the MLD identification. [14] The temperature based criterion results appear to be less suitable to identify the MLD during the winter WMED conditions. However: [15] 1. The differences between the MLD obtained with the two selected criteria are on average $10 meters and rarely exceed 40 meters, resulting then below 20% of the MLD values (see Figure 2). [16] 2. The most relevant differences between the temperature and the density criteria occur mainly where the a dev is elevated (compare Figure 2 with Figure 4). Subsequently, the intra-box and the interannual variability encompass the differences between the diverse criteria,  suggesting the use of a statistically robust criterion (i.e. including as many different situations as possible). [17] In summary, it is evident that the temperature based criterion is not able to account for all the Mediterranean conditions which can influence the MLD variability. This is particularly true for the winter North WMED, where very specific oceanic conditions occur. Nevertheless, using the temperature based criterion, the high number of temperature profiles allows to create a robust MLD variability statistics, which is not possible to obtain using the density profiles only, and then to compensate the occasionally less accurate estimations of the MLD actual values."}, {"section_title": "Conclusion", "text": "[18] A new MLD climatology in the Mediterranean allowed a first synoptic description of the basin-scale ML variability to be illustrated. A recently developed approach to estimate the oceanic MLD was applied on a comprehensive Mediterranean in situ data base, containing more than 200.000 profiles from various sources. The data quality control and the applied methodology (described in dBM04) were specifically developed for ML studies. [19] With respect to dBM04, the present approach displayed two main differences. Firstly, the resolution of the final maps was finer (0.5 degree) and permitted a more detailed description of the specific Mediterranean features. Secondly, the absence of interpolation procedures was possible thanks to the large amount of data used. Even if some gaps were still present, it was preferred to keep the retrieved fields unchanged. This is a major issue to avoid any spatial interpolation or reconstruction of missing values and/or misinterpretations. [20] The identification of most of the relevant features of the basin, and in particular the DWF sites, demonstrated the accuracy of the method even for a regional sea with weak and small scale gradients. Finally, the proposed MLD climatology represents a suitable alternative to the existing atlas, especially for studies focusing on the vertical rather than horizontal dynamics. The climatology is available from the first author on request."}]